#include <map>
#include <string>
class Bible35
{
	struct uk1	{ int val; const char *msg; };
	struct uk2	{ int val; const char *msg; };
	struct uk3	{ int val; const char *msg; };
public:
static void view1() {
struct uk1 poems[] = {
	{1, "1 Пророцтво, яке бачив пророк Авакум."},
	{2, "2 Аж доки я, Господи, кликати буду, а Ти не почуєш? До тебе я кличу: Насильство! та Ти не спасаєш!"},
	{3, "3 Для чого неправість мені Ти показуєш та позираєш на муку? А передо мною грабіж та насильство, і суперечка стається, і носиться сварка."},
	{4, "4 Тому то Закон припиняється, і не виходить до чину назавсіди право, бо несправедливий вигублює праведного, тому правосуддя виходить покривленим."},
	{5, "5 Пригляньтеся ви до народів, і дивіться, і дуже здивуйтесь, бо вчиню Я за ваших днів діло, про яке не повірите ви, коли буде розказане."},
	{6, "6 Бо оце Я поставлю халдеїв, народ лютий та скорий, що ґрасує по широкій землі, щоб захопити оселі, які не його."},
	{7, "7 Страшний та грізний він, від нього самого виходить і право його, і великість його."},
	{8, "8 І від пантер його коні швидші, і від вовків вечерових лютіші. розлетяться його верхівці, а їздці його здалека прийдуть, вони будуть летіти, неначе орел, що на їжу поспішає."},
	{9, "9 Він приходить увесь на насильство, а ціль їх обличчя вперед, і набере полонених, як того піску."},
	{10, "10 І він глузує з царів, а князі сміх для нього. Він сміється з твердині усякої, бо на вал насипає землі, і її здобуває!"},
	{11, "11 Тоді він несеться, як вітер, і перейде, і згрішить, бо зробить за бога свого оцю силу свою."},
	{12, "12 Хіба ж Ти не віддавна, о Господи? Боже Ти мій, мій Святий, не помремо! Господи, Ти для суду поставив його, і, о Скеле, призначив його на карання!"},
	{13, "13 Твої очі занадто пречисті, щоб міг Ти дивитись на зло, і на насильство дивитись не можеш. Чому ж дивишся Ти на грабіжників, мовчиш, коли несправедливий винищує справедливішого від себе?"},
	{14, "14 Ти ж маєш людей, як у морі тих риб, немов ту черву, що пана над нею нема."},
	{15, "15 Усе це грабіжник витягує вудкою, своїм неводом тягне оце, та збирає оце в свою сітку, тому тішиться він та радіє."},
	{16, "16 Тому жертву приносить він неводові, і кадить для сітки своєї, бо від них ситий уділ його та добірна пожива його!"},
	{17, "17 Чи на це випорожнює він свого невода, і завжди готов убивати народи без милости?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct uk2 poems[] = {
	{1, "1 Нехай я стою на сторожі своїй, і нехай на облозі я стану, і хай виглядаю, щоб бачити, що він буде казати мені, і що відповість на жалобу мою."},
	{2, "2 А Господь відповів та й сказав: Напиши це видіння і поясни на таблицях, щоб читач його легко читав."},
	{3, "3 Бо ще на умовлений час це видіння, і приспішає кінець, і не обмане. Якщо б протягнулось, чекай ти його, бо воно конче прийде, не спізниться."},
	{4, "4 Ось надута, не проста душа його в ньому, а праведний житиме вірою своєю."},
	{5, "5 І що ж, як зрадливе вино, так горда людина спокою не знає: він роззявлює пащу свою, як шеол, і не насичується, як та смерть, і всіх людей він до себе збирає, і всі народи до себе згромаджує."},
	{6, "6 Чи ж усі вони не складуть приповістки на нього та загадки насмішливої йому не прокажуть: Горе тому, хто для себе розмножує те, що не його! Аж доки це буде? Горе тому, хто чинить тяжкою заставу на себе!"},
	{7, "7 Хіба нагло не встануть оті, хто тебе буде гризти, і збудяться ті, хто тебе попихає, і за здобич ти станеш для них?"},
	{8, "8 За те, що ти грабував був багато народів, вся решта народів тебе пограбує за ту людську кров, і за насильство над краєм, над містом та над усіма, хто мешкає в ньому."},
	{9, "9 Горе тому, хто неправедний зиск побирає для дому свого, щоб покласти гніздо своє на висоті, і тим із рук злого врятованим бути!"},
	{10, "10 Нарадив ти сором для дому свого, щоб кінець учинити численним народам, і ти прогрішився за душу свою."},
	{11, "11 Бо камінь з стіни буде кликати, і йому відповість сволок із дерева."},
	{12, "12 Горе тому, хто кров'ю місто будує, хто беззаконням встановлює город!"},
	{13, "13 Чи ж оце не від Господа Саваота, що народи трудяться для огню, і мучаться люди на марність?"},
	{14, "14 Бо пізнанням Господньої слави наповнена буде земля, як море вода покриває."},
	{15, "15 Горе тому, хто свого ближнього напоює з келіху гніву свого, і поїть, щоб бачити сором його!"},
	{16, "16 Ти наситишся ганьбою більше, як славою. Пий також ти, та показуй свій сором! На тебе обернеться келіх правиці Господньої, ганьба ж на славу твою!"},
	{17, "17 Бо насилля твоє над Ліваном на тебе спаде, а грабунок худоби зламає тебе за кров людську, та за насилля над краєм, над містом та над усіма, хто мешкає в ньому."},
	{18, "18 Який дасть пожиток бовван, що його вирізьбив творець його, і відлив, і вчитель неправди, що творець його мав охоту чинити богів цих німих?"},
	{19, "19 Горе тому, хто дереву каже: Збудись, мовчазливому каменю: Зрушся! Чи він буде навчати? Ось він сріблом та золотом викладений, але жодного духу в ньому нема!"},
	{20, "20 А Господь у Своїм храмі святім, мовчи перед обличчям Його, уся земле!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct uk3 poems[] = {
	{1, "1 Молитва пророка Авакума, для співу на струнному приладі:"},
	{2, "2 Господи, звістку Твою я почув та й злякався! Господи, оживи Своє діло в середині років, у середині літ об'яви, у гніві про милість згадай!"},
	{3, "3 Бог іде від Теману, і Святий від Парану гори. Села. Велич Його вкрила небо, і слави Його стала повна земля!"},
	{4, "4 А сяйво було, наче соняшне світло, проміння при боці у Нього, і там укриття Його потуги."},
	{5, "5 Перед обличчям Його моровиця іде, а по стопах Його пнеться полум'я."},
	{6, "6 Став, і землю Він зміряв, поглянув і народи затряс, і попадали гори довічні, вікові похилились узгір'я. Путі Його вічні."},
	{7, "7 Я бачив намети Кушана під кривдою, тремтять покривала мідіянського краю."},
	{8, "8 Чи на ріки, о Господи, Ти запалав, чи на ріки Твій гнів? Чи Твоє пересердя на море, що їздиш на конях Своїх, на спасенних Своїх колесницях?"},
	{9, "9 Лук твій голий, нагий, наповнений стріл сагайдак. Села. Ти річками землю розсік."},
	{10, "10 Тебе вгледівши, гори дрижали, водяна течія потекла, безодня свій голос дала, зняла високо руки свої."},
	{11, "11 Сонце й місяць спинилися в мешканні своєму при світлі Твоїх стріл, що літають при сяйві блискучого списа Твого."},
	{12, "12 У люті ступав Ти землею, у гніві людей молотив."},
	{13, "13 Ти вийшов спасти Свій народ, спасти Помазанця Свого. Ти з дому безбожного голову збив, обнажив Ти основу по шию. Села."},
	{14, "14 Ти пробив його списами голову князя його, як вони піднялись, щоб мене розпорошити; вони тішилися, немов мали пожерти таємно убогого."},
	{15, "15 Ти кіньми Своїми по морю топтав, по водній великій громаді."},
	{16, "16 Я почув і затремтіла утроба моя, задзвеніли на голос цей губи мої, гнилизна ввійшла в мої кості, і тремчу я на місці своїм, бо маю чекати в спокої день утиску, коли прийде народ, який має на вас наступати."},
	{17, "17 Коли б фіґове дерево не зацвіло, і не було б урожаю в виноградниках, обманило зайняття оливкою, а поле їжі не вродило б, позникала отара з кошари і не стало б в оборах худоби,"},
	{18, "18 то я Господом тішитись буду й тоді, радітиму Богом спасіння свого!"},
	{19, "19 Бог Господь моя сила, і чинить Він ноги мої, як у лані, і водить мене по висотах! Для дириґента хору на моїх струнних знаряддях."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};