#include <map>
#include <string>
class Bible28
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
	struct ka6	{ int val; const char *msg; };
	struct ka7	{ int val; const char *msg; };
	struct ka8	{ int val; const char *msg; };
	struct ka9	{ int val; const char *msg; };
	struct ka10	{ int val; const char *msg; };
	struct ka11	{ int val; const char *msg; };
	struct ka12	{ int val; const char *msg; };
	struct ka13	{ int val; const char *msg; };
	struct ka14	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 უფლის სიტყვა, რომელიც იყო ოსიას მიმართ, ბეერის ძისა, იუდას მეფეების - ყუზიას, იოთამის, ახაზის და იეხიზკიას დროს და ისრაელის მეფის იერობოამ იოაშის ძის დროს. "},
	{2, "2 როცა იწყო უფალმა ქადაგება ოსიას პირით, უთხრა ოსიას: წადი, მოიყვანე გარყვნილი ქალი და გააჩინე გარყვნილების შვილები, რადგან გაირყვნა ქვეყანა და განუდგა უფალს. "},
	{3, "3 წავიდა და მოიყვანა გომერი, დიბლაიმის ასული; დაორსულდა ქალი და უშვა ვაჟი. "},
	{4, "4 უთხრა უფალმა: დაარქვი სახელად იზრეყელი, რადგან, ცოტაც და, უნდა მოვკითხო იზრეყელის სისხლი იეჰუს სახლს და გავაუქმო ისრაელის მეფობა. "},
	{5, "5 იმ დღეს იქნება, რომ შევმუსრავ ისრაელის მშვილდს იზრეყელის ველზე. "},
	{6, "6 კვლავ დაორსულდა ქალი და შვა ასული. უთხრა უფალმა: დაარქვი სახელად ლორუხამა (არშესაწყალისი), რადგან აღარ შევიწყალებ ისრაელას სახლს და არასოდეს შევუნდობ. "},
	{7, "7 იუდას სახლს კი შევიწყალებ და ვიხსნი უფლის, მათი ღმერთის ხელით; არც მშვილდით, არც მახვილით, რც ბრძოლით, არც მხედრებით არ ვიხსნი მათ. "},
	{8, "8 მოსხლიტა ძუძუს ლორუხამა და ისევ დაორსულდა და შვა ვაჟი. "},
	{9, "9 თქვა უფალმა: დაარქვი სახელად ლოყამი (არა ჩემი ერი). რადგან აღარ ხართ ჩემი ერი და მეც აღარ ვიქნები თქვენი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 ზღვის ქვიშასავით იქნება ისრაელიანთა რიცხვი, რომელიც არც გაიზომება და არც აღირიცხება; და ნაცვლად იმისა, რომ უთხრან ლოყამი ხართო, ეტყვიან ცოცხალი ღმერთის შვილები ხართო. "},
	{2, "2 შეიყრებიან ერთად იუდაელები და ისრაელიანები და დაისვამენ ერთ მთავარს და გამოვლვნ ქვეყნიდან, რადან დიდი იქნება იზრეყელის დღე. "},
	{3, "3 დაუძახეთ თქვენს ძმებს: ყამი (ჩემი ერი) და თქვენს დებს: რუხამა (შეწყალებული). "},
	{4, "4 უჩივლეთ დედათქვენს, უჩივლეთ, რადგან აღარ არის ის ჩემი ცოლი და მეც აღარ ვარ მისი ქმარი; ჩამოიცილოს გარყვნილება პირისახიდან და მრუშობა მკერდიდან; "},
	{5, "5 თორემ გავაშიშვლებ და ისე გამოვაჩენ, როგორც დაბადების დღეს იყო. უდაბნოსავით ვაქცევ, უწყლო მიწად გავხდი და წყურვილით მოვკლავ. "},
	{6, "6 არ შევიწყალებ მის შვილებს, რადგან გარყვნილების შვილები არიან; "},
	{7, "7 რადგან გარყვნილებას სჩადიოდა მათი დედა და თავს ირცხვენდა მათი მშობელი; რადგან თქვა: გავეკიდები ჩემს საყვარლებს, რომლებიც მაძლევენ პურსა და წყალს, მატყლსა და სელს, ზეთსა და სასმელსო. "},
	{8, "8 ამიტომ, აჰა, ეკალ-ბარდებით გადავუღობავ გზას და კედელს აღვუმართავ წინ, რომ ვერ გაიგნოს ბილიკები. "},
	{9, "9 გაედევნება თავის საყვარლებს და ვერ დაეწევა; ძებნას დაუწყებს მათ და ვერ იპოვნის; იტყვის: წავალ, დავბრუნდები ჩემს პირველ ქმართან, რადგან მაშინ ახლანდელზე უკეთ ვიყავიო. "},
	{10, "10 მაშინ კი არ იცოდა, რომ მე ვაძლევდი მას პურს, ღვინოს და ზეთს, რომ მე გავუმრავლე ოქრო და ვერცხლი, რომელსაც ბაალს ახარჯავდა. "},
	{11, "11 ამიტომაც უკან წავიღებ ჩემს პურს მის სიმწიფეში და ჩემს ღვინოს მისი დაღვინებისას, წავართმევ ჩემს მატყლსა და სელს, რითაც სიშიშვლე უნდა დაეფარა. "},
	{12, "12 ახალ კი გამოვააშკარავებ მის სირცხვილს მისი საყვარლების თვალწინ და ვერავინ გამომტაცებს ხელიდან. "},
	{13, "13 გავაუქმებ ყველა მის სიხარულს, ზეიმს, ახალმთვარობას, შაბათს და ყველა დღესასწაულს; "},
	{14, "14 გავუჩანაგებ ვაზსა და ლეღვის ხეებს, რომლებზეც ამბობს, ჩემი საჩუქრებია, ჩემმა საყვარლებმა მაჩუქესო; ტყედ ვაქცევ და გარეული მხეცები შეჭამენ მათ. "},
	{15, "15 მას მოვკითხავ ბაალთა დღეებს, როცა გუნდრუკს უკმევდა მათ, და რგოლებითა და სამკაულებით თავს იმშვენებდა; როცა საყვარლებს დასდევდა, მე კი მივიწყებდა, თქვა უფალმა. "},
	{16, "16 ამიტომაც, აჰა, შევიტყუებ და უდაბნოში წავიყვან, რომ გულითადად ველაპარაკო. "},
	{17, "17 იქ მივცემ მას თავის ვენახს და ყაქორის (მწუხარების) ხეობას იმედის კართან; იქ იმღერებს, როგორც ყმაწვილქალობისას მღეროდა, როცა ეგვიპტის ქვეყნიდან ამომყავდა. "},
	{18, "18 იმ დღეს იქნება, თქვა უფალმა, რომ დამიძახებ ჩემო ქმარო - და აღარ დამიძახებ ჩემო ბაალო (ბატონო). "},
	{19, "19 მოვაშორებ მის ბაგეებს ბაალთა სახელებს, რომ აღარ იხსენიებოდნენ თავიანთი სახელებით. "},
	{20, "20 დავდებ იმ დღეს მათთვის აღთქმას ველის მხეცებთან, ცის ფრინველებთან და ქვეწარმავლებთან; მოვსპობ ქვეყანაზე მშვილდს, მახვილს და ომიანობას და მშვიდობით დავავანებ მათ. "},
	{21, "21 და მე საუკუნოდ დაგწინდავ ჩემთვის, დაგწინდავ სიმართლით და სამართლით, წყალობითა და სიყვარულით; "},
	{22, "22 დაგწინდავ რწმენით და შეიცნობ უფალს. "},
	{23, "23 იმ დღეს იქნება, რომ გავეხმიანები, თქვა უფალმა, გავეხმიანები ცას და ისიც გაეხმიანება მიწას; "},
	{24, "24 მიწა გაეხმიანება პურსა და ღვინოს და ზეთს, ხოლო ესენი გაეხმიანებიან იზრეყელს. "},
	{25, "25 და ჩემთვის დავთესავ მას ქვეყანაში და შევიწყალებ ლორუხამას (არაშესაწყალისს), ვეტყვი ლოყამის (არა, ჩემს ერს) ჩემი ერი ხარ-მეთქი და ის მეტყვის, ჩემი ღმერთი ხარო. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 კვლავ მითხრა უფალმა: წადი, შეიყვარე ქმრის საყვარელი ცოლი, მაგრამ მემრუშე; როგორც უფალს უყვარს ისრაელიანები, ისინი კი უცხო ღმერთებისკენ იყურებიან და ყურძნის კვერები უყვართ. "},
	{2, "2 ნაყიდი მყავს ის თხუთმეტ ვერცხლად, ერთ ხომერ ქერად და ერთ ლეთეხ ქერად, "},
	{3, "3 ვეუბნებოდი, დიდხანს დარჩი-მეთქი ჩემთან, ნუ იმრუშებ, სხვისი ნუ გახდები-მეთქი. მეც ასევე მოგექცევი-მეთქი. "},
	{4, "4 რადგან დიდხანს დარჩებიან ისრაელიანები უმეფოდ, უსარდლოდ, უმსხვერპლოდ და უსვეტოდ, უეფოდოდ და უთერაფიმოდ, "},
	{5, "5 მერე მოიქცევიან ისრაელიანები და ძებნას დაუწყებენ უფალს, თავიანთ ღმერთს, და დავითს, თავიანთ მეფეს, და მოწიწებით განიმსჭვალებიან უფლისა და მისი მადლის წინაშე უკანასკნელ დღეებში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 ისმინეთ უფლის სიტყვა, ისრაელიანებო, რადგან დავა აქვს უფალს ქვეყნის მკვიდრებთან; რადგან რ არის ჭეშმარიტება, არც სიქველე, არც ღვთის შემეცნება ქვეყანაზე. "},
	{2, "2 წყევლა და ტყუილი, კაცისკვლა, ქურდობა და მრუშობა გავრცელდა; სისხლის ღვრას სისხლის ღვრა მოსდევს. "},
	{3, "3 ამიტომაც მოთქვამს მიწა, ჩაკვდა მისი ყოველი მკვიდრი ველის მხეცებთან და ცის ფრინველებთან ერთად; ზღვის თევზებიც კი გაუჩინარდნენ. "},
	{4, "4 არავინ იდავოს, არავინ იყოს მამხილებელი, რადგან შენი ერი მღვდელს ედავება. "},
	{5, "5 წაიფორხილებ დღისით და წაიფორხილებს ღამით წინასწარმეტყველიც შენთან ერთად; და მე მოვსპობ დედაშენს. "},
	{6, "6 მოისპობა ჩემი ერი უმეცრების გამო, რადგან შენ უარყავი ღვთის შემეცნება, და მეც გადაგაყენებ ჩემი მღვდლობიდან; დავიწყებული გაქვს ჩემი რჯული და მეც დავივიწყებ შენს შვილებს. "},
	{7, "7 რაც უფრო მრავლდებიან, მით უფრო სცოდავენ ჩემს წინაშე; მათ პატივს სირცხვილად შევცვლი. "},
	{8, "8 ცოდვებით იკვებება ჩემი ერი და უკეთურებისკენ მიუწევთ გული. "},
	{9, "9 მღვდელი და ერი ერთი შეიქნა; მსჯავრს დავდებ მათ მათი გზების გამო და მივაგებ მათ მათი საქმეების გამო. "},
	{10, "10 შეჭამენ და ვერ გაიგებენ გაძღომას, იბოზებენ და ვერ გამრავლდებიან, რადგან დაივიწყეს უფლის სამსახური. "},
	{11, "11 ბოზობამ, ღვინომ და მაჭარმა დაიპყრო მათი გული. "},
	{12, "12 ჩემი ერი ხეზე მკითხაობს და მისი ტოტი უცხდებს მას, რადგან ბოზობის სულმა შეაცდინა ისინი და განუდგნენ თავიანთ ღმერთს. "},
	{13, "13 მთათა მწვერვალებზე სწირავენ მსხვერპლს და გორაკებზე აკმევენ საკმეველს მუხის, ჭადრისა და ტერებინთის ქვეშ, რადგან საამურია მათი ჩრდილი; ამიტომ ბოზობენ შენი ასულები და მრუშობენ შენი რძლები. "},
	{14, "14 როგორ არ მოვკითხო შენს ასულებს, როცა ბოზობენ, და შენს რძლებს, როცა მრუშობენ, რადგან მამაკაცები ბოზ ქალებთან დაეთრევიან და როსკიპებთან ერთად სწირავენ მსხვერპლს; უმეცარი ხალხი კი იღუპება. "},
	{15, "15 თუ შენ ბოზობ, ისრაელო, იუდა მაინც ნუ შესცოდავს; ნუ ივლის გილგალში, ნუ ავა ბეთ-ავენში, ნუ დაიფიცებს: ცოცხალიმც არის უფალიო! "},
	{16, "16 რადგან ჯიუტი ფურივით ჯიუტია ისრაელი; როგორ აძოვოს ახლა ისინი უფალმა, როგორც ცხვარი, ვრცელ საძოვარზე? "},
	{17, "17 შეეკრა კერპებს ეფრემი, დაეხსენი. "},
	{18, "18 გამოუნელდებათ სიმთვრალე და ბოზობას იწყებენ, შეეჩვიენ სირცხვილს მისი მთავრები. "},
	{19, "19 გაახვევს მათ ქარი თავის ფრთებში და მათ შერცხვებათ თავიანთი მსხვერპლისა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 ისმინეთ ეს, მღვდლებო, გაიგონეთ, ისრაელის სახლო, ყურადიღე, მეფის სახლო! რადგან მსჯავრი გადევთ, რადგან მახედ ექციათ მიცფას და თაბორს - მოსროლილ სათხევლად. "},
	{2, "2 თავიანთი მსხვერპლშეწირვებით ცოდვაში ჩაეფლნენ განდგომილნი, მაგრამ ყველას ვასწავლი ჭკუას. "},
	{3, "3 მე ვიცნობ ეფრემს და ვერ დამემალება ისრაელი, რადგან შენ ბოზობ ახლა, ეფრემ, და წაბილწულია ისრაელი. "},
	{4, "4 ჩადენილი საქმეები არ ანებებენ თავიანთი ღმერთისან მიქცევას, რადგან ბოზობის სულია მათ წიაღში და უფალს ვერ ცნობენ. "},
	{5, "5 თავისი სიამპარტავნე ამხილებს ისრაელს; წაიფორხილებენ ისრაელი და ეფრემი თავიანთი ცოდვების გამო, წაიფორხილებს იუდაც მათთან ერთად. "},
	{6, "6 თავიანთ ცხვარ-ძროხასთან ერთად წავლენ უფლის საძიებლად, მაგრამ ვერ იპოვნიან; განერიდა მათ. "},
	{7, "7 უღალატეს უფალს, რადგან უცხოთა შვილებს შობენ; ამიერიდან მახვილი შეჭამს მათ წილხვედრითურთ. "},
	{8, "8 ჩაჰბერეთ ბუკს გიბყაში, საყვირს რამაში, დაეცით ყიჟინა ბეთავენში: მოგყვებით, ბენიამინ! "},
	{9, "9 უდაბნოდ იქცევა ეფრემი განკითხვის დღეს; ისრაელის შტოებში გამოვაცხადე ჭეშმარიტება. "},
	{10, "10 სამანის გადამნაცვლებლებივით არიან იუდას მთავრები, წყალივით გადმოვღვრი მათზე ჩემს რისხვას. "},
	{11, "11 დათრგუნულია ეფრემი, მსჯავრით გათელილი რადგან გადაწყვიტა კერპებს გაჰყოლოდა. "},
	{12, "12 ჩრჩილად გავუხდები ეფრემს და მჭამელად - იუდას სახლს. "},
	{13, "13 დაინახა ეფრემმა თავისი სენი და იუდამ თავისი ჭრილობა; წავიდა ეფრემი აშურში და შეუთვალა იარებ მეფეს; მაგრამ ის ვერ შესძლებს თქვენს განკურნებას და ჭრილობებს ვერ მოგიშუშებთ. "},
	{14, "14 რადგან მე ლომივით ვექცევი ეფრემს და ლომის ბოკვერივით - იუდას სახლს; დავგლეჯ და წავალ, გავიტაცებ და ვერავინ იხსნის. "},
	{15, "15 წავალ და დავბრუნდები ჩემს ადგილზე, ვიდრე არ შეიგნებენ თავიანთ დანაშაულს და ძებნას არ დაუწყებენ ჩემს სახეს; გაუჭირდებათ და მომძებნიან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ka6 poems[] = {
	{1, "1 წავიდეთ და მივიქცეთ უფლისკენ, რადგან მან დაგვგლიჯა და თავადვე განგვკურნავს; მან დაგვჭრა და თავადვე შეგვიხვევს ჭრილობას. "},
	{2, "2 ის გაგვაცოცხლებს ორი დღის შემდეგ, მესამე დღეს აღგვადგენს და ვიცოცხლებთ მის წინაშე. "},
	{3, "3 შევიცნოთ, ვესწრაფოთ უფლის შეცნობას; განთიადივით საიმედოა მისი ამოსვლა, წვიმასავით მოგვივა, ისხარივით, მიწას რომ რწყავს. "},
	{4, "4 რა გიყო, ეფრემ? რა გიყო, იუდა? თქვენი სიკეთე დილის ნისლივითაა, ცვარივითაა, ადრე რომ ქრება. "},
	{5, "5 ამიტომაც ვცემდი მათ წინასწარმეტყველთა ხელით და ვხოცავდი მათ ჩემი ბაგის ნათქვამით; შენი მსჯავრი ნათელივით ამოვა. "},
	{6, "6 რადგან თქვენი სიკეთე მახარებს და არა მსხვერპლი, უფლის შემეცნება და არა აღსავლენი. "},
	{7, "7 ადამივით გადავიდნენ ჩემს აღთქმას, იქ მიღალატეს მე. "},
	{8, "8 ბოროტმოქმედთა ქალაქია გალაადი, კვალსისხლიანი. "},
	{9, "9 როგორც ყაჩაღები უსაფრდებიან კაცს, ასევე იქცევა მღვდლების ხროვა, ხოცავენ შექემის გზაზე; სიბილწეს სჩადიან. "},
	{10, "10 სისაძაგლენი დავინახე ისრაელის სახლში; იქ არის ეფრემის გარყვნილება, ისრაელის უწმიდურება. "},
	{11, "11 შენზეც მოაწევს მკის ჟამი, იუდა, როცა ტყვეობიდან დავაბრუნებ ჩემს ერს! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct ka7 poems[] = {
	{1, "1 როცა ისრაელს ვკურნავდი, გამოაშკარავდა ეფრემის უკეთურებაც და სამარიის ბოროტებაც, რადგან თვალთმაქცურად იქცეოდნენ; მოდის ქურდი, ყაჩაღები დაძრწიან გარეთ! "},
	{2, "2 არც უფიქრიათ გულში, რომ მე მახსოვს ყოველი მათი ბოროტება; ახლა გარემოუცავთ ისინი თავიანთ ავ საქმეებს; აჰა, ჩემს წინაშე არიან. "},
	{3, "3 თავიანთი ბოროტებით ამხიარულებენ მეფეს და თავიანთი ტყუილებით - მთავრებს. "},
	{4, "4 მრუშობენ ყველანი ხაბაზის გახურებულ თონესავით, რომელიც ანელებს ცეცხლს, სანამ ახალი ცომი არ გაფუვდება. "},
	{5, "5 ჩვენი მეფის დღეს მთავრები სნეულდებიან ღვინის სიმხურვალისგან, მეფე კი მასხარებისკენ იწვდის ხელს. "},
	{6, "6 რადგან თონესავით გახდა მათი გული მზაკვრობისგან; მთელი ღამე სძინავს ხაბაზს, დილით კი ანთია თონე აგიზგიზებული ცეცხლივით. "},
	{7, "7 ყველანი გახურებულნი არიან თონესავით და ჭამენ თავიანთ მსაჯულებს; განმდგარია ყველა მათი მეფე, არავინ მიხმობს მათ შორის. "},
	{8, "8 ეფრემი შეერია ხალხებს, გადმოუბრუნებელი კოკორივით შეიქნა. "},
	{9, "9 უცხოთესლი ჭამს მის ძალას, მას კი ვერაფერი შეუტყვია; ჭაღარა შეერია კიდეც, მას კი ვერაფერი შეუტყვია. "},
	{10, "10 თავისი ამპარტავნობა ამხილებს ისრაელს, მაგრამ არ უბრუნდებიან უფალს, თავიანთ ღმერთს; არა და არ ეძებენ მას. "},
	{11, "11 ბრიყვი და უგნური მტრედივით იქცა ეფრემი: ეგვიპტეს უხმობენ, აშურში კი მიდიან. "},
	{12, "12 როგორც კი წავლენ, ჩემს სათხეველს მოვისვრი მათზე და ცის ფრინველებივით ჩამოვბერტყავ; დავსჯი მათ, როგორც გამოეცხადათ მათ. "},
	{13, "13 ვაი მათ, რადგან ზურგი მაქციეს! დაღუპვა მათ, რადგან შემცოდეს მე! მათი გამოსყიდვა მსურს, ისინი კი მზაკვრობენ ჩემს წინააღმდეგ! "},
	{14, "14 გულით არ შემომღაღადებენ, არამედ კვნესიან თავიანთ საწოლებში; პურისა და ღვინის გულისთვის იკრიბებიან, მე კი განმიდგნენ. "},
	{15, "15 მე დავმოძღვრე, მკლავი გავუმაგრე, ისინი კი ავს მიზრახავენ. "},
	{16, "16 არ მიიქცნენ, უზენაესისკენ; მოშვებულ მშვილდს დაემსგავსნენ; მახვილით დაეცემიან მათი მთავრები უტიფარი ენის გამო. ეს იქნება მათი სირცხვილი ეგვიპტის ქვეყანაში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct ka8 poems[] = {
	{1, "1 პირთან მიიტანე ბუკი! რადგან არწივი ადგას უფლის სახლს, რაკი გადავიდნენ ჩემს აღთქმას და ჩემი რჯული დაარღვიეს. "},
	{2, "2 შემომღაღადებენ: ღმერთო ჩემო, შეგიცანიო ისრაელმა! "},
	{3, "3 მაგრამ უარყო ისრაელმა სიკეთე, მტერი დაედევნება "},
	{4, "4 მეფე დაისვეს ჩემს უნებართვოდ, მთავრები დაისვეს ჩემს დაუკითხავად; თავიანთი ოქრო-ვერცხლით გაიკეთეს კერპები თავის დასაღუპად. "},
	{5, "5 დაგაგდო შენმა ხბომ, სამარია! აღიგზნო ჩემი რისხვა მათ წინააღმდეგ. როდემდის უნდა იყო უწმიდური? "},
	{6, "6 რადგან ისრაელის საქმეა ეს: ოსტატის ნახელავია, ღმერთი არ არის; ამიტომაც დანაფოტდება სამარიის ხბო."},
	{7, "7 რადგან ქარს თესენ და ქარიშხალს მოიმკიან; თავთავები არა აქვს, მარცვალს ვერ გაიკეთებს მცენარე; თუ გაიკეთებს, უცხონი ჩაყლაპავენ. "},
	{8, "8 ჩაიყლაპება ისრაელი; ახლა უსარგებლო ჭურჭელივით არის ხალხთა შორის. "},
	{9, "9 აშურში წავიდა თავისთვის გარეული ვირივით; გასცემდა სასიყვარულო საჩუქრებს. "},
	{10, "10 თუმცა გასცემდნენ ხალხებში, ახლა შევკრებ მათ; ცოტაც და, დაიტანჯებიან მთავართა მეფის ტვირთის ქვეშ. "},
	{11, "11 რადგან შესაცოდად გაამრავლა ეფრემმა სამსხვერპლოები, შესაცოდად აქვს მას სამსხვერპლოები. "},
	{12, "12 დავუწერე მას მთავარი რჯული, მაგრამ უცხოდ შერაცხა იგი. "},
	{13, "13 მოაქვთ სამსხვერპლო ძღვენი ჩემთვის, მიკლავენ საკლავს და ხორცს თავადვე ჭამენ; უფალს არ ეთნევა ისინი; ახლა კი გაიხსენებს მათ უკეთურებას და მოჰკითხავს ცოდვებს; ეგვიპტეში დაბრუნდებიან. "},
	{14, "14 დაივიწყა ისრაელმა თავისი შემქმნელი და სასახლეებს აშენებს; იუდამ გაამრავლა ციხე-ქალაქები, მაგრამ მე ცეცხლს მოვავლენ მის ქალაქებზე და ის შთანთქავს მის დარბაზებს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct ka9 poems[] = {
	{1, "1 ნუ მხიარულობ ისრაელო, ნუ ილხენ სხვა ხალხებივით, რადგან ბოზობ შენი ღმერთისგან განმდგარი; საჩუქრები გირჩევნია ყველა კალოს პურს. "},
	{2, "2 კალო და საწნახელი არ გამოკვებავს მათ და ღვინო უმტყუნებს მათ. "},
	{3, "3 არ იცხოვრებენ უფლის ქვეყანაში; ეფრემი ეგვიპტეში დაბრუნდება და უწმიდურს შეჭამენ აშურში. "},
	{4, "4 არ დაუღვრიან უფალს ღვინოს და თავიანთი მსხვერპლით არ აამებენ მას; მათი პური მგლოვიარეთა პურივით იქნება; ყოველი მისი მჭამელი გაუწმიდურდება, რადგან ეს პური მხოლოდ მათთვის არის, და არ შედის საუფლო სახლში. "},
	{5, "5 რას იზამთ დღესასწაულის დღეს და საუფლო ზეიმის დღეს? "},
	{6, "6 რადგან, აჰა, წაუვლენ აოხრებას, მაგრამ ეგვიპტე თავს მოუყრის მათ და მოფი დამარხავს მათ; მისი ვერცხლეულის საგანძურს ეკალ-ბარდები დაიმკვიდრებენ და ნარ-ეკალი ამოვა მის კარვებში. "},
	{7, "7 დადგა განკითხვის დღეები, დადგა ნაცვალგების დღეები. იცოდეს ისრაელმა! ბრიყვი იყო წინასწარმეტყველი, შეშლილი იყო სულის კაცი, შენს დიდ ცოდვებზე და დიდ მტრობაზე რომ ლაპარაკობდა? "},
	{8, "8 ეფრემის - ჩემი ღმერთის ერის მცველი წინასწარმეტყველია. ყველა გზაზე ხაფანგია დაგებული და მხოლოდ მტრობაა მისი ღმერთის სახლში. "},
	{9, "9 ღრმად გაირყვნენ, როგორც გიბყას დღეებში; მაგრამ ის გაიხსენებს მათ უკეთურებას და მოჰკითხავს ცოდვებს. "},
	{10, "10 ყურძენივით ვიპოვე უდაბნოში ისრაელი; როგორც პირველი ნაყოფი ლეღვის ხეზე, როგორც მისი ნათავარი, ისე მივიჩნიე თქვენი მამა-პაპა; მაგრამ ბაყალ-ფეღორთან წავიდნენ ისინი, სირცხვილს შესწირეს თავი და ვინც შეიყვარეს, მათსავით საძაგლები შეიქნენ. "},
	{11, "11 ეფრემი - ჩიტივით გაფრინდება მისი დიდება! არც შობა, არც ორსულობა, არც მუცლადღება! "},
	{12, "12 თუმცა გაზრდიან შვილებს, მაგრამ წავართმევ მათ; ერთი კაციც აღარ დარჩება; და ვაი მათ, თუ მივატოვე! "},
	{13, "13 ეფრემი ვიხილე როგორც მდელოზე დარგული ტვიროსი; მაგრამ ეფრემი მკვლელს გაუყვანს თავის შვილებს. "},
	{14, "14 მიეცი მათ, უფალო, რაც უნდა მიგეცა; მიეცი მოწყვეტილი მუცელი და გამშრალი მკერდი. "},
	{15, "15 გილგალშია მთელი მათი ბოროტება; იქ შევიძულე ისინი მათი ავი საქმეების გამო; ჩემი სახლიდან გავყრი მათ და აღარასოდეს შევიყვარებ; განდგომილია ყველა მისი მთავარი. "},
	{16, "16 დაჩეხილია ეფრემი, გამხმარია მისი ფესვები, აღარ გამოიღებს ნაყოფს; კიდეც რომ შობონ, მოვაკვდინებ მათი საშოს სანატრელ ნაშიერს. "},
	{17, "17 მოიშორებს მათ ჩემი ღმერთი, რადგან არ გაუგონეს მას; და ხალხთა შორის ხეტიალს მოჰყვებიან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct ka10 poems[] = {
	{1, "1 დაცარიელებული ვენახია ისრაელი, ნაყოფსაც თავის მსგავსს იძლევა; რა უხვი ნაყოფიც ჰქონდა, ასევე გააუხვა სამსხვერპლოები; რა კარგი მიწაც ჰქონდა, ასევე დაამშვენა სვეტები. "},
	{2, "2 ორგულნი არიან, მაგრამ ახლა კი მსჯავრი დაედებათ; შემუსრავს მათ სამსხვერპლოებს, დალეწავს მათ სვეტებს. "},
	{3, "3 რადგან ახლა ამბობენ, მეფე არა გვყავსო, რადგან უფლის არ გვეშინიაო; მეფემ კი - რა უნდა გვიყოსო მეფემ. "},
	{4, "4 მხოლოდ სიტყვებს ლაპარაკობენ, ცრუდ ფიცულობენ აღთქმის დადებისას; აღმოცენდება მსჯავრი, როგორც შხამიანი ბალახი ყანის ხნულებში. "},
	{5, "5 შეშინდებიან სამარიის მცხოვრებნი ბეთ-ავენის ხბოების გამო, რადგან იგლოვებენ მას მისი ერი და მისი ქურუმები, მისით ხომ ხარობდნენ; გამოიგლოვენ მის დიდებას, რადგან განეშორა მას. "},
	{6, "6 თავად მას კი იარებ მეფეს მიართმევენ ძღვნად; სირცხვილი აიტანს ეფრემს და ისრაელს შერცხვება თავისი განზრახვისა. "},
	{7, "7 გაქრება სამარია თავისი მეფითურთ როგორც ქაფი წყლის ზედაპირზე. "},
	{8, "8 განადგურდება ავენის გორაკები - ისრაელის ცოდვა; ნარ-ეკალი და ძეძვი ამოვა მათ სამსხვერპლოებზე და ეტყვიან მთებს: გადაგვეფარეთო და ბორცვებს - თავზე დაგვემხეთო! "},
	{9, "9 გიბყას დღეებიდან მოყოლებული სცოდავ, ისრაელო! იქ დგანან; არ მიწვდენიათ მათ გიბყაში ბოროტეულთა წინააღმდეგ გალაშქრება. "},
	{10, "10 ჩემი ნებისაებრ დავსჯი მათ; შეიკრიბებიან მათ წინააღმდეგ ხალხები, როცა შეპყრობილნი იქნებიან ორმაგი უკეთურების გამო. "},
	{11, "11 გაწვრთნილი ხბოა ეფრემი, ლეწვას შეჩვეული; მე თავად გადავივლი მის სქელ ქედზე და გავხედნი ეფრემს; იუდა შეუდგება ხვნას, იაკობი კი დაუფარცხავს. "},
	{12, "12 თესეთ თქვენთვის სიმართლე და მოიმკით წყალობას, გატეხეთ თქვენთვის ყამირი, დროა უფლის ძიებისა, ვიდრე მოვიდოდეს და სიმართლეს გაწვიმებდეთ. "},
	{13, "13 თქვენ ხნავდით ბოროტს და იმკიდით უსამართლობას; ჭამდით სიცრუის ნაყოფს, რადგან ესავდით თქვენს გზას, თქვენი მეომრების სიმრავლეს. "},
	{14, "14 აურზაური ატყდება შენს ხალხში და ყველა შენი ციხე-სიმაგრე დაიქცევა; როგორც შალმანმა დააქცია ბეთ-არბელი ბრძოლის დღეს, როდესაც დედა აკუწეს შვილებთან ერთად. "},
	{15, "15 ასე დაგმართებთ თქვენ ბეთელი თქვენი უზომო ბოროტებისთვის. ამოვა ცისკრის ვარსკვლავი და აღარ იქნება ისრაელის მეფე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct ka11 poems[] = {
	{1, "1 როცა ყრმა იყო ისრაელი და მიყვარდა იგი, ეგვიპტიდან გამოვიხმე ჩემი ძე. "},
	{2, "2 რაც უფრო ვუხმობდი მას, მით უფრო გარბოდა ჩემგან, რომ მსხვერპლი შეეწირა ბაალებისთვის და კერპებისთვის საკმეველი ეკმია. "},
	{3, "3 მე ვასწავლე ეფრემს სიარული; ჩემს მკლავებზე მყავდა აყვანილი, მაგრამ არ იცოდნენ, რომ ვკურნავდი "},
	{4, "4 ვიზიდავდი მათ ადამიანური გრძნობის საკვრელებით, სიყვარულის ძაფებით; ლაგმის ჩამომგდებივით ვიყავი მათთვის მათი ყბებიდან, მათზე ვიყავი გადმოხთილი და ვკვებავდი მათ. "},
	{5, "5 არ გაბრუნებულან ეგვიპტის ქვეყნისკენ, მაგრამ აშური იქნება მათი მეფე, რადგან არ ინდომეს ჩემსკენ მობრუნება. "},
	{6, "6 მახვილი დატრიალდება მის ქალაქში და მუსრს გაავლებს მის მრჩევლებს. შთანთქავს მათ ავი განზრახვების გამო. "},
	{7, "7 მიდრეკილია ჩემგან განდგომად ჩემი ერი, უღლისკენ მოუწოდებენ, მაგრამ არავინ გადმოუგდებს მას. "},
	{8, "8 როგორ გაგიმეტო, ეფრემ? როგორ გაგწირო, ისრაელ? როგორ გაგიმეტო ადმასავით? როგორ მოგექცე ცებოიმივით? გადამიბრუნდა გული, ერთიანად ამიტანა სიბრალულმა. "},
	{9, "9 აღარ ავინთები რისხვით, აღარ აღვიძრები ეფრემის დასაღუპად, რადგან ღმერთი ვარ მე და არა კაცი; მე წმიდა ვარ თქვენს შორის და რისხვით არ მოვალ. "},
	{10, "10 უფალს გაჰყვებიან; ლომივით ბრდღვინავს ის და როცა დაიწყებს ბრდღვინვას, შიშით წამოვლენ დასავლეთიდან შვილები. "},
	{11, "11 შიშით წამოვლენ, როგორც ჩიტები, ეგვიპტიდან და, როგორც მტრედები, აშურის ქვეყნიდან; და დავასახლებ მათ თავიანთ სახლებში, ამბობს უფალი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct ka12 poems[] = {
	{1, "1 შემომეხვია სიცრუით ეფრემი და ტყუილით ისრაელის სახლი; ჯერ კიდევ ღმერთთან არის იუდა და ერთგულია წმიდათა მიმართ. "},
	{2, "2 ეფრემი მწყემსავს ქარს და ხორშაკს ედევნება; დღითი დღე ამრავლებს ტყუილს და ძალადობას; აშურთან შეკრა კავშირი და ზეთი ეგვიპტეში მიაქვს. "},
	{3, "3 დავა აქვს უფალს იუდასთან და მოჰკითხავს იაკობს მის საქციელს; მის საქმეთაებრ მიაგებს მას. "},
	{4, "4 დედის საშოში ქუსლზე მოეჭიდა თავის ძმას, მოღონიერდა და ღმერთს შეერკინა. "},
	{5, "5 შეერკინა ანგელოზს და სძლია, თუმცა ტირილით ემუდარებოდა. ბეთელში გვიპოვის ჩვენ და დაგველაპარაკება. "},
	{6, "6 უფალია ცაბაოთ ღმერთი, უფალია მისი სახელი. "},
	{7, "7 შენ კი შენი ღვთისკენ მიიქეცი, ერთგულება და სამართალი დაიცავი და შენს ღმერთს ესავდე მუდამ. "},
	{8, "8 ქანაანელია, მატყუარა სასწორი რომ უჭირავს ხელში, და ჩაგვრა უყვარს. "},
	{9, "9 თქვა ეფრემმა: აჰა, ხომ გავმდიდრდი და მოვიხვეჭე დოვლათი; მთელს ჩემს ნამუშაკევში ვერ მიპოვნიან დანაშაულს, რომ რამეში შემეცოდოს. "},
	{10, "10 მე, უფალი, თქვენი ღმერთი ვარ ეგვიპტის ქვეყნიდან მოყოლებული; კვლავ დაგასახლებთ კარვების ქვეშ, როგორც დღესასწაულის დღეებში. "},
	{11, "11 მე ველაპარაკებოდი წინასწარმეტყველთ და მე გავამრავლე ხილვები; წინასწარმეტყველთა პირით იგავურად ვლაპარაკობდი. "},
	{12, "12 თუ იყვნენ კერპები გალაადში, ნამდვილად გაცამტვერდნენ ისინი; გილგალში ხარებს სწირავდნენ მსხვერპლად, მათი სამსხვერპლოებიც ქვის გროვასავით ყრია ყანის ხნულებში. "},
	{13, "13 გაიქცა იაკობი არამის ყანებში და შრომობდა ისრაელი ცოლის გულისთვის; ცოლის გულისთვის იცავდა ფარას. "},
	{14, "14 წინასწარმეტყველის მეშვეობით ამოიყვანა უფალმა ისრაელი ეგვიპტიდან და წინასწარმეტყველის მეშვეობით იყო დაცული. "},
	{15, "15 მწარედ გააჯავრა ეფრემმა თავისი უფალი. ამიტომაც მასზევე დაანთხევს მის დაღვრილ სისხლს და მოჰკითხავს მის სასირცხო საქმეებს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct ka13 poems[] = {
	{1, "1 როცა დასძრავდა სიტყვას ეფრემი, შიშის ზარი იყო; იგი აღზევდა ისრაელში, მაგრამ დადანაშაულდა ბაალის გამო და მოკვდა. "},
	{2, "2 ახლა უმატეს ცოდვას; ჩამოისხეს ქანდაკნი ვერცხლისგან, ოსტატურად, კერპები, რომელთაც ყოველი მჭედელი აკეთებს; ისინი ამბობენ მათზე: კაცის შემწირველნი ხბოებს კოცნიანო! "},
	{3, "3 ამიტომაც დილის ნისლივით იქნებიან ისინი და ცვარივით, ადრე რომ ქრება; კალოდან ქარისგან ახვეტილ ბზესავით და საკვამურიდან ადევნილი კვამლივით. "},
	{4, "4 მე ვარ უფალი, თქვენი ღმერთი ეგვიპტის ქვეყნიდან მოყოლებული, სხვას არავის იცნობთ ჩემს გარდა და არავინაა მხსნელი. "},
	{5, "5 მე გიცნობდი შენ უდაბნოში, მცხუნვარე მიწაზე. "},
	{6, "6 როცა საძოვრები გაუჩნდათ და გაძღნენ, გადიდგულდნენ, ამიტომაც დამივიწყეს მე. "},
	{7, "7 მე კი ლომად ვექცევი მათ, ვეფხვივით ჩავუსაფრდები გზაზე. "},
	{8, "8 ბელებწაგვრილი დათვივით დავეცემი თავს, შევუნგრევ გულისფიცარს და, როგორც ლომი, შევჭამ მათ; ველის მხეცები დაგლეჯენ მათ. "},
	{9, "9 თავი წაიწყმიდე, ისრაელ, რადგან მხოლოდ ჩემშია შენი შეწევნა! "},
	{10, "10 სადა არის ახლა შენი მეფე, რომ გიხსნას ყოველ შენს ქალაქში? ან შენი მსაჯულნი, რომლებზეც ამბობდით: მომეცი მეფე და მთავრებიო? "},
	{11, "11 მე მოგეცით მეფე განრისხებისას და წაგართმევთ გულისწყრომაში. "},
	{12, "12 შეფუთულია ეფრემის უკეთურებანი, გადანახულია მისი ცოდვები. "},
	{13, "13 მშობიარის ტკივილები ეწევა მას; უგუნური შვილია, თორემ არ დაყოვნდებოდა საშოს კარებთან. "},
	{14, "14 ჯოჯოხეთის ხელიდან გამოვისყიდი მათ, სიკვდილისგან ვიხსნი. სად არის შენი ნესტარი, სიკვდილო? სად არის შენი ძლევა, ჯოჯოხეთო? შებრალება მიეფარა ჩემს თვალს! "},
	{15, "15 თუმცა განივრცო ეფრემი ძმათა შორის, მაგრამ დაუბერავს აღმოსავლეთის ქარი, უფლის ქარი ამოვარდება უდაბნოდან და დაშრება მისი წყარო და დაწდება მისი სათავე; ის გაძარცვავს ყოველნაირ ძვირფას ჭურჭელთა საგანძურს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct ka14 poems[] = {
	{1, "1 მსჯავრი დაედება სამარიას, რადგან აუჯანყდა თავის ღმერთს. მახვილით დაეცემიან, მათი ბავშვები აიკუწებიან და მათი ორსულნი გაიფატრებიან. "},
	{2, "2 მოიქეც, ისრაელ, უფლისკენ, შენი ღვთისკენ, რადგან წაფორხილდი შენს უკეთურებაზე. "},
	{3, "3 შეიგონეთ სიტყვები და მიიქეცით უფლისკენ. უთხარით, სრულიად აგვხადე-თქო უკეთურება, მიითვალე სიკეთე და ხბოების ნაცვლად ჩვენს ბაგეებს შემოგწირავთ-თქო მსხვერპლად. "},
	{4, "4 ვეღარ გვიხსნის-თქო აშური, ცხენებზე აღარ ავმხედრდებით და ჩვენს ღმერთებად აღარ შევრაცხავთ-თქო ჩვენსავე ნახელავს, რადგან მხოლოდ შენში ჰპოვებს შებრალებას ობოლი. "},
	{5, "5 განვკურნავ მათ განდგომილებისგან და ნებისაებრ შევიყვარებ მათ, რადგან გაივლის ჩემი რისხვა მათდამი. "},
	{6, "6 ვიქნები ცვარი ისრაელისთვის; აყვავდება როგორც შროშანი და ლიბანივით გაიდგამს ფესვებს. "},
	{7, "7 განზე წავლენ მისი რტოები, ზეთისხილის ბრწყინვალება ექნება და ლიბანის სურნელი. "},
	{8, "8 დაბრუნდებიან მის ჩრდილში მსხდომარენი; სიცოცხლეს მიანიჭებენ ხორბალს და ვაზივით აყვავილდებიან; ლიბანის ღვინოსავით გაითქვამს სახელს. "},
	{9, "9 რაღა მესაქმება, ეფრემ, კერპებთან? მე შევიწყნარე და მივხედავ მას; მე ამწვანებული ალვა ვარ, ჩემგან გექნება შენ ნაყოფი. "},
	{10, "10 ვინც ბრძენია, შეიგნოს ეს; ვინც გონიერია, იცოდეს ეს, რადგან სწორია უფლის გზები და მართალნი ადგანან მას, განდგომილნი კი ფორხილობენ მასზე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};