#include <map>
#include <string>
class Bible58
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 პავლე, ღვთის ნებით იესო ქრისტეს მოციქული, და ძმა ტიმოთე - "},
	{2, "2 კოლოსეში მყოფი წმიდათ და მორწმუნე ძმებს ქრისტეში: მადლი თქვენდა და მშვიდობა ჩვენი მამა ღმრთისაგან. "},
	{3, "3 დღენიადაგ თქვენთვის მლოცველნი მადლს ვწირავთ ღმერთს და ჩვენი უფლის იესო ქრისტეს მამას, "},
	{4, "4 რადგანაც გავიგეთ თქვენი რწმენა ქრისტე იესოში და სიყვარული ყველა წმიდის მიმართ, "},
	{5, "5 ცაში თქვენთვის გამზადებული იმედის გამო, რაც წინასწარვე ისმინეთ სახარების ჭეშმარიტი სიტყვით, "},
	{6, "6 რომელიც ისევეა თქვენში, როგორც მთელ საწუთროში, სადაც გამოაქვს ნაყოფი და ისევე იზრდება, როგორც თქვენს შორის, იმ დღიდან მოყოლებული, რაც ისმინეთ და ჭეშმარიტებით შეიმეცნეთ ღვთის მადლი;"},
	{7, "7 როგორც გისწავლიათ ჩვენი საყვარელი თანამდგომის, ეპაფრასაგან, ერთგულად რომ ემსახურება ქრისტეს თქვენი ხსნისათვის;"},
	{8, "8 მანვე გვაუწყა თქვენი სიყვარული სულით. "},
	{9, "9 ამიტომ ჩვენც, იმ დღის შემდეგ, რაც ეს გავიგეთ, გამუდმებით ვლოცულობთ თქვენთვის და შევთხოვთ ღმერთს, რომ აღივსოთ მისი ნების შემეცნებით, მთელი სიბრძნითა და სულიერი წვდომის უნარით, "},
	{10, "10 რათა ისე იქცეოდეთ, რისი ღირსიცაა უფალი, ყოველნაირად ცდილობდეთ აამოთ მას, ნაყოფი გამოგქონდეთ ყველა კეთილ საქმეში და იზრდებოდეთ ღვთის შემეცნებით, "},
	{11, "11 ყოველმხრივ ძლიერდებოდეთ მისი დიდების სიმტკიცით, რათა ყოვლისმთმენნი და სულგრძელნი იყოთ, "},
	{12, "12 სიხარულით ჰმადლობდეთ ღმერთსა და მამას, რომელმაც იმის ღირსნი გვყო, რომ წმიდათა ხვედრს ვზიარებოდით ნათელში;"},
	{13, "13 რომელმაც გვიხსნა სიბნელის ხელმწიფებისგან და შეგვიყვანა თავისი ძის სასუფეველში, "},
	{14, "14 ვინც გამოგვისყიდა თავისი სისხლით და მოგვიტევა ჩვენი ცოდვები; "},
	{15, "15 ვინც არის ხატი უხილავი ღვთისა, ყველა ქმნილებაზე უწინარესი, "},
	{16, "16 რადგანაც მასში შეიქმნა ყოველი, მიწიერიც და ზეციერიც; ხილული თუ უხილავი, საყდარნი თუ უფლებანი, მთავრობანი თუ ხელმწიფებანი - ყველაფერი მის მიერ და მისთვის შეიქმნა. "},
	{17, "17 ის არის ყოვლის უწინარესი, და ყველაფერი მისი მეოხებით დგას. "},
	{18, "18 ის არის თავი ეკლესიის სხეულისა, პირმშო მკვდართაგან, რათა ყველაფერში პირველობდეს, "},
	{19, "19 რადგანაც კეთილინება მამამ, რომ მასში დამკვიდრებულიყო მთელი სავსება, "},
	{20, "20 რათა მისი მეშვეობიი, შემოერიგებინა ყოველი და მისი ჯვრის სისხლით დაეცხრო ყველაფერი - მიწიერიც და ზეციერიც. "},
	{21, "21 და თქვენც, ოდესღაც უცხოქმნილნი თუ გონებით მტერნი, უკეთურ საქმეთაკენ მიდრეკილნი,"},
	{22, "22 აწ მისი სიკვდილით შეგირიგათ მისსავე ხორციელ სხეულში, რათა წმიდანი, უბიწონი და უბრალონი წარგადგინოთ თავის წინაშე, "},
	{23, "23 მაგრამ ამისთვის საჭიროა, რომ რწმენით დამკვიდრებულნი და განმტკიცებულნი არ განეშოროთ სასოებას სახარებისას, რომელიც გსმენიათ, ცისქვეშეთის ყველა ქმნილებისთვის ქადაგებული, და რომლის მსახურიც გავხდი მე, პავლე. "},
	{24, "24 ახლა კი ვხარობ ჩემი ვნებების გამო, რომლებიც დავითმინე ჩვენი გულისთვის, და რაც დააკლდა ქრისტეს ურვას, ჩემი ხორცით ვავსებ მისი სხეულისათვის, რომელიც არის ეკლესია. "},
	{25, "25 ხოლო მე მისი მსახური გავხდი ღვთის განგებულებით, რომელიც მომენდო თქვენთვის, რათა აღვასრულო ღვთის სიტყვა, - "},
	{26, "26 საიდუმლო, დაფარული უკუნისიდან და თაობათა დასაბამიდან, ხოლო აწ გაცხადებული მის წმიდათათვის, "},
	{27, "27 რომელთაც ღვთის ნებით ეუწყა, რა არის სიუხვე ამ საიდუმლოს დიდებისა წარმართთა შორის: ესაა ქრისტე თქვენში, დიდების სასოება, "},
	{28, "28 რომელსაც ვქადაგებთ და შევაგონებთ ყველას, რათა მთელი სიბრძნით დავმოძღვროთ ყოველი კაცი და სრულქმნილად წარვადგინოთ ქრისტე იესოში;"},
	{29, "29 რისთვისაც ვშრომობ და ვიღწვი მისი ძალით, ძლევამოსილად რომ მოქმედებს ჩემში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 მინდა იცოდეთ, რა გულმოდგინედ ვიღვწი თქვენთვის, ლაოდიკელთა და ყველა მათგანისათვის, ვისაც პირადად არც კი უხილავს ჩემი სახე; "},
	{2, "2 რათა გამხნევდეს მათი გული და სიყვარულით შეერთებულნი ეზიარონ გონიერების მთელ სისავსეს და სიუხვეს ღვთის საიდუმლოს, ანუ ქრისტეს შესამეცნებლად, "},
	{3, "3 რომელშიაც დაფარულია სიბრძნისა და ცოდნის მთელი საუნჯე. "},
	{4, "4 ამას ვამბობ, რათა არავინ გაცთუნოთ შემპარავი სიტყვით. "},
	{5, "5 ვინაიდან, თუმცა ხორცით შორსა ვარ თქვენგან, მაგრამ ახლო ვარ სულით, და მიხარია, რომ ვხედავ თქვენს წესრიგსა და რწმენის სიმტკიცეს ქრისტეში. "},
	{6, "6 ამიტომ, როგორც მიგიღიათ უფალი ქრისტე იესო, ისევ იარეთ მასში. "},
	{7, "7 რადგანაც მის მიერ ხართ დამკვიდრებულნი, მასში ფესვგადგმულნი და, როგორც გისწავლიათ, რწმენით განმტკიცებულნი. მასშივე იზარდეთ მადლიერებით. "},
	{8, "8 ფრთხილად იყავით, რათა არავინ გაცთუნოთ სიბრძნისმეტყველებითა და ფუჭი საცთურით, კაცთა გადმოცემებისა თუ ქვეყნის საწყისთა თანახმად, და არა ქრისტეს მიხედვით. "},
	{9, "9 რადგანაც მასში მკვიდრობს ხორციელად ღვთაების მთელი სავსება. "},
	{10, "10 და თქვენც სავსენი ხართ მასში, ვინც არის თავი ყოველი მთავრობისა და ხელმწიფებისა. "},
	{11, "11 მასშივე ხართ წინადაცვეთილნი ხელთუქმნელი წინადაცვეთით: ესაა განძარცვა ცოდვილი ხორციელი სხეულისაგან - ქრისტესეული წინადაცვეთა. "},
	{12, "12 მასთან ერთად დაიმარხეთ ნათლისღებით და მასთან ერთადვე აღდექით ღმერთის ქმედითი ძალის რწმენით, რომელმაც მკვდრეთით აღადგინა იგი. "},
	{13, "13 და თქვენც, ცოდვებითა და თქვენი წინადაუცვეთელობით მკვდრები, მასთან ერთად გაგაცოცხლათ ცოდვათა მოტევებით. "},
	{14, "14 სწავლით წარხოცა ჩვენგამო შეთხზული და ჩვენს წინააღმდეგ მიმართული ხელწერილი; შუაგულიდან აიღო და ჯვარს მიალურსმა იგი. "},
	{15, "15 ძალისაგან განძარცვა მთავრობანი და ხელმწიფებანი, საჯაროდ განაქიქა და ჯვრით იმძლავრა მათზე. "},
	{16, "16 ამიტომ ნურავინ განგსჯით საჭმლისა თუ სასმლის, რაიმე დღესასწაულის, ახალმთვარობისა თუ შაბათთა გამო. "},
	{17, "17 ყოველივე ეს მხოლოდ ლანდია იმისა, რასაც მომავალი მოიტანს, სხეული კი არის ქრისტესი. "},
	{18, "18 ნურავინ შეგაცდენთ მოჩვენებითი სიმდაბლით და ანგელოზთა მსახურებით, თავის ფუჭ ხილვებში დანთქმული და თავისი ხორციელი გონებით ამაოდ გალაღებული, "},
	{19, "19 ვინც განშორებია თავს, რომლის მეოხებითაც მთელი სხეული, სახსართა და ნაწევართაგან შეკრული და შეერთებული, დაუბრკოლებლივ იზრდება საღვთო ზრდით. "},
	{20, "20 თუ ქრისტესთან ერთად მოკვდით ამქვეყნიური საწყისისათვის, მაშინ, როგორც საწუთროს მკვიდრნი, რატომღა მისდევთ მის წესს: "},
	{21, "21 ნელს ნუ ახლებ, ნუ იგემებ, ნუ შეეხები "},
	{22, "22 ნურაფერს, რაც იხრწნება, - კაცთა მცნებებისა და მოძღვრების მიხედვით? "},
	{23, "23 ყოველივე ეს მხოლოდ იმდენად ჰგავს ჭეშმარიტ სიბრძნეს, რამდენადაც მათშიც ვხედავთ თვითნებურ თაყვანისცემას, თავმდაბლობას და თვითგვემას, მაგრამ მათ არ შეუძლიათ წინ აღუდგნენ ხორციელ განცხრომათა სურვილს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 თუკი ქრისტესთან ერთად აღდექით, ზეცისას ეძიებდეთ, სადაც ქრისტე ზის ღვთის მარჯვნივ. "},
	{2, "2 ზეცისას ფიქრობდეთ და არა მიწისას. "},
	{3, "3 რადგანაც მოკვდით და თქვენი სიცოცხლე ქრისტესთან ერთად დაიფარა ღმერთში. "},
	{4, "4 როდესაც გამოჩნდება ქრისტე, თქვენი სიცოცხლე, მასთან ერთად თქვენც გამოჩნდებით დიდებით. "},
	{5, "5 მაშ, მოაკვდინეთ თქვენი მიწიერი ასონი: სიძვა, უწმინდურება, ვნება, ბოროტი გულისთქმა და ანგარება, რომელიც არის კერპთმსახურება. "},
	{6, "6 მათ გამო მოიწევა ღვთის რისხვა ურჩობის ძეთა თავზე, "},
	{7, "7 რომელთა შორისაც იყავით თქვენც, როცა მათთან ერთად ცხოვრობდით. "},
	{8, "8 ახლა კი განიშორეთ ყველაფერი: რისხვა, გულისწყრომა, ბოროტება, გმობა და უგვანი სიტყვა თქვენს ბაგეთაგან. "},
	{9, "9 ნუ ეცრუებით ერთმანეთს, რაკიღა უკვე შემოიძარცვეთ ძველი კაცი მისი ყოველი საქმითურთ, "},
	{10, "10 და შეიმოსეთ ახალი, რომელიც განახლდება შემეცნებით მისი შემოქმედის ხატად, "},
	{11, "11 სადაც არ არის ბერძენი და იუდეველი, წინადაცვეთილობა თუ წინადაუცვეთელობა, ბარბაროსი, სკვითი, მონა თუ თავისუფალი, არამედ ქრისტეა ყველაფერი და ყველაფერში. "},
	{12, "12 მაშ, ღვთის რჩეულთა, წმიდათა და საყვარელთა დარად, შეიმოსეთ გულმოწყალება, სიტკბოება შემწყნარებლობა, სიმდაბლე, სიმშვიდე, დიდსულოვნება. "},
	{13, "13 შემწყნარენი და მიმტევებელნი იყავით ერთურთის მიმართ: თუკი ვინმეს რაიმე სადავო აქვს ვინმესთან, როგორც ქრისტემ მოგიტევათ, თქვენც ასევე მიუტევეთ ერთმანეთს. "},
	{14, "14 ყოველივე ამას კი თან ახლდეს სიყვარული, რომელიც არის საკვრელი სრულქმნილებისა. "},
	{15, "15 დაე, სუფევდეს თქვენს გულებში ქრისტეს მშვიდობა, რის მიმართაც ერთ სხეულად ხართ ხმობილნი; და მადლიერნი იყავით. "},
	{16, "16 დაე, ქრისტეს სიტყვა მთელი სიბრძნითა და სიუხვით დაემკვიდროს თქვენში; ფსალმუნებით, საგალობლებითა და სულიერი შესხმით ასწავლეთ და შეაგონეთ ერთმანეთს; მადლიერებით უგალობეთ უფალს თქვენს გულებში. "},
	{17, "17 ყველაფერი, რასაც სიტყვით თუ საქმით ასრულებთ, აღასრულეთ უფალ იესოს სახელით, რათა მის მიერ ჰმადლობდეთ ღმერთსა და მამას. "},
	{18, "18 ცოლებო, დაემორჩილეთ თქვენს ქმრებს, როგორც გმართებთ კიდეც უფალში. "},
	{19, "19 ქმრებო, გიყვარდეთ თქვენი ცოლები და ნუ იქნებით მკაცრნი მათ მიმართ. "},
	{20, "20 შვილებო, დაემორჩილეთ თქვენს მშობლებს ყველაფერში, რადგანაც ეს ეამება უფალს. "},
	{21, "21 მამებო, ნუ აღაშფოთებთ თქვენს შვილებს, რათა სულით არ დაეცნენ. "},
	{22, "22 მონებო, ყველაფერში დაემორჩილეთ თქვენს ხორციელ ბატონებს, მაგრამ მოჩვენებითი სამსახურით კი არა, როგორც იქცევიან პირფერნი, არამედ გულის სიწრფელით და ღვთისმოშიშებით. "},
	{23, "23 ყველაფერი, რასაც აკეთებთ, გულით აკეთეთ, როგორც ღვთისათვის და არა კაცთათვის. "},
	{24, "24 იცოდეთ, რომ უფლისგან საზღაურად მიიღებთ მემკვიდრეობას, ვინაიდან უფალ იესოს ემსახურებით. "},
	{25, "25 უსამართლოს კი მიეგება იმის მიხედვით, რაც უსამართლოდ მოიმოქმედა, რადგანაც უფლისთვის უცხოა მიკერძოება. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 ბატონებო, მიაგეთ მონებს, რაც სწორია და სამართლიანი; გახსოვდეთ, რომ თქვენცა გყავთ უფალი ცაში. "},
	{2, "2 გულმოდგინედ ილოცეთ და იფხიზლეთ მასში მადლიერებით. "},
	{3, "3 ჩვენთვისაც ილოცეთ, რათა უფალმა გაგვიღოს სიტყვის კარი ქრისტეს საიდუმლოს საუწყებლად, რისთვისაც მადევს ბორკილი; "},
	{4, "4 რათა ისე განვაცხადო, როგორც მმართებს მისი უწყება. "},
	{5, "5 ბრძნულად მოიქეცით გარეშეთა მიმართ; დრო მოიხმარეთ. "},
	{6, "6 თქვენი სიტყვა ყოველთვის მადლიანი იყოს, მარილით შეზავებული, რათა იცოდეთ, ვის რა მიუგოთ. "},
	{7, "7 ჩემს ამბავს დაწვრილებით გაუწყებთ ტიქიკოსი, საყვარელი ძმა, სანდო მსახური და თანამოღვაწე უფალში, "},
	{8, "8 რომელიც იმიტომ გაახლეთ, რომ გაუწყოთ ჩვენი ამბავი და ნუგეში სცეს თქვენს გულებს, "},
	{9, "9 ონისიმესთან, სანდო და საყვარელ ძმასთან ერთად; ისინი გაუწყებენ აქაურ ამბებს. "},
	{10, "10 მოკითხვას გითვლით არისტარქე, ჩემთან ერთად ტყვედ ნამყოფი, აგრეთვე მარკოზი, ბარნაბას ბიძაშვილი, ვისზედაც გაცნობეთ, თუ გეწვიათ, შეიწყნარეთ-მეთქი, "},
	{11, "11 და იესო, იუსტუსად წოდებული; წინდაცვეთილთაგან მხოლოდ ესენი მედგნენ მხარში ღვთის სასუფევლის ქადაგებისას, მხოლოდ ესენი იყვნენ ჩემი ნუგეში. "},
	{12, "12 მოკითხვას გითვლით თქვენიანი ეპაფრა, დღენიადაგ რომ ლოცულობს თქვენთვის, რათა მტკიცედ იდგეთ, სრულნი და სავსენი ღვთის მთელი ნებით. "},
	{13, "13 მე ვუმოწმებ, რომ დიდად მოწადინებულია თქვენთვის, ლაოდიკელთა და ჰიერაპოლისელთათვის. "},
	{14, "14 მოგიკითხავთ ლუკა, საყვარელი მკურნალი, და დემასი. "},
	{15, "15 მოიკითხეთ ლაოდიკელი ძმები, აგრეთვე ნიმფასი და მისი შინაური ეკლესია. "},
	{16, "16 როცა ამ წერილს წაიკითხავთ, ისე მოიქეცით, რომ ლაოდიკელთა ეკლესიაშიც წაიკითხონ, მათთვის გაგზავნილი წერილი კი თქვენც წაიკითხეთ. "},
	{17, "17 არქიპოსს უთხარით: შენ იცი, როგორ აღასრულებ მსახურებას, უფლისგან რომ მიიღე-თქო. "},
	{18, "18 მოგიკითხავთ მე, პავლე, ჩემი ხელით. გახსოვდეთ ჩემი ტყვეობა. მადლი თქვენთან. ამინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};