#include <map>
#include <string>
class Bible14
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
	struct ka6	{ int val; const char *msg; };
	struct ka7	{ int val; const char *msg; };
	struct ka8	{ int val; const char *msg; };
	struct ka9	{ int val; const char *msg; };
	struct ka10	{ int val; const char *msg; };
	struct ka11	{ int val; const char *msg; };
	struct ka12	{ int val; const char *msg; };
	struct ka13	{ int val; const char *msg; };
	struct ka14	{ int val; const char *msg; };
	struct ka15	{ int val; const char *msg; };
	struct ka16	{ int val; const char *msg; };
	struct ka17	{ int val; const char *msg; };
	struct ka18	{ int val; const char *msg; };
	struct ka19	{ int val; const char *msg; };
	struct ka20	{ int val; const char *msg; };
	struct ka21	{ int val; const char *msg; };
	struct ka22	{ int val; const char *msg; };
	struct ka23	{ int val; const char *msg; };
	struct ka24	{ int val; const char *msg; };
	struct ka25	{ int val; const char *msg; };
	struct ka26	{ int val; const char *msg; };
	struct ka27	{ int val; const char *msg; };
	struct ka28	{ int val; const char *msg; };
	struct ka29	{ int val; const char *msg; };
	struct ka30	{ int val; const char *msg; };
	struct ka31	{ int val; const char *msg; };
	struct ka32	{ int val; const char *msg; };
	struct ka33	{ int val; const char *msg; };
	struct ka34	{ int val; const char *msg; };
	struct ka35	{ int val; const char *msg; };
	struct ka36	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 გამტკიცდა სოლომონ დავითის ძე თავის სამეფოში. უფალი, მისი ღმერთი იყო მასთან და დიდად აღაზევა იგი. "},
	{2, "2 მოუხმო სოლომონმა მთელ ისრაელს: ათასისთავებს, ასისთავებს, მსაჯულებს, მთელი ისრაელის ყველა წინამძღოლს, მამისსახლთა თავკაცებს. "},
	{3, "3 გაემართნენ სოლომონი და მასთან ერთად მთელი კრებული იმ გორაკისაკენ, რომელიც გაბაონშია, რადგან იქ იყო ის სადღესასწაულო კარავი, მოსემ, ღვთის მორჩილმა რომ გააკეთა უდაბნოში. "},
	{4, "4 ხოლო ღვთის კიდობანი დავითს კირიათ-იეყარიმიდან ჰქონდა გადატანილი იმ ადგილზე, რომელიც მას მოუმზადა დავითმა, რადგან იერუსალიმში გაშალა მისი კარავი. "},
	{5, "5 სპილენძის სამსხვერპლო, რომელიც ბეცალიელმა, ძემ ურისა, ძისა ხურისამ გააკეთა, იქვე იყო, უფლის სავანის წინ. მოძებნეს იგი სოლომონმა და კრებულმა."},
	{6, "6 ავიდა იქ სოლომონი უფლის წინაშე, სპილენძის სამსხვერპლოზე, სადღესასწაულო კარავთან რომაა და ათასი აღსავლენი აღავლინა მასზე. "},
	{7, "7 იმ ღამეს გამოეცხადა ღმერთი სოლომონს და უთხრა: მთხოვე, რა გინდა, რომ მოგცე? "},
	{8, "8 უთხრა სოლომონმა ღმერთს: დიდად წყალობდი მამაჩემს დავითს. მის ნაცვლად კი მე გამამეფე. "},
	{9, "9 უფალო ღმერთო, ახლა აღსრულდეს შენი სიტყვა, დავითს, მამაჩემს, რომ უთხარი. რაკიღა მიწის მტვერივით რიცხვმრავალ ხალხზე გამამეფე, "},
	{10, "10 სიბრძნე და ცოდნაც მომეცი ბარემ, რომ გავდიოდე ხალხის წინაშე და შევდიოდე. რადგან ვის შეუძლია განაგოს შენი ერი, ესოდენ მრავალრიცხოვანი? "},
	{11, "11 უთხრა უფალმა სოლომონს: რაკი გულში ეს გქონდა და არ ითხოვე სიმდიდრე, ქონება, დიდება, შენი მტრების სული და არც ხანგრძლივი სიცოცხლე ითხოვე, არამედ მხოლოდ ცოდნა გამომთხოვე სამართავად ჩემი ერისა, რომელზედაც მე გაგამეფე, "},
	{12, "12 გეძლევა სიბრძნე და ცოდნა. ისეთ სიმდიდრეს, ქონებასა და დიდებას მოგანიჭებ, რომლის მსგავსი არც შენს წინამორბედ მეფეებს ჰქონდათ და არც შენს შემდეგ ეღირსება ვინმეს. "},
	{13, "13 გაბაონში რომ გორაკია, იქიდან ჩავიდა სოლომონი იერუსალიმში და მეფობდა ისრაელზე. "},
	{14, "14 თავი მოუყარა სოლომონმა ეტლებსა და ცხენოსნებს. ჰყავდა ათასოთხასი ეტლი და თორმეტი ათასი ცხენოსანი. განალაგა ისინი ეტლების სადგომ ქალაქებში და იერუსალიმში, თავისთან. "},
	{15, "15 ოქრო-ვერცხლი ქვებს გაუთანაბრა იერუსალიმში, ხოლო კედარი სიკომორის ხეს, დაბლობში რომ იზრდება. "},
	{16, "16 სოლომონის ცხენები ეგვიპტიდან და კევედან იყო მოყვანილი; მეფის ვაჭრებს მოჰყავდათ კევედან საფასურით. "},
	{17, "17 ეტლი ექვსას ვერცხლად ამოჰყავდათ ეგვიპტიდან, ხოლო ცხენები - ასორმოცდაათ ვერცხლად. ამავე ფასში მოჰქონდათ თავიანთი ხელით ხეთელთა და არამელთა მეფეებისთვისაც. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 ბრძანა სოლომონმა სახლის აშენება უფლის სახელისთვის და სამეფო სახლის აშენება თავისთვის. "},
	{2, "2 სოლომონმა აღრიცხა სამოცდაათიათასი მტვირთავი, ოთხმოციათასი ქვის მჭრელი მთაში და სამიათას ექვსასი მათი ზედამხედველი. "},
	{3, "3 შეუთვალა სოლომონმა ხურამს, ტვიროსის მეფეს: როგორც მამაჩემს დავითს ექცეოდი და ნაძვებს უგზავნიდი მისი საცხოვრებელი სახლის ასაშენებლად, მეც ასე მომექეციო. "},
	{4, "4 აჰა, ვაშენებ უფლის, ჩემი ღმერთის სახლს მისთვის საკურთხევლად, საკმევლის საკმევად, საწირი პურის მუდამჟამს მისართმევად, აღსავლენის აღსავლენად დილა-საღამოობით, შაბათობით, ახალმთვარობებისა და ჩვენი უფლის, ღმერთის დღესასწაულებისთვის, რაც სამარადისოდ აკისრია ისრაელს. "},
	{5, "5 დიდია ის სახლი, უფლისათვის რომ ვაშენებ, რადგან ჩვენი ღმერთი ყველა ღმერთებზე დიდია. "},
	{6, "6 ვის შესწევს ძალა, რომ უფლის სახლი ააშენოს, როცა მას ცანი და ცათა ცანიც ვერ იტევს? ან მე ვინღა ვარ, რომ მის წინაშე საკმევლის საკმევი ალაგის გარდა, სხვა სახლი ავუშენო? "},
	{7, "7 ახლა კი გამომიგზავნე ოქროს, ვერცხლის, სპილენძის, რკინის და ძოწეულის, მეწამული და ლურჯი ფერის ნართების დამუშავების მცოდნე კაცი, ჩუქურთმის კვეთა რომ იცოდეს და იმუშაოს იმ ხელოსნებთან ერთად, იუდასა და იერუსალიმში რომ მყავს, რომელნიც მამაჩემმა, დავითმა, მოამზადა. "},
	{8, "8 ლიბანიდან გამომიგზავნე კედარის ხეები, კვიპაროსები და სანდალოზის ხეები, რადგან ვიცი, რომ შენმა მორჩილებმა იციან ლიბანის ხეების ჭრა და აჰა, ჩემი მორჩილნი შენს მორჩილებთან ერთად იქნებიან,"},
	{9, "9 რათა უხვად დამიმზადონ ხეები, რადგან სახლი მე რომ ვაშენებ, დიდებული და მშვენიერი უნდა გამოვიდეს. "},
	{10, "10 აჰა, ვაძლევ ტყისმჭრელებს, ხეებს რომ ჩეხავენ, შენს მორჩილთ, ოციათას ქორ ხორბლის ფქვილს, ოციათას ქორ ქერს, ოციათას ბათ ღვინოსა და ოციათას ბათ ზეთს. "},
	{11, "11 ხურამმა, ტვიროსის მეფემ, წერილით უპასუხა სოლომონს და შეუთვალა: რაკი უფალს უყვარს თავისი ერი, ამიტომ დაგადგინა მასზე მეფედ. "},
	{12, "12 კიდევ ეს უთხრა ხურამმა: კურთხეულ იყოს უფალი, ღმერთი ისრაელისა, რომელმაც შექმნა ცა და მიწა, რომელმაც მეფე დავითს ბრძენი, ჭკვიანი და გონიერი ვაჟი უბოძა, რომელიც აშენებს სახლს უფლისათვის და სამეფო სახლს თავისთვის. "},
	{13, "13 ახლა კი გიგზავნი ბრძენსა და გამოცდილ კაცს - ხურამ-აბის, "},
	{14, "14 დანელი ქალის ძეს, მამით ტვიროსელს, რომელმაც იცის ოქროს, ვერცხლის, სპილენძის, რკინის, ქვის, ხის, ძოწეული და ლურჯი ნართების, სელის და ყირმიზის დამუშავება, ყოველგვარი ჩუქურთმის კვეთა, ყველა ჩანაფიქრის განსახორციელებლად, რაც კი დაევალება შენს ხელოსნებთან და ჩემი ბატონის, დავითის, ხელოსნებთან ერთად."},
	{15, "15 ახლა გამოუგზავნოს ჩემმა ბატონმა ის ხორბალი, ქერი, ზეთი და ღვინო, თავის მორჩილთ რომ შეჰპირდა. "},
	{16, "16 ჩვენ კი ლიბანში მოვჭრით ხეებს, რამდენიც დაგჭირდება და ზღვაზე ტივებით დავაცურებთ იოფისკენ, იქიდან კი იერუსალიმს აიტანე. "},
	{17, "17 აღრიცხა სოლომონმა ყველა ხიზანი, ვინც კი ისრაელის ქვეყნად დავითის, მამამისის, აღრიცხვის შემდეგ მოსულიყო. და აღმოჩნდა ასორმოცდაცამეტი ათას ექვსასი კაცი. "},
	{18, "18 მათგან სამოცდაათი ათასი მტვირთავად გაამწესა, ოთხმოცი ათასი - ქვის მჭრელად მთაში, სამი ათას ექვსასი - ზედამხედველად, ხალხი რომ ემუშავებინათ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 შეუდგა სოლომონი უფლის სახლის შენებას იერუსალიმში, მორიას მთაზე, სადაც ნაჩვენები ჰქონდა დავითს, მამამისს, იმ ადგილას, დავითმა რომ მოამზადა ორნა იებუსელის კალოზე. "},
	{2, "2 შენებას შეუდგა მეორე თვის მეორე დღეს, თავისი მეფობის მეოთხე წელს. "},
	{3, "3 აჰა, საფუძველი, რომელზედაც სოლომონმა ღვთის სახლის შენება დაიწყო: სიგრძით, ძველი საზომი ჭყრთით, სამოცი წყრთა იყო, სიგანით - ოცი წყრთა. "},
	{4, "4 სტოა, სიგრძეზე რომ გასდევდა ტაძარს, მისი სიგანის შესაბამისად ოცი წყრთა იყო; სიმაღლით - ას ოცი. შიგნიდან ხალასი ოქროთი მოაპირკეთა. "},
	{5, "5 კვიპაროსის ხეებით შემოსა დიდი სახლი, საუკეთესო ოქრო გადააკრა და მასზე პალმები და ჯაჭვები გამოაჭედინა. "},
	{6, "6 ძვირფასი ქვით მოაპირკეთა სახლი დასამშვენებლად. ოქრო კი ფარვაიმული ოქრო იყო. "},
	{7, "7 ოქროთი დაფარა სახლი - ძელები, კარის ზღურბლზე, მისი კედლები და კარები. კედლებზე ქერუბიმები ამოკვეთა. "},
	{8, "8 გააკეთა წმიდათაწმიდა: მისი სიგრძე სახლის სიგანის შესაბამისად, ოცი წყრთა იყო. ექვსასი ქანქარი სეუკეთესო ოქროთი დაფარა. "},
	{9, "9 ლურსმნები წონით ხუთი შეკელი ოქრო იყო. ქორედიც ოქროთი შემოსა. "},
	{10, "10 წმიდათაწმიდის სახლში გააკეთა ორი ქერუბიმის ქანდაკება და ოქროთი დაფერა ისინი. "},
	{11, "11 ქერუბიმების ფრთები სიგრძით ოცი წყრთა იყო, ერთის ფრთა - ხუთწყრთიანი, და სახლის კედელს ეხებდა. მეორის ფრთაც - ხუთწყრთიანი, მეორე ქერუბიმის ფრთას ეხებოდა."},
	{12, "12 მეორე ქერუბიმის ფრთაც - ხუთწყრთიანი, სახლის კედელს ეხებოდა. მეორის ფრთაც - ხუთწყრთიანი, პირველი ქერუბიმის ფრთას ეხებოდა. "},
	{13, "13 ამ ქერუბიმების ფრთები ოც წყრთაზე იყო გაშლილი. ისინი თავიანთ ფეხებზე იდგნენ და პირისახე სახლისკენ ჰქონდათ მიქცეული. "},
	{14, "14 გააკეთა კრეტსაბმელი ლურჯი, ძოწეული, მეწამული ნართისგან და სელისგან და მასზე ქერუბიმები გამოსახა. "},
	{15, "15 სახლის წინ სიგრძით ოცდაათი წყრთის ორი სვეტი გააკეთა, თითოეულის თავზე ხუთწყრთიანი სვეტისთავი იყო. "},
	{16, "16 გააკეთა დაბირში ჯაჭვები და სვეტისთავებზე მიამაგრა. გააკეთა ასი ბროწეული და ჯაჭვებზე ჩამოკიდა. "},
	{17, "17 ეს სვეტები ტაძრის წინ აღმართა, ერთი მარჯვნივ, ერთი მარცხნივ. მარჯვენას იაქინი დაარქვა, მარცხენას - ბოყაზი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 გააკეთა სპილენძის სამსხვერპლო; სიგრძით ოცი წყრთა, სიგანით - ოცი წყრთა, სიმაღლით - ოცი წყრთა. "},
	{2, "2 ჩამოასხა სპილენძის ზღვა, სრულიად მრგვალი, იგი კიდით კიდემდე ათი წყრთა იყო. სიმაღლე ხუთი წყრთა ჰქონდა, ოცდაათი წყრთა ძაფი სწვდებოდა გარს. "},
	{3, "3 მის ქვეშ, ირგვლივ, ხარების გამოსახულებები იყო შემორტყმულნი, ზღვას ათ წყრთაზე გარს ევლებოდა მასთან ერთად ჩამოსსმული ხარების ორი რიგი. "},
	{4, "4 იგი თორმეტ ხარზე იდგა: სამი ჩრდილოეთით იყურებოდა, სამი დასავლეთით იყურებოდა, სამი სამხრეთთი იყურებოდა, სამი აღმოსავლეთით იყურებოდა. ზღვა ზედ ედგათ და გავები ყველას შიგნით ჰქონდათ მიქცეული. "},
	{5, "5 სისქე ერთი მტკაველი ჰქონდა: კიდეები თასის კიდესავით ჰქონდა გაკეთებული და გაშლილ შროშანს ჩამოჰგავდა. სამიათას ბათს იტევდა. "},
	{6, "6 გააკეთა ათი საბანელი; ხუთი მარჯვენა ფრთაზე დადგა, ხუთი - მარცხენა ფრთაზე, რომ მათში თვითონაც განბანილიყვნენ და აღსავლენი საკლავიც ამოევლოთ. "},
	{7, "7 გააკეთა ათი ცალი ოქროს სასანთლე მათი წესის შესაფერისად და ტაძარში დადგა; ხუთი მარჯვენა ფრთაზე, ხუთიც მარცხენა ფრთაზე. "},
	{8, "8 გააკეთა ათი ტაბლა და ტაძარში დადგა. ხუთი მარჯვენა ფრთაზე, ხუთიც მარცხენა ფრთაზე. გააკეთა ასი ცალი ოქროს სასხურებელი. "},
	{9, "9 გააკეთა მღვდელთა ეზო, დიდი ეზო, ეზოს კარები და სპილენძით მოჭედა მათი კარები. "},
	{10, "10 ზღვა მარჯვენა ფრთაზე დადგა, სამხრეთ-აღმოსავლეთით. "},
	{11, "11 გააკეთა ხურამმა ქვაბები, აქანდაზები, სასხურებლები. მოამთავრა ხურამმა სამუშაო, რომელსაც სოლომონს უკეთებდა ღვთის სახლში. "},
	{12, "12 ორი სვეტი, ბუღაურები, სვეტისთავზე დასადგმელი ბალიშებითურთ, ორი ცხაური სვეტებზე დასადგმელი, ბუღაურების დასაფარავად, "},
	{13, "13 ოთხასი ბროწეული ორი ცხაურისთვის, ორ-ორი რიგი ბროწეულებისა ორთავე ცხაურისთვის, სვეტებზე დასადგმელი, ბუღაურების დასაფარავად. "},
	{14, "14 გააკეთა კვარცხლბეკები, კვარცხლბეკებზე საბანლები გააკეთა. "},
	{15, "15 მის ქვეშ ერთი ზღვა და თორმეტი ხარი. "},
	{16, "16 ქვაბები, აქანდაზები, ჩანგლები და ყველა სხვა ჭურჭელი, რაც კი ხურამმა სოლომონს გაუკეთა უფლის სახლისათვის, მბზინვარე სპილენძისა იყო. "},
	{17, "17 იორდანეს მიდამოებში ჩამოასხა ისინი მეფემ, თიხნარ ნიადაგზე, სუქოთსა და ცერედას შორის. "},
	{18, "18 გააკეთა სოლომონმა ყველა ეს ჭურჭელი ძალზე ბევრი, ისე, რომ გაურკვეველი იყო სპილენძის წონა. "},
	{19, "19 გააკეთა სოლომონმა ყველა ის ჭურჭელი, რაც კი ღვთის სახლშია: ოქროს სამსხვერპლო, ოქროსავე ტაბლები, რომელზედაც საკურთხი პური ეწყო; "},
	{20, "20 მთლიანი ოქროს სასანთლეები და მისი ლამპრები, რათა აენთოთ ისინი დაბირის წინ, წესისამებრ. "},
	{21, "21 ოქროს ყვავილები, ლამპრები და მაშები - მთლიანი ოქროსგან, "},
	{22, "22 დანები, სასხურებლები, კოვზები, საცეცხლურები მთლიანი ოქროსაგან; ასევე ტაძრის კარები: წმიდათაწმიდაში შესასვლელი შიდა კარებიც და ტაძრის საწმიდარში შესასვლელი კარებიც ოქროსი იყო. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 მოათავა ყველა საქმე, რასაც უფლის სახლისათვის აკეთებდა სოლომონი. მოიტანა სოლომონმა მამამისის, დავითის, შემოწირულობანი: ვერცხლი, ოქრო, ყველანაირი ჭურჭელი და ღვთის სახლის საგანძურში დააწყო. "},
	{2, "2 მაშინ შეყარა სოლომონმა იერუსალიმში ისრაელის უხუცესობა და შტოთა ყველა თავკაცი, ისრაელიანთა მამისსახლის უფროსები, რომ გამოესვენებინათ უფლის აღთქმის კიდობანი დავითის ქალაქიდან ანუ სიონიდან. "},
	{3, "3 შეიყარნენ მეფე სოლომონთან სადღესასწაულოდ, მეშვიდე თვეში. "},
	{4, "4 მოვიდა ისრაელის მთელი უხუცესობა და ლევიანებმა ასწიეს კიდობანი. "},
	{5, "5 წაასვენეს კიდობანი და სადღესასწაულო კარავი, და ყველა წმიდა ჭურჭელი, კარავში რომ ინახებოდა. წაასვენეს ისინი მღვდლებმა და ლევიანებმა. "},
	{6, "6 მეფე სოლომონი და მასთან შეკრებილი მთელი ისრაელის საზოგადოება იდგნენ კიდობნის წინ და მსხვერპლად სწირავდნენ ცხვარ-ძროხას, რომლის დათვლა და აღრიცხვა შეუძლებელი იყო სიმრავლის გამო. "},
	{7, "7 დაასვენეს მღვდლებმა უფლის აღთქმის კიდობანი მისთვის განკუთვნილ ადგილზე, ტაძრის დაბირში, წმიდათაწმიდაში, ქერუბიმთა ფრთებქვეშ. "},
	{8, "8 რადგან ფრთები ჰქონდათ გადაშლილი ქერუბიმებს კიდობნის ადგილზე და ზემოდან ფარავდნენ კიდობანს და კეტებს. "},
	{9, "9 კეტები იმ სიგრძისა იყო, რომ მისი თავები მოჩანდა კიდობნიდან, დაბირის წინ, გარეთ კი არ ჩანდა. დღემდე იქ არის ისინი. "},
	{10, "10 არაფერი იყო კიდობანზე, გარდა ფიქალებისა, მოსემ რომ ჩააწყო იქ ხორებში, როცა კავშირი შეკრა უფალმა ისრაელიანებთან ეგვიპტიდან მათი გამოსვლის შემდეგ. "},
	{11, "11 როცა გამოვიდნენ მღვდლები წმიდადან (რადგან ყველა იქ მყოფი მღვდელი განიწმიდა, განურჩევლად დასებისა, "},
	{12, "12 ასევე ყველა მგალობელი ლევიანი - ასაფი, ჰემანი, იედუთუნი, მათი ვაჟები და მათი მოძმენი - სელით შემოსილნი, წინწილებით, ქნარებით, ებნებით სამსხვერპლოს აღმოსავლეთით მდგარნი, მათთანვე ასოცი მესაყვირე მღვდელი, "},
	{13, "13 ხმაშეწყობილნი იყვნენ მესაყვირენი და მგალობელნი, რათა ერთხმად ეგალობათ უფლისთვის და ედიდებინათ), როცა იქუხა საყვირებისა და წინწილების ხმამ, უფლის ქებით: რადგან კეთილია იგი, რადგან უკუნისამდეა წყალობა მისი, მაშინ სახლი, უფლის სახლი, ღრუბელმა აავსო. "},
	{14, "14 და ვეღარ შეძლეს მღვდლებმა იქ დგომა და სამსახურის გაწევა ღრუბლის გამო, რადგან უფლის დიდებამ აღავსო ღვთის სახლი."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ka6 poems[] = {
	{1, "1 მაშინ თქვა სოლომონმა: ბნელში დავანება ინება უფალმა. "},
	{2, "2 სახლი აგიშენე სავანედ შენდა, სამყოფელი სამარადისო სამკვიდრებლად. "},
	{3, "3 პირი ხალხისკენ იბრუნა მეფემ და აკურთხა ისრაელის კრებული. ფეხზე იდგა მთელი ისრაელის კრებული. "},
	{4, "4 თქვა: კურთხეულ იყოს უფალი, ღმერთი ისრაელისა, რომელიც თავისი პირით ელაპარაკა დავითს, მამაჩემს, და თავისი ხელით შეასრულა, რასაც ამბობდა: "},
	{5, "5 იმ დღიდან, რაც ეგვიპტის ქვეყნიდან გამოვიყვანე ჩემი ერი, ისრაელის არცერთ ტომში არ ამირჩევია ქალაქი სახლის ასაშენებლად, რათა იქ დამკვიდრებელიყო ჩემი სახელი და კაციშვილი არ ამირჩევია, ჩემი ერის, ისრაელის წინამძღოლად. "},
	{6, "6 მხოლოდ იერუსალიმი ავირჩიე ჩემი სახელის დასამკვიდრებლად, და დავითი ავირჩიე ჩემს ერზე, ისრაელზე დასადგენად. "},
	{7, "7 გულში ჰქონდა მამაჩემს, დავითს, სახლის აშენება უფლის, ისრაელის ღმერთის სახელზე. "},
	{8, "8 უთხრა უფალმა მამაჩემს, დავითს: გულში რომ გქონდა ჩემს სახელზე სახლის აშენება, კარგი ჰქენი, რომ გულში გქონდა ეს საქმე. "},
	{9, "9 ოღონდ შენ არ ააშენებ სასლს, არამედ შენი შვილი. შენი საზარდულიდან გამოსული ააშენებს სახლს ჩემს სახელზე."},
	{10, "10 დაამტკიცა უფალმა თავისი ნათქვამი სიტყვა და, აჰა, მე დავდექი მამაჩემის, დავითის, ადგილზე, ავედი ისრაელის ტახტზე, როგორც ნაბრძანები ჰქონდა ეფალს, და უფლის, ისრაელის ღმერთის სახელზე ავაშენე სახლი. "},
	{11, "11 დავასვენე იქ კიდობანი, რომელშიც უფლის აღთქმა ინახება, ისრაელიანებს რომ დაუდო. "},
	{12, "12 დადგა უფლის სამსხვერპლოს წინ მთელი ისრაელის კრებულისკენ პირშექცევით და ხელები აღაპყრო. "},
	{13, "13 (გაკეთებული ჰქონდა სოლომონს სპილენძის კვარცხლბეკი, სიგრძით ხუთი წყრთა, სიგანითაც ხუთი წყრთა, სიმაღლით სამი წყრთა. შედგა მასზე), მუხლი მოიყარა მთელი ისრაელის კრებულის წინაშე და ხელები აღაპყრო ცისკენ. "},
	{14, "14 თქვა: უფალო, ღმერთო ისრაელისა! არ არსებობს მენი მსგავსი ღმერთი არც ცაში და არც ქვეყნად. შენ ინახავ აღთქმასა და წყალობას შენს მორჩილთა მიმართ, რომელნიც მთელი გულით დადიან შენს წინაშე. "},
	{15, "15 შენ შეუნახე სიტყვა შენს მორჩილს, მამაჩემს, დავითს, და დღეს შენმა ხელმა აღასრულა, რაც შენს ბაგეებს ჰქონდა ნაბრძანები. "},
	{16, "16 ახლაც შეუნახე უფალო, ღმერთო ისრაელისა, შენს მორჩილს - მამაჩემს, დავითს, შენი ნათქვამი სიტყვა, რომ უთხარი: არ გამოგელევაო მემკვიდრე ჩემს წინამე, ისრაელის ტახტზე მჯდომარე, ოღონდ შეინახონ შენმა შვილებმა წესი და რიგი და იარონ ჩემს წინაშე, როგორც შენ დადიოდი ჩემს წინაშე. "},
	{17, "17 ახლაც მტკიცე იყოს, უფალო, ღმერთო ისრაელისა, შენი სიტყვა, შენს მორჩილს - მამაჩემს, დავითს, რომ უბრძანე. "},
	{18, "18 ნუთუ ნამდვილად იმკვიდრებს მიწაზე ღმერთი? აჰა, ვერ იტევენ მას ცანი და ცანი ცათანი, როგორღა დაიტევს ეს ჩემი აშენებული სახლი? "},
	{19, "19 მოხედე შენი მორჩილის ლოცვა-ვედრებას, უფალო, ღმერთო ჩემო, ისმინე ღაღადი და ლოცვა, რომლითაც მოგმართავს შენი მორჩილი, "},
	{20, "20 რომ თვალი გეჭიროს ამ სახლზე ღამით და დღისით ამ ადგილზე, რომლის გამოც ნათქვამი გაქვს, აქ იქნებაო ჩემი სახელი. რომ ისმინო ლოცვა, რომელსაც იტყვის ამ ადგილას შენი მორჩილი. "},
	{21, "21 ისმინე შენი მორჩილისა და შენი ერის, ისრაელის, ვედრება, როცა დადგებიან ლოცვად ამ ადგილას; ისმინე შენს სამყოფელ ადგილზე ცათა შინა, ისმინე და შეგვიწყალე. "},
	{22, "22 თუ შესცოდავს ვინმე თავის თვისტომს და ფიცით დააფიცებს მას, და მივა ეს ფიცი შენს სამსხვერპლოსთან ამ სახლში, "},
	{23, "23 მაშინ მოუსმინე ციდან და სამართალი გაუჩინე შენს მორჩილთ; მტყუანი გაამტყუნე, რომ მის თავზე იყოს მისი საქციელი. მართალი კი გაამართლე, რომ მისი სიმართლისაებრ მიეგოს. "},
	{24, "24 თუ დამარცხდება მტერთან შენი ერი, ისრაელი, იმის გამო, რომ შეგცოდეს, მერე კი მოიქცევა შენსკენ, ქებას შეასხამს შენს სახელს და დაგიწყებს ლოცვა-ვედრებას ამ სახლში, "},
	{25, "25 მაშინ მოუსმინე ციდან და მიუტევე შეცოდება შენს ერს, ისრაელს, დააბრუნე იმ მიწაზე, რომელიც მის მამა-პაპას მიეცი. "},
	{26, "26 როცა დაიკეტება ცა და არ იწვიმებს შეცოდების გამო შენს წინაშე, და დაიწყებენ ლოცვას ამ ადგილას, განადიდებენ შენს სახელს, განერიდებიან ცოდვებს, რადგან უკვე დასჯილი გეყოლება ისინი, "},
	{27, "27 მაშინ მოუსმინე ციდან და მიუტევე შეცოდება შენს მორჩილთ და შენს ერს ისრაელს, რომ დააყენო სასიკეთო გზაზე, სადაც სიარული მართებთ, აწვიმო წვიმა მათ მიწაზე, რომელიც სამკვიდრებლად მიგიცია შენი ერისათვის. "},
	{28, "28 შიმშილობა იქნება ქვეყანაზე, შავი ჭირი, მწველი ხორშაკი, სიყვითლე, კალია თუ მატლი, ან თუ მტერი შემოადგება ქვეყანაში მის კარიბჭეებს, უბედურება მოხდება რამე თუ სნეულება, "},
	{29, "29 ყოველი ლოცვა, ყოველი ვედრება, რომელიც იქნება თითოეული ადამიანისაგან და მთელი შენი ერისაგან, ისრაელისგან, როდესაც ყველა გაიგებს თავის უბედურებას და ხელს გამოიწვდის ამ სახლისკენ, "},
	{30, "30 ისმინე ციდან, შენი სამყოფელიდან და მიუტევე; მიაგე თითოეულს თავისი საქციელისამებრ, შენ, რომელმაც უწყი მათი გულები - რადგან მხოლოდ შენ უწყი ადამიანთა გული, - "},
	{31, "31 რათა მუდამ შენი შიში ჰქონდეთ, ვიდრე ცხოვრობენ ამ მიწაზე, რომელიც ჩვენი მამა-პაპისთვის მიგიცია. "},
	{32, "32 იმ უცხოელსაც უსმინე, რომელიც არ არის შენი ერისაგანი, ისრაელიანი, მაგრამ შორეული ქვეყნიდან მოვა შენი სახელის გამო. "},
	{33, "33 ისმინე ციდან, შენი სამყოფელიდან, და შეუსრულე, რასაც შეგთხოვს უცხოელი, რომ მთელი ქვეყნის ხალხებმა გაიგონონ შენი სახელი და შიში მიეცეთ შენი ერის, ისრაელის მსგავსად, რათა იცოდნენ, რომ შენი სახელი ჰქვია ამ სახლს, მე რომ ავაშენე. "},
	{34, "34 როცა მტერთან საბრძოლველად გავა შენი ერი, დაადგება გზას, რომელზედაც შენ დააყენებ, და დაიწყებს ლოცვას უფლისადმი იმ ქალაქისკენ პირშექცეული, შენ რომ აირჩიე და იმ სახლისაკენ, შენ სახელზე რომ აგაშენე, "},
	{35, "35 მაშინ ისმინე ციდან მათი ლოცვა და ღაღადისი და სამართალი გაუჩინე. "},
	{36, "36 როცა შეგცოდავენ - რადგან არ არსებობს უცოდველი კაცი, - განურისხდები, მტრების ხელში ჩააგდებ და ტყვედ წაასხამენ მტრის ქვეყანაში, შორს იქნება თუ ახლოს, "},
	{37, "37 გონს მოეგებიან იმ ქვეყანაში, სადაც იქნებიან ტყვედ, მოიქცევიან, შემოგღაღადებენ თავიანთი ტყვეობის ქვეყანაში, და იტყვიან: შევცოდეთ, დავაშავეთ, ბოროტება ჩავიდინეთო, "},
	{38, "38 როცა მთელი სულითა და გულით მოიქცევიან შენსკენ მათი მტრების ქვეყანაში, რომელშიც ტყვვდ წაასხეს და დაიწყებენ ლოცვას იმ ქვეყნისაკენ პირშექცეულნი, მათ მამა-პაპას რომ მიეცი, იმ ქალაქისაკენ, შენ რომ აირჩიე, იმ სახლისაკენ, მე რომ ავაშენე შენს სახელზე, "},
	{39, "39 მაშინ ისმინე ციდან, შენი სამყოფელიდან, მათი ლოცვა-ვედრება, სამართალი გაუჩანე და მიუტევე შენს ერს, ისრაელს, რომელმაც შეგცოდა. "},
	{40, "40 ახლა კი, ღმერთო, თვალღია იყავ და ყური მიაპყარ ამ ადგილზე ლოცვას. "},
	{41, "41 ახლა კი დაიძარ, უფალო ღმერთო, შენი განსასვენებლისკენ შენი ძლიერების კიდობანთან ერთად! შეიმოსონ შენმა მღვდლებმა, უფალო ღმერთო, ხსნა და შენმა მადლიანებმა სიკეთით გაიხარონ. "},
	{42, "42 უფალო ღმერთო! პირს ნუ შეაქცევ შენს ცხებულს, გაიხსენე დავითის, შენი მორჩილის, ქველი საქმეები. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct ka7 poems[] = {
	{1, "1 როცა კი სოლომონმა ლოცვა დაასრულა, ცეცხლი გადმოუშვა ზეციდან და შთანთქა აღსავლენი და მსხვერპლნი. უფლის დიდებამ აავსო სახლი. "},
	{2, "2 ვეღარ შედიოდნენ მღვდლები უფლის სახლში, რადგან უფლის დიდებით იყო ავსებული უფლის სახლი."},
	{3, "3 როცა დაინახეს ისრაელიანებმა სახლზე გადმომავალი ცეცხლი და უფლის დიდება, პირქვე დაეხვნენ ქვაფენილზე და თაყვანისცეს. აქებდნენ უფალს და ამბობდნენ: კეთილია იგი, რადგან უკუნისამდეა წყალობა მისი. "},
	{4, "4 შესწირეს მსხვერპლი უფალს მეფემ და მთელმა ერმა. "},
	{5, "5 დაკლა სოლომონმა ოცდაორი ათასი ხარი და ოცი ათასი ცხვარი. აკურთხეს ღვთის სახლი მეფემ და მთელმა ერმა. "},
	{6, "6 მღვდლები თავ-თავიანთ სამსახურებელ ადგილებზე იდგნენ, ლევიანები კი დავითის გაკეთებული საუფლო საკრავებით აქებდნენ უფალს: რადგან უკუნისამდეა მისი წყალობა! ისევე, როგორც დავითი აქებდა მათი ხელით. მღვდლები საყვირებს აყვირებდნენ მათ გვერდით და ფეხზე იდგა მთელი ისრაელი. "},
	{7, "7 განათლა სოლომონმა შუა ეზო უფლის სახლის წინ, რადგან აღავლინა იქ აღსავლენი და შესწირა სამადლობელი მსხვერპლის ლურთი, რადგან სოლომონის გაკეთებულმა სპილენძის სამსხვერპლომ ვეღარ დაიტია აღსავლენი ძღვენი და ლურთები. "},
	{8, "8 შვიდდღიანი დღესასწაული გადაიხადა იმჟამად სოლომონმა და მასთან ერთად მთელმა ისრაელმა - დიდმა კრებულმა ხამათიდან ვიდრე ეგვიპტის ხევამდე. "},
	{9, "9 მერვე დღეს გამართეს საზეიმო წვეულება, რადგან შვიდ დღეს ასრულებდნენ სამსხვერპლოს სატფურებას და შვიდ დღეს - დღესასწაულს. "},
	{10, "10 მეშვიდე თვის ოცდამესამე დღეს გაისტუმრა ხალხი თავ-თავიანთ კარვებში მხიარულნი, გულსავსენი იმ სიკეთის გამო, უფალმა რომ უყო დავითს, სოლომონს და ისრაელს, თავის ერს. "},
	{11, "11 დაასრულა სოლომონმა უფლის სახლი და სამეფო სახლი. ყოველივე გულუხვად გაიღო სოლომონმა უფლის სახლისა და თავისი სახლის წარმატებით ასაშენებლად. "},
	{12, "12 ღამით გამოეცხადა უფალი სოლომონს და უთხრა: შევისმინე შენი ლოცვა-ვედრება და ავირჩიე ეს ადგილი მსხვერპლის შესაწირავ სახლად. "},
	{13, "13 თუ ცას დავკეტავ და წვიმა აღარ მოვა, ან თუ კალიას დედამიწის გადაჭმას ვუბრძანებ, ან თუ შავ ჭირს მოვუვლენ ჩემს ერს, "},
	{14, "14 და ჩემი ერი, რომელიც ჩემი სახელით იწოდება, ქედს მოიდრეკს, ილოცებს, ძებნას დამიწყებს და შემობრუნდება თავისი უკეთური გზიდან, მაშინ ციდან მივუსმენ, მივუტევებ ცოდვებს და განვკურნავ მათ ქვეყანას. "},
	{15, "15 ახლა თვალი გახელილი მექნება და ყურთასმენა მიპყრობილი ლოცვა-ვედრებისადმი ამ ადგილზე. "},
	{16, "16 ახლა ავირჩიე და ვაკურთხე ეს სახლი ჩემი სახელის სამარადისო სამკვიდრებლად. აქ იქნება ყოველდღე ჩემი თვალი და გული. "},
	{17, "17 თუ ივლი ჩემს წინაშე, როგორც მამაშენი, დავითი დადიოდა და ყველაფერს აასრულებ, რაც ნაბრძანები მაქვს შენთვის, დაიცავ ჩემს წესს და სამართალს, "},
	{18, "18 გავამტკიცებ შენს სამეფო ტახტს, როგორც დავითს, მამაშენს აღვუთქვი და ვუთხარი: არ გაგიწყდება-მეთქი ხელმწიფე ისრაელში. "},
	{19, "19 მაგრამ თუ გამიდგებით და მიატოვვბთ ჩემს წესებსა და ბრძანებებს, მე რომ მოგეცით, შეუდგებით უცხო ღმერთებს და თაყვანს სცემთ მათ, "},
	{20, "20 ამოვძირკვავ მათ ჩემი მიწიდან, რომელიც მათ მივეცი, და ამ სახლს, რომელიც გავნათლე ჩემი სახელით, მოვიშორებ ჩემი პირიდან. საარაკოდ და სათრეველად გავხდი ყველა ხალხს შორის. "},
	{21, "21 ყველა, ვინც კი ჩაუვლის ამ სახლს, ერთ დროს აღზევებულს, გაოგნდება და იტყვის: ასე რისთვის მოექცა უფალი ამ ქვეყანას და ამ სახლს? "},
	{22, "22 იტყვიან: რადგან დაივიწყეს უფალი, თავიანთი მამა-პაპის ღმერთი, რომელმაც ეგვიპტის ქვეყნიდან გამოიყვანა ისინი, მოეჭიდნენ სხვადასხვა ღმერთებს, თაყვანს სცემდნენ და მათ ემსახურებოდნენ. ამისათვის დააწია მათ უფალმა ყველა ეს უბედურება. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct ka8 poems[] = {
	{1, "1 ოცი წლის თავზე დაასრულა სოლომონმა უფლის სახლისა და თავისი სახლის შენება. "},
	{2, "2 ქალაქები, რომელიც ხურამმა მისცა სოლომონს, გააშენა სოლომონმა და ისრაელიანები ჩაასახლა იქ. "},
	{3, "3 მაშინ გაილაშქრა სოლომონმა ხამათ-ცობაზე და დაიპყრო იგი. "},
	{4, "4 ააშენა თადმორი უდაბნოში, და ყველა ის სამარაგო ქალაქი, ხამათში რომ ააშენა. "},
	{5, "5 ააშენა ზემო ბეთ-ხორონი და ქვემო ბეთ-ხორონი - გალავნებით, კარიბჭეებით და ხანდაკებით გამაგრებული ქალაქები, "},
	{6, "6 ბაყალათი და სამარაგო ქალაქები, რომლებიც კი ჰქონდა სოლომონს, ეტლის ქალაქები, ცხენოსანთა ქალაქები, და ყველაფერი, რისი აშენებაც უნდოდა იერუსალიმში, ლიბანში, და მთელს თავის სახელმწიფოში. "},
	{7, "7 ყველა ხალხი, რომელიც დარჩა ხეთელთაგან, ამორეველთაგან, ფარიზეველთაგან, ხიველთაგან და იებუსეველთაგან, რომელიც არ იყო ისრაელიანთა მოდგმისა, "},
	{8, "8 და მათი შთამომავლები, მათ შემდეგ რომ დარჩნენ ქვეყანაში, და არ გაუწყვეტიათ ისრაელიანებს, ბეგარაზე მომუშავეებად განაწესა სოლომონმა და ასე არიან დღემდე. "},
	{9, "9 ისრაელიანთაგან კი არავინ დაუყენებია სოლომონს თავის ბეგარაზე, რადგან მეომრებად ჰყავდა ისინი, თავის მცველთა მეთაურებად, თავისი ეტლებისა და მხედრების მეთაურებად. "},
	{10, "10 ორას ორმოცდაათი კაცი ჰყავდა მეფე სოლომონს ზედამხედველთა უფროსებად, რომელნიც ხალხს უძღვებოდნენ. "},
	{11, "11 ფარაონის ასული სოლომონმა დავითის ქალაქიდან აიყვანა სახლში, რომელიც მას აუშენა, რადგან თქვა, არ უნდა ცხოვრობდესო ჩემი ცოლი დავითის, ისრაელის მეფის, სახლში, რადგან წმიდაა იგი, სადაც უფლის კიდობანი შევიდა. "},
	{12, "12 მაშინ დაიწყო სოლომონმა უფლისთვის აღსავლვნის შეწირვა უფლის სამსხვერპლოზე, რომელიც სტოასთან ააგო, "},
	{13, "13 ყოველდღიური აღვლენა, მოსეს მცნებისამებრ, შაბათების და ახალმთვარობების დაცვა, წელიწადში სამი დღესასწაულის უფუარობის, შვიდეულისა და კარვობის ზეიმი. "},
	{14, "14 დავითის, მამამისის მიერ დადგენილი წესის მიხედვით ჩააყენა მღვდელთა დასები თავიანთ სამსახურში, ლევიანები კი მათ დაცვაში, რათა სადიდებილი ეთქვათ და მღვდლებთან ერთად ემსახურათ ყოველდღიური მოვალეობის შესასრულებლად. ასევე ყველა კარს თავისი კარისმცველები მიუჩინა, თავ-თავისი დასების მიხედვით, რადგან ასე ბრძანა დავითმა, ღვთისკაცმა. "},
	{15, "15 არ უღალატიათ მეფის იმ ბრძანებისთვის, მღვდლებს, ლევიანებს, სხვა საქმეებსა და საგანძურს რომ შეეხებოდა. "},
	{16, "16 ასე ჰქონდა სოლომონს აწყობილი ყველა საქმე, საძირკვლის ჩაყრიდან დაწყებული, ვიდრე უფლის სახლი ბოლომდე არ გასრულდა. "},
	{17, "17 მაშინ წავიდა სოლომონი ზღვისპირეთში, ყეციონგებერსა და ილოთში, ედომის ქვეყანაში. "},
	{18, "18 ხურამმა თავის მორჩილთა ხელით ხომალდები და ზღვისმცოდნე თავისი მორჩილნი გაუგზავნა. ისინი სოლომონის მორჩილებთან ერთად ოფირში ჩავიდნენ, ოთხასორმოცდაათი ქანქარი ოქრო წამოიღეს იქიდან და მეფე სოლომონს მოუტანეს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct ka9 poems[] = {
	{1, "1 შეიტყო საბას დედოფალმა სოლომონის ამბავი და მოვიდა იერუსალიმში, რომ გამოცანებით გამოეცადა სოლომონი. მოვიდა დიდძალი დოვლათით. აქლემებს მოჰქონდათ ნელსაცხებლები, მრავლად ოქრო და ძვირფასი თვლები. მოვიდა მასთან და ელაპარაკა ყველაფერზე, რაც გულში ჰქონდა. "},
	{2, "2 ყველა კითხვაზე გასცა პასუხი სოლომონმა. არაფერი იყო მეფისთვის დაფარული, რომ უპასუხოდ დაეტოვებინა. "},
	{3, "3 დაინახა საბას დედოფალმა სოლომონის სიბრძნე, ნახა მისი აშენებული სახლი, "},
	{4, "4 მისი სუფრის სასმელ-საჭმელი, მის მორჩილთა საცხოვრებელი, მის მსახურეულთა საქმიანობა და შესამოსელი, მისი მწდეები და მათი შესამოსელი, მისი კიბეები, რითაც ის უფლის სახლში ადიოდა, და გაოგნებული დარჩა. "},
	{5, "5 უთხრა მეფეს: მართალი ყოფილა, რაც ჩემს ქვეყანაში მქონდა გაგონილი შენზე და შენს სიბრძნეზე. "},
	{6, "6 სიტყვების არ მჯეროდა, ვიდრე თავად არ მოვედი და ჩემი თვალით არ ვიხილე. აჰა, თურმე ნახევარიც არ უთქვამთ ჩემთვის შენს უსაზღვრო სიბრძნეზე. ყველაფერს გადააჭარბე, რაც გაგონილი მქონდა. "},
	{7, "7 ბედნიერია შენა ხალხი, ბედნიერნი არიან შენი მორჩილნი, მუდამ შენს წინაშე რომ დგანან და ისმენენ შენს სიბრძნეს. "},
	{8, "8 კურთხეულ იყოს უფალი, შენი ღმერთი, რომელმაც მოგისურვა, რათა მის ტახტზე დაესვი უფლის, შენი ღმერთის მეფედ. ისრაელისადმი შენი ღმერთის სიყვარულის გამო დაგაყენა მასზე მეფედ, მის სამარადისოდ განსამტკიცებლად და სამართლისა და სიმართლის გასაჩენად. "},
	{9, "9 მისცა მეფეს ასოცი ქანქარი ოქრო, დიდძალი ნელსაცხებელი და ძვირფასი ქვები. არ იყო ისეთი ნელსაცხებელი, საბას დედოფალს მეფე სოლომონისთვის რომ არ მიეცა. "},
	{10, "10 ხურამისა და სოლომონის მორჩილებმა ოფირიდან ჩამოტანილ ოქროსთან ერთად სანდალოზის ხეები და ძვირფასი ქვები ჩამოიტანეს. "},
	{11, "11 გააკეთა მეფემ სანდალოზისგან საფეხურები უფლის სახლისათვის და სამეფო სახლისათვის. ებნები და ქნარები მგალობელთათვის. ამის მსგავსი მანამდე არასდროს უნახავთ იუდას ქვეყანაში. "},
	{12, "12 მისცა მეფე სოლომონმა საბას დედოფალს ყველაფერი მისთვის სასურველი, რაც კი მან ითხოვა, იმაზე მეტი, რაც თვითონ მოართვა მეფეს. უკან გაბრუნდა და წავიდა თავის ქვეყანაში თავის მორჩილებთბ ერთად. "},
	{13, "13 ექვსას სამოცდა ექვსი ქანქარი ოქრო შემოსდიოდა სოლომონს ყოველწლიურად. "},
	{14, "14 იმის გარდა, რა ოქრო-ვერცხლიც მოგზაურებს, ვაჭრებს, არაბთა მეფეებს და მხარეთა გამგებლებს შემოჰქონდათ. "},
	{15, "15 გააკეთა მეფე სოლომონმა ორასი დელამფარი ნაჭედი ოქროსაგან. ექვსასი შეკელი ოქრო დაიხარჯა თითოეულ დელამფარზე. "},
	{16, "16 გააკეთა სამასი ფარი ნაჭედი ოქროსაგან, სამასი შეკელი ოქრო დაიხარჯა თითოეულ ფარზე. დააწყო ისინი მეფემ ლიბანის მაღნარის სახლში. "},
	{17, "17 გააკეთა მეფემ სპილოს ძვლისაგან დიდი ტახტი და ხალასი ოქროთი დაფერა. "},
	{18, "18 ექვსი საფეხური ჰქონდა ტახტს, ოქროს ფეხსადგამი ჰქონდა ტახტს მიდგმული, საჯდომის ორსავე მხარეს სანიდაყვეები ჰქონდა, ხოლო სანიდაკვეებს თითო ლომი ედგა გვერდით. "},
	{19, "19 ექვს საფეხურზე, აქეთ-იქით, სხვა თორმეტი ლომი იდგა. "},
	{20, "20 მეფე სოლომონის ყველა სასმისი ოქროსი იყო, ყველა ჭურჭელი ლიბანის მაღნარის სახლში რჩეული იყო. ვერცხლი და სპილენძი არაფრად მიაჩნდათ სოლომონის დროს, "},
	{21, "21 რადგან მეფის ხომალდები ხურამის მორჩილებთან ერთად თარშიშში დადიოდნენ. თარშიშული ხომალდები სამ წელიწადში ერთხელ მოდიოდნენ და მოჰქონდათ ოქრო-ვერცხლი, სპილოს ძვალი, მოჰყავდათ ყაფუზუნები და ფარშევანგები. "},
	{22, "22 განდიდდა მეფე სოლომონი ქვეყნის ყველა მეფეზე მეტად თავისი სიმდიდრითა და სიბრძნით. "},
	{23, "23 ამქვეყნად ყველა მეფე ესწრაფოდა სოლომონის ნახვას, რომ მოესმინა მისი სიბრძნე, რომელიც გულში ჩაუდო ღმერთმა. "},
	{24, "24 ყველას თავისი ძღვენი მოჰქონდა: ოქროსა და ვერცხლის ჭურჭელი, შესამოსელი, საჭურველი, ნელსაცხებლები, ცხენები და ჯორები, ასე იყო ყოველწლიურად. "},
	{25, "25 სოლომონს ოთხი ათასი თავლა ჰქონდა, ჰყავდა ეტლები და თორმეტი ათასი ცხენოსანი. განალაგა ისინი ეტლების სადგომ ქალაქებში და იერუსალიმში, თავისთან. "},
	{26, "26 მისი ხელისუფლება ვრცელდებოდა ყველა მეფეზე ევფრატიდან ფილისტიმელთა ქვეყნამდე და ეგვიპტის საზღვრებამდე. "},
	{27, "27 ვერცხლი ქვებს გაუთანაბრა მეფემ იერუსალიმში, ხალო კედარი სიკომორის ხეს, დაბლობში რომ იზრდება. "},
	{28, "28 სოლომონის ცხენები ეგვიპტიდან და ყველა ქვეყნიდან იყო მოყვანილი. "},
	{29, "29 სოლომონის დანარჩენი ამბები - პირველნი და უკანასკნელნი სწერია ნათან წინასწარმეტყველის მატიანეში, ახია შილონელის წინასწარმეტყველებაში, იეყდო მისნის ხილვაში, იერობოამ ნაბატის ძეს რომ შეეხება. "},
	{30, "30 იმეფა სოლომონმა იერუსალიმში მთელს ისრაელზე ორმოცი წელი. "},
	{31, "31 განისვენა სოლომონმა თავის მამა-პაპასთან და დამარხეს დავითის, მამამისის ქალაქში. მის ნაცვლად მისი ძე რობოამი გამეფდა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct ka10 poems[] = {
	{1, "1 წავიდა შექემში რობოამი, რადგან შექემში იყო მისული მთელი ისრაელი მის გასამეფებლად. "},
	{2, "2 როცა ეს ამბავი შეიტყო, იერობოამ ნაბატის ძემ, რომელიც ეგვიპტეში იმყოფებოდა, სადაც სოლომონ მეფისგან იყო გაქცეული, ეგვიპტიდან გამობრუნდა იერობოამი. "},
	{3, "3 შეუთვალეს და დაიბარეს იგი. მოვიდა იერობოამი და მთელი ისრაელი და ასე უთხრეს რობოამს: "},
	{4, "4 უღელი დაგვიმძიმა მამაშენმა. ახლა შეგვიმსუბუქე ეს ძნელი სამუშაო და მძიმე უღელი, მამაშენმა რომ დაგვადო, და დაგემორჩილებით. "},
	{5, "5 მიუგო მათ: წადით და სამი დღის მერე მოდით ჩემთან. წავიდა ხალხი. "},
	{6, "6 რჩევა ჰკითხა მეფე რობოამმა უხუცესებს, რომელნიც მამამისს, სოლომონს ახლდნენ მის სიცოცხლეში, და უთხრა: როგორ მირჩევთ, რა პასუხი გავცე ამ ხალხს? "},
	{7, "7 ასე უთხრეს: თუ კეთილი იქნები ამ ხალხისთვის, აამებ მათ, კეთილ სიტყვებს ეტყვი, მაშინ სამუდამოდ შენი მორჩილნი იქნებიან. "},
	{8, "8 არ დაუგდო ყური უხუცესების რჩევას, რაც ურჩიეს, და ჰკითხა რჩევა მოყმეთ, რომლებიც მასთან იყვნენ შეზრდილნი და ემსახურებოდნენ. "},
	{9, "9 უთხრა მათ: რას მირჩევთ, რა პასუხი გავცე მაგ ხალხს, რომ მეუბნებიან, შეგვიმსუბუქეო მამაშენის დადებული უღელი? "},
	{10, "10 ელაპარაკნენ მოყმენი, მასთან როშ იყვნენ შეზრდილნი, და ურჩიეს: ასე უთხარი იმ ხალხს, რომელიც გეუბნება, უღელი დაგვიმძიმა მამაშენმა და შენ კი უნდა შეგვიმსუბუქო, ასე უთხარი მათ: მამაჩემის წელზე მსხვილია-თქო ჩემი ნეკათითი. "},
	{11, "11 ხომ დაგადგათ მამაჩემმა მძიმე უღელი, მე კი უფრო დაგიმძიმებთ უღელს! ხომ შოლტებით გსჯიდათ მამაჩემი, მე მორიელებით დაგსჯით! "},
	{12, "12 მოვიდნენ იერობოამი და მთელი ხალხი მესამე დღეს რობოამთან, როგორც ნაბრძანები ჰქონდა მეფეს, სამი დღის შემდეგ მოდითო ჩემთან. "},
	{13, "13 მკაცრად უპასუხა მეფემ ხალხს, ყური არ ათხოვა მეფე რობოამმა უხუცესთა რჩევას. "},
	{14, "14 მოყმეთა რჩევისამებრ ელაპარაკა და უთხრა მათ: ხომ დაგიმძიმათ მამაჩემმა უღელი, მე კიდევ უფრო დაგიმძიმებთ! ხომ შოლტებით გსჯიდათ მამაჩემი, მე მორიელებით დაგსჯით! "},
	{15, "15 არ შეიწყნარა მეფემ ხალხის სათხოვარი, რადგან ასეთი იყო ღვთის ნება, რათა აღსრულებულიყო უფლის სიტყვა, რაც ნათქვამი ჰქონდა იერობოამ ნაბატის ძისათვის, ახია სილოამელის პირით. "},
	{16, "16 როცა დაინახა მთელმა ისრაელმა, რომ არ უსმინა მათ მეფემ, მაშინ სიტყვა შეუბრუნა ხალხმა მეფეს და უთხრა: რა წილი გვიდევს დავითიში? რა მემკვიდრეობა გვაქვს იესეს ძისაგან? თქვენ-თქვენი კარვებისაკენ, ისრაელო! ახლა შენ მიხედე შენ სახლს, დავით! და წავიდ-წამოვიდა თავ-თავის კარვებში ისრაელი. "},
	{17, "17 მხოლოდ იუდას ქალაქებში მცხოვრებ ისრაელიანებზე შერჩა მეფობა რობოამს. "},
	{18, "18 გაგზავნა მეფე რობოამმა ადორამი, ხარკის ამკრეფთა უფროსი, მაგრამ ქვებით ჩაქოლეს ისრაელიანებმა და მოკვდა იგი. მაშინ სასწრაფოდ შეხტა მეფე რობოამი ეტლზე და იერუსალიმში გაიქცა. "},
	{19, "19 განუდგა ისრაელი დავითის სახლს და ასეა ეს დღემდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct ka11 poems[] = {
	{1, "1 მოვიდა რობოამი იერუსალიმში და შეჰყარა იუდასა და ბენიამინის მთელი სახლი - ასოთხმოცი ათასი რჩეული მეომარი, რათა შებრძოლებოდნენ ისრაელს და მეფობა დაებრუნებინათ რობოამისთვის. "},
	{2, "2 გამოეცხადა ღვთის სიტყვა შემაყიას, ღვთისკაცს: "},
	{3, "3 ასე უთხარი რობოამ სოლომონის ძეს, იუდას მეფეს, მთელ ისრაელს და იუდასა და ბენიამინის მთელ სახლს: "},
	{4, "4 ასე ამბობს-თქო უფალი: ნუ გახვალთ საბრძოლველად თქვენს ძმებთან! თავ-თავის სახლში გაბრუნდეს ყველა, რადგან ჩემი ნებით მოხდა ეს ამბავი. ისმინეს უფლის სიტყვა და იერობოამთან საომრად გასულნი უკან გაბრუნდნენ. "},
	{5, "5 რობოამი იერუსალიმში ცხოვრობდა და ციხე-სიმაგრეებად აქცია ქალაქები იუდაში. "},
	{6, "6 მან ააშენა: ბეთლემი, ყეტამი, თეკოაყი, "},
	{7, "7 ბეთ-ცური, სოქო, ყადულამი, "},
	{8, "8 გათი, მარეშა, ზიფი, "},
	{9, "9 ადორაიმი, ლაქიში, ყაზეკა, "},
	{10, "10 ცარყა, აიალონი, ხებრონი - გამაგრებული ქალაქები, იუდასა და ბენიამინს რომ ეკუთვნოდა. "},
	{11, "11 გაამაგრა ეს ციხე-სიმაგრეები, ჩააყენა მათში წინამძღოლნი და მისცა სურსათ-სანოვაგის, ზეთისა და ღვინის მარაგი. "},
	{12, "12 ყველა ქალაქს ფარ-შუბები ჩამოურიგა და ძლიერ გაამაგრა. მის ხელში იყო იუდა და ბენიამინი. "},
	{13, "13 მღვდლები და ლევიანები, ვინც კი იყო მთელს ისრაილში, თავ-თავიანთი საზღვრებიდან შეუდგნენ მას. "},
	{14, "14 ვინაიდან ტოვებდნენ ლევიანები თავიანთ სანახებს, სამფლობელოებს და მიდიოდნენ იუდაში და იერუსალიმში, რადგან იერობოამი და მისი ძენი უშლიდნენ მათ უფლის მღვდლობას. "},
	{15, "15 დაიყენა მღვდლები გორაკებისთვის, ციკნებისთვის და ხბორებისთვის, თვითონ რომ გააკეთა. "},
	{16, "16 მათ მიჰყვნენ ისრაელის ყველა ტომიდან, ვინც გულით ეძებდა უფალს, ისრაელის ღმერთს. ისინი მოვიდნენ, რომ მსხვერპლი შეეწირათ უფლისთვის, თავიანთი მამა-პაპის ღმერთისთვის. "},
	{17, "17 გაამაგრეს იუდას სამეფო და სამ წელიწადს მხარს უჭერდნენ რობოამს, სოლომონის ძეს, რადგან ამ სამ წელს დადიოდა დავითისა და სოლომონის გზით. "},
	{18, "18 რობოამმა ცოლად შეირთო მახალათი, იერიმოთ დავითის ძის ასული და აბიხაილი, ელიაბ იესეს ძის ასული. "},
	{19, "19 უშვა მას ვაჟები: იეყუში, შემარია და ზაჰამი. "},
	{20, "20 ამის შემდეგ შეირთო მაყაქა, აბესალომის ასული. უშვა მას: აბია, ყათაი, ზიზა, შელომითი. "},
	{21, "21 რობოამს ყველა თავის ცოლზე და ხარჭაზე მეტად უყვარდა რეხაბყამი, სოლომონის ასული. რადგან თვრამეტი ცოლი და სამოცი ხარჭა ჰყავდა, შეეძინა ოცდარვა ვაჟი და სამოცი ქალი. "},
	{22, "22 დააყენა უფროსად რობოამმა აბია, მაყაქას ვაჟი, წინამძღოლად თავის ძმებში, რადგან მისი გამეფება ეწადა. "},
	{23, "23 გონივრულად მოიქცა და ყველა თავისი შვილი იუდასა და ბენიამინის ყველა კუთხეში და ყველა გამაგრებულ ქალაქში ჩაასახლა. უხვად მისცა სარჩო და უთხოვა მრავალი ცოლი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct ka12 poems[] = {
	{1, "1 როცა გამტკიცდა რობოამის მეფობა და გაძლიერდა, მაშინ მიატოვა მან უფლის რჯული და მასთან ერთად მთელმა ისრაელმა. "},
	{2, "2 რობოამის მეფობის მეხუთე წელს მოუხდა შიშაკი, ეგვიპტის მეფე, იერუსალიმს, რადგან შესცოდეს უფალს. "},
	{3, "3 ათას ორასი ეტლით, სამოცი ათასი მხედრით, მათან ერთად ურიცხვი ხალხი მოვიდა ეგვიპტიდან - ლიბიელები, სუქიელები, ქუშელები. "},
	{4, "4 აიღო იუდას გამაგრებული ქალაქები და იერუსალიმს მიადგა. "},
	{5, "5 მაშინ წინასწარმეტყველი შემაყია მივიდა რობოამთან და შიშაკს გარიდებულ, იერუსალიმში თავშეყრილ იუდას მთავრებთან, და უთხრა მათ: ასე ამბობს უფალი: რაკი თქვენ მიმატოვეთ, ახლა მეც მიგატოვებთ შიშაკის ხელში. "},
	{6, "6 დამორჩილდნენ ისრაელის მთავრები და მეფე, თქვეს: მართალია უფალი. "},
	{7, "7 როცა დაინახა უფალმა, რომ დამორჩილდნენ, გამოეცხადა უფლის სიტყვა შემაყიას და უთხრა: დამმორჩილდნენ ისინი, აღარ მოვსპობ, სულ მალე გამოვიხსნი და აღარ დაატყდება იერუსალიმს ჩემი რისხვა შიშაკის ხელით. "},
	{8, "8 მაგრამ მისი ყმები გახდებიან, რათა იცოდნენ როგორია ჩემი ყმობა და ამქვეყნიური მეფეების ყმობა. "},
	{9, "9 მიუხდა შიშაკი, ეგვიპტის მეფე, იერუსალიმს და წაიღო უფლის სახლისა და სამეფო სახლის განძეულობა, ყველაფერი წაიღო. წაიღო ოქროს ფარებიც, სოლომონმა რომ გააკეთა. "},
	{10, "10 დაამზადა მეფე რობოამმა მათ ნაცვლად სპილენძის ფარები და ჩააბარა მცველთა უფროსებს, რომელნიც სამეფო სახლის შესასვლელს დარაჯობდნენ. "},
	{11, "11 ყოველთვის, როცა მეფე უფლის სახლში შედიოდა, მცველებს მოჰქონდათ ისინი, და მერე ისევ აბრუნებდნენ მცველების ოთახში. "},
	{12, "12 რაკი დამორჩილდა, გაბრუნდა უფლის რისხვა მისგან და საბოლოოდ აღარ დაიღუპა. იუდაშიც კარგი ამბები იყო. "},
	{13, "13 გამტკიცდა მეფე რობოამი იერუსალიმში და მეფობდა. ორმოცდაერთი წლის იყო რობოამი, რომ გამეფდა, და ჩვიდმეტ წელიწადს იმეფა იერუსალიმში, ქალაქში, რომელიც უფალმა თავისი სახელის სამკვიდრებლად ამოარჩია ისრაელის ყველა ტომში. დედამისს ერქვა ნაყამა ყამონელი. "},
	{14, "14 ბოროტებას ჩადიოდა, რადგან მთელი გულმოდგინებით არ ეძებდა უფალს. "},
	{15, "15 რობოამის პირველი და უკანასკნელი ამბები ჩაწერილია წინასწარმეტყველ შემაყიასა და ყიდო მხილველის მატიანეში, საგვარტომო ნუსხის მიხედვით. გამუდმებული ომი იყო რობოამსა და იერობოამს შორის. "},
	{16, "16 განისვენა რობოამმა თავის მამა-პაპასთან და დამარხეს დავითის ქალაქში. მის ნაცვლად აბია, მისი ძე გამეფდა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct ka13 poems[] = {
	{1, "1 იერობოამის მეფობის მეთვრამეტე წელს აბია გამეფდა იუდაზე. "},
	{2, "2 სამ წელიწადს მეფობდა იერუსალიმში. დედამისი იყო მიქაიაჰუ, აბესალომის ასული, გიბყადან. ომი იყო ამტყდარი აბიასა და იერობოამს შორის. "},
	{3, "3 აბიამ ომში მამაც მებრძოლთაგან ოთხასი ათასი რჩეული ვაჟკაცი გამოიყვანა. იერობოამი კი მათ წინააღმდეგ საომრად რვაასი ათასი რჩეული და მამაცი მეომრით გამოვიდა. "},
	{4, "4 დადგა აბია ცემარაიმის მთაზე, ეფრემის მთებში რომაა, და თქვა: მისმინეთ, იერობიაამ და მთელო ისრაელო! "},
	{5, "5 განა არ იცით, რომ უფალმა, ისრაელის ღმერთმა, დავითსა და მის ძეებს მარილის აღთქმით მისცა მეფობა ისრაელზე სამარადჟამოდ? "},
	{6, "6 მაინც აღსდგა იერობოამ ნაბატის ძე, სოლომონ დავითის ძის მორჩილი, და გაილაშქრა თავისი ბატონის წინააღმდეგ. "},
	{7, "7 შემოიკრიბა თავის ირგვლივ უღირსი, უგვანი ხალხი, და სძლიეს რობოამ სოლომონის ძეს. რობოამი ყმაწვილი იყო და გულმხდალი, ამიტომ ვერ გაუძლო მათ. "},
	{8, "8 ახლა თქვენ ფიქრობთ, გაუმკლავდეთ უფლის სამეფოს, რომელიც დავითის ძეთა ხელშია. თქვენ ჩვენზე ბევრად მეტნი ხართ და თქვენთან არის ოქროს ხბოები, იერიაბოამმა რომ ღმერთებად დაგიყენათ. "},
	{9, "9 განა თქვენ არ გამორეკეთ უფლის მღვდლები - აარონის ძენი და ლევიანები? განა თქვენ არ იყავით, რომ მღვდლები სხვა ქვეყნების ხალხთა მსგავსად გაიჩინეთ? ყველა, ვინც თავის საკურთხევლად მოდის კურატითა და შვიდი ბატკნით, ცრუღმერთის მღვდელი ხდება. "},
	{10, "10 ჩვენ კი უფალი, ჩვენი ღმერთი გვყავს. არ მიგვიტოვებია იგი. მღვდლები უფალს ემსახურებიან, აარონის ძენი და ლევიანები თავიანთ საქმეზე დგანან. "},
	{11, "11 დილა-საღამოობით უფლისთვის აღსავლენს აღავლენენ, სურნელებას აკმევენ, საწირ პურს სუფთა ტაბლაზე აწყობენ, ანთებენ ლამპრებს ოქროს სასანთლეზე, ღამ-ღამობით რომ ენთონ, რადგან უფლის, ჩვენი ღმერთის მცნებებს ვასრულებთ, თქვენ კი მიატოვეთ ისინი. "},
	{12, "12 აჰა, ღმერთი და მისი მღვდლები ჩვენთან არიან და სათავეში გვიდგანან, მომარჯვებული გვაქვს მქუხარე საყვირები, თქვენს წინააღმდეგ დასაყვირებლად, ისრაელიანებო! არ გაბედოთ უფალთან, თქვენი მამა-პაპის ღმერთოან ბრძოლა, რადგან არ მოგემართებათ ხელი. "},
	{13, "13 ამასობაში იერობოამმა უკან ჩაუსაფრა მათ ხალხი, თვითონ იუდაელთა წინ იყვნენ, საფარი კი მათ უკან ეყენათ. "},
	{14, "14 თვალი მოავლო იუდამ და, აჰა, წინიდან და უკნიდან ომია გაჩაღებული. მაშინ მოუხმეს მათ უფალს და მღვდლებმაც ჩაჰბერეს საყვირებს. "},
	{15, "15 შეჰღაღადეს იუდაელებმა. როდესაც იუდაელებმა შეჰღაღადეს, ღმერთმა დაამარცხა იერობოამი და მთელი ისრაელი აბიასა და იუდას წინაშე. "},
	{16, "16 გაურბოდნენ ისრაელის ძეები იუდას, მაგრამ ღმერთმა მათ ხელში ჩაყარა ისინი. "},
	{17, "17 სძლია მათ აბიამ და მისმა ხალხმა დიდი ძლევით. ხუთასი ათასი მკვდარი დაეცა ისრაელის რჩეულ ვაჟკაცთაგან. "},
	{18, "18 მაშინ მოდრკნენ ისრაელიანები, იუდაელები კი გაძლიერდნენ, რადგან მინდობილნი იყვნენ უფალზე, თავიანთი მამა-პაპის ღმერთზე. "},
	{19, "19 გაედევნა აბია იერობოამს და წაართვა ქალაქები: ბეთ-ელი თავისი დაბებით, იეშანა თავისი დაბებით, ყეფრაინი თავისი დაბებით. "},
	{20, "20 ვეღარ მოიკრიბა იერობოამმა ძალა აბიაჰუს დღეებში, დაჰკრა მას უფალმა და მოკვდა იგი. "},
	{21, "21 აბიაჰუ კი გამტკიცდა და თოთხმეტი ცოლი შეირთო. შეეძინა ოცდაორი ვაჟი და თექვსმეტი ქალი. "},
	{22, "22 აბიას დანარჩენი ამბები, საქმეები და მისი სიტყვები აღწერილია ყიდო წინასწარმეტყველის წიგნში. "},
	{23, "23 განისვენა აბიამ თავის მამა-პაპასთან და დამარხეს დავითის ქალაქში. მის ნაცვლად ასა, მისი ძე, გამეფდა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct ka14 poems[] = {
	{1, "1 ასას დროს ათ წელიწადს მოსვენებული იყო იუდას ქვეყანა. კეთილად და სწორად იქცეოდა ასა უფლის, თავისი ღმერთის თვალში. "},
	{2, "2 მოშალა უცხო სამსხვერპლოები და გორაკები, შემუსრა კერპები და აჩეხა აშერები. "},
	{3, "3 უბრძანა იუდას გამოეძია უფალი, თავისი მამა-პაპის ღმერთი, და შეესრულებინა მისი რჯული და მცნებები. "},
	{4, "4 მოშალა იუდას ყველა ქალაქში გორაკები და მზის სვეტები. მოისვენა სამეფომ მის წინაშე. "},
	{5, "5 ააგო იუდაში ციხე-ქალაქები, რადგან მოსვენებული იყო ქვეყანა და არც ომი არ ჰქონია იმ წლებში, რაკი უფალმა სიმშვიდე მისცა. "},
	{6, "6 უთხრა იუდას: ავაშენოთ ეს ქალაქები და გალავანნი, კოშკები, კარიბჭეები და ბურჯები შემოვავლოთ. ქვეყანა კვლავ ჩვენს ხელშია, რადგან გამოვიძიეთ უფალი, ღმერთი ჩვენი. გამოვიძიეთ და ირგვლივ სიმშვიდე გვიბოძა. დაიწყეს შენება და ხელი მოემართათ. "},
	{7, "7 ასას ჯარი ჰყავდა: სამასი ათასი ფარითა და შუბით შეიარაღებული კაცი იუდადან და ორას ოთხმოცი ათასი ფარით შეიარაღებული და მშვილდოსანი კაცი ბენიამინიდან. ყველანი მაგარი ვაჟკაცები იყვნენ. "},
	{8, "8 წამოვიდა მათ წინააღმდეგ ზერახ ქუშელი ათასი ათასიანი ჯარით, სამასი ეტლით და მერეშას მოადგა. "},
	{9, "9 გამოვიდა ასა მის წინააღმდეგ. საბრძოლველად დაეწყვნენ ცეფათას ხეობაში, მარეშას მახლობლად. "},
	{10, "10 შეჰღაღადა ასამ უფალს, თავის ღმერთს და უთხრა: უფალო, განა შენგან არ არის შეწევნა ძლიერისა და უძლურისა? შეგვეწიე უფალო, ღმერთო ჩვენო, რადგან შენზე ვართ მონდობიღ:ნი და შენი სახელით გამოვედით ამ ურდოს წინააღმდეგ. უფალო, შენ ღმერთი ხარ ჩვენი, ვერ გაგიძლოს კაცმა! "},
	{11, "11 შემუსრა უფალმა ქუშელნი ასასა და იუდას წინაშე და გაიქცნენ ქუშელნი. "},
	{12, "12 გაედევნა ასა და ხალხი, მასთან რომ იყო, გერარამდე. დაეცნენ ქუშელნი, არავინ გადარჩენილა ცოცხალი, "},
	{13, "13 აიკლეს გერარის ქალაქები ირგვლივ, რადგან უფლის შიში იყო დაცემული მათზე. გაძარცვეს ყველა ქალაქი, რადგან იქ ბევრი იყო საძარცვი. "},
	{14, "14 აიკლეს საქონლის არვები, უამრავი ცხვარი და აქლემი გამოირეკეს და იერუსალიმში დაბრუნდნენ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct ka15 poems[] = {
	{1, "1 ყაზარია ყოდედის ძეზე ღვთის სული გადმოვიდა. "},
	{2, "2 გაეგება იგი ასას და უთხრა: ყური დამიგდეთ, ასა, მთელო იუდავ და ბენიამინო, უფალი თქვენთან არის როცა თქვენ მასთან ხართ. თუ ძებნას დაუწყებთ, იპოვით. თუ თქვენ მიატოვებთ, ისიც მიგატოვებთ. "},
	{3, "3 დიდხანს იყო ისრაელი ჭეშმარიტი ღმერთის გარეშე, მღვდლისა და რჯულის გარეშე. "},
	{4, "4 გასაჭირში იყო და მოუხმო უფალს, ისრაელის ღმერთს. ეძებდნენ მას და აპოვნინა თავი. "},
	{5, "5 იმჟამად არ ჰქონდა მშვიდობა არც გამომსვლელს და არც შემსვლელს, რადგან დიდი შფოოი იყო ატეხილი იმ ქვეყნების მთელ მოსახლეობაში. "},
	{6, "6 ხალხი ხალხს ებრძოდა, ქალაქი - ქალაქს, რადგან ღმერთმა შეაშფოთა ისინი ყოველგვარი გასაჭირით. "},
	{7, "7 თქვენ კი გამტკიცდით და ნუ დაუძლურდება თქვენი ხელები, რადგან თქვენი საქმისაებრ მოგეზღვებათ. "},
	{8, "8 როცა ასამ მოისმინა ეს სიტევები და ყოდედის ძის წინასწარმეტყველება, გამხნევდა და აღმოფხვრა სიბილწენი იუდასა და ბენიამინის ქვეყნიდან, აგრეთვე იმ ქალაქებიდან, ეფრემის მთაზე რომ დაიპყრო. განაახლა უფლის სამსხვერპლო, უფლის სტოას წინ რომ არის. "},
	{9, "9 შემოიკრიბა მან მთელი იუდა და ბენიამინი, ეფრემისგან, მენაშესგან და სიმონისგან წამოსულ ხიზნებთან ერთად, რადგან მრავალნი გადავიდნენ მის მხარეზე ისრაელიდან, რაკი დაინახეს, რომ მასთან იყო უფალი. "},
	{10, "10 ასას მეფობის მეთხუთმეტე წელს, მესამე თვეში შეიყარნენ იერუსალიმს. "},
	{11, "11 მსხვერპლად შესწირეს უფალს იმ დღეს მოტანილი ნადავლიდან შვიდასი ხარ-ძროხა და შვიდასი ცხვარი. "},
	{12, "12 აღთქმა დადეს, რომ ეძიათ უფალი, მამა-პაპათა ღმერთი, მთელი გულითა და სულით. "},
	{13, "13 ყველა ვინც არ ეძიებდა უფალს, ისრაელის ღმერთს, უნდა მომკვდარიყო, დიდი იქნებოდა თუ პატარა, კაცი თუ ქალი. "},
	{14, "14 ეფიცებოდნენ უფალს დიდის ხმითა და ღაღადით, საყვირებითა და ბუკებით. "},
	{15, "15 ხარობდა მთელი იუდა ამ ფიცის გამო, რადგან მთელი გულით შეჰფიცეს, მთელი გულმოდგინებით ეძებდნენ მას და მან აპოვნინა თავი. უბოძა უფალმა მათ სიმშვიდე ირგვლივ. "},
	{16, "16 მაყაქას, მეფე ასას დედასაც კი, დედოფლობა ჩამოართვა, რადგან აშერისათვის კერპი ჰქონდა გაკეთებული. აჩეხა ასამ მისი კერპი, ნაფოტებად აქცია და კედბონის ხევში დაწვა. "},
	{17, "17 ისრაელში კი არ მოუშლიათ გორაკები. მხოლოდ ასას გული იყო სრულად მინდობილი უფლისადმი მთელი მისი სიცოცხლე. "},
	{18, "18 შეიტანა ღვთის სახლში მამამისის და თავისი შეწირული ნივთები - ოქრო-ვერცხლი და ჭურჭელი. "},
	{19, "19 ომი აღარ მომხდარა ასას მეფობის ოცდამეათე წლამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct ka16 poems[] = {
	{1, "1 ასას მეფობის ოცდამეთექვსმეტე წელს ამხედრდა ისრაელის მეფე ბაყაშა იუდას წინააღმდეგ და ააშენა რამა, რათა შეეწყვიტა მისვლა-მოსვლა ასასთან, იუდას მეფესთან. "},
	{2, "2 გამოიტანა ასამ ვერცხლი და ოქრო უფლის სახლისა და მეფის სახლის საგანძურებიდან. გაუგზავნა ბენჰადადს, არამის მეფეს, დამასკოში რომ იჯდა, და შეუთვალა: "},
	{3, "3 იყოს კავშირი ჩვენს შორის, როგორც ჩვენს მამებს შორის იყო. აჰა, გიგზავნი ვერცხლსა და ოქროს. წადი და გაწყვიტე კავშირი ბაყაშასთან, ისრაელის მეფესთან, და ჩამომეხსნება. "},
	{4, "4 დაუჯერა ბენ-ჰადადმა მეფე ასას და გაგზავნა თავისი მხედართმთავრები, ვინც ჰყავდა, ისრაელის ქალაქთა წინააღმდეგ. დალაშქრეს ყიონი, დანი, აბელ-მაიმი და ნაფთალის ყველა სამარაგო ქალაქი. "},
	{5, "5 ეს რომ შეიტყო ბაყაშამ, შეწყვიტა რამას შენება და შეაჩერა თავისი საქმე. "},
	{6, "6 შეკრიბა მეფე ასამ მთელი იუდა და გადაზიდეს რამას ქვები და ხე-ტყე, რითაც ბაყაშა აშენებდა. ააშენა ამით გებაყი და მიცფა. "},
	{7, "7 იმ დროს მივიდა მეფე ასასთან მისანი ხანანი და უთხრა: არამის მეფეს რომ მიენდე და არ მიენდე უფალს, შენს ღმერთს, ამის გამო გადაურჩა არამის ჯარი შენ ხელს. "},
	{8, "8 განა ქუშელთა და ლუბიელთა ლაშქარი დიდი არ იყო, მრავლის უმრავლესი ეტლი და მხედარი არ ჰყავდათ? მაგრამ უფალს რომ იყავი მინდობილი, ამიტომაც ჩაგიგდო ისინი ხელში. "},
	{9, "9 რადგან უფლის თვალი დაჰყურებს მთელს ქვეყანას, რომ მხარი დაუჭიროს იმას, ვინც მთელი გულით არის მასზე მინდობილი. უგუნურად მოგივიდა ეს. ამიტომ ომები გექნება ამიერიდან. "},
	{10, "10 განურისხდა ასა მისანს და საპყრობილეში ჩააგდო, რადგან გაგულისებული იყო ნათქვამის გამო. იმავე დროს ასა ჩაგრავდა ხალხიდან ზოგიერთებს. "},
	{11, "11 ასას პირველი და უკანასკნელი ამბები ჩაწერილია იუდასა და ისრაელის მეფეთა წიგნში. "},
	{12, "12 თავისი მეფობის ოცდამეცხრამეტე წელს ასას ფეხები დაუსნეულდა. ძალზე მძიმე იყო მისი სენი, მაგრამ თავის სნეულებაშიც კი არ ეძებდა უფალს, არამედ მკურნალებს. "},
	{13, "13 განისვენა ასამ თავის მამა-პაპასთან; მოკვდა თავისი მეფობის ორმოცდამეერთე წელს. "},
	{14, "14 დამარხეს მის სამარხში, თავისთვის რომ გაიმზადა, დავითის ქალაქში. დაასვენეს იგი სარეცელზე, რომელიც აავსეს კეთილსურნელებითა და მენელსაცხებლეთა ხელობით დამზადებული ნაირნაირი ნელსაცხებლებით. და დაუნთეს მას დიდზე დიდი კოცონი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct ka17 poems[] = {
	{1, "1 მის ნაცვლად მისი ძე, იოშაფატი გამეფდა და ძალა მოიკრიბა ისრაელის წინააღმდეგ. "},
	{2, "2 ჩააყენა ჯარი იუდას ყველა ციხე-ქალაქში. მცველები დააყენა იუდას ქვეყანაში და ეფრემის ქალაქებში, რომელიც მამამისმა ასამ დაიპყრო. "},
	{3, "3 უფალი იოშაფატთან იყო, რადგან დავითის, მამამისის, პირვანდელი გზით დადიოდა და ბაალები არ უძებნია. "},
	{4, "4 ეძებდა თავისი მამის ღმერთს და მის მცნებებს ასრულებდა, და არ იქცეოდა ისრაელის მსგავსად. "},
	{5, "5 გააძლიერა უფალმა სამეფო მის ხელში. მთელი იუდა ძღვენს აძლევდა იოშაფატს და დიდი დოვლათი და პატივი ჰქონდა. "},
	{6, "6 გული მოიცა უფლის გზებზე და კვლავ მოშალა გორაკები და აშერები იუდაში. "},
	{7, "7 მეფობის მესამე წელს გაგზავნა თავისი მთავრები: ბენ-ხაილი, ყობადია, ზაქარია, ნათენელი და მიქაია დასამოძღვრად იუდას ქალაქებში. "},
	{8, "8 თან გააყოლა ლევიანები: შემაყია, ნეთანია, ზებადია, ყასაელი, შემირამოთი, იონათანი, ადონია, ტობია, ტობადონია - ლევიანები. მათვე გააყოლა მღვდლები - ელიშამაყი და იორამი. "},
	{9, "9 მოძღვრავდნენ ხალხს იუდაში და თან ჰქონდათ უფლის რჯულის წიგნი. მოიარეს იუდას ყველა ქალაქი და დამოძღვრეს ხალხი. "},
	{10, "10 უფლის დიდი შიში ჰქონდა ყველა იმ ქვეყნის სამეფოს, იუდას ირგვლივ რომ იყო, და არ ებრძოდნენ იოშაფატს. "},
	{11, "11 ფილისტიმელთაგან იოშაფატთან მიჰქონდათ ძღვენი და ვერცხლი ხარკად. ასევე არაბებსაც მოჰყავდათ წვრილფეხა საქონელი - შვიდიათასშვიდასი ცხვარი და შვიდიათასშვიდასი თხა. "},
	{12, "12 თანდათან განდიდდა და აღზევდა იოშაფატი. ააშენა მან იუდაში სიმაგრეები და სამარაგო ქალაქები. "},
	{13, "13 მრავალი საშრომელი ჰქონდა იუდას ქალაქებში და მებრძოლი ხალხი მაგარი ვაჟკაცები ჰყავდა იერუსალიმში. "},
	{14, "14 აჰა, მათი მოვალეობანი მამისსახლთა მიხედვით. იუდას ათასისთავები: თავკაცი ყადნა, მას ჰყავდა სამასიათასი მაგარი ვაჟკაცი. "},
	{15, "15 მის მერე იყო თავკაცი იეჰოხანანი. მას ორასოთხმოციათასი ჰყავდა. "},
	{16, "16 მის მერე იყო ყამასია ზიქრის ძე, ნებით რომ შესწირა თავი უფალს, მასთან იყო ორასი ათასი მაგარი ვაჟკაცი. "},
	{17, "17 ბენიამინს ჰყავდა მამაცი ვაჟკაცი ელიადაყი და მასთან ერთად ორასი ათასი მშვილდითა და ფარით შეიარაღებული კაცი. "},
	{18, "18 მის მერე იყო იეჰოზაბადი და მასთან ერთად ასოთხმოცი ათასი შეიარაღებული მებრძოლი. "},
	{19, "19 აჰა, ისინი ვინც მეფეს ემსახურებოდნენ, იმათ გარდა, მეფემ იუდას ყველა ციხე-ქალაქში რომ ჩააყენა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct ka18 poems[] = {
	{1, "1 უხვად ჰქონდა დოვლათი და პატივი იოშაფატს, და დაუმოყვრდა აქაბს. "},
	{2, "2 რამდენიმე წლის შემდეგ ჩავიდა აქაბთან სამარიაში და უამრავი ცხვარ-ძროხა დაუკლა აქაბმა მას და იმ ხალხს, თან რომ ახლდა. და დაიყოლია გალაადის რამოთში ლაშქრობაზე. "},
	{3, "3 უთხრა აქაბმა, ისრაელის მეფემ, იოშაფატს, იუდას მეფეს: წამომყვები გალაადის რამოთზე? მიუგო: რამ გაგვყო მე და შენ, რამ გაჰყო ჩემი ხალხი და შენი ხალხი? შენთან ვარ ომში. "},
	{4, "4 უთხრა იოშაფატმა ისრაელის მეფეს: აბა, დაეკითხე უფლის სიტყვას. "},
	{5, "5 შეკრიბა ისრაელის მეფემ წინასწარმეტყველნი - ოთხასამდე კაცი, და უთხრა მათ: გავილაშქრო გალაადის რამოთზე თუ თავი შევიკავო? მიუგეს: გაილაშქრე, მეფეს ჩაუგდებს ხელში ღმერთი. "},
	{6, "6 თქვა იოშაფატმა: ხომ არ არის აქ სადმე კიდევ უფლის წინასწარმეტყველი, რომ მასაც დავეკითხოთ? "},
	{7, "7 უთხრა ისრაელის მეფემ იოშაფატს: კიდევ არის ერთი კაცი, რომელსაც შეგვიძლია ვაკითხვინოთ უფლისათვის, მაგრამ მძულს იგი, რადგან სასიკეთოს არ წინასწარმეტყველებს ჩემზე, არამედ მხოლოდ ცუდს. მიქაი იმლას ძეა. თქვა იოშაფატმა: ნუ ამბობს ასე მეფე. "},
	{8, "8 უხმო ისრაელის მეფემ ერთ-ერთ ჯარისკაცს და უთხრა: სასწრაფოდ მომგვარე მიქაი იმლას ძე. "},
	{9, "9 ისრაელის მეფე და იუდეას მეფე იოშაფატი სამოსლით შემოსილნი ისხდნენ თავ-თავის სავარძლებში კალოზე, სამარიის კარიბჭესთან, და წინასწარმეტყველნი წინასწარმეტყველებდნენ მათ წინაშე. "},
	{10, "10 გაიკეთა ციდკია ქენაყანის ძემ რკინის რქები და თქვა: ასე ამბობს უფალი: ამით ურქენ არამს და ბოლოს მოუღებ. "},
	{11, "11 ყველა წინასწარმეტყველი ამასვე წინასწარმეტყველებდა: მიუხდი გალაადის რამოთს და გაიმარჯვებ, მეფის ხელში ჩააგდებს უფალი. "},
	{12, "12 ასე ეუბნებოდა მიქაის მის დასაძახებლად გაგზავნილი მოციქული: აჰა, მეფის სასიკეთოს ამბობენ ერთხმად წინასწარმეტყველნი. შეეთანხმოს შენი სიტყვებიც მათ სიტყვებს. შენცა თქვი სასიკეთო. "},
	{13, "13 თქვა მიქაიმ: უფალს ვფიცავ, იმას ვიტყვი, რასაც ღმერთი მიბრძანებს. "},
	{14, "14 მივიდა მეფესთან და უთხრა მეფემ: მიქაი! გავილაშქროთ გალაადის რამოთზე თუ თავი შევიკავოთ? მიუგო: გაილაშქრე და გაიმარჯვებ, თქვენს ხელში ჩაცვივდებიან. "},
	{15, "15 უთხრა მეფემ: რამდენჯერ უნდა დაგაფიცო, მხოლოდ სიმართლე მელაპარაკე-მეთქი უფლის სახელით? "},
	{16, "16 უთხრა: ვიხილე მთელი ისრაელი, უმწყემსო ფარასავით მთებზე მიმოფანტული. და თქვა უფალმა: პატრონი არ ჰყავთ, მშვიდობით დაბრუნდნენ თავ-თავის სახლებში. "},
	{17, "17 უთხრა ისრაელის მეფემ იოშაფატს: ხომ გეუბნებოდი, სასიკეთოს არ წინასწარმეტყველებს-მეთქი ჩემზე, არამედ მხოლოდ ცუდს. "},
	{18, "18 თქვა მიქაიმ: აბა, ისმინეთ უფლის სიტყვა: ვიხილე, თავის ტახტზე იჯდა უფალი და ცათა მთელი მხედრობა ედგა გვერდში, მარჯვნივ და მარცხნივ. "},
	{19, "19 თქვა უფალმა: ვინ გაიტყუებს აქაბს, ისრაელის მეფეს, რომ გაილაშქროს და დაეცეს გალაადის რამოთს? ერთი ერთს ამბობდა, მეორე - სხვას. "},
	{20, "20 გამოვიდა სული, წარუდგა უფალს და თქვა: მე გავიტყუებ. უთხრა უფალმა: რითი? "},
	{21, "21 მიუგო: გავალ და საცრუის სულად ვიქცევი ყველა მისი წინასწარმეტყველის ბაგეში. თქვა უფალმა: გაიტყუებ და კიდეც გამოგივა. წადი, ასე გააკეთე. "},
	{22, "22 აჰა, სიცრუის სული ჩაუდგა უფალმა ამ შენ წინასწრმეტყველებს. უფალს კი ცუდი აქვს ნათქვამი შენზე. "},
	{23, "23 მიეჭრა ციდკია ქენაყანის ძე და სილა გააწნა მიქაიას, უთხრა: როგორ მოხდა, რომ გვერდი ამიარა უფლის სიტყვამ და შენში მეტყველებს? "},
	{24, "24 თქვა მიქაიმ: მაშინ დაინახავ, ოთახიდან ოთახში რომ დაიწყებ სირბილს დასამალავად. "},
	{25, "25 თქვა ისრაელის მეფემ: შეიპყარით მიქაი და მიჰგვარეთ ქალაქის თავს და უფლისწულ იოაშს. "},
	{26, "26 და უთხარით: ასე ამბობს-თქო მეფე: დილეგში ჩააგდეთ ეს კაცი და აჭამეთ სიმწრის პური და ასვით სიმწრის წყალი, ვიდრე მშვიდობით მოვბრუნდებოდე. "},
	{27, "27 თქვა მიქაიმ: თუ მშვიდობით მობრუნდი, უფალს არ ულაპარაკნია ჩემი პირით. თქვა: ისმინეთ ყეელამ, ხალხნო! "},
	{28, "28 წავიდნენ ისრაელის მეფე და იოშაფატ იუდას მეფე გალაადის რამოთზე. "},
	{29, "29 უთხრა ისრაელის მეფემ იოშაფატს: მე გადავიცვამ და ისე გავალ საბრძოლველად. შენ შენი სამოსელი გეცვას. გადაიცვა ისრაელის მეფემ და გავიდა საბრძოლველად. "},
	{30, "30 უბრძანა არამის მეფემ ეტლების მეთაურებს, ვინც ჰყავდა: ნუ შეებრძოლებით ნურც მცირეს, ნურც დიდს, მხოლოდ ისრაელის მეფეს შეებრძოლეთ. "},
	{31, "31 როცა დაინახეს ეტლების მეთაურებმა იოშაფატი, იფიქრეს, ეს არისო ისრაელის მეფე და მისკენ გაეშურნენ, რომ შებრძოლებოდნენ. მაშინ იყვირა იოშაფატმა და უფალი შეეწია - ღმერთმა მოაშორა მას მომხდურნი. "},
	{32, "32 როცა მიხვდნენ ეტლების მეთაურები, რომ არ იყო იგი ისრაელის მეფე, გაერიდნენ მას. "},
	{33, "33 ალალბედზე მოზიდა მშვილდი ვიღაც კაცმა და ჯაჭვის პერანგის ნაწიბურთან დაჭრა ისრაელის მეფე. უთხრა თავის მეეტლეს: გატრიალდი და ბრძოლიდან გამიყვანე, რადგან დაჭრილი ვარ. "},
	{34, "34 გახურდა ომი იმ დღეს, დარჩა ეტლში ისრაელის მეფე არამელთა პირისპირ საღამომდე და მოკვდა მზის ჩასვლისას. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct ka19 poems[] = {
	{1, "1 მშვიდობით დაბრუნდა იოშაფატ იუდას მეფე სახლში, იერუსალიმში. "},
	{2, "2 გამოეგება მისანი იეჰუ ხანანის ძე და უთხრა მეფე იოშაფატს: განა შეგშვენოდა უღვთო კაცისთვის დახმარების გაწევა და უფლის მოძულის სიყვარული? ამის გამო უფლის რისხვა დაგატყდება თავს. "},
	{3, "3 თუმცაღა კეთილი საქმეებიც აღმოგაჩნდა, რადგან მოსპე აშერები ქვეყნიდან და გული მოამზდე ღვთის საძიებლად. "},
	{4, "4 ცხოვრობდა იოშაფატი იერუსალიმში. კვლავ გავიდა ხალხში, ბერშებადან ეფრემის მთამდე და მოაქცია იგი უფლისკენ, მამა-პაპის ღმერთისკენ. "},
	{5, "5 მსაჯულები დააყენა ქვეყანაში, იუდას ყველა ციხე-ქალაქში, ყოველ ქალაქში. "},
	{6, "6 უთხრა მსაჯულებს: დაუკვირდით რას აკეთებთ, რადგან კაცისთვის კი არ გამოგაქვთ მსჯავრი, არამედ უფლისთვის. იგი თქვენთან არის სამსჯავროზე. "},
	{7, "7 უფლის შიში იქონიეთ, ფრთხილად მოიქეცით, რადგან უფალთან, ჩვენს ღმერთთან, არ არის უსამართლობა, თვალთმაქცობა და ანგარება. "},
	{8, "8 იერუსალიმში უფლის მსჯავრის გამოსატანად და დავის გადასაწყვეტად დააყენა ლევიანთაგანნი, მღვდელნი და ისრაელის მამისსახლთა თავკაცნი და დაბრუნდნენ იერუსალიმს. "},
	{9, "9 უბრძანა მათ და უთხრა: ასე აკეთეთ საქმე უფლისმოშიშებით, ჭეშმარიტებითა და ერთგულებით. "},
	{10, "10 ყველა სადაო საქმე, რომელიც კი შემოვა თქვენთან თქვენს მოძმეთაგან, თქვენს ქალაქებში რომ ცხოვრობენ, სასისხლო იქნება ეს თუ რჯულის, მცნების, წესებისა და კანონების საქმე, გააფრთხილეთ, რომ უფალს არ შესცოდონ და თქვენც, თქვენს ძმებთან ერთად უფლის რისხვა არ დაიტეხოთ. ასე მოიქეცით და არ შესცოდავთ. "},
	{11, "11 აჰა, მღვდელმთავარი ამარიაჰუ გეყოლებათ ყველა საუფლო საქმეში და ზებადიაჰუ იშმაყელის ძე, იუდას სახლის წინამძღოლი, ყველა სამეფო საქმეში. ზედამხედველებად ლევიანები იქნებიან თქვენს წინაშე. მტკიცედ იდექით და იმოქმედეთ, და კეთილთან იქნება უფალი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct ka20 poems[] = {
	{1, "1 ამის შემდეგ იყო, რომ მოვიდნენ მოაბიანები და ყამონიანები (ყამონელნიც მათთან იყვნენ) იოშაფატის წინააღმდეგ საბრძოლველად. "},
	{2, "2 მოვიდნენ, ამბავი მიაუტანეს იოშაფატს და უთხრეს: დიდი ურდო გადმოვიდა შენს წინააღმდეგ საბრძოლველად ზღვის გაღმიდან და არამიდან. აჰა, ისინი ხაცეცონ-თამარში არიან, ყენ-გედიში. "},
	{3, "3 შეშინდა იოშაფატი და შესაკითხად უფალს მიმართა. მთელ იუდაში მარხვა გამოაცხადა. "},
	{4, "4 შეიკრიბა იუდა უფლისგან შემწეობის სათხოვრად. იუდას ყველა ქალაქიდან მოვიდნენ უფლის საძიებლად. "},
	{5, "5 წარდგა იოშაფატი იუდასა და იერუსალიმის კრებულში, უფლის სახლში, ახალი ეზოს წინ, "},
	{6, "6 და თქვა: უფალო, ჩვენი მამა-პაპის ღმერთო, განა შენ არა ხარ ღმერთი ზეცაში? განა შენ არ ბატონობ ხალხთა ყველა სამეფოში? შენს ხელთ არის ძალა და სიმტკიცე. არავინ არის, წინ რომ აღგიდგეს. "},
	{7, "7 განა შენ არ განდევნე ამ ქვეყნის მცხოვრებნი შენი ერის, ისრაელის თვალწინ? განა შენ არ მიეცი იგი სამარადისოდ შენი მოყვასის, აბრაამის მოდგმას? "},
	{8, "8 დამკვიდრდნენ იქ, საწმიდარი აგიშენეს შენს სახელზე და თქვეს: "},
	{9, "9 თუ თავს რამე უბედურება დაგვატყდება, მახვილი იქნება. მსჯავრი, ჭირი თუ შიმშილი, დავდგებით ამ სახლის წინაშე და შენს წინაშე, რადგან შენი სახელია ამ სახლში, და მოგიხმობთ ჩვენს გასაჭირში, შენ კი მოისმენ და გვიხსნი. "},
	{10, "10 აჰა, ახლა ყამონიანები და მოაბი, სეყირის მთიელები, მათზე გავლის ნება რომ არ დართეს ისრაელიანებს, როცა ეგვიპტის ქვეყნიდან ბრუნდებოდნენ, ამიტომ მათ გვერდი აუარეს და არ გაანადგურეს ისინი. "},
	{11, "11 ახლა სამაგიეროს იმით გვიხდიან, რომ მოვიდნენ ჩვენი სამკვიდრებლის წასართმევად, რომელიც შენ დაგვიმკვიდრე. "},
	{12, "12 ჩვენო ღმერთო, განა შენ არ დასდებ მათ მსჯავრს? რადგან უძლურნი ვართ ამ მრავალრიცხოვანი ურდოს წინაშე, ჩვენს წინააღმდეგ რომ არის მოსული. ჩვენ აღარ ვიცით, როგორ მოვიქცეთ, რადგან შენკენაა ჩვენი თვალი მოპყრობილი. "},
	{13, "13 მთელი იუდა უფლის წინაშე იდგა, თავიანთი ჩვილებით, ცოლებითა და ვაჟებით. "},
	{14, "14 მაშინ გადმოვიდა შუაგულ კრებულში ღვთის სული იეხაზიელზე, ძეზე ზაქარიასი, ძისა ბენაიასი, ძისა იეყიელისა, ძისა მათანიასი, ლევიანზე ასაფიანთაგან. "},
	{15, "15 და თქვა: ყური მიგდე, მთელო იუდავ, იერუსალიმის მცხოვრებნო, მეფე იოშაფატ! ასე გეუბნებათ უფალი: ნუ გეშინიათ და ნუ შეძრწუნდებით ამ უზარმაზარი ურდოს წინაშე, რადგან თქვენ კი არ გმართებთ ომი, არამედ ღმერთს. "},
	{16, "16 ხვალ დაეშვით მათკენ. აჰა, ისინი ჰაციცის მაღლობზე ამოდიან. ხევის ბოლოში წააწყდებით მათ, იერუელის უდაბნოს წინ. "},
	{17, "17 ამჯერად თქვენ არ იბრძოლებთ. გადით, დადქით და უცქირეთ უფლის მიერ თქვენს ხსნას. იუდავ და იერუსალიმო! ნუ გეშინიათ და ნუ ძრწიხართ. ხვალ გახვალთ მის წინააღმდეგ და უფალი იქნება თქვენთან. "},
	{18, "18 იოშაფატი პირქვე დაემხო მიწაზე. მთელი იუდა და იერუსალიმის მცხოვრებნი უფლის წინაშე დაემხვნენ უფლის თაყვანისცემად. "},
	{19, "19 წამოიმართნენ ლევიანები კეჰათიანთაგან და კორახიანთაგან, რათა მაღალი ხმით ექოთ უფალი, ღმერთი ისრაელისა. "},
	{20, "20 ადგნენ დილაადრიან და თეკოაყის უდაბნოსკენ გავიდნენ. გასვლისას ადგა იოშაფატი და თქვა: მისმინეთ, მთელო იუდავ და იერუსალიმის მცხოვრებნო! დაენდეთ უფალს, თქვენს ღმერთს, მტკიცედ იდექით. გწამდეთ მისი წინასწარმეტყველებისა და მოგემართებათ ხელი. "},
	{21, "21 დაეთათბირა ხალხს და დაუყენა უფალს მგალობელნი, წმიდა სამოსელში გამოწყობილნი, რომ ექოთ უფალი შეიარაღებულთა წინ გამოსვლისას, ეთქვათ: ადიდეთ უფალი, რადგან უკუნისამდეა წყალობა მისი. "},
	{22, "22 იმ დროს, როცა დაიწყეს ყიჟინა და სიმღერა, უფალმა ალყაში მოაქცია იუდას წინააღმდეგ მოსული ყამონიანები, მოაბიანები და სეყირის მთიელები და გაანადგურა. "},
	{23, "23 აღდგენ ყამონიანებზე, მოაბიანებზე და სეყირის მთის მცხოვრებლებზე მათ დასახოცად და ამოსაწყვეტად. როცა სეყირის მცხოვრებთ მოუღეს ბოლო, ერთმანეთს დაერივნენ დასახოცად. "},
	{24, "24 ავიდა იუდა უდაბნოს ბორცვზე, გადახედა ურდოს, და აჰა, გვამები ყრია მიწაზე! "},
	{25, "25 მივიდნენ იოშაფატი და მისი ხალხი მათთან ნადავლისთვის და იპოვეს დიდძალი ქონება, სამოსელი, საუცხოო ჭურჭელი. იმდენი შეაგროვეს, რომ წაღება აღარ შეეძლოთ. სამ დღეს ეზიდებოდნენ ნადავლს, იმდენი იყო. "},
	{26, "26 მეოთხე დღეს კურთხევის ველზე შეიკრიბბენ, რადგან იქ აკურთხეს უფალი. ამიტომ ეძახიან დღემდე იმ ადგილს კურთხევის ველს. "},
	{27, "27 გამობრუნდა მთელი იუდა და იერუსალიმი იოშაფატის მეთაურობით, რათა გახარებულები დაბრუნებულიყვნენ იერუსალიმში, რადგან უფალმა გაახარა ისინი მტრებზე. "},
	{28, "28 შევიდნენ იერუსალიმში ქნარებით, ბობღნებითა და საყვირვბით უფლის სახლისკენ. "},
	{29, "29 შიში დაეცათ ქვეყანათა ყველა სამეფოს, როცა გაიგეს, რომ ისრაელის მტრებს უფალი ებრძოდა. "},
	{30, "30 მოისვენა იოშაფატის სამეფომ, სიმშვიდე უბოძა მას ირგვლივ თავისმა ღმერთმა. "},
	{31, "31 და მეფობდა იოშაფატი იუდაზე. ოცდათხუთმეტი წლისა იყო იოშაფატი, როცა გამეფდა, და ოცდახუთ წელს მეფობდა იერუსალიმში. მისი დედა იყო ყაბუზა, შილხის ასული. "},
	{32, "32 თავისი მამის, ასას გზას ადგა და არ უხვევდა მისგან. სწორად იქცეოდა უფლის თვალში. "},
	{33, "33 ოღონდ გორაკები არ იყო გაუქმებული. და ხალხსაც ჯერ კიდევ არ ჰქონდა მტკიცედ მობრუნებული გული თავიანთი მამა-პაპის ღმერთისკენ. "},
	{34, "34 იოშაფატის დანარჩენი საქმენი, პირველნი და უკანასკნელნი, ჩაწერილია იეჰუ ხანანის ძის მატიანეში, რომელიც შეტანილია ისრაელის მეფეთა წიგნში. "},
	{35, "35 ამის შემდეგ იოშაფატ იუდას მეფემ კავშირი შეკრა ახაზიასთან, ისრაელის მეფესთან, რომელიც უკუღმართად იქცეოდა. "},
	{36, "36 მასთან კავშირი იმიტომ შეკრა, როძ ხომალდები აეგო თარშიშში წასასვლელად. ხომალდები ყეციონ-გაბერში ააგეს. "},
	{37, "37 იწინასწარმეტყველა იოშაფატზე ელიყეზერ დოდანის ძემ, მარეშელმა, და თქვა: რაკი კავშირი შეჰკარი ახაზიასთან, ამიტომ უფალი ჩაფუშავს შენს საქმეს. და დაილეწა ხომალდები და ვეღარ შესძლეს თარშიშში წასვლა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct ka21 poems[] = {
	{1, "1 განისვენა იოშაფატმა თავის მამა-პაპასთან და დაიმარხა თავის მამა-პაპის გვერდით დავითის ქალაქში და მის ნაცვლად მისი ძე, იორამი გამეფდა. "},
	{2, "2 ჰყავდა ძმები, იოშაფატის ვაჟები: ყაზარია, იესელი, ზექარიაჰუ, ყაზარიაჰუ, მიქაელი, შეფატიაჰუ, ესენი არიან იოშაფატის, ისრაელის მეფის ძენი. "},
	{3, "3 მათმა მამამ დიდძალი საჩუქარი მისცა მათ - ვერცხლი, ოქრო და ძვირფასეულობა, იუდას ციხე-ქალაქებთან ერთად. სამეფო კი იორამს უბოძა, რადგან იგი პირმშო იყო. "},
	{4, "4 დაიჭირა მამამისის სამეფო იორამმა, და როცა გაძლიერდა, მახვილით დახოცა თავისი ძმები და ისრაელის მთავართაგანნი. "},
	{5, "5 ოცდათორმეტი წლისა იყო იორამი, როცა გამეფდა, და რვა წელი იმეფა იერუსალიმში. "},
	{6, "6 ისრაელის მეფეთა გზით დადიოდა იგი, როგორც იქცეოდა აქაბის სახლი, რადგან აქაბის ასული ჰყავდა ცოლად და უკუღმართად იქცეოდა უფლის თვალში. "},
	{7, "7 მაგრამ არ უნდოდა უფალს დავითის სახლის დაქცევა იმ აღთქმის გამო, დავითს რომ დაუდო, როცა შეპირდა, რომ მისცემდა ლამპარს მას და მის შთამომავალთ სამარადისოდ. "},
	{8, "8 მის დროს განუდგა ედომი იუდას და დაისვეს მეფე. "},
	{9, "9 გაემართა იორამი თავისი სარდლებით და მთელი თავისი ეტლებითურთ, ადგა ღამით და სძლია ედომელებს, გარს რომ ეხვივნენ და ეტლის მეთაურებს. "},
	{10, "10 განუდგა ედომი იუდას და ასეა დღემდე. იმხანადვე განუდგა ლიბნაც იუდას, რადგან მიატოვა იორამმა უფალი, თავისი მამა-პაპის ღმერთი. "},
	{11, "11 მანაც მოაწყო გორაკები იუდას მთებში. მან გარყვნა იერუსალიმის მცხოვრებნი და აცდუნა იუდა. "},
	{12, "12 წერილი მიუვიდა ელია წინასწარმეტყველისგან, უთვლიდა, ასე ამბობსო უფალი, მამაშენის დავითის ღმერთი: იმის გამო, რომ შენ არ დაადექი მამაშენის იოშაფატის გზას და იუდას მეფის, ასას გზას, "},
	{13, "13 არამედ ისრაელის მეფეთა გზას დაადექი, გარყვენი იუდა და იერუსალიმში მცხოვრებნი აქაბის სახლის გარყვნილების მსგავსად, თანაც შენზე უკეთესი შენი ძმები - მამაშენის სახლი ამოწყვიტე, "},
	{14, "14 აჰა, უფალი სასტიკად მოსრავს შენს ხალხს, შენს ვაჟებსა და ცოლებს, მთელს შენს საბადებელს. "},
	{15, "15 შენ კი მძიმე სენს შეგყრის ნაწლავთა სენს, ისე რომ ნაწლავები სნეულების გამო დღე და დღე გარეთ გამოგივა. "},
	{16, "16 აღძრავს უფალი იორამის წინააღმდეგ ფილისტიმელთა და არაბთა სულს, ქუშელთა მეზობლად რომ არიან. "},
	{17, "17 გაილაშქრეს იუდაზე, შეიჭრნენ მასში და ხელში ჩაიგდეს მთელი დოვლათი, რაც კი მეფის სახლში აღმოჩნდა, აგრეთვე მისი ვაჟები და ცოლები. ვაჟი აღარ დარჩა, იოახაზის ძეთა შორის უმრწემესის გარდა. "},
	{18, "18 ყოველივე ამის შემდეგ დასცა უფალმა იგი უკურნებელი სენით. "},
	{19, "19 ასე იყო დღე და დღე. მეორე წლის ბოლოს კი გამოუვიდა ნაწლავები სენისაგან და საშინელ ტანჯვაში მოკვდა. მისმა ხალხმა არ დაუნთო კოცონი. როგორც მის მამა-პაპას დაუნთო. "},
	{20, "20 ოცდათორმეტი წლის იყო იგი, რომ გამეფდა. და რვა წელი იმეფა იერუსალიმში. ისე წავიდა, რომ არ დანანებიათ. დამარხეს დავითის ქალაქში, სამეფო სამარხში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct ka22 poems[] = {
	{1, "1 იერუსალიმის მცხოვრებლებმა მის ნაცვლად მისი უმცროსი ვაჟი ახაზია გაამეფეს, რადგან უფროსები ბანაკში შემოჭრილმა არაბებმა გაჟლიტეს. გამეფდა ახაზია, იუდას მეფის, იორამის ვაჟი. "},
	{2, "2 ორმოცდაორი წლისა იყო ახაზია, რომ გამეფდა, და ერთი წელი იმეფა იერუსალიმში. მისი დედა იყო ღოთოლია, ყომრის ასული. "},
	{3, "3 ისიც აქაბის სახლის გზით დადიოდა, ვინაიდან დედამისი ურჩევდა ბოროტის ქმნას. "},
	{4, "4 უკუღმართად იქცეოდა უფლის თვალში, აქაბის სახლის მსგავსად, რადგან ისინი იყვნენ მისი მრჩევლები, მისდა საუბედუროდ. "},
	{5, "5 მათივე რჩევით დადიოდა და გაჰყვა იორამ აქაბის ძეს, ისრაელის მეფეს, არამის მეფესთან, ხაზაელთან საბრძოლველად გალაადის რამოთში; დაჭრეს არამელებმა იორამი. "},
	{6, "6 მობრუნდა, რომ იზრეყელში ემკურნალა ჭრილობებისთვის, რომლებიც მიაყენეს, როცა ხაზაელს, არამის მეფეს ეომებოდა. ჩამოვიდა ახაზია იორამის ძე, იუდას მეფე, იზრეყელში იორამ აქაბის ძის სანახავად, რადგან ავად იყო იგი. "},
	{7, "7 ღვთისგან იყო ახაზიას დაღუპვა იორამთან მისვლით. მისვლისთანავე იორამთან ერთად რომ გაილაშქრა იეჰუ ნიმშის ძეზე, რომელსაც უფალმა სცხო ახაბის სახლის დასაქცევად. "},
	{8, "8 როცა იეჰუ მსჯავრს სდებდა ახაბის სახლს, მოძებნა იუდას მთავარნი და ახაზიას ძმისწულნი, ახაზიას რომ ემსახურებოდნენ, და დახოცა ყველანი. "},
	{9, "9 მოძებნა ახაზიაც და შეიპყრეს იგი, როცა სამარიაში იმალებოდა, და მიჰგვარეს იეჰუს. მერე მოკლეს და დამარხეს, რადგან თქვეს: შვილია იოშაფატისა, რომელიც მთელი გულით ეძებდა უფალს. აღარავინ დარჩა ახაზიას სახლში, მეფობა რომ შესძლებოდა. "},
	{10, "10 როცა ღოთოლიამ, ახაზიას დედამ დაინახა, რომ მოკვდა მისი ვაჟი, ადგა და გაწყვიტა იუდას სახლის მთელი სამეფო მოდგმა. "},
	{11, "11 მაგრამ იეჰოშაბყათმა, მეფის ასულმა, აიყვანა იოაში, ახაზიას ვაჟი, და მოარიდა დასახოცავად განწირულ უფლისწულებს და თავის ძიძასთან ერთად საწოლ ოთახში გადამალა. იეჰოშაბყათმა, მეფე იორამის ასულმა, იეჰოიადაყ მღვდლის ცოლმა, ახაზიას დამ, გადამალა იგი ღოთოლიასგან და ვერ მოკლეს. "},
	{12, "12 ექვს წელს იმალებოდა მასთან ერთად ღვთის სახლში, ხოლო ქვეყანაზე ღოთოლია მეფობდა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view23() {
struct ka23 poems[] = {
	{1, "1 მეშვიდე წელს ძალი მოიცა იეჰოიადაყმა და აიყვანა ასისთავები: ყაზარია იეროხამის ძე, იშმაყელ იეჰოყანანის ძე, ყაზარია ყობედის ძე, მაყასეია ყადაიას ძე და ელიშაფატ ზიქრის ძე. "},
	{2, "2 წავიდნენ ისინი იუდაში, შეკრიბეს ლევიანები იუდას ყველა ქალაქში და იერუსალიმში მოვიდნენ. "},
	{3, "3 აღთქმა დადო მთელმა კრებულმა მეფესთან ღვთის სახლში. უთხრა მათ იეჰოდაყმა: აჰა, უფლისწული უნდა გამეფდეს, როგორც უფალმა ბრძანა დავითის შთამომავლებზე. "},
	{4, "4 აი, ასე უნდა მოიქცეთ: თქვენგან ერთი მესამედი შაბათს შემომსვლელ მღვდელთაგან და ლევიანთაგან ზღურბლთა მცველები იქნებიან; "},
	{5, "5 მესამედი მეფის სასახლეში იქნება, მესამედი - იესოდის კარში, დანარჩენი ხალხი კი - უფლის სახლის ეზოებში. "},
	{6, "6 არავინ შევიდეს უფლის სახლში, გარდა მღვდლებისა და მომსახურე ლევიანებისა. ისინი შევიდნენ, რადგან განწმედილნი არიან. მთელი ხალხი კი უფლის სადარაჯოზე დადგეს. "},
	{7, "7 გარს უნდა შემოერტყნენ ლევიანები მეფეს იარაღით ხელში; ვინც სახლში შემოვა, მოკვდეს. ედექით მეფეს გამოსვლისას და შესვლისას. "},
	{8, "8 ყველაფერი ისე გააკეთეს ლევიანებმა და იუდამ, როგორც მათ იეჰოიადაყ მღვდელმა უბრძანა: წაიყვანეს თავ-თავისი ხალხი - შაბათს შემომსვლელნი შაბათს გამსვლელებთან ერთად, რადგან არ დაუთხოვია იეჰოიადაყ მღვდელს დასები. "},
	{9, "9 დაურიგა იეჰოიადაყ მღვდელმა ასისთავებს შუბები, დიდი და მცირე ფარები, მეფე დავითს რომ ჰქონდა უფლის სახლში. "},
	{10, "10 დააყენა მთელი ხალხი, თითოეული თავის იარაღით ხელში, სახლის მარჯვენა ფრთიდან მარცხენა ფრთამდე, სამსხვერპლოსთან და სახლთან, მეფის ირგვლივ. "},
	{11, "11 გამოიყვანეს უფლისწული, დაადგეს შარავანდი და მისცეს მოწმობა. გაამეფეს იგი და სცხეს მირონი იეჰოიადაყმა და მისმა ვაჟებმა, თქვეს: იცოცხლოს მეფემ! "},
	{12, "12 შემოესმა ღოთოლიას ხალხის ჩოჩქოლი, რომ მორბოდნენ და მეფეს ადიდებდნენ, და გაჰყვა ხალხს უფლის სახლისკენ. "},
	{13, "13 და აჰა, დაინახა, შესასვლელთან, თავის სვეტთან, დგას მეფე. მეფის გვერდით სარდლები და მესაყვირენი იყვნენ, მთელი ქვეყნის ერი ხარობდა და საყვირებს აყვირებდა, მგალობელნი კი სამუსიკო საკრავებით ქება-დიდებას უძღვებოდნენ. მაშინ შემოიხია სამოსელი ღოთოლიამ და იყვირა: ღალატია, ღალატი! "},
	{14, "14 გაიხმო იეჰოიადაყ მღვდელმა ასისთავები, ჯარის მეთაურნი, და უთხრა: კარში გაიყვანეთ. ვინც უკან გაჰყვება მახვილით მოკალით, რადგან იფიქრა მღვდელმა, უფლის სახლში არ მოკლანო. "},
	{15, "15 გზა მისცეს და წავიდა სახლისკენ ცხენთა შესასვლელით და იქ მოკლეს. "},
	{16, "16 დადო იეჰოიადაყმა აღთქმა თავისთავსა, მთელ ერსა და მეფეს შორის, რათა ისინი უფლის ერი გამხდარიყვნენ. "},
	{17, "17 შევიდა მთელი ხალხი ბაალის სახლში და დაანგრია სამსხვერპლოანად, დალეწეს მისი გამოსახულებანი და მოკლეს მათანი, ბაალის ქურუმი, სამსხვერპლოების წინ. "},
	{18, "18 უფლის სახლის საქმენი იეჰოიადაყმა იმ მღვდლებს - ლევიანებს ჩააბარა, რომლებიც დავითმა უფლის სახლში გაამწესა უფლისთვის აღსავლენის შესწირად, როგორც მოსეს რჯულში წერია, სიხარულითა და გალობით, დავითის განაწესის მიხედვით. "},
	{19, "19 მცველები ჩააყენა უფლის სახლის კარში, რათა რაიმეთი გაუწმიდურებული არ შესულიყო. "},
	{20, "20 წამოიყვანა ასისთავები, დიდებულები, ერისმთავრები, ქვეყნის მთელი ხალხი, და გაჰყვა მეფეს უფლის სახლიდან, ზემო ჭიშკრის გავლით, მეფის სასახლემდე, დასვეს მეფე სამეფო ტახტზე. "},
	{21, "21 გამხიარულდა მთელი ქვეყნის ერი და დაწყნარდა ქალაქი. ხოლო ღოთოლია მახვილით მოკლეს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view24() {
struct ka24 poems[] = {
	{1, "1 შვიდი წლის იყო იოაში, როცა გამეფდა, და ორმოცი წელი იმეფა იერუსალიმში. მისი დედა იყო ციბაი, ბარშებადან. "},
	{2, "2 სწორად იქცეოდა უფლის თვალში იოაში იეჰოიადაყ მღვდლის სიცოცხლეში. "},
	{3, "3 ორი ცოლი მოუყვანა მას იეჰოიადაყმა და შეეძინა ძენი და ასულნი. "},
	{4, "4 ამის შემდეგ იოაშმა გულით მოიწადინა უფლის სახლის შეკეთება. "},
	{5, "5 შეკრიბა მღვდლები, ლევიანები და უთხრა: დაიარეთ იუდას ქალაქები და მთელ ისრაელში ვერცხლი მოაგროვეთ წლიდან წლამდე უფლის სახლის შესაკეთებლად. დააჩქარეთ ეს საქმე. მაგრამ ლევიანებმა არ დააჩქარეს. "},
	{6, "6 დაიბარა მეფემ იეჰოიადაყი, მათი თავკაცი, და უთხრა: რატომ არ მოსთხოვ ლევიანებს, რომ იუდასგან და იერუსალიმისგან აკრიბონ ის გადასახადი, რომელიც მოსემ, უფლის მორჩილმა და ისრაელის კრებულმა დაადგინეს სადღესასწაულო კარვისთვის? "},
	{7, "7 რადგან ურჯულო ღოთოლიამ და მისმა ვაჟებმა დააზიანეს ღვთის სახლი, და უფლის სახლის მთელი შემოწირულობა ბაალებს მოახმარეს. "},
	{8, "8 ბრძანა მეფემ და გააკეთეს ერთი კიდობანი. დადგეს იგი უფლის სახლის შესასვლელთან, გარეთ. "},
	{9, "9 გამოაცხადეს იუდაში და იერუსალიმში, რომ უფლისთვის მოეტანათ ის შესაწირავი, რომელიც მოსემ, ღვთის მორჩილმა, დაუწესა ისრაელს უდაბნოში. "},
	{10, "10 გაიხარა ყველა მთავარმა და მთელმა ერმა. მოდიოდნენ და ყრიდნენ კიდობანში, ვიდრე არ გაივსო. "},
	{11, "11 როდესაც ლევიანთა ხელით კიდობანს მეფის მოხელეებს წაუღებდნენ და ნახავდნენ რომ იგი სავსე იყო ვერცხლით, მოვიდოდნენ მეფის მწერალი და მღვდელმთავრის სანდო კაცი და გადმოაპირქვავებდნენ კიდობანს. მერე ისევ წაიღებდნენ და თავის ადგილზე დააბრუნებდნენ. ასე იქცეოდნენ დღიდან დღემდე და დიდძალი ვერცხლი დააგროვეს. "},
	{12, "12 ჩააბარებდნენ ამას მეფე და იეჰოიადაყი უფლის სახლის სამუშაოთა შემსრულებლებს. ისინი კი დაიქირავებდნენ ქვისმთლელებსა და დურგლებს, უფლის სახლის გასაახლებლად, რკინა-სპილენძის მჭედლებს უფლის სახლის გასამაგრებლად. "},
	{13, "13 იშრომეს სამუშაოს შემსრულებლებმა და მოამთავრეს შეკეთება მათი ხელით. აღადგინეს ღვთის სახლი თავისი წესის და რიგის მიხედვით და გაამაგრეს. "},
	{14, "14 როცა მორჩნენ, მეფესა და იეჰოიადაყს მიუტანეს დარჩენილი ვერცხლი. დაამზადეს მისგან უფლის სახლისთვის ჭურჭლეული - სამსახურებელი და აღსავლენისთვის საჭირო ჭურჭელი, თასები, ოქროსა და ვერცხლის ჭურჭელი. იეჰოიადაყის მთელი სიცოცხლის მანძილზე მუდამ აღავლენდნენ აღსავლენს უფლის სახლში. "},
	{15, "15 დაბერდა იეჰოიადაყი და გაძღა დღეებით და მოკვდა. ასოცდაათი წლისა იყო, როცა მოკვდა. "},
	{16, "16 დავითის ქალაქში დამარხეს იგი, მეფეთა გვერდით, რადგან სიკეთეს აკეთებდა ისრაელში ღვთისთვის და მისი სახლისთვის. "},
	{17, "17 იეჰოიადაყის სიკვდილის შემდეგ მოვიდნენ იუდას მთავრები და თაყვანისცეს მეფეს. მაშინ გაუგონა მათ მეფემ. "},
	{18, "18 მიატოვეს უფლის, თავიანთი მამა-პაპის ღმერთის სახლი და დაუწყეს მსახურება აშერებსა და კერპებს. განრისხდა უფალი იუდაზე და იერუსალიმზე ამ დანაშაულის გამო. "},
	{19, "19 მოუვლინა წინასწარმეტყველები, რათა უფალს დაბრუნებოდნენ. ამხელდნენ ისინი, მაგრამ ყურს არ უგდებდნენ მათ. "},
	{20, "20 ღვთის სულმა მოიცვა ზაქარია, იეჰოიადაყის ძე, მღვდელი; შედგა იგი ხალხის წინ მაღლობზე და თქვა: ასე ამბობს ღმერთი: რატომ არღვევთ უფლის მცნებებს? ამიტომ ხელი აღარ მოგემართებაო. რაკი მიატოვეთ უფალი, ისიც გტოვებთ თქვენ. "},
	{21, "21 შეითქვნენ მის წინააღმდეგ და მეფის ბრძანებით ჩააქვავეს უფლის სახლის ეზოში. "},
	{22, "22 არ გაიხსენა მეფე იოაშმა მადლი, რაც იეჰოიადაყმა, მამამისმა, უყო მას, და მოკლა მისი ვაჟი. როცა კვდებოდა, თქვა: იხილოს უფალმა და მოჰკითხოს! "},
	{23, "23 წელიწადი რომ შემოიქცა, წამოვიდა მის წინააღმდეგ არამის ლაშქარი, შეიჭრა იუდაში და იერუსალიმში და გაწყვიტა ხალხში ყველა ერისმთავარი. მთელი ნაალაფარი დამასკოს მეფეს გაუგზავნეს. "},
	{24, "24 მცირეოდენი ხალხით მოვიდა არამის ლაშქარი, მაგრამ უფალმა მათ ხელში დიდძალი ლაშქარი ჩააგდო, რადგან მიატოვეს უფალი, მამა-პაპის ღმერთი. იოაშს კი მსჯავრი დასდეს. "},
	{25, "25 როცა წავიდნენ მისგან და მძიმედ დასნეულებული მიატოვეს, შეითქვნენ მის წინააღმდეგ მისი მორჩილნი იეჰოიადაყ მღვდლის შვილის სისხლის ასაღებად და თავისსავე საწოლში მოკლეს. ასე მოკვდა იგი. დამარხეს დავითის ქალაქში, მაგრამ არა მეფეთა სამარხში. "},
	{26, "26 აჰა, მის წინააღმდეგ შეთქმულნი: ზაბადი, ძე შიმყათისა, ყამონელი დიაცისა, და იეჰოზაბადი, ძე შიმრითისა, მოაბელი დიაცისა. "},
	{27, "27 მისი ვაჟების, მასზე თქმული მრავალი ნაქადაგარის და ღვთის სახლის შეკეთების ამბავი მეფეთა წიგნის საკითხავშია ჩაწერილი. მის ნაცდლად მისი ძე, ამაციაჰუ გამეფდა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view25() {
struct ka25 poems[] = {
	{1, "1 ოცდახუთი წლისა იყო ამაციაჰუ, რომ გამეფდა, და ოცდაცხრა წელი იმეფა იერუსალიმში. დედამისი იყო იეჰოყადანი, იერუსალიმიდან. "},
	{2, "2 სწორად იქცეოდა უფლის თვალში, თუმცა არა მთელი გულით. "},
	{3, "3 როცა გაუმტკიცდა მეფობა, დახოცა თავისი მორჩილნი, რომელთაც მოკლეს მეფე, მამამისი. "},
	{4, "4 მაგრამ მათი შვილები არ დაუხოცავს, რადგან სწერია მოსეს რჯულის წიგნში, უფლის ბრძანებისამებრ: არ უნდა მოიკლან მამები შვილთა გამო და შვილები მამათა გამო არ უნდა მოიკლან, არამედ თითოეული თავისი დანაშაულისაოვის უნდა მოიკლას. "},
	{5, "5 შეკრიბა ამაციაჰუმ იუდა და დააყენა მამისსახლების, ათასისთავების და ასისთავების მიხედვით მთელი იუდა და ბენიამინი. აღრიცხა ოცი წლის ასაკს გადაცლებულნი და გამოვიდა სამასი ათასი რჩეული კაცი, ლაშქრად გამსვლელი და ფარ-შუბის დამჭერი. "},
	{6, "6 ას ქანქარ ვერცხლად იქირავა ისრაელისგან ასი ათასი მამაცი მებრძოლი. "},
	{7, "7 მივიდა მასთან ღვთისკაცი და უთხრა: ნუ გაიყოლებ ისრაელის ჯარს, რადგან არ არის უფალი ისრაელთან, არცერთთან ეფრემიანთაგან. "},
	{8, "8 მხოლოდ შენ წადი. იმოქმედე და მტკიცედ იყავი ბრძოლაში, თორემ დაგამარცხებს უფალი შენი მტრების წინაშე, რადგან ღმერთს შეწევნაც შეუძლია და დამარცხებაც. "},
	{9, "9 უთხრა ამაციაჰუმ ღვთისკაცს: მაშ, ას ქანქარს რაღა ვუყო, რომელიც უკვე მივეცი ისრაელის მოქირავნეებს? მიუგო ღვთისკაცმა: უფალს ამაზე მეტი შეუძლია მოგცეს. "},
	{10, "10 გამოაცალკევა ამაციაჰუმ ჯარი, ეფრემიდან რომ მოუვიდა, თავიანთ ადგილზე დასაბრუნებლად. ძალიან განრისხდნენ იუდაზე და გაცეცხლებულნი დაბრუნღნენ თავიანთ ადგილას. "},
	{11, "11 ძალი მოიცა ამაციაჰუმ, გაუძღვა თავის ხალხს მარილოვანი ველისკენ და ათი ათასი სეყირიანი ამოხოცა. "},
	{12, "12 ათი ათასი კაცი ცოცხლად ჩაიგდეს ტყვედ და წამოასხეს იუდიანებმა. აიყვანეს კლდის წვერზე და გადმოყარეს კლდის წვერიდან. ყველანი ერთიანად გაწყდნენ. "},
	{13, "13 ხოლო ლაშქარი, რომელიც უკან გააბრუნა, რომ საომრად არ გაჰყოლოდა, შეესია იუდას ქალაქებს სამარიიდან ბეთ-ხორონამდე. სამი ათასი კაცი დახოცეს და დიდძალი ნაძარცვი დახვეტეს. "},
	{14, "14 როცა დაბრუნდა ამაციაჰუ ედომელების განადგურების შემდეგ, წამოასხა სეყირიანთა ღმერთები და ღმერთებად დაიყენა. მათ სცემდა თაყვანს და უკმევდა."},
	{15, "15 განურისხდა უფალი ამაციაჰუს. მიუვლინა წინასწარმეტყველი, რომელმაც უთხრა: რად მოძებნე მაგ ხალხის ღმერთები, რომელთაც ვერ იხსნეს ეგ ხალხი შენი ხელიდან? "},
	{16, "16 როცა ამას ეუბნებოდა, უთხრა მას მეფემ: რაო, მეფის მრჩევლად დაგაყენეს? შეწყვიტე. რისთვის უნდა მოაკლევინო თავი? შეწყვიტა წინასწარმეტყველმა და თქვა: ვიცი, შენი დაღუპვა გადაწყვიტა უფალმა, რადგან ასე გააკეთე და არ გაიგონე ჩემი რჩევა. "},
	{17, "17 ითათბირა ამაციაჰუ იუდას მეფემ და კაცი გაუგზავნა იოაშს, იეჰოახაზ იაჰუს ძის ძეს ისრაელის მეფეს, და შეუთვალა: მოდი, მოვსინჯოთ ერთმანეთი. "},
	{18, "18 შემოუთვალა იოაშმა ისრაელის მეფემ, ამაციაჰუს, იუდას მეფეს: ლიბანის კვრინჩხმა შეუთვალა ლიბანის ნაძვს: ცოლად მიათხოვე შენი ასული ჩემს ვაჟს. მაგრამ ჩაიარა ლიბანის გარეულმა მხეცმა და გათელა კვრინჩხი. "},
	{19, "19 ამბობ, ედომი დავამარცხეო, და აჰა, გული მოგეცა საამპარტავნოდ. ახლა იჯექი შენ სახლში. რისთვის სტეხ შფოთს? შენც დაეცემი და იუდაც შენთან ერთად. "},
	{20, "20 ყური არ ათხოვა ამაციაჰუმ, რადგან ღვთისგან იყო ეს, რომ მტრის ხელში ჩავარდნილიყო, რაკი ედომელთა ღმერთები მოძებნა. "},
	{21, "21 მაშინ გამოვიდა იოაში, ისრაელის მეფე, და მოსინჯეს ერთმანეთი, მან და ამაციაჰუმ, იუდას მეფემ, ბეთ-შემეშთან, იუდაში რომ არის. "},
	{22, "22 დამარცხდნენ იუდაელები ისრაელიანებთან და თავთავის კარვებში გაიფანტნენ. "},
	{23, "23 ხოლო ამაციაჰუ, იუდას მეფე, ძე იოაშ ახაზიაჰუს ძისა, შეიპყრო იოაშ ისრაელის მეფემ ბეთ-შემეშში და მიადგა იერუსალიმს. დაანგრია იერუსალიმის კედელი ეფრემის კარიბჭიდან კუთხის კარიბჭემდე, ოთხასი წყრთის სიგრძეზე. "},
	{24, "24 გაზიდა მთელი ოქრო-ვერცხლი, მთელი ჭურჭელი რაც კი უფლის სახლში ინახებოდა ყობედ-ედომთან, და მეფის სახლის საგანძური. აიყვანა მძევლები და გაბრუნდა სამარიას. "},
	{25, "25 ისრაელის მეფის, იოაშ იეჰოახაზის ძის, სიკვდილის შემდეგ თხუთმეტი წელი იცოცხლა ამაციაჰუ იოაშის ძემ, იუდას მეფემ. "},
	{26, "26 ამაციაჰუს დააარჩენი საქმეები - პირველნი და უკანასკნელნი, იუდასა და ისრაელის მეფეთა წიგნშია ჩაწერილი. "},
	{27, "27 მას შემდეგ, რაც ამაციაჰუ უფალს განუდგა, შეითქვნენ მის წინააღმდეგ იერუსალიმში, და მან თავი შეაფარა ლაქიშს. მიუგზავნეს კაცები ლაქიშში და იქ მოკლეს. "},
	{28, "28 წამოასვენეს ცხენებით და დამარხეს თავის მამა-პაპის გვერდით იუდას ქალაქში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view26() {
struct ka26 poems[] = {
	{1, "1 გამოიყვანა იუდას მთელმა ხალხმა ყუზიაჰუ, თექვსმეტი წლის ყმაწვილი, და მამამისის, ამაციაჰუს, ნაცვლად გაამეფეს. "},
	{2, "2 მან აღადგინა ელოთი და დაუბრუნა იუდას. მერე განისვენა მეფემ მამა-პაპასთან. "},
	{3, "3 თექვსმეტი წლის იყო ეუზიაჰუ, რომ გამეფდა, და ორმოცდათორმეტი წელი იმეფა იერუსალიმში. დედამისი იყო იექალია, იერუსალიმელი. "},
	{4, "4 სწორად იქცეოდა უფლის თვალში, როგორც ამაციაჰუ, მამამისი, იქცეოდა. "},
	{5, "5 ეძიებდა ღმერთს, ვიდრე ცოცხალი იყო ზაქარია წინასწარმეტყველი, საღვთო ხილვების მეცნაური. ვიდრე ეძებდა უფალს, ღმერთიც შეეწეოდა მას. "},
	{6, "6 გადიოდა და ებრძოდა ფილისტიმელებს. დაანგრია გათის, იაბნესა და აშდოდის კედლები. ქალაქები გააშენა აშდოდში და ფილისტიმელებში. "},
	{7, "7 ღმერთი შეეწეოდა ფილისტიმელების, არაბების, გურ-ბაყალის მცხოვრებთა და მეყუნელთა წინააღმდეგ. "},
	{8, "8 ყამონელნი ძღვენს უგზავნიდნენ ყუზიაჰუს და მისმა სახელმა ეგვიპტის საზღვრებამდე მიაღწია, რადგან მეტად გაძლიერდა იგი. "},
	{9, "9 ააგო ყუზიაჰუმ იერუსალიმშიკოშკები კუთხის კარიბჭეზე, ველის კარიბჭეზე და კუთხეში და გაამაგრა. "},
	{10, "10 ააგო კოშკები უდაბნოშიც და უამრავი ჭა ამოიყვანა, რადგან ბევრი ხარ-ძროხა ჰყავდა დაბლობში და ვაკეზე. მიწისმუშაკნი და მევენახენი კი მთებში და ქარმელში ჰყავდა, რადგან მიწის მოყვარული იყო. "},
	{11, "11 ყუზიაჰუს მებრძოლი ჯარი ჰყავდა, რომელიც გუნდ-გუნდად გამოდიოდა ომში და აღნუსხული იყო მათი რიცხვის მიხედვით იეყიელ მწერლისა და მაყასიაჰუ ზედამხედველის ხელით, და ხანანიას, მეფის ერთ-ერთი კარისკაცის, ხელმძღვანელობით. "},
	{12, "12 მამისსახლთა თავკაცების, მაგარ ვაჟკაცთა, სრული რიცხვი იყო ორიათას ექვსასი, "},
	{13, "13 მათ ხელში იყო სამასშვიდიათას ხუთას კაციანი ლაშქარი, რომელიც თავგამოდებით იბრძოდა მეფის დასახმარებლად მტრების წინააღმდეგ. "},
	{14, "14 დაუმზადა ყუზიაჰუმ მთელ ლაშქარს ფარები, შუბები, მუზარადები, ჯაჭვის პერანგები, მშვილდები და შურდულის ქვები. "},
	{15, "15 გააკეთა იერუსალიმში გამომგონებლის მიერ გამოგონებული მანქანები, რომ დაედგათ კოშკებზე და კუთხეებში დიდრონი ისრებისა და ლოდების სატყორცნად. შორს გაითქვა სახელი, რადგან საკვირველად იყო შეწევნილი, ვიდრე არ გაძლიერდა. "},
	{16, "16 როცა გაძლიერდა ყუზიაჰუ, გადიდგულდა და თავისდა დასაღუპავად შესცოდა უფალს, თავის ღმერთს, რადგან შევიდა უფლის ტაძარში საკმევლის საკმევად სამსხვერპლოზე. "},
	{17, "17 მას მიჰყვა მღვდელი ყაზარიაჰუ უფლის მღვდლების, ოთხმოცი ვაჟკაცის თანხლებით. "},
	{18, "18 წინ გადაუდგნენ მეფე ყუზიაჰუს და უთხრეს: შენ არ გეკუთვნის ყუზიაჰუ, უფლისათვის კმევა, არამედ მღვდლებს, აარონიანებს, რომელნიც მკმევლებად არიან ნაკურთხნი. გამოდი საწმიდარიდან! რადგან შესცოდე და პატივად არ ჩაგეთვლება უფლისგან, შენი ღმერთისგან. "},
	{19, "19 განრისხდა ყუზიაჰუ, ხელში კი საცეცხლური ეჭირა საკმევად, და როცა განურისხდა მღვდლებს, კეთრი გამოაჩნდა შუბლზე მღვდლების წინაშე, უფლის სახლში, საკმევლის სამსხვერპლოსთან. "},
	{20, "20 მიიხედეს მისკენ ყაზარიაჰუ მღვდელმთავარმა და ყველა მღვდელმა და, აჰა, შუბლზე კეთრი აქვს. სასწრაფოდ გამოიყვანეს იქიდან. თვითონაც ჩქარობდა გამორიდებას, რადგან უფალმა დაჰკრა მას. "},
	{21, "21 სიკვდილამდე კეთროვანი იყო მეფე ეუზიაჰუ, ცხოვრობდა ცალკე სახლში, როგორც კეთროვანი, რადგან მოკვეთილი იყო უფლის სახლიდან. მისი ძე იოთამი კი მეფის სახლს განაგებდა და განიკითხავდა ქვეყნის ერს. "},
	{22, "22 ყუზიაჰუს დანარჩენი ამბები - პირველნი და უკანასკნელნი აღწერა წინასწარმეტყველმა ესაიამ, ამოცის ძემ. "},
	{23, "23 განისვენა ყუზიამ თავის მამა-პაპასთან და დამარხეს იგი თავისი მამა-პაპის გვერდით, მეფეთა სამარხავ მინდორზე, რადგან ამბობდნენ: კეთროვანიაო. მის ნაცვლად მისი ძე იოთამი გამეფდა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view27() {
struct ka27 poems[] = {
	{1, "1 ოცდახუთი წლის იყო იოთამი, რომ გამეფდა და თექვსმეტი წელი იმეფა იერუსალიმში. დედამისი იყო ერუში, ცადოკის ასული. "},
	{2, "2 სწორად იქცეოდა უფლის თვალში, როგორც მამამისი ყუზიაჰუ იქცეოდა. ოღონდ უფლის ტაძარში არ შესულა. ხალხი კი ძველებურად სცოდავდა. "},
	{3, "3 ააგო უფლის სახლის ზემო კარიბჭე და ყოფელის კედელიც ბევრგან აღადგინა. "},
	{4, "4 იუდას მთაზე ქალაქები ააშენა, ტყეებში კი ციხესიმაგრეები და კოშკები. "},
	{5, "5 ყამონიანთა მეფეს ებრძოდა და სძლია მას. ყამონიანებმა იმ წელს ასი ქანქარი ვერცხლი, ათიათასი ქორი ხორბალი და ქერი მისცეს. ამდენსავე აძლევდნენ ყამონიანები მეორე და მესამე წელს. "},
	{6, "6 გაძლიერდა იოთამი, რადგან თავის გზებს უფლის, თავისი ღმერთის, წინაშე წარმართავდა. "},
	{7, "7 იოთამის დანარჩენი ამბები, ყველა მისი ომი და ნამოქმედარი ჩაწერილია იუდასა და ისრაელის მეფეთა წიგნში. "},
	{8, "8 ოცდახუთი წლის იყო, როცა გამეფდა და თექვსმეტი წელი იმეფა იერუსალიმში. "},
	{9, "9 განისვენა იოთამმა თავის მამა-პაპასთან და დამარხეს დავითის ქალაქში. მის ნაცვლად მისი ძე ახაზი გამეფდა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view28() {
struct ka28 poems[] = {
	{1, "1 ოცი წლისა იყო ახაზი, როცა გამეფდა და თექვსმეტი წელი იმეფა იერუსალიმში. არ იქცეოდა ისე სწორად უფლის თვალში, როგორც მამამისი დავითი. "},
	{2, "2 დადიოდა ისრაელის მეფეთა გზით. ბაალების ქანდაკებებიც კი ჩამოასხა. "},
	{3, "3 საკმეველს აკმევდა ბენ-ჰიმონის ველზე. ცეცხლში ატარებდა თავის შვილებს იმ წარმართთა ბილწი ჩვეულებისამებრ, რომელნიც აჰყარა უფალმა ისრაელიანთაგან. "},
	{4, "4 მსხვერპლს სწირავდა და საკმეველს აკმევდა გორაკებზე, ბორცვებზე და ყოველი ხემხვივანის ქვეშ. "},
	{5, "5 და ჩააგდო იგი უფალმა, მისმა ღმერთმა, არამის მეფის ხელში. დაამარცხეს იგი, მრავალნი დაატყვევეს და დამასკოში წაასხეს. გარდა ამისა, ჩააგდო იგი ისრაელის მეფის ხელშიც, რომელმაც სასტიკად დაამარცხა. "},
	{6, "6 ფეკად რემელიაჰუს ძემ ერთ დღეში ას ოცი ათასი ამოხოცა იუდაში - ყველა კარგი ვაჟკაცი. რადგან მიატოვეს უფალი, თავიანთი მამა-პაპის ღმერთი. "},
	{7, "7 ზიქრიმ, ეფრემელმა გოლიათმა, დახოცა: მაყასიაჰუ უფლისწული, სახლთუხუცესი ყაზრიკამი და ელკანა, მეფის მეორე კაცი. "},
	{8, "8 წაასხეს ტყვედ ისრაელიანებმა თავიანთ მოძმეთაგან ორასი ათასი დიაცი, ვაჟი და ასული. დიდძალი ნადავლი წაართვეს და სამარიაში მიიტანეს ნაალაფარი. "},
	{9, "9 იყო იქ უფლის წინასწარმეტყველი, სახელად ყოდედი. გამოვიდა სამარიაში დაბრუნებული ლაშქრის წინაშე და უთხრა: აჰა, განრისხებულია უფალი, თქვენი მამა-პაპის ღმერთი იუდაზე, ხელში ჩაგიგდოთ იგი და თქვენც ამოწყვიტეთ ისინი ისეთი სიცოფით, რომელიც ცას მისწვდა. "},
	{10, "10 ახლა კი ფიქრობთ, რომ ყმებად და მხევლებად გაიხადოთ იუდიანები და იერუსალიმი! განა თქვენ არა გაქვთ დანაშაული უფლის, თქვენი ღმერთის წინაშე? "},
	{11, "11 ახლა კი გამიგონეთ და დააბრუნეთ ტყვეები, თქვენი მოძმეებისგან რომ წამოასხით, თორემ უფლის რისხვა დაგატყდებათ. "},
	{12, "12 წინ აღუდგნენ ეფრემიანთა თავკაცები - ყაზარიაჰუ იეჰოხანანის ძე, ბერექიაჰუ მეშილემოთის ძე, იეხიზკიაჰუ შალუმის ძე და ყამასა ხალდაის ძე ომიდან მოსულთ. "},
	{13, "13 უთხრეს: ნუ შემოიყვანთ აქ ტყვეებს, რადგან დანაშაული გვაქვს უფლის წინაშე ჩადენილი, თქვენ კი გინდათ, რომ კიდევ შემატოთ ჩვენს ცოდვებს და დანაშაულებს. რადგან დიდია ჩვენი დანაშაული და რისხვა ისრაელზე. "},
	{14, "14 მიატოვეს მხედრებმა ტყვეები და ნაალაფარი სარდლებისა და კრებულის წინაშე. "},
	{15, "15 ადგნენ სახელებით მოხსენებული ეს კაცები, მოკიდეს ხელი ტყვეებს და, ვინც კი შიშველი იყო მათგან, ყველა შემოსეს იმ ნაალაფარიდან. შემოსეს და ფეხზე ჩააცვეს, აჭამეს და ასვეს. ზეთი სცხეს, მერე სხედრებზე შესხეს ყველა დაუძლურებული და მიაცილეს იერიხონამდე, პალმების ქალაქამდე, მათ მოძმეებამდე. თვითონ კი სამარიაში დაბრუნდნენ. "},
	{16, "16 იმ დროს მეფე ახაზმა მოციქულები გაუგზავნა აშურის მთავრებს, რათა დახმარება გაეწიათ მისთვის. "},
	{17, "17 კვლავ მოვიდნენ ედომელები, დაამარცხეს იუდა და ტყვეები წაასხეს. "},
	{18, "18 ფილისტიმელებიც მოედვნენ დაბლობისა და იუდას სამხრეთის ქალაქებს. დაიპყრეს ბეთ-შემეში, აიალონი, გადეროთი, სოქო და მისი დაბები, თიმანა და მისი დაბები, გიმზო და მისი დაბები, და იქ დასახლდნენ. "},
	{19, "19 ასე დაამდაბლა უფალმა იუდა ახაზის, ისრაელის მეფის გამო, რადგან გარყვნა მან იუდა და ცოდვით სცოდავდა უფალს. "},
	{20, "20 მიუხდა მას თიგლათფალასარი, აშურის მეფე, და შეავიწროვა იგი დახმარების ნაცვლად. "},
	{21, "21 რადგან გაძარცვა ახაზმა უფლის სახლი, მეფის სახლი, და მთავრები, და მისცა აშურის მეფეს, მაგრამ არა თავისდა შესაწევად. "},
	{22, "22 თავისი გასაჭირის ჟამს უფრო სცოდავდა უფლის წინაშე მეფე ახაზი. "},
	{23, "23 მსხვერპლს სწირავდა დამასკოს ღმერთებს, რომელთაც დასცეს იგი, და ამბობდა: არამის მეფეთა ღმერთებია მათი შემწენი, შევწირავ მათ მსხვერპლს და მეც შემეწევიანო. მაგრამ ისინი მისი და მთელი ისრაელის დასამხობად იყვნენ. "},
	{24, "24 მოაგროვა ახაზმა უფლის სახლის ჭურჭლეული და დალეწა უფლის სახლის ჭურჭლეული, დაგმანა უფლის სახლის კარები და სამსხვერპლოები დაიდგა იერუსალიმის ყველა კუთხეში. "},
	{25, "25 იუდას ყველა ქალაქში გორაკები გამართა ღმერთებისთვის საკმევლის საკმევად და განარისხა უფალი, თავისი მამა-პაპის ღმერთი. "},
	{26, "26 დანარჩენი მისი ამბები და ყოველი მისი მოქმედება - პირველნი და უკანასკნელნი, იუდასა და ისრაელის მეფეთა წიგნშია ჩაწერილი. "},
	{27, "27 განისვენა ახაზმა თავის მამა-პაპასთან და დამარხეს ქალაქ იერუსალიმში, ოღონდ ისრაელის მეფეთა სამარხში არ შეუსვენებიათ. მის ნაცვლად მისი ძე, იეხიზკიაჰუ გამეფდა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view29() {
struct ka29 poems[] = {
	{1, "1 იეხიზკიაჰუ ოცდახუთი წლის გამეფდა და ოცდაცხრა წელი იმეფა იერუსალიმში. დედამისი იყო, აბია, ზაქარიას ასული. "},
	{2, "2 სწორად იქცეოდა უფლის თვალში, როგორც დავითი, მამამისი, იქცეოდა. "},
	{3, "3 მან თავისი მეფობის პირველსავე წელს, პირველ თვეში, გააღო უფლის სახლის კარებები და განაახლა ისინი. "},
	{4, "4 მოიყვანა მღვდლები, ლევიანები, და აღმოსავლეთის მოედანზე მოუყარა თავი. "},
	{5, "5 უთხრა მათ: მისმინეთ, ლევიანებო! ახლა კი განიწმიდენით და განწმიდეთ უფლის, თქვენი მამა-პაპის ღმერთის სახლი, გამოიტანეთ უწმიდურება საწმიდრიდან. "},
	{6, "6 შესცოდა ჩვენმა მამა-პაპამ, ბოროტად მოიქცა უფლის, ჩვენი ღმერთის თვალში, მიატოვა იგი, პირი მოარიდა უფლის სავანეს და ზურგი შეაქცია. "},
	{7, "7 დაგმანა კარიბჭის კარებები და ჩააქრო სასანთლენი, აღარც საკმეველი აკმია და აღარც აღსავლენი აღუვლინა საწმიდარში ისრაელის ღმერთს. "},
	{8, "8 უფლის რისხვა დაატყდა იუდასა და იერუსალიმს, გახადა იგი შესარცხვენად, მოსაოხრებლად და დასასტვენად, როგორც თქვენი თვალით ხედავთ. "},
	{9, "9 აჰა, მახვილით დაეცა ჩვენი მამა-პაპა. ჩვენი ვაჟები, ასულები და ცოლები ტყვეობაში არიან ამის გამო. "},
	{10, "10 ახლა გულით მწადია აღთქმა დავუდო უფალს, ისრაელის ღმერთს, რათა მიაქციოს ჩვენგან თავისი რისხვა. "},
	{11, "11 ჩემო შვილებო! ნუ იქნებით დაუდევარნი, რადგან თქვენ ამოგირჩიათ უფალმა, რათა თავის წინაშე დაეყენებინეთ, რომ სამსახური გაგეწიათ, მისი მსახურები და საკმევლის მკმეველები ყოფილიყავით. "},
	{12, "12 ადგნენ ლევიანები: მახათ ყამასაის ძე, იოელ ყაზარიაჰუს ძე - კეჰათიანთაგან. მერარიანთაგან: კიში, ძე ყაბდისა და ყაზარიაჰუ, ძე იეჰალელელისა. გერშუნიანთაგან: იოახ ზიმას ძე და ყედენ იოახის ძე. "},
	{13, "13 ელიცაფანიანთაგან: შიმრი და იეყიელი. ასაფიანთაგან: ზაქარია და მათანია. "},
	{14, "14 ჰემანიანთაგან: იეხიელი და შიმყი. იედუთუნიანთაგან: შემაყია და ყუზიელი. "},
	{15, "15 შეკრიბეს თავიანთი მოძმენი და განწმიდეს. მივიდნენ, როგორც მეფემ ბრძანა, უფლის სიტყვის მიხედვით, უფლის სახლის დასასუფთავებლად. "},
	{16, "16 შევიდნენ მღვდლები უფლის სახლის შიდაში დასასუფთავებლად და გამოხვეტეს ყოველგვარი არაწმიდა, რაც კი უფლის ტაძარსა და უფლის სახლის ეზოში ჰპოვეს. გამოიტანეს ლევიანებმა გარეთ კედრონის ხევში გადასაყრელად. "},
	{17, "17 პირველი თვის პირველ დღეს დაიწყეს განწმედა. თვის მერვე დღეს კი უფლის კარიბჭეს მიადგნენ. რვა დღე წმედდნენ უფლის სახლს და პირველი თვის მეთექვსმეტე დღეს მოათავეს. "},
	{18, "18 შევიდნენ შიდაში მეფე იეხიზკიაჰუსთან და მოახსენეს: გავასუფავეთ უფლის მთელი სახლი, აღსავლენის სამსხვერპლო და მთელი მისი ჭურჭლეული, საწირი პურის მაგიდა და მთელი მისი ჭურჭლეული. "},
	{19, "19 ასევე ყველა ის ჭურჭელი, რომელიც მეფე ახაზმა თავის მეფობაში უპატიოჰყო თავისი ურჯულოებით, ჩვენ მოვამზადეთ და წმიდავყავით. და, აჰა, უფლის სამსხვერპლოს წინ აწყვია ისინი. "},
	{20, "20 დილაადრიანად ადგა მეფე იეხიზკიაჰუ, შეყარა ქალაქის თავები და უფლის სახლში ავიდა. "},
	{21, "21 შვიდი კურატი, შვიდი ცხვარი, შვიდი ბატკანი და შვიდი თხა მიიყვანეს სამეფოს, საწმიდარისა და იუდას ცოდვისთვის. აარონიანებს, მღვდლებს, უბრძანა აღევლინათ უფლის სამსხვერპლოზე. "},
	{22, "22 დაკლეს ხარები და აიღეს მღვდლებმა სისხლი და სამსხვერპლოს ასხურეს. დაკლეს ცხვრები და სისხლი სამსხვერპლოს ასხურეს. დაკლეს ბატკნები და სისხლი სამსხვერპლოს ასხურეს. "},
	{23, "23 მორეკეს ცოდვის თხები მეფისა და კრებულის წინაშე და ხელები დაადეს მათ. "},
	{24, "24 დაკლეს ისინი მღვდლებმა და გაწმიდეს მათი სისხლით სამსხვერპლო მთელი ისრაელის ცოდვების დასაფარავად. რადგან მთელი ისრაელისთვის ბრძანა მეფემ აღსავლენი და ცოდვის მსხვერპლი. "},
	{25, "25 დააყენა ლევიანები უფლის სახლში წინწილებით, ქნარებითა და ბობღნებით, დავითისა და გადის, მეფის მისნის, და ნათან წინასწარმეტყველის მიერ დადგენილი წესის მიხედვით, რადგან ეს წესი უფლის მიერ იყო დადგენილი, მისი წინასწარმეტყველების ხელით. "},
	{26, "26 ლევიანები დავითის საკრავებით დადგნენ, მღვდლები კი საყვირებით. "},
	{27, "27 ბრძანება გასცა იეხიზკიაჰუმ, რომ აღევლინათ აღსავლენი სამსხვერპლოზე. როგორც კი დაიწყო აღსავლენის აღვლენა, მაშინვე გაისმა უფლის საგალობელი საყვირების ხმა დავით ისრაელის მეფის საკრავების თანხლებით. "},
	{28, "28 მთელი კრებული თაყვანს სცემდა, მგალობელნი გალობდნენ და საყვირები ხმიანობდნენ. ასე გრძელდებოდა აღსავლენის დამთავრებამდე. "},
	{29, "29 აღსავლენს რომ მორჩნენ, მეფემ და ყველამ, მასთან მყოფმა, მუხლი მოიყარეს და თაყვანი სცეს. "},
	{30, "30 მეფე იეხიზკიაჰუმ და მთავრებმა უთხრეს ადამიანებს, რომ ედიდებინათ უფალი დავითისა და ასაფ მისნის სიტყვებით. ისინიც სიხარულით აქებდნენ, მუხლს იდრეკდნენ და თაყვანს სცემდნენ. "},
	{31, "31 მიუგო იეხიზკიაჰუმ და თქვა: ახლა თქვენ ხელი ავსებული გაქვთ უფლისათვის. მოდით, მოიყვანეთ საკლავები და სამადლობელნი უფლის სახლში. კრებუღმა საკლავები და სამადლობელნი მოიყვანა, ხოლო ვინც გულუხვობა გამოიჩინა - აღსავლენი. "},
	{32, "32 იმ აღსავლენთა რიცხვი, კრებულმა რომ მოიყვანა, იყო: სამოცდაათი ხარი, ასი ცხვარი, ორასი ბატკანი. ყოველივე ეს უფლისათვის იყო აღსავლენად. "},
	{33, "33 სულ შეწირული იქნა: ექვსასი ხარი და სამიათასი ცხვარი. "},
	{34, "34 ოღონდ ცოტანი იყვნენ მღვდლები და აღარ შეეძლოთ ყველა აღსავლენის გატყავება, ამიტომ მათი მოძმე ლევიანები ეხმარებოდნენ მათ, ვიდრე საქმე არ მოთავდა და მღვდლები არ გაინათლნენ, რადგან ლევიანები უფრო გულმოდგინობდნენ გასანათლავად, ვიდრე მღვდლები. "},
	{35, "35 თანაც აღსავლენი უამრავი იყო სამადლობელი მსხვერპლის ლურთებითა და აღსავლენის საღვრელებითურთ. ასე განახლდა უფლის სახლის სამსახური. "},
	{36, "36 გაიხარა იეხიზკიაჰუმ და მთელმა ერმა იმის გამო, რაც ერს მოუმზადა უფალმა, რადგან მოულოდნელად მოხდა ეს ამბავი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view30() {
struct ka30 poems[] = {
	{1, "1 შეუთვალა იეხიზკიაჰუმ მთელს ისრაელს და იუდას. წერილები მისწერა ეფრემსა და მენაშეს, რათა მოსულიყვნენ უფლის სახლში, იერუსალიმში, უფლისთვის, ისრაელის ღმერთისთვის პასექის გადასახდელად. "},
	{2, "2 გადაწყვიტეს მეფემ, მისმა მთავრებმა და მთელმა კრებულმა იერუსალიმში, რომ პასექი მეორე თვეში გადაეხადათ. "},
	{3, "3 რადგან იმჟამად არ შეეძლო გადახდა, რაკი მღვდლები ჯერ არ იყვნენ განათლულნი და არც საკმარისი რაოდენობის ხალხი არ იყო თავმოყრილი იერუსალიმში. "},
	{4, "4 სწორად ჩაითვალა ეს ამბავი მეფისა და მთელი კრებულის თვალში. "},
	{5, "5 დაადგინეს, ხმა გაევრცელებინათ მთელ ისრაელში ბერშებადან დანამდე, რათა მოსულიყვნენ და პასექი გადაეხადათ უფლისთვის, ისრაელის ღმერთისთვის, იერუსალიმში, რადგან დიდხანს არ გადაეხადათ დაწერილის მიხედვით. "},
	{6, "6 მოიარეს მალემსრბოლებმა მეფისა და მისი მთავრების წერილებით მთელი ისრაელი და იუდა, და მეფის ბრძანებისამებრ გამოუცხადეს: ისრაელიანებო! დაუბრუნდით უფალს, აბრაამის, ისაკის, ისრაელის ღმერთს, და ისიც დაუბრუნდება თქვენს ნატამალს, აშურის მეფეთა ხელს რომ გადაურჩა. "},
	{7, "7 ნუ იქნებით თქვენი მამა-პაპის და მოძმეთა მსგავსნი, რომელთაც შესცოდეს უფალს, თქვენი მამა-პაპის ღმერთს, და მანაც გასწირა ისინი გასაპარტახებლად როგორც ხედავთ. "},
	{8, "8 ახლა მაინც ნუ იქნებით ქედფიცხელნი თქვენი მამა-პაპის მსგავსად. ხელი გაიწოდეთ უფლის მიმართ, მოდით მის საწმიდარში, რომელიც განათლული აქვს სამარადისოდ. ემსახურეთ უფალს, თქვენს ღმერთს, და გაბრუნდება თქვენგან მისი რისხვა. "},
	{9, "9 თუ დაუბრუნდებით უფალს, შებრალებას ჰპოვებენ თქვენი ძმები და შვილები იმათ წინაშე, ვინც ისინი დაატყვევეს, და დააბრუნებენ ამ ქვეყანაში, რადგან მოწყალე და შემბრალეა უფალი, ღმერთი თქვენი. პირს აღარ შეიბრუნებს თქვენგან, თუ დაუბრუნდებით მას. "},
	{10, "10 დადიოდნენ მალემსრბოლნი ქალაქიდან ქალაქში, ეფრემის, მენაშესა და ზებულუნის ქვეყანაში. მაგრამ დასცინოდნენ მათ და აბუჩად იგდებდნენ. "},
	{11, "11 მხოლოდ ზოგიერთნი მოდრკნენ აშერში, მენაშეში და ზებულუნში და მოვიდნენ იერუსალიმს. "},
	{12, "12 იუდაზეც იყო ღვთის ხელი მისთვის ერთი გულის ჩასადებად, რომ შეესრულებინათ, რაც მეფემ და მთავრებმა უბრძანეს, უფლის სიტყვისაებრ. "},
	{13, "13 დიდძალი ხალხი მოაწყდა იერუსალიმს მეორე თვეში უფუარობის დღესასწაულის გადასახდელად, მრავლის უმრავლესი იყო კრებული. "},
	{14, "14 ადგნენ და მოაშორეს სამსხვერპლოები, იერუსალიმში რომ იყო, ასევე ყველაფერი, რაზეც საკმეველი იკმეოდა. აიღეს და კედრონის ხევში გადაყარეს. "},
	{15, "15 დაკლეს პასექი მეორე თვის მეთოთხმეტე დღეს. შერცხვათ მღვდლებსა და ლევიანებს, გაინათლნენ და აღსავლენი მიიტანეს უფლის სახლში. "},
	{16, "16 დადგნენ თავ-თავიანთ ადგილზე, მათი წესისდა მიხედვით, მოსეს, ღვთისკაცის, რჯულის მიხედვით. მღვდლები სისხლს ლევიანთა ხელით ასხურებდნენ. "},
	{17, "17 მრავლად იყვნენ კრებულში გაუნათლავნი, ამიტომ დაკლეს ლევიანებმა პასექები, რათა უფლისათვის გაენათლათ ყოველი არაწმიდა. "},
	{18, "18 თუმცა ხალხის უმრავლესობა, მეტწილად ეფრემიგან, მენაშედან, ისაქარიდან და ზებულუნიდან არ გაწმედილა, მაინც ჭამეს პასექი, დაწერილის საწინააღმდეგოდ. რადგან ასე ილოცა მათთვის იეხიზკიაჰუმ. "},
	{19, "19 უფალმა სახიერმა მიუტევოს ყველას, ვინც განამზადა თავისი გული, რომ მოეძებნა ღმერთი, უფალი, თავისი მამა-პაპის ღმერთი, თუმცა საწმიდარის წესით არ განწმედილა. "},
	{20, "20 უსმინა უფალმა იეხიზკიაჰუს და მიუტევა ხალხს. "},
	{21, "21 ისრაელიანებმა და იმათ, ვინც კი იერუსალიმში იყო, შვიდ დღეს იზეიმეს უფუარობის დღესასწაული, დიდი სიხარულით. ლევიანები და მღვდლები ყოველდღე ადიდებდნენ უფალს უფლის ძლიერი საკრავებით. "},
	{22, "22 გულითადად ელაპარაკა იეხიზკიაჰუ ყველა ლევიანს, რომელიც კეთილი გონებით ემსახურებოდა უფალს. შვიდი დღე ჭამდნენ სადღესასწაულოს, სწირავდნენ სამადლობელ მსხვერპლს და მადლობდნენ უფალს, თავიანთ მამა-პაპის ღმერთს. "},
	{23, "23 გადაწყვატა მთელმა კრებულმა, რომ მომდევნო შვიდი დღეც ეზეიმათ, და ეს შვიდი დღეც სიხარულში გაატარეს, "},
	{24, "24 რადგან იეხიზკიაჰუმ, იუდას მეფემ, კრებულს უბოძა ათასი კურატი და შვიდი ათასი ცხვარი, მთავრებმა კი უბოძეს კრებულს ათასი კურატი, ცხრა ათასი ცხვარი და გაინათლა მრავალი მღვდელი. "},
	{25, "25 ხარობდა იუდას მთელი კრებული, მღვდლები და ლევიანები, ისრაელიდან მოსული მთელი კრებული, ისრაელის ქვეყნიდან მოსული ხიზნები და იუდას მკვიდრნი. "},
	{26, "26 ისეთი დიდი სიხარული სუფევდა იერუსალიმში, რომლის მსგავსი სოლომონ დავითის ძის, ისრაელის მეფის, დღეების მერე არ ყოფილა იერუსალიმში. "},
	{27, "27 წამოდგნენ მღვდლები, ლევიანები და აკურთხეს ერი. შესმენილ იქნა მათი ხმა და აღევლინა მთელი ლოცვა მის წმიდა სამყოფლამდე, ცაში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view31() {
struct ka31 poems[] = {
	{1, "1 ყოველივე ეს რომ დამთავრდა, გავიდა იქ მყოფი მთელი ისრაელი იუდას ქალაქებში და დალეწეს სვეტები, გაჩეხეს აშერები, დაანგრიეს გორაკები და სამსხვერპლოები მთელ იუდაში, ბენიამინში, ეფრემში, მენაშეში, ერთიანად. დაბრუნდა ყველა ისრაელიანი თავთავის სამკვიდრებელში და ქალაქში. "},
	{2, "2 დააყენა იეხეზკიაჰუმ მღვდელთა და ლევიანთა დასები, მათი დასებისდა მიხედვით, თავ-თავიანთი სამსახურის შესასრულებლად, მღვდლებად და ლევიანებად, აღსავლენისა და სამადლობელი მსხვერპლის შესაწირად, უფლის ბანაკის კარიბჭეებში საქებრად და სადიდებლად. "},
	{3, "3 დააწესა მეფის წილი, მისი ქონებიდან, აღსავლენისთვის - დილის და მწუხრის აღსავლენისთვის, შაბათების, ახალმთავრობების და დღესასწაულების აღსავლენისთვის, როგორც უფლის რჯულშია ჩაწერილი. "},
	{4, "4 უბრძანა იერუსალიმში მცხოვრებ ხალხს, რომ თავიანთი წილი გასამრჯელო მიეცათ მღვდლებისთვის და ლევიანებისთვის, რათა მტკიცედ დაეცვათ უფლის რჯული. "},
	{5, "5 როგორც კი ეს ბრძანება გავრცელდა, უხვად მოიტანეს ისრაელიანებმა ფქვილის, ღვინის, ზეთის, თაფლისა და მინდვრის ყველა მოსავლის პირველი ნაყოფი. სხვა ყველაფრის მეათედიც უხვად მოიტანეს. "},
	{6, "6 ისრაელიანებს და იუდიანებს, იუდას ქალაქების მკვიდრთ, მოჰქონდათ მეათედი ხარ-ძროხიდან და ცხვრიდან, მეათედი - შენაწირიდან, რომელიც უფლისთვის, თავიანთი ღმერთისთვის ჰქონდათ შეწირული. მოიტანეს და გროვად დაახვავეს. "},
	{7, "7 მესამე თვეში დაიწყეს გროვების დახვავება და მეშვიდე თვეში მოამთავრეს. "},
	{8, "8 მოვიდნენ იეხიზკიაჰუ და მთავრები, დაინახეს გროვები და აკურთხეს უფალი და მისი ერი - ისრაელი. "},
	{9, "9 ჰკითხა იეხიზკიაჰუმ მღვდლებსა და ლევიანებს გროვების თაობაზე. "},
	{10, "10 მიუგო მას ყაზარიაჰუ მღვდელმთავარმა, ცადოკის სახლის კაცმა, და უთხრა: როცა დაიწყეს უფლის სახლში ძღვენის მოტანა, ძღომაზე ვჭამდით, მაგრამ მაინც ბევრი დარჩა, რადგან უფალმა აკურთხა თავისი ერი, და მონარჩენიდან კიდევ ამდენი დარჩა. "},
	{11, "11 ბრძანა იეხიზკიაჰუმ, ოთახები მოემზადებინათ უფლის სახლში. და მოამზადეს. "},
	{12, "12 შეზიდეს პატიოსნად ძღვენი, მეათედი და შეწირულობანი. უფროსად იყო ლევიანი ქონანიაჰუ, მისი ძმა შიმყი მეორე კაცი იყო. "},
	{13, "13 იეხიელი, ყაზაზიაჰუ, ნახათი, ყასაელი, იერიმოთი, იოზაბადი, ელიელი, ისმაქიაჰუ, მახათი და ბენიაჰუ მეთვალყურენი იყვნენ ქონანიაჰუსა და მისი ძმის, შიმყის ხილქვეით, მეფე იეხიზკიაჰუსა და ყაზარიაჰუს, უფლის სახლის წინამძღვრის ბრძანებით. "},
	{14, "14 კორე იმნას ძე, ლევიანი, აღმოსავლეთის მხარის კარის მცველი, ღვთისადმი ნებაყოფლობით შესაწირავზე იყო, რათა გაეცა უფლის ძღვენი და ყველაზე წმიდა შეწირულობანი. "},
	{15, "15 მისი ხელქვეით მღვდელთა ქალაქებში იყვნენ: ყედენი, მინიამინი, იეშუაყი, შემაყიაჰუ, შექანიაჰუ, რომ სამართლიანად გაენაწილებინათ მოძმეთათვის მათი დასებისდა მიხედვით, როგორც დიდისთვის, ისე პატარისთვის, "},
	{16, "16 საგვარტომო ნუსხაში ჩაწერილთა გარდა სამი წლიდან მოყოლებული ყველა მამაკაცისთვის, უფლის სახლში ყველა მიმსვლელისთვის ყოველდღიურ საქმეზე, მათი სამსახურისთვის, მათ თანამდებობებზე დასებისდა მიხედვით, "},
	{17, "17 საგვარტომო ნუსხაში ჩაწერილი მღვდლებისთვის, მათ მამისსახლთა მიხედვით, ოც წელს გადაცილებულ ლევიანთათვის, თავიანთ თანამდებობისა და დასებისდა მიხედვით, "},
	{18, "18 საგვარტომო ნუსხაში ჩაწერილი ყველა მათი წვრილშვილისთვის, ცოლებისთვის, ვაჟებისთვის და ასულებისთვის, მთელი კრებულისათვის, რადგან პატიოსნად გაინათლნენ სიწმიდისთვის. "},
	{19, "19 ხოლო აარონიანთათვის - მღვდელთათვის, მათი ქალაქების ირგვლივ ველ-მინდვრებზე რომ მკვიდრობდნენ, ყოველ ქალაქში კაცები განაწესეს სახელდებით, რომ წილი მიეცათ ყოველი მამაკაცისთვის სამღვდელოთა შორის და საგვარტომო ნუსხაში ჩაწერილი ყველა ლევიანისთვის. "},
	{20, "20 ასე გააკეთა იეხიზკიაჰუმ მთელ იუდაში. იგი სიკეთით, სისწორით და პატიოსნებით იქცეოდა უფლის, თავისი ღმერთის წინაშე. "},
	{21, "21 ყველა საქმეში, რასაც კი წამოიწყებდა, ღვთის სახლის სამსახურში, რჯულში თუ მცნებებში, ყველგან თავის ღმერთს ეძებდა, მთელი გულით მოქმედებდა და იმარჯვებდა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view32() {
struct ka32 poems[] = {
	{1, "1 ამ პატიოსან საქმეთა შემდეგ მოვიდა სანხერიბი, აშურის მეფე, შემოიჭრა იუდაში და ალყა შემოარტყა ციხე-ქალაქებს, მათ გატეხას ფიქრობდა. "},
	{2, "2 როცა დაინახა იეხიზკიაჰუმ, რომ მოვიდა სანხერიბი და იერუსალიმზე ლაშქრობას აპირებს, "},
	{3, "3 გადაწყვიტა თავის სარდლებთან და თავის მებრძოლებთან ერთად, დაეწყვიტა წყაროს სათავეები, რომლებიც ქალაქის გარეთ იყო, და ისინიც მიეხმარნენ. "},
	{4, "4 შეიყარა უამრავი ხალხი და დაწყვიტეს ყველა სათავე და ნაკადული, რაც კი დიოდა იმ მიწაზე, რადგან თქვეს: რატომ უნდა ნახონ აქ მოსულმა აშურის მეფეებმა ბევრი წყალი? "},
	{5, "5 მოიცა ძალი და ამოაშენა ყველა დანგრეული კედელი, აამაღლა გოდლები და გარედან კიდევ სხვა კედელი შემოაშენა. გაამაგრა მილო დავითის ქალაქში, დაამზადა დიდძალი საჭურველი და ფარები. "},
	{6, "6 ჯარის უფროსები დაუყენა ხალხს, შემოიკრიბა ისინი ქალაქის კარიბჭის მოედანზე და გაამხნევა: "},
	{7, "7 გამტკიცდით და გაძლიერდით! ნუ შიშობთ და ნუ თრთით აშურის მეფისა და იმ ურდოს წინაშე, თან რომ ახლავს, რადგან ჩვენთან უფრო მეტნი არიან, ვიდრე მასთან."},
	{8, "8 მასთან ხორციელი ძალაა, ჩვენთან კი უფალი, ჩვენი ღმერთი, რათა შეგვეწიოს და იბრძოლოს ჩვენს ბრძოლებში. გამხნევდა ხალხი იეხიზკიაჰუს, იუდას მეფის, სიტყვებზე. "},
	{9, "9 ამის შემდეგ სანხერიბმა, აშურის მეფემ, რომელიც მთელი თავისი ლაშქრითურთ ლაქიშის წინ იდგა, გაუგზავნა თავისი მორჩილნი იერუსალიმში იეხიზკიაჰუს, იუდას მეფეს, და მთელ იუდას, იერუსალიმში მყოფს, რომ ეთქვათ: "},
	{10, "10 ასე ამბობს სანხერიბი, აშურის მეფე: რისი იმედი გაქვთ, იერუსალიმის ციხე-სიმაგრეში რომ ჩამსხდარხართ? "},
	{11, "11 განა იეხიზკიაჰუ არ გაცთუნებთ, რომ შიმშილითა და წყურვილით ამოგხადოთ სული, როცა გეუბნებათ, უფალი, ჩვენი ღმერთი გვიხსნისო აშურის მეფის ხელიდან? "},
	{12, "12 განა მაგ იეხიზკიაჰუმ არ დაანგრია მისი გორაკები და სამსხვერპლოები? განა ასე არ უთხრა იუდასა და იერუსალიმს, ერთი სამსხვერპლოს წინაშე უნდა სცეთო თაყვანი და მასზე უნდა აკმიოთო საკმეველი? "},
	{13, "13 განა არ იცით რა დღე დავაწიეთ მე და ჩემმა მამა-პაპამ ქვეყნის ყველა ხალხს? განა შესძლეს ქვეყნის ხალხების ღმერთებმა ჩემი ხელიდან ეხსნათ მათი ქვეყნები? "},
	{14, "14 რომელი იყო ჩემი მამა-პაპის განადგურებულ ამ ხალხების ღმერთთაგან ისეთი, თავისი ხალხი რომ ეხსნა ჩემი ხელიდან, რომ ახლა თქვენმა ღმერთმა გიხსნათ ჩემი ხელიდან? "},
	{15, "15 ახლა არ მოგატყუოთ იეხიზკიაჰუმ და არ გაცთუნოთ ამგვარად. არ დაუჯეროთ მას. რაკი ვერცერთი ხალხის და სამეფოს ვერცერთმა ღმერთმა ვერ შესძლო თავისი ხალხის ხსნა ჩემი და ჩემი მამა-პაპის ხელიდან, ვერც თქვენი ღმერთი ვერ გიხსნით ჩემი ხელიდან. "},
	{16, "16 კიდევ ელაპარაკნენ მისი მორჩილნი უფლის, მათი ღმერთის, წინააღმდეგ და მისი მორჩილის, იეხიზკიაჰუს, წინააღმდეგ. "},
	{17, "17 უფლის, ისრაელის ღმერთის, სალანძღავ წერილებს წერდა იგი და ასეთ სიტყვებს ამბობდა მასზე: როგორც ქვეყნის ხალხების ღმერთებმა ვერ იხსნეს თავისი ხალხი ჩემი ხელიდან, ასევე ვერც იეხიზკიაჰუს ღმერთი ვერ იხსნის თავის ხალხს ჩემი ხელიდან. "},
	{18, "18 ხმამაღლა უყვიროდნენ ებრაულად იერუსალიმის ხალხს, გალავანზე მყოფს, რომ შეეშინებინათ და თავზარი დაეცათ, და აეღოთ ქალაქი. "},
	{19, "19 ისე ლაპარაკობდნენ იერუსალიმის ღმერთზე, როგორც ქვეყნის ხალხთა ღმერთებზე, ადამიანის ხელით შექმნილებზე. "},
	{20, "20 ილოცეს მეფე იეხიზკიაჰუმ და წინასწარმეტყველმა ესაიამ, ამოცის ძემ, ამის გამო და ცას შეჰღაღადეს. "},
	{21, "21 მოავლინა უფალმა ანგელოზი და ამოწყვიტა აშურის მეფის ბანაკში ყველა მაგარი ვაჟკაცი, წინამძღოლი და სარდალი. შერცხვენილი გაბრუნდა იგი თავის ქვეყანაში და, როცა თავისი ღმერთის სახლში შევიდა, მისი წიაღიდან გამოსულებმა მახვილით განგმირეს იქ. "},
	{22, "22 იხსნა უფალმა იეხიზკიაჰუ და იერუსალიმის მკვიდრნი აშურის მეფის, სანხერიბისა, და ყველას ხელიდან და დაიფარა ყოველი მხრივ. "},
	{23, "23 მრავალს მოჰქონდა იერუსალიმში ძღვენი უფლისათვის და რჩეული საჩუქრები იეხიზკიაჰუსთვის, იუდას მეფისთვის. მას აქეთ ამაღლდა იგი ყველა ხალხი თვალში. "},
	{24, "24 იმ დღეებში სასიკვდილოდ დასნეულდა იეხიზკიაჰუ და შეევედრა უფალს. ელაპარაკა უფალი და მისცა ნიშანი. "},
	{25, "25 არ მიაგო იეხიზკიაჰუმ სანაცვლო მისთვის გაწეულ სიკეთეს, რადგან გადიდგულდა. და იყო ღვთის რისხვა მასზე, იუდაზე და იერუსალიმზე. "},
	{26, "26 მოდრკა იეხიზკიაჰუ თავის დიდგულობაში და მასთან ერთად იერუსალიმის ყველა მკვიდრი, და აღარ დასტყდომიათ ღვთის რისხვა იეხიზკიაჰუს დღეებში. "},
	{27, "27 დიდზე დიდი დოვლათი და პატივი ჰქონდა იეხიზკიაჰუს. საგანძურები გაიჩინა ვერცხლისთვის, ოქროსთვის, ძვირფასი ქვებისთვის, ნელსაცხებლებისთვის, ფარებისთვის და ყოველი სასურველი ნივთისთვის, "},
	{28, "28 ბეღლები მიწის ნაყოფთათვის, პურისთვის, ღვინისთვის და ზეთისთვის, გომურები ყოველგვარი პირუტყვისთვის, და ფარეხები ცხვრის ფარისთვის. "},
	{29, "29 აიშენა თავისთვის ქალაქებიც. ცხვარ-ძროხის ჯოგები მრავლად ჰყავდა, რადგან ღმერთმა მას დიდძალი დოვლათი მისცა. "},
	{30, "30 მანვე, იეხიზკიაჰუმ, გადაკეტა გიხონის ზემო წყაროების სათავე და ქვემოთ ჩამოიყვანა, დავითის ქალაქის დასავლეთ მხარეზე. წარმატება ჰქონდა იეხიზკიაჰუს ყველა თავის საქმეში. "},
	{31, "31 მხოლოდ ბაბილონის მთავართა ელჩობის დროს, რომელიც გამოგზავნეს მასთან ქვეყანაში მომხდარი სასწაულის გამოსაძიებლად, მიუშვა იგი ღმერთმა, რომ გამოეცადა და სცოდნოდა ყოველი მისი გულისნადები. "},
	{32, "32 იეხიზკიაჰუს დანარჩენი საქმენი და მისი სიკეთენი წინასწარმეტყველ ესაიას, ამოცის ძის, ხილვაში და იუდასა და ისრაელის მეფეთა წიგნშია ჩაწერილი. "},
	{33, "33 განისვენა იეხიზკიაჰუმ თავის მამა-პაპასთან და დამარხეს იგი დავითიანთა სამარხების ზემოთ. პატივი მიაგეს მას სიკვდილის შემდეგ მთელმა იუდამ და იერუსალიმის მკვიდრებმა. მის ნაცვლად მისი ძე, მენაშე, გამეფდა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view33() {
struct ka33 poems[] = {
	{1, "1 თორმეტი წლისა იყო მენაშე, როცა გამეფდა და ორმოცდათხუთმეტი წელი იმეფა იერუსალიმში. "},
	{2, "2 უკუღმართად იქცეოდა უფლის თვალში იმ ხალხების სიბილწეთა კვალზე, რომელნიც აჰყარა უფალმა ისრაელიანთაგან. "},
	{3, "3 აღადგინა გორაკები, მამამისმა იეხიზკიაჰუმ რომ მოსპო, სამსხვერპლოები აღუმართა ბაალებს, გააკეთა აშერები, თაყვანს სცემდა ცის ვარსკვლავებს და მსახურებდა მათ. "},
	{4, "4 ააგო სამსხვერპლოები უფლის სახლში, რომელზეც უფალმა თქვა: იერუსალიმში საუკუნოდ იქნებაო ჩემი სახელი. "},
	{5, "5 აუგო სამსხვერპლოები ცის ვარსკვლავებს უფლის სახლის ორთავე ეზოში. "},
	{6, "6 ცეცხლში ატარებდა შვილებს ბენ-ჰინომის ველზე, მკითხაობდა, მისნობდა, ჩხიბავდა, დაადგინა მესულთანენი და ჯადოქარნი. ბევრ უკუღმართობას სჩადიოდა უფლის თვალში მის გასაჯავრებლად. "},
	{7, "7 დაამკვიდრა კერპი, ქანდაკი, რომელიც გააკეთა, ღვთის სახლში, რომელზეც ეუბნებოდა ღმერთი დავითს და მის ძეს, სოლომონს: ამ სახლში და იერუსალიმში, რომელიც ამოვირჩიე ისრაელის ყველა შტოდან, საუკუნოდ დავამკვიდრებ ჩემს სახელს. "},
	{8, "8 აღარ მოვაცვლევინებო ფეხს ისრაელს ამ მიწიდან, რომელიც მის მამა-პაპას დავუდგინე, ოღონდ შეასრულონ, რაც ვუბრძანე, თანახმად მთელი რჯულისა, წესებისა და მცნებებისა, მოსეს ხელით რომ მიეცათო. "},
	{9, "9 მაგრამ აცთუნა მენაშემ იუდა და იერუსალიმის მკვიდრნი და იმ ხალხზე უფრო უკუღმართად იქცეოდნენ, რომლებიც გადააშენა უფალმა ისრაელიანთა წინაშე. "},
	{10, "10 ელაპარაკა უფალი მენაშესა და მის ხალხს, მაგრამ არ შეისმინეს. "},
	{11, "11 მიუსია მას უფალმა აშურის მეფის მხედართმთავრები. შეიპყრეს მენაშე, დაატყვევეს, ბორკილები დაადეს და ბორკილდადებული ბაბილონს წაიყვანეს. "},
	{12, "12 შეევედრა თავის გასაჭირში უფალს, თავის ღმერთს, და მოდრკა ძლიერ თავისი მამა-პაპის წინაშე. "},
	{13, "13 ილოცა მის მიმართ და მანაც შეივედრა იგი, შეიწყნარა მისი ვედრება და იერუსალიმში, მის სამეფოში დააბრუნა. მიხვდა მენაშე, რომ ღმერთია უფალი. "},
	{14, "14 ამის შემდეგ გარე კედელი შემოუშენა დავითის ქალაქს გიხონის დასავლეთით, ხევისკენ, თევზთა კარიბჭის შესასვლელამდე, გარს შემოარტყა ყოფელს და ძალზე აამაღლა, და მხედართმთავრები ჩააყენა იუდას ყველა გამაგრებულ ქალაქში. "},
	{15, "15 მოაშორა უფლის სახლს უცხო ღმერთები და კერპი, ასევე ყველა სამსხვერპლო, უფლის სახლის მთაზე რომ ააგო იერუსალიმში, და ქალაქის გარეთ გადაყარა. "},
	{16, "16 განაახლა უფლის სამსხვერპლო, და შესწირა მასზე სამადლობელი და სადიდებელი მსხვერპლი. უბრძანა იუდას, ემსახურათ უფლისთვის, ისრაელის ღმერთისთვის. "},
	{17, "17 მაგრამ ხალხი მაინც გორაკებზე სწირავდა მსხვერპლს, ოღონდ მხოლოდ უფალს, თავის ღმერთს. "},
	{18, "18 მენაშეს დანარჩენი ამბები, მისი ლოცვა თავისი ღმერთის მიმართ, და იმ მხილველთა სიტყვები, რომელნიც მას უფლის, ისრაელის ღმერთის სახელით ლაპარაკებოდნენ, ისრაელის მეფეთა მატიანეშია ჩაწერილი. "},
	{19, "19 რომ ილოცა და შეწყნარებულ იქნა, რომ სცოდავდა და უკეთურებას სჩადიოდა, გორაკები რომ გამართა და აშერები და კერპები აღმართა, ყველაფერი, მის მოდრეკამდე, ხოზაის მატიანეშია ჩაწერილი. "},
	{20, "20 განისვენა მენაშემ თავის მამა-პაპასთან და დამარხეს თავის სახლში. მის ნაცვლად მისი ძე, ამონი, გამეფდა. "},
	{21, "21 ოცდაორი წლისა იყო ამონი, როცა გამეფდა, და ორი წელი იმეფა იერუსალიმში. "},
	{22, "22 უკუღმართად იქცეოდა უფლის თვალში, როგორც მამამისი მენაშე იქცეოდა. მამამისის, მენაშეს მიერ გაკეთებულ ყველა კერპს მსხვერპლს სწირავდა ამონი და მსახურებდა მათ. "},
	{23, "23 არ მომდრკალა უფლის წინაშე, როგორც მამამისი მენაშე მოდრკა, არამედ უფრო გაამრავლა ამონმა დანაშაული. "},
	{24, "24 შეითქვნენ მის წინააღმდეგ მისი მორჩილნი და თავის სახლში მოკლეს. "},
	{25, "25 ამოწყვიტა ქვეყნის ერმა მეფე ამონის წინააღმდეგ შეთქმულნი. ქვეყნის ერმა მის ნაცვლად მისი ძე იოშიაჰუ გაამეფა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view34() {
struct ka34 poems[] = {
	{1, "1 რვა წლისა იყო იოშიაჰუ, როცა გამეფდა და ოცდათერთმეტი წელი იმეფა იერუსალიმში. "},
	{2, "2 სწორად იქცეოდა უფლის თვალში და დავითის, მამამისის გზას მიჰყვებოდა, არც მარჯვნივ გადაუხვევია, არც მარცხნივ. "},
	{3, "3 თავისი მეფობის მერვე წელს, ჯერ კიდევ ყმაწვილი იყო, როცა დაუწყო ძიება დავითის, მამამისის ღმერთს. მეთორმეტე წელს კი შეუდგა იუდასა და იერუსალიმის გაწმედას გორაკებისაგან, აშერებისაგან, გამოქანდაკებული და ჩამოსხმული კერპებისგან. "},
	{4, "4 მის წინაში დაანგრიეს ბაალის სამსხვერპლოები. აჩეხა სამზეო სვეტები, მათ ზემოთ რომ იყო აღმართული, დალეწა აშერები და გამოქანდაკებული და ჩამოსხმული კერპები, მტვრად აქცია და იმათ სამარხებს გადააყარა, ვინც მსხვერპლს სწირავდნენ მათ. "},
	{5, "5 მათსავე სამსხვერპლოზე დაწვა მათი ქურუმების ძვლები და გაწმიდა იუდა და იერუსალიმი. "},
	{6, "6 მენაშეს, ეფრემის, სიმონის ქალაქებში ვიდრე ნაფთალიმდე, ირგვლივ მათ ნაოხარებში, "},
	{7, "7 დაანგრია სამსხვერპლოები და აშერები, მტვრად აქცია კერპები და აჩეხა მზის სვეტები მთელ ისრაელის ქვეყანაში და იერუსალიმს დაბრუნდა. "},
	{8, "8 თავისი მეფობის მეთორმეტე წელს, მას შემდეგ, რაც ქვეყანა და უფლის სახლი გაწმიდა, უფლის, თავისი ღმერთის სახლის შესაკეთებლად გაგზავნა შაფან აცალიაჰუს ძე, ქალაქის თავი მაყასიაჰუ და მწერალი იოახ იოახაზის ძე. "},
	{9, "9 მივიდნენ ხილკიაჰუ მღვდელმთავართან და მისცეს უფლის სახლში შეგროვილი ვერცხლი, რომელიც ლევიანებმა და ზღურბლის მცველებმა აკრიფეს მენაშეს, ეფრემის, სხვა ისრაელიანების, მთელი იუდას და ბენიამინის ხელიდან, და დაბრუნდნენ იერუსალიმს. "},
	{10, "10 ხელში ჩააბარეს სამუშაოთა შემსრულებლებს, რომელნიც უფლის სახლში იყვნენ განწესებულნი. ისინი აძლევდნენ მას სამუშაოთა შემსრულებლებს, რომელნიც უფლის სახლში მუშაობდნენ შეკეთებასა და გამაგრებაზე. "},
	{11, "11 ისინი კი ურიგებდნენ დურგლებს და მშენებლებს, რათა ეყიდათ გათლილი ქვები და ძელები კოჭებისთვის და სახლების გადასახურავად, იუდას მეფეებმა რომ დაანგრიეს. "},
	{12, "12 ხალხი პატიოსნად ასრულებდა სამუშაოს. თავზე ეყენათ: იახათი და ყობადიაჰუ - ლევიანები მერარიანთაგან, ზებადია და მეშულემი - კაჰათიანთაგან, და ლევიანები, ყველანი, ვინც საკრავების დაკვრაში იყო გაწაფული. "},
	{13, "13 მტვირთავებზეც იყვნენ დადგენილნი და თვალყურს ადევნებდნენ ყველა სამუშაოს შემსრულებელს და ყველა საქმეს. ლევიანთაგან იყვნენ: მწერლები, ზედამხედველები და კარისმცველები. "},
	{14, "14 როცა უფლის სახლში მიტანილი ვერცხლი გამოჰქონდათ, ხილკიაჰუ მღვდელმა მოსეს ხელით მოცემული უფლის რჯულის წიგნი იპოვა. "},
	{15, "15 უთხრა ხილკიაჰუმ შაფან მწერალს: რჯულის წიგნი ვიპოვე უფლის სახლში. და ჩააბარა ხილკიაჰუმ წიგნი შაფანს. "},
	{16, "16 შაფანმა მეფეს წაუღო წიგნი, თან ამბავი მიუტანა მეფეს და უთხრა: ყველაფერს აკეთებენ შენი მორჩილნი, რაც დავალებული აქვთ. "},
	{17, "17 გადმოყარეს ვერცხლი, რაც კი უფლის სახლში აღმოჩნდა, და ხელში ჩააბარეს ზედამხედველებსა და სამუშაოთა შემსრულებლებს. "},
	{18, "18 ამბავი მიუტანა შაფანმა მეფეს და უთხრა: წიგნი ჩამაბარა ხილკიაჰუ მღვდელმა და წაიკითხა შაფანმა მეფის წინაშე. "},
	{19, "19 როცა მეფემ მოისმინა რჯულის სიტყვები, შემოიხია სამოსელი. "},
	{20, "20 უბრძანა მეფემ ხილკიაჰუს, ახიკამ შაფანის ძეს, ყაბდონ მიქას ძეს, შაფან მწერალს, ყასაიას, მეფის მსახურს, და უთხრა: "},
	{21, "21 წადით და შეეკითხეთ უფალს ჩემზე, ისრაელში დარჩენილებზე და ნაპოვნი წიგნის სიტყვებზე, რადგან დიდია უფლის რისხვა, თავს რომ დაგვატყდა, რადგან არ დაიცვა ჩვენმა მამა-პაპამ უფლის სიტყვები, რომ მოქცეულიყვნენ ყოველივე იმის მიხედვით, რაც ამ წიგნში სწერია. "},
	{22, "22 წავიდნენ ხილკიაჰუ და, ვისაც მეფემ უბრძანა, ხულდა წინასწარმეტყველთან, ცოლთან შალუმისა, ძისა თოკჰათისა, ძისა ხასრასი, მესამოსლისა (იგი იერუსალიმის მეორე ნაწილში ცხოვრობდა) და ელაპარაკნენ ამის თაობაზე. "},
	{23, "23 უთხრა მათ: ასე ამბობს უფალი, ღმერთი ისრაელისა: უთხარით იმ კაცს, ვინც ჩემთან გამოგგზავნათ: "},
	{24, "24 ასე ამბობს-თქო უფალი: აჰა, უბედურებას დავატეხ ამ ადგილს, მის მკვიდრებს კი - იმ წყევლა-კრულვას, რაც ამ წიგნში სწერია, იუდას მეფის წინაშე რომ წაიკითხეს. "},
	{25, "25 რაკი მიმატოვეს და სხვა ღმერთებს უკმიეს საკმეველი ჩემს გასაჯავრებლად თავიანთი ხელის ნამოქმედარით, ამიტომ ჩემი რისხვა გადმოიღვრება ამ ადგილზე და აღარ დაცხრება. "},
	{26, "26 იუდას მეფეს კი, უფლის საძიებლად რომ გამოაგზავნათ, ასე უთხარით: ასე ამბობს-თქო უფალი, ღმერთი ისრაელისა, იმ სიტყვათა თაობაზე, შენ რომ მოისმინე: "},
	{27, "27 რაკი გული მოგილბა და თავი მოიდრიკე ღვთის წინაშე, რაც მისი სიტყვები მოისმინე ამ ადგილისა და მისი მკვიდრების თაობაზე, და მოდრკი ჩემს წინაშე, სამოსელი შემოიხიე და სტიროდი ჩემს წინაშე, მეც ამიტომ შეგიწყნარეო, ამბობს უფალი. "},
	{28, "28 აჰა, მოგასვენებ შენს მამა-პაპასთან, მშვიდობით შეერთვები შენს სამარხს და აღარ იხილავენ შენი თვალები ყველა იმ უბედურებას, რომელსაც ამ ადგილს და მის მკვიდრებს დავატეხ. მიუტანეს მეფეს სიტყვა. "},
	{29, "29 დაგზავნა მეფემ და შეკრიბა მთელი იუდას და იერუსალიმის უხუცესობა. "},
	{30, "30 ავიდა მეფე უფლის სახლში და მასთან მთელი იუდა და იერუსალიმის მკვიდრნი, მღვდლები, ლევიანები, და მთელი ერი დიდიდან პატარამდე. მათ გასაგონად წაიკითხა უფლის სახლში ნაპოვნი აღთქმის წიგნის ყოველი სიტყვა. "},
	{31, "31 დადგა მეფე თავის ადგილზე და აღთქმა დადო უფლის წინაშე, რომ გაჰყვებოდა უფალს, დაიცავდა მის მცნებებს, მოწმობებს და წესებს მთელი თავისი გულითა და სულით, ამ წიგნში ჩაწერილი აღთქმის სიტყვების შესასრულებლად. "},
	{32, "32 დაუდგინა იგი ყველას, ვინც იერუსალიმში და ბენიამინში იმყოფებოდნენ. და იქცეოდნენ იერუსალიმის მკვიდრნი ღმერთის, მათი მამა-პაპის ღმერთის აღთქმის თანახმად. "},
	{33, "33 განაგდო იოშიაჰუმ ყოველი სიბილწე ისრაელიანთა ყველა ქვეენიდან და უფალს, მათ ღმერთს, ამსახურა ყველა, ვინც კი ისრაელში იმყოფებოდა. დღენი მათნი აღარ განდგომიან უფალს, თავიანთი მამა-პაპის ღმერთს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view35() {
struct ka35 poems[] = {
	{1, "1 გადაუხადა იოშიაჰუმ პასექი უფალს იერუსალიმში. პირველი თვის მეთოთხმეტე დღეს ამსხვერპლეს პასექი. "},
	{2, "2 დააყენა მღვდლები თავ-თავიანთ საქმეზე და ამხნევებდა უფლის სახლის სამსახურისთვის. "},
	{3, "3 უთხრა ლევიანებს, რომელნიც მთელ ისრაელს მოძღვრავდნენ და საუფლოდ იყვნენ ნაკურთხნი: დადგით წმიდა კიდობანი იმ სახლში, სოლომონ დავითის ძემ, ისრაელის მეფემ, რომ ააშენა; რად გინდათ მისი მხრებით ტარება; ემსახურეთ ახლა უფალს, თქვენს ღმერთს და მის ერს, ისრაელს. "},
	{4, "4 მოემზადეთ თქვენ-თქვენი მამისსახლებისა და დასების მიხედვით, დავითის, ისრაელის მეფის განაწესის მიხედვით და მისი ძის, სოლომონის განაწესის მიხედვით. "},
	{5, "5 დადექით საწმიდარში თქვენი მოძმეების - ერის შვილების მამისსახლთა ჯგუფების მიხედვით და ლევიანთა მამისსახლების დასის მიხედვით. "},
	{6, "6 ამსხვერპლეთ პასექი, გაინათლეთ და მოუმზადეთ თქვენს ძმებს, რათა მოსეს ხელით მოცემული უფლის სიტყვის თანახმად მოიქცეთ. "},
	{7, "7 უბოძა იოშიაჰუმ ერის შვილებს და ყველას, ვინც კი იქ იმყოფებოდა კრავები და თიკნები, ყველაფერი საპასექო მსხვერპლისთვის - რიცხვით ოცდაათი ათასი, და კურატიც - სამი ათასი. ეს მეფის ქონებიდან იყო. "},
	{8, "8 მისმა მთავრებმა ნებაყოფლობით უბოძეს ხალხს, მღვდლებსა და ლევიანებს. ხილკიამ, ზაქარიამ და იეხიელმა - ღვთის სახლის წინამძღვრებმა მღვდლებს საპასექოდ მისცეს ორი ათას ექვსასი კრავი და სამასი კურატი. "},
	{9, "9 ქანანიამ, შემაყიამ, ნათანიელმა და მისმა ძმებმა, ხაშაბიამ, იეყიელმა და იოზაბადმა - ლევიანთა მთავრებმა ლევიანებს საპასექოდ უძღვნეს ხუთი ათასი კრავი და ხუთასი კურატი. "},
	{10, "10 ასე დაწესდა სამსახური. მღვდლები თავ-თავიანთ ადგილებზე დადგნენ და ლევიანები - თავიანთი დასების მიხედვით, მეფის ბრძანებისაებრ. "},
	{11, "11 ამსხვერპლეს პასექი. მღედლები ხელით ასხურებდნენ, ლევიანები კი ატყავებდნენ. "},
	{12, "12 და გამოაცალკევეს, რაც აღსავლენისთვის იყო, რომ გაენაწილებინათ ერის შვილების მამისსახლთა ჯუფების მიხედვით, რათა ისე შეეწირათ მსხვერპლი, როგორც მოსეს წიგნში სწერია. ასევე მოიქცნენ კურატების შეწირვისას. "},
	{13, "13 მოხარშეს პასექი ცეცხლზე წესის მიხედვით; ქვაბებში, კოჭობებში და კარდალებში მოხარშეს წმიდა საკლავი და მარჯვედ ჩამოურიგეს ყველა ერის შვილს. "},
	{14, "14 შემდეგ თავისთვის და მღვდლებისთვის მოამზადეს, რადგან მღვდლები, აარონიანები, მწუხრამდე სწირავდნენ აღსავლენს და ლურთებს. ამიტომაც მოამზადეს ლევიანებმა თავისთვის და მღვდლებისთვის - აარონიანთათვის."},
	{15, "15 მგალობელნი - ასაფიანები თავ-თავის ადგილზე იმყოფებოდნენ დავითის, ასაფის, ჰემანის და იედუთუნის, მეფის მისნისგან დადგენილი წესის მიხედვით, კარისმცველნიც - ყოველ კარში; არ უხდებოდათ თავიანთი სამსახურის მიტოვება, რადგან მათი მოძმე ლევიანები ამზადებდნენ მათთვის. "},
	{16, "16 ასე დაწესდა იმ დღეს უფლის ყველა სამსახური, რომ პასექი გადახდილიყო და აღსავლენი აღვლენილიყო უფლის სამსხვერპლოზე, მეფე იოშიაჰუს ბრძანების მიხედვით. "},
	{17, "17 შვიდი დღის განმავლობაში იხდიდნენ იმ დროს იქ მყოფი ისრაელიანები პასექს და უფუარობის დღესასწაულს. "},
	{18, "18 სამუელ წინასწარმეტყველის დღეების შემდეგ არ გადაეხადათ ისრაელში ასეთი პასექი. ისრაელის არცერთ მეფეს არ გადაუხდია ასეთი პასექი, იოშიაჰუმ, მღვდლებმა, ლევიანებმა, მთელმა იუდამ, იქ მყოფმა ისრელიანებმა და იერუსალიმის მკვიდრებმა რომ გადაუხადეს უფალს. "},
	{19, "19 იოშიაჰუს მეფობის მეთვრამეტე წელს იქნა გადახდილი ეს პასექი. (მუცლითმეზღაბრენი, მკითხავები, თერაფიმები, კერპები და აშერები, რაც კი იუდაში და იერუსალიმში იყო, ცეცხლს მისცა მეფე იოშიაჰუმ, რომ გაემტკიცებინა იმ წიგნში ჩაწერილი რჯულის სიტყვები, რომელიც ხილკიაჰუ მღვდელმა იპოვა უფლის სახლში. მანამდე არავინ ყოფილა მისი მსგავსი, რომ მთელი თავისი გულით და მთელი თავისი სულით, მთელი თავისი ძალით მოსეს რჯულის თანახმად მიქცეულიყო უფლისკენ; და არც მის შემდეგ გამოჩენილა მისი მსგავსი. მაგრამ მაინც არ დამცხრალა უფალი თავისი დიდი რისხვისაგან, რომლითაც მრისხანებდა უფალი იუდაზე ყველა იმ წყენის გამო, მენაშემ რომ აწყენინა. თქვა უფალმა: იუდასაც მოვიკვეთ ჩემგან, როგორც ისრაელი მოვიკვეთე; განვაგდებ ამ ქალაქსაც, რომელიც ამოვირჩიე, იერუსალიმს, და სახლს, რომელზეც ვთქვი, აქ იმკვიდრებს-მეთქი ჩემი სახელი). "},
	{20, "20 ყოველივე ამის შემდეგ, როგორც კი იოშიაჰუმ მოაწესრიგა უფლის სახლი, მიუხდა ნექო ეგვიპტის მეფე ქარხემიშს საბრძოლველად, მდინარე ევფრატზე. და გამოვიდა იოშიაჰუ მის შესახვედრად. "},
	{21, "21 მოციქულები გამოუგზავნა ნექომ და შეუთვალა: რა საქმე გვაქვს ერთმანეთთან მე და შენ, იუდას მეფევ? დღეს შენს წინააღმდეგ არ წავსულვარ, არამედ იმ სახლის წინააღმდეგ, რომელსაც ვეომები. ღმერთმა მიბრძანა, რომ ვიჩქარო. ჩამოეცალე ღმერთს, თან რომ მახლავს, რომ არ დაგღუპოს. "},
	{22, "22 პირი არ იბრუნა მისგან იოშიაჰუმ და შეიმოსა მის წინააღმდეგ საომრად, არ შეისმინა ნექოს სიტყვები ღმერთის შთაგონებული, და გავიდა მეგიდოს ველზე საბრძოლველად. "},
	{23, "23 სტყორცნეს მშვილდოსნებმა მეფე იოშიაჰუს. უთხრა მეფემ თავის მორჩილთ: გამიყვანეთ, რადგან მძიმედ დავიჭერი. "},
	{24, "24 ჩამოსვეს მისმა მორჩილებმა ეტლიდან, აიყვანეს მის მეორე ეტლზე, და იერუსალიმში წაიყვანეს. მოკვდა იგი და თავის მამა-ბაპის სამარხში დაიმარხა. მთელმა იუდამ და იერუსალიმმა დაიტირა იოშიაჰუ. "},
	{25, "25 გამართა გოდება იერემიამ იოშიაჰუზე. ყველა მგალობელ კაცი და ქალი დღემდე მოთქვამს იოშიაჰუზე თავის საგოდებლებში. წესად დაუდგინეს ისინი ისრაელს და, აჰა, საგოდებლებშია ჩაწერილი. "},
	{26, "26 იოშიაჰუს დანარჩენი საქმენი და მისი სიქველენი, უფლის რჯულში ჩაწერილის თანახმად აღსრულებულნი, "},
	{27, "27 მისი საქმენი - პირველნი და უკანასკნელნი - იუდასა და ისრაელის მეფეთა წიგნშია ჩაწერილი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view36() {
struct ka36 poems[] = {
	{1, "1 გამოიყვანა ქვეყნის ერმა იეჰოახაზი, იოშიაჰუს ძე [სცხეს მას], და მამამისის ნაცვლად გაამეფეს იერუსალიმში. "},
	{2, "2 ოცდასამი წლისა იყო იეჰოახაზი, როცა გამეფდა და სამი თვე იმეფა იერუსალიმში. [მისი დედა იყო ხამიტალი, იერემიას ასული, ლიბნადან. უკუღმართად იქცეოდა უფლის თვალში, როგორც მამა-პაპა იქცეოდა. ბორკილი დაადო მას ფარაონმა ნექომ დებლათში, ხამათის ქვეყანაში, რომ აღარ ემეფა იერუსალიმში]. "},
	{3, "3 გადააყენა იგი ეგვიპტის მეფემ იერუსალიმში [წაიყვანა მეფემ ეგვიპტეს] და დააკისრა ქვეყანას ასი ქანქარი ვერცხლი და ერთი ქანქარი ოქრო. "},
	{4, "4 ეგვიპტის მეფემ მის ნაცვლად მისი ძმა ელიაკიმი გაამეფა იუდაში და იერუსალიმში და იეჰოაკიმად შეუცვალა სახელი. მისი ძმა იეჰოახაზი კი შეიპყრო ნექომ და ეგვიპტეში წაიყვანა [და მოკვდა იქ. ვერცხლსა და ოქროს აძლევდნენ ფარაონ ნექოს. მაშინ დაიწყო ქვეყანამ ხარკის აკრეფა და ვერცხლის გაღება ფარაონის ბრძანებით, და თითოეული შეძლებისდაგვარად მოითხოვდა ვერცხლსა და ოქროს ქვეყნის ერისაგან ფარაონ ნექოსთვის მისაცემად]. "},
	{5, "5 ოცდახუთი წლისა იყო იეჰოიაკიმი, როცა გამეფდა, და თერთმეტი წელი იმეფა იერუსალიმში. უკუღმართად იქცეოდა უფლის, თავისი ღმერთის, თვალში. [მის დროს მიუხდა ნაბუქოდონოსორი, ბაბილონის მეფე, ქვეყანას და ემორჩილებოდა მას სამი წელი, და განუდგა. შეუსია უფალმა მათ ქალდეველები და სირიელი ყაჩაღები, მოაბელი ყაჩაღები და ყამონიანები, სამარიელები, და განდგნენ ამ სიტყვის თანახმად, უფლის სიტყვის თანახმად, მის მორჩილთა, წინასწარმეტყველთა პირით რომ იყო ნათქვამი. მაინც უფლის რისხვა იყო იუდაზე, რომ განეგდო იგი თავისი პირიდან მენაშეს ყველა ცოდვის გამო, რაც ჩაიდინა მან, და უბრალო სისხლის გამო, იეჰოიაკიმმა რომ დაღვარა და რომ აავსო იერუსალიმი უბრალო სისხლით, მაგრამ არ ინება უფალმა მათი ამოგდება]. "},
	{6, "6 მოუხდა მას ნაბუქოდონოსორი, ბაბილონის მეფე, და დაადო ბორკილები, რომ ბაბილონში წაეყვანა. "},
	{7, "7 წაიღო ნაბუქოდონოსორმა უფლის სახლის ჭურჭლეულის ნაწილი ბაბილონში და დააწყო თავის სასახლეში, ბაბილონში. "},
	{8, "8 იეჰოიაკიმის დანარჩენი საქმენი და სიბილწენი, რაც ჩაიდინა და რაც მის წინააღმდეგ აღმოჩნდა, ისრაელისა და იუდას მეფეთა წიგნშია ჩაწერილი. მის ნაცვლად მისი ძე იეჰოიაქინი გამეფდა. "},
	{9, "9 რვა წლისა იყო იეჰოიაქინი, როცა გამეფდა და სამი თვე და ათი დღე იმეფა იერუსალიმში. უკუღმართად იქცეოდა უფლის თვალში. "},
	{10, "10 წელიწადი რომ შემოიქცა, ხალხი გაგზავნა მეფე ნაბუქოდონოსორმა და ბაბილონს გადაიყვანა იგი უფლის სახლის ძვირფას ჭურჭელთან ერთად, ხოლო იუდაზე და იერუსალიმზე მისი ძმა ციდკიაჰუ გაამეფა. "},
	{11, "11 ოცდაერთი წლის იყო ციდკიაჰუ, როცა გამეფდა, და თერთმეტი წელი იმეფა იერუსალიმში. "},
	{12, "12 უკუღმართად იქცეოდა უფლის, თავისი ღმერთის თვალში. არ მოდრკა იგი იერემია წინასწარმეტყველის წინაშე, რომელიც უფლის სიტყვას ეუბნებოდა. "},
	{13, "13 განუდგა მეფე ნაბუქოდონოსორსაც, რომელმაც ღმერთზე დააფიცა. გაიფიცხა ქედი და გული არ მოილბო უფლისკენ, ისრაელის ღმერთისკენ მოსაქცევად."},
	{14, "14 ასევე მღვდლებისა და ხალხის ყველა წინამძღოლი მრავალს სცოდავდა წარმართთა ყველა სისაძაგლის კვალზე და ბილწავდნენ უფლის სახლს, რომელიც იერუსალიმში განწმიდა მან. "},
	{15, "15 უფალი, მათი მამა-პაპის ღმერთი ადრიდანვე უგზავნიდა და უგზავნიდა მათ სიტყვას თავის მოციქულთა ხელით, რადგან ებრალებოდა მას თავისი ერი და თავისი სამყოფელი. "},
	{16, "16 მაგრამ ისინი აბუჩად იგდებდნენ მოციქულებს, არად აგდებდნენ მის სიტყვებს და დასცინოდნენ მის წინასწარმეტყველებს, ვიდრე მის ერს უფლისაგან უსაშველო რისხვა არ დაატყდა. "},
	{17, "17 მოუვლინა მათ ქალდეველთა მეფე და მახვილით ამოხოცა მათი ჭაბუკები საწმიდარის სახლში, არ დაინდო არც ჭაბუკი და არც ქალწული, არც მოხუცი და არც თმაჭაღარა - ყველანი მის ხელში ჩაყარა. "},
	{18, "18 ღვთის სახლის ყველა ჭურჭელი - დიდი და მცირე, უფლის სახლის საგანძურები, მეფისა და მთავრების საგანძურებითურთ ერთიანად ბაბილონში გაზიდა. "},
	{19, "19 გადაწვეს ღვთის სახლი და დაანგრიეს იერუსალიმის კედელი, გადაბუგეს ყველა მისი სასახლე და გაანადგურეს ყველა მისი ძვირფასეულობა. "},
	{20, "20 მახვილს გადარჩენილნი ბაბილონში გადაასახლა; და იყვნენ მისი და მისი ვაჟების მორჩილნი სპარსეთის მეფობის დამყარებამდე, "},
	{21, "21 რათა აღსრულებულიყო უფლის სიტყვა, იერემიას პირით ნათქვამი: ვიდრე ქვეყანა თავისი შაბათებით გაიხარებდესო. მთელ უკაცრიელობის ხანაში შაბათობდა, ვიდრე სამოცდაათი წელი არ შესრულდა. "},
	{22, "22 კიროსის, სპარსეთის მეფის პირველ წელს, როცა იერემიას პირით ნათქვამი უფლის სიტყვა აღსრულდა, უფალმა აღძრა სპარსეთის მეფის, კიროსის სული და მან საქვეყნოდ გამოაცხადა მთელ თავის სამეფოში სიტყვიერად და წერილობით, რომ "},
	{23, "23 ასე ამბობს კიროსი, სპარსეთის მეფე: ქვეყნის ყველა სამეფო მე მიბოძა უფალმა, ცათა ღმერთმა, და დამავალა მისთვის სახლის აგება იერუსალიმში, იუდაში რომ არის. ვინც თქვენს შორის მისი ერიდან არის, უფალი, მისი ღმერთი, იყოს მასთან, და წავიდეს! "},
	{24, "1 უფალო ყოვლისმპყრობელო! ჩვენი მამა-პაპის - აბრაამის, ისაკის, იაკობის და მათი მართალი მოდგმის ღმერთო, "},
	{25, "2 შემოქმედო ცისა და მიწისა მთელი მათი მორთულობით, "},
	{26, "3 ზღვის მომთრგუნველო შენი განგების სიტყვით, უფსკრულის დამგმანელო და დამბეჭდავო შენი საშინელი და დიდებული სახელით, "},
	{27, "4 რომლისაც ყველას ეშინია და კანკალებენ შენი ძლიერების წინაშე, "},
	{28, "5 რადგან გაუსაძლისია შენი ბრწყინვალების სიდიადე და აუტანელია შენი რისხვა, ცოდვილებს რომ დაათევ თავზე. "},
	{29, "6 განუზომელია და გამოუკვლეველი შენი აღთქმის წყალობა, "},
	{30, "7 რადგან უზენაესი უფალი ხარ, შემბრალებელი, სულგრძელი და მრავალმოწყალე, კაცთა ცოდვების გამო მონანული. "},
	{31, "8 უფალო, ღმერთო მართალთა, არ დაგიწესებია სინანული მართალთათვის - აბრაამისთვის, ისაკისთვის და იაკობისთვის, რომელთაც არ შეუცოდავთ შენ წინაშე, მე ცოდვილს კი დამიწესე სინანული. "},
	{32, "9 რადგან ზღვის ქვიშაზე უმეტესია ჩემი ცოდვები. გამრავლდა ჩემი ურჯულოებანი, უფალო, გამრავლდა! არა ვარ ღირსი, ცის სიმაღლეს ვუმზერდე ჩემს უსამართლობათა სიმრავლის გამო! "},
	{33, "10 ჩაკეცილი ვარ რკინის ბორკილების სიმძიმით, ვერ ვიშორებ მათ ჩემი ცოდვების გამო, არა მაქვს მოსვენება, რადგან განგარისხე და უკუღმართად მოვიქეცი შენს თვალში, სიბილწე დავამკვიდრე და ვამრავლე შეურაცხებანი. "},
	{34, "11 ახლა კი მომიდრეკია ჩემი გულის მუხლნი და მოწყალებას გემუდარები. "},
	{35, "12 შევცოდე, უფალო, შევცოდე და ჩემი ურჯულოებანი მე თავად ვუწყი; "},
	{36, "13 და მაინც გევედრები, მომიტევე, უფალო, მომიტევე, ნუ დამღუპავ ჩემს ურჯულოებებში, სამარადისოდ ნუ განმირისხდები ჩემი ცოდვებისთვის! მიწის ქვესკნელს ნუ მომისჯი, რადგან მონანულთა ღმერთი ხარ, უფალო! "},
	{37, "14 მოავლინე ჩემზე სიკეთე შენი და მიხსენი მე, უღირსი, შენი უზომო მოწყალებით, "},
	{38, "15 და განგადიდებ დღენი ჩემნი, რადგან შენ გიგალობს ცის ყოველი ძალი და შენია დიდება უკუნისამდე, ამინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};