#include <map>
#include <string>
class Bible64
{
	struct ka1	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 პავლე, იესო ქრისტეს ტყვე, და ძმა ტიმოთე - ფილემონს, ჩვენს საყვარელ თანაშემწეს, "},
	{2, "2 აპფიას, საყვარელ დას, არქიპოსს, ჩვენს თანამოღვაწეს, და შენს შინაურ ეკლესიას: "},
	{3, "3 მადლი თქვენდა და მშვიდთბა ჩვენი მამა ღმერთისა და უფალ იესო ქრისტესაგან. "},
	{4, "4 ვმადლობ ღმერთს ჩემსას და გამუდმებით გიხსენებ ჩემს ლოცვებში, "},
	{5, "5 რადგანაც მესმის შენი სიყვარული და რწმენა, რომელიც გაქვს უფალ იესოსა და ყველა წმიდის მიმართ. "},
	{6, "6 რათა ზიარება შენი რწმენისა შეეწიოს ყოველივე კეთილის შემეცნებას, რაც არის ჩვენში ქრისტესათვის. "},
	{7, "7 ვინაიდან დიდი სიხარული და ნუგეში მოგვანიჭა შენმა სიყვარულმა, ძმაო, რადგანაც შენ გაამხნევე წმიდათა გული. "},
	{8, "8 ამიტომ, თუმცა დიდი სითამამე მაქვს ქრისტეში, გიბრძანო შენ, რაც გმართებს, "},
	{9, "9 მაგრამ სიყვარულით უფრო გთხოვ, სხვა კი არა, მე - მხცოვანი პავლე, ხოლო აწ ქრისტე იესოს ტყვეც. "},
	{10, "10 ჩემი შვილის ონისიმესათვის გთხოვ, რომელიც შემეძინა ტყვეობაში; "},
	{11, "11 ოდესღაც ურგები რომ იყო შენთვის, ხოლო აწ შენთვისაც სარგოა და ჩემთვისაც; "},
	{12, "12 გიგზავნი მას, ანუ ჩემს გულს. "},
	{13, "13 მინდოდა გვერდით მყოლოდა იგი, რათა შენს ნაცვლად ჩემთვის გაეწია სამსახური ამ ვირთებაში, რასაც ვიტან სახარების გამო. "},
	{14, "14 მაგრამ შენთან შეუთანხმებლად არაფრის ქმნა არ ვისურვე, რათა შენი სიკეთე იძულებითი კი არ ყოფილიყო, არამედ ნებსითი. "},
	{15, "15 ვინ იცის, იქნებ დროებით იმიტომ დაგშორდა, რომ სამუდამოდ მიგეღო იგი. "},
	{16, "16 მაგრამ უკვე არა როგორც მონა, არამედ მონაზე უმეტესი, საყვარელი ძმა, მეტადრე ჩემთვის და, მით უმეტეს, შენთვის, ხორციელადაც და უფლის მიერაც. "},
	{17, "17 ასე რომ, თუ თანაზიარად მიგაჩნივარ, ისე მიიღე, თითქოს მე ვიყო. "},
	{18, "18 ხოლო თუ რამე გაწყენინა, ან მართებს შენი, მე მომკითხე. "},
	{19, "19 მე, პავლემ, დავწერე ჩემი ხელით: მე გადავიხდი, რათა არ გითხრა, რომ ამაზე მეტიც გმართებს ჩემი: თვით შენი თავი. "},
	{20, "20 ჰო, ძმაო, შემეწიე უფალში, ახარე ჩემი გული უფალში. "},
	{21, "21 შენს მორჩილებაში დარწმუნებულმა მოგწერე ეს, რადგანაც ვიცი, რომ უფრო მეტსაც შემისრულებ, ვიდრე მე გთხოვ. "},
	{22, "22 ამასთანავე გამიმზადე ბინაც, რადგანაც იმედი მაქვს, რომ თქვენი ლოცვით მოგემადლებით. "},
	{23, "23 მოგიკითხავენ ეპიფრასი, ჩემი თანა-ტყვე ქრისტე იესოში; "},
	{24, "24 მარკოზი, არისტარქე, დემასი და ლუკა, ჩემი თანაშემწენი. "},
	{25, "25 მადლი ჩვენი უფლის იესო ქრისტესი თქვენს სულს. ამინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};