#include <map>
#include <string>
class Bible65
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
	struct ka6	{ int val; const char *msg; };
	struct ka7	{ int val; const char *msg; };
	struct ka8	{ int val; const char *msg; };
	struct ka9	{ int val; const char *msg; };
	struct ka10	{ int val; const char *msg; };
	struct ka11	{ int val; const char *msg; };
	struct ka12	{ int val; const char *msg; };
	struct ka13	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 ღმერთი, რომელიც მრავალგზის და მრავალგვარად ელაპარაკებოდა მამებს წინასწარმეტყველთა პირით, "},
	{2, "2 ამ უკანასკნელ დღეებში გველაპარაკა ჩვენ ძის მიერ, რომელიც დაადგინა ყოვლის მემკვიდრედ და რომლის მეშვეობითაც შექმნა საუკუნენი, "},
	{3, "3 რომელიც არის ბრწყინვალება დიდებისა და მისი არსების აღნაბეჭდი, თავისი ძალმოსილების სიტყვით ყოვლის მტვირთველი და, ცოდვებისგან ჩვენი განწმედის შემდეგ, ზესკნელს სიდიადის მარჯვნივ მჯდომელი, "},
	{4, "4 ანგელოზებზე იმდენადვე უზენაესი, რამდენადაც მათზე უდიადესი დაიმკვიდრა სახელი. "},
	{5, "5 ვინაიდან რომელი ანგელოზისთვის უთქვამს ოდესმე: „ძე ხარ შენ ჩემი, დღეს გშობე შენ“; ანდა: „მე ვიქნები მისი მამა, და ის იქნება ჩემი ძე“. "},
	{6, "6 ასევე, როცა კვლავ შემოჰყავს პირმშო ქვეყნად, ამბობს: „დე, თაყვანი სცეს მას ყველა ანგელოზმა ღვთისა“. "},
	{7, "7 ხოლო ანგელოზებზე ამბობს: „რომელიც ქმნის თავის ანგელოზებს სულებად და თავის მსახურთ - ალად ცეცხლისა“. "},
	{8, "8 ძეზე კი: „ტახტი შენი, ღმერთო, უკუნითი უკუნისამდე, და კვერთხი სიმართლისა - შენი სუფევის კვერთხი“. "},
	{9, "9 „შეიყვარე სიმართლე და მოიძულე ურჯულოება, ამიტომაც გცხო ღმერთმა, შენმა ღმერთმა სიხარულის ზეთი უფრო უხვად, ვიდრე შენს თანაზიართ“. "},
	{10, "10 და: „თავდაპირველად შენ დააფუძნე, უფალო, მიწა, და შენი ხელით შეიქმნენ ცანი. "},
	{11, "11 ისინი გარდავლენ, ხოლო შენ წარუვალი ხარ, და ყველაფერი დაძველდება, როგორც სამოსი. "},
	{12, "12 სამოსივით შეგრაგნი მათ და შეიცვლებიან, თავად კი უცვლელი ხარ, და არასდროს დასრულდება შენი წლები“. "},
	{13, "13 რომელი ანგელოზისთვის უთქვამს ოდესმე: „დაჯექი ჩემს მარჯვნივ, ვიდრე ფეხქვეშ დაგიმხობ მტრებს“? "},
	{14, "14 განა ყველანი მომსახურე სულები არ არიან, მათდა სამსახურად მოვლინებულნი, რომელთაც უნდა დაიმკვიდრონ საუკუნო სიცოცხლე? "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 ამიტომაც გვმართებს მეტი ყურადღება იმისადმი, რაც გვესმის, თუკი არ გვინდა, რომ გზას ავცდეთ. "},
	{2, "2 ვინაიდან თუ ანგელოზთა მეოხებით ნათქვამი სიტყვა ურყევი იყო და ყოველი შეცოდება თუ ურჩობა იღებდა კუთვნილ სასჯელს, "},
	{3, "3 ჩვენ როგორღა დავიხსნით თავს, უგულებელმყოფელნი ესოდენ დიადი ხსნისა, თავდაპირველად რომ გვიქადაგა უფალმა და მსმენელთა მეშვეობით დამკვიდრდა ჩვენში, "},
	{4, "4 ღვთის თანამოწმობით, სასწაულებით და ნიშებით, ნაირგვარი ძალითა და სული წმიდის ნიჭით, რაც განაწილებუღ იქნა მისი ნებისამებრ? "},
	{5, "5 რადგანაც ღმერთმა ანგელოზებს როდი დაუმორჩილა მომავალი ქვეყანა, რომელზედაც ვმსჯელობთ. "},
	{6, "6 არამედ ვიღაცის მოწმობით სადღაცა თქმულა: „რა არის კაცი, რომ გახსოვს იგი? ან ძე კაცისა, რომ მოიხილავ მას? "},
	{7, "7 ოდნავ თუ დაამცირე იგი ანგელოზთა წინაშე, დიდებითა და პატივით გვირგვინოსან ჰყავ "},
	{8, "8 და ყველაფერი ფეხქვეშ დაუმხე. და რაკი ყველაფერი დაუმორჩილე, დასამორჩილებელი აღარა დარჩა რა, მაგრამ აწ ვერ ვხედავთ, რომ ყველაფერი მას მორჩილებდეს; "},
	{9, "9 არამედ ვხედავთ, რომ იესო, რომელიც ოდნავ თუ დამცირდა ანგელოზთა წინაშე, დიდებითა და პატივით გვირგვინოსან იქმნა სიკვდილის გამო, რაც დაითმინა, რათა, ღვთის მადლით, ყველას გულისთვის ეხილა სიკვდილის გემო. "},
	{10, "10 და მართლაც, ასე შეჰფეროდა მას, ვისთვისაც და ვის მიერაც არის ყოველი, მრავალი ძე რომ მიეყვანა დიდებამდე, მათი ხსნის წინამძღვარი სრულეყო ტანჯვით. "},
	{11, "11 ვინაიდან განმწმენდიც და განწმენდილნიც ერთისგან არიან ყველანი, ამიტომაც არ რცხვენია, ძმები უწოდოს მათ, "},
	{12, "12 და ამბობს: „ვაუწყებ შენს სახელს ჩემს ძმებს, და შუა საკრებულოში გიგალობ შენ“. "},
	{13, "13 ან კიდევ: „მე ვიქნები მისი მოსავი“. ანდა: „აჰა, მე და შვილები, რომლებიც მომცა მამამ“. "},
	{14, "14 და რაკი შვილები სისხლისა და ხორცის მოზიარენი არიან, თავადაც ეზიარა მათ, რათა სიკვდილით განექარებინა ის, ვისაც აქვს ხელმწიფება სიკვდილისა, ანუ ეშმაკი, "},
	{15, "15 და დაეხსნა ისინი, ვისაც სიკვდილის შიშით მთელი სიცოცხლის მანძილზე მონობის უღელი ედგა. "},
	{16, "16 რადგანაც ანგელოზებს კი არ ევლინება მწედ, არამედ - აბრაამის მოდგმას. "},
	{17, "17 ამიტომ ყოველნაირად უნდა დამსგავსებოდა ძმებს, რათა მოწყალე და სარწმუნო მღვდელმთავარი ყოფილიყო ღვთის წინაშე, ხალხის ცოდვათა სალხინებლად. "},
	{18, "18 ვინაიდან, როგორც თვითონ ევნო და გამოიცადა, ასევე განსაცდეღში მყოფთა შეწევნაც ძალუძს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 ამიტომ, ძმანო წმიდანო, ზეციური ხმობის ზიარნო, დაუკვირდით მოციქულსა და ჩვენი აღსარების მღვდელმთავარს, ქრისტე იესოს, "},
	{2, "2 რომელიც ისეთივე ერთგულია თავისი შემოქმედისა, როგორც მოსე ღვთის სახლში. "},
	{3, "3 ვინაიდან მოსესთან შედარებით უფრო მეტი დიდების ღირსი შეიქნა, ისევე, როგორც სახლთან შედარებით მეტი პატივი აქვს მის ამშენებელს. "},
	{4, "4 რადგანაც ყველა სახლს ვიღაც აშენებს, ყოვლის ამშენებელი კი ღმერთია. "},
	{5, "5 მოსე ერთგული იყო მთელ მის სახლში, როგორც მსახური, რათა ემოწმებინა, რაც უნდა თქმულიყო, "},
	{6, "6 ქრისტე კი - როგორც ძე მის სახლში. ხოლო მისი სახლი ჩვენა ვართ, თუკი ბოლომდე მტკიცედ დავიცავთ სითამამესა და სასოების სიქადულს. "},
	{7, "7 ამიტომ, როგორც იტყვის სული წმიდა: „დღეს, როცა მოისმენთ მის ხმას, "},
	{8, "8 ნუ გაიქვავებთ თქვენს გულებს, როგორც დრტვინვის ჟამს, უდაბნოში გამოცდის დღეს, "},
	{9, "9 სადაც გამომცადეს თქვენმა მამებმა და ხედავდნენ ჩემს საქმეებს ორმოც წელიწადს. "},
	{10, "10 ამიტომაც მოვიძულე ეს მოდგმა და ვთქვი: მარადჟამ ცდებიან გულით, და ვერ შეიცნეს ჩემი გზა. "},
	{11, "11 ასე დავიფიცე ჩემი რისხვით, რომ არ ეღირსებათ ჩემს სიმშვიდეში შემოსვლა“. "},
	{12, "12 იფხიზლეთ, ძმანო, რომ არცერთ თქვენგანს არ ჰქონდეს უკეთური და ურწმუნო გული, რათა არ განუდგეს ცოცხალ ღმერთს. "},
	{13, "13 არამედ ყოველდღე შეაგონეთ ერთმანეთს, ვიდრე არ ითქმის „დღესო“, რათა არცერთი თქვენგანი არ გაქვავდეს ცოდვის საცდურით. "},
	{14, "14 რადგანაც ქრისტეს თანაზიარნი გავხდით, თუკი არსობის საწყისს ბოლომდე დავიცავთ მტკიცედ. "},
	{15, "15 ვიდრე არ ითქმის: „დღეს, როცა მოისმენთ მის ხმას, ნუ გაიქვავებთ თქვენს გულებს, როგორც დრტვინვისას“. "},
	{16, "16 ვინაიდან ზოგმა ისმინა და დრტვინვას მოჰყვა; მაგრამ ყველა კი არა, ვინც მოსეს მეოხებით გამოვიდა ეგვიპტიდან. "},
	{17, "17 მაშ, ვის გამო მრისხანებდა ორმოც წელიწადს, თუ არა შემცოდეთა გამო, რომელთა ძვლებიც უდაბნოში დაცვივდნენ? "},
	{18, "18 ან ვის მიმართ დაიფიცა, რომ ვერ ეღირსებოდნენ მის სიმშვიდეში შესვლას, თუ არა ურჩთა მიმართ? "},
	{19, "19 და ჩვენ ვხედავთ, რომ ურწმუნოების გამო მართლაც ვერ ეღირსნენ შესვლას. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 მაშ, გვეშინოდეს, რათა, ვიდრე რჩება აღთქმა მის სიმშვიდეში შესვლისა, რომელიმე თქვენგანი გარეთ არ დარჩეს. "},
	{2, "2 რადგანაც სახარება ჩვენც მათსავით გვეუწყა, მაგრამ სიტყვა, რომელიც ისმინეს, ურგები დარჩა მათთვის, ვინაიდან არ შეერწყა მსმენელთა რწმენას. "},
	{3, "3 სიმშვიდეში კი ჩვენ, მორწმუნენი შევალთ, როგორც მან ბრძანა: „ამიტომ დავიფიცე ჩემი რისხვისას, რომ ვერ შემოვლენ ჩემს სიმშვიდეში“. თუმცაღა მისი საქმენი დასრულდნენ ჯერ კიდევ ქვეყნიერების დასაბამიდან. "},
	{4, "4 ვინაიდან მეშვიდე დღეზე სადღაცა ასე თქმულა: „და დაისვენა ღმერთმა მეშვიდე დღეს მისი ყოველი საქმისგან“. "},
	{5, "5 და კიდევ: „ვერ შემოვლენ ჩემს სიმშვიდეში“. "},
	{6, "6 და რაკი ზოგს კვლავაც შეუძლია მასში შესვლა, ხოლო ისინი, ვისაც უწინ ეხარათ, ვერ შევიდნენ ურჩობის გამო, - "},
	{7, "7 კვლავინდებურად აწესებს გარკვეულ დღეს, და დავითის პირით ამბობს - „დღესო“, ესოდენ ხანგრძლივი დროის შემდეგ, როგორც ზემოთ ითქვა: „დღეს, როცა მოისმენთ მის ხმას, ნუ გაიქვავებთ თქვენს გულებს“. "},
	{8, "8 ვინაიდან იესო ნავეს ძეს რომ მიენიჭებინა მათთვის სიმშვიდე, ამის შემდეგ აღარას იტყოდა სხვა დღეზე. "},
	{9, "9 ამიტომ ღვთის ხალხს კვლავ რჩება შაბათობა. "},
	{10, "10 რადგან ვინც შევიდა მის სიმშვიდეში, ისევე დაისვენა თავის საქმეთაგან, როგორც ღმერთმა შესაქმის შემდეგ. "},
	{11, "11 მაშ, ვესწრაფოთ ამ სიმშვიდეში შესვლას, რათა, მათი მაგალითისამებრ, ურჩობაში არვინ ჩავარდეს. "},
	{12, "12 რადგანაც ღვთის სიტყვა ცოცხალია, ქმედითი და ყოველგვარ ორლესულ მახვილზე უფრო ბასრი, ასე რომ, თვით სამშვინველისა და სულის, სახსართა და ძვლის ტვინის გაყოფამდე აღწევს, და განიკითხავს გულის ზრახვებსა თუ აზრებს. "},
	{13, "13 არ არსებობს ქმნილება, დაფარული რომ იყოს მისთვის. არამედ ყველაფერი გაშიშვლებული და გაცხადებულია მის თვალთა წინაშე, ვისაც ვაბარებთ ანგარიშს."},
	{14, "14 და რაკი გვყავს დიდი მღვდელმთავარი, რომელმაც გამოვლო ცანი, იესო, ძე ღვთისა, მტკიცედ მივსდიოთ ჩვენს აღსარებას. "},
	{15, "15 რადგან ისეთი მღვდელმთავარი როდი გვყავს, რომ არ შეეძლოს თანაგვიგრძნოს ჩვენს უძლურებაში, არამედ - ჩვენსავით გამოცდილი ყველაფერში, გარდა ცოდვისა. "},
	{16, "16 მაშ, თამამად მივეახლთთ მადლის ტახტს, რათა მივიღოთ წყალობა და ვპოვოთ მადლი დროული შეწევნისათვის. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 რადგანაც ყოველი მღვდემლთავარი კაცთაგან არჩეულია და კაცთათვისვე დადგენილი ღვთისმსახურად, რათა სწირავდეს მსხვერპლსა და შესაწირავს ცოდვებისათვის. "},
	{2, "2 მას შეუძლია შეიწყნაროს უმეცარნი და შეცთომილნი, ვინაიდან თვითონაც გარშემორტყმულია უმწეობით. "},
	{3, "3 ამიტომაც მართებს როგორც ხალხისთვის, ისე თავისი თავისთვისაც სწირავდეს მსხვერპლს ცოდვათა მისატევებლად. "},
	{4, "4 თავისთავად ვერავინ მიიღებს ამ პატივს, არამედ მხოლოდ ის, ვინც ღვთის მიერაა ხმობილი, აარონის მსგავსად. "},
	{5, "5 ასე ქრისტემაც თვითონვე კი არ მიიკუთვნა მღვდელმთავრობის დიდება, არამედ მისი წყალობით, ვინც უთხრა მას: „ძე ხარ შენ ჩემი, დღეს გშობე შენ“. "},
	{6, "6 ხოლო სხვა ადგილას ამბობს: „შენა ხარ მღვდელი უკუნისამდე, წესისამებრ მელქისედეკისა“, "},
	{7, "7 რომელმაც მისი ხორციელად ყოფნის დღეებში ხმამაღალი ღაღადისითა და ცრემლების ფრქვევით შესწირა ლოცვა-ვედრება მას, ვისაც შეეძლო სიკვდილისაგან ეხსნა იგი, და შესმენილ იქნა მისი ღვთისმოშიშების გამო. "},
	{8, "8 და თუმცა ძე იყო, ტანჯვის გზით ისწავლა მორჩილება. "},
	{9, "9 ასე რომ, სრულქმნილი, მისდამი მორჩილთ საუკუნო ხსნის მიზეზად ექმნა. "},
	{10, "10 და იწოდა ღვთის მიერ მღვდელმთავრად, წესისამებრ მელქისედეკისა. "},
	{11, "11 ბევრი რამ შეგვეძლო გვეთქვა ამის თაობაზე, მაგრამ ძნელია განმარტება, ვინაიდან სმენის თავი აღარა გაქვთ. "},
	{12, "12 მართალია, დროის მიხედვით უკვე მოძღვრები უნდა ყოფილიყავით, მაგრამ თვითონვე გჭირდებათ მოძღვარი, რათა ისწავლოთ ღვთის სიტყვის პირველსაწყისნი; ასე რომ, კვლავაც რძე გჭირდებათ და არა უხეში საჭმელი. "},
	{13, "13 მაგრამ რძის ყოველი მსმელი გამოუცდელია სიმართლის სიტყვაში, რადგანაც ჯერ კიდევ ჩვილია. "},
	{14, "14 უხეში საჭმელი კი მოწიფულთათვისაა განკუთვნილი, რომელთა გრძნობებიც საკმაოდ გაწვრთნილია ჩვევით, რათა კეთილისა და ბოროტის გარჩევა შესძლონ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ka6 poems[] = {
	{1, "1 ამიტომ დავუტევოთ ქრისტეს სიტყვის საწყისნი. ვისწრაფოთ სრულყოფისაკენ და კვლავ ნუღარ ჩავუყრით საძირკველს მკვდარ საქმეთა მონანიებას და ღვთის რწმენას, "},
	{2, "2 ნათლისღების, ხელდასხმის, მკვდართა აღდგომისა და საუკუნო განკითხვის მოძღვრებას. "},
	{3, "3 ასეც მოვიქცევით, თუკი ინება ღმერთმა. "},
	{4, "4 რადგანაც შეუძლებელია, რომ ერთხელ უკვე განათლებულნი, რომელთაც იგემეს ციური ნიჭი და ეზიარნენ სულიწმიდას, "},
	{5, "5 შეიტკბეს ღვთის კეთილი სიტყვა და მომავალი საუკუნის ძალნი, "},
	{6, "6 მაგრამ მაინც დაეცნენ, - დიახ, შეუძლებელია, რომ ისინი კვლავ განახლდნენ სინანულისთვის, ვინაიდან კვლავინდებურად ჯვარს აცვამენ ძეს ღვთისას და ჰგმობენ. "},
	{7, "7 რადგანაც მიწა, მასზე ხშირ-ხშირად დადენილ წვიმას რომ ისრუტავს და მიწის მუშაკთათვის სარგო ნათესს აღმოაცენებს, ღვთისაგან იღებს კურთხევას. "},
	{8, "8 ხოლო ნარ-ეკლის აღმომაცენებელი ურგებია და ლამის დაწყევლილი, - რომლის ბოლოც იქნება დაწვა. "},
	{9, "9 თუმცა თქვენ, საყვარელნო, მიუხედავად ამ სიტყვებისა, გვწამს, რომ უკეთესნი ხართ და ხსნად მიწევნილნი. "},
	{10, "10 რადგანაც ღმერთი უსამართლო როდია, რომ დაივიწყოს თქვენი საქმე და შრომა სიყვარულისა, რაც გამოავლინეთ მისი სახელისათვის, ვინაიდან ემსახურებოდით და ახლაც ემსახურებით წმიდათ. "},
	{11, "11 მაგრამ გვსურს, რომ თვითეული თქვენგანი სასოების სავსებისთვისაც ბოლომდე იჩენდეს იმავე გულმოდგინებას. "},
	{12, "12 რათა მცონარებას არ მისცეთ თავი, არამედ ბაძავდეთ მათ, რწმენი თა და დიდსულოვნებით რომ იმკვიდრებენ აღთქმათ. "},
	{13, "13 რადგანაც ღმერთმა, როცა აბრაამს აძლევდა აღთქმას, რაკიღა თავზე უმეტესი არავინ ჰყავდა დასაფიცარი, თავისი თავი დაიფიცა, "},
	{14, "14 და უთხრა: „ჭეშმარიტად, კურთხევით გაკურთხებ შენ, და გამრავლებით გამრავლებ შენ“. "},
	{15, "15 და ასე, სულგრძელობით მიიღო აღთქმა. "},
	{16, "16 ხალხი უმეტესს იფიცავს და ფიცია მათი ყოველი ცილობის დასასრული. "},
	{17, "17 ამიტომ ღმერთმა, რომელსაც სურდა აღთქმის მემკვიდრეთათვის ეჩვენებინა თავისი ნების გარდუვალობა, შუამდგომლობისთვის მიმართა ფიცს. "},
	{18, "18 რათა ორი გარდუვალი საქმის მეშვეობით, რაშიაც შეუძლებელია ეცრუა ღმერთს, მტკიცე ნუგეში გვქონოდა ყველას, ვინც ვისწრაფეთ ჩავჭიდებოდით ჩვენს წინაშე დასახულ იმედს, "},
	{19, "19 რომელიც ჩვენი სულისათვის იგივეა, რაც მტკიცე და სანდო ღუზა, თვით ფარდის მიღმაც რომ აღწევს, "},
	{20, "20 სადაც ჩვენს წინამორბედად შევიდა იესო და, წესისამებრ მელქისედეკისა, მღვდელმთავარი გახდა უკუნისამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct ka7 poems[] = {
	{1, "1 რადგანაც მელქისედეკი, მეფე სალემისა, უზენაესი ღმერთის მღვდელი, შეეგება აბრაამს, მეფეთა შემუსვრის შემდეგ შემოქცეულს, და აკურთხა იგი. "},
	{2, "2 ხოლო აბრაამმა ყველაფრის მეათედი უწილადა მას, ვისი სახელიც, უწინარეს ყოვლისა, განიმარტება როგორც „სიმართლის მეფე“, შემდეგ კი - „მეფე სალემისა“, ანუ „მშვიდობის მეფე“. "},
	{3, "3 უდედმამო, უგვარტომო, რომელსაც არც დღეთა დასაბამი აქვს და არც სიცოცხლის დასასრული, არამედ, მსგავსად ღვთის ძისა, მღვდლად რჩება უკუნისამდე. "},
	{4, "4 მაშ, იხილეთ, რაოდენ დიდია ის, ვისაც მამამთავარმა აბრაამმა თავისი ნადავლის მეათედი უწილადა. "},
	{5, "5 ლევის ძეთა შორის მღვდლობის მიმღებთ მცნებადა აქვთ, მეათედს კრეფდნენ ხალხისგან, ანუ თავიანთი ძმებისაგან, თუმცა ესენიც აბრაამის წიაღიდან არიან გამოსულნი. "},
	{6, "6 იმან კი, ვინც არ არის მათი გვარისა, აბრაამისგან მიიღო მეათედი და აკურთხა აღთქმის მქონე. "},
	{7, "7 ხოლო, ყოველგვარი ცილობის გარეშე, უმცირესი იკურთხება უმეტესის მიერ. "},
	{8, "8 აქ მეათედს იღებენ მოკვდავი კაცნი, იქ კი - ვისაც აქვს მოწმობა, რომ ცოცხალია. "},
	{9, "9 და, ასე ვთქვათ, ლევიმაც, რომელიც იღებს მეათედს, აბრაამის მეშვეობით გასცა მეათედი. "},
	{10, "10 ვინაიდან ჯერ კიდევ მამის წიაღში იყო, როცა შეეგება მელქისედეკი. "},
	{11, "11 ამრიგად, სრულყოფა რომ ლევიტელთა მღვდელმსახურებით მიიღწეოდეს (ვინაიდან ხალხს მის მიერ მიეცა რჯული), რა საჭირო იქნებოდა მელქისედეკის წესისამებრ აღმდგარიყო სხვა მღვდელი, ნაცვლად იმისა, რომ აარონის წესით წოდებულიყო? "},
	{12, "12 ვინაიდან მღვდლობის შეცვლასთან ერთად უთუოდ უნდა შეიცვალოს რჯულიც. "},
	{13, "13 რადგან ვისზედაც ეს ითქვა, სხვა ტომს ეკუთვნოდა, საიდანაც არავინ მიახლებია საკურთხეველს. "},
	{14, "14 ვინაიდან ცნობილია, რომ უფალი ჩვენი ამობრწყინდა იუდას ტომიდან, რომლის მღვდლობაზეც სიტყვა არ დასცდენია მოსეს. "},
	{15, "15 და ეს მით უფრო ცხადია, რომ, მელქისედეკის მსგავსად, დგება სხვა მღვდელი, "},
	{16, "16 რომელიც ხორციელი აღთქმის რჯულისამებრ კი არ გახდა მღვდელი, არამედ წარუვალი სიცოცხლის ძალით. "},
	{17, "17 რადგანაც გვაქვს მოწმობა: „შენა ხარ მღვდელი უკუნისამდე, წესისამებრ მელქისედეკისა“. "},
	{18, "18 უწინდელი აღთქმა კი მისი უმწეობისა და უსარგებლობის გამო უქმდება, "},
	{19, "19 რადგანაც ვერარა სრულყო რჯულმა; მაგრამ შემოდის უმჯობესი სასოება, რომლის მეოხებითაც მივეახლებით ღმერთს. "},
	{20, "20 და რამდენადაც ეს არ მომხდარა ფიცის გარეშე, "},
	{21, "21 (ვინაიდან ისინი ფიცის გარეშე გახდნენ მღვდლები, ხოლო ეს - ფიცით მის მიერ, ვინც უთხრა: „დაიფიცა უფალმა და არ შეინანებს: შენა ხარ მღვდელი უკუნისამდე, წესისამებრ მელქისედეკისა)“, - "},
	{22, "22 იმდენადვე უმჯობესი აღთქმის თავმდები გახდა იესო. "},
	{23, "23 ეგეც არ იყოს, ვინ მოსთვლის, რამდენნი იყვნენ ის მღვდლები, რადგან სიკვდილი გამორიცხავდა ერთის მღვდლობას, "},
	{24, "24 ხოლო მას, როგორც მარადის მყოფს, მღვდლობაც წარუვალი აქვს. "},
	{25, "25 ამიტომაც ძალუძს სრულიად იხსნას ყველა, ვინც მისი მეოხებით მიეახლება ღმერთს, რადგანაც მარად ცოცხალია მათდა მეოხად. "},
	{26, "26 სწორედ ასეთი მღვდელმთავარი გვშვენოდა: წმინდა, უმანკო, უმწიკვლო, ცოდვილთაგან განრიდებული და ზეცათა უზენაესი, "},
	{27, "27 რომელსაც იმ მღვდელმთავრებივით როდი სჭირდება ჯერ თავის, ხოლო შემდეგ ხალხის ცოდვებისათვის ყოველდღე სწირავდეს მსხვერპლს, რადგან ეს ერთხელ და სამუდამოდ აღასრულა, როცა შესწირა თავი. "},
	{28, "28 ვინაიდან რჯული მღვდელმთავრებად ადგენს უმწეო ხალხს, ხოლო ფიცის სიტყვა, რჯულის შემდგომ, - ძეს, უკუნისამდე სრულქმნილს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct ka8 poems[] = {
	{1, "1 ხოლო ჩვენს ნათქვამში უმთავრესი ეს არის: გვყავს მღვდელმთავარი, დიდების ტახტის მარჯვნივ რომ დაჯდა ზეცას. "},
	{2, "2 ის არის მსახური წმიდათა და ჭეშმარიტი კარვისა, რომელიც უფალმა ააშენა და არა კაცმა. "},
	{3, "3 რადგანაც ყველა მღვდელმთავარი მსხვერპლისა და შესაწირავის მისართმევადაა დადგენილი; ამიტომ აუცილებელია, რომ მასაც რაიმე ჰქონდეს მისართმევი. "},
	{4, "4 მიწაზე რომ დარჩენილიყო, მღვდელიც აღარ იქნებოდა, რადგანაც აქ არიან მღვდღები, რჯულისამებრ რომ სწირავენ შესაწირავს, "},
	{5, "5 და მსახურებენ ზეციერის ხატსა და ჩრდილს, როგორც ებრძანა მოსეს კარვის დასრულებისას: „იცოდე, - იყო თქმული, - ყველაფერი გააკეთე იმ ნიმუშის მსგავსად, მთაზე რომ გიჩვენე შენ“. "},
	{6, "6 ხოლო აწ ჩვენმა მღვდელმთავარმა მით უკეთესი მსახურება მიიღო, რამდენადაც შუამავალია უკეთესი აღთქმის, რომელიც უკეთეს დაპირებებზეა დაფუძნებული. "},
	{7, "7 რადგანაც პირველი აღთქმა რომ უნაკლო ყოფილიყო, ვინღა დაუწყებდა ძებნას მეორის ადგილს? "},
	{8, "8 ვინაიდან ყვედრებით ეუბნება მათ: „აჰა, მოვლენ დღენი, - ამბობს უფალი, - როცა ახალ აღთქმას დავუდებ ისრაელის სახლს და იუდას სახლს. "},
	{9, "9 იმნაირ აღთქმას კი არა, მათ მამებს რომ დავუდე იმ დღეს, როცა ხელი ჩავკიდე მათ ეგვიპტის ქვეყნიდან გამოსაყვანად; მაგრამ რაკი ჩემს აღთქმაში არ დამკვიდრდნენ, მეც უგულებელვყავ ისინი, ამბობს უფალი. "},
	{10, "10 აი, ეს იქნება აღთქმა, იმ დღეთა შემდგომ რომ აღვუთქვამ ისრაელის სახლს, ამბობს უფალი: ჩავდებ ჩემს რჯულს მათ გონებაში, და მათ გულებზე დავაწერ მას; და ვიქნები მათი ღმერთი, ხოლო ისინი იქნებიან ჩემი ხალხი. "},
	{11, "11 აღარავინ ასწავლის თვისტომს და აღარ ეტყვის თავის ძმას: იცან უფალი, რადგანაც ყოველი მათგანისთვის, დიდიან-პატარიანად, ცნობილი ვიქნები. "},
	{12, "12 ვინაიდან შევიწყალებ მათ უსამართლობას და აღარ გავიხსენებ მათ ცოდვებს. "},
	{13, "13 ხოლო „ახალიო“ რომ თქვა, ამით პირველის სიძველე გვიჩვენა, მაგრამ რაც ძველდება და ბერდება, გასაქრობად განწირულია. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct ka9 poems[] = {
	{1, "1 თუმცა პირველ აღთქმასაც ჰქონდა მართლგანაწესი მსახურებისა და ამქვეყნიური საწმიდარი, "},
	{2, "2 რადგანაც პირველი კარავი ისე იქნა გამზადებული, რომ შიგ იყო სასანთლე, ტაბლა და საწირავი პური; ხოლო სახელი მისი იყო „წმინდა“. "},
	{3, "3 მეორე ფარდის მიღმა კი იყო კარავი, რომელსაც ერქვა „წმიდათაწმიდა“. "},
	{4, "4 და ჰქონდა მას ოქროს სასაკმევლე, მთლიანად ოქროთი მოჭედილი კიდობანი აღთქმისა, რომელშიც იდგა მანანით სავსე ოქროს ჭურჭელი, აარონის კვერთხი, რომელიც განედლდა, და აღთქმის ფიცარნი. "},
	{5, "5 ხოლო მათ ზემოთ - ქერუბიმნი დიდებისა, სალხინებლის საჩრდილობლად, თუმცა აქ დაწვრილებით ვერ ვილაპარაკებთ მათზე. "},
	{6, "6 ამნაირად გამართულ პირველ კარავში ყოველთვის შედიან მღვდლები ღვთისმსახურების აღსასრულებლად. "},
	{7, "7 მეორეში კი წელიწადში ერთხელ შედის მღვდელმთავარი, მაგრამ არა სისხლის გარეშე, რომელსაც სწირავს თავისი თავისა და ხალხის ცთომილებათა გამო. "},
	{8, "8 ამით სული წმიდა გვიჩვენებს, რომ ჯერ კიდევ არ გახსნილა საწმიდრის გზა, ვიდრე დგას პირველი კარავი. "},
	{9, "9 ესაა ნიმუში აწმყო დროისა, როცა სწირავენ მსხვერპლსა და შესაწირავს, რასაც არ ძალუძს სრულყოს შემწირველის სინიდისი. "},
	{10, "10 რადგანაც ესაა მხოლოდ სასმელ-საჭმელი, სხვადასხვაგვარი განბანა და ხორციელ წესთა აღსრულება, გამოსწორების დრომდე დადგენილი. "},
	{11, "11 ხოლო ქრისტე, მომავალ სიკეთეთა მღვდელმთავარი, მოვიდა უფრო ვრცელი, უფრო სრულყოფილი და ხელთუქმნელი, ესე იგი, არა იმნაირად შექმნილი კარვით. "},
	{12, "12 კაცთა და ზვარაკთა სისხლით კი არა, საკუთარი სისხლით ერთხელ შევიდა საწმიდარში და მოგვიპოვა საუკუნო გამოხსნა. "},
	{13, "13 ვინაიდან თუ ვაცთა და ზვარაკთა სისხლი, ან დეკეულის ფერფლი, პკურებით გაწმენდს შებილწულთ, რათა წმიდა იყოს ხორცი, "},
	{14, "14 განა სისხლი ქრისტესი, რომელმაც მარადიული სულით უბიწო მსხვერპლად შესწირა თავი ღმერთს, ათასწილ უფრო მეტად არ განწმედს თქვენს სინიდისს მკვდარ საქმეთაგან, ცოცხალი ღმრთის სამსახურისთვის? "},
	{15, "15 ამიტომაც არის ახალი აღთქმის შუამდგომელი, რათა სიკვდილით, რომლითაც აღესრულა, გამოესყიდა პირველი აღთქმისას ჩადენილი დანაშაულნი და, ამრიგად, საუკუნო მემკვიდრეობისთვის ხმობილთ მიეღოთ აღთქმული. "},
	{16, "16 ვინაიდან სადაც არის ანდერძი, იქ აუცილებელია მეანდერძის სიკვდილი. "},
	{17, "17 რადგანაც ანდერძს ძალა აქვს მხოლოდ სიკვდილის შემდეგ, და არა მანამ, სანამ ცოცხალია მეანდერძე. "},
	{18, "18 ამიტომ არც პირველი აღთქმა დამტკიცებულა სისხლის გარეშე. "},
	{19, "19 რადგანაც მოსემ, ყველა მცნება რჯულისამებრ რომ წარმოსთქვა ხალხის წინაშე, აიღო ზვარაკთა და ვაცთა სისხლი, წყალთან, მეწამულ მატყლსა და უსუპთან ერთად, და ასხურა როგორც წიგნს, ისე მთელ ხალხსაც, "},
	{20, "20 და თქვა: „ესაა სისხლი აღთქმისა, ღმერთმა რომ გამცნოთ თქვენ“. "},
	{21, "21 თვით კარავსა და საღვთისმსახურო ჭურჭელსაც ასხურა სისხლი. "},
	{22, "22 ასე რომ, რჯულის მიხედვით, თითქმის ყველაფერი სისხლით განიწმიდება, და სისხლის დათხევის გარეშე არ არსებობს მიტევება. "},
	{23, "23 ამრიგად, ზეციერთა ხატებანი ამით უნდა იწმიდებოდნენ, ხოლო თვით ზეციერნი - ამაზე უკეთესი მსხვერპლით. "},
	{24, "24 რადგანაც ქრისტე ხელთქმნილ საწმიდარში, ანუ ჭეშმარიტის ხატებაში კი არ შევიდა, არამედ თვით ცაში, რათა აწ ჩვენთვის წარუდგეს ღმერთს, "},
	{25, "25 იმიტომ კი არა, რომ მრავალგზის შეეწიროს, როგორც მღვდელმთავარი ყოველწლიურად სხვისი სისხლით შედის საწმიდარში, "},
	{26, "26 თორემ მაშინ მრავალგზის ევნებოდა ქვეყნის დასაბამიდან, ხოლო აწ ერთხელ, საუკუნეთა დასასრულს, გამოჩნდა, რათა თავისი მსხვერპლით გაექარწყლებინა ცოდვა. "},
	{27, "27 და როგორც ადმიანებს ერთხელ უწერიათ სიკვდილი, მერე კი განკითხვა, "},
	{28, "28 ასევე ქრისტეც, ერთხელ რომ შესწირა თავი, რათა წარეხოცა მრავალთა ცოდვა, - მეორედ გამოჩნდება არა ცოდვათაგან განსაწმედად, არამედ მის მომლოდინეთა სახსნელად. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct ka10 poems[] = {
	{1, "1 რადგანაც რჯული, მომავალ სიკეთეთა მხოლოდ ჩრდილის და არა თვით ნამდვილ საგანთა მქონე, ერთი და იმავე მსხვერპლით, გამუდმებით რომ სწირავენ ყოველწლიურად, ვერასოდეს ვერ შესძლებს სრულყოს მასთან მიმსვლელნი. "},
	{2, "2 ასე რომ არა, ვინღა შესწირავდა მსხვერპლს, რადგანაც ერთხელ განწმედილთ წარმოდგენაც აღარ ექნებოდათ, რა არის ცოდვა."},
	{3, "3 მაგრამ მსხვერპლშეწირვა ყოველწლიურად იწვევს ცოდვათა გახსენებას. "},
	{4, "4 რადგანაც შეუძლებელია ცოდვათა წარხოცა კაცთა და ხართა სისხლით. "},
	{5, "5 ამიტომ ქვეყნად შემოსვლისას ქრისტე ამბობს: „მსხვერპლი და შესაწირავი შენ არ ისურვე, მაგრამ სხეული კი განმიმზადე მე. "},
	{6, "6 სრულდასაწველრ და ცოდვის გამოსასყიდი ძღვენი არ ინებე. "},
	{7, "7 მაშინ მე ვთქვი: აჰა, მოვდივარ (როგორც წიგნის დასაწყისში წერია ჩემზე), რათა აღვასრუღთ შენი ნება, ღმერთო“. "},
	{8, "8 ზემოთ რომ ამბობს: მსხვერპლი და შესაწირავი, სრულდასაწველი და ცოდვის გამოსასყიდი ძღვენი არ ისურვე და ინებეო, "},
	{9, "9 შემდეგ დასძენს: აჰა, მოვდივარ, რათა აღვასრულო შენი ნება, ღმერთო, რითაც აუქმებს პირველს, რათა მეორე დაადგინოს. "},
	{10, "10 სწორედ ამ ნებით ვართ განწმედილნი, იესო ქრისტეს სხეულის ერთგზის შეწირვით. "},
	{11, "11 რამდენი მღვდელი ყოველდღე დგას მსახურებად და რამდენგზის სწირავს ერთსა და იმავე მსხვერპლს, რომელიც ვერასოდეს წარხოცავს ცოდვას. "},
	{12, "12 მან კი ერთადერთი მსხვერპლი შესწირა ცოდვებისათვის და სამუდამოდ დაჯდა ღვთის მარჯვნივ."},
	{13, "13 მას შემდეგ ელის, როდის დაემხობიან მისი მტრები მის ფეხქვეშ. "},
	{14, "14 რადგანაც ერთი შეწირვით სამარადისოდ სრულყო განწმედილნი. "},
	{15, "15 ამასვე გვიმოწმებს სული წმიდაც, რადგანაც ნათქვამია: "},
	{16, "16 „ეს არის აღთქმა, რომელსაც აღვუთქვამ მათ იმ დღეთა შემდეგ, - ამბობს უფალი, - ჩავდებ ჩემს რჯულს მათ გულებში და მათ გონებაში ჩავწერ. "},
	{17, "17 აღარ გავიხსენებ მათ ცოდვებს და ურჯულოებას“. "},
	{18, "18 ხოლო იქ, სადაც ცოდვათა მიტევებაა, შესაწირავი ზედმეტი ხდება. "},
	{19, "19 ამრიგად, ძმანო, რაკი გვაქვს სითამამე საწმიდარში შესვლისა იესოს სისხლის მეოხებით, "},
	{20, "20 ახალი და ცოცხალი გზით, რომელიც გაგვიხსნა მან ფარდით, ესე იგი თავისი ხორცით, "},
	{21, "21 და გვყავს მღვდელმთავარი ღვთის სახლში, "},
	{22, "22 მივეახლოთ მას წრფელი გულითა და რწმენის სისრულით, უკეთური სინიდისისაგან სხურებით გულგაწმენდილნი და სუფთა წყლით ტანგაბანილნი, "},
	{23, "23 მტკიცედ მივსდიოთ აღსარებას სასოებისას, რადგან სარწმუნოა აღმთქმელი. "},
	{24, "24 ყურადღებას ნუ მოვაკლებთ ერთიმეორეს, რათა სიყვარულისა და კეთილ საქმეთათვის წავაქეზოთ ერთმანეთი. "},
	{25, "25 ნუ მივატოვებთ ჩვენს შესაკრებელს, როგორც ზოგიერთებს სჩვევიათ, არამედ შევაგონოთ ერთმანეთს, და მით უფრო მეტად, რაც უფრო აშკარად გრძნობთ იმ დღის მოახლოებას. "},
	{26, "26 რადგან თუ მას შემდეგ, რაც შევიცნეთ ჭეშმარიტება, კვლავ ჩვენი ნებით ვცოდავთ, უკვე აღარა რჩება მსხვერპლი ცოდვათათვის. "},
	{27, "27 არამედ რაღაც საზარელი მოლოდინი მსჯავრისა და მტერთა შთასანთქმელად მოგიზგიზე შურის ცეცხლი. "},
	{28, "28 თუკი მოსეს რჯულის უარმყოფელს, ორი თუ სამი კაცის მოწმობით, უწყალოდ უსჯიან სიკვდილს, "},
	{29, "29 როგორ გგონიათ, რამდენად უფრო მძიმე იქნება მისი სასჯელი, ვინც ფეხქვეშ თელავს ძეს ღვთისას, უღირსად მიიჩნევს აღთქმის სისხლს, რომლითაც განიწმიდა, და აგინებს მადლის სულს? "},
	{30, "30 რადგანაც ვიცნობთ ამის მთქმელს: „ჩემია შურისგება და მე მივაგებ“. ან კიდევ: „უფალი განიკითხავს თავის ხალხს“. "},
	{31, "31 მტერი ჩავარდა ცოცხალი ღმრთის ხელში!"},
	{32, "32 გაიხსენეთ უწინდელი დღენი, როცა განათლდით და დაითმინეთ ვნებათა დიადი ღვაწლი; "},
	{33, "33 როცა თქვენივე ურვითა და უბედურებით ან სხვების სასეიროდ იყავით ქცეულნი, ანდა სხვებს თანაუგრძნობდით, თქვენსავე დღეში ჩაცვენილთ. "},
	{34, "34 ვინაიდან ჩემს ტყვეობასაც თანაუგრძნეთ და თქვენი ქონების დატაცებასაც სიხარულით შეხვდით, რადგანაც იცოდით, რომ უკეთესი და წარუვალი საუნჯე გაქვთ ცაში. "},
	{35, "35 მაშ, ნუ გიღალატებთ მხნეობა, რომელსაც დიადი საზღაური ელის. "},
	{36, "36 მოთმინება გმართებთ, რათა აღასრულოთ ღვთის ნება და მიიღოთ აღთქმული. "},
	{37, "37 ვინაიდან ცოტაც, სულ ცოტაც, და არ დააყოვნებს, მოვა მომავალი. "},
	{38, "38 მართალი რწმენით იცოცხლებს, ხოლო თუ უკუიქცევა, არ შეიწყალებს მას ჩემი სული. "},
	{39, "39 მაგრამ ჩვენ უკუქცეულნი როდი ვართ წარსაწყმედად, არამედ მტკიცედ მორწმუნენი სულის სახსნელად. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct ka11 poems[] = {
	{1, "1 ხოლო რწმენა არის უეჭველობა იმისა, რასაც მოველით, და წვდომა უხილავისა. "},
	{2, "2 რადგანაც რწმენით მიეცა მოწმობა უხუცესთ. "},
	{3, "3 რწმენით შევიცნობთ, რომ ღვთის სიტყვით შეიქმნენ საუკუნენი, და რომ ხილული უხილავისაგან იღებს დასაბამს. "},
	{4, "4 რწმენით შესწირა აბელმა ღმერთს უკეთესი მსხვერპლი, ვიდრე კაენმა; რწმენით მიიღო მოწმობა, რომ მართალი იყო, როგორც უმოწმა ღმერთმა მის მსხვერპლს; და სიკვდილის შემდეგაც კვლავ რწმენით მეტყველებს. "},
	{5, "5 რწმენით გარდაიცვალა ენოქი, ისე, რომ არ უხილავს სიკვდილი, და ვეღარავინ დალანდა, რადგანაც ღმერთმა წაიყვანა იგი; ვინაიდან სიკვდილამდე მიიღო მოწმობა, რომ ესათნოვა ღმერთს. "},
	{6, "6 რწმენის გარეშე კი შეუძლებელია ესათნოვო ღმერთს, რადგან ვინც მას უახლოვდება, უნდა სწამდეს, რომ ღმერთი არსებობს და სანაცვლოს მიაგებს მის მაძიებელთ. "},
	{7, "7 რწმენით მიიღო ნოემ ჩვენება იმისა, რაც ჯერ კიდევ უხილავი იყო, და ღვთისმოშიშებით ააგო კიდობანი თავისი სახლის სახსნელად; რწმენით განიკითხა ქვეყანა და რწმენითვე გახდა სიმართლის მემკვიდრე. "},
	{8, "8 რწმენით დაემორჩილა აბრაამი ხმობას, წასულიყო იმ ქვეყანაში, რომელიც სამკვიდროდ უნდა მიეღო, და წავიდა კიდეც, თუმცაღა არ იცოდა, სად მიდითდა. "},
	{9, "9 რწმენით შეეხიზნა აღთქმულ ქვეყანას, ისე, ვით უცხოს, და მკვიდრობდა კარვებში ისააკსა და იაკობთან, იმავე აღთქმის თანამემკვიდრეებთან ერთად. "},
	{10, "10 ვინაიდან ელოდა ქალაქს, რომელიც მტკიცე საძირკველზე დგას და რომლის ხუროთმოძღვარი და მშენებელიც არის ღმერთი. "},
	{11, "11 რწმენითვე იყო, რომ უნაყოფო სარამაც მიიღო ჩასახვის ძალა და ხანგადასულმა შვა, რადგანაც სარწმუნოდ შერაცხა აღმთქმელი. "},
	{12, "12 ამიტომ ერთისგან, და ისიც ლამის მკვდრისაგან, იშვნენ მრავალნი, როგორც მრავალი ვარსკვლავი ცაზე და ურიცხვი ქვიშა ზღვის პირას. "},
	{13, "13 რწმენაში აღესრულნენ ყველა ისინი და ვერ მიიღეს აღთქმული, არამედ შორიდან ხედავდნენ, შორითვე მოიკითხავდნენ მას და აღიარებდნენ, რომ უცხონი და ხიზნები არიან ამ ქვეყნად. "},
	{14, "14 რადგანაც ასე მეტყველნი ცხადყოფენ, რომ სამშობლოს ეძებენ. "},
	{15, "15 ის სამშობლო რომ ხსომებოდათ, საიდანაც გამოვიდნენ, მოასწრებდნენ იქ მიბრუნებას. "},
	{16, "16 მაგრამ ისინი უკეთესი, ესე იგი, ზეციური სამშობლოსაკენ ილტვოდნენ. ამიტომ ღმერთსაც არ რცხვენია მათ ღმერთად იწოდებოდეს, რადგანაც თვითონ განუმზადა ქალაქი მათ. "},
	{17, "17 რწმენით შესწირა აბრაამმა, გამოცდის ჟამს, ისააკი; აღთქმა რომ ჰქონდა მიღებუღი, მიტომაც შესწირა მხოლოდშობილი, "},
	{18, "18 რომელზედაც ითქვა: „ისააკის მიერ იწოდება შენი მოდგმა“. "},
	{19, "19 რადგანაც სწამდა, რომ ღმერთს მკვდრეთით აღდგენის ძალაც შესწევს. ამიტომაც იყო, რომ შეწირული უკანვე მიიღო, როგორც ნიმუში. "},
	{20, "20 რწმენით აკურთხა ისააკმა იაკობი და ესავი მომავლისათვის. "},
	{21, "21 რწმენით აკურთხა სათითაოდ მომაკვდავმა იაკობმა იოსების ძენი, და თავის კვერთხზე დაყრდნობილმა თაყვანი სცა ღმერთს. "},
	{22, "22 რწმენით მოიხსენია იოსებმა აღსასრულისას ისრაელის ძეთა გამოსვლა და ბრძანება გასცა თავისი ძვლების თაობაზე. "},
	{23, "23 რწმენით მალავდნენ მოსეს მშობლები დაბადებიდან სამი თვის განმავლობაში, რადგანაც ხედავდნენ ყრმის სიკეთეს და არ შეუშინდნენ მეფის ბრძანებას. "},
	{24, "24 რწმენით იყო, რომ მოსემ, როცა წამოიზარდა, უარი თქვა ფარაონის ასულის ძედ წოდებულიყო, "},
	{25, "25 და ღვთის ხალხთან ერთად ტანჯვა ამჯობინა მცირე ხნით ცოდვილ განცხრომას. "},
	{26, "26 ქრისტესავით გმობა უფრო დიდ სიმდიდრედ მიიჩნია, ვიდრე ეგვიპტის მთელი სიმდიდრე, რადგანაც ხედავდა საზღაურს. "},
	{27, "27 რწმენით დატოვა ეგვიპტე და არ შეუშინდა მეფის რისხვას, რადგანაც მტკიცე იყო, როგორც მხილველი უხილავისა. "},
	{28, "28 რწმენით აღასრულა პასექი და სისხლის პკურება, რათა პირმშოთა მომსრველს ხელი ვერ ეხლო მათ პირმშოთათვის. "},
	{29, "29 რწმენით გადავლეს მეწამული ზღვა, როგორც ხმელეთი, ხოლო ეგვიპტელები, იგივე რომ დააპირეს, უფსკრულს დაინთქნენ. "},
	{30, "30 რწმენით დაემხო იერიხონის გალავანი შვიდდღიანი ალყის შედეგად. "},
	{31, "31 რწმენით იყო, რომ ურჩებთან ერთად არ დაიღუპა მეძავი რააბი, რომელმაც მშვიდთბით მიიღო მსტოვარნი. "},
	{32, "32 მეტი რაღა ვთქვა? რადგანაც დრო არ მეყოფა გედეონის, ბარაკის, სამსონის, იეფთაეს, დავითის, სამუელისა და წინასწარმეტყველთა ამბის სათხრობად, "},
	{33, "33 რწმენით რომ ამარცხებდნენ სამეფოებს, აღასრულებდნენ სიმართლეს, იღებდნენ აღთქმას, პირს უკრავდნენ ლომებს, "},
	{34, "34 შრეტდნენ ცეცხლის ძალას, თავს აღწევდნენ მახვილის პირს, ძლიერდებოდნენ უძლერებისგან, მძლავრობდნენ ომში, აოტებდნენ უცხოთა ლაშქარს. "},
	{35, "35 ქალებს აღმდგარნი უბრუნდებოდნენ თავიანთი მკვდრები, სხვები კი ეწამებოდნენ და უარს ამბობდნენ გამოხსნაზე, რათა გამხდარიყვნენ უკეთესი აღდგომის ღირსნი. "},
	{36, "36 სხვებმა დაითმინეს გმობა და გვემა, სხვებმა კი - ბორკილები და დილეგი. "},
	{37, "37 იყვნენ ჩაქოლილნი, შუაზე გადახერხილნი, ხმლით განგმირულნი, ცხვრისა თუ თხის ტყავებით მოარულნი, გაჭირვებულნი, ურვილნი, ძვირხილულნი (რომელთა ღირსიც არ იყო ქვეყანა), "},
	{38, "38 უდაბნოებსა თუ კლდე-ღრეში მოხეტენი, მღვიმეებსა და ნაპრალებს შეფარებულნი. "},
	{39, "39 ყოველ მათგანს კეთილი მოწმობა ჰქონდა თავისი რწმენის წყალობით, მაგრამ ვერ მიიღეს აღთქმული, "},
	{40, "40 რადგანაც ღმერთმა წინასწარ განჭვრიტა ჩვენთვის უმეტესი სიკეთე, რათა ისინი უჩვენოდ ვერ გამხდარიყვნენ სრულქმნილნი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct ka12 poems[] = {
	{1, "1 ამიტომ ჩვენც, რაკიღა ღრუბელივით გარს გვახვევია ესოდენ მრავალი მოწმე, ჩამოვიშოროთ ყოველგვარი სიმძიმე თუ ხელ-ფეხ შემკვრელი ცოდვა და მოთმინებით გავლიოთ ჩვენს წინაშე მდებარე სარბიელი. "},
	{2, "2 თვალი მივაპყროთ იესოს, რწმენის წინამძღვარსა და სრულმყოფს, მის წინაშე მდებარე სიხარულის წილ რომ დაითმინა ჯვარი, უგულებელყო სირცხვილი და დაჯდა ღვთის ტახტის მარჯვნივ. "},
	{3, "3 იფიქრეთ იმაზე, ვინც ყოველივე ეს დაითმინა ცოდვილთაგან, რათა არ შემდრკალიყავით და არ მიგხდოდათ სულის სიმხნევე. "},
	{4, "4 ჯერ კიდევ სისხლამდე არ მდგარხართ ცოდვის წინააღმდეგ საომრად. "},
	{5, "5 და დაივიწყეთ შეგონების სიტყვა, თქვენდამი, როგორც შვილებისადმი, მომართული: „შვილო ჩემო, ნუ უგულებელყოფ წვრთნას უფლისას და ნურც სულით დაეცემი, როცა გამხილებს. "},
	{6, "6 რადგან ვინც უყვარს უფალს, მასვე წვრთნის, და შოლტით სცემს ყველას, ვისაც ძედ იღებს“. "},
	{7, "7 თუ ითმენთ წვრთნას, ღმერთი გექცევათ, როგორც შვილებს: ვინაიდან განა არის ისეთი შვილი, რომელსაც მამა არ წვრთნიდეს? "},
	{8, "8 ხოლო თუ წვრთნის გარეშე რჩებით, რაშიაც ყველას თავისი წილი უძევს, ნაბუშრები ყოფილხართ და არა შვილები. "},
	{9, "9 ეგეც არ იყოს, თუ ჩვენი ხორციელი მამები გვწვრთნიან და შიშით ვემორჩილებით მათ, განა მით უფრო მეტად არ უნდა ვემორჩილებოდეთ სულების მამას, რათა ვიცოცხლოთ? "},
	{10, "10 რადგანაც ისინი თვითნებურად გვზრდიან ორიოდე დღისთვის, ხოლო ეს - ჩვენივე სიკეთისათვის, რათა ვეზიარებოდეთ მის სიწმიდეს. "},
	{11, "11 ყოველგვარი წვრთნა დღესდღეობით სიხარულად კი არ გვეჩვენება, არამედ მწუხარებად, მაგრამ შემდეგ მის მიერ წვრთნილთ მიაგებს სიმართლის ნაყოფს - მშვიდობას. "},
	{12, "12 მაშ, გამართეთ ჩამოყრილი ხელები და დაძაბუნებული მუხლები. "},
	{13, "13 მოასწორეთ ბილიკნი თქვენს ფეხთათვის, რათა გზას კი არ გადასცდეს კოჭლი, არამედ განიკურნოს. "},
	{14, "14 თქვენი ურთიერთობა ყველასთან მშვიდი იყოს და წმიდა, რის გარეშეც ვერავინ იხილავს უფალს. "},
	{15, "15 ფრთხილად იყავით, რომ არავინ მოაკლდეს ღვთის მადლს და არ იბარტყოს რომელიმე ფესვმა სიმწრისა, რათა არ შეაურვოს და შებილწოს ბევრი თქვენგანი. "},
	{16, "16 რათა არ იყოს თქვენს შორის მემრუშე ან ღვთის გარეგანი, როგორც ესავი, ერთ შეჭამადზე რომ გაცვალა თავისი პირმშოობა. "},
	{17, "17 რაკიღა იცით, რომ შემდეგ, როცა მოისურვა დაემკვიდრებინა კურთხევა, უარყოფილ იქნა და ვეღარაფერი გააწყო სინანულით, თუმცაღა ცრემლით ითხოვდა მიტევებას. "},
	{18, "18 რადგან მთას როდი მისდგომიხართ, ხელშესახებს თუ ცეცხლით გზნებულს, ან ბნელს, წყვდიადს თუ გრიგალს, "},
	{19, "19 არც საყვირის ხმას თუ ხმობას სიტყვისას, რომლის მსმენელნიც ითხოვდნენ, რომ აღარ გაგრძელებულიყო ეს სიტყვა. "},
	{20, "20 რადგანაც ვერ უძლებენ იმას, რაც ნაბრძანები იქნა: „მხეციც რომ გაეკაროს მთას, ჩაიქოლება“. "},
	{21, "21 იმდენად საშინელი იყო ეს ხილვა, რომ მოსემაც თქვა: „ვძრწი და ვკანკალებ“. "},
	{22, "22 არამედ მიადექით სიონის მთას და ცოცხალი ღმერთის ქალაქს - ზეციურ იერუსალიმს და ანგელოზთა ურიცხვ სიმრავლეს, "},
	{23, "23 მოზეიმე საკრებულოს და ცაში ჩაწერილ პირმშოთა ეკლესიას, ყოვლისგამკითხავ ღმერთს და სრულქმნილებას ზიარებულ მართალთა სულებს, "},
	{24, "24 ახალი აღთქმის შუამდგომელ იესოს და სხურების სისხლს, აბელის სისხლზე უკეთ რომ მეტყველებს. "},
	{25, "25 ფრთხილად იყავით, ნუ უარყოფთ მეტყველს, რადგან თუ მათ, რომელთაც უარყვეს ქვეყნად მეტყველი, თავი ვერ დააღწიეს სასჯელს, ჩვენ როგორღა დავაღწევთ თავს, თუკი უარვყოფთ ზეცით მეტყველს? "},
	{26, "26 ვისმა ხმამაც ქვეყანა შესძრა მაშინ, ხოლო აწ ამგვარად გვამცნო: „ერთხელ კიდევ შევძრავ არა მარტო ქვეყანას, არამედ ცასაც“. "},
	{27, "27 ხოლო ეს „ერთხელ კიდევ“ გვაუწყებს შეძრულის, როგორც შექმნილის, შეცვლას, რათა უცვლელად ეგოს შეუძვრელი. "},
	{28, "28 ამიტომ, შეუძვრელ სასუფეველს რომ ვღებულობთ, გვქონდეს მადლი, რომლითაც სათნოდ ვემსახურებით ღმერთს, მოშიშებით და მოწიწებით. "},
	{29, "29 რადგანაც ჩვენი ღმერთი არის შთანმთქმელი ცეცხლი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct ka13 poems[] = {
	{1, "1 ძმური სიყვარული ეგოს. "},
	{2, "2 სტუმართმოყვარეობა არ დაივიწყოთ, ვინაიდან ზოგიერთს ისე გაუწევია მასპინძლობა ანგელოზებისთვის, რომ თვითონ არც კი სცოდნია. "},
	{3, "3 გახსოვდეთ პატიმრები, თითქოს მათთან ერთად გედოთ ბორკილები და იტანჯებოდეთ, რადგან თვითონაც ხორციელნი ხართ. "},
	{4, "4 ყველას ცოლ-ქმრობა ღირსეული, სარეცელი კი უმწიკვლი იყოს; ხოლო მემრუშეთა და მეძავთ ღმერთი განიკითხავს. "},
	{5, "5 ნუ იქნებით ვერცხლისმოყვარენი, დასჯერდით იმას, რაც გაბადიათ, რადგანაც თქვა: „არ მიგატოვებ და არ დაგაგდებ“. "},
	{6, "6 ასე რომ, თამამად ვამბობთ: „უფალია ჩემი შემწე და არ მეშინია; რას დამაკლებს კაცი?“ "},
	{7, "7 გახსოვდეთ თქვენი წინამძღვარნი, რომელნიც გიქადაგებდნენ ღვთის სიტყვას, და მათი სიცოცხლის აღსასრულის შემყურენი ჰბაძავდეთ მათ რწმენას. "},
	{8, "8 იესო ქრისტე იგივეა გუშინ, დღეს და უკუნითი უკუნისამდე. "},
	{9, "9 ნუ გაგიტაცებთ სხვადასხვა უცხო მოძღვრება, რადგანაც სასიკეთოა მადლით განიმტკიცოთ გული და არა საჭმლით, რომელსაც ვერას გამორჩნენ ჭამას გადაყოლილნი. "},
	{10, "10 ჩვენ გვაქვს სამსხვერპლო, საიდანაც ჭამის უფლება არა აქვთ კარვის მსახურთ. "},
	{11, "11 რადგანაც ცხოველთა ხორცი, რომელთა სისხლიც ცოდვის განსაწმედად შეაქვს მღვდელმთავარს საწმიდარში, ბანაკის გარეთ დაიწვის. "},
	{12, "12 ამიტომ იესოც, თავისი სისხლით რომ განეწმიდა ხალხი, ბჭის გარეთ ევნო. "},
	{13, "13 მაშ, გავიდეთ მასთან ბანაკის გარეთ და მისი შეურაცხყოფა ვიტვირთოთ. "},
	{14, "14 რადგანაც არა გვაქვს აქ მკვიდრი ქალაქი, არამედ მომავლის ქალაქს ვეძებთ. "},
	{15, "15 ამიტომ მისი მეშვეობით გამუდმებით ვწირავდეთ ღმერთს ქების მსხვერპლს, ანუ ბაგეთა ნაყოფს, რომელნიც აღიარებენ მის სახელს. "},
	{16, "16 ნუ დაივიწყებთ ქველმოქმედებას და ნურც იმას, რომ თქვენი სიკეთე უწილადოთ სხვებს, რადგანაც ამნაირი მსხვერპლი საამოდ უჩანს ღმერთს. "},
	{17, "17 დაემორჩილეთ თქვენს წინამძღვრებს და ქედი მოიდრიკეთ მათ წინაშე, ვინაიდან ფხიზლობენ თქვენი სულებისათვის, თითქოს ანგარიშს აბარებდნენ ვინმეს, რათა სიხარულით აღასრულებდნენ ამას და არა ოხვრით, რადგანაც ეს აღარას გარგებდათ თქვენ. "},
	{18, "18 ილოცეთ ჩვენთვის, რადგანაც გვწამს, რომ წრფელი სინიდისი გვაქვს, და გვინდა ყოველთვის წრფელად ვიქცეოდეთ. "},
	{19, "19 უმეტესად გთხოვთ ამის აღსრულებას, რომ მალე დაგიბრუნდეთ. "},
	{20, "20 ხოლო მშვიდობის ღმერთმა, საუკუნო აღთქმის სისხლით მკვდრეთით რომ აღადგინა ცხოვართა დიდი მწყემსი, უფალი ჩვენი იესო, "},
	{21, "21 დაე, სრულგყოთ თქვენ, რათა მისი ნებისამებრ აღასრულოთ ყოველი კეთილი საქმე, და იესო ქრისტეს მეოხებით ჩაგინერგოთ ის, რაც სათნო ჩანს მის წინაშე, ვისიცაა დიდება უკუნითი უკუნისამდე. ამინ. "},
	{22, "22 გთხოვთ, ძმანო, შეიწყნაროთ ეს სიტყვა შეგონებისა, თუმცაღა მოკლედ მოგწერეთ თქვენ. "},
	{23, "23 იცოდეთ, რომ ჩვენი ძმა ტიმოთე გათავისუფლდა და, თუ მალე მოვიდა, ერთად გეწვევით. "},
	{24, "24 მოიკითხეთ ყველა თქვენი წინამძღვარი და ყველა წმიდა. მოკითხვას გითვლიან იტალიელნი. "},
	{25, "25 მადლი ყველა თქვენგანთან. ამინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};