#include <map>
#include <string>
class Bible61
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
	struct ka6	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 პავლე, მოციქული ქრისტე იესოსი, ღმერთის, ჩვენი მაცხოვრისა და ჩვენი სასოების ქრისტე იესოს ბრძანებით, - "},
	{2, "2 ტიმოთეს, ჭეშმარიტ შვილს რწმენაში: მადლი, წყალობა და მშვიდობა მამა ღმერთისა და ჩვენი უფლის ქრისტე იესოსაგან. "},
	{3, "3 მაკედონიაში წასვლისას მე გთხოვე ეფესოში დარჩენილიყავი, რათა გემცნო ზოგიერთისთვის, რომ ნუ ასწავლიან სხვა რამეს, "},
	{4, "4 და ნუ გადაჰყვებიან არაკებსა თუ გვარტომობის დაუსრულებელ ამბებს, რომლებიც უფრო მეტ დავას იწვევენ, ვიდრე ღვთის შეგონებას რწმენით. "},
	{5, "5 ხოლო მცნების მიზანია სიყვარული წმიდა გულით, წრფელი სინიდისითა და უპირფერო რწმენით, "},
	{6, "6 რასაც ზოგიერთი დაშორდა და ფუჭ მოლაყბედ იქცა. "},
	{7, "7 რჯულისმოძღვრობა სწადიათ, მაგრამ არც ის ესმით, რასაც ამბობენ, და არც ის, რასაც ამტკიცებენ.  "},
	{8, "8 ხოლო ჩვენ ვიცით, რომ რჯული კეთილია, თუკი ვინმე რჯულიერად მოიხმარს მას. "},
	{9, "9 რადგანაც გვესმის, რომ რჯული მართლისთვის კი არაა დადგენილი, არამედ ურჯულოთა და ურჩთა, უღმერთოთა და ცოდვილთა, მკრეხელთა და  ბილწთა, დედ-მამის მკვლელთა და კაცისმკვლელთათვის, "},
	{10, "10 მეძავთა, მამათმავალთა, კაცის გამყიდველთა, ცრუთა, ფიცის გამტეხთა და ყველა სხვათათვის, თავიანთი ქცევით რომ ეწინააღმდეგებიან საღ მოძღვრებას, "},
	{11, "11 თანახმად ნეტარი ღვთის დიდებული სახარებისა, რომელიც მე მაქვს მონდობილი. "},
	{12, "12 მადლიერი ვარ მისი, ვინც მომცა ძალა, - ჩვენი უფლის იესო ქრისტესი, სარწმუნოდ რომ შემრაცხა და მსახურად დამადგინა, "},
	{13, "13 მე, რომელიც უწინ ვიყავი მგმობელი, მდევნელი და მაგინებელი, მაგრამ შეწყაღებულ ვიქენ, რადგანაც ასე ვიქცეოდი უმეცრებით, ურწმუნოების გამო. "},
	{14, "14 ხოლო ჩვენი უფლის მადლმა უფრო მეტად იმრავლა რწმენითა და სიყვარულით ქრისტე იესოში. "},
	{15, "15 სარწმუნოა და ყოველგვარი შეწყნარების ღირსია სიტყვა, რომ ქრისტე იესო მოვიდა ქვეყნად, რათა ეხსნა ცოდვილნი, რომელთა შორისაც პირველი მე ვარ. "},
	{16, "16 მაგრამ სწორედ იმიტომ ვიქენ შეწყალებული, რომ იესო ქრისტეს პირველად ეჩვენებინა ჩემში მთელი დიდსულოვნება მათდა სანიმუშოდ, მომავალში რომ ირწმუნებენ მას საუკუნო სიცოცხლისათვის. "},
	{17, "17 ხოლო საუკუნეთა მეუფეს, უხრწნელს, უხილავსა და ერთადერთ ღმერთს - პატივი და დიდება უკუნითი უკუნისამდე. ამინ. "},
	{18, "18 ამ მცნებას შენ განდობ. შვილო ტიმოთე, შენთვის მოვლენილი წინასწარმეტყველების თანახმად, რათა იომო კეთილი ომით, "},
	{19, "19 გქონდეს რწმენა და წრფელი სინიდისი, რაც უარყო ზოგიერთმა და მარცხი იწვნია რწმენაში, როგორც ხომალდმა - ზღვაში. "},
	{20, "20 მათ შორის ჰიმენეოსმა და აღექსანდრემ, რომელნიც გადავეცი სატანას, რათა თავი ანებონ გმობას. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 უწინარეს ყოვლისა, შეგაგონებ აღასრულო ყოველგვარი ლოცვა, თხოვნა, ვედრება და მადლიერება ყველა კაცისთვის, "},
	{2, "2 მეფეთა და მთავართათვის, რათა მშვიდად და უშფოთველად ვიცხოვროთ მთელი ღვთისმოსაობით და სიწმიდით, "},
	{3, "3 ვინაიდან ეს კეთილი და საამოა ღმერთის - ჩვენი მაცხოვრის თვალში, "},
	{4, "4 რომელსაც ნებავს, რომ ყველა კაცი გადარჩეს და ეზიაროს ჭეშმარიტების შემეცნებას. "},
	{5, "5 რადგანაც ერთია ღმერთი და ერთია შუამავალი ღმერთსა და კაცთა შორის: კაცი ქრისტე იესო, "},
	{6, "6 რომელმაც თავი დადო ყველას გამოსასყიდად, რაც დამოწმებულ იქნა თავის დროზე; "},
	{7, "7 რომლისთვისაც დადგენილი ვარ ქადაგად და მოციქულად (ჭეშმარიტებას ვამბობ ქრისტეში, არ ვცრუობ), წარმართთა მოძღვრად რწმენითა და ჭეშმარიტებით. "},
	{8, "8 ამიტომ ჩემი სურვილია, ყველგან ლოცულობდნენ კაცები და აღაპყრობდნენ თავიანთ წმიდა ხელებს რისხვისა და ეჭვის გარეშე. "},
	{9, "9 ასევე ქალებიც, ღირსეუღაღ მოსილნი, კდემითა და უმანკოებით იმკობდნენ თავს; არა თმაწნულობით, არც ოქროთი თუ მარგალიტით, ანდა ძვირფასი სამოსით, "},
	{10, "10 არამედ კეთილი საქმით, როგორც შეშვენის ქალებს, რომლებმაც ღვთისმოსაობას მიუძღვნეს თავი. "},
	{11, "11 ქალი სწავლობდეს მდუმარედ, სრული მორჩილებით. "},
	{12, "12 მე არა ვრთავ ქალს სწავლების ნებას, და არც ქმარზე მბრძანებლობისას, არამედ რათა იყოს მდუმარედ. "},
	{13, "13 ვინაიდან პირველად ადამი შეიქმნა და მერე ევა. "},
	{14, "14 ადამი კი არ შემცდარა, არამედ ქალი შეცდა და სცოდა. "},
	{15, "15 თუმცაღა მაინც ცხონდება, რადგანაც შვილებს გააჩენს, თუკი რწმენაში, სიყვარულსა და სიწმიდეში დარჩება კდემით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 სარწმუნოა სიტყვა: თუ ვინმეს ეპისკოპოსობა სურს, კეთილი საქმის მსურველია. "},
	{2, "2 მაგრამ ეპისკოპოსი უნდა იყოს უმწიკვლო, ერთი ცოლის ქმარი, ფხიზელი, გონიერი, ღირსეული, სტუმართმოყვარე, განმსწავლელი, "},
	{3, "3 არა მემთვრალე, არა ჩხუბისთავი, არამედ წყნარი, თვინიერი, ვერცხლისმოძულე, "},
	{4, "4 თავისი სახლის კეთილად გამგებელი, შვილების მორჩილებით მყოლი მთელი ღირსებით, "},
	{5, "5 (რადგან ვინც თავის სახლს ვერ განაგებს, როგორღა იზრუნებს ღვთის ეკლესიაზე?), "},
	{6, "6 არა ახლად მოქცეული, რათა თავს არ გაუვიდეს და ეშმაკის სასჯელის ღირსი არ გახდეს. "},
	{7, "7 უნდა ჰქონეს აგრეთვე კეთილი მოწმობა გარეშეთაგან, რათა საგმობი არ გახდეს და ეშმაკის მახეში არ გაებას. "},
	{8, "8 დიაკვნებიც ასევე ღირსეულნი უნდა იყვნენ, არა ორპირნი, არა ღვინოს მიძალებულნი, არა ანგარნი, "},
	{9, "9 რწმენის საიდუმლოს შემნახველნი წრფელი სინიდისით. "},
	{10, "10 ესენიც ჯერ უნდა გამოიცადონ და მხოლოდ შემდეგ, თუ უმწიკვლონი აღმოჩნდნენ, მიენდოთ მსახურება. "},
	{11, "11 მათი ცოლებიც ღირსეულნი უნდა იყვნენ, არა მაბეზღარნი, კდემამოსილნი და ყოველმხრივ სარწმუნონი. "},
	{12, "12 დიაკონიც ერთი ცოლის ქმარი იყოს, შვილებისა და თავისი სახლის კეთილი გამგებელი. "},
	{13, "13 ვინაიდან კეთილად მომსახურენი თავიანთ თავს უმზადებენ კეთილ ხარისხსა და მხნეობას ქრისტე იესოს რწმენაში. "},
	{14, "14 ამას გწერ და იმედი მაქვს მალე გეწვევი. "},
	{15, "15 მაგრამ თუ დავიგვიანე, იცოდე, როგორ უნდა მოიქცე ღვთის სახლში, რომელიც არის ეკლესია ცოცხალი ღვთისა, ჭეშმარიტების სვეტი და საფუძველი. "},
	{16, "16 უცილობლად დიდია ღეთისმოსაობის საიდუმლო: ღმერთი გამოჩნდა ხორცით, გამართლდა სულით, ეჩვენა ანგელოზებს, ქადაგებულ იქნა წარმართთა შორის, სარწმუნო იქნა საწუთროსათვის და ამაღლდა დიდებით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 ხოლო სული ცხადად მეტყველებს, რომ უკანასკნელ ჟამს რწმენისაგან განდგებიან ზოგიერთნი და შეუდგებიან მაცდურ სულთა და დემონთა მოძღვრებას "},
	{2, "2 ცრუმეტყველთა თვალთმაქცობით, რომელთაც დადაღეს თავიანთი სინიდისი; "},
	{3, "3 რომელნიც კრძალავენ ქორწინებას და იმის ჭამას, რაც შექმნა ღმერთმა, რათა მორწმუნენი და ჭეშმარიტების მცოდნენი მადლიერებით ჭამდნენ. "},
	{4, "4 რადგანაც კეთილია ღმერთის ყოველი ქმნილება და არ არის უარსაყოფი, თუკი მიიღება მადლიერებით, "},
	{5, "5 ვინაიდან ღვთის სიტყვით და ლოცვით განიწმიდება. "},
	{6, "6 ამას ასწავლიდე ძმებს და იქნები კეთილი მსახური იესო ქრისტესი, რწმენის სიტყვით და კეთილი მოძღვრებით ნაზარდი, რომლის მიმდევარიც გახდი. "},
	{7, "7 ხოლო უწმინდურთა და დედაბერთა ზღაპრებს ერიდე და ღვთისმოსაობაში გაიწაფე თავი. "},
	{8, "8 ვინაიდან სხეულის წვრთნა ცოტა რამეში თუ წაგადგება, ღვთისმოსაობა კი ყოველმხრივ სასარგებლოა, რაკიღა აწინდელი სიცოცხლის აღთქმაცა აქვს და მერმისისაც. "},
	{9, "9 სარწმუნოა ეს სიტყვა და ღირსი სრული შეწყნარებისა. "},
	{10, "10 ვინაიდან იმისთვის ვშრომობთ და ვიღვწით, რომ ვესავთ ცოცხალ ღმერთს, რომელიც არის ყოველი კაცისა და, მით უმეტეს, მორწმუნეთა მხსნელი. "},
	{11, "11 ამას ამცნებდე და ასწავლიდე. "},
	{12, "12 ნურავის დაამცირებინებ შენს სიჭაბუკეს, არამედ ნიმუშად ექმენ მორწმუნეთ სიტყვით, ქცევით, სიყვარულით, სულით, რწმენით, სიწმიდით; "},
	{13, "13 ვიდრე მოვიდოდე, გამუდმებით იკითხე, შეაგონე, დამოძღვრე. "},
	{14, "14 ნუ უგულებელყოფ შენთვის ბოძებულ ნიჭს, რომელიც მოგეცა წინასწარმეტყველებითა და უხუცესთა ხელდასხმით. "},
	{15, "15 ამაზე იზრუნე და ასე იყავი, რათა შენი წარმატება ცხადი შეიქნეს ყველასთვის. "},
	{16, "16 გაუფთხილდი შენს თავსა და მოძღვრებას, დამკიდრდი მათში, რადგანაც ამით თავსაც იხსნი და შენს მსმენელთაც. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 ნუ შერისხავ ბერიკაცს, არამედ შეაგონე, როგორც მამას, ყმაწვილკაცებს კი - როგორც ძმებს, "},
	{2, "2 დედაბრებს - როგორც დედებს, ქალწულებს - როგორც დებს, მთელი სიწმიდით. "},
	{3, "3 პატივი ეცი ქვრივებს, რომლებიც მართლა ქვრივები არიან. "},
	{4, "4 ხოლო თუ ქვრივს შვილები ან შვილიშვილები ჰყავს, დაე, მათ თავდაპირველად ისწავლონ თავიანთი ოჯახის პატივისცემა და სანაცვლო მიაგონ მშობლებს, რადგანაც ეს ეამება ღმერთს. "},
	{5, "5 ნამდვილი ქვრივი და მარტოხელა ღმერთს ესავს და ლოცვა-ვედრებაში ატარებს დღესა და ღამეს. "},
	{6, "6 განცხრომის მოყვარე კი - ცოცხლადვე მკვდარია. "},
	{7, "7 ეს ამცნე მათ, რათა უბიწონი იყვნენ. "},
	{8, "8 ხოლო ვისთვისაც უცხოა თავისიანთა და, მით უმეტეს, სახლეულთათვის ზრუნვა, რწმენის უარმყოფელია და ურწმუნოზედაც უარესი. "},
	{9, "9 ქვრივად შეიძლება შეირაცხოს არანაკლებ სამოცი წლისა, ერთნაქმარევი "},
	{10, "10 და თავისი კეთილი საქმით ცნობილი: რომ დაზარდა შვილები, რომ მასპინძლობდა სტუმრებს, ფეხებს ჰბანდა წმიდათ, შეეწეოდა გაჭირვებული, და გულმოდგინედ ასრულებდა ყველა კეთილ საქმეს. "},
	{11, "11 ახალგაზრდა ქვრივებს კი ნუ მიიღებ, რადგანაც ქრისტეს ზურგს აქცევენ და კვლავ გათხოვება სურთ, "},
	{12, "12 რისთვისაც სასჯელის ღირსნი არიან, ვინაიდან უარყვეს უწინდელი რწმენა. "},
	{13, "13 ეგეც არ იყოს, უქმად ყოფნასა და კარდაკარ წანწალს ეჩვევიან, და არა მარტო უქნარანი არიან, არამედ ყბედნიც, ცნიაბისმოყვარენიც და უტიფრად მოჭარტალენიც."},
	{14, "14 ამიტომ მინდა, რომ ახალგაზრდა ქვრივები გათხოვდნენ, შვილები გააჩინონ, დიასახლისობას მიჰყონ ხელი და გმობის საბაბი არ მისცენ მტერს. "},
	{15, "15 რადგანაც ზოგმა უკვე გზას გადაუხვია და სატანის კვალს შეუდგა. "},
	{16, "16 თუ რომელიმე მორწმუნე კაცს ან ქალს ქვრივი ნათესავები ჰყავს, დაეხმაროს მათ, რომ ეკლესიას არ დააწვნენ ტვირთად და, ამრიგად, მან შესძლოს ნამდვილი ქვრივების რჩენა. "},
	{17, "17 ხუცესნი, რომელნიც კეთილად წინამძღვრობენ, ორმაგი პატივის ღირსნი არიან, მეტადრე ისინი, სიტყვით და სწავლით რომ მუშაკობენ. "},
	{18, "18 რადგანაც წერილი ამბობს: „პირს ნუ აუკრავ მეკალოე ხარს“, და კიდევ: „ღირსია მუშაკი თავისი საზღაურისა“. "},
	{19, "19 ხუცესთათვის წაყენებულ ბრალდებას ნუ მიიღებ, თუ არ დაისწარი ორი ან სამი მოწმე. "},
	{20, "20 შემცოდენი ყველას წინაშე ამხილე დანარჩენთა დასაშინებლად. "},
	{21, "21 ღმერთის, უფალ იესო ქრისტესა და რჩეულ ანგელოზთა წინაშე გაფიცებ, ურღვევლად დაიცავი ჩემი რჩევა და ნურაფერს აღასრულებ მიკერძოებით. "},
	{22, "22 ნაჩქარევი ხელდასხმისგან თავი შეიკავე, ნუ გახდები სხვათა ცოდვების მოზიარე და წმიდად შეინახე თავი. "},
	{23, "23 ამიერიდან მარტო წყალს ნუკი სვამ, არამედ ცოტ-ცოტა ღვინოც იგემე; ეს მოუხდება შენს სტომაქსა და ესოდენ ხშირ სნეულებას. "},
	{24, "24 ზოგიერთი კაცის ცოდვები წინასწარვე ცხადნი არიან და წინ მიუძღვიან სამსჯავროსაკენ, ზოგიერთს კი უკან მისდევენ. "},
	{25, "25 ასევე წინასწარვე ცხადნი არიან კეთილი საქმენიც, თუ არა და, ბოლოს მაინც არ დაიფარვიან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ka6 poems[] = {
	{1, "1 უღელქვეშ მყოფი მონები ყოველგვარი პატივის ღირსად უნდა რაცხდნენ თავიანთ ბატონებს, რათა არ იგმოს ღვთის სახელი და მოძღვრება. "},
	{2, "2 რომელთაც მორწმუნე ბატონები ჰყავთ, პატივისცემას ნუ მოაკლებენ მათ, არამედ მით უფრო ერთგულად უნდა ემსახურონ, რადგანაც ისინი მორწმუნენი, საყვარელნი და ქველმოქმედნი არიან. ეს ასწავლე და შეაგონე. "},
	{3, "3 ვინც სხვა რამეს ასწავლის და არ მისდევს ჩვენი უფლის იესო ქრისტეს საღ სიტყვებსა და საღვთისმოსაო მოძღვრებას, "},
	{4, "4 მზვაობარია, არაფრის მცოდნე და დასნეულებული დავისა და ცილობის სენით, საიდანაც წარმოსდგება შური, განხეთქილება, გმობა, უკეთური ეჭვი, "},
	{5, "5 გონებაგახრწნილ კაცთა ფუჭი კამათი, რომელთათვისაც უცხოა ჭეშმარიტება და ღვთისმოსაობა სარფიანი საქმე ჰგონიათ. "},
	{6, "6 თუმცა ღვთისმოსაობა და თვითმკმარობა მართლაც რომ დიდი შენაძენია. "},
	{7, "7 რადგან ამ ქვეყნად არაფერი მოგვიტანია და, რა თქმა უნდა, ვერც რას წავიღებთ. "},
	{8, "8 თუ საჭმელი და ტანსაცმელი მოგვეძებნება, ამას დავჯერდეთ. "},
	{9, "9 ხოლო გამდიდრების მოსურნენი საცდურის მახეში ებმებიან და ბევრი შლეგური, მავნე და კაცთა წარმწყმედ-დამღუპველი გულისთქმის ტყვენი ხდებიან. "},
	{10, "10 რადგანაც ყოველგვარი ბოროტების ფესვი ვერცხლისმოყვარეობაა, და ზოგიერთი, ვინც ამ ვნებას აჰყვა, რწმენას განუდგა და თავს დაიტეხა ურიცხვი ჭირი. "},
	{11, "11 შენ კი, ღვთის კაცო, ერიდე ამას და მისდიე რწმენას, სიყვარულს, მოთმინებას, თვინიერებას; "},
	{12, "12 იღვაწე რწმენის კეთილი ღვაწლით, შეიტკბე საუკუნო სიცოცხლე, რომლისთვისაც ხარ ხმობილი, და აღიარე კეთილი აღსარება მრავალი მოწმის წინაშე. "},
	{13, "13 გამცნებ შენ ყოვლის მაცოცხლებელი ღმერთისა და ქრისტე იესოს წინაშე, პონტიუს პილატეს წინაშე რომ იმოწმა კეთილი აღსარება, - "},
	{14, "14 წმიდად და უბიწოდ დაიმარხე მცნება ჩვენი უფლის იესო ქრისტეს მოსვლამდე, "},
	{15, "15 რომელსაც თავის დროს მოგვივლენს ერთადერთი ნეტარი მბრძანებელი, მეუფეთა მეუფე და უფლებათა უფალი, "},
	{16, "16 ერთადერთი მპყრობელი უკვდავებისა, მიუწვდომელ ნათელში მყოფი, რომელიც არ უხილავს არცერთ კაცთაგანს და არც ძალუძს იმისი ხილვა, ვისიცაა პატივი და საუკუნო ძალმოსილება. ამინ. "},
	{17, "17 მდიდართა ამა ქვეყნისათა ამცნე: ნუ ქედმაღლობენ, და ფუჭი სიმდიდრის იმედი ნუკი ექნებათ, არამედ ცოცხალი ღმრთისა, უხვად რომ გვაძლევს ყველაფერს სამხიარულოდ; "},
	{18, "18 რათა ქველმოქმედებდნენ, კეთილი საქმით მდიდრდებოდნენ, გულუხვნი იყვნენ, ხელგაშლილნი, "},
	{19, "19 და იუნჯებდნენ სიკეთის საუნჯეს მომავლის მტკიცე საფუძვლად, რათა ეწიონ საუკუნო სიცოცხლეს. "},
	{20, "20 ო, ტიმოთე, გაუფრთხილდი, რაც მოგენდო, ერიდე უკეთურ ფუჭსიტყვაობას და ცრუმეცნიერების უკუღმართობას, "},
	{21, "21 რაც საქმედ გაიხადა ზოგიერთმა და კიდევაც განუდგა რწმენას. მადლი თქვენთან. ამინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};