#include <map>
#include <string>
class Bible8
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 ეს მოხდა მსაჯულთა მსაჯულობის დროს, როცა ქვეყანაში შიმშილი იყო. წავიდა ერთი კაცი იუდას ბეთლემიდან მოაბის ველზე საცხოვრებლად თავისი ცოლითა და ორი ვაჟითურთ. "},
	{2, "2 კაცს ერქვა ელიმელექი, მის ცოლს ნაყომი; ვაჟებს მახლონი და ქილიონი. ეფრათელნი იყვნენ, იუდას ბეთლემიდან. მივიდნენ მოაბის ველზე და იყვნენ იქ. "},
	{3, "3 მოკვდა ელიმელექი, ნაყომის ქმარი, და დარჩა დედაკაცი თავისი ორი ვაჟით. "},
	{4, "4 მოიყვანეს ვაჟებმა ცოლად მოაბელი ქალები. ერთის სახელი იყო ყორფა, მეორისა - რუთი. და ცხოვრობდნენ იქ ათიოდე წელი. "},
	{5, "5 დაიხოცნენ ეს ორნიც - მახლონი და ქილიონი, და დარჩა დედაკაცი უშვილოდ. და უქმროდ. "},
	{6, "6 ადგა და დაბრუნდა თავისი რძლებითურთ მოაბის ველიდან, რადგან შეიტყო მოაბის ველზე, რომ მოხედა უფალმა თავის ერს და მისცა პური. "},
	{7, "7 გავიდა თავის ორ რძალთან ერთად იმ ადგილიდან, სადაც ცხოვრობდა, და იუდას ქვეყნისაკენ დაადგა გზას. "},
	{8, "8 უთხრა ნაყომიმ თავის ორ რძალს: წადით, დაბრუნდით თქვენ-თქვენი დედის სახლში. სიკეთით გადაგიხადოთ! უფალმა. თქვენი ამაგი გარდაცვლილებზე და ჩემზე. "},
	{9, "9 უფალმა გაპოვნინოს ორთავეს მყუდრო ცხოვრება თქვენ-თქვენი ქმრების ხლში. და გადაკოცნა ისინი. მათ კი ხმამაღალი ტირილი დაიწყეს. "},
	{10, "10 უთხრეს მას: წამოგყვებით შენს ხალხთან. "},
	{11, "11 უთხრა ნაყომიმ: გაბრუნდით, შვილებო, რისთვის უნდა წამომყვეთ? განა კიდევ მყავს მუცელში ვაჟები, რომ ქმრებად გაგიხდნენ? "},
	{12, "12 გაბრუნდით, შვილებო, წადით! დავბერდი, აღარ მეყოლება ქმარი. კიდეც რომ მქონდეს იმედი, კიდეც რომ ვიქნე ამაღამ ქმართან და ვშობო ვაჟები, "},
	{13, "13 განა თქვენ დაელოდებით მათ დაზრდას? განა უარს იტყვით გათხოვებაზე? არა, შვილებო, ძალზე მენანებით, რადგან მომწვდა მე უფლის ხელი. "},
	{14, "14 კვლავ ხმამაღალი ტირილი დაიწყეს. გადაკოცნა ყორფამ დედამთილი, რუთი კი მიეკრო მას. "},
	{15, "15 უთხრა: ხედავ, უბრუნდება შენი რძალი თავის ხალხსა და ღმერთს. მიჰყევი შენს რძალს. "},
	{16, "16 თქვა რუთმა: ნუ მაიძულებ დაგტოვო და წავიდე შენგან, რადგან სადაც შენ მიდიხარ, მეც იქ უნდა წამოვიდე; სადაც შენ დაგიღამდება, მეც იქ უნდა დამიღამდეს. შენი ხალხი ჩემი ხალხია, შენი ღმერთი ჩემი ღმერთია. "},
	{17, "17 სადაც მოკვდები, მეც იქ უნდა მოვკვდე და დავიმარხო. ასე და ასე მიყოს უფალმა და უარესიც, თუ რამემ გაგვყაროს, სიკვდილის მეტმა. "},
	{18, "18 რაკი დაინახა, რომ გადაწყვეტილი ჰქონდა მასთან ერთად წასვლა, შეწყვიტა ლაპარაკი. "},
	{19, "19 იარეს ამ ორთა, ვიდრე არ მიადგნენ ბეთლემს. ბეთლემში მისვლისას შეიძრა მთელი ქალაქი მათ გამო. ამბობდნენ, ნაყომი ხომ არ არისო ეს დედაკაცი? "},
	{20, "20 უთხრა მათ: ნუღა დამიძახებთ ნაყომის (სიამეს), დამიძახეთ მარა (გამწარებული), რადგან მეტისმეტად გამამწარა ყოვლადძლიერმა. "},
	{21, "21 სავსე წავედი და ცარიელი დამაბრუნა უფალმა. რაღატომ უნდა მეძახდეთ ნაყომის? გამტანჯა უფალმა და გამაუბედურა ყოვლადძლიერმა. "},
	{22, "22 დაბრუნდა ნაყომი თავის რძალთან, მოაბელ რუთთან ერთად, რომელიც მოაბის ველიდან წამოჰყვა მას. მკათათვის დასაწყისი იყო, როცა ბეთლემში მოვიდნენ ისინი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 ქმრის მხრიდან ნათესავი ჰყავდა ნაყომის, ერთი შეძლებული კაცი, ელიმელექის საგვარეულოდან, სახელად ბოყაზი. "},
	{2, "2 უთხრა მოაბელმა რუთმა ნაყომის: წავალ ყანებში და თავთავებს ავკრეფ იმათ ნამკალში, ვის თვალშიც მადლს ვიპოვნი. უთხრა: წადი, შვილო. "},
	{3, "3 წავიდა და შეუდგა აკრეფას ყანაში მომკელთა კვალზე. ბოლოს იმ ბოყაზის ყანაში მოხვდა, რომელიც ელიმელექის საგვარეულოდან იყო. "},
	{4, "4 ამ დროს ბოყაზიც მოვიდა ბეთლემიდან და უთხრა მომკელებს: უფალი იყოს თქვენთან! მიუგეს: უფალმა გაკურთხოს! "},
	{5, "5 უთხრა ბოყაზმა თავის მსახურს, რომელიც თავზე ადგა მომკელებს: ვისია ეს ყმაწვილი ქალი? "},
	{6, "6 მიუგო მსახურმა, რომელიც თავზე ადგა მომკელებს, და უთხრა: მოაბელია ეს ყმაწვილი ქალი, ნაყომის წამოჰყვა მოაბის ველიდან. "},
	{7, "7 თქვა, ამაკრეფინეთ და შემაგროვებინეთ თავთავები მომკელთა კვალზეო. მოვიდა და დილიდან აქ ტრიალებს. შინ თითქმის არ ჩერდება. "},
	{8, "8 უთხრა ბოყაზმა რუთს: ახლა ყური მიგდე, შვილო. სხვის ყანაში ნუ წახვალ ასაკრეფად. აქედან ნურსად გადახვალ, ჩემს მსახურ ქალებთან დარჩი. "},
	{9, "9 ხომ ხედავ ამ ყანას, რომელსაც მკიან. იარე მომკელთა კვალზე. ბიჭებისთვის ნაბრძანები მაქვს, არ დაგიშალონ. თუ მოგწყურდეს, ჭურჭლებთან მიდი და დალიე, საიდანაც ჩემი ბიჭები იღებენ წყალს. "},
	{10, "10 პირქვე დაემხო ქალი, მდაბლად თაყვანისცა და უთხრა: რა მადლი ვპოვე შენს თვალში, რომ უცხო ტომის ქალი ასე დამაფასე? "},
	{11, "11 მიუგო ბოყაზმა და უთხრა: გაგებული მაქვს ყველაფერი, რაც დედამთილისთვის გააკეთე შენი ქმრის სიკვდილის შემდეგ. დედ-მამა, სამშობლო მხარე რომ მიატოვე და მოხვედი ხალხში, რომელსაც ადრე არც კი იცნობდი. "},
	{12, "12 უფალმა გადაგიხადოს მაგ საქმისთვის; სრული საზღაური მიგეზღოს უფლისგან, ისრაელის ღმერთისგან, რომლის ფრთებქვეშაც ხარ შეფარებული. "},
	{13, "13 უთხრა: მადლი მიპოვნია შენს თვალში, ბატონო, რაკი მანუგეშე და გამამხნევე შენი მხევალი. მე ხომ შენი მხევლობის ღირსიც არა ვარ! "},
	{14, "14 უთხრა მას ბოყაზმა: პურის ჭამისას მოდი და აქ ჭამე პური, ლუკმა ჩააწე ღვინოში. დაჯდა ქალი მომკელთა გვერდით. დაუყარეს ქუმელი, მანაც ჭამა გაძღომამდე და კიდევაც დარჩა შეუჭმელი. "},
	{15, "15 როცა ქალი ასაკრეფად ადგა, უბრძანა ბოყაზმა ბიჭებს და უთხრა: ძნებს შორისაც აკრიფოს, ნუ დააყვედრით. "},
	{16, "16 ხელეურებიდანაც მიუყარეთ და დაუტოვეთ ხოლმე, აკრიფოს, ნუ დაუშლით. "},
	{17, "17 საღამომდე კრეფდა ქალი ყანაში. დაცეხვა ანაკრეფი და გამოუვიდა ერთ ეფამდე ქერის მარცვალი. "},
	{18, "18 აიღო და წავიდა ქალაქში. ნახა დედამთილმა მისი ანაკრეფი. ამოიღო რუთმა, რაც შეუჭმელი დარჩა და მისცა. "},
	{19, "19 უთხრა მას დედამთილმა: სად კრეფდი დღეს, სად შრომობდი? დალოცვილი იყოს შენი მომხედავი! უამბო დედამთილს ვისთანაც შრომობდა, და უთხრა: ბოყაზი ჰქვია იმ კაცს, ვისთანაც ვშრომობდი დღეს. "},
	{20, "20 უთხრა ნაყომიმ რძალს: დალოცვილი იყოს უფლისაგან, რომ წყალობა არ მოაკლო არც ცოცხლებს და არც მკვდრებს! უთხრა ნაყომიმ: ჩვენი ახლობელია ეს კაცი, ჩვენი სანათესაოდან არის. "},
	{21, "21 თქვა მოაბელმა რუთმა: ისიც მითხრა, ჩემს მსახურ ბიჭებთან დარჩი, სანამ ჩემს სამკალს არ მორჩებიანო. "},
	{22, "22 უთხრა ნაყომიმ რუთს, თავის რძალს: კარგია, შვილო, რომ მის მსახურ ქალებთან ერთად გახვალ და სხვის ყანაში არ დაგინახავენ. "},
	{23, "23 არ მოშორებია იგი ბოყაზის მსახურ ქალებს. კრეფდა ნამკალში, სანამ ქერისა და პურის მკა არ დასრულდა. ასე ცხოვრობდა ის თავის დედამთილთან ერთად. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 უთხრა მას ნაყომიმ, მისმა დედამთილმა: შვილო, მყუდრო ადგილი მინდა მოგიძებნო, რომ ბედნიერი იყო. "},
	{2, "2 აი, ბოყაზი, ჩვენი ნათესავი, რომლის მსახურ ქალებთანაც ნამყოფი ხარ, აი, ამ ღამით ქერს ანიავებს კალოზე. "},
	{3, "3 გაიბანე, ზეთი იცხე, გამოეწყვე და კალოზე გადი. არ დაენახო იმ კაცს, სანამ ჭამა-სმა არ მორჩება. "},
	{4, "4 როცა დასაწოლად წავა, გაიგე, სად წევს. მიდი, გადაუწიე ფეხებთან წამოსასხამი და მიუწექი. თავად გეტყვის, როგორც უნდა მოიქცე. "},
	{5, "5 უთხრა: ისე მოვიქცევი, როგორც მეუბნები. "},
	{6, "6 გავიდა კალოზე და ისე მოიქცა, როგორც დედამთილმა დაარიგა. "},
	{7, "7 ჭამა და სვა ბოყაზმა, გახალისდა და წავიდა ზვინებთან დასაწოლად. უჩუმრად მივიდა რუთი, გადაუწია ფეხებთან წამოსასხამი და მიუწვა. "},
	{8, "8 შუაღამისას შეკრთა კაცი, რაღაცას შეეხო და, აჰა, ქალი უწევს ფეხთით. "},
	{9, "9 თქვა: ვინა ხარ? მიუგო: რუთი ვარ, შენი მხევალი, გადააფარე ფრთა შენს მხევალს. შენ ხომ ნათესავი ხარ. "},
	{10, "10 თქვა: დალოცვილი იყავ უფლისაგან, შვილო. რაც ახლა მადლი ჰქვნი, წინანდელზე უკეთესია. ყმაწვილთაგანს ვინმეს რომ არ წაჰეევი, არც ღარიბს, არც მდიდარს. "},
	{11, "11 ახლა ნუ გეშინია, შვილო. ყველაფერს შეგისრულებ, რასაც მეტყვი, რადგან მთელმა ჩემმა ხალხმა იცის, რომ ღირსეული ქალი ხარ. "},
	{12, "12 ახლა, მართალია ნათესავი ვარ, მაგრამ ჩემზე ახლობელი ნათესავიც გყავს. "},
	{13, "13 გაათიე ეს ღამე და, თუ დილით მან გინათესავა, ხომ კარგი, გინათესავოს. თუ არ ისურვა და არ გინათესავა, მაშინ მე თავად გინათესავებ, უფალს ვფიცავ. იწექი დილამდე. "},
	{14, "14 იწვა ქალი მის ფეხთით დილამდე და ადგა დილაბნელზე. თქვა ბოყაზმა: არავინ გაიგოს, ქალი რომ იყო კალოზე. "},
	{15, "15 უთხრა: აიღე ეგ თავშალი, რომ გახურავს, და ხელში დაიჭირე. მანაც დაიჭირა ხელში და ჩაუყარა ბოყაზმა ექვსი საწყაული ქერის მარცვალი, ზურგზე მოჰკიდა, თავად კი ქალაქში წავიდა. "},
	{16, "16 მივიდა რუთი თავის დედამთილთან. შეეკითხა: რა იყო, შვილო? მითხარი, როგორ მოგექცა ის კაცი? "},
	{17, "17 მიუგო: ეს ექვსი საწყაული ქერი მომცა, თან მითხრა, ხელცარიელი არ წახვიდეო დედამთილთან. "},
	{18, "18 უთხრა: დაელოდე, შვილო, სანამ გაიგებდე, როგორ დამთავრდება ეს საქმე. რადგან არ მოისვენებს ის კაცი, ვიდრე დღესვე არ გაასრულებს ამ საქმეს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 ავიდა ბოყაზი კარიბჭესთან და იქ დაჯდა. აჰა, უნდა ჩაიაროს იმ ნათესავმა კაცმა, ვისზეც ლაპარაკობდა ბოყაზი. დაუძახა: მოდი, სახელით მოუხმო, აქ დაჯექიო. ისიც მივიდა და დაჯდა. "},
	{2, "2 მოიყვანა ბოყაზმა ათი კაცი ქალაქის უხუცესთაგან და უთხრა: დასხედით აქ. ისინიც დასხდნენ. "},
	{3, "3 უთხრა ბოყაზმა იმ ნათესავს: ჩვენი მოძმის, ელიმელექის, ყანის ნაკვეთი გაყიდა მოაბის ველებიდან დაბრუნებულმა ნაყომიმ. "},
	{4, "4 ახლა ამას გიცხადებ: იყიდე ყანა აქ მსხდომთა და ხალხის უხუცესთა თანდასწრებით. თუ გსურს ენათესავო, ენათესავე. თუ არა და, მითხარი და მეცოდინება, რადგან შენზე წინ არავისა აქვს ნათესაობის უფლება. მე მხოლოდ შენს შემდეგ ვარ. თქვა: ვუნათესავებ. "},
	{5, "5 თქვა ბოყაზმა: როცა ნაყომისგან ყანას იყიდი, მოაბელი რუთისგან, გარდაცვლილის ცოლისგანაც უნდა იყიდო, რომ სახელი აღუდგინო თავის სამკვიდროში გარდაცვლილს. "},
	{6, "6 თქვა ნათესავმა: ვერ ვუნათესავებ. ვაითუ, ჩემი სამკვიდრო დავაზარალო. შენ შეასრულე ჩემი უფლება ნათესაობისა, რადგან მე არ შემიძლია, რომ ვუნათესავო. "},
	{7, "7 ასე იქცეოდნენ ძველად ისრაელში სყიდვის, გაცვლის ან რაიმე საქმის დადასტურების დროს: გაიძრობდა ერთი ფეხსამოსს და მეორეს მისცემდა. ეს იყო მოწმობის ნიშანი ისრაელში. "},
	{8, "8 უთხრა იმ ნათესავმა ბოყაზს: შენ იყიდე! და გაიძრო ფეხსამოსი. "},
	{9, "9 უთხრა ბოყაზმა უხუცესებს და მთელს ხალხს: დღეს თქვენ მოწმენი ხართ, რომ მე ვყიდულობ ნაყომისგან ელიმელექის მთელს საბადებელს, და ქილიონისა და მახლონის მთელს საბადებელს, "},
	{10, "10 და ცოლად მიმყავს მოაბელი რუთიც, მახლონის ცოლი, რომ სახელი აღვუდგინო გარდაცვლილს თავის სამკვიდროში, რომ არ გაქრეს გარდაცვლილის სახელი მის მოძმეთა შორის და იმ უბნის კარიბჭესთან, სადაც ის ცხოვრობდა. ამის მოწმენი ხართ დღეს თქვენ. "},
	{11, "11 უთხრეს კარიბჭესთან მყოფმა ხალხმა და უხუცესობამ: მოწმენი ვართ! ღმერთმა დალოცოს შენს სახლში შემომავალი დედაკაცი რახელივით და ლეასავით, რომლებმაც ააშენეს ისრაელის სახლი. ქმენი სიქველე ეფრათაში და გაითქვი სახელი ბეთლემში. "},
	{12, "12 გახდეს შენი სახლი სახლივით ფერეცისა (რომელიც თამარმა უშვა იუდას) იმ ნაშიერიდან, უფალი რომ მოგცემს ამ ყმაწვილი ქალისაგან. "},
	{13, "13 წაიყვანა ბოყაზმა რუთი და გახდა იგი მისი ცოლი. შევიდა მასთან და მისცა მას უფალმა ორსულობა და შვა ვაჟი. "},
	{14, "14 უთხრეს დედაკაცებმა ნაყომის: კურთხეულია უფალი, რომელმაც ნათესავი არ მოგიშალა დღეს! იხსენებოდეს ისრაელში მისი სახელი!"},
	{15, "15 შენი სიბერის ნუგეშად და სასოდ გეყოლოს, რადგან შვა იგი შენმა საყვარელმა რძალმა, რომელიც შვიდ ვაჟიშვილს გირჩევნია."},
	{16, "16 მიირქვა ნაყომიმ ბავშვი, უბეში ჩაისვა და გახდა მისი გამდელი."},
	{17, "17 სახელი მეზობლის ქალებმა დაარქვეს, თქვეს: ვაჟი შეეძინა ნაყომის! და დაარქვეს სახელად ყობედი. ეს იყო მამა იესესი, დავითის მამისა."},
	{18, "18 აი, ფერეცის შთამომავლობა: ფერეცმა შვა ხეცრონი,"},
	{19, "19 ხეცრონმა შვა რამი, რამმა შვა ყამინაბადი,"},
	{20, "20 ყამინაბადმა შვა ნახშონი, ნახშონმა თქვა სალმონი,"},
	{21, "21 სალმონმა შვა ბოყაზი, ბოყაზმა შვა ყობედი,"},
	{22, "22 ყობედმა შვა იესე, იესემ შვა დავითი."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};