#include <map>
#include <string>
class Bible56
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
	struct ka6	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 პავლე, ღვთის ნებით იესო ქრისტეს მოციქული, - ეფესოში მყოფ წმიდათ და მორწმუნეთ იესო ქრისტეში: "},
	{2, "2 მადლი და მშვიდობა ჩვენი მამა ღმრთისა და უფალ იესო ქრისტესაგან. "},
	{3, "3 კურთხეულ იყოს ღმერთი და მამა ჩვენი უფლის იესო ქრისტესი, რომელმაც გვაკურთხა იესო ქრისტეს მიერ ყოველი სულიერი კურთხევით ცაში. "},
	{4, "4 ვინაიდან ქვეყნიერების შექმნამდე ამოგვირჩია მასში, რათა წმიდანი და უბიწონი ვყოფილიყავით მის წინაშე სიყვარულით; "},
	{5, "5 თავისი ნებისამებრ წინასწარვე რომ განსაზღვრა ვეშვილებინეთ იესო ქრისტეს მეშვეობით, "},
	{6, "6 რათა გვექო დიდება მისი მადლისა, რომელიც მოგვმადლა თავის საყვარელ ძეში, "},
	{7, "7 ვის მიერაც გვაქვს გამოსყიდვა მისი სისხლით და ცოდვათა მოტევება მისივე მადლის სიმდიდრით, "},
	{8, "8 ესოდენ უხვად რომ გვიბოძა ყოველგვარი სიბრძნითა და გონიერებით, "},
	{9, "9 და გვაუწყა თავისი ნების საიდუმლო თავისივე კეთილმოსურნეობით, "},
	{10, "10 რითაც წინასწარ განსაზღვრა თავის თავში, განეგო ჟამთა სისრულე და ყოველივე ზეციურისა და მიწიერისთვის თავი მოეყარა ქრისტეში, "},
	{11, "11 რომელშიაც გავხდით მემკვიდრენი, რაც წინასწარვე განკუთვნილი იყო ჩვენთვის მისი განჩინების თანახმად, ვინც ყველაფერს აღასრულებს თავისი ნებით, "},
	{12, "12 რათა მისი დიდების მაქებარნი ვყოფილიყავით, იმთავითვე ქრისტეს მოიმედენი; "},
	{13, "13 მასშივე მოისმინეთ თქვენც ჭეშმარიტების სიტყვა, თქვენი ხსნის სახარება, რაც იწამეთ და კიდევაც აღიბეჭდეთ აღთქმული წმიდა სულით, "},
	{14, "14 რომელიც არის ჩვენი მემკვიდრეობის წინდი საბოლოო გამოხსნამდე, როცა დავიმკვიდრებთ ჩვენს წილხვედრს მისი დიდების საქებრად. "},
	{15, "15 ამიტომ მეც, როცა გავიგე თქვენი რწმენა უფალ იესოსადმი და თქვენი სიყვარული ყველა წმიდის მიმართ, "},
	{16, "16 გამუდმებით მადლს ვწირავ ღმერთს თქვენს გამო და ჩემს ლოცვებში გიხსენებთ, "},
	{17, "17 რათა მოგცეთ ჩვენი უფლის იესო ქრისტეს ღმერთმა დიდების მამამ, სიბრძნისა და გამოცხადების სული მის შესაცნობად;"},
	{18, "18 და გაანათლოს თქვენი გონების თვალი, რათა შეიცნოთ, რა არის მისი ხმობის იმედი და როგორია მისი დიადი მემკვიდრეობის სიმდიდრე წმიდათა შორის, "},
	{19, "19 ან რარიგ განუზომელია მისი ძალმოსილების სიდიადე ჩვენში, რომელთაც გვწამს მისი მძლეთამძლე ძალის წყალობით,"},
	{20, "20 რომლითაც იმოქმედა ქრისტში, მკვდრეთით აღადგინა და მარჯვნივ დაისვა ცაში, "},
	{21, "21 ყველა მთავრობასა თუ ხელმწიფებაზე, ყველა ძალსა თუ უფლებაზე, ყველა იმ სახელზე მაღლა, სახელად რომ ითქმის არა მარტო ამ საწუთროში, არამედ მომავალშიც; "},
	{22, "22 ყველაფერი ფეხქვეშ გაუგო და დაუმორჩილა, და მისცა მას მთავრობა ყოველი ეკლესიისა, "},
	{23, "23 რომელიც არის მისი სხეული, ყოვლის აღმვსები ყოვლით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 და აღგადგინათ თქვენც, მკვდრად ქცეულნი თქვენი ბრალეულობით და ცოდვებით, "},
	{2, "2 რომლებითაც უწინ ამ წუთისოფლის წესისამებრ იარებოდით, ჰაერის ძალთა მთავრის - იმ სულის ნებით, ვის ძალამოსილებასაც ამჟამად ჰმონებენ ურჩობის ძენი; "},
	{3, "3 ოდესღაც ჩვენც მათ შორის ვცხოვრობდით, ხორცის გულისთქმას აყოლილნი, ხორციელ ვნებათა და ზრანვათა მონა-მორჩილნი და, ბუნებით, დანარჩენთა მსგავსად, შერისხვის შვილნი; "},
	{4, "4 მაგრამ წყალობით მდიდარმა ღმერთმა, თავისი უშრეტი სიყვარულით რომ შეგვიყვარა, "},
	{5, "5 ბრალეულობით მკვდარნი ქრისტესთან ერთად გაგვაცოცხლა (მადლით ხართ გამოხსნილნი), "},
	{6, "6 მასთან ერთად აღგვადგინა და მასთანვე დაგვსხა ზეცას ქრისტე იესოში, "},
	{7, "7 რათა მომავალ საუკუნეთათვის ეჩვენებინა ულევი სიმდიდრე თავისი მადლისა, ჩვენდამი მოწყალებით რომ მოგვმადლა იესო ქრისტეში. "},
	{8, "8 და მართლაც, მადლმა გიხსნათ რწმენის წყალობით; მაგრამ ეს თქვენგან კი არ არის, არამედ ნიჭია ღვთისა;"},
	{9, "9 და არც თქვენს საქმეთაგან, რათა არავინ იქადოდეს. "},
	{10, "10 რადგანაც მისი ქმნილებანი ვართ, ქრისტე იესოში შექმნილნი სიკეთის ქმნისთვის, როგორც დაგვიწესა ღმერთმა, რათა სიკეთით ვიაროთ. "},
	{11, "11 მაშ, გახსოვდეთ, რომ თქვენ, ოდესღაც ხორცით წარმართნი, წინადაუცვეთლებს რომ გიწოდებდნენ ხორციელი წინადაცვეთით, ანუ კაცის ხელით წინადაცვეთილნი, - "},
	{12, "12 ამ დროს ქრისტეს გარეშე იყავით, ისრაელის მოქალაქეობას მოკლებულნი, აღთქმის მცნებათათვის უცნონი, სასომიხდილნი და ამქვეყნად უღმრთოდ შთენილნი. "},
	{13, "13 ახლა კი იესო ქრისტეში, ოდესღაც მისგან შორს მყოფნი, ახლობელნი გახდით ქრისტეს სისხლით. "},
	{14, "14 რადგანაც იგია მშვიდობა ჩვენი, ერთად რომ აქცია ორი, მათ შორის აღმართული ზღუდის დამრღვევი, "},
	{15, "15 რომელმაც თავისი ხორცით გაანაქარა მტრობა, აღთქმათა რჯული კი - მოძღვრებით, რათა, მშვიდობისმყოფელს, ორისაგან ერთი ახალი კაცი შეექმნა თავის თავში, "},
	{16, "16 და ორივე ერთი სხეულით შეერიგებინა ღმერთთან ჯვრის მეშვეობით, რომელზედაც მოაკვდინა მტრობა. "},
	{17, "17 მოვიდა და მშვიდობა გახარათ ყველას - შორებელთაც და ახლობელთაც. "},
	{18, "18 რადგანაც მისი მეოხებით ორივენი ერთი სულით მივეახლებით მამას. "},
	{19, "19 ასე რომ, აღარც უცხონი ხართ და აღარც ხიზნები, არამედ წმიდათა თანამოქალაქენი და ღვთის სახლეულნი;"},
	{20, "20 მოციქულთა და წინასწარმეტყველთა საძირკველზე დაფუძნებულნი, რომლის ქვაკუთხედია თვით იესო ქრისტე, "},
	{21, "21 რომელზედაც მთელი შენობა, მწყობრად ნაგები, წმიდა ტაძრად აღიმართება უფალში, "},
	{22, "22 და რომელსაც თქვენც დაეფუძნებით, რათა იყოთ ღვთის სავანე სულით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 სწორედ ამიტომ მე, პავლე, იესო ქრისტეს ტყვედ ვიქეც თქვენთვის წარმართთა გულისთვის, "},
	{2, "2 თუკი გსმენიათ აღმშენებლობა ღვთის მადლისა, რომელიც მომეცა თქვენთვის, "},
	{3, "3 რადგანაც გამოცხადებით მეუწყა საიდუმლო, როგორც უწინ მოგწერეთ კიდეც მოკლედ;"},
	{4, "4 როცა წაიკითხავთ, შეგიძლიათ გაიგოთ, როგორ მესმის მე ქრისტეს საიდუმლო, "},
	{5, "5 რომელიც არ გამოცხადებია ადამის ძეთა სხვა თაობებს, როგორც ამჟამად გამოეცხადა სულით მის წმიდა მოციქულებსა და წინასწარმეტყველთ; "},
	{6, "6 რომ წარმართნიც, სახარების მეოხებით, თანამემკვიდრენი, თანასხეულნი და თანაზიარნი არიან მისი აღთქმისა ქრისტეში; "},
	{7, "7 სწორედ ამ სახარების მსახური გავხდი, თანახმად ღვთის მადლისა, რომელიც მომეცა მისი ძალისხმევით. "},
	{8, "8 მე, უმცირესს წმიდათა შორის, მომეცა ეს მადლი, რათა მეხარებინა წარმართთათვის წარმოუდგენელი სიმდიდრე ქრისტესი, "},
	{9, "9 და გამეცხადებინა ყველასთვის, რა არის აღმშენებლობა საიდუმლოსი, უკუნისიდან დაფარულისა ღმერთში, რომელმაც შეჰქმნა ყოველი ქრისტეს მეოხებით, "},
	{10, "10 რათა აწ ეკლესიის მეშვეობით ეუწყოს ზეციურ მთავრობათა და ხელმწიფებათ ღვთის მრავალფეროვანი სიბრძნე, "},
	{11, "11 თანახმად საუკუნო წინასწარგანჩინებისა, რომელიც აღასრულა მან ჩვენი უფლის ქრისტე იესოს მიერ, "},
	{12, "12 ვისითაც გვაქვს სიმტკიცე და სასოება მისდამი მიახლებისა რწმენით. "},
	{13, "13 ამიტომაც გევედრებით, გულს ნუ გაგიტეხთ ჩემი წუხილი თქვენს გამო, რაც არის თქვენი დიდება. "},
	{14, "14 სწორედ ამიტომ ვიყრი მუხლს ჩვენი უფლის - იესო ქრისტეს მამის წინაშე, "},
	{15, "15 ვის მიერაც იწოდება, ყოველი მამობა მიწაზეც და ცაშიც, -"},
	{16, "16 რომ თავისი დიდების სიმდიდრისამებრ მოგცეთ თქვენ ძალა, რათა მისი სულით მტკიცედ დამკვიდრდეთ შინაგან კაცში, "},
	{17, "17 და ქრისტემ რწმენის მეშვეობით დაივანოს თქვენს გულებში, "},
	{18, "18 რათა, სიყვარულით დამკვიდრებულთ და დაფუძნებულთ, ყველა წმიდასთან ერთად შეგეძლოთ სიგრძისა თუ სიგანის, სიღრმისა თუ სიმაღლის წვდომა, "},
	{19, "19 და, რაც ყოველგვარ შემეცნებას აღემატება, - შეცნობა ქრისტეს სიყვარულისა, რათა აღივსოთ ღვთის მთელი სავსებით. "},
	{20, "20 ხოლო მას, ვისაც ჩვენში მოქმედი ძალით განუზომლად მეტის ქმნა ძალუძს, ვიდრე ჩვენ ვთხოვთ, ანდა გვგონია, - "},
	{21, "21 დიდება ეკლესიაში, ქრისტე იესოსა და ყველა თაობაში, უკუნითი უკუნისამდე. ამინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 ამრიგად, შეგაგონებთ მე, ტყვე უფლისა, მოიქეცით იმ ხმობის ღირსად, რომლითაცა ხართ ხმობილნი. "},
	{2, "2 მთელი ქედმოდრეკილობით და თვინიერებით, დიდსულოვნებითა და სიყვარულით შეიწყნარეთ ერთმანეთი. "},
	{3, "3 ეცადეთ მშვიდობის საკვრელით შეინარჩუნოთ სულის ერთობა. "},
	{4, "4 ერთია ხორცი და ერთია სული, ისევე, როგორც ხმობილნი ხართ თქვენი ხმობის ერთი იმედით. "},
	{5, "5 ერთია უფალი, ერთია რწმენა, ერთია ნათლისღება. "},
	{6, "6 ერთია ღმერთი და ყოველთა მამა, ყველაზე უზენაესი, ყოვლის გამრიგე და ყველაში დავანებული. "},
	{7, "7 ხოლო თვითეულ ჩვენგანს ქრისტესმიერი ნიჭის ზომისამებრ მიეცა მადლი. "},
	{8, "8 ამიტომაც თქმულა: „ავიდა მაღლა, წამოასხა ტყვენი და საბოძვარი უბოძა ხალხს“. "},
	{9, "9 მაგრამ რას ნიშნავს „ავიდა“, თუ არა იმას, რომ უფრო უმალ ქვესკნელში უნდა ჩასულიყო? "},
	{10, "10 ჩასული კი იგივეა, რაც ყველა ცაზე მაღლა ასული, რათა აღავსოს ყოველი. "},
	{11, "11 მანვე დაადგინა ზოგი მოციქულად, ზოგი წინასწარმეტყველად, ზოგი მახარებლად, ზოგნიც მწყემსებად და მოძღვრებად. "},
	{12, "12 რათა სრულეყოთ წმიდანი მსახურების საქმისათვის - ქრისტეს სხეულის ასაშენებლად, "},
	{13, "13 ვიდრე ყველანი მივაღწევდეთ რწმენის ერთობას და ღმერთის ძის შემეცნებას სრულყოფილ კაცად, ქრისტეს ასაკის სისრულის ზომას, "},
	{14, "14 რათა აღარ ვიყოთ ბალღები, რომელთაც არყევს და იტაცებს მოძღვრების ყოველი ქარი, კაცთა ცბიერებითა და ცდუნების მზაკვრული ხერხით, "},
	{15, "15 არამედ სიყვარულით მივსდევდეთ ჭეშმარიტებას და ყოველმგრივ ვიზრდებოდეთ მასში, ვინც არის თავი - ქრისტე, "},
	{16, "16 ვის მიერაც მთელი სხეული, ურთიერთმჭიდე სახსრებით მტკიცედ შეკრული, თვითეული ასოს ზომიერი ურთიერთშეწევნით იზრდება, რათა აღეშენოს სიყვარულში. "},
	{17, "17 ამას ვამბობ და ვმოწმობ უფალში, რათა აღარ იქცეოდეთ ისე, როგორც თავიანთი გონების ამაოებით იქცევიან წარმართნი. "},
	{18, "18 გონებადაბნელებულნი და საღმრთო სიცოცხლისაგან გაუცხოებულნი, თავიანთი უმეცრებისა და გულქვაობის გამო, "},
	{19, "19 გარყვნილებას რომ მისცემიან გრძნობამიხდილნი და მზად არიან ყოველგვარი უწმინდურება ჩაიდინონ გაუმაძღრობით. "},
	{20, "20 ხოლო თქვენ ასე როდი შეგიცვნიათ ქრისტე, "},
	{21, "21 რადგანაც არა მარტო მოგისმენიათ, კიდევაც გისწავლიათ მისგან (ვინაიდან იესოშია ჭეშმარიტება), - "},
	{22, "22 განშორებოდით მაცდურ გულისთქმათაგან გახრწნილი ძველი კაცის უწინდელ ყოფას, "},
	{23, "23 განახლებულიყავით თქვენი გონების სულით "},
	{24, "24 და შეგემოსათ ახალი კაცი, ღვთის მსგავსად შექმნილი სამართლიანობითა და ჭეშმარიტების სიწმინდით. "},
	{25, "25 მაშ, განიშორეთ სიცრუე და თვითეული თქვენგანი ჭეშმარიტებას აუწყებდეს თავის მოყვასს, რადგანაც ერთმანეთის ასოები ვართ. "},
	{26, "26 მრისხანებისას ნუ სცოდავთ; ნუ ჩაესვენება მზე თქვენი რისხვით. "},
	{27, "27 ადგილს ნუ დაუთმობთ ეშმაკს. "},
	{28, "28 მპარავი ნუღარ მოიპარავს, არამედ იშრომოს და თავისი ხელით კეთილი საქმე აკეთოს, რათა შეეძლოს გაიკითხოს გაჭირვებული. "},
	{29, "29 ნურავითარი უგვანი სიტყვა ნუ დასცდება თქვენს ბაგეს, არამედ მხოლოდ კეთილიშესაგონებლად, რათა მადლი მიაგოს მსმენელთ. "},
	{30, "30 ნუ შეაჭირვებთ წმიდა სულს ღვთისას, რომლითაც აღიბეჭდეთ გამოხსნის დღისთვის. "},
	{31, "31 ყოველგვარი სიმწარე, მრისხანება, ყვირილი, გმობა შორს იყოს თქვენგან ყოველივე ბოროტთან ერთად. "},
	{32, "32 არამედ კეთილნი და ლმობიერნი იყავით ერთურთის მიმართ და მიუტევეთ ერთმანეთს, როგორც ქრისტეში მოგიტევათ თქვენ ღმერთმა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 მაშ, მიბაძეთ ღმერთს, როგორც საყვარელმა შვილებმა. "},
	{2, "2 და იარეთ სიყვარულით, როგორც შეგვიყვარა ქრისტემ და ჩვენი გულისთვის შესაწირავად და კეთილსურნელოვან მსხვერპლად მისცა თავისი თავი ღმერთს. "},
	{3, "3 ხოლო სიძვა, ყოველგვარი უწმინდურება და ანგარება საერთოდ აღარ იხსენებოდეს თქვენში, როგორც შეშვენის წმიდათ, "},
	{4, "4 არც სიბილწე, ბრიყვული სიტყვა თუ უკადრი ლიზღობა, არამედ უპირატესად - მადლიერება. "},
	{5, "5 რადგანაც იცით, რომ არც მეძავს, არც უწმინდურსა და ანგარს, რომელიც არის კერპთმსახური, არა აქვს სამკვიდრო ქრისტესა და ღვთის სასუფეველში. "},
	{6, "6 არავინ გაცდუნოთ ფუჭი სიტყვით, რადგანაც ამისთვის მოიწევა რისხვა ღვთისა ურჩობის ძეთა თავზე. "},
	{7, "7 ამიტომაც ნუ იქნებით მათი თანაზიარნი. "},
	{8, "8 რადგან ოდესღაც ბნელი იყავით, ახლა კი ნათელი ხართ უფალში. მაშ, იარეთ, როგორც ნათლის შვილებს შეშვენით. "},
	{9, "9 ვინაიდან ნათლის ნაყოფი ყოველგვარ სიკეთეშია, სამართლიანობასა და ჭეშმარიტებაში. "},
	{10, "10 გამოსცადეთ, რა შეიძლება მოსწონდეს უფალს. "},
	{11, "11 ნუ ეზიარებით ბნელის უნაყოფო საქმეს, არამედ უმეტესად ამხილეთ, "},
	{12, "12 ვინაიდან რასაც ფარულად სჩადიან ისინი, სათქმელადაც სამარცხვინოა. "},
	{13, "13 ხოლო ყოველივე მხილებული ნათლით ცხადდება, "},
	{14, "14 რადგანაც ნათელია ყოველივე გაცხადებული. ამიტომაც ითქვა: „გაიღვიძე, მძინარევ, აღსდეგ მკვდრეთით, და გაგანათლებს შენ ქრისტე“. "},
	{15, "15 მაშ, დაუკვირდით თქვენს ქცევას, არა როგორც უგუნურნი, არამედ როგორც ბრძენნი. "},
	{16, "16 გაუფრთხილდით დროს, რადგანაც უკეთურნი არიან დღენი. "},
	{17, "17 ასე რომ, ნუ იქნებით უგუნურნი, არამედ შეიცანით, რა არის ნება ღვთისა. "},
	{18, "18 ნუ დათვრებით ღვინით, საიდანაც წარმოსდგება აღვირახსნილობა, არამედ აღივსეთ სულით. "},
	{19, "19 ფსალმუნებით, საგალობლებითა და სულიერი სიმღერებით ელაპარაკეთ ერთმანეთს; თქვენი გულებით უგალობეთ და უმღერეთ უფალს. "},
	{20, "20 მარადჟამ მადლს სწირავდეთ ყველაფრისათვის ღმერთსა და მამას, ჩვენი უფლი იესო ქრისტეს სახელით. "},
	{21, "21 ქრისტეს შიშით ჰმორჩილებდეთ ერთმანეთს. "},
	{22, "22 ცოლებო, დაემორჩილეთ თქვენს ქმრებს, როგორც უფალს."},
	{23, "23 რადგანაც ქმარია ცოლის თავი, ისევე, როგორც ქრისტე თავია ეკლესიისა და თვითონვეა სხეულის მხსნელი. "},
	{24, "24 მაგრამ როგორც ეკლესია ემორჩილება ქრისტეს, ასევე ცოლებიც თავიანთ ქმრებს - ყველაფერში. "},
	{25, "25 ქმრებო, გიყვარდეთ თქვენი ცოლები, როგორც ქრისტემ შეიყვარა ეკლესია და თავი გასწირა მისთვის, "},
	{26, "26 რათა სიწმიდით შეემოსა, მას შემდეგ, რაც გაწმინდა წყლის საბანელით და სიტყვით, "},
	{27, "27 და ამრიგად განემზადებინა იგი თავის დიდებულ ეკლესიად, ყოველგვარი ნაკლის, მანკის და სხვა მისთანათა გარეშე, არამედ რათა წმიდა და უმწიკვლო ყოფილიყო. "},
	{28, "28 ქმრებს ისე უნდა უყვარდეთ თავიანთი ცოლები, როგორც საკუთარი სხეული; ვისაც ცოლი უყვარს, თავისი თავი უყვარს. "},
	{29, "29 ვინაიდან არავის არასოდეს მოსძულებია თავისი ხორცი, არამედ ისე უვლის და ასაზრდოებს, როგორც უფალი - ეკლესიას. "},
	{30, "30 რადგანაც მისი სხეულის ასოები ვართ, მისი ხორცთაგანნი და მისი ძვალთაგანნი. "},
	{31, "31 ამიტომაც მიატოვებს კაცი თავის დედ-მამას, მიეკვრის თავის ცოლს და იქნებიან ორივენი ერთ ხორც. "},
	{32, "32 ასევე ყოველ თქვენგანსაც თავისი თავივით უყვარდეს ცოლი, ხოლო ცოლს ეშინოდეს ქმრისა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ka6 poems[] = {
	{1, "1 შვილებო, დაემორჩილეთ თქვენს მშობლებს უფალში, რადგანაც ეს სამართლიანია. "},
	{2, "2 „პატივი ეცი მამას შენსას და დედას“, ესაა პირველი მცნება აღთქმით, - "},
	{3, "3 რათა სიკეთე არ მოგეშალოს და დღეგრძელი იყო ამ ქვეყნად. "},
	{4, "4 თქვენ კი, მამებო, მოთმინებიდან ნუ გამოიყვანთ შვილებს, არამედ აღზარდეთ ისინი უფლის შეგონებით და სწავლით. "},
	{5, "5 მონებო, დაემორჩილეთ თქვენს ხორციელ ბატონებს შიშით, ძრწოლით და გულის სიწრფელით, როგორც ქრისტეს; "},
	{6, "6 არა თვალთმაქცური სამსახურით, როგორც პირმოთნენი, არამედ როგორც ქრისტეს მონები, სულით რომ ასრულებენ ღვთის ნებას. "},
	{7, "7 კეთილი ნებით ჰმონებდეთ მათ, როგორც უფალს, და არა როგორც ადამიანებს. "},
	{8, "8 იცოდეთ, რომ ყველა, მონაც და თავისუფალიც, ვინც კი სიკეთეს სჩადის, საზღაურს მიიღებს უფლისგან. "},
	{9, "9 თქვენც, ბატონებო, ასევე ექცეოდეთ მონებს; დაიოკეთ სისასტიკე, გახსოვდეთ, რომ ცაშია თქვენი და მათი უფალი, ვისთვისაც უცხოა მიკერძოება. "},
	{10, "10 და ბოლოს, ძმანო, გასალკლდევდით უფლის მეოხებით და მისი ძალის სიმტკიცით. "},
	{11, "11 შეიმოსეთ ღვთის სრული საჭურველი, რათა შეგეძლოთ წინ აღუდგეთ ეშმაკის ხრიკებს,"},
	{12, "12 რადგანაც სისხლისა და ხორცის წინააღმდეგ კი არ ვიბრძვით, არამედ მთავრობათა და ხელმწიფებათა, ამ ბნელი საწუთროს მპყრობელთა და ცისქვეშეთის უკეთურ სულთა წინააღმდეგ. "},
	{13, "13 ამიტომ ხელთ იპყარით ღვთის საჭურველი, რათა უკეთურ დღეს შეგეძლოთ წინააღმდეგობა და, ყოვლის მძლეველნი, კვლავ მტკიცედ იდგეთ. "},
	{14, "14 მაშ, აღიმართეთ, ჭეშმარიტება შეირტყით წელზე და სიმართლის აბჯრით შეიმოსეთ, "},
	{15, "15 ფეხთ კი მზადყოფნა ჩაიცვით მშვიდობის სახარების საქადაგებლად. "},
	{16, "16 ამასთან, იფარეთ რწმენის ფარი, რომლითაც შესძლებთ ბოროტების ცეცხლოვან ისართა დაშრეტას, "},
	{17, "17 აიღეთ ხსნის ჩაჩქანი და სულის მახვილი, რომელიც არის ღვთის სიტყვა. "},
	{18, "18 ყოველგვარი ლოცვა-ვედრებით დღენიადაგ ილოცეთ სულით, ეცადეთ მუდამ ფხიზლად იყოთ და გულმხურვალედ ლოცულობდეთ ყველა წმიდისთვის, "},
	{19, "19 ისევე, როგორც ჩემთვის, რათა მომეცეს სიტყვა და ჩემი პირით თამამად ვიქადაგო სახარების საიდუმლო, "},
	{20, "20 რისთვისაც ვმოციქულობ ბორკილდადებული და თამამად ვლაპარაკობ, რისი თქმაც მმართებს. "},
	{21, "21 ხოლო ჩემს ამბავს დაწვრილებით გაუწყებთ ტიქიკოსი, საყვარელი ძმა და უფლის ერთგული მსახური, "},
	{22, "22 რომელიც სწორედ იმიტომ წარმოვგზავნე, რომ ჩვენი ამბავი შეეტყობინებინა და ენუგეშებინა თქვენი გულები. "},
	{23, "23 მშვიდობა ძმებს და სიყვარული რწმენითურთ, მამა ღმერთისა და უფალ იესო ქრისტესაგან. "},
	{24, "24 მადლი ყველას, ვისაც უცვლელი სიყვარულით უყვარს უფალი ჩვენი იესო ქრისტე. ამინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};