#include <map>
#include <string>
class Bible22
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
	struct ka6	{ int val; const char *msg; };
	struct ka7	{ int val; const char *msg; };
	struct ka8	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 ქებათა ქება სოლომონისა.  "},
	{2, "2 მეამბოროს თავისი ბაგეების ამბორით, რადგან ღვინოზე ტკბილია შენი ალერსი! "},
	{3, "3 სურნელოვანია შენი ნელსაცხებელი და თავად სახელი შენი დაღვრილი ნელსაცხებელია. ამის გამო უყვარხარ ქალწულებს. "},
	{4, "4 თან წარმიტაცე და ერთად გავიქცეთ. მეფემ შემიყვანა თავის პალატებში. ვიხარებდით და ვიშვებდით შენით, ვაქებდით შენს ალერსს ღვინოზე მეტად. ღირსად შეგიყვარეს შენ! "},
	{5, "5 შავი ვარ, მაგრამ მშვენიერი, ასულნო იერუსალიმისა! ვით კედარის კარავნი და ვით სოლომონის კრეტსაბმელნი. "},
	{6, "6 ნუ უყურებთ, რომ შავი ვარ, რომ მზისგანა ვარ დამწვარი. დედაჩემის ძენი შემომწყრნენ და დამადგინეს ვენახის მცველად, ჩემი ვენახი კი ვერ დავიცავი. "},
	{7, "7 მითხარი, ჩემი სულის შეყვარებულო. სად აძოვებ, სად ისვენებ შუადღის ხვატში, რომ ფუჭად არ ვიხეტიალო შენი მეგობრების ჯოგებში? "},
	{8, "8 თუ ვერ სცნობ, უმშვენიერესო ასულთა შორის, გაჰყევი ცხვრის კვალს და მწყემსთა კარვების შორიახლო აძოვე შენი თიკნები. "},
	{9, "9 ჩემს ფაშატს, ფარაონის ეტლში შეკაზმულს, გამსგავსე შენ, სატრფოვ ჩემო! "},
	{10, "10 მშენიერია შენი ღაწვები, მძივებით შემკულნი. და ყელი, მანიაკით მორთული. "},
	{11, "11 ოქროს საყურეებს გაგიკეთებთ, ვერცხლით დაწინწკლულთ. "},
	{12, "12 ვიდრემდის ინახით იჯდა მეფე, სურნელსა ფშვენდა ჩემი ნარდიონი. "},
	{13, "13 მურრის ჭურჭელი - მეტრფე ჩემი ჩემთანაა, ჩემ ძუძუთა შორის განისვენებს. "},
	{14, "14 ქოფერის მტევანია ჩემთვის ჩემი მეტრფე ენ-გადის ვენახებში. "},
	{15, "15 აჰა, მშვენიერი ხარ, სატრფოვ ჩემო, აჰა, მშვენიერი ხარ! მტრედებია შენი თვალები. "},
	{16, "16 აჰა, მშვენიერი ხარ, მეტრფევ ჩემო, და სანატრელი! ბალახია ჩვენი სარეცელი. "},
	{17, "17 სახურავი ჩვენი სახლისა ნაძვისაა, ჭერი - კვიპაროსის. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 მე ვარ ნარგიზი შარონისა და ღელეთა შროშანი. "},
	{2, "2 როგორც შროშანი ეკალთა შორის, ასეა სატრფო ჩემი ასულთა შორის! "},
	{3, "3 როგორც ხე ვაშლისა ტყიურ ხეთა შორის, ასეა მეტრფე ჩემი ჭაბუკთა შორის! მის ჩრდილში ჯდომა მიყვარდა და ვზივარ კიდეც, ნაყოფი მისი ეტკბო ჩემს სასას. "},
	{4, "4 შემიყვანა მან ღვინის სახლში და აღმართა ჩემზე სიყვარულად თავის ალამი. "},
	{5, "5 გამამაგრეთ ღვინით, გამაგრილეთ ვაშლებით, რადგან დავსნეულდი სიყვარულისგან. "},
	{6, "6 ნეტავ თავქვეშ მედოს მისი მარცხენა და მარჯვენა მეხვეოდეს მისი! "},
	{7, "7 გაფიცებთ თქვენ, ასულნო იერუსალიმისა, ველის ნიამორებს და ირმებს გაფიცებთ, არ გააღვიძოთ, არ აღძრათ სიყვარული, ვიდრემდის თავად არ ინებოს. "},
	{8, "8 აჰა, გაისმის ხმა ჩემი მეტრფისა, აჰა, მოდის იგი, მორბის მთებზე, მოხტის ბორცვებზე. "},
	{9, "9 ვამსგავსე მეტრფე ჩემი ნიამორს ანუ ირმის ნუკრს. აჰა, დგას იგი ჩვენს ზღუდის უკან, სარკმელში იჭვრიტება და ილანდება ცხაურებს შორის. "},
	{10, "10 მომიგებს მეტრფე ჩემი და მეტყვის: ადექი, სატრფოვ ჩემო, მშვენიერო ჩემო, და წამოდი! "},
	{11, "11 რადგან აჰა, მიიწურა ზამთარი, ჟამი ნიაღვრისა გრდახდა, თავისთვის წავიდა. "},
	{12, "15 ყვავილები დაჩნდნენ მიწის პირზე, ჟამი გალობისა მოიწია და ხმა გვრიტისა ისმის ჩვენს მხარეში. "},
	{13, "16 ლეღვმა გამოიღო თავისი ყვავილი, ვაზის ყვავილი სურნელებით ფშვენს. ადექი, სატრფოვ ჩემო, მშვენიერო ჩემო, და წამოდი! "},
	{14, "14 შენ, ჩემო მტრედო, შეხიზნულო ხეობის კლდეთა შორის! მიჩვენე პირი შენი, მასმინე ხმა შენი! რადგან ტკბილია ხმა შენი და პირი შენი - მშვენიერი. "},
	{15, "15 დაგვიჭირეთ პატარა მელიები, ვენახთა მომსპობი, რადგან ჰყვავის ვენახები ჩვენი. "},
	{16, "16 ჩემი მეტრფე ჩემია და მე მისი ვარ, ის მწყემსავს შროშანთა შორის! "},
	{17, "17 ვიდრეღა სუნთქავს დღე და ჩრდილნი იძვრიან, მოიქეც, ემსგავსე, მეტრფევ ჩემო, ნიამორს, ანუ ირმის ნუკრს, ნაპრალოვან მთებზე მოარულთ! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 ვეძებე ღამით ჩემს სარეცელზე ჩემი სულის შეყვარებული, ვეძებე იგი და ვერ ვიპოვე. "},
	{2, "2 ავდგები-მეთქი და მოვივლი ქალაქის ქუჩებსა და მოედნებს. მოვძებნი-მეთქი ჩემი სულის შეყვარებულს. ვეძებე იგი და ვერ ვიპოვე. "},
	{3, "3 შემომხვდნენ მცველნი, ქალაქის შემომვლელნი. ხომ არ გინახავთ ჩემი სულის შეყვარებული? "},
	{4, "4 ოდენ განვშორდი, ვიპოვე ჩემი სულის შეყვარებული; დავიჭირე იგი და აღარ გავუშვი, ვიდრე არ შევუძეღ დედაჩემის სახლში და ჩემი მშობლის გალიაკში. "},
	{5, "5 გაფიცებთ თქვენ, ასულნო იერუსალიმისა, ველის ნიამორებს და ირმებს გაფიცებთ, არ გააღვიძოთ, არ აღძრათ სიყვარული, ვიდრემდის თავად არ ინებოს! "},
	{6, "6 ვინ არის იგი, უდაბნოდან ამომავალი, ვით სვეტი კვამლისა, მურრითა და გუნდრუკით კმეული და მენელრცხებელთა ყოველი სურნელით? "},
	{7, "7 აჰა, სოლომონის სარეცელი: სამოცი ძლიერი მის გარშემოა, ძლიერთაგან ისრაელისა. "},
	{8, "8 თითოეულს მახვილი უპყრია, გაწვრთნილნი არიან საბრძოლველად, გვერდზე ჰკიდია თითოეულს მახვილი ღამეული შიშის გამო. "},
	{9, "9 ტახტრევანი გაიკეთა მეფე სოლომონმა ლიბანის ძელთაგან. "},
	{10, "10 სვეტები მისი ვერცხლისგან შექმნა. სანიდაყვენი - ოქროსაგან, საყდარი - მეწამული ქსოვილისაგან, შიგნიდან სიყვარულით მოქარგეს იერუსალიმის ასულებმა. "},
	{11, "11 გამოდით, ასულნო სიონისა, და იხილეთ მეფე სოლომონი გვირგვინითურთ, რომლითაც დედამ დააგვირგვინა იგი მისი ქორწილისა და გულის სიხარულის დღეს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 აჰა, მშვენიერი ხარ, სატრფოვ ჩემო, აჰა, მშვენიერი ხარ! შენი თვალები ორი მტრედია შენს პირბადის ქვეშ. შენი თმა არვეა თხათა, გალაადის მთიდან დაშვებული. "},
	{2, "2 შენი კბილები გაპარსული ცხვარია, საბანელით ამომავალი, თითოეული ტყუბ-ტყუბად მსხმელი და ბერწი არ არის მათ შორის. "},
	{3, "3 შენი ბაგეები ძოწის ძაფია და შენი პირი - საამური. შენი ღაწვები ბროწეულის ლებნებია შენს პირბადის ქვეშ. "},
	{4, "4 შენი ყელი დავითის გოდოლია, აგებული საჭურველთათვის. ათასი ფარი ჰკიდია მასზე, ძლევამოსილთა ყოველი ფარი. "},
	{5, "5 ორი ძუძუ შენი ორი თიკანია ნიამორისა, მარჩბივი, მძოვარი შროშანთა შორის. "},
	{6, "6 ვიდრეღა სუნთქავს დღე და იძვრიან ჩრდილები, ავალ მურრის მთაზე და გუნდრუკის ბორცვზე. "},
	{7, "7 ყოვლად მშვენიერი ხარ, სატრფოვ ჩემო, და უბიწო! "},
	{8, "8 წამო, ლიბანიდან, სძალო! წამო ლიბანიდან ჩემთან! წამოდი ამანას მწვერვალით, სენირისა და ჰერმონის მწვერვალით, ლომთა ბუნაგთაგან, ვეფხთა მთებიდან. "},
	{9, "9 შენ დაატყვევე ჩემი გული, ო, სძალო, დაო ჩემო! ერთი შეხედვით, შენი ყელსაბამის ერთი მძივით! "},
	{10, "10 რაოდენ საამოა შენი ალერსი, სძალო, დაო ჩემო! რაოდენ ტკბილია შენი ალერსი, ღვინის უმჯობესი! "},
	{11, "11 გოლი მოსწვეთს შენს ბაგეებს, სძალო! თაფლი და რძეა შენი ენის ქვეშ; შენი სამოსელის სურნელი ლიბანის სურნელია! "},
	{12, "12 ბაღი ხარ დახშული, სძალო, დაო ჩემო, ჭა დაგმანული, წყარო დაბეჭდილი. "},
	{13, "13 შენი ნარგავები ბროწეულის ბაღია, რჩეული ნაყოფებით - ქოფერითა და ნარდიონით, "},
	{14, "14 ნარდით და ზაფრანით, ლერწმით და კინამოთი, ყოველგვარი გუნდრუკის ხითურთ, მურრით და ალოეთი, ყოველგვარი რჩეული სურნელებით. "},
	{15, "15 ბაღების წყარო, ჭა ცხოველი წყლისა და ნაკადულნი, ლიბანიდან მომდინარენი. "},
	{16, "16 აღდეგ ჩრდილოდან, ქარო, მოვედ სამხრით, ქარო, მოჰბერე ბაღსა ჩემსა, დაე, სურნელებით ფშვენდნენ! მოვიდეს თავის ბაღში მეტრფე ჩემი და იგემოს მისი სანატრელი ხილი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 ჩავედი ჩემს ბაღში, სძალო, დაო ჩემო: მოვისთვლე მურრი და ჩემის სურნელებანი. ვიგემე პური ჩემი და თაფლი ჩემი, ვსვი ღვინო ჩემი და რძე ჩემი. ჭამეთ, მოყვასნო, სვით და დაითვრვნით, მეტრფენო! "},
	{2, "2 მე მძინავს, გული კი მღვიძარეა ჩემი. აჰა, მესმის ხმა ჩემი მეტრფისა, რომელიც რეკავს: გამიღე კარი, დაო ჩემო, სატრფოვ ჩემო, მტრედო ჩემო, უბიწოვ ჩემო! რადგან თავი ცვარმა ამივსო და თმები - ღამის წვეთებმა. "},
	{3, "3 გახდილი მაქვს პერანგი, როგორღა ჩავიცვა? დაბანილი მაქვს ფეხები, როგორღა დავისვარო? "},
	{4, "4 ჩემმა მეტრფემ შემოყო ხელი კარის ღრიჭოში და შემეძრა მის გამო შიგნეული. "},
	{5, "5 ავდექი, რომ გამეღო ჩემი მეტრფისათვის; ხელებიდან მწვეთავდა მურრი, თითებიდან ეწვეთებოდა მურრი კარის სახელურს. "},
	{6, "6 გავუღე კარი მეტრფეს ჩემსა, მაგრამ გაბრუნდა მეტრფე ჩემი და წავიდა. სული ჩემი ილეოდა მის ხმაზე. ვეძებდი მას და ვერ ვპოულობდი, ვუხმობდი მას, არ მესიტყვებოდა. "},
	{7, "7 შემომხვდნენ მცველნი, ქალაქის შემომვლელნი. მცემეს და დამჭრეს, მომხადეს მოსასხამი ზღუდის მცველებმა. "},
	{8, "8 გაფიცებთ თქვენ, ასულნო იერუსალიმისა, თუ ჰპოვოთ მეტრფვ ჩემი, რას ეტყვით მას? უთხარით, დავსნეულდი სიყვარულისგან. "},
	{9, "9 რითა სჯობს მეტრფე შენი სხვათა მეტრფეებს, უმშვენიერესო ასულთა შორის? რითა სჯობს მეტრფე შენი სხვათა მეტრფეებს, ასე რომ გვაფიცებ? "},
	{10, "10 თეთრ-ყირმიზია მეტრფე ჩემი, ათიათასთაგან გამორჩეული. "},
	{11, "11 თავი მისი ოქროა რჩეული, ხვეულია თმები მისი, შავია ყორანივით. "},
	{12, "12 თვალები მისი მტრედებია წყლის ნაკადულებთან, რძეში განბანილნი, ბუდეში მსხდარნი. "},
	{13, "13 ღაწვები მისი სურნელთა კვლებია, საამოდ მფშვენნი, მისი ბაგეები შროშანებია, მდინარი მურრით მწთოლარენი. "},
	{14, "14 ხელები მისი თლილი ოქროა, იაგუნდებით მოოჭვილი; მუცელი მისი გათლილი სპილოსძვალია, ლაჟვარდივით მოჭედილი. "},
	{15, "15 წვივები მისი მარმარილოს სვეტებია, ოქროს კვარცხლბეკზე დაფუძნებული; მისი პირისახე მსგავსია ლიბანისა და დიდებულია, როგორც კედარი. "},
	{16, "16 მისი სასა სიტკბოებაა, თავად კი - ყოვლად სანატრელი. ეს არის მეტრფე ჩემი, ეს არის საყვარელი ჩემი, ასულნო იერუსალიმისა! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ka6 poems[] = {
	{1, "1 სად წავიდა მეტრფე შენი, უმშვენიერესო ქალთა შორის? საით მიიქცა მეტრფე შენი? "},
	{2, "2 თავის ბაღში ჩავიდა მეტრფე ჩემი, სურნელოვან კვლებში, ბაღებში სამწყესად, შროშანთა დასაკრეფად. "},
	{3, "3 მე ჩემი მეტრფისა ვარ და ჩემია მეტრფე ჩემი, რომელიც მწყესავს შროშანთა შორის. "},
	{4, "4 მშვენიერი ხარ, სატრფოვ ჩემო, თირცასავით და სანატრელი - იერუსალიმივით! საშინელი - ბაირაღებით მორთული ბანაკივით! "},
	{5, "5 მიაქციე თვალები ჩემგან, რადგან მატყვევებენ! შენი თმები თხათა არვეა, გალაადიდან დაშვებული. "},
	{6, "6 კბილები შენი ცხვრის ფარაა, საბანელით ამომავალი; ყველანი ტყუბტყუბად მსხმელნი არიან და ბერწი არ არის მათ შორის. "},
	{7, "7 ღაწვები შენი ბროწეულის ლებნებია შენს პირბადის ქვეშ. "},
	{8, "8 სამოცი დედოფალია, ოთხმოცი ხარჭა და ურიცხვი ქალწული; "},
	{9, "9 ეს კი ერთადერთია, მტრედი ჩემი, უბიწო ჩემი; ეს ერთადერთია დედამისისთვის, გამორჩეულია მისი მშობლისათვის. იხილეს ქალწულებმა და ბედნიერად შერაცხეს იგი. "},
	{10, "10 ვინ არის იგი, ცისკარივით აღმომჭვრეტელი, მთვარისებრ მშვენიერი და მზისებრ ნათელი? და საშინელი როგორც ბაირაღებით მორთული ბანაკი? "},
	{11, "11 ჩავედი ნიგვზნარში, რომ მენახა მწვანე ჭალები; მენახა, თუ აყვავდა ვაზი, თუ გაიფურჩქნა ბროწეული. "},
	{12, "12 არ მეგონა, თუ გამიწევდა გული ჩემი ხალხის დიდებულთა ეტლებისკენ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct ka7 poems[] = {
	{1, "1 მობრუნდი, მობრუნდი, სულამით, მობრუნდი, მობრუნდი, რომ გიცქერდეთ შენ! რად უცქერით სულამითს როგორც მახანაიმის ფერხისაის? "},
	{2, "2 როგორ გამშვენდნენ შენი ფეხები შენს ხამლებში: ზეპურო ასულო! თეძოთა სიმრგვალე მანიაკს გიგავს, შექმნილს ხელოვანის ხელით. "},
	{3, "3 შენი ჭიპი მრგვალი თასია, ღვინისაგან მოუკლებელი; შენი მუცელი ხორბლის ხვავია, შროშანთაგან გრემოცული. "},
	{4, "4 ორი ძუძუ შენი ორი თიკანია ნიამორისა. მარჩბივნი. "},
	{5, "5 შენი ყელი სპილოსძვლის გოდოლია; შენი თვალები ხეშბონის ტბორებია ბათ-რაბიმის კარიბჭეებთან; შენი ცხვირი ლიბანის გოდოლია, დამასკოს მიმართ მიქცეული. "},
	{6, "6 შენი თავი ქარმელის მთაა და ნათხზენი შენს თავზე სმეფო ძოწეული, კავებით შეკრული. "},
	{7, "7 რა მშვენიერი ხარ, რა სანატრელი, საყვარელო, მენი სიტკბოებით! "},
	{8, "8 შენი ტანი ფინიკის ხეა, შენი ძუძუნი - ვაზის მტევნები. "},
	{9, "9 ვთქვი: ავალ ფინიკზე და მის რტოებს მოვეჭიდები; შენი ძუძუნი იქნებოდნენ ვით ვაზის მტევნები და შენი ნესტოების სურნელი ვით ვაშლის სურნელი. "},
	{10, "10 შენი სასარჩეული ღვინოა, ჩემი მეტრფისკენ მიღვარული, მძინარეთა ბაგეების დამატკბობელი. "},
	{11, "11 მე ჩემი მეტრფისა ვარ და ჩემკენ მოილტვის ისიც. "},
	{12, "12 მოდი, მეტრფევ ჩემო, გავიდეთ ველად, სოფლებში ვათიოთ ღამე; "},
	{13, "13 ავდგებოდით დილით სისხამზე ვენახთა მოსახილვად; ვნახავდით, თუ ყვავის ვაზი, თუ იშლება ვაზის კვირტები, თუ ყვავის ბროწეული; ჩემს ალერსს იქ მოგცემდი. "},
	{14, "14 სურნელებით ფშვიან მანდრაგორები, ყოველგვარი ხილია ჩვენი კარის წინ - ახალი და ძველი. შენთვის მაქვს შენახული, მეტრფევ ჩემო. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct ka8 poems[] = {
	{1, "1 ნეტავ ჩემი ძმა ყოფილიყავი, დედაჩემის ძუძუნაწოვი! გარეთ გიპოვნიდი, გაკოცებდი და არ დამძრახავდნენ. "},
	{2, "2 წაგიძღვებოდი და, ვინც გამზარდა, დედაჩემის სახლში შეგიყვანდი, სურნელოვან ღვინოს - ჩემი ბროწეულის წვენს შეგასმევდი. "},
	{3, "3 მისი მარცხენა ჩემს თავქვეშ იქნებოდა, მარჯვენა მომეხვეოდა მისი! "},
	{4, "4 გაფიცებთ თქვენ, ასულნო იერუსალიმისა, არ გააღვიძოთ, არ აღძრათ სიყვარული, ვიდრემდის თავად არ ინებოს! "},
	{5, "5 ვინ არის იგი, უდაბნოდან ამომავალი, თავისი მეტრფის მხარს დაყრდნობილი? ვაშლის ხის ქვეშ გაგაღვიძე შენ. იქ გშვა დედამ შენმა, იქ გშვა მშობელმა შენმა. "},
	{6, "6 დამდევდი, როგორც ბეჭედი შენს მკერდზე, როგორც ბეჭედი შენს მკლავზე; რადგან ძლიერია სიკვდილივით სიყვარული, სასტიკია ჯოჯოხეთივით შური; არმური მისი ცეცხლის არმურია, უფლის ალი. "},
	{7, "7 ვერ დაშრეტს სიყვარულს წყალი მრავალი და მდინარე ვერ წარხოცავს მას. კიდეც რომ გასცეს კაცმა სახლის მთელი დოვლათი სიყვარულის წილ, მაინც არ ასცდება სიძულვილი. "},
	{8, "8 პატარაა დაი ჩვენი და ჯერ არ დამჩნევია ძუძუები. რა ვუყოთ ჩვენს დას იმ დღეს, როცა დაუდგება ნიშნობის ჟამი? "},
	{9, "9 ზღუდე რომ იყოს, ვერცხლის ქონგურებს დავუშენებდით; კარი რომ იყოს, ნაძვის ფიცრებს მივუდგამდით. "},
	{10, "10 მე ზღუდე ვარ და გოდლებივით მაქვს ძუძუები. ახლა კი მოწიფული ვჩანვარ მის თვალში. "},
	{11, "11 ჰქონდა ბაალ-ჰამონში ვენახი ხოლომონს და ჩააბარა მცველებს ვენახი. თითოეულს ათასი მოჰქონდა ვერცხლი ყურძნის სანაცვლოდ. "},
	{12, "12 ჩემი ვენახი კი ჩემს წინაშეა. ათასი შენია, სოლომონ, ორასი - ნაყოფთა მცველების. "},
	{13, "13 ბაღების მკვიდრო, მეგობრები ისმენენ შენს ხმას - მასმინე მეცა! "},
	{14, "14 გაიქეცი, მეტრფევ ჩემო! ემსგავსე ნიამორს ანუ ირმის ნუკრს, სურნელოვან მთებზე მოარულთ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};