#include <map>
#include <string>
class Bible48
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 რომელიც იყო დასაბამიდან, რომელიც ვისმინეთ და ჩვენი თვალით ვიხილეთ, რომელსაც ვჭვრეტდით და ჩვენი ხელით ვეხებოდით სიცოცხლის სიტყვას; "},
	{2, "2 (რადგან სიცოცხლე ცხად იქმნა, რაც ვიხილეთ და ვმოწმობთ, და გაუწყებთ საუკუნო სიცოცხლეს, რომელიც იყო მამასთან და გამოგვეცხადა ჩვენ). "},
	{3, "3 რაც ვისმინეთ და ვიხილეთ, იმას გაუწყებთ, რათა თქვენც ეზიაროთ ჩვენთან ერთად, ხოლო ჩვენ ვეზიარებით მამას და ძეს მისას - იესო ქრისტეს. "},
	{4, "4 ამას გწერთ, რათა სრულ იყოს თქვენი სიხარული. "},
	{5, "5 ეს არის აღთქმა, რომელიც ვისმინეთ მისგან, და გაუწყებთ თქვენ, რომ ღმერთი არის ნათელი და არ არის მასში არავითარი ბნელი. "},
	{6, "6 თუ ვამბობთ, მას ვეზიარებითო და ბნელში კი დავდივართ, ვცრუობთ და არ ვიქცევით ჭეშმარიტების თანახმად. "},
	{7, "7 ხოლო თუ ნათელში დავდივართ, როგორც თვითონვეა ნათელში, მაშინ ერთმანეთს ვეზიარებით და მისი ძის - იესო ქრისტეს სისხლი ყოველგვარი ცოდვისგან გაგვწმენდს. "},
	{8, "8 თუ ვამბობთ, რომ არა გვაქვს ცოდვა, თავს ვიტყუებთ და ჭეშმარიტება არ არის ჩვენში. "},
	{9, "9 თუ ვაღიარებთ ჩვენს ცოდვებს, მაშინ ის, სანდო და მართალი, მოგვიტევებს ცოდვებს და გაგვწმენდს ყოველგვარი უსამართლობისაგან. "},
	{10, "10 თუ ვიტყვით, რომ არ შეგვიცოდავს, ცრუდ ვსახავთ მას და მისი სიტყვა არ არის ჩვენში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 შვილნო ჩემნო, ამას გწერთ, რათა არ სცოდოთ, ხოლო თუ ვინმე შესცოდავს, ქომაგი გვყავს მამის წინაშე - იესო ქრისტე მართალი. "},
	{2, "2 ის არის ჩვენი და არა მარტო ჩვენი, არამედ მთელი ქვეყნის ცოდვათა მიმტევებელი. "},
	{3, "3 იმით გავიგებთ, რომ შევიცნეთ იგი, თუ დავიმარხავთ მის მცნებებს. "},
	{4, "4 ვინც ამბობს, რომ შეიცნო იგი, მაგრამ არ იმარხავს მის მცნებებს, ცრუა და ჭეშმარიტება არ არის მასში. "},
	{5, "5 ხოლო ვინც იმარხავს მის სიტყვას, მასში ჭეშმარიტად აღსრულებულა ღვთის სიყვარული; ამით შევიცნობთ, რომ მასში ვართ. "},
	{6, "6 ვინც ამბობს, რომ მასში რჩება, ისე უნდა იაროს, როგორც იარებოდა იგი. "},
	{7, "7 საყვარელნო, ახალ მცნებას კი არა გწერთ, არამედ ძველ მცნებას, რომელიც გქონდათ დასაბამიდან; ძველი მცნება არის სიტყვა, დასაბამიდან რომ ისმინეთ. "},
	{8, "8 თუმცა ახალ მცნებასაც გწერთ, რომელიც ჭეშმარიტია მასშიც და თქვენშიც; ვინაიდან ბნელი გადადის და ჭეშმარიტი ნათელი უკვე ნათობს. "},
	{9, "9 ვინც ამბობს, ნათელში ვარო, მაგრამ თავისი ძმა სძულს, ბნელშია დღემდე. "},
	{10, "10 ვისაც თავისი ძმა უყვარს, ნათელში მკვიდრობს და საცთური არ არის მასში. "},
	{11, "11 ხოლო ვისაც თავისი ძმა სძულს, ბნელშია, ბნელშივე იარება და არ იცის, საით მიდის, რადგანაც ბნელმა დაუვსო თვალი. "},
	{12, "12 ამას გწერთ, შვილნო, ვინაიდან მისი სახელით მოგეტევათ თქვენი ცოდვანი. "},
	{13, "13 ამას გწერთ, მამანო, ვინაიდან შეიცანით დასაბამიდან მყოფი. ამას გწერთ, ჭაბუკნო, ვინაიდან სძლიეთ ბოროტი. "},
	{14, "14 ეს მოგწერეთ, ყრმანო, რადგანაც შეიცანით მამა. ეს მოგწერეთ, მამანო, რადგანაც შეიცანით დასაბამიდან მყოფი. ეს მოგწერეთ, ჭაბუკნო, რადგანაც ძლიერნი ხართ, ღვთის სიტყვა მკვიდრობს თქვენში და სძლიეთ ბოროტი. "},
	{15, "15 ნუ შეიყვარებთ ამ ქვეყანას, ნურც ამქვეყნიურს რასმე; ვისაც ეს ქვეყანა უყვარს, მამის სიყვარული არ არის მასში. "},
	{16, "16 ვინაიდან ამ ქვეყნად ყველაფერი - გულისთქმა ხორცის, გულისთქმა თვალის და სიამაყე არსებობისა, მამისგან კი არა, ამ ქვეყნისაგან არის. "},
	{17, "17 ეს ქვეყანაც გარდავა და მისი გულისთქმაც, ღვთის ნებისმყოფელი კი წარუვალია უკუნისამდე. "},
	{18, "18 ყრმანო, უკანასკნელი ჟამია, და, როგორც გსმენიათ, რომ მოდის ანტიქრისტე, აწ უკვე მრავლად არიან ანტიქრისტენი, საიდანაც ვიგებთ, რომ უკანასკნელი ჟამია. "},
	{19, "19 ჩვენგან გამოვიდნენ, მაგრამ არ იყვნენ ჩვენგანნი, ვინაიდან ჩვენგანნი რომ ყოფილიყვნენ, ჩვენთანვე დარჩებოდნენ; მაგრამ გამოვიდნენ, რათა ცხადი გამხდარიაო, რომ ყველანი როდი არიან ჩვენგანნი. "},
	{20, "20 თქვენ კი ცხება გაქვთ წმიდისგან და იცით ყოველი. "},
	{21, "21 იმიტომ კი არ მოგწერეთ, რომ არ იცით ჭეშმარიტება, არამედ იმიტომ, რომ იცით და ისიც გესმით, რომ არცერთი სიცრუე ჭეშმარიტებისგან არ არის. "},
	{22, "22 ვინ არის ცრუ, გარდა იმისა, ვინც უარყოფს, რომ იესო არის ქრისტე? ისაა ანტიქრისტე, მამის და ძის უარმყოფელი. "},
	{23, "23 ვინც უარყოფს ძეს, აღარც მამა ჰყავს, ხოლო ვინც აღიარებს ძეს, მამაცა ჰყავს. "},
	{24, "24 ამრიგად, რაც დასაბამიდან გსმენიათ, დე, დარჩეს თქვენში, რადგან თუ ის, რაც დასაბამიდან გსმენიათ, დარჩება თქვენში, თქვენც დარჩებით ძეში და მამაში. "},
	{25, "25 ხოლო აღთქმა, რომელიც მან აღგვითქვა, არის საუკუნო სიცოცხლე. "},
	{26, "26 თქვენი მაცთუნებლების გამო მოგწერეთ ეს. "},
	{27, "27 თუმცა ცხება, რომელიც მისგან მიიღეთ, კვლავაც თქვენშია, და არ გჭირდებათ, რომ ვინმემ გასწავლოთ, რადგანაც ცხება, ჭეშმარიტი და არა ყალბი, თვითონვე გასწავლით ყველაფერს, ამიტომ რასაც გასწავლით, მასშივე დარჩით. "},
	{28, "28 ასე რომ, შვილებო, დარჩით მასში, რათა მისი გამოცხადებისას თამამად ვიყოთ და არ შევრცხვეთ მის წინაშე, როდესაც მოვა. "},
	{29, "29 თუკი იცით, რომ მართალია, ისიც იცოდეთ, რომ მის მიერაა შობილი სიმართლის ყველა მოქმედი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 ნახეთ, როგორი სიყვარული მოგვცა მამამ, რათა ღვთის შვილებად ვიწოდებოდეთ: ქვეყანა იმიტომ არ გვიცნობს, რომ ვერ იცნო იგი. "},
	{2, "2 საყვარელნო, ამიერიდან ღვთის შვილები ვართ, მაგრამ ჯერ არ გამჟღავნებულა, რანი ვიქნებით. ვიცით მხოლოდ, რომ, როცა გამომჟღავნდება, მისივე მსგავსნი ვიქნებით, რადგანაც ვიხილავთ მას, როგორიც არის. "},
	{3, "3 ყველამ, ვისაც ასე ეიმედება იგი, თავი განიწმიდოს, როგორც ისაა წმიდა. "},
	{4, "4 ცოდვის ყოველი ჩამდენი ურჯულოებასაც სჩადის, და ცოდვა არის ურჯულოება. "},
	{5, "5 თქვენ იცით, რომ იმიტომ გამოჩნდა იგი, რათა ეტვირთა ჩვენი ცოდვები, და რომ მასში არ არის ცოდვა. "},
	{6, "6 არცერთ მათგანს, ვინც მკვიდრობს მასში, არ შეუცოდავს: არცერთ შემცოდეს არ უხილავს და არ შეუცვნია იგი. "},
	{7, "7 შვილებო, ნურავინ გაცთუნებთ; სიმართლის მოქმედი მართალია, როგორც ის არის მართალი. "},
	{8, "8 ცოდვის ჩამდენი ეშმაკისაგან არის, რადგანაც დასაბამიდან ეშმაკი სცოდავს; მიტომაც მოგვევლინა ძე ღვთისა, რომ დაერღვია ეშმაკის საქმენი. "},
	{9, "9 ღვთისაგან შობილი არავინ სცოდავს, ვინაიდან მასში რჩება ღვთიური თესლი, და არ შეუძლია სცოდოს, რადგანაც ღვთისაგან არის შობილი. "},
	{10, "10 ამით იცნობიან ღვთის შვილნი და ეშმაკის შვილნი: ვინც არ იქმს სიმართლეს და ვისაც არ უყვარს თავისი ძმა, ღვთისაგან არ არის იგი. "},
	{11, "11 რადგანაც ეს არის უწყება, რომელიც გსმენიათ დასაბამიდან, რათა გვიყვარდეს ერთმანეთი. "},
	{12, "12 ისე კი არა, როგორც კაენს, რომელიც ბოროტისაგან იყო და მოკლა თავისი ძმა; მერედა, რისთვის მოკლა? იმიტომ, რომ ბოროტი იყო მისი საქმე, ხოლო მისი ძმისა - მართალი. "},
	{13, "13 ნუ გიკვირთ, ძმანო, თუ ქვეყანას სძულხართ. "},
	{14, "14 ჩვენ ვიცით, რომ სიკვდილიდან გადავედით სიცოცხლეში, რადგანაც გვიყვარს ძმები; ვისაც არ უყვარს, სიკვდილში რჩება. "},
	{15, "15 ყველა, ვისაც სძულს თავისი ძმა, კაცისმკვლელია; თქვენ კი იცით, რომ არცერთ კაცისმკვლელს არ აქვს საუკუნო სიცოცხლე, თვით მასშივე დამკვიდრებული. "},
	{16, "16 იმით შევიცანით სიყვარული, რომ მან თავისი სული დადო ჩვენთვის; ჩვენც გვმართებს ძმებისათვის სულის დადება. "},
	{17, "17 ვისაც სიმდიდრე არ აკლია ამ ქვეყნად, მაგრამ გაჭირვებული ძმის შემყურე გულს იხშობს მისთვის, როგორღა დაემკვიდრება მასში ღვთის სიყვარული? "},
	{18, "18 შვილებო, გვიყვარდეს, მაგრამ არა სიტყვით და ენით, არამედ საქმითა და ჭეშმარიტებით. "},
	{19, "19 ამით შევიცნობთ, რომ ჭეშმარიტებისაგან ვართ და მის წინაშე დავიმშვიდებთ გულს. "},
	{20, "20 რადგან თუ ჩვენი გული გვგმობს, ღმერთი ხომ გულზე უმეტესია და იცის ყოველი. "},
	{21, "21 საყვარელნო, თუ ჩვენი გული არა გვგმობს, პირნათელნი ვართ ღვთის წინაშე. "},
	{22, "22 ამიტომ, რასაც ვითხოვთ, მივიღებთ მისგან, ვინაიდან ვიმარხავთ მის მცნებებს და ისე ვიქცევით, როგორც მას მოსწონს. "},
	{23, "23 მისი მცნება კი ისაა, რომ გვწამდეს მისი ძის იესო ქრისტეს სახელით და, როგორც გვამცნო, გვიყვარდეს ერთმანეთი. "},
	{24, "24 თუ ვიმარხავთ მის მცნებებს, ის ჩვენში რჩება, ჩვენ კი - მასში; ხოლო იმას, რომ ჩვენში რჩება, მის მიერვე მოცემული სულით შევიცნობთ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 საყვარელნო, ყველა სულს ნუკი ენდობით, არამედ გამოსცადეთ, ღვთისაგან არიან თუ არა, რადგანაც მომრავლდნენ ცრუწინასწარმეტყველნი ქვეყნად. "},
	{2, "2 ამით იცნობთ ღვთის სულს: ყოველი სული, რომელიც აღიარებს იესო ქრისტეს, ხორციელად მოსულს, ღვთისაგან არის. "},
	{3, "3 ხოლო ყოველი სული, რომელიც არ აღიარებს იესო ქრისტეს, ღვთისაგან კი არ არის, არამედ ესაა სული ანტიქრისტესი, ვისზედაც გსმენიათ, მოვაო, და მოვიდა კიდეც ქვეყნად. "},
	{4, "4 თქვენ ღვთისაგან ხართ, შვილებო, და სძლიეთ მათ, რადგანაც ის, ვინც თქვენშია, მეტია იმაზე, ვინც არის ქვეყნად. "},
	{5, "5 ისინი ქვეყნისანი არიან, ამიტომ ქვეყნისას იტყვიან და ქვეყანაც უსმენს მათ. "},
	{6, "6 ჩვენ კი ღვთისაგან ვართ; ვინც იცნობს ღმერთს, ის გვისმენს, ხოლო ვინც ღვთისაგან არ არის, არ გვისმენს ჩვენ. ამით შევიცნობთ სულს ჭეშმარიტებისას და სულს ცთომისას. "},
	{7, "7 საყვარელნო, გვიყვარდეს ერთმანეთი, რადგანაც სიყვარული ღვთისაგან არის; ვისაც უყვარს, ღვთისგანაა შობილი და იცნობს ღმერთს. "},
	{8, "8 ვისაც არ უყვარს, ვერ შეუცვნია ღმერთი, რადგანაც ღმერთი სიყვარულია. "},
	{9, "9 ღვთის სიყვარული იმით გამოგვეცხადა, რომ ღმერთმა თავისი მხოლოდშობილი ძე მოავლინა ამ ქვეყნად, რათა მისი წყალობით ვცხონდეთ. "},
	{10, "10 სიყვარული ისაა, რომ ჩვენ კი არ შევიყვარეთ ღმერთი, არამედ მან შეგვიყვარა ჩვენ, და მოავლინა თავისი ძე ჩვენი ცოდვების მალხინებლად. "},
	{11, "11 საყვარელნო, თუკი ასე შეგვიყვარა ღმერთმა, ჩვენც უნდა გვიყვარდეს ერთმანეთი. "},
	{12, "12 ღმერთი არავის არასოდეს უხილავს; თუ ერთმანეთი გვიყვარს, ღმერთი ჩვენში მკვიდრობს და მისი სიყვარული სრულყოფილებას აღწევს ჩვენში. "},
	{13, "13 იმით შევიცნობთ, რომ მასში ვმკვიდრობთ, ხოლო ის - ჩვენში, რომ თავისი სულისაგან მოგვცა ჩვენ. "},
	{14, "14 ჩვენ ვიხილეთ და ვმოწმობთ, რომ მამამ მოავლინა ძე ქვეყნის მაცხოვრად. "},
	{15, "15 ვინც აღიარებს, რომ იესო არის ძე ღვთისა, ღმერთი მასში მკვიდრობს, ხოლო ის - ღმერთში. "},
	{16, "16 ჩვენ შევიცნეთ და ვიწამეთ სიყვარული, რომელიც აქვს ღმერთს ჩვენდამი. ღმერთი სიყვარულია და სიყვარულის მკვიდრი ღმერთში მკვიდრობს, ღმერთი კი - მასში. "},
	{17, "17 ამის წყალობით სიყვარულმა იმნაირ სრულყოფილებას მიაღწია ჩვენში (რათა გულდანდობილნი ვიყოთ განკითხვის დღეს), რომ ისეთივენი ვართ, როგორიც ისაა ამ ქვეყნად. "},
	{18, "18 სიყვარულისთვის უცხოა შიში, რადგანაც სრულქმნილი სიყვარული აძევებს შიშს; ვინაიდან შიშს თან ახლავს ტანჯვა,ხოლო მოშიში არასრულქმნილია სიყვარულში. "},
	{19, "19 ჩვენ გვიყვარს იმიტომ, რომ პირველად მან შეგვიყვარა. "},
	{20, "20 თუ ვინმე ამბობს, ღმერთი მიყვარსო, თავისი ძმა კი სძულს ცრუა, ვინაიდან თუ თავისი ძმა არ უყვარს, რომელსაც ხედავს როგორღა შეიყვარებს ღმერთს რომელსაც ვერ ხედავს? "},
	{21, "21 და ასეთი მცნება გვაქვს მისგან: ვისაც ღმერთი უყვარს თავისი ძმაც უნდა უყვარდეს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 ყველა, ვისაც სწამს, რომ იესო არის ქრისტე, ღვთისაგანაა შობილი, და ყველას, ვისაც უყვარს მშობელი, მის მიერ შობილიც უყვარს. "},
	{2, "2 იმით შევიცნობთ, რომ გვიყვარს ღვთის შვილნი, თუ გვიყვარს ღმერთი და ვიმარხავთ მის მცნებებს. "},
	{3, "3 ვინაიდან ღვთის სიყვარული ისაა, რომ ვიმარხავდეთ მის მცნებებს; მისი მცნებები კი მძიმე როდია. "},
	{4, "4 რადგანაც ყველა, ვინც ღვთისაგან არის შობილი, სძლევს ამ ქვეყანას; და ეს არის ძლევა, ქვეყნის მძლეველი: ჩვენი რწმენა. "},
	{5, "5 ვინ არის ქვეყნის მძლეველი, თუ არა ის, ვისაც სწამს, რომ იესო არის ძე ღვთისა? "},
	{6, "6 ეს არის იესო ქრისტე, რომელიც მოვიდა წყლითა და სისხლით; არა მარტო წყლით, არამედ წყლითა და სისხლით; და ამას მოწმობს სული, რადგანაც სულია ჭეშმარიტება. "},
	{7, "7 ვინაიდან სამნი მოწმობენ ზეცად: მამა, სიტყვა და სული წმიდა, ხოლო ეს სამი ერთია. "},
	{8, "8 და სამნი მოწმობენ ქვეყნად: სული, წყალი და სისხლი, ხოლო ეს სამი ერთია. "},
	{9, "9 თუ კაცთა მოწმობას ვიღებთ, ღვთის მოწმობა უმეტესია, რადგანაც ეს არის საღმრთო მოწმობა, რომლითაც ღმერთმა გვიმოწმა თავისი ძე. "},
	{10, "10 ვისაც სწამს ძე ღვთისა, თავის თავშივე აქვს მოწმობა; ვისაც არა სწამს ღმერთი, ცრუდ სახავს მას, ვინაიდან არა სწამს მოწმობა, რომლითაც ღმერთმა გვიმოწმა თავისი ძე. "},
	{11, "11 მოწმობა კი ის არის, რომ ღმერთმა მოგვცა საუკუნო სიცოცხლე, და ეს სიცოცხლე მის ძეშია. "},
	{12, "12 ვისაც ჰყავს ძე, სიცოცხლე აქვს; ვისაც არა ჰყავს ძე ღვთისა, არც სიცოცხლე აქვს. "},
	{13, "13 ეს მოგწერეთ, ღვთის ძის სახელის მორწმუნენო, რათა იცოდეთ, რომ გაქვთ საუკუნო სიცოცხლე. "},
	{14, "14 და ისეთი კადნიერნი ვართ მის მიმართ, რომ, თუ ისე ვთხოვთ რამეს, როგორც მას ნებავს, კიდევაც გვისმენს. "},
	{15, "15 და რაკი ვიცით, რომ რაც უნდა ვთხოვოთ, შეისმენს ჩვენსას, ისიც ვიცით, რომ გვექნება ყველაფერი, რაც ვთხოვეთ. "},
	{16, "16 თუ ვინმე ხედავს, რომ მისი ძმა სცოდავს, მაგრამ ეს არ არის ცოდვა, რომელსაც სიკვდილი მოსდევს, ილოცოს და ღმერთი მისცემს სიცოცხლეს არამომაკვდინებელი ცოდვით შემცოდეს; არის მომაკვდინებელი ცოდვაც; მასზე როდი ვამბობ, ილოცოს-მეთქი. "},
	{17, "17 ყოველგვარი უსამართლობა ცოდვაა, მაგრამ ყოველი ცოდვა როდია მომაკვდინებელი. "},
	{18, "18 ვიცით, რომ ღვთის მიერ შობილთაგან არავინ სცოდავს, რადგანაც ღვთის მხოლოდშობილი ძე იცავს და ბოროტი ვერ ეხება მას. "},
	{19, "19 ვიცით, რომ ღვთისაგან ვართ, და მთელი ქვეყანა ბოროტებაშია დანთქმული. "},
	{20, "20 ისიც ვიცით, რომ მოვიდა ძე ღვთისა და მოგვცა გონება, რათა შევიცნოთ ჭეშმარიტება და ვიყოთ ჭეშმარიტში, რომელიც არის ძე ღვთისა იესო ქრისტე: ჭეშმარიტი ღმერთი და საუკუნო სიცოცხლე. "},
	{21, "21 შვილებო, დაიცავით თავი კერპთაგან. ამინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};