#include <map>
#include <string>
class Bible54
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
	struct ka6	{ int val; const char *msg; };
	struct ka7	{ int val; const char *msg; };
	struct ka8	{ int val; const char *msg; };
	struct ka9	{ int val; const char *msg; };
	struct ka10	{ int val; const char *msg; };
	struct ka11	{ int val; const char *msg; };
	struct ka12	{ int val; const char *msg; };
	struct ka13	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 პავლე, ღვთის ნებით მოციქული იესო ქრისტესი, და ძმა ტიმოთე - ღვთის ეკლესიას, რომელიც არის კორინთოში, მთელს აქაიაში მყოფ ყველა წმიდასთან ერთად: "},
	{2, "2 მადლი თქვენდა და მშვიდობა ჩვენი მამა ღმერთისა და უფალ იესო ქრისტესაგან. "},
	{3, "3 კურთხეულია ღმერთი და მამა ჩვენი უფლის იესო ქრისტესი, მამა მოწყალებისა და ღმერთი ყოველგვარი ნუგეშისა, "},
	{4, "4 ყოველნაირ გასაჭირში რომ გვანუგეშებს, რათა ჩვენც შეგვეძლოს ვანუგეშოთ ყოველი გაჭირვებული იმ ნუგეშით, რომლითაც გვანუგეშებს ღმერთი. "},
	{5, "5 ვინაიდან როგორც ქრისტეს ვნებანი მრავლდებიან ჩვენში, მრავლდება ქრისტეს მიერ ჩვენი ნუგეშიც. "},
	{6, "6 რადგან, თუ გვიჭირს, თქვენი ნუგეშისა და ხსნისათვის გვიჭირს, ხოლო თუ ვინუგეშებით, ისევ თქვენივე ნუგეშისათვის, რათა შეგაძლებინოთ იმავე ტანჯვის ატანა, რასაც ჩვენ ვიტანთ. "},
	{7, "7 მტკიცეა ჩვენი იმედი თქვენს მიმართ, რადგანაც ვიცით, რომ არა მარტო ჩვენი ტანჯვის თანამოზიარენი ხართ, არამედ ნუგეშისაც. "},
	{8, "8 ამიტომ გვინდა იცოდეთ, ძმანო, რა საშინლად გაგვიჭირდა ასიაში, ისე, რომ ლამის სიცოცხლეც კი აუტანელი გაგვიხდა. "},
	{9, "9 მაგრამ თვითონვე გამოვუტანეთ ჩვენს თავს სასიკვდილო განაჩენი, რათა ჩვენი თავის იმედი კი აღარ გვქონდა, არამედ ღვთისა, რომელიც აღადგენს მკვდრებს; "},
	{10, "10 სწორედ მან გვიხსნა ამნაირი სიკვდილისაგან, ახლაც გვიხსნის და იმედი გვაქვს, რომ კვლავ დაგვიხსნის; "},
	{11, "11 რაშიაც თქვენც შეგვეწევით თქვენი ლოცვებით, რათა ამდენი ხალხის მეოხებით მიღებული მადლისათვის მრავალმა მოგვაგოს მადლი. "},
	{12, "12 რადგანაც ჩვენი სიქადული ისაა, რასაც გვიმოწმებს ჩვენი სინიდისი, რომ სიწრფელითა და საღმრთო სიწმიდით, ხორციელი სიბრძნით კი არა, არამედ ღვთის მადლით ვცხოვრობდით ამ ქვეყნად, მით უმეტეს, თქვენს შორის. "},
	{13, "13 სხვა რამეს კი არა გწერთ, არამედ იმას, რასაც კითხულობთ ან იმეცნებთ და, იმედი მაქვს, ბოლომდე შეიმეცნებთ."},
	{14, "14 ისევე, როგორც ნაწილობრივ უკვე შეიცნეთ, რომ ჩვენ თქვენი სიქადული ვართ, ხოლო თქვენ - ჩვენი, უფალ იესოს დღეს. "},
	{15, "15 ამაში დარწმუნებული ჯერ თქვენთან ვაპირებდი მოსვლას, რათა მეორედაც მიგეღოთ მადლი; "},
	{16, "16 თქვენგან კი მაკედონიაში წავსულიყავი, ხოლო მაკედონიიდან კვლავ გწვეოდით, რათა იუდეაში გაგეცილებინეთ. "},
	{17, "17 ამის მოსურნე ცოტა ხომ არ ავმჩატდი? ან, იქნებ, რასაც ვფიქრობ, ხორციელად ვფიქრობ, რათა ერთდროულად მქონდეს „ჰო-ჰოც“ და „არა-არაც“? "},
	{18, "18 მაგრამ ღმერთია მოწმე, რომ ჩვენი სიტყვა თქვენს მიმართ არ ყოფილა ხან „ჰო“ და ხან „არა“. "},
	{19, "19 რადგანაც ძე ღვთისა, იესო ქრისტე, რომელსაც თქვენს შორის ვქადაგებდით მე, სილვანუსი და ტიმოთე, არ ყოფილა „ჰოც“ და „არაც“, არამედ მხოლოდ „ჰო“ იყო მასში. "},
	{20, "20 ვინაიდან ღმერთის ყოველი აღთქმა „ჰოა“ მასში და „ამინია“ მასში, ღვთის სადიდებლად ჩვენს მიერ. "},
	{21, "21 ხოლო ვინც თქვენთან ერთად განგვამტკიცა ქრისტეში და ცხებულნი გვყო, ეს არის ღმერთი, "},
	{22, "22 რომელმაც ასევე აღვგბეჭდა და მოგვცა წინდი სულისა ჩვენს გულებში. "},
	{23, "23 და მე ღმერთს ვუხმობ ჩემი სულის მოწმედ, რომ გინდობდით და ამიტომ დღემდე არ მოვსულვარ კორინთოში; "},
	{24, "24 იმიტომ კი არა, რომ თქვენს რწმენაზე ვიუფლოთ, არამედ იმიტომ, რომ ხელს ვუწყობთ თქვენს სიხარულს, რადგანაც რწმენითა დგახართ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 ამიტომაც გადავწყვიტე, დამწუხრებული აღარ მოვსულიყავი თქვენთან. "},
	{2, "2 რადგანაც თუ მე გამწუხრებთ, მაშ, ვინღა გამახარებს, თუ არა ის, ვინც ჩემს მიერ წუხს? "},
	{3, "3 სწორედ ეს მოგწერეთ, რათა ჩემი მოსვლისას აღარა მქონდეს წუხილი მათგან, ვის მიერაც უნდა მეხარა; რადგანაც ყველას გიცნობთ და დარწმუნებული ვარ, რომ ჩემი სიხარული ყოველი თქვენგანის სიხარულია. "},
	{4, "4 ვინაიდან ესოდენ დიდი მწუხარებით, გულისტკივილითა და ცრემლების ფრქვევით იმიტომ კი არ გწერდით, რომ დამემწუხრებინეთ, არამედ იმიტომ, რომ გეგრძნოთ, რა უსაზღვროა ჩემი სიყვარული თქვენდამი. "},
	{5, "5 ხოლო თუ ვინმემ დამამწუხრა, მე კი არ დამამწუხრა, არამედ, რომ არ გადავაჭარბო, ნაწილობრივ ყველა თქვენგანიც. "},
	{6, "6 მის სასჯელად ისიცა კმარა, რომ დაიგმო მრავალთა მიერ. "},
	{7, "7 ასე რომ, პირიქით, გმართებთ უმალ მიუტევოთ და ანუგეშოთ, რათა მეტისმეტ მწუხარებას არ მიეცეს. "},
	{8, "8 ამიტომაც შეგაგონებთ, თქვენი სიყვარული დაუდასტუროთ. "},
	{9, "9 მეც სწორედ ამიტომ მოგწერეთ, რომ გამომეცადეთ, რამდენად მორჩილნი ხართ ყველაფერში. "},
	{10, "10 ხოლო ვისაც რას მიუტევებთ, ასევე მეც; რადგან ვისაც რა მივუტევე, თქვენი გულისთვის მივუტევე ქრისტეს წინაშე. "},
	{11, "11 რათა არ ვიძლიოთ სატანის მიერ, ვინაიდან ჩვენთვის ცნობილია მისი ზრახვანი. "},
	{12, "12 ხოლო მე, ტროას ჩასულმა ქრისტეს სახარებლად, - თუმცა კი გამეღო კარი უფლის მიერ, -"},
	{13, "13 ვერ მოვუპოვე ლხინება ჩემს სულს, რადგანაც ვერ შევხვდი იქ ჩემს ძმას ტიტეს; ამიტომაც დავემშვიდობე მათ და მაკედონიისკენ გავწიე. "},
	{14, "14 მაგრამ მადლობა ღმერთს, რომელიც ყოველთვის გვანიჭებს ძლევას ქრისტეს მიერ და ჩვენი მეოხებით ავრცელებს ყველგან თავისი შემეცნების სურნელს; "},
	{15, "15 რადგანაც ქრისტეს სურნელი ვართ ღვთის წინაშე, როგორც ხსნის, ისე დაღუპვის გზაზე დამდგართათვის. "},
	{16, "16 ზოგისთვის სიკვდილის სურნელი სასიკვდილოდ, ზოგისთვის სიცოცხლის სურნელი სასიცოცხლოდ; სხვას ვის შესწევს ამისი ძალი? "},
	{17, "17 ვინაიდან მრავალთა მსგავსად როდი ვბღალავთ ღვთის სიტყვას, არამედ წრფელად, როგორც ღვთისგან, ღვთის წინაშე ვქადაგებთ ქრისტეს მიერ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 ნუთუ ხელახლა უნდა წარმოგიდგინოთ თავი? ნუთუ ზოგიერთებივით წარდგენის წერილი გვჭირდება თქვენდამი ან თქვენგან? "},
	{2, "2 ჩვენი წერილი თქვენა ხართ, ჩვენს გულებში ჩაწერილი, ყოველი კაცისთვის გასაგები და მათ მიერვე წაკითხული. "},
	{3, "3 თქვენ ცხადყოფთ, რომ ქრისტეს წერილი ხართ, ჩვენი მეშვეობით შეთხზული და მელნით კი არა, ცოცხალი ღვთის სულით დაწერილი, არა ქვიფილაზე, არამედ ხორციელი გულის ფიცარზე. "},
	{4, "4 ასეთი ნდობა გვაქვს ქრისტეს მიერ ღვთის მიმართ. "},
	{5, "5 იმიტომ კი არა, ვითომ შეგვეძლოს ჩვენით ვიაზრებდეთ რამეს, თითქოს ღვთისაგან კი არა, ჩვენგანვე გვქონდეს ამის უნარი;"},
	{6, "6 არა, ღმერთმა მოგვცა იმისი ძალა, რომ ახალი აღთქმის მსახურნი ვიყოთ; არა ასოსი, არამედ სულისა, ვინაიდან ასო კლავს, ხოლო სული აცოცხლებს. "},
	{7, "7 და თუ მსახურება სიკვდილისა, ქვაზე ასოებივით გამოსახული, იმდენად სასახელო იყო რომ ისრაელის ძენი თვალს ვერ უსწორებდნენ მოსეს სახეს, მისი დიდებული იერის გამო, რომელიც, თავისი დიდებულების მიუხედავად, მაინც წარმავალი გახლდათ, - "},
	{8, "8 რამდენად უფრო სასახელი იქნება სულის მსახურება დიდებით? "},
	{9, "9 რადგანაც, თუ განკითხვის მსახურება დიდებაა, მით უფრო მეტი იქნება დიდება სამართლიანობის მსახურებისა, "},
	{10, "10 იმდენად, რომ იმ დიდებას აღარც კი ეთქმის დიდება ამ უზენაეს დიდებასთან შედარებით. "},
	{11, "11 ვინაიდან თუ წარმავალს ჰქონდა დიდება, რამდენად უფრო მეტია დიდება წარუვალისა. "},
	{12, "12 ამიტომ ასეთი სასოების მქონენი უფრო თამამად ვმოქმედებთ, "},
	{13, "13 და არა როგორც მოსე, რიდე რომ ჩამოიფარა სახეზე, რათა ისრაელის ძეთ არ ეხილათ დასასრული წარმავალისა. "},
	{14, "14 მაგრამ დაჩლუნგდა მათი გონება, რადგანაც იგივე რიდე, ძველი აღთქმის კითხვისას, დღემდე ჩამოუხსნელი რჩება, ვინაიდან მხოლოდ ქრისტეში იხსნება იგი. "},
	{15, "15 ასე რომ, დღემდე, მოსეს კითხვისას, იგივე რიდე უბურავთ გულს. "},
	{16, "16 მაგრამ როცა უფლის მიმართ მიიქცევიან, ჩამოეხსნებათ საბურველი. "},
	{17, "17 უფალი სულია, ხოლო სადაც უფლის სულია, იქვეა თავისუფლება."},
	{18, "18 ჩვენ კი, დაუბურავი სახით რომ ვჭვრეტთ უფლის დიდებას, როგორც სარკეში, იმავე სახედ გარდავისახებით დიდებიდან დიდებაში, როგორც უფლის სულისგან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 ამრიგად, რაკი მოწყალებით მოგვენიჭა ეს მსახურება, გულს არ ვიტეხთ. "},
	{2, "2 არამედ უარვყავით ყველაფერი, რასაც სირცხვილის გამო ფარავენ, არ ვიარებით ზაკვით, არ ვბღალავთ უფლის სიტყვას და ჭეშმარიტების სიცხადით წარვუდგებით ყოველი კაცის სინიდისს ღვთის წინაშე. "},
	{3, "3 ხოლო თუ ჩვენი სახარება დაფარულია, წარწყმედილთათვის არის დაფარული, "},
	{4, "4 რომელთაც ღმერთმა დაუბნელა ურწმუნო გონი, რათა არ ბრწყინავდეს მათთვის ნათელი ქრისტეს დიდების სახარებისა, ქრისტესი, რომელიც არის ღვთის ხატი. "},
	{5, "5 რადგანაც ჩვენს თავს კი არ ვქადაგებთ, არამედ ქრისტე იესოს, უფალს; ხოლო ჩვენ თქვენი მონები ვართ იესოსათვის. "},
	{6, "6 რადგანაც ღმერთმა, რომელმაც ბრძანა ბნელიდან ნათლის გამობრწყინება, გაანათლა ჩვენი გულები, რათა გავებრწყინებინეთ ღმერთის დიდების შემეცნებით, რომლითაც სხივოსნობს იესოს სახე. "},
	{7, "7 ხოლო ეს საუნჯე ჩვენ თიხის ჭურჭლებით დაგვაქვს, რათა ამ ძალის სიდიადე ღვთისაგან იყოს და არა ჩვენგან. "},
	{8, "8 ყოველნაირად გვავიწროებენ, მაგრამ დათრგუნვილად არა ვგრძნობთ თავს; გამოუვალ დღეში გვაგდებენ, მაგრამ მაინც ვპოულობთ გამოსავალს. "},
	{9, "9 დევნილნი ვართ, მაგრამ არა მიუსაფარნი; გვამხობენ, მაგრამ ბოლოს ვერ გვიღებენ. "},
	{10, "10 ყოველთვის თან დავატარებთ სხეულით იესოს სიკვდილს, რათა იესოს სიცოცხლეც გაცხადდეს ჩვენს სხეულში. "},
	{11, "11 ვინაიდან ჩვენ, ცოცხალნი, გამუდმებით ვეძლევით სიკვდილს იესოსათვის, რათა იესოს სიცოცხლეც გამოვლინდეს ჩვენს მოკვდავ ხორცში. "},
	{12, "12 ასე რომ, სიკვდილი ჩვენში მოქმედებს, ხოლო სიცოცხლე - თქვენში. "},
	{13, "13 მაგრამ რაკი რწმენის იგივე სული გვაქვს, რომელზედაც ამბობს წერილი: „მწამდა და მიტომ ვამბობდი“, ჩვენც გვწამს და მიტომ ვამბობთ. "},
	{14, "14 რაკიღა ვიცით, რომ, ვინც აღადგინა იესო, ჩვენც აღგვადგენს იესოსთან ერთად და თქვენი თანხლებით წარგვადგენს მის წინაშე. "},
	{15, "15 ვინაიდან ყველაფერი თქვენთვისაა, რათა მადლის სიუხვე მრავალთა მადლიერებად გადმოიფრქვეს ღვთის სადიდებლად. "},
	{16, "16 ამიტომაც არ ვიტეხთ გულს, რადგან თუ ჩვენი გარეგანი კაცი იხრწნება, დღითი დღე ახლდება შინაგანი. "},
	{17, "17 ვინაიდან ჩვენი წამიერი და მცირედი ტანჯვა უზღვავსა და უსაზომო დიდებას შეიქმს ჩვენთვის, "},
	{18, "18 როცა ხილულს კი არ მივაპყრობთ მზერას, არამედ უხილავს, ვინაიდან ხილული წარმავალია, უხილავი კი - წარუვალი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 რადგანაც ვიცით, რომ თუ ეს ჩვენი მიწიერი სახლი, თუ ეს კარავი დაინგრევა, ღმერთის მიერ გვაქვს სასახლე ცაში, ხელთუქმნელი და მარადიული. "},
	{2, "2 მიტომაც ვგმინავთ, რომ გვსურს შევიმოსოთ ზეციური სასახლე ჩვენი. "},
	{3, "3 მხოლოდ შემოსილნიც არ აღმოვჩნდეთ შიშველნი. "},
	{4, "4 ვინაიდან ამ კარავში მყოფნი სიმძიმილით ვგმინავთ, რადგანაც განძარცვა კი არა გვსურს, არამედ შემოსვა, რათა ცოცხალმა შთანთქას მოკვდავი. "},
	{5, "5 სწორედ ამისთვის შეგვქმნა ღმერთმა და მოგვცა სულის წინდი. "},
	{6, "6 ამიტომ ყოველთვის ნდობით ვართ აღვსილნი და ვიცით, რომ ვიდრე სხეულში ვსახლობთ, ღვთის გარეთ ვსახლობთ. "},
	{7, "7 რადგანაც რწმენით ვიარებით და არა ხედვით. "},
	{8, "8 მაგრამ ნდობით ვართ აღვსილნი და გვიჯობს სხეულიდან გამოვსახლდეთ, რათა უფალთან დავესახლოთ. "},
	{9, "9 ამიტომაც ვცდილობთ, რომ, გამოვსახლდებით თუ დავსახლდებით, მისთვის სათნონი ვიყოთ. "},
	{10, "10 რადგან ყველანი უნდა წარვსდგეთ ქრისტეს სამსჯავროს წინაშე, რათა თვითეულს მიეგოს მისი კუთვნილი, იმის მიხედვით, თუ რას იქმოდა სხეულში მყოფი: კეთილს თუ ბოროტს. "},
	{11, "11 და რაკი უფლის შიში ვიცით, ხალხს ვარწმუნებთ, ხოლო ღმერთისთვის ცხადნი ვართ. და, იმედი მაქვს, ცხადნი ვართ თქვენი სინიდისისთვისაც. "},
	{12, "12 მაგრამ ხელახლა კი არ წარმოგიდგენთ თავს, არამედ იმის საბაბს გაძლევთ, რომ ჩვენით იქადოდეთ, რათა სათქმელი გქონდეთ მათთვის, ვინც სახით იქადის და არა გულით. "},
	{13, "13 რადგან თუ გონს გადავდივართ, ღვთისთვის გადავდივართ, ხოლო თუ გონიერნი ვართ, - თქვენთვის. "},
	{14, "14 ვინაიდან ქრისტეს სიყვარულით ვართ მოცულნი, როცა ამგვარად ვმსჯელობთ: თუ ერთი მოკვდა ყველასათგის, ყველანი მოკვდნენ. "},
	{15, "15 მაგრამ ქრისტე ყველასთვის მოკვდა, რათა ცოცხალნი თავისთვის კი აღარ ცოცხლობდნენ, არამედ იმისთვის, ვინც მათთვის მოკვდა და აღდგა. "},
	{16, "16 ასე რომ, ამიერიდან აღარავის ვიცნობთ ხორციელად, რადგან თუ ხორციელად ვიცნობდით ქრისტეს, აწ უკვე აღარ ვიცნობთ. "},
	{17, "17 ამრიგად, ვინც ქრისტეშია, ახალი ქმნილებაა. ძველმა განვლო და, აჰა, ყოველივე არის ახალი. "},
	{18, "18 ხოლო ყველაფერი ღმერთისგანაა, რომელმაც შეგვირიგა ქრისტეს მიერ და მოგვცა მსახურება შერიგებისა. "},
	{19, "19 რადგანაც ღმერთმა ქრისტეში შეირიგა ქვეყანა, არ შეურაცხა ხალხს მისი ცოდვები და მოგვცა ჩვენ შერიგების სიტყვა."},
	{20, "20 ამრიგად, ქრისტეს გულისთვის ვართ მოვლინებულნი, და, თითქოს ღმერთი შეგაგონებდეთ ჩვენი მეშვეობით, ქრისტეს სახელით გთხოვთ: შეურიგდით ღმერთს, "},
	{21, "21 რომელმაც ცოდვის არმცოდნე ცოდვის მსხვერპლად აქცია, რათა ღვთის სიმართლედ ვქცეულიყავით მასში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ka6 poems[] = {
	{1, "1 ხოლო ჩვენ, როგორც თანამშრომელნი, შეგაგონებთ: ამაოდ არ მიიღოთ ღვთის მადლი. "},
	{2, "2 რადგანაც ამბობს: „შეწყალების ჟამს ვისმინე შენი და ხსნის დღეს შეგეწიე“. აჰა, ესაა შეწყალების ჟამი; აჰა, ესაა ხსნის დღე. "},
	{3, "3 ჩვენ არაფერში ვიძლევით დაბრკოლების საბაბს, რათა არ დაიგმოს მსახურება. "},
	{4, "4 არამედ ყველაფერში ღვთის მსახურებად ვავლენთ თავს: მრავლის თმენაში, ჭირში, სიმძიმილში, ვიწროებაში, "},
	{5, "5 გვემაში, დილეგში, დევნაში, გარჯაში, სიფხიზლეში, მარხვაში, "},
	{6, "6 სიწმიდეში, შემეცნებაში, სულგრძელობაში, სიწრფელეში, სული წმიდაში, უპირფერო სიყვარულში, "},
	{7, "7 ჭეშმარიტების სიტყვაში, ღვთის ძალაში, სიმართლის საჭურვლით მარჯვენასა და მარცხენაში, "},
	{8, "8 სახელსა თუ უსახელობაში, გმობასა თუ ქებაში, თითქოს მაცთურნი, მაგრამ მართალნი. "},
	{9, "9 თითქოს უცნობნი, მაგრამ ცნობილნი; თითქოს მომაკვდავნი, მაგრამ ცოცხალხი; თითქოს დასჯილნი, მაგრამ სიკვდილს გადარჩენილნი; "},
	{10, "10 თითქოს მწუხარენი, მაგრამ მარადის მოხარულნი, თითქოს ღატაკნი, მაგრამ მრავალთა მამდიდრებელნი; თითქოს არას მქონენი, მაგრამ ყველაფრის მფლობელნი. "},
	{11, "11 ჩვენი ბაგენი თქვენთვის მეტყველებენ, კორინთელნო, და თქვენთვისვე გვაქვს გახსნილი გული. "},
	{12, "12 ვიწროდ როდი ხართ ჩვენში, მაგრამ ვიწროებაა თქვენსავე გულში. "},
	{13, "13 თანაბარი ნაცვლისგებისთვის მოგმართავთ, როგორც შვილებს: თქვენც განივრცენით. "},
	{14, "14 ნუ შეებმებით უცხო უღელში ურწმუნოებთან ერთად; ვინაიდან რა აკავშირებს სამართლიანობასა და ურჯულოებას? რაა საერთო ნათელსა და ბნელს შორის? "},
	{15, "15 რამ შეათანხმოს ქრისტე და ბელიარი? ან რა ხელი აქვს მორწმუნეს ურწმუნოსთან? "},
	{16, "16 რამ შეუთავსოს ღვთის ტაძარი კერპებს? რადგანაც თქვენ ხართ ტაძარი ცოცხალი ღვთისა, როგორც თქვა ღმერთმა: „დავმკვიდრდები მათში და ვივლი მათ შორის; მე ვიქნები მათი ღმერთი, ხოლო ისინი იქნებიან ჩემი ხალხი. "},
	{17, "17 ამიტომ გამოდით და გამოეყავით მათ, ამბობს უფალი, ნუ შეეხებით უწმინდურს და მე შეგიწყნარებთ თქვენ. "},
	{18, "18 მე ვიქნები თქვენი მამა, ხოლო თქვენ იქნებით ჩემი ძენი და ასულნი“, ამბობს უფალი ყოვლისმპყრობელი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct ka7 poems[] = {
	{1, "1 ამრიგად, რაკი ეს აღთქმანი გვაქვს, საყვარელნო, განვიწმიდოთ ხორცისა და სულის ყოველგვარი მწიკვლისაგან და სრულვყოთ სიწმიდე ღვთის მოშიშებით. "},
	{2, "2 შეგვითვისეთ: არავის მოვქცევივართ უსამართლოდ, არავისთვის გვივნია რამე და არც ანგარება გამოგვიჩენია ვისიმე მიმართ. "},
	{3, "3 განსაკითხავად როდი ვამბობ: ვინაიდან უწინაც მითქვამს, რომ ჩვენს გულებში ხართ, რათა ერთად მოვკვდეთ და ერთად ვიცოცხლოთ. "},
	{4, "4 დიდი იმედი მაქვს თქვენი, დიდად ვიქადი თქვენით; ნუგეშითა ვარ სავსე და, მთელი ჩვენი გაჭირვების მიუხედავად, სიხარულით ვარ აღვსილი. "},
	{5, "5 რადგანაც მაკედონიაში ჩასვლისას ვერავითარი სიმშვიდე ვერ ჰპოვა ჩემმა ხორცმა, არამედ ყოველი მხრიდან შევიწროებულნი ვიყავით: გარედან - თავდასხმები, შიგნით კი - შიში. "},
	{6, "6 მაგრამ მდაბალთა მანუგეშებელმა გვანუგეშა ჩვენ ღმერთმა ტიტეს მოსვლით; "},
	{7, "7 და არა მარტო მოსვლით, არამედ ნუგეშითაც, რომლითაც ნანუგეშები იქნა ჩვენგან, - როცა გადმოგვცა თქვენი სურვილი, თქვენი გოდება, თქვენი თავგამოდება ჩემს მიმართ, ასე რომ, უმეტესად გავიხარე. "},
	{8, "8 ამიტომ, თუ ჩემი წერილით დაგამწუხრეთ, არ ვნანობ, თუმცა კი ლამის ვინანე, რადგანაც ვხედავ, რომ ჩემმა წერილმა დაგამწუხრათ, თუნდაც დროებით. "},
	{9, "9 ახლა კი ვხარობ, არა იმიტომ, რომ დამწუხრდით, არამედ იმიტომ, რომ სინანულისათვის დამწუხრდით; რადგანაც დამწუხრდით ღვთის გულისათვის, ისე, რომ არა გვნებიათ რა ჩვენგან. "},
	{10, "10 ვინაიდან წუხილი ღვთის გულისათვის დასაბამს აძლევს სინანულს, ამქვეყნიური წუხილი კი სიკვდილის დასაბამია. "},
	{11, "11 რადგანაც, აი, იმავე მწუხარებამ ღვთის გულისათვის რამდენი რამ გამოიწვია თქვენში: როგორი გულმოდგინება და თავის მართლება, როგორი გულისწყრომა და შიში, როგორი სურვილი, მოშურნეობა თუ შურისგება; ყოველმხრივ წმიდად წარმოაჩინეთ თავი ამ საქმეში. "},
	{12, "12 ასე რომ, თუკი მოგწერეთ, შეურაცხმყოფელისა და შეურაცხყოფილის გამო როდი მოგწერეთ, არამედ რათა გამოჩენილიყო თქვენი გულმოდგინება ჩვენს მიმართ ღვთის წინაშე. "},
	{13, "13 ამიტომაც ვინუგეშეთ თავი თქვენი ნუგეშით და უმეტესად გავიხარეთ ტიტეს სიხარულით, რადგანაც ყველამ მოუფონეთ მის სულს. "},
	{14, "14 ამრიგად, თუკი თქვენს გამო რაიმე დავიქადე მის წინაშე, არ შევრცხვენილვარ; არამედ, როგორც ყველაფერს ჭეშმარიტად გეუბნებოდით, ჭეშმარიტი აღმოჩნდა ჩვენი სიქადულიც ტიტეს მიმართ. "},
	{15, "15 თქვენდამი სიყვარულით ევსება გული, როცა იხსენებს თვითეული თქვენგანის მორჩილებასა და იმას, თუ როგორი მოშიშებით და თრთოლვით მიიღეთ იგი. "},
	{16, "16 ამრიგად, მოხარული ვარ, რომ შემიძლია ყველაფერში მოგენდოთ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct ka8 poems[] = {
	{1, "1 ახლა კი გაუწყებთ, ძმანო, ღვთის მადლს, რომელიც მიეცა მაკედონიის ეკლესიებს. "},
	{2, "2 ვინაიდან, დიდი ჭირნაცადობის მიუხედავად, მათი სიხარულის სავსება და მათი სიღატაკის სიღრმე მოჭარბებულად გამოჩნდა მათივე სიწრფელის სიუხვით. "},
	{3, "3 რადგანაც ვმოწმობ, რომ შეძლებისდაგვარად გულუხვნი იყვნენ და უფრო მეტადაც. "},
	{4, "4 თვითონვე დაჟინებით გვთხოვეს მადლი და მონაწილეობის ნება წმიდათა მსახურებაში. "},
	{5, "5 და არა მარტო ის, რისი იმედიც გვქონდა, არამედ თავიანთი თავი მისცეს ჯერ უფალს და მერე ჩვენც, ღვთის ნებით. "},
	{6, "6 ამიტომაც ვთხოვეთ ტიტეს, როგორც დაიწყო, ასევე დაესრულებინა ეს სამადლო საქმე თქვენს შორის. "},
	{7, "7 და რაკი უხვად გაქვთ ყველაფერი: რწმენა და სიტყვა, ცოდნა და გულმოდგინება, ისევე, როგორც ჩვენმიერი სიყვარული თქვენში, მაშ, უხვად გქონდეთ ეს მადლიც. "},
	{8, "8 ბრძანებით კი არ ვამბობ, არამედ სხვების გულმოდგინებით ვცდი თქვენი სიყვარულის სიწრფელეს. "},
	{9, "9 რადგანაც იცით ჩვენი უფლის იესო ქრისტეს მადლი, რომ ის, მდიდარი, გაღატაკდა თქვენი გულისთვის, რათა გამდიდრებულიყავით მისი სიღატაკით. "},
	{10, "10 მე გირჩევთ იმას, რაც სარგოა თქვენთვის: აღასრულეთ ის, რაც ხალისით წამოიწყეთ ჯერ კიდევ შარშან. "},
	{11, "11 მაშ, ახლა ბოლომდე მიიყვანეთ საქმე, რათა როგორი გულმოდგინებითაც გსურდათ, ისევე დაასრულოთ თქვენი შეძლებისამებრ. "},
	{12, "12 ვინაიდან, როცა არის გულმოდგინება, შეწირულობა მიიღება იმის მიხედვით, ვის რა აქვს, და არა იმისა, რაც არა აქვს. "},
	{13, "13 ისე ნუკი იქნება, რომ სხვებს ლხინი, ხოლო თქვენ - ჭირი, არამედ თანასწორობით იყოს. "},
	{14, "14 ამჟამად თქვენმა ნამეტმა შეავსოს მათი ნაკლულება, შემდეგ კი თქვენი ნაკლულება შეივსოს მათი ნამეტით, რათა არ დაირღვეს თანასწორობა. "},
	{15, "15 რადგანაც დაწერილია: „ვინც ბევრი შეაგროვა, არ მოსჭარბდა, და ვინც ცოტა, არ დააკლდა“. "},
	{16, "16 მადლობა ღმერთს, რომელმაც ასეთი სწრაფვა ჩაუნერგა ტიტეს გულს თქვენს მიმართ. "},
	{17, "17 რადგანაც არა მარტო შეიწყნარა თხოვნა, არამედ გულმოდგინებით აღძრული თავისი ნებით გამოეშურა თქვენსკენ. "},
	{18, "18 მასთან ერთად წარმოვგზავნეთ ძმა, რომელსაც ყველა ეკლესიაში აქებენ სახარების ქადაგებისთვის. "},
	{19, "19 მეტიც, ეკლესიების მიერვე არჩეულ იქნა ჩვენს თანამგზავრად ამ სამადლო საქმეში, რომელსაც ვემსახურებით უფლის სადიდებლად და ჩვენი კეთილი ზრახვის აღსასრულებლად. "},
	{20, "20 თანაც ვფრთხილობთ, რომ არავინ დაგვგმოს იმ უხვი შემოწირულობის გამო, რაც შეგროვებულ იქნა ჩვენი მსახურებით. "},
	{21, "21 რადგანაც სიკეთეა ჩვენი საზრუნავი არა მარტო ღმერთის, არამედ კაცთა წინაშეც. "},
	{22, "22 მათთან ერთადვე გამოვგზავნეთ ჩვენი ძმა, ვისი გულმოდგინებაც ბევრჯერ გამოგვიცდია სხვადასხვა საქმეში, ხოლო ამჟამად კიდევ უფრო გულმოდგინეა, რადგანაც დიდი ნდობა აქვს თქვენი. "},
	{23, "23 ტიტე კი ჩემი მეგობარი და თანამოსაქმეა თქვენს შორის, ხოლო ჩვენი ძმები ეკლესიის წარგზავნილნი არიან და დიდება ქრისტესი. "},
	{24, "24 მაშ, ეკლესიების წინაშე დაუდასტურეთ თქვენი სიყვარული და ისიც, რის გამოც მართებულად ვიქადით თქვენით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct ka9 poems[] = {
	{1, "1 რაც შეეხება წმიდათა სამსახურს, ამის თაობაზე ზედმეტად მიმაჩნია მოგწეროთ რამე. "},
	{2, "2 რადგანაც ვიცი თქვენი გულმოდგინება და ვიქადი კიდეც ამას მაკედონელთა წინაშე: აქაია შარშანდელს აქეთ მზადაა-მეთქი. და თქვენმა გულმოდგინებამ აღძრა მრავალნი. "},
	{3, "3 ძმები კი იმიტომ წარმოგვგზავნე, რომ არ გაცუდდეს ჩემი სიქადული თქვენით და, როგორც ვთქვი, მართლაც მზად იყოთ, "},
	{4, "4 რათა, ჩემთან ერთად რომ მოვლენ მაკედონელნი, მოუმზადებელი არ დახვდეთ, თორემ თქვენ კი არა, ჩვენ შევრცხვებით, რაკიღა ასე დაბეჯითებით დავიქადეთ. "},
	{5, "5 ამიტომ საჭიროდ მივიჩნიე მეთხოვა ძმებისთვის, რომ მოსულიყვნენ და გაემზადებინათ თქვენს მიერ აღთქმული ძღვენი, რათა მზად - ყოფილიყო, როგორც ძღვენი და არა როგორც ანგარება. "},
	{6, "6 ამასაც გეტყვით: ვინც ძუნწად თესავს, ძუნწად მოიმკის, ხოლო ვინც უხვად თესავს, უხვად მოიმკის. "},
	{7, "7 ყველამ გაიღოს გულის კარნახით და არა მწუხარებითა თუ ძალდატანებით, ვინაიდან ღმერთს უყვარს ის, ვინც სიხარულით გასცემს. "},
	{8, "8 ხოლო ღმერთს ძალუძს უხვად მოგაგოთ ყოველგვარი მადლი, რათა ყოველთვის და ყველაფერში ყოველივე საკმაოდ გქონდეთ და, ამრიგად, ამრავლოთ თქვენი კეთილი საქმე. "},
	{9, "9 როგორც დაწერილია: „გაანიავა, მისცა გლახაკებს; სიმართლე მისი წარუვალია უკუნისამდე“. "},
	{10, "10 ხოლო ის, ვინც თესლს აძლევს მთესველს და პურს - საზრდოდ, ზღვად აქცევს თქვენს ნათესსაც და ამრავლებს თქვენი სიმართლის ნაყოფს, "},
	{11, "11 რათა ყველაფრით გამდიდრდეთ ყოველგვარი გულუხვობისთვის, ჩვენი მეშვეობით რომ გადებს მადლიერებას ღვთის მიმართ."},
	{12, "12 რადგანაც ამ საქმის სამსახური არა მარტო შეავსებს წმიდათა ნაკლულებას, არამედ ღვთის მიმართ მადლიერებასაც ამრავლებს, "},
	{13, "13 რამდენადაც ამ სამსახურის გამოცდილებით ადიდებენ ღმერთს, როცა იხილავენ თქვენს მორჩილებას ქრისტეს სახარების აღსარებისას და თქვენი ურთიერთობის სიწრფელეს არა მარტო მათდამი, არამედ ყველას მიმართაც;"},
	{14, "14 და თქვენზე მლოცველნი თავიანთ სიყვარულს არ მოგაკლებენ ღვთის მადლის გამო, ესოდენ უხვად რომ გადმოსულა თქვენზე."},
	{15, "15 მადლობა ღმერთს მისი ენათუთქმელი საბოძვრის გამო. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct ka10 poems[] = {
	{1, "1 ხოლო მე, პავლე, თქვენს შორის პირისპირ ყოფნისას - მდაბალი, შორიდან კი - თქვენს მიმართ თამამი, ქრისტეს თვინიერებითა და სიკეთით შეგაგონებთ და გევედრებით: "},
	{2, "2 ნუ მაიძულებთ, რომ თქვენთან მოსვლისას მივმართო იმ სიმკაცრეს, რითაც ვაპირებ ჭკუა ვასწავლო ზოგიერთ თქვენგანს, ხორციელად მოარულნი რომ ვგონივართ ჩვენ. "},
	{3, "3 ვინაიდან ხორციელადაც რომ ვიარებოდეთ, ხორციელადვე როდი ვიბრძვით. "},
	{4, "4 რადგანაც ჩვენი საომარი საჭურველი ხორციელი კი არ არის, არამედ ღვთის მიერ ძლევით მოსილი ყოველგვარი სიმაგრის შესამუსრავად. "},
	{5, "5 მისი წყალობით ვამხობთ ყოველგვარ ზრახვას და, ქედმაღლობას, ღვთის შემეცნების წინააღმდეგ აღძრულს, და მისითვე ვატყვევებთ ყოეელგვარ აზრსაც, რათა დაემორჩილოს ქრისტეს. "},
	{6, "6 ასე რომ, მზადა ვართ შური ვიძიოთ ყოველგვარ ურჩობაზე, როცა აღსრულდება თქვენი მორჩილება. "},
	{7, "7 დაუკვირდით, რაც თვალწინ გიძევთ. ვისაც ჰგონია, ქრისტესი ვარო, თავად განსაჯოს ისიც, რომ როგორც თვითონ არის ქრისტესი, ასევე ჩვენც ქრისტესნი ვართ. "},
	{8, "8 რადგანაც მე რომ უფრო მეტად ვიქადოდე ჩვენი ხელმწიფებით, თქვენს დასაქცევად კი არა, ასაშენებლად რომ მოგვცა ღმერთმა, განა შერცხვენილი არ დავრჩებოდი? "},
	{9, "9 მაგრამ ნუ გგონიათ, თითქოს წერილებით გაშინებდეთ. "},
	{10, "10 შეიძლება ზოგიერთმა თქვას: მისი წერილი დიახაც მკაცრია და მძლავრი, მაგრამ თვითონ, პირისპირ, უძლურია, სიტყვა კი - უფასურიო. "},
	{11, "11 ამნაირებმა იცოდნენ, რომ, როგორიცა ვართ შორიდან - წერილის სიტყვით, ისეთივე ვართ პირისპირ - საქმით. "},
	{12, "12 რადგანაც ვერ ვბედავთ თავი მივაკუთვნოთ ან შევადაროთ მათ, დიდ ვინმედ რომ მოაქვთ თავი: ეს უგუნურნი თავიანთი თავით ზომავენ საკუთარ თავს და თავიანთ თავსვე ედრებიან. "},
	{13, "13 ხოლო ჩვენ უსაზომოდ კი არ მოვყვებით ქადილს, არამედ იმ ზომით, რომელიც ღმერთმა გვიწილადა, რათა მოგვეღწია თქვენამდის. "},
	{14, "14 ამიტომაც არ გადავალთ ზღვარს, რათა თქვენამდე მოვაღწიოთ, რაკიღა თქვენც მოგწვდით ქრისტეს სახარებით. "},
	{15, "15 არც უსაზომოდ ვიქადით და არც სხვისი შრომით, არამედ იმედი გვაქვს, რომ, თქვენი რწმენის ზრდისამებრ, უხვად ვამრავლებთ ჩვენს წილხვედრს თქვენში. "},
	{16, "16 ასე რომ, თქვენს მიღმაც ვიქადაგებთ სახარებას და არ მოვყვებით ქადილს იმით, რაც გამზადებული დაგვხვდება სხვისი ღვაწლის წყალობით. "},
	{17, "17 ვინც იქადის, უფლით იქადოდეს. "},
	{18, "18 რადგანაც ღირსეული ის კი არ არის, ვინც თავს იქებს, არამედ ვისაც აქებს უფალი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct ka11 poems[] = {
	{1, "1 რა იქნება, ცოტათი მაინც რომ იტანდეთ ჩემს უგუნურებას?! მაგრამ ამიტანეთ. "},
	{2, "2 რადგანაც საღვთო შურით მშურს თქვენთვის, ვინაიდან დაგწინდეთ ერთ კაცზე, რათა უბიწო ქალწულად წარგადგინოთ ქრისტეს წინაშე. "},
	{3, "3 მაგრამ ვშიშობ, როგორც გველმა თავისი ზაკვით აცთუნა ევა, ვაითუ თქვენი გონებაც ასევე შეირყვნას და განეშოროს ქრისტესმიერ სიწმიდეს. "},
	{4, "4 რადგანაც თუ მოვიდა ვინმე, რათა გიქადაგოთ სხვა ქრისტე, რომელიც ჩვენ არ გვიქადაგია, ან მიგაღებინოთ სხვა სული, რომელიც არ მიგიღიათ, ან კიდევ - სხვა სახარება, რომელიც არ გხარებიათ, - დიახაც შეიწყნარებთ მას. "},
	{5, "5 მაგრამ, ვფიქრობ, არაფრითა ვარ ესოდენ მაღალ მოციქულებზე ნაკლები. "},
	{6, "6 მართალია, უბირი ვარ სიტყვით, მაგრამ არა ცოდნით; თუმცა აკი მშვენივრად მიცნობთ. "},
	{7, "7 ნუთუ შევცოდე, რომ თავი დავიმდაბლე, რათა ამემაღლებინეთ, რაკიღა უსასყიდლოდ გახარებდით ღვთის სახარებას? "},
	{8, "8 სხვა ეკლესიებს ვაკლებდი და სანოვაგეს ვიღებდი მათგან, რომ თქვენ მოგმსახურებოდით; ხოლო თქვენს შორის ყოფნისას, თუმცა მიჭირდა, არავისთვის შემიწყენია თავი. "},
	{9, "9 რადგანაც ჩემი ნაკლულება შეავსეს მაკედონიიდან მოსულმა ძმებმა; თუმცა, სხვა მხრივაც, ისე გამქონდა თავი, რომ არ შემიწუხებიხართ, და კვლავ გავიტან. "},
	{10, "10 ქრისტეს ჭეშმარიტება ნუ მომეშალოს, რომ ამ სიქადულს ვერვინ წამართმევს აქაიის ვერცერთ მხარეში. "},
	{11, "11 რატომ? იმიტომ, რომ არ მიყვარხართ? ღმერთმა ხომ იცის! "},
	{12, "12 მაგრამ რასაც ახლა ვაკეთებ, იმასვე გავაკეთებ, რათა საბაბი არ მივცე საბაბის მძებნელთ, და ამრიგად, რითაც იქადიან, იმითაც ჩვენი მსგავსნი აღმოჩნდნენ. "},
	{13, "13 რადგანაც ასეთნი არიან ცრუმოციქულნი, ზაკვის მოქმედნი, ქრისტეს მოციქულებად გარდასახულნი. "},
	{14, "14 თუმცა რა გასაკვირია, თვით სატანაც ხომ სინათლის ანგელოზის სახეს იღებს. "},
	{15, "15 ჰოდა, რა დიდი საქმეა, რომ მისი მსახურნიც სიმართლის მსახურთა სახეს იღებენ? მაგრამ მათივე საქმისამებრ იქნება მათი აღსასრულიც. "},
	{16, "16 კვლავაც ვიტყვი: ნურავინ მიმიჩნევს უგუნურად, თუ არა და, ისე მაინც მიმიღეთ, როგორც უგუნური, რათა ცოტა რამ მეც მქონდეს სასიქადულო. "},
	{17, "17 რასაც ვამბობ, ამნაირად რომ ვიქადი, უფლის მიხედვით როდი ვამბობ, არამედ უგუნურებით. "},
	{18, "18 რაკიღა ბევრი იქადის ხორციელად, მეც შემიძლია ვიქადოდე. "},
	{19, "19 რადგანაც თქვენ, გონიერნი, მშვენივრად იტანთ უგუნურთ. "},
	{20, "20 იტანთ, როცა ვინმე გიმონებთ, როცა ვინმე გჭამთ, როცა ვინმე გყვლეფთ, როცა ვინმე ქედმაღლობს ან გირტყამთ სახეში. "},
	{21, "21 სირცხვილით ვამბობ, თითქოსდა ჩვენც დავუძლურდით; მაგრამ თუ ვინმე ბედავს დაიქადოს, უგუნურებით ვიტყვი: მეც ვბედავ. "},
	{22, "22 ებრაელები არიან? მეც; ისრაელიტები არიან? მეც; აბრაამის თესლი არიან? მეც; "},
	{23, "23 ქრისტეს მსახურნი არიან? უგუნურებით ვიტყვი: მე - უმტესად; შრომით - უმეტესად, გვემით - უმეტესად, დილეგში გდებით უმრავლესად, სიკვდილის მუქარით - უხშირესად. "},
	{24, "24 იუდეველთაგან ხუთგზის ვიწვნიე ორმოცი დარტყმა, ერთის დაკლებით. "},
	{25, "25 სამჯერ გამჯოხეს, ერთხელ ჩამქოლეს, სამჯერ გემი დამემსხვრა, დღე და ღამე უფსკრულში დავყავი. "},
	{26, "26 ერთავად გზებზე ვიყავი გაკრული, განსაცდელი მდინარეებზე, განსაცდელი ყაჩაღთაგან, განსაცდელი თვისტომთაგან, განსაცდელი წარმართთაგან, განსაცდელი ქალაქში, განსაცდელი უდაბნოში, განსაცდელი ზღვაზე, განსაცდელი ცრუ ძმათა შორის. "},
	{27, "27 შრომით და რუდუნებით, ხშირი ღამის თევით, შიმშილით და წყურვილით, მრავალგზისი მარხვით, სიცივით და სიშიშვლით. "},
	{28, "28 გარდა ამისა, ჩემი ყოველდღიური საფიქრალი - ზრუნვა ყველა ეკლესიაზე. "},
	{29, "29 ვინ უნდა დაუძლურდეს, რომ მასთან ერთად არ დავუძლურდე? ვინ უნდა დაეცეს, რომ ცეცხლი არ შემომენთოს? "},
	{30, "30 თუ საჭიროა სიქადული, შემიძლია ჩემი უძლურებით დავიქადო. "},
	{31, "31 ღმერთმა და ჩვენი უფლის იესო ქრისტეს მამამ, რომელიც კურთხეულია უკუნითი უკუნისამდე, იცის, რომ არ ვცრუობ. "},
	{32, "32 დამასკოში არეტა მეფის მთავარს მეთვალყურენი ჩაეყენებინა მთელ ქალაქში, რადგანაც ჩემი შეპყრობა სურდა. "},
	{33, "33 მაგრამ სარკმლიდან გოდრით ჩამომიშვეს გალავნის ჩასწვრივ, და ამრიგად დავუსხლტი მას. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct ka12 poems[] = {
	{1, "1 სიქადული საჭიროა, მაგრამ სარგო როდია ჩემთვის; მაშ, უფლის ხილვებსა და გამოცხადებებს მივუბრუნდები. "},
	{2, "2 ვიცი ერთი კაცი ქრისტეში, რომელიც ამ თოთხმეტი წლის წინათ (არ ვიცი, სხეულით თუ უსხეულოდ; ღმერთმა იცის) ატაცებულ იქნა მესამე ცამდე;"},
	{3, "3 და ვიცი ამ კაცისა (მხოლოდ არ ვიცი, სხეულით თუ უსხეულოდ; ღმერთმა იცის), "},
	{4, "4 რომ ატაცებულ იქნა სამოთხეში, სადაც ისმინა ენითუთქმელი სიტყვები, რომელთა წარმოთქმის ნებაც არა აქვს კაცს. "},
	{5, "5 სწორედ ამნაირი კაცით ვიქადი, ჩემსას კი, აბა, რას დავიქადი, საკუთარი უძლურების გარდა? "},
	{6, "6 ხოლო თუ ქადილს დავაპირებ, უგუნური როდი ვიქნები, რადგანაც სიმართლეს ვიტყვი, მაგრამ თავს ვიკავებ, რათა ვინმეს იმაზე მეტი არ ვაფიქრებინო, რასაც ჩემში ხედავს, ან ჩემგან ესმის. "},
	{7, "7 თავს რომ არ გამსვლოდა გამოცხადების უჩვეულობით, ჩემდა საწამებლად მომეცა ნესტარი ხორცში, სატანის ანგელოზი, რათა დაეთრგუნა ჩემი ზვაობა. "},
	{8, "8 სამგზის ვევედრე უფალს, მომაშორე-მეთქი. "},
	{9, "9 მომიგო: „შენთვის საკმარისია ჩემი მადლიც, რადგანაც ჩემი ძალა უფრო სრულად ვლინდება უძლურებაში“. ამიტომაც მეტი ხალისით დავიქადი ჩემს უძლურებას, რათა ქრისტეს ძალა დამკვიდრდეს ჩემში. "},
	{10, "10 მიტომაც ვტკბები უძლურებით, შეურაცხყოფით, გაჭირვებით, დევნითა და შევიწროებით, რადგან როცა უძლური ვარ, მაშინა ვარ ძლიერი. "},
	{11, "11 უგუნური გავხდი ქადილით; თქვენ მაიძულეთ, ვინაიდან თქვენ უნდა გექეთ; რადგანაც არაფრითა ვარ ესოდენ მაღალ მოციქულებზე ნაკლები, თუმცაღა არარა ვარ. "},
	{12, "12 მოციქულის ნიშნები გამოჩნდა თქვენში მთელი მოთმინებით, სასწაულებით, ნიშებითა და ძალით. "},
	{13, "13 ვინაიდან თუ რამეთი ჩამორჩებით სხვა ეკლესიებს, მხოლოდ იმით, რომ მძიმე ტვირთად არ დაგწოლივართ, მომიტევეთ ეს უსამართლობა. "},
	{14, "14 აჰა, მე მზად ვარ მესამედაც მოვიდე თქვენთან, და არც ამჯერად შეგაწუხებთ, რადგანაც თქვენსას კი არ ვეძებ, არამედ - თქვენ. შვილები კი არ უნდა უგროვებდნენ საუნჯეს მშობლებს, არამედ მშობლები - შვილებს. "},
	{15, "15 ამიტომაც ხალისით დავიხარჯები და დავიწრიტები თქვენი სულისთვის; მაგრამ რაკი ასე ძლიერ მიყვარხართ, განა ნაკლებ უნდა გიყვარდეთ? "},
	{16, "16 ან იქნებ თავად არ გაწუხებდით, მაგრამ ცბიერი ვიყავი და ზაკვით დაგიმორჩილეთ? "},
	{17, "17 მაგრამ რამე თუ მისარგებლია თქვენგან მათი მეშვობით, ვინც თქვენთან წარმოვგზავნე? "},
	{18, "18 ვთხოვე ტიტეს, თქვენთან მოსულიყო, და ერთი ძმაც გამოვაყოლე: ან ტიტე თუ გამოგრჩათ რასმე? განა ერთი სულით არ ვმოქმედებდით? განა ერთ გზას არ ვადექით? "},
	{19, "19 იქნებ გგონიათ, თქვენს წინაშე ვიმართლებთ თავს? არა, ღვთის წინაშე, ქრისტეში. ხოლო ყოველივე ამას, საყვარელნო, თქვენს ასაშენებლად ვამბობთ. "},
	{20, "20 რადგანაც ვშიშობ, ვაითუ ჩემი მოსვლისას ისეთი გნახოთ, როგორნიც არ მსურხართ, და მეც ისეთი მნახოთ, როგორსაც არ მისურვებდით; მაშ, ნუ იქნება თქვენში შუღლი, შური, მრისხანება, ცილობა, ცილისწამება, მითქმა-მოთქმა, ქედმაღლობა, არეულ-დარეულობა. "},
	{21, "21 რათა კვლავ მოსვლისას თქვენს წინაშე არ დამამდაბლოს ღმერთმა და არ მაგლოვებინოს მრავალნი, რომელთაც უწინ სცოდეს, მაგრამ არ მოინანიეს უწმინდურება, სიმრუშე და სიბილწე, რასაც სჩადიოდნენ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct ka13 poems[] = {
	{1, "1 ეს უკვე მესამედ მოვდივარ თქვენთან. ორი თუ სამი მოწმის პირით დამტკიცდება ყოველი სიტყვა. "},
	{2, "2 ადრეც, ჩემი მეორედ მანდ ყოფნის ჟამსაც, მითქვამს და ახლაც შორიდან ვეუბნები ყველას, ვინც უწინ სცოდა და სხვებსაც, რომ არავის დავინდობ, როცა კვლავ მოვალ. "},
	{3, "3 რაკიღა იმის დასტურს ეძებთ, მეტყველებს თუ არა ჩემში იესო ქრისტე, რომელიც უძლური როდია თქვენს მიმართ, არამედ ძლიერი - თქვენს შორის. "},
	{4, "4 რადგანაც თუ უძლურებით ეცვა ჯვარს, ცოცხალია ღვთის ძალით; და ჩვენც უძლურნი ვართ მასში, მაგრამ ღვთის ძალით მასთან ერთად ვიცოცხლებთ თქვენთვის. "},
	{5, "5 მაშ, გამოსცადეთ თქვენი თავი, მკვიდრობთ თუ არა რწმენაში; შეამოწმეთ თქვენივე თავი; ნუთუ არ იცით, რომ თქვენშია იესო ქრისტე? თუ არა და, გამოცდისთვის ვერ გაგიძლიათ. "},
	{6, "6 მაგრამ იმედი მაქვს, ის მაინც იცით, რომ ჩვენ არა ვართ გამოუცდელნი. "},
	{7, "7 ღმერთს ვევედრები, რომ არ ჩაიდინოთ რამე ბოროტი, იმიტომ კი არა, რომ ჩვენი გამოცდილება გიჩვენოთ, არამედ იმიტომ, რომ სიკეთეს მისდევდეთ, ჩვენ კი თუნდაც გამოუცდელნი ვიყოთ. "},
	{8, "8 ჩვენ არაფერი შეგვიძლია ჭეშმარიტების წინააღმდეგ; თუ რამ შეგვიძლია, ჭეშმარიტებისათვის შეგვიძლია მხოლოდ. "},
	{9, "9 რადგანაც ვხარობთ, როცა ჩვენ უძლურნი ვართ, თქვენ კი - ძლიერნი, და ამიტომაც თქვენი სრულყოფისთვის ვლოცულობთ. "},
	{10, "10 შორიდანაც მიტომ გწერთ ამას, რომ მანდ მოსვლისას მთელი სიმკაცრით არ მოვიქცე, თანახმად იმ ხელმწიფებისა, რომელიც დასაქცევად კი არა, ასაშენებლად მომცა უფალმა. "},
	{11, "11 სხვა მხრივ კი, გიხაროდეთ, ძმანო, განმტკიცდით, ნუგეშისცემა და ერთსულოვნება ნუ მოგეშალოთ, მშვიდობა გქონდეთ და თქვენთან იქნება სიყვარულისა და მშვიდობის ღმერთი. "},
	{12, "12 მოიკითხეთ ერთმანეთი წმიდა ამბორით. მოკითხვას გითვლით ყველა წმიდა. "},
	{13, "13 მადლი ჩვენი უფლის იესო ქრისტესი, სიყვარული ღვთისა და ზიარება სული წმიდისა ყველა თქვენგანთან. ამინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};