#include <map>
#include <string>
class Bible63
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 პავლე, ღვთის მონა და იესო ქრისტეს მოციქული ღვთის რჩეულთა რწმენითა და ჭეშმარიტების შემეცნებით, ღვთისმოსაობის შესაბამისად, "},
	{2, "2 საუკუნო სიცოცხლის იმედით, საუკუნეთა უწინარეს რომ აღუთქვა უტყუარმა ღმერთმა, "},
	{3, "3 და თავის დროზე გამოაცხადა სიტყვა ქადაგებით, რომელიც ჩვენი მაცხოვრის - ღმერთის ბრძანებით მე მომენდო, -"},
	{4, "4 ტიტეს, ჭეშმარიტ შვილს საერთო რწმენისამებრ: მადლი, წყალობა და მშვიდობა მამა ღმერთისა და ჩვენი მაცხოვრის - ქრისტე იესოსაგან. "},
	{5, "5 იმიტომ დაგტოვე კრეტეს, რომ დასასრულებელი დაასრულო და ხუცესნი დაადგინო ყველა ქალაქში, როგორც დაგავალე: "},
	{6, "6 ვინც უბიწოა, ერთი ცოლის ქმარი და მორწმუნე შვილების მამა, ვისაც ვერავინ დასდებს ბრალად ბილწებასა და ურჩობას, "},
	{7, "7 რადგანაც ეპისკოპოსი უბიწო უნდა იყოს, როგორც მნე ღვთისა, არა თავნება, არა გულფიცხი, არა მემთვრალე, არა ჩხუბისთავი, არა ანგარი, "},
	{8, "8 არამედ სტუმართმოყვარე, სიკეთისმოყვარე, გონიერი, მართალი, წმიდა, მტკიცე, "},
	{9, "9 სარწმუნო სიტყვის მიმდევარი, თანახმად სწავლებისა, რათა საღი მოძღვრებით შეეძლოს შეგონება და ურჩთა მხილება. "},
	{10, "10 რადგან ბევრია ურჩიც, ფუჭად მოლაყბეც და გონების მაცდურიც, მეტწილად წინადაცვეთილთაგან, "},
	{11, "11 რომელთაც უნდა ავუკრათ პირი, რადგანაც რყვნიან მთელ სახლებს და ასწავლიან იმას, რასაც არ უნდა ასწავლიდნენ, სამარცხვინო ანგარებით. "},
	{12, "12 ერთმა მათგანმა, იქაურმა წინასწარმეტყველმა თქვა: კრეტელნი მუდამ ცრუნი არიან, მძვინვარე მხეცნი, უქმი მუცელნი. "},
	{13, "13 ეს მოწმობა ჭეშმარიტია. ამიტომაც ამხილე ისინი მკაცრად, რათა საღნი იყვნენ რწმენაში. "},
	{14, "14 ყურს ნუ უგდებენ იუდეველთა ზღაპრებსა და ჭეშმარიტებისაგან განდგომილ კაცთა მცნებებს. "},
	{15, "15 რადგანაც წმიდათათვის ყველაფერი წმიდაა, ბილწთა და ურწმუნოთათვის კი არაფერი არ არის წმიდა, არამედ შებილწულია მათი გონებაც და სინიდისიც. "},
	{16, "16 სიტყვით აღიარებენ, საქმით კი უარყოფენ ღმერთს, უკეთურნი, ურჩნი და ყოველი კეთილი საქმისათვის ურგებნი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 შენ კი ის ილაპარაკე, რაც შეჰფერის საღ მოძღვრებას. "},
	{2, "2 ბერიკაცები ფხიზლები იყვნენ, ღირსეულნი, გონიერნი, რწმენით, სიყვარულითა და მოთმინებით საღნი. "},
	{3, "3 ხანდაზმული ქალებიც ისეთნი იყვნენ, როგორც შეჰფერის სიწმიდეს: არა ცილისმწამებელნი, არა ღვინის მონები, არამედ სიკეთის მოძღვარნი, "},
	{4, "4 რათა ასწავლიდნენ ყმაწვილ ქალებს, უყვარდეთ ქმარ-შვილი, "},
	{5, "5 კეთილგონიერნი იყვნენ, უმანკონი, მეოჯახენი, კეთილნი, თავიანთი ქმრების მორჩილნი, რათა არ იგმობოდეს ღვთის სიტყვა. "},
	{6, "6 ჭაბუკებსაც ასევე შეაგონე, რომ თავდაჭერილნი იყვნენ. "},
	{7, "7 ყველაფერში კეთილი საქმის ნიმუშად წარმოაჩინე თავი; სწავლებისას - სიწმიდე და სიდარბაისლე; "},
	{8, "8 შენი სიტყვა საღი იყოს და უგმობელი, რათა მოწინააღმდეგეს შერცხვეს და ცუდი ვეღარაფერი თქვას ჩვენზე. "},
	{9, "9 მონები ემორჩილებოდნენ თავიანთ ბატონებს, ცდილობდნენ ყველაფერში აამონ მათ და ნუ შეუბრუნებენ სიტყვას; "},
	{10, "10 ნურაფერს მოიპარავენ, არამედ გამოიჩინონ მთელი თავიანთი ერთგულება, რათა სრულად შეამკონ ჩვენი მაცხოვრის - ღმერთის მოძღვრება. "},
	{11, "11 რადგანაც მოგვევლინა მადლი ღვთისა, ყოველი კაცის მხსნელი, "},
	{12, "12 ჩვენს დასამოძღვრად, რათა უარვყოთ უღმერთოება, ამქვეყნიური გულისთქმანი და მოკრძალებით, სიმართლით და ღვთისმოსაობით ვიცხოვროთ ქვეყნად, "},
	{13, "13 და მოველოდეთ ნეტარი სასოებისა და ჩვენი დიდი ღმერთისა და მაცხოვრის ქრისტე იესოს დიდების გამოჩენას, "},
	{14, "14 რომელმაც თავი დასდო ჩვენთვის, რათა გამოვეხსენით ყოველგვარი ურჯულოებისაგან და თავისთვის განეწმინდა რჩეული ხალხი, კეთილ საქმეთა მოშურნე. "},
	{15, "15 ამას ამბობდე, შეაგონებდე და ამხილებდე მთელი ძალმოსილებით, რათა ვერავინ უგულებელგყოს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 შეახსენე მათ, დაემორჩილონ მთავართა და ხელისუფალთ; მორჩილნი იყვნენ და ყოველგვარი კეთილი საქმისათვის მზადმყოფნი. "},
	{2, "2 ნურავის ჰგმობენ, არამედ უშფოთველნი იყვნენ, შემწყნარებელნი და კეთილმოსურნენი ყოველი კაცის მიმართ. "},
	{3, "3 ვინაიდან ოდესღაც ჩვენც უგუნურნი ვიყავით, ურჩნი, შეცდთმილნი, სხვადასხვა გულისთქმათა და განცხრომათა მონები, ბოროტებასა და შურში დანთქმულნი, ბილწნი და ურთიერთმოძულენი. "},
	{4, "4 ხოლო როდესაც გამოჩნდა სიკეთე და კაცთმოყვარეობა ჩვენი მაცხოვრის - ღვთისა, "},
	{5, "5 მან გვიხსნა არა ჩვენს მიერ აღსრულებულ კეთილ საქმეთა გამო, არამედ თავისი წყალობით, ხელახლა შობის განბანითა და სული წმიდის მიერ განახლებით, "},
	{6, "6 რომელიც უხვად მოგვფინა ჩვენი მაცხოვრის იესო ქრისტეს მიერ, "},
	{7, "7 რათა მისი მადლით გამართლებულთ სასოებისამებრ დაგვემკვიდრებინა საუკუნო სიცოცხლე. "},
	{8, "8 სარწმუნოა ეს სიტყვა, და მე მინდა, რომ მტკიცედ იდგე ამ აზრზე, რათა ღვთის მორწმუნენი გულმოდგინედ ცდილობდნენ კეთილ საქმეთა კეთებას, რაც სარგო და სასიკეთოა კაცთათვის. "},
	{9, "9 ხოლო ფუჭ ძიებას, გვარტომობის ჩხრეკას, შუღლსა და დავას რჯულის თაობაზე თავი არიდე, რადგანაც ყოველივე ეს ურგებია და ამაო. "},
	{10, "10 მწვალებელ კაცს, ერთი თუ ორი შეგონების შემდეგ, განეშორე. "},
	{11, "11 იცოდე, რომ გარყვნილია და სცოდავს, თავისივე თავის მიერ დასჯილი. "},
	{12, "12 როდესაც არტემასსა და ტიქიკოსს გამოგიგზავნი, ჩემსკენ გამოეშურე, ნიკოპოლისს, რადგანაც აქ გადავწყვიტე გამოზამთრება. "},
	{13, "13 ხელი შეუწყვე რჯულის მოძღვარ ძენასისა და აპოლოსის გამომგზავრებას, რომ არაფერი მოაკლდეთ. "},
	{14, "14 ჩვენიანებმაც ისწავლონ კეთილ საქმეთა კეთება გაჭირვებაში დასახმარებლად, რათა არ იყვნენ უნაყოფონი. "},
	{15, "15 მოგიკითხავს ყველა, ვინც ჩემთანაა. მოიკითხე, ვისაც ვუყვარვართ რწმენაში. მადლი ყველა თქვენგანთან. ამინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};