#include <map>
#include <string>
class Bible62
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 პავლე, ღვთის ნებით იესო ქრისტეს მოციქული, თანახმად სიცოცხლის აღთქმისა ქრისტე იესოში, - "},
	{2, "2 ტიმოთეს, საყვარელ შვილს: მადლი, წყალობა და მშვიდობა ჩვენი მამა ღმერთისა და ჩვენი უფლის ქრისტე იესოსაგან. "},
	{3, "3 ვმადლობ ღმერთს, რომელსაც, წინაპართა კვალდაკვალ, წმიდა სინიდისით ვემსახურები, - რომ გამუდმებით გიხსენებ ჩემს ლოცვებში, დღისით თუ ღამით; "},
	{4, "4 შენი ცრემლების გახსენებისას ერთი სული მაქვს, როდის გიხილავ, რათა აღვივსო სიხარულით. "},
	{5, "5 მახსენდება შენი უპირფერო რწმენა, რომელიც პირველად დაემკვიდრა დიდედაშენ ლოიდესა და დედაშენ ევნიკეში, და, მწამს, შენშიაც. "},
	{6, "6 ამიტომაც შეგახსენებ გააღვივო ნიჭი ღვთისა, ჩემი ხელდასხმით რომ მოგეცა. "},
	{7, "7 რადგანაც ღმერთმა მოშიშების სული როდი მოგვცა, არამედ ძლიერების, სიყვარულისა და თავდაჭერისა. "},
	{8, "8 მაშ, ნუ გრცხვენია ჩვენი უფლის მოწმობისა, და ნურც ჩემი, მისი ტყვისა, არამედ ჩემთან ერთად ევნე სახარებისათვის, ღვთის ძალით, "},
	{9, "9 რომელმაც გვიხსნა და წმიდა ხმობით გვიხმო, ჩვენს საქმეთა გამო კი არა, არამედ თავისი ნებით და მადლით, საუკუნეთა უწინარეს რომ მოგვეცა ქრისტე იესოში, "},
	{10, "10 ახლა კი გამოჩნდა ჩვენი მხსნელის ქრისტე იესოს გამოცხადებით, ვინც განაქარა სიკვდილი და გაანათლა სიცოცხლე და უხრწნელება სახარებით; "},
	{11, "11 ვის ქადაგად, მოციქულად და მოძღვრადაც ვარ დადგენილი, "},
	{12, "12 ვისი მიზეზითაც ვევნები ასე, მაგრამ სულაც არა მრცხვენია, რადგანაც ვიცი, ვინც ვირწმუნე, და მწამს, რომ ძალუძს შეინახოს ჩემი წინდი იმ დღისათვის. "},
	{13, "13 სიყვარულითა და რწმენით მისდიე მასულდგმულებელ სიტყვათა ნიმუშს, ჩემგან რომ ისმინე ქრისტე იესოში. "},
	{14, "14 შეინახე კეთილი წინდი სულით წმიდით, რომელიც მკვიდრობს ჩვენში. "},
	{15, "15 შენ იცი, რომ ასიაში ყველამ მიმატოვა, მათ შორის ფიგულუსმა და ჰერმოგენემაც. "},
	{16, "16 წყალობა მისცეს უფალმა ონისიფორეს სახლს, რადგანაც მრავალგზის მომიფონა და სირცხვილად არ უჩნდა ჩემი ბორკილები. "},
	{17, "17 არამედ რომში ჩამოსული გულმოდგინედ მეძებდა და მიპოვა კიდეც. "},
	{18, "18 ღმერთმა ინებოს, რომ უფლის მიერ წყალობა ჰპოვოს იმ დღეს, ხოლო რაც ეფესოში მემსახურა, შენ უკეთ იცი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 მაშ, გაძლიერდი, შვილო ჩემო, ქრისტე იესოს მადლით, "},
	{2, "2 და რაც მრავალი მოწმის თანდასწრესით გსმენია ჩემგან, სარწმუნო ხალხს გადაეცი, რომლებიც შესძლებენ ასწავლონ სხვებსაც. "},
	{3, "3 ამიტომ ჩემსავით დაითმინე ჭირი, როგორც ქრისტე იესოს კეთილმა მეომარმა. "},
	{4, "4 არც ერთი მეომარი არ შეიკრავს ხელ-ფეხს ცხოვრებისეული საქმით, რათა თავი მოაწონოს მხედართმთავარს. "},
	{5, "5 ხოლო ვინც ომობს, ვერ გახდება გვირგვინის ღირსი, თუკი არასჯულიერად ომობს. "},
	{6, "6 მიწის მუშაკმა ყველაზე უმალ უნდა იგემოს ნაყოფი. "},
	{7, "7 დაუფიქრდი ჩემს ნათქვამს, რადგანაც ღმერთი მოგცემს ყველაფრის გაგების უნარს. "},
	{8, "8 გახსოვდეს იესო ქრისტე, დავითის თესლისაგან, მკვდრეთით აღმდგარი, ჩემი სახარების მიხედვით. "},
	{9, "9 ვისთვისაც ვევნები თვით ბორკილებამდე, როგორც ბოროტმოქმედი, მაგრამ ღვთის სიტყვას ვერ დაადებ ბორკილს. "},
	{10, "10 ამიტომ ყველაფერს ვითმენ რჩეულთათვის, რომ მათაც ჰპოვონ ხსნა ქრისტე იესოში საუკუნო დიდებით. "},
	{11, "11 სარწმუნოა სიტყვა: თუ მასთან ერთად მოვკვდით, მასთან ერთადვე ვიცოცხლებთ. "},
	{12, "12 თუ დავითმენთ, მასთან ერთადვე ვიმეფებთ, ხოლო თუ უარვყოფთ, ისიც უარგვყოფს ჩვენ. "},
	{13, "13 რომც არ ვირწმუნოთ, ის მაინც სარწმუნოა, რადგანაც თავის თავს ვერ განუდგება. "},
	{14, "14 ეს შეახსენე მათ და უმოწმე უფლის წინაშე, თავი ანებონ სიტყვიერ ჭიდილს, რომელიც არას გვარგია და მსმენელებს კი თავგზას აუბნევს. "},
	{15, "15 ეცადე რჩეულად, პირნათელ მუშაკად და ჭეშმარიტების სიტყვის სარწმუნო მქადაგებლად წარუდგე ღმერთს. "},
	{16, "16 ფუჭ ყბედობას კი ერიდე, რადგანაც უფრო გაღრმავდება ხალხის უღმერთოება. "},
	{17, "17 და მათი სიტყვა სირსვილივით საძოვარს ჰპოვებს, როგორც ჰიმენიოსის და ფილეტოსისა, "},
	{18, "18 ჭეშმარიტებისგან გამდგარნი რომ ამტკიცებენ, აღდგომა უკვე იყოო, და რწმენას უხშობენ ზოგიერთს. "},
	{19, "19 მაგრამ ურყევი საფუძველი ღვთისა მტკიცეა და აქვს ეს ბეჭედი: „იცის უფალმა, ვინაა მისი“, და: „განუდგეს უსამართლობას ყველა, ვინც აღიარებს უფლის სახელს“. "},
	{20, "20 დიდ სახლში ჭურჭელი არა მარტო ოქრო-ვერცხლისაა, არამედ ხისა და თიხისაც, ზოგი საპატიოდ, ზოგი კი უპატიოდ სახმარი. "},
	{21, "21 ვინც ყოველივე ამისაგან განიწმენდს თავს, საპატიო ჭურჭელი იქნება, განწმენდილი, უფლისთვის სასურველი, ყოველი კეთილი საქმისთვის გამზადებული. "},
	{22, "22 ილტვოდე სიჭაბუკის გულისთქმათაგან; მისდიე სიმართლეს, რწმენას, სიყვარულს, მშვიდობას ყველასთან ერთად, ვინც წმიდა გულით მოუხმობს უფალს. "},
	{23, "23 ბრიყვულსა და უგუნურ დავას ერიდე: იცოდე, რომ ეს იწვევს სიტყვიერ ბრძოლებს. "},
	{24, "24 უფლის მონას კი არ შეშვენის. სიტყვით ბრძოლა, არამედ ალერსიანი უნდა იყოს ყველას მიმართ, დამმოძღვრავი, შემწყნარებელი;"},
	{25, "25 თვინიერებით არწმუნებდეს წინააღმდგომთ, ეგება მისცეს მათ უფალმა სინანული ჭეშმარიტების შესამეცნებლად. "},
	{26, "26 რათა თავი დააღწიონ ეშმაკის მახეს, რომელმაც თავისი ნებით შეიპყრო ისინი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 ეს კი იცოდე, რომ უკანასკნელ დღეებში მოიწევა საზარელი ჟამი. "},
	{2, "2 რადგანაც კაცნი იქნებიან თვითმოყვარენი, ვერცხლის მოყვარენი, ქედმაღალნი, ამპარტავანნი, მგმობელნი, მშობლების ურჩნი, უმადურნი, უღირსნი, "},
	{3, "3 კაცთმოძულენი, გულღრძონი, მაბეზღარნი, აღვირახსნილნი, გულმხეცნი, სიკეთის მოძულენი, "},
	{4, "4 გამცემნი, თავხედნი, მზვაობარნი, უფრო განცხრომის მოყვარენი, ვიდრე ღმრთისა, "},
	{5, "5 მოჩვენებითად ღვთისმსახურნი, სინამდვილეში კი მისი ძალის უარმყოფელნი; ამნაირთაგან შორს დაიჭირე თავი. "},
	{6, "6 სწორედ ისინი არიან, ზაკვით რომ იპარებიან სახლებში და ატყვევებენ ცოდვებით დამძიმებულსა და სხვადასხვა ვნებით შეპყრობილ ქალებს; "},
	{7, "7 ერთავად რომ სწავლობენ, მაგრამ ვერასგზით ვერ აღწევენ ჭეშმარიტების შემეცნებას. "},
	{8, "8 როგორც იანე და იამბრე უპირისპირდებოდნენ მოსეს, ისე ესენიც უპირისპირდებიან ჭეშმარიტებას: გონებაგახრწნილი კაცნი, რწმენაში უმეცარნი. "},
	{9, "9 მაგრამ ამას იქით ვეღარსად წავლენ, რადგან ამათი უმეცრება ისევე ცხადი გახდება ყველასთვის, როგორც იმათი. "},
	{10, "10 შენ კი გამოჰყევ ჩემს მოძღვრებას, სარბიელს, ზრახვას, რწმენას, დიდსულოვნებას, სიყვარულს, მოთმინებას, "},
	{11, "11 დევნილობას, ვნებას, რაც დავითმინე ანტიოქიაში, იკონიაში, ლისტრეში, მაგრამ ყველაფრისგან მიხსნა უფალმა. "},
	{12, "12 ვისაც სურს ღვთისმოსაობით ცხოვრობდეს ქრისტე იესოში, ჩემსავით დევნილი იქნება. "},
	{13, "13 უკეთურნი და გრძნეულნი კი უფრო შორს წავლენ: სხვებსაც აცდუნებენ და თვითონაც შეცდებიან. "},
	{14, "14 შენ კი დამკვიდრდი იმაში, რაც გისწავლია და გიწამებია; გახსოვდეს, ვის მიერ ხარ განსწავლული. "},
	{15, "15 თანაც, აკი სიყრმითგანვე იცნობ საღმრთო წერილსაც, რომელსაც შენი გაბრძნობა ძალუძს, რათა ცხონდე ქრისტე იესოს რწმენით. "},
	{16, "16 მთელი წერილი ღვთივსულიერია და სარგო-სასწავღად, სამხილებლად, გამოსასწორებლად და სიმართლის შესაგონებლად, "},
	{17, "17 რათა ღვთის კაცი სრულქმნილი იყოს, ყოველი კეთილი საქმის აღსასრულებლად გამზადებული. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 ამრიგად, მოგიწოდებ ღვთისა და უფალ ქრისტე იესოს წინაშე, თავისი გამოცხადებით და სასუფევლით რომ განიკითხავს ცოცხალთაც და მკვდართაც, "},
	{2, "2 იქადაგე სიტყვა, თავს ადექ დროულად თუ უდროოდ, ამხილე, შერისხე, შეაგონე მთელი დიდსულოვნებით და სწავლებით, "},
	{3, "3 რადგანაც მოვა დრო, როცა აღარ გაიზიარებენ მასულდგმულებელ მოძღვრებას, არამედ თავიანთი ჟინით შეკრებენ მოძღვრებს, რათა მათი სიტყვები საამოდ ელამუნოს მათ სმენას, "},
	{4, "4 ყურს აღარ ათხოვებენ ჭეშმარიტებას და ზღაპრებს მიუბრუნდებიან. "},
	{5, "5 მაგრამ შენ ყოველ წამს ფხიზლად იყავი, დაითმინე ბოროტება, აკეთე მახარებლის საქმე და კეთილად აღასრულე შენი მსახურება. "},
	{6, "6 რადგან მე უკვე გამზადებული ვარ სამსხვერპლოდ და ახლოვდება ჩემი მიქცევის ჟამი. "},
	{7, "7 კეთილი ღვაწლით მიღვაწნია, სარბიელი გამილევია, რწმენა შემინახავს, "},
	{8, "8 ამიერიდან მიმელის სიმართლის გვირგვინი, რომელსაც მომცემს მე მართლად განმკითხე უფალი იმ დღეს, და არა მარტო მე, არამედ ყველას, ვინც შეიყვარა მოვლინება მისი. "},
	{9, "9 ეცადე მალე მოხვიდე ჩემთან. "},
	{10, "10 რადგანაც დემასმა მიმატოვა, შეიყვარა ეს საწუთრო და თესალონიკეში წავიდა, კრესკე - გალატეას, ტიტე - დალმაციას; ლუკაღა დარჩა ჩემთან. "},
	{11, "11 მარკოზი დასძარი და წამოიყვანე, რადგანაც მსახურებისთვის მჭირდება. "},
	{12, "12 ტიქიკოსი ეფესოს წარვგზავნე. "},
	{13, "13 როცა წამოხვალ, მოსასხამი წამომიღე, ტროაში, კარპესთან რომ დავტოვე; აგრეთე წიგნები, მეტადრე ტყავზე ნაწერი. "},
	{14, "14 ალექსანდრე მჭედელმა სიცოცხლე გამიმწარა, მისი საქმისამებრ მიაგებს მას უფალი. "},
	{15, "15 შენც ერიდე, რადგანაც თავგამოდებით აღუდგა წინ ჩვენს სიტყვებს. "},
	{16, "16 ჩემი პირველი თავის მართლებისას არავინ ამომიდგა მხარში, არამედ ყველამ მიმატოვა. ნუ მიეთვლება მათ. "},
	{17, "17 მაგრამ უფალი დამიდგა გვერდით და განმამტკიცა, რათა ჩემი მეშვეობით აღსრულებულიყო ქადაგება და ესმინა ყველა წარმართს; ასე დავაღწიე თავი ლომის ხახას. "},
	{18, "18 უფალივე დამიხსნის ყოველი ბოროტი საქმისაგან და მაცხონებს თავის ზეციურ სასუფეველში. დიდება მას უკუნითი უკუნისამდე. ამინ. "},
	{19, "19 მომიკითხე პრისკილა და აკვილა, აგრეთვე ონესიფორეს სახლი. "},
	{20, "20 ერასტოსი კორინთოში დარჩა, ტროფიმე კი ავადმყოფი დავტოვე მილეტში. "},
	{21, "21 ეცადე ზამთარს დაასწრო მოსვლა. მოგიკითხავენ ევბულე, პუდე, ლიმოსი, კლავდია და ყველა ძმანი. "},
	{22, "22 უფალი იყოს შენს სულთან, მადლი თქვენდა. ამინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};