#include <map>
#include <string>
class Bible55
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
	struct ka6	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 პავლე, მოციქული არა კაცთაგან და არც კაცის მიერ, არამედ იესო ქრისტესა და მამა ღმერთისაგან, რომელმაც აღადგინა იგი მკვდრეთით, "},
	{2, "2 და ჩემთან მყოფი ყველა ძმა - გალატიის ეკლესიებს: "},
	{3, "3 მადლი თქვენდა და მშვიდობა ჩვენი მამა ღმერთისა და უფალ იესო ქრისტესაგან, "},
	{4, "4 რომელმაც ჩვენი ცოდვებისათვის მისცა თავისი თავი, რათა დავეხსენით ამ უკეთური ქვეყნისგან ჩვენი მამა ღმერთის ნება-სურვილით, "},
	{5, "5 ვისიცაა დიდება უკუნითი უკუნისამდე. ამინ. "},
	{6, "6 მიკვირს, რომ იმისაგან, ვინც ქრისტეს მადლით გიხმოთ, ასე მალე გადახვედით სხვა სახარებაზე. "},
	{7, "7 თუმცა არ არსებობს სხვა სახარება, არიან მხოლოდ ზოგიერთნი, რომელნიც გამღვრევენ და ცდილობენ შერყვნან ქრისტეს სახარება. "},
	{8, "8 მაგრამ ჩვენ კი არა, თვით ანგელოსმა ზეცითაც რომ გახაროთ სხვა სახარება, და არა ის, რაც გვიხარებია, წყეულიმც იყოს. "},
	{9, "9 რაც უწინ მითქვამს, ახლაც იმასვე ვიტყვი: ვინც სხვა რამეს გახარებთ და არა იმას, რაც მიგიღიათ, წყეულიმც იყოს. "},
	{10, "10 ხოლო ამჟამად ხალხს ვარწმუნებ თუ ღმერთს? ან იქნებ ვცდილობ ხალხს ვაამო? ეს რომ კვლავაც ჩემი მიზანი იყოს, აღარ ვიქნებოდი მონა ქრისტესი. "},
	{11, "11 გაუწყებთ, ძმანო, რომ სახარება, რომელიც ჩემგან გეხარათ, არ არის კაცის მიერი, "},
	{12, "12 ვინაიდან მეც კაცისგან როდი მიმიღია ან მისწავლია, არამედ იესო ქრისტეს გამოცხადებით. "},
	{13, "13 თქვენ გსმენიათ, როგორ ვიქცეოდი ოდესღაც იუდეველობაში, რა სასტიკად ვდევნიდი ღვთის ეკლესიას და ვარბევდი მას. "},
	{14, "14 ასე რომ, აღვემატებოდი იუდეველობაში ყველა ტოლსწორს ჩემი მოდგმისას, რადგანაც უკიდურესი გულმოდგინებით ვიცავდი მამაპაპეულ გადმოცემებს. "},
	{15, "15 ხოლო როდესაც ღმერთმა, დედის საშოდანვე რომ ამირჩია და თავისი მადლით მიხმო, - "},
	{16, "16 კეთილინება თვისი ძე გამოეცხადებინა ჩემში, რათა წარმართთათვის მეხარებინა იგი, მაშინვე როდი დავკითხვივარ სისხლსა და ხორცს. "},
	{17, "17 არც იერუსალიმს ავსულვარ, ჩემს წინამორბედ მოციქულებთან, არამედ არაბიას წავედი და კვლავ დავბრუნდი დამასკოს. "},
	{18, "18 სამი წლის შემდეგ კი პეტრეს სანახავად ავედი იერუსალიმს და თხუთმეტი დღე დავყავი მასთან. "},
	{19, "19 სხვა მოციქულთაგან არავინ მინახავს, უფლის ძმის, იაკობის გარდა. "},
	{20, "20 ხოლო იმაში, რასაცა გწერთ, ღმერთია მოწმე, არ ვცრუობ. "},
	{21, "21 შემდგომ ამისა, სირიასა და კილიკიაში ჩავედი. "},
	{22, "22 ხოლო ქრისტეს ეკლესიები იუდეაში პირადად არ მიცნობდნენ მე. - "},
	{23, "23 მხოლოდ ის სმენოდათ, რომ ოდესღაც მათი მდევნელი ამჟამად ახარებს რწმენას, რომელსაც უწინ ებრძოდა. "},
	{24, "24 და ადიდებდნენ ღმერთს ჩემს გამო. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 თოთხმეტი წლის შემდეგ კვლავ ავედი იერუსალიმს ბარნაბასთან ერთად, და თან ვიახლე ტიტეც. "},
	{2, "2 ასვლით კი გამოცხადებით ავედი და იქაურებს (უპირატესად - ყველაზე ცნობილთ) წარვუდგინე სახარება, რომელსაც ვქადაგებ წარმართთა შორის: ამაოდ ხომ არ მიწვალია, ან ვწვალობ-მეთქი. "},
	{3, "3 მაგრამ თვით ჩემთან მყოფი ტიტეც კი, მიუხედავად იმისა, რომ ბერძენია, არ გაუხდიათ იძულებული, წინადაეცვითა. "},
	{4, "4 შემოპარულ ცრუ ძმებს კი, მალულად რომ შემოძვრნენ, რათა ეთვალთვალებინათ ჩვენი თავისუფლებისათვის, რომელიც გვაქვს ქრისტე იესოში, და ამრიგად, დავემონებინეთ, - "},
	{5, "5 წამითაც არა დავუთმეთ რა და არ დავემორჩილეთ, რათა სახარების ჭეშმარიტება დარჩენილიყო თქვენში. "},
	{6, "6 ხოლო მათ, ვინც ყველაზე ცნობილნი ჩანდნენ (როგორნი იყვნენ ისინი უწინ, მე არ დავეძებ: ღმერთი არ უყურებს სახეს კაცისას), მეტი არაფერი დაუვალებიათ ჩემთვის. "},
	{7, "7 პირიქით, როცა დაინახე, რომ მე მომენდო ხარება წინადაუცვეთელთათვის, ისევე, როგორც პეტრეს - წინადაცვეთილთათვის "},
	{8, "8 (რადგან ვინც წინადაცვეთილთა შორის მოციქულობაში შეეწია პეტრეს, მეც შემეწია წარმართთა შორის) "},
	{9, "9 და შეიცნეს მადლი, რომელიც მომეცა, ბურჯებად მიჩნეულმა იაკობმა, კეფამ და იოანემ თანაზიარობის მარჯვენა გამოგვიწოდეს მე და ბარნაბას, რათა ჩვენ წარმართებთან წავსულიყავით, ისინი კი - წინადაცვეთილებთან. "},
	{10, "10 მხოლოდ უნდა გვხსომებოდა ღატაკნი, და მე გულმოდგინედ ვცდილობდი ამესრულებინა ეს. "},
	{11, "11 მაგრამ, როცა ანტიოქიაში მოვიდა პეტრე, წინ აღვუდექი მას, რადგანაც გასაკიცხი იყო; "},
	{12, "12 ვინაიდან იაკობის მიერ ზოგიერთი წარმოგზავნილის მოსვლამდე წარმართებთან ერთად ჭამდა, ხოლო მათი მოსვლის შემდეგ განდგა და განცალკევდა წინადაცვეთილთა შიშით. "},
	{13, "13 მასთან ერთად თვალთმაქცობდნენ დანარჩენი იუდეველნიც, ასე რომ, თვით ბარნაბაც კი ჩაითრია მათმა თვალთმაქცობამ. "},
	{14, "14 მაგრამ, როდესაც დავრწმუნღი, რომ წრფელი გზით როდი მიდიან სახარებისეული ჭეშმარიტებისკენ, ყველას წინაშე ვუთხარი კეფას: თუკი შენ, იუდეველი, წარმართულად ცხოვრობ და არა იუდეურად, რატომღა აიძულებ წარმართებს, რომ იუდეველობდნენ? "},
	{15, "15 ჩვენ ბუნებით იუდეველნი ვართ და არა ცოდვილი წარმართნი. "},
	{16, "16 მაგრამ რაკიღა გავიგეთ, რომ კაცი რჯულის საქმეთაგან როდი გამართლდება, არამედ იესო ქრისტეს რწმენით, ჩვენც ვირწმუნეთ იესო ქრისტე, რათა ქრისტე იესოს რწმენით გავმართლდეთ და არა რჯულის საქმით, რადგანაც რჯულის საქმით ვერ გამართლდება ვერცერთი ხორციელი. "},
	{17, "17 ხოლო თუ ქრისტეში ვეძებთ გამართლებას, მაგრამ თვითონ კი ვცოდეთ, ნუთუ ქრისტე ცოდვის მსახურთა? არამც და არამც. "},
	{18, "18 რადგანაც თუ კვლავ ვაგებ იმას, რაც დავანგრიე, ხომ შემცოდედ ვავლენ ჩემს თავს? "},
	{19, "19 ვინაიდან მე რჯულით მოვკვდი რჯულისათვის, რათა ვიცოცხლო ღვთისათვის. "},
	{20, "20 ქრისტესთან ერთად ვეცვი ჯვარს, და მე კი აღარა ვცოცხლობ, არამედ ქრისტე ცოცხლობს ჩემში, ხოლო თუ ახლა ხორციელად ვცოცხლობ, რწმენითა ვცოცხლობ ღვთის ძეში, რომელმაც შემიყვარა მე და თავისი თავი მისცა ჩემთვის. "},
	{21, "21 არ უგულებელვყოფ ღვთის მადლს, რადგან თუ გამართლება რჯულისგანაა, მაშინ ამაოდ მომკვდარა ქრისტე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 ეჰა, უგუნურო გალატელნო! ვინ მოგნუსხათ ისე, რომ აღარ ემორჩილებით ჭეშმარიტებას? თქვენ, ვის თვალწინაც გამოისახა იესო ქრისტე, როგორც თქვენშივე ჯვარცმული? "},
	{2, "2 მხოლოდ ეს მინდა ვიცოდე თქვენგან: რჯულის საქმეთაგან მიიღეთ სული თუ რწმენის შესმენით? "},
	{3, "3 ნუთუ იმდენად უგუნურნი ხართ, რომ სულით დაიწყეთ და ხორცით კი ამთავრებთ? "},
	{4, "4 ნუთუ ამაოდ დაითმინეთ ამდენი რამე? ოჰ, ნეტა მხოლოდ ამაოდ! "},
	{5, "5 ვინც სულს გაძლევთ და სასწაულებს ახდენს თქვენს შორის, რჯულის საქმეებით ახდენს ამას თუ რწმენის შესმენით? "},
	{6, "6 როგორც აბრაამმა ირწმუნა ღმერთი, და სიმართლედ შეერაცხა მას. "},
	{7, "7 მაშ, იცოდეთ, რომ ვინც რწმენისაგან არიან, აბრაამის ძენი არიან. "},
	{8, "8 და წერილმა, რომელიც წინასწარ ჭვრეტდა, რომ ღმერთი რწმენით გაამართლებდა წარმართებს, წინასწარვე ახარა აბრაამს: „შენში იკურთხება ყველა ხალხი“. "},
	{9, "9 ასე რომ, ვინც რწმენისაგან არიან, მორწმუნე აბრაამთან ერთად იკურთხებიან. "},
	{10, "10 ხოლო ვინც რჯულის საქმეთაგან არიან, წყევლის ქვეშ არიან, რადგანაც დაწერილია: „წყეულიმც იყოს, ვინც გამუდმებით არ ასრულებს ყველაფერს, რაც ჩაწერილია წიგნში“. "},
	{11, "11 ცხადია, რომ რჯულით ვერავინ გამართლდება ღვთის წინაშე, ვინაიდან „მართალი იცოცხლებს რწმენით“. "},
	{12, "12 ხოლო რჯული რწმენით როდია, არამედ ვინც მას აღასრულებს, მისითვე იცოცხლებს. "},
	{13, "13 ქრისტემ გამოგვისყიდა რჯულის წყევლისაგან და თვითონ დაიწყევლა ჩვენთვის: რადგანაც დაწერილია: „წყეულია ყველა, ვინც ჰკიდია ძელზე“, "},
	{14, "14 რათა აბრაამის კურთხევა იესო ქრისტეს მეოხებით გავრცელდეს წარმართებზედაც და, ამრიგად, მივიღოთ აღთქმა სულისა რწმენით. "},
	{15, "15 კაცთა ჩვევისამებრ განვსაჯოთ, ძმანო: თვით კაცის მიერ დამტკიცებულ ანდერძსაც კი ვერავინ დაარღვევს და ვერც ვერაფერს დაუმატებს მას. "},
	{16, "16 ხოლო ეს აღთქმანი აბრაამს და მის თესლს მიეცა. არ თქმულა: „მის თესლთაც“, როგორც ითქმის მრავალზე, არამედ ერთზე ითქვა („შენს თესლსაც“), რომელიც არის ქრისტე. "},
	{17, "17 მე კი ვამბობ: ღვთის მიერ დამტკიცებულ აღთქმას ისე როდი აუქმებს ოთხას ოცდაათი წლის შემდეგ მოვლენილი რჯული, რომ ძალა დაკარგოს აღთქმამ. "},
	{18, "18 რადგან თუ მემკვიდრეობა რჯულითაა, მაშინ უკვე აღარ არის აღთქმით. მაგრამ ღმერთმა აღთქმით მიჰმადლა იგი აბრაამს. "},
	{19, "19 კი მაგრამ, რაღაა რჯული? ის მოცემულ იქნა შეცოდებათა გამო, ვიდრე მოვიდოდა თესლი, ვისთვისაც დაიდო აღთქმა და გადმოცემულ იქნა ანგელოზთა მიერ, შუამავლის ხელით. "},
	{20, "20 მაგრამ შუამავალი შეუძლებელია ერთის მიმართ იყოს შუამავალი, ღმერთი კი ერთია. "},
	{21, "21 მაშ, რჯული ეწინააღმდეგება ღვთის აღთქმათ? არამც და არამც. ვინაიდან მოცემული რომ ყოფილიყო რჯული, რომელსაც შეეძლებოდა სიცოცხლის მონიჭება, მაშინ ჭეშმარიტად რჯულისგან იქმნებოდა სიმართლე. "},
	{22, "22 მაგრამ წერილმა ცოდვის ქვეშ მოამწყვდია ყველა, რათა აღთქმული სიკეთე იესო ქრისტეს რწმენით მისცემოდა მორწმუნეთ. "},
	{23, "23 რწმენის მოვლინებამდე კი რჯულის მეთვალყურეობის ქვეშ ვიყავით მომწყვდეულნი, ვიდრე გამოჩნდებოდა რწმენა. "},
	{24, "24 ასე რომ, რჯული ჩვენი აღმზრდელი აღმოჩნდა, რომელმაც მიგვგვარა ქრისტეს, რათა რწმენით გავმართლებულიყავით. "},
	{25, "25 ხოლო რწმენის მოვლინების შემდეგ უკვე აღარა ვართ აღმზრდელის მეთვალყურეობის ქვეშ. "},
	{26, "26 რადგან ყველანი ღვთის შვილები ხართ იესო ქრისტეს რწმენით. "},
	{27, "27 ვინაიდან ყველანი, ვინც ქრისტეში მოინათლეთ, ქრისტეთივე შეიმოსენით. "},
	{28, "28 აღარ არის იუდეველი, აღარც ბერძენი, აღარც მონა და აღარც თავისუფალი, აღარც მამრი და აღარც მდედრი, რადგანაც ყველანი ერთი ხართ ქრისტე იესოში. "},
	{29, "29 ხოლო თუ ქრისტესნი ხართ, მაშასადამე, აბრაამის თესლი ხართ და, აღთქმის თანახმად, - მემკვიდრენიც. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 ამასაც ვიტყვი: ვიდრე მემკვიდრე ყრმაა, არაფრით არ განირჩევა მონისაგან, თუმცა ყველაფრის ბატონ-პატრონია. "},
	{2, "2 არამედ, მამის მიერ მიჩენილ დრომდე, მზრუნველებსა და მეურვეებს ემორჩილება. "},
	{3, "3 ასევე ჩვენც, ვიდრე ყრმანი ვიყავით, ქვეყნიერების ნივთიერ საწყისთ ვემონებოდით. "},
	{4, "4 მაგრამ, როდესაც მოიწია დროის სისრულე, ღმერთმა მოავლინა თავისი ძე, რომელიც იშვა ქალისაგან და დაემორჩილა რჯულს. "},
	{5, "5 რათა გამოესყიდა რჯულიქვეშ მყოფნი და, ამრიგად, მიგვეღო ძეობა. "},
	{6, "6 ხოლო რაკი ძენი ხართ, ღმერთმა მოავლინა თქვენს გულებში თავისი ძის სული, რომელიც ღაღადებს: „აბბა, მამაო“! "},
	{7, "7 ასე რომ, მონა კი აღარა ხარ, არამედ ძე: ხოლო თუ ძე ხარ, მემკვიდრეცა ხარ ღვთის მიერ. "},
	{8, "8 მაგრამ მაშინ არ იცნობდით ღმერთს და მსახურებდით მათ, რომელნიც, ბუნებით, არც არიან ღმერთები. "},
	{9, "9 ახლა კი, როცა იცანით ღმერთი, ან, უფრო სწორად, ღმერთმა გიცნოთ, როგორღა უბრუნდებით ქვეყნიერების უმწეო და უბადრუკ საწყისთ, რათა კვლავ მათ დაემონოთ? "},
	{10, "10 დღეებს და თვეებს, წელიწადის დროებსა და წლებს უკვირდებით. "},
	{11, "11 ვშიშობ, ვაითუ ამაოდ გავისარჯე თქვენი გულისთვის. "},
	{12, "12 გევედრებით, ძმანო, ჩემსავით იყავით, ვინაიდან მეც თქვენსავით ვარ. არაფერი დაგიშავებიათ ჩემთვის. "},
	{13, "13 ეს კი იცით, რომ პირველად ხორცის უძლურებით გახარეთ. "},
	{14, "14 მაგრამ თქვენ არ შეიზიზღეთ და არც უგულებელყავით ჩემი ხორციელი განსაცდელი, არამედ შემიწყნარეთ, როგორც ღვთის ანგელოზი, როგორც ქრისტე იესო. "},
	{15, "15 სად არის თქვენი მაშინდელი ნეტარება? რადგანაც გემოწმებით: შესაძლებელი რომ ყოფილიყო, ალბათ, თვალებსაც დაითხრიდით და მე მომცემდით. "},
	{16, "16 მერედა, ნუთუ მტრად გექეცით იმის შედეგად, რომ ჭეშმარიტებას გიქადაგებთ? "},
	{17, "17 თქვენდა სასიკეთოდ როდი მცდელობენ, არამედ სურთ ჩვენგან გაგრიყონ, რათა თავი გამოიდოთ მათთვის. "},
	{18, "18 მაგრამ სასიკეთოა მუდმივი მცდელობა სიკეთისათვის, და არა მარტო მაშინ, როცა თქვენთანა ვარ. "},
	{19, "19 შვილნო ჩემნო, რომელთათვისაც კვლავაც მშობიარობის სალმობით მელმის, ვიდრე თქვენში გამოისახებოდეს ქრისტე. "},
	{20, "20 ოჰ, ნეტა თქვენს შორის ვიყო და ხმა გამომაცვლევინა, ვინაიდან აღარა მესმის რა თქვენი. "},
	{21, "21 მითხარით, რჯულის ქვეშ ყოფნის მოსურნენო, უსმენთ თუ არა რჯულს? "},
	{22, "22 რადგანაც დაწერილია, რომ ორი ძე ჰყავდა აბრაამს, ერთი მხევლისაგან, მეორე კი - თავისუფალი ქალისაგან. "},
	{23, "23 მაგრამ მხევლისა ხორცისაგან შობილი იყო, ხოლო თავისუფლისა - აღთქმისაგან, "},
	{24, "24 რაც არის ქარაგმა; ესაა ორი აღთქმა: ერთი სინას მთით, მონის მშობელი, ანუ აგარი, "},
	{25, "25 რადგანაც აგარი იგივე სინას მთაა არაბეთში და შეესატყვისება აწინდელ იერუსალიმს, ვინაიდან თავისი შვილებითურთ მონობაშია. "},
	{26, "26 ხოლო ზენა იერუსალიმი თავისუფალია: ის არის ჩვენი დედა. "},
	{27, "27 რადგანაც დაწერილია: „გიხაროდეს, უნაყოფოვ, რომელსაც არ გიშობია; იმძლავრე და იღაღადე, შობის სალმობით ულმობო, ვინაიდან მიტოვებულს მეტი შვილი ეყოლება, ვიდრე ქმრიანს“. "},
	{28, "28 ხოლო თქვენ, ძმანო, როგორც ისააკი, აღთქმის შვილები ხართ. "},
	{29, "29 და როგორც მაშინ ხორციელად შობილი სდევნიდა სულიერს, ასევე ახლაც. "},
	{30, "30 მაგრამ რას ამბობს წერილი? „განდევნე მხევალი თავისი ძითურთ, ვინაიდან ძე მხევლისა ვერ იქნება თავისუფლის ძის თანამემკვიდრე“. "},
	{31, "31 ასე რომ, ძმანო, მხევლის ძენი კი არა ვართ, არამედ თავისუფლისა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 თავისუფლებისათვის გაგვათავისუფლა ქრისტემ: მაშ, მტკიცედ იდექით და ნუღარ დაიდგამთ მონობის უღელს. "},
	{2, "2 აჰა, მე, პავლე, გეუბნებით თქვენ: თუ წინადაიცვეთთ, ვერაფერს ირგებთ ქრისტესაგან. "},
	{3, "3 კვლავაც ვუმოწმებ ყველას, ვინც წინადაიცვეთს, რომ მთელი რჯულის აღსრულება მართებს. "},
	{4, "4 ხოლო თქვენ, რჯულით რომ იმართლებთ თავს, უქრისტეოდ დარჩით და მოაკლდით მადლს. "},
	{5, "5 ჩვენ კი სულით მოველით სიმართლის სასოებას რწმენისგან. "},
	{6, "6 რადგანაც ქრისტე იესოში არც წინადაცვეთილობასა აქვს რაიმე ძალა და არც წინადაუცვეთელობას, არამედ რწმენას, რომელიც მოქმედებს სიყვარულით. "},
	{7, "7 მშვენივრად რბოდით და ვინ შეგაფერხათ, რომ აღარ ჰმორჩილებდეთ ჭეშმარიტებას? "},
	{8, "8 ეს შეგონება მისეული როდია, ვინც გიხმობთ. "},
	{9, "9 მცირეოდენი საფუარი მთელ ცომს აფუებს. "},
	{10, "10 მწამს თქვენი უფალში, რომ არ გექნებათ სხვა აზრი: ვინც უნდა იყოს თქვენი ამამღვრეველი, ვერსად წაუვა მსჯავრს. "},
	{11, "11 რისთვისღა მდევნიან, ძმანო, თუკი კვლავ ვქადაგებ წინადაცვეთას? მაშინ ხომ შეწყდებოდა ცთუნება ჯვრისა. "},
	{12, "12 ნეტავი მოიკვეთონ თქვენი ამმღვრევნი. "},
	{13, "13 ხოლო თქვენ, ძმანო, თავისუფლებისთვისა ხართ ხმობილნი, მაგრამ ხორციელ განცხრომას ნუ მოახმართ თავისუფლებას, არამედ სიყვარულით ემსახურეთ ერთმანეთს. "},
	{14, "14 რადგანაც მთელ რჯულს ეს ერთი მცნება მოიცავს: „გიყვარდეს მოყვასი შენი, ვითარცა თავი შენი“. "},
	{15, "15 მაგრამ თუ ერთიმეორეს კბენთ და ჭამთ, ფრთხილად იყავით: შეიძლება სულაც ამოჭამოთ ერთმანეთი. "},
	{16, "16 ჰოდა, მე ვამბობ: სელიერად იარეთ და ნუ ცდილობთ აღასრულოთ ხორცის სურვილი, "},
	{17, "17 რადგან ხორცს სულის საპირისპიროდ სურს, სულს კი - ხორცის საპირისპიროდ; ისინი ერთმანეთს ეურჩებიან, რათა ვერ აღასრულოთ ის, რაცა გსურთ. "},
	{18, "18 თუ სულით იარებით, რჯულის ქვეშ აღარა ხართ. "},
	{19, "19 ხორცის საქმენი აშკარაა: სიძვა, უწმინდურება, აღვირახსნილობა, "},
	{20, "20 კერპთმსახურება, ჯადოქრობა, მტრობა, შუღლი, შური, რისხვა, აშლილობა, მწვალებლობა, "},
	{21, "21 სიძულვილი, მკვლელობა, მემთვრალეობა, ღორმუცელობა და სხვა მისთანანი. წინასწარ გეტყვით, რომ ამის მოქმედნი ვერ დაიმკვიდრებენ ღვთის სასუფეველს. "},
	{22, "22 ხოლო სულის ნაყოფია: სიყვარული, სიხარული, მშვიდობა, დიდსულოვნება, სიტკბოება, სიკეთე, რწმენა, "},
	{23, "23 თვინიერება, თავშეკავება; ამათ წინააღმდეგ არ არის რჯული. "},
	{24, "24 ხოლო მათ, ვინც არიან ქრისტესნი, ჯვარს აცვეს ხორცი მისი სურვილებით და ვნებებითურთ. "},
	{25, "25 თუ სულით ვცოცხლობთ, სულითვე უნდა ვიაროთ. "},
	{26, "26 ნუ ვიქნებით პატივმოყვარენი, ურთიერთგამომწვევნი, ერთურთის მოშურნენი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ka6 poems[] = {
	{1, "1 ძმანო, თუ კაცმა რაიმე ცოდვაში ჩაიდგა ფეხი, თქვენ, ვინცა ხართ სულიერნი, შეაგონეთ მას თვინიერების სულით; დაუკვირდი შენსავე თავს, რათა თავადაც არ ჩავარდე განსაცდელში. "},
	{2, "2 ერთმანეთის ტვირთი იტვირთეთ და ასე აღასრულეთ ქრისტეს რჯული. "},
	{3, "3 რადგან ვისაც რაიმედ მოაქვს თავი და არარა კია, თავისსავე თავს იტყუებს. "},
	{4, "4 თვითეულმა თქვენგანმა გამოსცადოს თავისი საქმე და მაშინ ექნება იმის საბაბი, რომ თავისი თავით იქადოდეს და არა სხვისით. "},
	{5, "5 რადგანაც თვითეული თავის საკუთარ ტვირთს იტვირთავს. "},
	{6, "6 სიტყვით დამოძღვრილი ყოველივე კეთილს უზიარებდეს თავის დამმოძღვრავს. "},
	{7, "7 ნუ შეცდებით, ღმერთს ვერ შეურაცხყოფთ, რადგანაც ვინც რას დასთესს, მასვე მოიმკის. "},
	{8, "8 ვინც ხორცისთვის თესავს, ხორცისგან მოიმკის ხრწნილებას, ხოლო ვინც სულისთვის თესავს, სულისგან მოიმკის საუკუნო სიცოცხლეს. "},
	{9, "9 სიკეთის ქმნა ნუ მოგვბეზრდება, რადგანაც თავის დროზე მოვიმკით, თუ არ მოვიქანცეთ. "},
	{10, "10 მაშ, სანამ დრო გვაქვს, ყველა მოყვასის, უმეტესად კი ჩვენსავე თანამორწმუნეთა სასიკეთოდ ვიღვწოდეთ. "},
	{11, "11 ხომ ხედავთ, რამდენი რამ მოგწერეთ ჩემივე ხელით. "},
	{12, "12 ხორცით თავმოწონების მოსურნენი გაიძულებენ წინადაიცვითოთ, მხოლოდ იმიტომ, რომ არ იდევნებოდნენ ქრისტეს ჯვრისათვის. "},
	{13, "13 ვინაიდან თვით წინადაცვეთილნიც არ იცავენ რჯულს, არამედ უნდათ, რომ წინადაიცვითოთ, რათა იქადოდნენ თქვენი ხორცით. "},
	{14, "14 ხოლო მე ღმერთმა დამიფაროს, რომ სხვა რამით ვიქადოდე და არა ჩვენი უფლის იესო ქრისტეს ჯვრით, რითაც ქვეყანა ჯვარცმულია ჩემთვის, მე კი - ქვეყნისთვის. "},
	{15, "15 რადგანაც ქრისტე იესოში არც წინადაცვეთილობა ნიშნავს რასმე და არც წინადაუცვეთელობა, არამედ მხოლოდ ახალი ქმნილება. "},
	{16, "16 ვინც ამ წესისამებრ იქცევა, მშვიდობა და წყალობა, ისევე, როგორც ისრაელს ღვთისას. "},
	{17, "17 ამას იქით ნუღარავინ შემაწუხებს, რადგანაც ჩემი სხეულით ვზიდავ უფალ იესოს წყლულებს. "},
	{18, "18 ჩვენი უფლის იესო ქრისტეს მადლი იყოს თქვენს სულთან, ძმანო. ამინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};