#include <map>
#include <string>
class Bible29
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 უფლის სიტყვა, რომელიც იყო იოველ ფეთუელის ძის მიმართ: "},
	{2, "2 ისმინეთ ეს, უხუცესებო! ყური დაუგდეთ ყველამ, ქვეყნის მკვიდრნო! თუ მომხდარა ეს თქვენს დროს ან თქვენი მამა-პაპის დროს? "},
	{3, "3 უამბეთ თქვენს შვილებს, თქვენმა შვილებმა თავიანთ შვილებს, მათმა შვილებმა კი სხვა თაობას: "},
	{4, "4 მუხლუხოს გადარჩენილი კალიამ შეჭამა, კალიას გადარჩენილი კუტკალიამ შეჭამა, კუტკალიას გადარჩენილი ბოცომკალმა შეჭამა. "},
	{5, "5 გაიღვიძეთ, ლოთებო! იტირეთ და ივალალეთ, ღვინის მსმელნო, ყურძნის წვენის გამო, ბაგეს რომ მოგწყვიტეს! "},
	{6, "6 რადგან მოადგა ჩემს ქვეყანას ძლიერი და ურიცხვი ხალხი, კბილები მისი ლომის კბილებია, ყბები ძუ ლომისა აქვს. "},
	{7, "7 გამიჩანაგა ვენახი და გადამიხმო ლეღვი, ქერქი გააძრო და მიაგდო; გაუფითრდა ტოტები. "},
	{8, "8 იტირე ძაძით მოსილი ქალწულივით, სიყრმის ქმარს რომ დასტირის! "},
	{9, "9 შეწყდა შესაწირავი და საღვრელი უფლის სახლში; გოდებენ მღვდლები, უფლის მსახურნი. "},
	{10, "10 გაჩანაგდა ყანები, გოდებს მიწა, რადგან გაოხრდა ხორბალი, გაშრა ღვინო, გახმა ზეთისხილი. "},
	{11, "11 გაწბილდნენ მხვნელები, მოთქვამენ მიწისმუშაკები პურზე და ქერზე, რადგან დაიღუპა სამკალი. "},
	{12, "12 გადახმა ვაზი და დაჭკნა ლეღვი, გახმა მინდორში ბროწეული, ფინიკი, ვაშლი და მთელი ხეხილი. ამიტომაც გაუშრა სიხარული ადამის ძეს. "},
	{13, "13 შემოირტყით ჯვალო და იგლოვეთ, მღვდლებო! ივალალეთ, სამსხვერპლოს მსახურნო! წადით, ჯვალოში გაათიეთ ღამე, ჩემი ღვთის მსახურნო! რადგან შეწყდა თქვენი ღვთის სახლში შესაწირავი და საღვრელი. "},
	{14, "14 დათქვით მარხვა, გამოაცხადეთ ჯარობა. შეყარეთ უხუცესნი, ქვეყნის ყოველი მკვიდრი უფლის, თქვენი ღვთის ტაძართან და უფალს შეღაღადეთ. "},
	{15, "15 ვაი ჩვენს დღეს! რადგან ახლოვდება უფლის დღე და დაქცევასავით მოდის უზენაესისგან. "},
	{16, "16 განა ჩვენს თვალწინ არ შეწყდა საზრდო და უფლის სახლში - სიხარული და ლხინი! "},
	{17, "17 ჩალპა მარცვალი კოლბოხების ქვეშ, დაცარიელდა კალოები, დაინგრა ბეღლები რადგან გადახმა პური. "},
	{18, "18 რად კვნესის პირუტყვი, რად ბღავის ნახირი? რადგან აღარ აქვთ საძოვარი, ცხვრის ფარაც შეშფოთებულია. "},
	{19, "19 შენ შეგღაღადებ, უფალო, რადგან ცეცხლმა გადაჭამა უდაბნოს საძოვრები, ალმა გადაბუგა მინდვრის ხეები. "},
	{20, "20 ველის მხეცებიც შენ შემოგყურებენ, რადგან დაიშრიტა წყლის სათავეები და ცეცხლმა გადაჭამა უდაბნოს საძოვრები. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 ჩაბერეთ საყვირს სიონზე, დაეცით ყიჟინა ჩემს წმიდა მთაზე! დაე, შეძრწუნდნენ ქვეყნის მკვიდრნი, რადგან უფლის დღე მოდის, ახლოვდება. "},
	{2, "2 დღე ბნელი და უკუნი, დღე ღრუბლიანი და ჯანღიანი! ბინდივით ეფინება მთებს უშტი და უშქარი, ძლიერი ხალხი, რომლის მსგავსი არ ყოფილა დასაბამიდან და არც მის მერე იქნება მომავალ თაობებში. "},
	{3, "3 მის წინ ცეცხლი ჭამს, მის უკან ალი ბუგავს; მის წინ მიწა ედემის ბაღივითაა, მის უკან უკაცრიელი უდაბნოა, ვერავინ დააღწევს თავს. "},
	{4, "4 ცხენების რემას ჰგვანან და მხედრებივით მიჰქრიან; "},
	{5, "5 ეტლებივით მიგრიალებენ მთათა მწვერვალებზე. ჩალის მჭამელი ცეცხლის ალივით გრიალებენ, როგორც ძლიერი ხალხი, საბრძოლოდ დარაზმული. "},
	{6, "6 მის წინაშე ძრწიან ხალხები, ყველას ფერი მისდის. "},
	{7, "7 ფალავნებივით დარბიან, მეომრებივით ადიან გალავანზე და თითოეული თავის გზას მიჰყვება და არ ბრკოლდებიან გზაში. "},
	{8, "8 ერთმანეთს არ ეხლებიან, თითოეული თავის ბილიკზე მიდის; შუბებზე ეცემიან, მაინც არ იხევენ უკან. "},
	{9, "9 ქალაქში ნავარდობენ, გალავანზე დარბიან, სახლებშიჭრებიან, სარკმლებიდან მიძვრებიან ქურდებივით. "},
	{10, "10 მიწა ტორტმანებს მათ წინაშე, ცა ირყევა, ბნელდება მზე და მთვარე, ვარსკვლავებს ეკარგებათ შუქი. "},
	{11, "11 უფალმა გამოსცა ხმა თავისი მხედრობის წინაშე. რადგან დიდზე დიდია მისი ბანაკი, რადგან ძლიერია სიტყვის ამსრულებელი, რადგან დიდია უფლის დღე და ძალზე საშინელი, ვინ გაუძლებს მას? "},
	{12, "12 ახლაც ამბობს უფალი: მოიქეცით ჩემკენ მთელი გულით, მარხვით და მოთქმა-გოდებით. "},
	{13, "13 გულები დაიგლიჯეთ და არა სამოსელი, დაუბრუნდით უფალს, თქვენს ღმერთს; მოწყალე და შემბრალებელია იგი, სულგრძელი და მრავალმადლიანი, და ნანობს ბოროტის ქმნას. "},
	{14, "14 ვინ იცის, კიდევ შეინანოს და მოიტოვოს კურთხევა, შესაწირავი და საღვრელი უფლისთვის, თქვენი ღვთისთვის. "},
	{15, "15 ჩაბერეთ საყვირს სიონზე, დათქვით მარხვა და გამოაცხადეთ ჯარობა. "},
	{16, "16 შეჰყარეთ ერი, მოიწვიეთ საკრებულო, შეკრიბეთ უხუცესობა, შეყარეთ ჭაბუკები და ძუძუთა ბავშვები! გამოვიდეს სიძე თავისი პალატიდან და პატარძალი - სანთიობოდან! "},
	{17, "17 ატირდებიან კარიბჭესა და სამსხვერპლოს შორის მღვდლები, უფლის მსახურნი, და იტყვიან: შეიწყალე, უფალო, შენი ერი! ნუ გახდი სასირცხვოოდ შენს სამკვიდროს, ნუ ჩააგდებ ხალხების ყბაში! რატომ უნდა ილაპარაკონ: აბა, სად არისო მათი ღმერთი? "},
	{18, "18 გამოესარჩლება უფალი თავის ქვეყანას და დაინდობს თავის ერს. "},
	{19, "19 მიუგებს უფალი და ეტყვის თავის ერს: აჰა, გიგზავნი პურს, ღვინოსა და ზეთს, და გაძეხით ამით; სასირცხოდ აღარ გაგხდით ხალხების თვალში. "},
	{20, "20 ამ ჩრდილოელსაც მოგაშორებთ და შევყრი ურწყავ და უკაცრიელ ქვეყანაში, მის წინა რიგებს - აღმოსავლეთის ზღვაში, უკანა რიგებს - დასავლეთის ზღვაში. აუვა სუნი და ამყრალდება, რადგან ცუდი საქმეები აქვთ ჩადენილი. "},
	{21, "21 ნუ გეშინია, მიწავ, იხარე და იმხიარულე, რადგან დიდი საქმეები მოიმოქმედა უფალმა. "},
	{22, "22 ნუ გეშინიათ, ველის მხეცებო, რადგან ამოვა ბალახი უდაბნოს საძოვრებზე, რადგან ნაყოფს გამოიღებს ხე; ლეღვი და ვაზი გამოსცემენ თავიანთ დოვლათს. "},
	{23, "23 სიონის ძენო, იხარეთ და იმხიარულეთ უფლის, თქვენი ღვთის გამო, რადგან მოგცემთ სიმართლის მოძღვარს, გამოგიგზავნის საადრეო და საგვიანო წვიმას, წინანდებურად. "},
	{24, "24 აივსება ბეღლები ხორბლით და გალიცლიცდება კოდები ღვინით და ზეთით. "},
	{25, "25 აგინაზღაურებთ იმ წლებს, რომლებიც შეჭამეს კალიამ, კუტკალიამ, ბოცომკალმა და მუხლუხომ - ჩემმა ლაშქარმა, რომელიც მოგისიეთ. "},
	{26, "26 ჭამეთ და დაძეხით და ადიდეთ უფლის, თქვენი ღვთის სახელი, რომელიც საკვირველად გექცევათ, და არ შერცხვება ჩემი ერი უკუნისამდე. "},
	{27, "27 მიხვდებით, რომ მე ისრაელის შუაგულში ვარ, რომ მე ვარ უფალი, თქვენი ღმერთი და სხვა არავინ არის, და რომ არ შერცხვება ჩემი ერი უკუნისამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 ამის შემდეგ მოვაფენ ჩემს სულს ყოველ ხორციელზე და გაქადაგდებიან თქვენი ვაჟები და ასულები; თქვენი უხუცესები ნახავენ სიზმრებს და ჭაბუკები ხილვებს იხილავენ. "},
	{2, "2 თქვენს ყმებზეც და მხევლებზეც მოვაფენ იმ დღეს ჩემს სულს. "},
	{3, "3 გამოვაჩენ ნიშნებს ცაზე და მიწაზე: სისხლს, ცეცხლს და კვამლის სვეტებს. "},
	{4, "4 მზე დაბნელდება და მთვარე გასისხლიანდება, სანამ დადგებოდეს უფლის დღე, დიდი და საშინელი. "},
	{5, "5 ყველა, ვინც კი ახსენებს მაშინ უფლის სახელს, გადარჩება, რადგან სიონის შთაზე და იერუსალიმში იქნება ხსნა მათთვისაც, ვისაც უფალი მოუხმობს, როგორც ნათქვამი აქვს უფალს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};