#include <map>
#include <string>
class Bible39
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 განაჩენი, სიტყვა უფლისა ისრაელისადმი მალაქიას პირით: "},
	{2, "2 მე შეგიყვარეთ თქვენ, ამბობს უფალი; თქვენ კი ამბობთ, რისთვის შეგვიყვარეო? განა ესავი იაკობის ძმა არ არის? ამბობს უფალი, მაგრამ მე იაკობი შევიყვარე, "},
	{3, "3 ესავი კი შევიძულე და გავაუკაცრიელე მისი მთები და უდაბნოს ტურებს მივეცი მისი სამკვიდრო. "},
	{4, "4 თუმცა ამბობს ედომი: დარბეული ვართ, მაგრამ კვლავ ავაშენებთ ნაოხარსო. ცაბაოთ უფალი ასე ამბობს: ისინი ააშენებენ და მე დავანგრევ: დაარქმევენ მათ სიბოროტის მხარეს და ისეთ ხალხს, რომელსაც სამუდამოდ შემოსწყრა უფალი. "},
	{5, "5 იხილავენ ამას თქვენი თვალები და იტყვით: იდიდა უფალმა ისრაელის საზღვრებს გარეთ. "},
	{6, "6 შვილი პატივს სცემს მამას და ყმა - თავის ბატონს. თუ მამა ვარ, სად არის ჩემი პატივისცემა? თუ მათი ბატონი ვარ, სად არის ჩემდამი შიში? თქვენ გეუბნებათ ცაბაოთ უფალი, მღვდლებო, ჩემი სახელის შეურაცხმყოფელნო; თქვენ კი ამბობთ: რითი შეურაცხვყავით შენი სახელიო? "},
	{7, "7 მოგაქვთ ჩემს სამსხვერპლოზე წაბილწული პური და ამბობთ: რითი წაგბილწეთო? იმით, რომ ამბობთ: სუფლო ტაბლა შესაზიზღიაო. "},
	{8, "8 ბრმას რომ სწირავთ მსხვერპლად, ბოროტება არ არის? კოჭლი და სნეული რომ მოგყავთ, ბოროტება არ არის? აბა მიართვი იგი შენს ხელისუფალს, თუ მოგიწონოს ანთუ კეთილად შემოგხედოს? ამბობს ცაბაოთ უფალი. "},
	{9, "9 ახლა კი შეევედრეთ ღმერთს, ვინძლო შეგვიწყაღოთ. როგორ შემოგხედოს კეთილად, როცა ეს გამოდის თქვენი ხელიდან? ამბობს ცაბაოთ უფალი. "},
	{10, "10 რომელმა თქვენგანმა დახშა კარი, რომ ფუჭად არ ანთებდეთ ცეცხლს ჩემს სამსხვერპლოზე! არ მეთნევით, ამბობს ცაბაოთ უფალი, და არ მეამება თქვენი ხელით მორთმეული ძღვენი. "},
	{11, "11 რადგან დიდი იქნება ჩემი სახელი ხალხებში მზის აღმოსავლეთიდან დასავლამდე; ყოველ ადგილას დაუკმევენ საკმეველს ჩემს სახელს და წმიდა ძღვენს შემომწირავენ; რადგან დიდი იქნება ჩემი სახელი ხალხებში, ამბობს ცაბაოთ უფალი."},
	{12, "12 თქვენ კი შელახეთ იგი თქვენი ნათქვამით: უფლის ტაბლა წაბილწულიაო და ნაყოფი მისი შესაზიზღიაო საჭმელად. "},
	{13, "13 ამბობთ: აჰა, რა დამქანცველიაო. და გძულთ იგი, ამბობს ცაბაოთ უფალი, და მოგყავთ ნატაცები, კოჭლი და სნეული; ძღვენიც ასეთივე მოგაქვთ - როგორ მეამოს მისი მიღება თქვენი ხელიდან? ამბობს უფალი. "},
	{14, "14 წყეულიმც იყოს ის თვალთმაქცი, ვისაც მამალი პირუტყვი ჰყავს ფარაში, მაგრამ დასაჩიხრებულს აღუთქვამს მსხვერპლად უფალს! რადგან დიდი მეფე ვარ მე, ამბობს ცაბაოთ უფალი, და საშინელია ჩემი სახელი ხალხებში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 ახლა თქვენთვის არის ეს მცნება, მღვდლებო: "},
	{2, "2 თუ არ გაიგონებთ და გულში არ ჩაიდებთ მას, რომ პატივი მიაგოთ ჩემს სახელს, ამბობს ცაბაოთ უფალი, მოვავლენ თქვენზე წყევლას და დავწყევლი თქვენს კურთხევებს. დავწყევლე კიდეც, რადგან არ ჩაგიდევთ გულში. "},
	{3, "3 აჰა, დაგიკავებთ თესლს და პირისახეზე დაგაყრით საკლავის განავალს, თქვენი დღესასწაულების განავალს, და თან წაიღებთ მას."},
	{4, "4 მიხვდებით, რომ მე გამოგიგზავნეთ ეს მცნება ლევიანებთან ჩემი აღთქმის შესანარჩუნებლად, ამბობს ცაბაოთ უფალი. "},
	{5, "5 ჩემი აღთქმა მასთან სასიცოცხლოდ და სამშვიდობოდ იყო და მე მივეცი ეს მათ ჩემი შიშისათვის; რიდი ჰქონდათ ჩემი და ეკრძალვოდნენ ჩემს სახელს. "},
	{6, "6 ჭეშმარიტი რჯული იყო მის პირში და უკეთურება არ იპოვებოდა მის ბაგეებში; მშვიდობით და სიმართლით დადიოდა ჩემს წინაშე და მრავალი მოაქცია ბოროტებისგან. "},
	{7, "7 რადგან მღვდლის ბაგეები უნდა იმარხავდეს ცოდნას და მისი პირიდან უნდა მოელოდნენ რჯულს, რადგან ცაბაოთ უფლის მოციქულია იგი. "},
	{8, "8 თქვენ კი გადაუხვიეთ გზიდან, ბევრი ააცდინეთ რჯულს და დაარღვიეთ ლევიანთა აღთქმა, ამბობს ცაბაოთ უფალი. "},
	{9, "9 მეც საძულველად გაგხდით და დაგამცირებთ ყოველი ხალხის თვალში, რადგან არ დაიცავით ჩემი გზები და მიკერძოებას იჩენდით რჯულში. "},
	{10, "10 განა ერთი მამა არა გვყავს ყველას? განა ერთმა ღმერთმა არ გაგვაჩინა? მაშ, რატომ ვმუხანათობთ ერთმანეთს? რომ შევლახოთ ჩვენი მამა-პაპის აღთქმა? "},
	{11, "11 მუხანათობს იუდა და სისაძაგლე ხდება ისრაელში და იერუსალიმში, რადგან შელახა იუდამ უფლის სიწმიდე, რომელიც უყვარდა, და უცხო ღმერთის ასულს ექმრო. "},
	{12, "12 მოიკვეთს უფალი იაკობის კარვებიდან ამის ჩამდენს - მღვიძარს და ხმისგამცემს და ძღვენის მიმტანს ცაბაოთ უფლისადმი. "},
	{13, "13 აჰა, კიდევ რას აკეთებთ: ცრემლით აფარვინებთ სამსხვერპლოს, ტირილითა და კვნესით, ისე რომ ვეღარ ხედავს ძღვენს და კეთილგანწყობით ვეღარ იღებს თქვენი ხელიდან. "},
	{14, "14 თქვენ ამბობთ: რისთვისო? იმისთვის, რომ მოწმე იყო უფალი შენსა და შენი სიყრმის ცოლს შორის, რომელსაც უღალატე; ის კი შენი მეგობარი და შენი აღთქმის ცოლი იყო. "},
	{15, "15 არავინ ჩაიდენს ამას, ვისაც კი სულის ნატამალი შერჩენია. რას ითხოვს კაცი? შთამომავლობას ღვთისაგან. თქვენც გაუფრთხილდით თქვენს სულს და ნუ უღალატებთ სიყრმის ცოლს. "},
	{16, "16 რადგან მძულს გაყრა, ამბობს უფალი, ისრაელის ღმერთი, და თავისი სამოსელის ძალადობით დამფარველი, ამბობს ცაბაოთ უფალი, გაუფრთხილდით თქვენს სულს და ნუ იქნებით ღალატიანი. "},
	{17, "17 დაღალეთ უფალი თქვენი სიტყვებით და ამბობთ: რითი დავღალეთო? იმით, რომ ამბობთ: ყოველი ბოროტმოქმედი კეთილად უჩნსო უფალს და ისინი უყვარსო მას, ან სად არისო სამართღის ღმერთი? "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 აჰა, მოვავლენ ჩემს ანგელოზს და გაამზადებს გზას ჩემს წინაშე; უეცრად მოვა თავის ტაძარში უფალი, რომელსაც თქვენ ეძიებთ, და აღთქმის ანგელოზი, რომელიც გსურთ. აჰა, მოდის, ამბობს ცაბაოთ უფალი. "},
	{2, "2 ვინ აიტანს მისი მოსვლის დღეს და ვინ გაუძლებს მის გამოცხადებას? რადგან ის გამომდნობელის ცეცხლივით არის და მრეცხავთა მტუტესავით. "},
	{3, "3 დაჯდება ვერცხლის გამომდნობელი და განმწმედელი; განწმედს ლევიანებს და გაასუფთავებს მათ, როგორც ოქროსა და ვერცხლს, რომ სიმართლით მიუძღვნიან უფალს შესაწირავი. "},
	{4, "4 მაშინ საამო იქნება უფლისათვის იუდას და იერუსალიმის შესაწირავი, როგორც ძველ დროში და გარსულ წელიწადებში. "},
	{5, "5 მოვალ თქვენთან განსაკითხავად და ვიქნები ფიცხელი მოწმე ჯადოქართა და მემრუშეთა წინააღმდეგ ცრუმოფიცართაა მოჯამაგირეთა და ქვრივ-ობლების მჩაგვრელთა წინააღმდეგ, ხიზნის გამგდებელთა და ჩემს უშიშთა წინააღმდეგ, ამბობს ცაბაოთ უფალი. "},
	{6, "6 რადგან მე, უფალი, არ ვიცვლები, თქვენც არ დაილევით იაკობის ძენო. "},
	{7, "7 თქვენი მამა-პაპის დღეებიდან მოყოლებული გადადიოდით ჩემს წესებს და არ იცავდით მათ. ახლა მოიქეცი ჩემკენ და მეც მოვიქცევი თქვენკენ, ამბობს ცაბაოთ უფალი. თქვენ კი ამბობთ: რისთვის მოვიქცეთო? "},
	{8, "8 განა ადამიანი მოატყუებს ღმერთს, რომ მატყუებთ მე და ამბობთ: რაში გატყუებთო? მეათედში და შესაწირავში. "},
	{9, "9 წყევლითა ხართ დაწყევლილნი და მაინც მატყუებთ მთელი ხალხი. "},
	{10, "10 მოიტანეთ მთელი მეათედი საგანძურში და იყოს საზრდო ჩემს სახლში. აბა, გამომცადეთ ამით, ამბობს ცაბაოთ უფალი, თუ არ გაგიხსნათ ცის საქანელნი და არ გადმოგიცალოთ კურთხევა აუწყველად. "},
	{11, "11 შენთვის დავაკავებ მჭამელს, რომ არ წაგიხდინოთ მიწის ნაყოფი და არ გაგიპარტახდეთ მინდორში ვაზი, ამბობს ცაბაოთ უფალი. "},
	{12, "12 ნეტარად ჩაგთვლით ყოველი ხალხი, რადგან სანუკვარ ქვეყანაში იცხოვრებთ, ამბობს ცაბაოთ უფალი. "},
	{13, "13 მძლავრობენ ჩემზე თქვენი სიტყვები, ამბობს უფალი; თქვენ კი ამბობთ: რა გვითქვამს შენზეო? "},
	{14, "14 თქვენ ამბობთ: ფუჭია ღვთის მორჩილება, რას გვარგებსო მისი სამსახური და მწუხარედ სიარული ცაბაოთ უფლის წინაშე? "},
	{15, "15 ბედნიერები არიან ამპარტავნებიო, აშენდნენ კიდეც ბოროტმოქმედნი, ღმერთიც კი გამოსცადეს და გადარჩნენო! "},
	{16, "16 როცა უფლის მოშიშნი ლაპარაკობენ ერთმანეთში, ყურს უგდებს უფალი, ესმის და იწერება მის წინაშე სამახსოვრო წიგნი უფლის მოშიშთათვის და მისი სახელის მომხსენიებელთათვის. "},
	{17, "17 ჩემი იქნებიან ისინი, ამბობს უფალი, იმ დღისთვის, როცა უნჯად გავამზადებ მათ და შევიბრალებ, როგორც კაცი შეიბრალებს თავის შვილს, რომელიც მას მორჩილებს. "},
	{18, "18 კვლავ განარჩევთ მართალსა და ბოროტეულს, ღვთის მორჩილსა და მის ურჩს. "},
	{19, "19 რადგან, აჰა, მოდის დღე, თონესავით ავარვარებული და ყველა ამპარტავანი და ავისმოქმედი ჩალა იქნება და გადაბუგავს მათ მომავალი დღე, ამბობს ცაბაოთ უფალი; ისე რომ არ შეარჩენს არც ძირს და არც რტოს. "},
	{20, "20 ამოგიბრწყინდებათ, ჩემი სახელის მოშიშნო, მზე სიმართლისა და კურნება იქნება მის ფრთებზე; თქვენც გამოხვალთ და აკუნტრუშდებით ბაგის ხბოებივით. "},
	{21, "21 გათელავთ ბოროტეულთ, რადგან უნდა გაცამტვერდნენ ისინი თქვენს ტერფებქვეშ იმ დღეს, რომელსაც მე ვამზადებ, ამბობს ცაბაოთ უფალი. "},
	{22, "22 გაიხსენეთ მოსეს, ჩემი მორჩილის, რჯული, რომელიც გამოვუცხადე მას ხორებზე მთელი ისრაელისთვის, და მცნებანი და სამართალნი. "},
	{23, "23 აჰა, მოგივლენთ ელია წინასწარმეტყველს უფლის დღის, დიდის და საშინელის დადგომამდე. "},
	{24, "24 ის შეარიგებს მამების გულს შვილების გულთან და შვილების გულს მამების გულთან, რომ ჩემი მოსვლისას ქვეყანა შეჩვენებით არ შევმუსრო. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};