#include <map>
#include <string>
class Bible60
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 პავლე, სილვანუსი და ტიმოთე - თესალონიკეღთა ეკლესიას ჩვენს მამა ღმერთსა და უფალ იესო ქრისტეში: "},
	{2, "2 მადლი თქვენდა და მშვიდობა ჩვენი მამა ღმერთისა და უფალ იესო ქრისტესაგან. "},
	{3, "3 მოვალენი ვართ, ძმანო, მარადჟამ ვმადლობდეთ ღმერთს თქვენთვის, როგორც ჯერ-არს, ვინაიდან უმეტესად იზრდება თქვენი რწმენა და მრავლდება ყოველი თქვენგანის სიყვარული ერთურთის მიმართ. "},
	{4, "4 ასე რომ, თვითონვე ვიქადით თქვენით ღვთის ეკლესიებში, თქვენი მოთმინებისა და რწმენის გამო ყოველგვარ დევნილობასა და გასაჭირში, რასაც იტანთ, "},
	{5, "5 იმის დასტურად, რომ იქნება ღვთის მართალი მსჯავრი, რათა ღირსნი გახდეთ ღვთის სასუფევლისა, რისთვისაც ევნებით კიდეც. "},
	{6, "6 რადგანაც სამართლიანია ღვთის წინაშე, რომ ჭირი მიეგოს თქვენს შემაჭირვებელთ, "},
	{7, "7 ხოლო თქვენ, შეჭირვებულთ, - განსვენება ჩვენთან ერთად, როცა უფალი ჩვენი იესო თავისი ძალის ანგელოზებითურთ გამოგვეცხადება ზეცით, "},
	{8, "8 რათა ცეცხლის ალით იძიოს შური მათზე, ვინც არ სცნობს ღმერთს და ეურჩება ჩვენი უფლის იესოს სახარებას, "},
	{9, "9 ვინც სასჯელად მიიზღავს საუკუნო წარწყმედას უფლის სახისა და მისი ძალმოსილების დიდებისაგან, "},
	{10, "10 იმ დღეს, როდესაც მოვა, რათა განდიდებულ იქნეს თავის წმიდათა შორის და მიეგოს პატივი ყოველი მორწმუნისაგან, რადგანაც ირწმუნეთ ჩვენი მოწმობა თქვენს მიმართ. "},
	{11, "11 ამიტომაც მარადჟამ ვლოცულობთ თქვენთვის, რათა ჩვენმა ღმერთმა ხმობის ღირსნი გყოთ და თავისი ძალმოსილებით აღასრულოს მთელი სათნოება, სიკეთისა და რწმენის საქმე;"},
	{12, "12 რათა იდიდოს ჩვენი უფლის იესო ქრისტეს სახელი თქვენში, ხოლო თქვენ - მასში, ჩვენი ღმერთისა და უფალ იესო ქრისტეს მადლით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 გევედრებით, ძმანო, ჩვენი უფლის იესო ქრისტეს მოსვლისა და მასთან ჩვენი შეკრების გამო, "},
	{2, "2 იოლად ნუ შეიძვრით გონებით, ნურც შეშფოთდებით, ნურც სულის, ნურც სიტყვის, ნურც ვითომცდა ჩვენს მიერ მოწერილი წერილის გამო, თითქოს უკვე მოიწია უფლის დღეო. "},
	{3, "3 ნურც ნურასგზით გაცდუნებთ ვინმე, რადგანაც არ მოიწევა ის დღე, ვიდრე უმალ არ მოაწევს განდგომილება და არ გამოჩნდება ურჯულოების კაცი, წარწყმედის ძე, "},
	{4, "4 წინააღმდგომი და ყოველივე იმაზე აღზევებული, რაც სახელდებულია ღმერთად თუ სათაყვანებელ არსად, ასე რომ, ღვთის ტაძარშიც კი დაჯდება, როგორც ღმერთი, და ღმერთად გამოაცხადებს თავს. "},
	{5, "5 ნუთუ არ გახსოვთ, რომ ჯერ კიდევ თქვენთან ყოფნისას გეუბნებოდით ამას? "},
	{6, "6 ახლა კი იცით, რა უშლის ხელს იმაში, რომ თავის დროზე გამოჩნდეს. "},
	{7, "7 რადგანაც ურჯულოების საიდუმლო უკვე მოქმედებს, მაგრამ არ აღსრულდება მანამ, სანამ შუაგულით არ აღიხოცება ძალა, რომელიც ხელს უშლის მას. "},
	{8, "8 და მაშინ გამოჩნდება ურჯულო, რომელსაც უფალი იესო შემუსრავს თავის ბაგეთა სულით და განაქარებს თავისი სხივოსანი გამოცხადებით, "},
	{9, "9 მას, ვინც მოვა სატანის მოქმედებით, მთელი ძალმოსილებით, ნიშებით და ცრუ სასწაულებით, "},
	{10, "10 ისევე, როგორც უსამართლობის ყველა საცდურით - წარწყმედილთათვის, რადგანაც არ შეიწყნარეს ჭეშმარიტების სიყვარული, რომელსაც შეეძლო ეხსნა ისინი. "},
	{11, "11 ამიტომაც ღმერთი საცდურის ქმედებას მოუვლენს მათ, რათა ირწმუნონ სიცრუე, "},
	{12, "12 და განკითხული იქნეს ყველა, ვინც არ იწამა ჭეშმარიტება, არამედ უსამართლობა შეიტკბო. "},
	{13, "13 ხოლო ჩვენ გამუდმებით მადლს უნდა ვწირავდეთ ღმერთს თქვენი გულისთვის, უფლის მიერ საყვარელო ძმანო, რადგანაც ღმერთმა სულის განწმენდითა და ჭეშმარიტების რწმენით დასაბამითვე ამოგირჩიათ სახსნელად. "},
	{14, "14 სწორედ ამისთვის გიხმოთ ჩვენი სახარებით, რათა მიაღწიოთ ჩვენი უფლის იესო ქრისტეს დიდებას. "},
	{15, "15 მაშ, მტკიცედ იდექით, ძმანო, და ხელთ გეპყრათ სწავლა, სიტყვით თუ წერილით რომ გადმოგეცით. "},
	{16, "16 ხოლო თვით ჩვენმა უფალმა იესო ქრისტემ და ჩვენმა ღმერთმა და მამამ, რომელმაც შეგვიყვარა და საუკუნო ნუგეშთან ერთად კეთილი იმედიც მოგვმადლა, - "},
	{17, "17 ანუგეშოს თქვენი გულები და განგამტკიცოთ ყოველ სიტყვასა და კეთილ საქმეში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 მაშ, ილოცეთ, ძმანო, ჩვენთვის, რათა სიტყვა ღვთისა განავრცოს და იდიდოს, როგორც თქვენს შორის, "},
	{2, "2 რათა განვერიდოთ უწესო და უკეთურ ხალხს, ვინაიდან ყველას როდი აქვს რწმენა. "},
	{3, "3 მაგრამ სარწმუნოა უფალი, რომელიც განგამტკიცებთ და დაგიცავთ ბოროტისაგან. "},
	{4, "4 ხოლო ჩვენ გენდობით უფალში, რომ ასრულებთ და კვლავაც აღასრულებთ, რასაც გამცნობთ. "},
	{5, "5 უფალმა წარმართოს თქვენი გულები ღვთის სიყვარულისა და ქრისტეს მოთმინებისკენ. "},
	{6, "6 ჩვენ კი მცნებად გისახავთ, ძმანო, ჩვენი უფლის იესო ქრისტეს სახელით, რომ განეშოროთ ყველა ძმას, უწესოდ მოარულს და არა იმ მოძღვრებისამებრ, ჩვენგან რომ მიგიღიათ. "},
	{7, "7 რადგანაც თქვენ თვითონ იცით, თუ როგორ უნდა მოგვბაძთთ, ვინაიდან უწესოდ როდი ვიქცეოდით თქვენს შორის. "},
	{8, "8 არავის პური არ გვიჭამია მუქთად, არამედ დღედაღამ ვშრომობდით, რომ ტვირთად არ დავწოლოდით რომელიმე თქვენგანს. "},
	{9, "9 იმიტომ კი არა, რომ ამის უფლება არ გვქონდა, არამედ იმიტომ, რომ მისაბაძ ნიმუშად დაგვესახა თქვენთვის თავი. "},
	{10, "10 ვინაიდან თქვენთან ყოფნისას ამას გისახავდით მცნებად: ვისაც შრომა არ სურს, მაშინ ნურც ჭამს. "},
	{11, "11 მაგრამ გვესმის, რომ ზოგიერთი თქვენგანი უწესოდ იქცევა, არაფერს აკეთებს და ფუჭად ფაციფუცობს. "},
	{12, "12 ამნაირებს გამცნობთ და შევაგონებთ ჩვენს უფალ იესო ქრისტეში, რომ მშვიდი შრომით ჭამონ თავიანთი პური. "},
	{13, "13 თქვენ კი, ძმანო, ნუ მოგბეზრდებათ სიკეთის ქმნა. "},
	{14, "14 ხოლო თუ ვინმე არ შეისმენს ამ ჩვენი წერილის სიტყვებს, დაიხსომეთ და ნუღარ გაიკარებთ, რათა შერცხვენილ იქნეს. "},
	{15, "15 მაგრამ მტრად კი ნუ მიიჩნევთ, არამედ ძმასავით დაარიგეთ. "},
	{16, "16 თვით მშვიდობის უფალმა მოგცეთ მშვიდობა ყველგან და ყოველთვის. უფალი იყოს ყველა თქვენგანთან. "},
	{17, "17 მოკითხვა ჩემი, პავლეს ხელით, რაც ყველა ჩემი წერილის ნიშანია: მე ასე ვწერ. "},
	{18, "18 ჩვენი უფლის იესო ქრისტეს მადლი ყველა თქვენგანთან. ამინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};