#include <map>
#include <string>
class Bible37
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 დარიოს მეფის მეორე წელს, მეექვსე თვის პირველ დღეს იყო უფლის სიტყვა ანგია წინასწარმეტყველის პირით იუდას განმგებლის ზერუბაბელ შალათიელის ძის, და მღვდელმთავრის იესო - იეჰოცადაკის ძის მიმართ. "},
	{2, "2 ასე თქვა ცაბაოთ უფალმა: ეს ხალხი ამბობს, ჯერ არ დამდგარაო ჟამი, უფლის სახლის აშენების ჟამი. "},
	{3, "3 იყო უფლის სიტყვა ანგია წინასწარმეტყველის პირით: "},
	{4, "4 იმის ჟამი კი არის, რომ გადახურულ სახლებში ისხდეთ, ეს სახლი კი მიგდებული იყოს? "},
	{5, "5 ახლა ასე ამბობს ცაბაოთ უფალი: დაუკვირდით თქვენს საქციელს. "},
	{6, "6 ბევრს თესავთ, მაგრამ ცოტასა მკით; ჭამთ, მაგრამ ვერ ძღებით; სვამთ, მაგრამ ვერ იკლავთ წყურვილს; იცვამთ, მაგრამ ვერ თბებით; გახვრეტილი ქისისთვის იდებს მშრომელი შრომის საზღაურს. "},
	{7, "7 ასე ამბობს ცაბაოთ უფალი: დაუკვირდით თქვენს საქციელს. "},
	{8, "8 ადით მთაზე, აიტანეთ ხე-ტყე და ტაძარი ააშენეთ. მოვიწონებ ამას და დიდებით გამოვჩნდები, ამბობს უფალი. "},
	{9, "9 ბევრის მოლოდინი გაქვთ, მაგრამ მცირედი გისრულდებათ; რაც სახლში მიგაქვთ, იმასაც ვანიავებ, რატომ? ამბობს ცაბაოთ უფალი. იმიტომ, რომ მიგდებულია ჩემი სახლი, თქვენ კი ყველანი თქვენს სახლებზე ზრუნავთ. "},
	{10, "10 ამიტომ არის, რომ დაგიკავათ ცამ ცვარი და მიწამ დაგიკავათ მოსავალი. "},
	{11, "11 გამოვიხმე გვალვა მიწაზე, მთებზე, პურზე, ღვინოზე, ზეთისხილზე და ყველაფერზე, რასაც მიწა აღმოაცენებს; ადამიანზე, პირუტყვზე და ყოველივე ნაჭირნახულევზე. "},
	{12, "12 ისმინეს ზერუბაბელ შალათიელის ძემ, იესო იეჰოცადაკის ძემ, მღვდელმთავარმა, და მთელმა დანარჩენმა ხალხმა უფლის, მათი ღმერთის ხმა და ანგია წინასწარმეტყველის სიტყვები, რამდენადაც იგი უფლის, მათი ღმერთის მოვლინებული იყო, და შეეშინდა ხალხს უფლისა. "},
	{13, "13 უთხრა ანგიამ, უფლის მაცნემ, ხალხს უფლის მაცნეობის ძალით: მე თქვენთანა ვარ, ამბობს უფალი. "},
	{14, "14 გააღვიძა უფალმა იუდას განმგებლის, ზერუბაბელ შალათიელის ძის სული, მღვდელმთავრის, იესო იეჰოცადაკის ძის სული და მთელი დანარჩენი ხალხის სული. მივიდნენ და დაიწყეს მუშაობა ცაბაოთ უფლის, მათი ღმერთის სახლში, "},
	{15, "15 მეექვსე თვის ოცდამეოთხე დღეს, დარიოს მეფის მეორე წელს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 მეშვიდე თვეს, თვის ოცდამეერთე დღეს იყო უფლის სიტყვა ანგია წინასწარმეტყველის პირით: "},
	{2, "2 უთხარი ზერუბაბელ შალათიელის ძეს, იუდას განმგებელს, იესო იეჰოცადაკის ძეს, მღვდელმთავარს და მთელს დანარჩენ ხალხს. "},
	{3, "3 ვინ არის დარჩენილი თქვენს შორის, ვინც მოსწრებია ამ სახლის პირვანდელ დიდებას? რას ხედავთ ახლა? ხომ არარაობად ჩანს თქვენს თვალში! "},
	{4, "4 ახლა გამაგრდი, ზერუბაბელ! ამბობს უფალი. გამაგრდი იესო იეჰოცადაკის ძევ, მღვდელმთავარო! გამაგრდი, მთელო ქვეყნის ერო! ამბობს უფალი, და იშრომეთ, რადგან თქვენთანა ვარ, ამბობს ცაბაოთ უფალი. "},
	{5, "5 სიტყვა, ეგვიპტიდან გამოსვლისას რომ დაგიდევით, და ჩემი სული იმყოფებს თქვენს შორის. ნუ გეშინიათ. "},
	{6, "6 რადგან ასე ამბობს ცაბაოთ უფალი: კიდევ ცოტაც და შევარყევ ცას და მიწას, ზღვასა და ხმელეთს. "},
	{7, "7 შევარყევ ყველა ხალხს, და ასრულდება ყოველი ხალხის საწადელი: დიდებით ავავსებ ამ სახლს, ამბობს ცაბაოთ უფალი. "},
	{8, "8 ჩემია ვერცხლი და ჩემია ოქრო, ამბობს ცაბაოთ უფალი. "},
	{9, "9 პირვანდელზე უფრო დიდი იქნება ამ უკანასკნელი სახლის დიდება, ამბობს ცაბაოთ უფალი. ამ ადგილზე მოვაფენ მშვიდობას, ამბობს ცაბაოთ უფალი. "},
	{10, "10 მეცხრე თვის ოცდამეოთხე დღეს, დარიოსის მეორე წელს, იყო უფლის სიტყვა ანგია წინასწარმეტყველის პირით: "},
	{11, "11 ასე თქვა ცაბაოთ უფალმა: ჰკითხე მღვდლებს რჯული: "},
	{12, "12 აი, მიაქვს კაცს წმიდა ხორცი თვისი სამოსელის კალთით, შეეხო კალთით პურს, შეჭამადს, ღვინოს, ზეთს ან რაიმე საჭმელს. თუ გახდება წმიდა? მიუგეს მღვდლებმა და უთხრეს: არა. "},
	{13, "13 თქვა ანგიამ: თუ შეეხო ამას ყველაფერს გაუწმიდურებული კაცი, გაუწმიდურდება ეს ყველაფერი? მიუგეს მღვდლებმა და უთხრეს: გაუწმიდურდება. "},
	{14, "14 მიუგო ანგიამ და უთხრა: ასეთია ეს ერი, ასეთია ეს ხალხი ჩემს წინაშე, ამბობს უფალი. ასეთია მათი ხელების ნამოქმედარი. მათი მოტანილი ყველაფერი უწმიდურია. "},
	{15, "15 ახლა დააკვირდით რა ხდებოდა ძველად, ვიდრე ქვა ქვაზე დაიდებოდა უფლის ტაძარში. "},
	{16, "16 მივიდოდნენ ოცძნიან ზვინთან და აღმოჩნდებოდა ათი. მივიდოდნენ საწნახელთან ორმოცდაათი საწყაულის ამოსახაპავად და აღმოჩნდებოდა ოცი. "},
	{17, "17 გინადგურებდით მთელს ნამუშაკევს ხორშაკით, სიყვითლით და სეტყვით, და მაინც არ მოიქეცით ჩემკენ, ამბობს უფალი. "},
	{18, "18 დააკვირდით რა ხდებოდა ძველად მეცხრე თვის ოცდამეოთხე დღიდან, იმ დღიდან, რაც უფლის ტაძარი დაფუძნდა, დააკვირდით: "},
	{19, "19 თუღა დარჩა ბეღელში თესლი? აქამდე არ გამოუღია ნაყოფი ვენახს, ლეღვს, ბროწეულს და ზეთისხილს. ამიერიდან კი ვაკურთხებ. "},
	{20, "20 მეორედ იყო უფლის სიტყვა ანგიას მიმართ თვის ოცდამეოთხე დღეს. "},
	{21, "21 ასე უთხარი ზერუბაბელს, იუდას განმგებელს: შევარყევ ცას და მიწას;"},
	{22, "22 დავამხობ სამეფოთა ტახტებს, მოვსპობ ხალხების სამეფოთა ძლიერებას, დავამხობ ეტლებს მხედრებითურთ და დაეცემიან ცხენები და მხედრები ერთმანეთის მახვილით. "},
	{23, "23 იმ დღეს, ამბობს ცაბაოთ უფალი, წაგიყვან შენ, ზერუბაბელ შელათიელის ძეო, ჩემო მორჩილო, ამბობს უფალი, და ბეჭედივით მეყოლები, რადგან ჩემი რჩეული ხარ, ამბობს ცაბაოთ უფალი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};