#include <map>
#include <string>
class Bible49
{
	struct ka1	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 უხუცესი - რჩეულ ქალბატონს და მის შვილებს, რომლებიც მიყვარს ჭეშმარიტებით, და არა მარტო მე, არამედ ყველას, ვინც შეიცნო ჭეშმარიტება, "},
	{2, "2 ჭეშმარიტების გულისთვის, რომელიც მკვიდრობს ჩვენში და ჩვენშივე იქნება უკუნისამდე. "},
	{3, "3 მადლი, წყალობა, მშვიდობა ნუ მოგშლოდეთ მამა ღმერთისა და მისი ძის - იესო ქრისტესაგან, ჭეშმარიტებით და სიყვარულით."},
	{4, "4 დიდად გავიხარე, როცა ვპოვე შენს შვილებს შორის ჭეშმარიტებით მოარულნი, როგორც მიგვიღია მცნება მამისგან. "},
	{5, "5 ახლა გთხოვ, ქალბატონო, ისე კი არა, თითქოს ახალ მცნებასა გწერდე, არამედ იმას, რაცა გვაქვს დასაბამიდან, რათა გვიყვარდეს ერთმანეთი. "},
	{6, "6 სიყვარული კი ისაა, რომ მივსდევდეთ მისი მცნებების გზას; აი, მცნება, რომელიც გსმენიათ დასაბამიდან, რათა მისი გზით იაროთ. "},
	{7, "7 რადგანაც მომრავლდნენ მაცთურნი ქვეყნად, რომელნიც არ აღიარებენ ხორციელად მოსულ იესო ქრისტეს. ეს არის მაცთური და ანტიქრისტე. "},
	{8, "8 თავს გაუფრთხილდით, რათა არ დაკარგოთ ის, რისთვისაც იღვწოდით, არამედ მივიღოთ სრული საზღაური. "},
	{9, "9 ვინც შორდება ქრისტეს მოძღვრებას და არ მკვიდრობს მასში, არა ჰყავს ღმერთი, ხოლო ვინც მკვიდრობს ქრისტეს მოძღვრებაში, მამაცა ჰყავს და ძეც. "},
	{10, "10 ვინც თქვენთან მოდის, მაგრამ არ მოაქვს ეს მოძღვრება ნურც შინ მიიღებთ და ნურც მოიკითხავთ. "},
	{11, "11 რადგან ვინც მას მოიკითხავს, მის ბოროტ საქმესაც ეზიარება. "},
	{12, "12 ბევრი რამ მაქვს თქვენთვის მოსაწერი, მაგრამ არ ვისურვე ქაღალდითა და მელნით, რადგანაც იმედი მაქვს, რომ გეწვევით და პირისპირ გესაუბრებით, რათა სრულ იყოს ჩვენი სიხარული. "},
	{13, "13 მოგიკითხავენ შენი რჩეული დისწულნი. ამინ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};