#include <map>
#include <string>
class Bible66
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
	struct ka6	{ int val; const char *msg; };
	struct ka7	{ int val; const char *msg; };
	struct ka8	{ int val; const char *msg; };
	struct ka9	{ int val; const char *msg; };
	struct ka10	{ int val; const char *msg; };
	struct ka11	{ int val; const char *msg; };
	struct ka12	{ int val; const char *msg; };
	struct ka13	{ int val; const char *msg; };
	struct ka14	{ int val; const char *msg; };
	struct ka15	{ int val; const char *msg; };
	struct ka16	{ int val; const char *msg; };
	struct ka17	{ int val; const char *msg; };
	struct ka18	{ int val; const char *msg; };
	struct ka19	{ int val; const char *msg; };
	struct ka20	{ int val; const char *msg; };
	struct ka21	{ int val; const char *msg; };
	struct ka22	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 გამოცხადება იესო ქრისტესი, რომელიც მისცა მას ღმერთმა, რათა ეჩვენებინა თავისი მონებისათვის, რაც უნდა მოხდეს მალე; და უჩვენა კიდეც თავისი ანგელოზის მოვლინებით მონას თვისას იოანეს, "},
	{2, "2 რომელმაც იმოწმა სიტყვა ღვთისა და მოწმობა იესო ქრისტესი, - ყოველივე ის, რაც იხილა. "},
	{3, "3 ნეტარია, ვინც კითხულობს და ისმენს ამ წინასწარმეტყველების სიტყვებს და იმარხავს მასში დაწერილს, რადგანაც ახლოა ჟამი. "},
	{4, "4 იოანე ასიის შვიდ ეკლესიას: მადლი თქვენდა და მშვიდობა მისგან, რომელიც არის, იყო და იქნება, და შვიდი სულისაგან, რომელნიც არიან მისი ტახტის წინაშე, "},
	{5, "5 და იესო ქრისტესაგან, რომელიც არის სარწმუნო მოწმე, პირმშო განსვენებულთაგან და მიწიერ მეფეთა მთავარი. მას, ვინც შეგვიყვარა და ჩვენი ცოდვებისაგან გვიხსნა თავისი სისხლით, "},
	{6, "6 ვინც მეფეებად და თავისი ღმერთისა და მამის მღვდლებად გვაქცია, - დიდება და ძალმოსილება უკუნითი უკუნისამდე. ამინ. "},
	{7, "7 აჰა, მოდის ღრუბლებით და იხილავს ყოველი თვალი; იხილავენ ისინიც, რომელთაც განგმირეს იგი. და დაიწყებს გოდებას მის წინაშე დედამიწის ყოველი ტომი. ჰო, ამინ. "},
	{8, "8 მე ვარ ანი და ჰაე, დასაბამი და დასასრული, ამბობს უფალი, რომელიც არის, იყო და იქნება, ყოვლისმპყრობელი. "},
	{9, "9 მე, იოანე, თქვენი ძმა და იესო ქრისტეს ურვის, სუფევისა და მოთმინების თანაზიარი, ვიყავი კუნძულზე, რომელსაც ჰქვია პატმოსი, ღვთის სიტყვისა და იესო ქრისტეს მოწმობისათვის. "},
	{10, "10 ვიყავი სულით, კვირა დღეს, და მომესმა უკნიდან მგრგვინავი ხმა, საყვირის ხმის მსგავსი, "},
	{11, "11 რომელმაც თქვა: მე ვარ ანი და ჰაე, პირველი და უკანასკნელი. რასაც ხედავ, დაწერე წიგნში და დაუგზავნე ასიის ეკლესიებს - ეფესოში, სმირნაში, პერგამონში, თიატირაში, სარდეში, ფილადელფიასა და ლაოდიკიაში. "},
	{12, "12 მე მივბრუნდი, რომ მეხილა ხმა, რომელიც მესიტყვებოდა, და მიბრუნებულმა ვიხილე შვიდი სასანთლე ოქროსი, "},
	{13, "13 ხოლო შვიდ სასანთლეს შორის - მსგავსება კაცის ძისა, რომელსაც ემოსა გრძელი მოსასხამი და მკერდს ერტყა ოქროს სარტყელი; "},
	{14, "14 თავი მისი და თმანი - სპეტაკი, როგორც ქათქათა მატყლი და როგორც თოვლი, ხოლო თვალნი მისნი, როგორც ალი ცეცხლისა. "},
	{15, "15 ფეხნი მისნი - ცეცხლში გავარვარებული ელვარე რვალი, ხოლო ხმა მისი, როგორც ზათქი მრავალი წყლისა. "},
	{16, "16 მარჯვენა ხელში ეპყრა შვიდი ვარსკვლავი და მისი პირიდან გამოდიოდა მახვილი ორლესული, ხოლო სახე მისი, როგორც მზე, სხივმფინარი თავისი ძალით. "},
	{17, "17 ვიხილე თუ არა, მის ფერხთით დავვარდი, როგორც მკვდარი, ხოლო მან თავისი მარჯვენა დამადო და თქვა: ნუ გეშინია, მე ვარ პირველი და უკანასკნელი; "},
	{18, "18 აწ ცოცხალი, ვიყავი მკვდარი, და, აჰა, ცოცხალი ვარ უკუნითი უკუნისამდე, და მაქვს კლიტენი ჯოჯოხეთისა და სიკვდილისანი. "},
	{19, "19 მაშ, დაწერე, რაც იხილე რაც არის და რაც იქნება ამის შემდეგ. "},
	{20, "20 საიდუმლო შვიდი ვარსკვლავისა, ჩემს მარჯვენაში რომ იხილე, და შვიდი სასანთლისა ოქროსი: შვიდი ვარსკვლავი შვიდი ეკლესიის ანგელოზებია, ხოლო შვიდი სასანთლე ეკლესიაა შვიდი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 ეფესოს ეკლესიის ანგელოზს მისწერე: ამას ამბობს, ვისაც უპყრია მარჯვენაში შვიდი ვარსკვლავი და იარება ოქროს შვიდ სასანთლეს შორის. "},
	{2, "2 ვიცი შენი საქმენი, შრომა თუ მოთმინება შენი, და ისიც, რომ არ შეგიძლია აიტანო უკეთურნი, და გამოსცადე ისინი, მოციქულებად რომ მოაქვთ თავი, მაგრამ მოციქულები კი არ არიან, და ჰპოვე ისინი მტყუარნი. "},
	{3, "3 მომთმენი ხარ და ბევრი რამ იტვირთე ჩემი სახელის გულისთვის, მაგრამ არ დაქანცულხარ. "},
	{4, "4 თუმცა შენს წინააღმდეგ მაქვს ის, რომ დაუტევე შენი პირველი სიყვარული. "},
	{5, "5 მაშ, გაიხსენე, საიდან დაეცი, მოინანიე და უწინდელ საქმეებს მიჰყავი ხელი. არადა, მალე მოვალ შენთან და ადგილიდან დავძრავ შენს სასანთლეს, თუკი არ მოინანიებ. "},
	{6, "6 მაგრამ ეს კი გაქვს, რომ გძულს ნიკოლაელთა საქმენი, რომელნიც მეცა მძულს. "},
	{7, "7 ვისაც ყური აქვს, ისმინოს, რას ეუბნება სული ეკლესიებს: მძლეველს ვაგემებინებ სიცოცხლის ხისაგან, რომელიც არის ღვთის სამოთხეში. "},
	{8, "8 ხოლო სმირნის ეკლესიის ანგელოზს მისწერე: ამას ამბობს პირველი და უკანასკნელი, რომელიც მკვდარი იყო და გაცოცხლდა: "},
	{9, "9 ვიცი შენი გასაჭირი და სიღატაკე, - თუმცაღა მდიდარი ხარ, - და გმობა მათგან, რომელნიც ამბობენ, იუდეველნი ვართო, და არ კი არიან, არამედ საკრებულო სატანისა. "},
	{10, "10 ნუ გეშინია ნურაფრისა, რისი დათმენაც მოგიწევს. აჰა, ეშმაკი აპირებს ზოგი თქვენგანი გამოსაცდელად ჩააგდოს საპყრობილეში; და გექნებათ ურვა ათი დღე. სიკვდილამდე ერთგული იყავი და მოგცემ შენ სიცოცხლის გვირგვინს. "},
	{11, "11 ვისაც ყური აქვს ისმინოს, რას ეუბნება სული ეკლესიებს: მძლეველი არ ევნება მეორე სიკვდილისაგან. "},
	{12, "12 ხოლო პერგამონის ეკლესიის ანგელოზს მისწერე: ამას ამბობს ორლესული მახვილის მქონე: "},
	{13, "13 ვიცი, რომ ცხოვრობ იქ, სადაც არის სატანის ტახტი, მაგრამ მტკიცედ გიპყრია ჩემი საბელი და არ უარყავ ჩემი რწმენა თვით იმ დღეებშიც, როცა თქვენს შორის, სადაც სატანა მკვიდრობს მოკლეს ანტიპა, სარწმუნო მოწამე ჩემი. "},
	{14, "14 მაგრამ მაქვს შენს წინააღმდეგ მცირეოდენი, რადგანაც გყავს მანდ ზოგიერთნი, ბალაამის მოძღვრების მიმდევარნი, ბალაამისა, რომელმაც ასწავლა ბალაკს, საცდური დაედო ისრაელის ძეთა წინაშე, რათა ეჭამათ კერპთათვის შენაწირი და ემრუშათ. "},
	{15, "15 ასევე, შენც გყავს ნიკოლაელთა მოძღვრების მიმდევარნი, რომელნიც მე მძულს. "},
	{16, "16 მაშ, შეინანე, არა და, მალე მოვალ შენთან და შევერკინები მათ ბაგეთა ჩემთა მახვილით. "},
	{17, "17 ვისაც ყური აქვს, ისმინოს, რას ეუბნება სული ეკლესიებს: მძლეველს მივცემ საჭმელად დაფარულ მანანას, მივცემ მას თეთრ ქვასაც და ქვაზე დაწერილ ახალ სახელს, რომელიც არავინ იცის, მიმღების გარდა. "},
	{18, "18 ხოლო თიატირის ეკლესიის ანგელოზს მისწერე: ამას ამბობს ძე ღვთისა, ვისაც აქვს თვალნი, როგორც ცეცხლის ალი, ფეხები კი მიუგავს ელვარე რვალს: "},
	{19, "19 ვიცი შენი საქმენი, სიყვარული და რწმენა, მსახურება და მოთმინება შენი, და რომ შენი უკანასკნელი საქმენი უმეტესნი არიან, ვიდრე პირველნი. "},
	{20, "20 მაგრამ მაქვს შენს წინააღმდეგ ის, რომ ნებას რთავ დიაც იეზაბელს, წინასწარმეტყველად რომ მოაქვს თავი, ასწავლოს და აცთუნოს ჩემი მონები, რათა მრუშობდნენ და კერპთათვის შენაწირს ჭამდნენ. "},
	{21, "21 მივეცი დრო, რომ მოენანიებინა თავისი სიძვა, მაგრამ არ ინება სინანული. "},
	{22, "22 აჰა, დავამხობ მას სარეცელზე და მასთან ერთად მსიძავთაც შავ დღეს დავაყრი, თუკი არ მოინანიებენ თავიანთ საქმეს."},
	{23, "23 სიკვდილით მოვკლავ მის შვილებს და სცნობს ყოველი ეკლესია, რომ მე ვარ დაფარულ აზრთა და გულთა მხილველი, და მისი საქმისამებრ მივაგებ თვითეულ თქვენგანს. "},
	{24, "24 ხოლო თქვენ და დანარჩენთაც, ვინც კია თიატირაში, მაგრამ არ აღიარებენ ამ მოძღვრებას და, როგორც თვითონ ამბობენ, ვერ უცვნიათ სატანის სიღრმე, - გეტყვით, რომ აღარ დაგაკისრებთ სხვა ტვირთს, "},
	{25, "25 მხოლოდ რაცა გაქვთ, ეგ იტვირთეთ ჩემს მოსვლამდე. "},
	{26, "26 ვინც გაიმარჯვებს და ბოლომდე დაიცავს ჩემს საქმეს, მივცემ მას ხელმწიფებას წარმართებზე მბრძანებლობისას; "},
	{27, "27 რკინის კვერთხით დამწყემსავს მათ და თიხის ჭურჭელივით დაიმსხვრევიან, როგორც მე მივიღე ხელმწიფება მამაჩემისგან. "},
	{28, "28 და მივცემ მას ცისკრის ვარსკვლავს. "},
	{29, "29 ვისაც ყური აქვს, ისმინოს, რას ეუბნება სული ეკლესიებს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 ხოლო სარდეს ეკლესიის ანგელოზს მისწერე: ამას ამბობს, ვისაც აქვს შვიდი სული ღვთისა და შვიდი ვარსკვლავი: ვიცი შენი საქმენი: სახელი ისეთი გაქვს, თითქოს ცოცხალი იყო, და მკვდარი კი ხარ. "},
	{2, "2 იფხიზლე და განამტკიცე დანარჩენი, რაც უახლოვდება სიკვდილს, რადგანაც ვერ ვნახე, რომ შენი საქმენი გასრულებულიყვნენ ჩემი ღვთის წინაშე. "},
	{3, "3 გახსოვდეს, რაც მიგიღია და მოგსმენია, დაიცავი და მოინანიე; ხოლო თუ არ იფხიზლებ, მოვალ შენთან, როგორც მპარავი, და ვერ გაიგებ, რა დროს მოგივალ. "},
	{4, "4 თუმცა გყავს სარდეში რამდენიმე კაცი, რომელთაც არ შეუბილწავთ თავიანთი სამოსი; და სისპეტაკით მოსილნი ივლიან ჩემთან, ვინაიდან ღირსნი არიან. "},
	{5, "5 მძლეველი ასე სისპეტაკით მოსილი ივლის, არ ამოვშლი მის სახელს სიცოცხლის წიგნიდან და ვაღიარებ მის სახელს ჩემი მამისა და მისი ანგელოზების წინაშე. "},
	{6, "6 ვისაც ყური აქვს, ისმინოს, რას ეუბნება სული ეკლესიებს. "},
	{7, "7 ხოლო ფილადელფიის ანგელოზს მისწერე: ამას ამბობს წმიდა და ჭეშმარიტი, ვისაცა აქვს დავითის კლიტე, რომელიც აღებს და ვერავინ დახშავს, დახშავს და ვერავინ აღებს: "},
	{8, "8 ვიცი შენი საქმენი: აჰა, მოგეცი შენს წინაშე გახსნილი კარი და ვერავინ შესძლებს მის დახშვას. მცირე გაქვს ძალა, მაგრამ დაიცავი ჩემი სიტყვა და არ უარყავ ჩემი სახელი. "},
	{9, "9 აჰა, სატანის საკრებულოდან გადმოგცემ იმათ, რომელნიც ამბობენ, იუდეველნი ვართო, და არ კი არიან, არამედ ცრუობენ. აჰა, მე ვაიძულებ მათ, მოვიდნენ, ფეხქვეშ ჩაგივარდნენ და თაყვანი გცენ, რათა აღიარონ, რომ მე შეგიყვარე. "},
	{10, "10 რაკიღა დაიცავი სიტყვა ჩემი მოთმინებისა, მეც დაგიცავ განსაცდლის ჟამს, რომელიც მოიწევა მთელს ქვეყანაზე მიწის მკვიდრთა გამოსაცდელად. "},
	{11, "11 აჰა, მოვალ მალე. მტკიცედ გეპყრას, რაც გაგაჩნია, რათა არავინ წარგტაცოს შენი გვირგვინი. "},
	{12, "12 მძლეველს სვეტად აღვმართავ ჩემი ღვთის ტაძარში, და აღარ გავა გარეთ; და დავაწერ მას სახელს ჩემი ღვთისას, სახელს ჩემი ღვთის ქალაქის - ახალი იერუსალიმისას, ზეცით რომ ჩამოდის ჩემი ღვთისაგან, და ჩემს ახალ სახელს. "},
	{13, "13 ვისაც ყური აქვს, ისმინოს, რას ეუბნება სული ეკლესიებს. "},
	{14, "14 ხოლო ლაოდიკიის ეკლესიის ანგელოზს მისწერე: ამას ამბობს ამინი, მოწმე სარწმუნო და ჭეშმარიტი, დასაბამი ღვთის ქმნილებისა. "},
	{15, "15 ვიცი შენი საქმენი: არც ცივი ხარ და არც ცხელი: ოჰ, ნეტა ცივი მაინც იყო, ან ცხელი. "},
	{16, "16 მაგრამ რაკი ნელ-თბილი ხარ, არც ცივი ხარ და არც ცხელი, ამიტომ გადმოგაფურთხებ ჩემს ბაგეთაგან. "},
	{17, "17 რადგანაც ამბობ: მდიდარი ვარო, გავმდიდრდი და აღარაფერი მჭირდებაო, და ის კი არ იცი, რომ უბადრუკი ხარ და საწყალობელი, გლახაკი, ბრმა და შიშველი. "},
	{18, "18 გირჩევ იყიდო ჩემგან ცეცხლით გაწმენდილი ოქრო, რათა გამდიდრდე, და სპეტაკი სამოსი, რათა შეიმოსო და აღარ გამოჩნდეს შენი სიშიშვლის სირცხვილი, და საოლავი იცხო თვალზე, რათა იხილო. "},
	{19, "19 ვინც მიყვარს, მას ვამხილებ და ვწვრთნი. მაშ, ეშურე და შეინანე. "},
	{20, "20 აჰა, კართან ვდგავარ და ვაკაკუნებ. თუ ვინმე გაიგებს ჩემს ხმას და კარს გამიღებს, შევალ და მასთან ვივახშმებ, ხოლო ის - ჩემთან. "},
	{21, "21 მძლეველს გვერდით მოვისვამ ჩემს ტახტზე, როგორც თავად ვძლიე და ჩემს მამასთან დავჯექი მის ტახტზე. "},
	{22, "22 ვისაც ყური აქვს, ისმინოს, რას ეუბნება სული ეკლესიებს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 შემდგომ ამისა, გავიხედე და, აჰა, კარი გაიღო ცაში, და ხმამ, რომელიც თავდაპირველად ჩამესმა, როგორც ხმა საყვირისა, მითხრა: ამოდი აქ და გიჩვენებ, რაც უნდა მოხდეს ამის შემდეგ. "},
	{2, "2 მყისვე ატაცებულ ვიქმენ სულის მიერ; და, აჰა, ტახტი იდგა ცაში, ხოლო ტახტზე იყო მჯდომარე. "},
	{3, "3 მჯდომარე იასპისა და სარდიონის ქვას ჰგავდა სახით, ტახტს კი გარს ადგა ცისარტყელა, ზურმუხტის მსგავსი. "},
	{4, "4 ტახტის გარშემო ოცდაოთხი ტახტი და მათზე მსხდომარე ოცდაოთხი უხუცესი, რომელთაც ემოსათ სპეტაკი სამოსი და თავს ედგათ ოქროს გვირგვინნი."},
	{5, "5 ხოლო ტახტიდან გამოდიოდნენ ელვანი, გრგვინვა და გრიალი, ტახტის წინ კი ენთო შვიდი ლამპარი ვერცხლისა, რომლებიც არიან ღვთის შვიდი სული. "},
	{6, "6 ტახტის წინ თითქოს მინის ზღვა იყო, მსგავსი ბროლისა, ტახტის შუა და ტახტის ირგვლივ კი - ოთხი ცხოველი, წინიდანაც და უკნიდანაც თვლებით სავსენი. "},
	{7, "7 პირველი ცხოველი ლომს ჩამოჰგავდა, მეორე - კუროს, მესამეს კაცის სახე ჰქონდა, ხოლო მეოთხე იყო მფრინავი არწივის მსგავსი. "},
	{8, "8 ამ ოთხი ცხოველიდან თვითეულს ექვსი ფრთა ესხა, შიგნიდან თვლებით სავსენი. არც დღისით და არც ღამით არა აქვთ მოსვენება, არამედ ღაღადებენ: წმიდაა, წმიდაა, წმიდაა უფალი ღმერთი, ყოვლისმპყრობელი, რომელიც იყო, არის და მოვა. "},
	{9, "9 და როცა ცხოველნი დიდებას, პატივს და მადლიერებას მიაგებენ ტახტზე მჯდომარეს, რომელიც ცოცხალია უკუნითი უკუნისამდე, "},
	{10, "10 ოცდაოთხი უხუცესი დაემხობა ტახტზე მჯდომარის წინაშე და თაყვანს სცემენ ცოცხალს უკუნითი უკუნისამდე, ტახტის წინ ყრიან თავიანთ გვირგვინებს და ამბობენ: "},
	{11, "11 ღირსი ხარ, უფალო, რომ მიიღო დიდება, პატივი და ძლიერება, რადგანაც შენ შეჰქმენ ყოველი, შენ ინებე და შეიქმნენ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 და ვიხილე ტახტზე მჯდომარის მარჯვენაში წიგნი, შიგნიდან და გარედან ნაწერი და შვიდი ბეჭდით დაბეჭდილი. "},
	{2, "2 და ვიხილე ანგელოზი ძლიერი, ხმამაღლა რომ ღაღადებდა: ვინ არის ღირსი იმისა, რომ გადაშალოს ეს წიგნი და ბეჭედი ახსნას? "},
	{3, "3 ვერც ცაში, ვერც მიწაზე და ვერც მიწის ქვეშ ვერავინ შესძლო გაეშალა ეს წიგნი და შიგ ჩაეხედა. "},
	{4, "4 და მე დიდხანს ვტიროდი, რადგანაც არავინ აღმოჩნდა ამ წიგნის გადაშლის ან მასში ჩახედვის ღირსი. "},
	{5, "5 მაშინ ერთ-ერთმა უხუცესმა მითხრა: ნუ სტირი; აჰა, იმძლავრა ლომმა, იუდას ტომიდან, დავითის ფესვმა, რომელიც გადაშლის ამ წიგნს და შვიდ ბეჭედს ახსნის მას. "},
	{6, "6 გავიხედე და, აჰა, ტახტსა, ოთხ ცხოველსა და უხუცესთა შორის მდგომარე კრავი, როგორც დაკლული, შვიდრქიანი და შვიდთვალიანი, რომელნიც არიან შვიდი სული ღვთისა, მთელს დედამიწაზე მოვლინებულნი. "},
	{7, "7 მივიდა და ტახტზე მჯდომარის მარჯვენიდან აიღო წიგნი. "},
	{8, "8 და როცა აიღო წიგნი, ოთხი ცხოველი და ოცდაოთხი უხუცესი დაემხო კრავის წინაშე; ყოველ მათგანს ხელთ ეპყრა ქნარი და ოქროს თასი, საკმევლით სავსე, რომელიც არის წმიდათა ლოცვა. "},
	{9, "9 გალობდნენ ახალ საგალობელს და ამბობდნენ: ღირსი ხარ წიგნის აღების და ბეჭდის ახსნისა, რადგანაც დაკლულ იქმენ და შენი სისხლით გამოგვისყიდე ღმერთისათვის ყოველი ტომისა და ენის, ერისა და ხალხისაგან, "},
	{10, "10 რათა მეფეებად და ჩვენი ღმერთის მღვდლებად გექციეთ; და ვიმეფებთ დედამიწაზე. "},
	{11, "11 ვხედავდი და მესმოდა ურიცხვი ანგელოზის ხმა ტახტის, ცხოველთა და უხუცესთა ირგვლივ, ხოლო სიმრავლე მათი იყო მირიადჯერ მირიადი და ათასჯერ ათასი; "},
	{12, "12 რომელნიც ხმამაღლა ამბობდნენ: ღირსია დაკლული კრავი, რომ მიიღოს ძალა და სიმდიდრე, სიბრძნე და სიმტკიცე, დიდება, პატივი და კურთხევა. "},
	{13, "13 და მესმოდა, რომ ყოველი ქმნილება, რომელიც არის ცაში თუ მიწაზე, მიწის ქვეშ თუ ზღვაში, და ყველაფერი, რაც არის მათში, ამას ამბობდა: ტახტზე მჯდომარესა და კრავს კურთხევა და პატივი, დიდება და ძლიერება უკუნითი უკუნისამდე. "},
	{14, "14 ხოლო ოთხი ცხოველი ამბობდა: ამინ! ოცდაოთხი უხუცესი კი დაემხო და თაყვანი სცა ცოცხალს უკუნითი უკუნისამდე."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ka6 poems[] = {
	{1, "1 კვლავ ვიხილე, რომ კრავმა ახსნა ერთი შვიდ ბეჭედთაგანი, და მომესმა ოთხ ცხოველთაგან ერთ-ერთის მგრგვინავი ხმა: მოდი! "},
	{2, "2 და, აჰა, თეთრი ცხენი, და ზედ მჯდომარე მხედარი მშვილდოსანი, რომელსაც მიეცა გვირგვინი, და გამოვიდა მძლეველი, რათა სძლიოს. "},
	{3, "3 და როცა ახსნა მეორე ბეჭედი, მომესმა ხმა მეორე ცხოველისა, რომელმაც თქვა: მოდი! "},
	{4, "4 გამოვიდა მეორე ცხენი, წითელი, და მასზე მჯდომს მიეცა მიწიდან მშვიდობის აღხოცის ძალა, რათა მუსრს ავლებდნენ ერთმანეთს: და მიეცა მას მახვილი დიდი. "},
	{5, "5 და როცა ახსნა მესამე ბეჭედი, მომესმა ხმა მესამე ცხოველისა, რომელმაც თქვა: მოდი! გავიხედე და, აჰა, შავი ცხენი, და მასზე მჯდომს ხელთ ეპყრა სასწორი. "},
	{6, "6 და მომესმა ხმა ოთხ ცხოველს შორის, რომელმაც თქვა: საწყაო პური დინარად და სამი საწყაო ქერი დინარად, ხოლო ღვინოსა და ზეთს ნუ ავნებ. "},
	{7, "7 და როცა ახსნა მეოთხე ბეჭედი, მომესმა ხმა მეოთხე ცხოველისა, რომელმაც თქვა: მოდი! "},
	{8, "8 შევხედე და, აჰა, ჩალისფერი ცხენი, ხოლო სახელი მისი მხედრისა - სიკვდილი; ჯოჯოხეთი მოსდევდა მხედარს და მიეცა მას ხელმწიფება მეოთხედზე დედამიწისა, რათა მუსრი გაავლოს მახვილითა და შიმშილით, სიკვდილითა და მიწიერ მხეცთა პირით. "},
	{9, "9 და როცა ახსნა მეხუთე ბეჭედი, საკურთხევლის ქვეშ ვიხილე მათი სულები, ვინც მოკლულ იქნენ ღვთის სიტყვისა და მოწმობისთვის, რომელიც ჰქონდათ. "},
	{10, "10 ხმამაღლა შეღაღადეს და თქვეს: როდემდის, მეფეო, წმიდაო და ჭეშმარიტო, არ განსჯი და შურს არ იძიებ ჩვენი სისხლისთვის მიწის მკვიდრთაგან? "},
	{11, "11 და მიეცა მათ სპეტაკი სამოსი და ითქვა მათ მიმართ, ცოტა ხანს კიდევ დამცხრალიყვნენ, ვიდრე არ გასრულდებოდა მათ თანა-მონათა და ძმათა რიცხვი, რომელნიც მათსავით მოკლულ უნდა იქმნენ. "},
	{12, "12 და როცა ახსნა მეექვსე ბეჭედი, შევხედე და, აჰა, საშინლად იძრა მიწა, და გაშავდა მზე, როგორც ძაძა, და სისხლივით გაწითლდა მთვარე. "},
	{13, "13 და დაცვივდნენ ზეცის ვარსკვლავნი ქვეყნად, როგორც ლეღვის ხე, მძვინვარე ქარით რხეული, ყრის მიწაზე თავის ყვავილებს. "},
	{14, "14 და გრაგნილივით შეგრაგნილი შეიკრა ზეცა და ყოველი მთა და კუნძული თავ-თავიანთი ადგილებიდან იძრნენ. "},
	{15, "15 ქვეყნის მეფენი და მთავარნი, ათასისთავნი, მდიდარნი და ძლიერნი, ყოველი მონა და თავისუფალი მღვიმეებსა და მთის გამოქვაბულებს შეეფარნენ. "},
	{16, "16 და მთებსა და კლდეებს შებღავლეს: დაგვემხეთ თავს და ტახტზე მჯდომარის სახისა და კრავის რისხვისაგან დაგვფარეთ; "},
	{17, "17 ვინაიდან მოვიდა დიადი დღე მათი რისხვისა, და ვინ შეიძლებს დადგომას? "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct ka7 poems[] = {
	{1, "1 შემდგომ ამისა, ვიხილე ოთხი ანგელოზი, ქვეყნის ოთხსავ კიდეზე მდგარი, და ეპყრათ ოთხი ქარი მიწისა, რათა არ ექროლა ქარს არც ხმელზე, არც ზღვაზე და არც რომელიმე ხის მიმართ. "},
	{2, "2 და ვიხილე სხვა ანგელოზი, მზის აღმოსავლით აღმომავალი, რომელსაც ჰქონდა ცოცხალი ღმერთის ბეჭედი, და ხმამაღლა შესძახა ოთხ ანგელოზს, რომელთაც მიეცა ვნება მიწის და ზღვისა: "},
	{3, "3 ნუ ავნებთ ნურც მიწას, ნურც ზღვას, ნურც ხეებს, ვიდრე არ აღვბეჭდავთ ბეჭდით ჩვენი ღმერთის მონათა შუბლებს. "},
	{4, "4 და მომესმა აღბეჭდილთა რიცხვი: ას ორმოცდაოთხი ათასი იყო აღბეჭდილი ისრაელის ძეთა ყოველი ტომიდან: "},
	{5, "5 იუდას ტომიდან თორმეტი ათასი აღბეჭდილი, რუბენის ტომიდან თორმეტი ათასი, გადის ტომიდან თორმეტი ათასი, "},
	{6, "6 ასერის ტომიდან თორმეტი ათასი, ნეფთალების ტომიდან თორმეტი ათასი, მანასეს ტომიდან თორმეტი ათასი, "},
	{7, "7 სიმონის ტომიდან თორმეტი ათასი, ლევის ტომიდან თორმეტი ათასი, ისახარის ტომიდან თორმეტი ათასი, "},
	{8, "8 ზაბულონის ტომიდან თორმეტი ათასი, იოსების ტომიდან თორმეტი ათასი, ბენიამინის ტომიდან თორმეტი ათასი აღბეჭდილი. "},
	{9, "9 შემდგომ ამისა, გავიხედე და, აჰა, ურიცხვი ხალხი, რომელსაც ვერვინ დათვლიდა, ყოველი ხალხისა და ტომისაგან, ერისა და ენისაგან, სპეტაკი სამოსით მოსილი იდგა ტახტისა და კრავის წინაშე, და ხელთ ეპყრა პალმის რტონი. "},
	{10, "10 ხმამაღლა ღაღადებდნენ და ამბობდნენ: ხსნა ჩვენი ღმერთის, ტახტზე მჯდომარისა, და კრავისაგან არის! "},
	{11, "11 ყველა ანგელოზი, რომელიც იდგა ტახტის, უხუცესებისა და ოთხი ცხოველის ირგვლივ, პირქვე დაემხო ტახტის წინაშე, თაყვანი სცა ღმერთს და თქვა: "},
	{12, "12 ამინ! კურთხევა და დიდება, სიბრძნე და მადლიერება, პატივი, ძალა და სიმტკიცე ღმერთს ჩვენსას უკუნითი უკუნისამდე. "},
	{13, "13 მომმართა ერთმა უხუცესმა და მითხრა: ვინ არიან ეს სპეტაკი სამოსით მოსილნი, ან საიდან მოსულან? "},
	{14, "14 მე მივუგე: უფალო ჩემო, შენ იცი. ხოლო მან მითხრა: ესენი არიან დიდი ურვიდან მოსულნი, რომელთაც გარეცხეს და კრავის სისხლით გაასპეტაკეს თავიანთი სამოსი. "},
	{15, "15 ამიტომაც არიან ღვთის ტახტის წინაშე, ვისაც დღე და ღამ ემსახურებიან მის ტაძარში, და ტახტზე მჯდომარე დაიფარავს მათ თავისი კარვით. "},
	{16, "16 ასე რომ, აღარც მოშივდებათ, არც მოსწყურდებათ, აღარც მზე დასწვავთ და აღარც ხვატი. "},
	{17, "17 რადგანაც კრავი, რომელიც ტახტის შუაშია, დამწყემსავს და სიცოცხლის წყლის წყაროსაკენ წარუძღვება მათ, და ღმერთი მათ თვალებზე სათითაოდ შეაშრობს ცრემლს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct ka8 poems[] = {
	{1, "1 და როცა ახსნა მეშვიდე ბეჭედი, ასე, ნახევარი საათით დუმილი ჩამოვარდა ზეცას. "},
	{2, "2 და ვიხილე შვიდი ანგელოზი, რომლებიც იდგნენ ღმერთის წინაშე, და მიეცა მათ შვიდი საყვირი. "},
	{3, "3 მაშინ მოვიდა სხვა ანგელოზი, რომელიც დადგა საკურთხეველთან, და ჰქონდა სასაკმევლე ოქროსი; და მიეცა დიდძალი საკმეველი, რათა ყველა წმიდის ლოცვასთან ერთად ტახტის წინ, საკურთხეველზე დაედო იგი. "},
	{4, "4 და ავიდა საკმევლის კვამლი წმიდათა ლოცვებთან ერთად, ანგელოზის ხელით, ღმერთის წინაშე. "},
	{5, "5 აიღო ანგელოზმა სასაკმევლე, აავსო იგი საკურთხევლის ცეცხლით და გადმოათხია მიწას; და იქმნა გრგვინვა და გრიალი, ელვა და მიწისძვრა. "},
	{6, "6 და შვიდი ანგელოზი, რომელთაც ჰქონდათ შვიდი საყვირი, გაემზადა საყვირთა ჩასაბერად. "},
	{7, "7 პირველმა ჩაჰბერა და იქმნა სეტყვა და ცეცხლი, სისხლში არეული, თავს დაატყდა მიწას და ხეთა მესამედი დაიწვა და მთელი მწვანე ბალახი გადაიბუგა. "},
	{8, "8 მეორე ანგელოზმა ჩაჰბერა და თითქოს უზარმაზარი მთა, ცეცხლით მოლაპლაპე, ჩავარდა ზღვაში, და ზღვის მესამედი სისხლად იქცა. "},
	{9, "9 და ამოწყდა სულდგმულთა მესამედი, ზღვაში მცხოვრები, და ხომალდთა მესამედი დაიღუპა. "},
	{10, "10 მესამე ანგელოზმა ჩაჰბერა და ჩამოვარდა ზეცით ლამპარივით მოელვარე ვეება ვარსკვლავი და დაეცა მესამედს მდინარეთა და წყაროებს წყალთა. "},
	{11, "11 ხოლო სახელად ვარსკვლავისა ითქმის აფსინთი, და წყლის მესამედი აფსინთად იქცა, და ურიცხვი ხალხი ამოწყდა წყალთაგან, რადგანაც მწარენი გახდნენ. "},
	{12, "12 მეოთხე ანგელოზმა ჩაჰბერა და მოიწყლა მესამედი მზისა, მესამედი მთვარისა და მესამედი ვარსკვლავებისა და დაბნელდა მესამედი მათი; და აღარ ნათობდა მესამედი დღისა, ისევე, როგორც ღამის. "},
	{13, "13 მაშინ თვალი ვკიდე შუა ცაში მფრინავ არწივს და ჩამესმა საზარელი ყაშყაში მისი: ვაი, ვაი, ვაი მიწის მკვიდრთ საყვირის ხმათაგან დანარჩენი სამი ანგელოზისა, რომელნიც აწი ჩაჰბერენ საყვირს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct ka9 poems[] = {
	{1, "1 მეხუთე ანგელოზმა ჩაჰბერა და ვიხილე ვარსკვლავი, რომელიც ზეცით ვარდებოდა ქვეყნად, და მიეცა მას გასაღები უფსკრულის ჭისა;"},
	{2, "2 გააღო უფსკრულის ჭა და ამოვარდა კვამლი ჭიდან, როგორც ვეება ღუმელის კვამლი, და დაბნელდა მზე და ჰაერი ჭის კვამლისაგან. "},
	{3, "3 გამოვიდა კვამლიდან კალიის გუნდი ქვეყნად, და მიეცა მას ხელმწიფება, მსგავსი იმისა, როგორიცა აქვთ მიწის მორიელთ. "},
	{4, "4 და ითქვა მათ მიმართ, რომ არა ავნონ რა არც ბალახს მიწისას, არც მწვანილს რასმე და არც ხეს რასმე, არამედ მხოლოდ იმ ხალხს, რომელსაც არა აქვს ღვთის ბეჭედი შუბლზე. "},
	{5, "5 და მიეცა მათ ნება, კი არ მოეკლათ, არამედ ხუთი თვე ეწამებინათ ისინი; ხოლო წამება მათგან, როგორც წამება მორიელისგან, როდესაც მოწყლავს კაცს. "},
	{6, "6 იმ დღეებში სიკვდილს დაუწყებენ ძებნას კაცნი, და ვერ ჰპოვებენ; ინატრებენ, ნეტა მოვკვდეთო, მაგრამ სიკვდილი დაუსხლტება მათ. "},
	{7, "7 ხოლო კალიები გარეგნობით ცხენებსა ჰგვანდნენ, საომრად გამზადებულთ, და თავს ედგათ გვირგვინი, როგორც ოქროსი; და სახე მათი, როგორც სახე კაცთა. "},
	{8, "8 მათი თმები დიაცთა თმებს მოგაგონებდათ, კბილები კი მიუგავდათ ღოჯებს ლომისას. "},
	{9, "9 ტანთ ეცვათ ჯაჭვნი, როგორც რკინისანი, და მათი ფრთების ხმა, როგორც ცხენმრავალ ეტლთა გრიალი, რომელნიც მიჰქრიან საომრად. "},
	{10, "10 ნესტრიანი კუდები ჰქონდათ, მორიელთა კუდების მსგავსნი, ხოლო კუდებში - ხელმწიფება კაცთა წამებისა ხუთი თვის განმავლობაში. "},
	{11, "11 მეფედ ჰყავდათ უფსკრულის ანგელოზი, და სახელი მისი ებრაულად აბადონ, ხოლო ბერძნულად აპოლიონ. "},
	{12, "12 ერთმა ვაებამ გადაიარა: აჰა, მოდის ამის შემდეგ ორი ვაება. "},
	{13, "13 მეექვსე ანგელოზმა ჩაჰბერა და მომესმა ერთი ხმა ოთხ რქათაგან ოქროს საკურთხევლისა, რომელიც არის ღვთის წინაშე; "},
	{14, "14 და უთხრა მეექვსე ანგელოზს, საყვირის მქონეს: ახსენი ოთხი ანგელოზი, რომელნიც შეკრულნი არიან დიდ მდინარეზე ევფრატისა. "},
	{15, "15 და ახსნილ იქნა ოთხი ანგელოზი, რომელნიც მზად არიან ყოველ საათს და დღეს, თვესა და წელს, მუსრი გაავლონ მესამედს კაცთა. "},
	{16, "16 და რიცხვი მათი მხედრობისა - ორასი ათასჯერ ათასი; მომესმა რიცხვი მათი. "},
	{17, "17 ასე ვიხილე ხილვით ცხენები და მათი მხედრები, რომლებსაც ეცვათ აბჯარნი ცეცხლის, ჰიაკინთისა და გოგირდის ფერნი. თავები ცხენებისა, როგორც ლომების თავნი, და მათ პირთაგან იფრქვეოდა ცეცხლი, კვამლი და გოგირდი. "},
	{18, "18 და ამ სამი წყლულებისგან - ცეცხლის, კვამლისა და გოგირდისაგან, რასაც აფრქვევენ მათი პირები, კაცთა მესამედი ამოწყდა. "},
	{19, "19 რადგან ცხენებისა ძალა იყო მათ თავ-პირსა და მათ კუდებში, ხოლო კუდები გველებს ჰგვანდნენ და ჰქონდათ თავები, რომლებითაც ვნებდნენ ხალხს. "},
	{20, "20 დანარჩენებმა კი, რომლებიც არ ამოწყდნენ ამ წყლულებისგან, არ შეინანეს თავიანთ ხელთა საქმენი, რათა თაყვანი არ ეცათ ეშმაკთა და ოქროს, ვერცხლის, რვალის, ქვისა და ხის კერპთათვის, რომელთაც არც ხედვა ძალუძთ, არც სმენა და არც სიარული. "},
	{21, "21 არ შეინანეს არც თავიანთი მკვლელობანი და არც თავიანთი გრძნეულებანი, არც თავიანთი სიძვანი და არც თავიანთი ქურდობანი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct ka10 poems[] = {
	{1, "1 ვიხილე ზეცით ჩამომავალი სხვა ანგელოზი ძლიერი, რომელსაც ემოსა ღრუბელი; თავს ცისარტყელა ედგა და მისი სახე იყო როგორც მზე, ფეხები კი - როგორც ცეცხლის სვეტნი. "},
	{2, "2 ხელთ ეპყრა გადაშლილი წიგნი: მარჯვენა ფეხი ზღვას დააბჯინა, ხოლო მარცხენა - მიწას, "},
	{3, "3 და წარმოსთქვა მგრგვინავი ხმით, როგორც ბუხუნებს ლომი; და როცა დაიგრგვინა, შვიდმა ქუხილმა გაიღო თავისი ხმა. "},
	{4, "4 და როცა შვიდმა ქუხილმა გაიღო თავისი ხმა, მე დავაპირე წერა, მაგრამ ჩამესმა ხმა ზეცით, რომელმაც მითხრა: დაბეჭდე, რაც თქვა შვიდმა ქუხილმა, და ნუ დაწერ. "},
	{5, "5 ხოლო ანგელოზმა, რომელიც ვიხილე ზღვასა და ხმელზე მდგარი, თავისი ხელი აღაპყრო ზეცად, "},
	{6, "6 და დაიფიცა ცოცხალი უკუნითი უკუნისამდე, რომელმაც შექმნა ცა და ყოველივე ციური, მიწა და ყოველივე მიწიერი, ზღვა და ყოველივე ზღვიური, რომ უკვე აღარ იქნება დრო. "},
	{7, "7 არამედ იმ დღეებში, როცა ხმას გაიღებს მეშვიდე ანგელოზი, როცა ის ჩაბერავს საყვირს, აღსრულდება ღმრთის საიდუმლო, რომელიც მან ახარა მონებს თვისას - წინასწარმეტყველთ. "},
	{8, "8 ავიღე წიგნი ანგელოზის ხელიდან და შევჭამე იგი, და თაფლივით მეტკბილა პირში, მაგრამ, როდესაც შევჭამე, გაამწარა ჩემი მუცელი. "},
	{9, "9 ხოლო მან მითხრა: კვლავინდებურად გმართებს წინასწარმეტყველება ხალხთა და ერთა, ენათა და მეფეთათვის. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct ka11 poems[] = {
	{1, "1 მომეცა კვერთხის მსგავი ლერწამი და ითქვა ჩემს მიმართ: ადექი და გაზომე ღვთის ტაძარი და საკურთხეველი, აგრეთვე თაყვანისმცემელნი მასში. "},
	{2, "2 ტაძრის გარე ეზო კი გამორიცხე და ნუ გაზომავ, ვინაიდან მიეცა იგი წარმართთ და ორმოცდაორი თვის მანძილზე გათელავენ წმიდა ქალაქს. "},
	{3, "3 მივცემ ჩემს ორ მოწაფეს და ათას ორას სამოცი დღე იწინასწარმეტყველებენ ძაძით მოსილნი. "},
	{4, "4 ესენია ორი ზეთისხილი და ორი სასანთლე, რომლებიც დგანან დედამიწის უფლის წინაშე. "},
	{5, "5 თუ ვინმე მოინდომებს მათ ვნებას, ცეცხლი გამოვა მათი პირიდან და შეჭამს მათ მტრებს; თუ ვინმე მოინდომებს მათ ვნებას, მოკლულ უნდა იქნეს. "},
	{6, "6 მათ აქვთ ხელმწიფება ზეცის დახშვისა, რათა არ იწვიმოს მათი წინასწარმეტყველების დღეებში, და აქვთ ხელმწიფება წყალთა მიმართ, რათა სისხლად აქციონ და ათასგვარი წყლულით მოწყლან ქვეყანა, როცა ინებებენ. "},
	{7, "7 ხოლო როდესაც აღასრულებენ თავიანთ მოწმობას, უფსკრულიდან ამომავალი მხეცი შეებრძოლება, შემუსრავს და მოაკვდინებს მათ. "},
	{8, "8 მათი გვამები ეყრება დიდი ქალაქის მოედანზე, რომელსაც სულიერად ჰქვია სიდომი და ეგვიპტე, სადაც ჯვარს აცვეს მათი უფალიც. "},
	{9, "9 სხვადასხვა ტომისა და მოდგმის, ენისა და ერის ხალხი სამნახევარ დღეს უყურებს მათ გვამებს და არავის დართავ მათი დამარხვის ნებას. "},
	{10, "10 დედამიწის მკვიდრნი იხარებენ და ილხენენ მათ გამო და ძღვენს უძღვნიან ერთმანეთს, რადგანაც ამ ორმა წინასწარმეტყველმა აწამა დედამიწის მკვიდრნი. "},
	{11, "11 მაგრამ სამნახევარი დღის შემდეგ სიცოცხლის სული შევიდა მათში ღვთისაგან, და ფეხზე დადგნენ, რამაც თავზარი დასცა ყველას, ვინც კი ხედავდა მათ. "},
	{12, "12 და მოესმათ მგრგვინავი ხმა ზეცით, რომელმაც უთხრა მათ, აქ ამოდითო, და ისინიც, თავიანთი მტრების თვალწინ, ღრუბლით ავიდნენ ზეცას. "},
	{13, "13 იმავე საათს საშინელი მიწისძვრა მოხდა, ქალაქის მეათედი დაიქცა და მიწისძვრისას შვიდი ათასი კაცი ამოწყდა, სხვები კი შეძრწუნდნენ და დიდება მიაგეს ცის ღმერთს. "},
	{14, "14 მეორე ვაებამ გადაიარა, და აჰა, მოგელავს მესამე ვაება. "},
	{15, "15 მეშვიდე ანგელოზმა ჩაბერა საყვირს და გაისმა ცაში გრგვინვა, რომელიც ხმობდა: ქვეყნის სამეფო ჩვენი უფლისა და მისი ქრისტეს სამეფო გახდა, და იმეფებს უკუნითი უკუნისამდე. "},
	{16, "16 ოცდაოთხი უხუცესი, თავიანთ ტახტებზე რომ სხედან ღვთის წინაშე, პირქვე დაემხო და თაყვანი სცა ღმერთს. "},
	{17, "17 და თქვეს: მადლს გწირავთ, უფალო ღმერთო, ყოვლისმპყრობელო, რომელიც ხარ, რომელიც იყავი და რომელიც მოხვალ, რომ მოიღე შენი დიადი ძალი და დაამკვიდრე შენი სუფევა. "},
	{18, "18 წარმართნი გაშმაგდნენ და მოვიდა ჟამი შენი რისხვისა, რათა სანაცვლო მიაგო შენს მონებს - წინასწარმეტყველთ, წმიდათა და შენი სახელის მოშიშთ, დიდსა თუ მცირეს, და დაღუპო ქვეყნის დამღუპველნი. "},
	{19, "19 მაშინ გაიღო ტაძარი ცაში და გამოჩნდა კიდობანი მისი აღთქმისა მისსავ ტაძარში. და იქმნა ელვა და ქუხილი, გრგვინვა, მიწისძვრა და სასტიკი სეტყვა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct ka12 poems[] = {
	{1, "1 და გამოჩნდა დიადი ნიშანი ცაში: ქალი, რომელსაც ემოსა მზე, მთვარე ესვენა ფერხთით და თორმეტი ვარსკვლავის გვირგვინი ედგა თავზე. "},
	{2, "2 მუცლად ეღო და კიოდა მშობიარობის კივილით გაწამებული. "},
	{3, "3 სხვა ნიშანიც გამოჩნდა ცაში: აჰა, წითელი ურჩხული დიდი, რომელსაც ჰქონდა შვიდი თავი და ათი რქა, და თავს ედგა შვიდი გვირგვინი. "},
	{4, "4 კუდით მოითრევდა ცის ვარსკვლავთა მესამედს, გადმოყარა ისინი ქვეყნად და დადგა ურჩხული ქალის წინაშე, რომელსაც უნდა ეშვა, რათა შობისთანავე შთაენთქა მისი შვილი. "},
	{5, "5 და შვა ძე, რომელსაც რკინის კვერთხით უნდა ემწყემსა ყველა ხალხი: და ატაცებულ იქნა მისი შვილი ღვთისა და მისი ტახტის წინაშე. "},
	{6, "6 ქალი კი ილტვოდა უდაბნოში, სადაც აქვს თავისი ადგილი, გამზადებული ღვთის მიერ, რათა არჩენდნენ იქ ათას ორას სამოცი დღე. "},
	{7, "7 და ატყდა ბრძოლა ცაში: მიქაელი და მისი ანგელოზები ებრძოდნენ ურჩხულს, ურჩხული და მისი ანგელოზები კი ებრძოდნენ მათ. "},
	{8, "8 მაგრამ ვერ იმძლავრეს და აღარ აღმოჩნდა მათი ადგილი ცაში."},
	{9, "9 და გადმოვარდა დიდი ურჩხული, დასაბამიერი გველი, რომელსაც ჰქვია ეშმაკი და სატანა, მთელი საწუთროს მაცდური; გადმოვარდა ქვეყნად და თან გადმოჰყვნენ მისი ანგელოზები. "},
	{10, "10 მაშინ მომესმა მგრგვინავი ხმა ცაში, რომელმაც თქვა: აწ იქმნა ხსნა, ძალი და სუფევა ჩვენი ღმრთისა და ხელმწიფება მისი ქრისტესი, რადგანაც დაემხო ბრალმდებელი ჩვენი ძმებისა, რომელიც ბრალს სდებდა მათ ჩვენი ღმერთის წინაშე დღისით თუ ღამით. "},
	{11, "11 იმძლავრეს მასზე კრავის სისხლით და მათი მოწმობის სიტყვით, და არ შეიყვარეს მათი სული, თვით სიკვდილამდე. "},
	{12, "12 მაშ, ხარობდეთ ზეცანო და ზეცის მკვიდრნო! მაგრამ ვაი მიწას და ზღვას, რადგანაც თქვენში ჩამოგდებულ იქნა ეშმაკი, აღსავსე სასტიკი რისხვით, ვინაიდან იცის, რომ ცოტაღა დარჩა ხანი. "},
	{13, "13 და როცა იხილა ურჩხულმა, რომ დაემხო ქვეყნად, დევნა დაუწყო ქალს, რომელმაც შვა ვაჟი. "},
	{14, "14 მაგრამ მიეცა ქალს ორი ფრთა ვეება არწივისა, რათა გარიდებოდა ურჩხულს და გაფრენილიყო უდაბნოში, თავის ადგილას, სადაც უნდა ერჩინა თავი დროის, დროთა და ნახევარი დროის მანძილზე. "},
	{15, "15 მაშინ გველმა თავისი პირიდან მდინარესავით ამოუშვა წყალი ქალის კვალდაკვალ, რათა წაეღო იგი მდინარეს. "},
	{16, "16 მაგრამ მიწა შეეწია ქალს: განახვნა ბაგენი და შთანთქა მდინარე, რომელიც ურჩხულმა ამოუშვა პირიდან. "},
	{17, "17 მაშინ განრისხდა ურჩხული ქალზე და გასწია, რათა შებმოდა დანარჩენებს მისი მოდგმიდან, რომლებიც იცავენ ღვთის მცნებებს და აქვთ იესოს მოწმობა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct ka13 poems[] = {
	{1, "1 დავდექი ქვიშაზე ზღვისა და ვიხილე მხეცი, ზღვიდან ამომავალი, ათრქიანი და შვიდთავიანი: და მის რქებზე - ათი გვირგვინი, თავებზე კი - გმობის სახელნი. "},
	{2, "2 მხეცი, რომელიც მე ვიხილე, ჯიქს მიაგავდა, მისი ფეხები - დათვის ტორებს, ხახა კი - ხახას ლომისას: და მისცა მას ურჩხულმა თავისი ძალა, თავისი ტახტი და უსაზღვრო ხელმწიფება. "},
	{3, "3 ვიხილე მისი ერთ-ერთი თავი, თითქოს სასიკვდილოდ მოწყლული, მაგრამ განიკურნა სასიკვდილო წყლულება მისი, და განცვიფრდა მთელი ქვეყანა მხეცის კვალდაკვალ. "},
	{4, "4 და თაყვანი სცეს ურჩხულს, რომელმაც მისცა მხეცს ხელმწიფება, თაყვანი სცეს მხეცს და ამბობდნენ: ვინ შეედრება ამ მხეცს? ვის შეუძლია შეებას მას? "},
	{5, "5 მიეცა მას პირი მზვაობრად მეტყველი და ღვთისმგმობელი, და მიეცა მას ხელმწიფება, რათა მოქმედებდეს ორმოცდაორი თვის მანძილზე. "},
	{6, "6 და ღვთის საგმობლად განახვნა ბაგენი თვისნი, რათა ეგმო მისი სახელი, მისი სამკვიდრო და ცის მკვიდრნი. "},
	{7, "7 და მიეცა მას ძალა წმიდათა წინააღმდეგ ბრძოლისა და მათი ძლევისა, და მიეცა მას ხელმწიფება, რათა მბრძანებლობდეს ყველა ტომსა და ხალხს, ერსა და ენას. "},
	{8, "8 და თაყვანი სცა მას დედამიწის ყოველმა მკვიდრმა, რომელთა სახელებიც, ქვეყნიერების დასაბამიდან, ჩაწერილი არ არის სიცოცხლის წიგნში კრავისა, რომელიც დაკლულ იქნა. "},
	{9, "9 ვისაც ყური აქვს, ისმინოს. "},
	{10, "10 ვისაც ტყვე მიჰყავს, არც თვითონ ასცდება ტყვეობა, ვინც მახვილით კლავს, თვითონაც მახვილით მოკვდება; ესაა წმიდათა მოთმინება და რწმენა. "},
	{11, "11 მერე ვიხილე სხვა მხეცი, მიწიდან ამომავალი, რომელსაც ჰქონდა კრავის ორი რქა, მაგრამ ლაპარაკობდა, როგორც ურჩხული. "},
	{12, "12 ის მოქმედებს მხეცის წინაშე მთელი მისი ხელმწიფებით, და აიძულებს დედამიწას და მიწის მკვიდრთ, თაყვანი სცენ პირველ მხეცს, ვისი სასიკვდილო წყლულებაც განიკურნა. "},
	{13, "13 და ახდენს დიად სასწაულთ, ისე, რომ ზეციდან ქვეყნად ჩამოაქვს ცეცხლი კაცთა წინაშე. "},
	{14, "14 და აცდუნებს მიწის მკვიდრთ სასწაულებით, რომელთა ქმნის ძალაც მიეცა მხეცის წინაშე, და აქეზებს მიწის მკვიდრთ, შექმნან ხატება მხეცისა, მახვილით რომ მოიწყლა და ცოცხალი დარჩა. "},
	{15, "15 და მიეცა იმისი ნება, რომ სული ჩაედგა მხეცის ხატისთვის, რათა ხატს ემეტყველა და იმდენი ექნა, რომ მოეკლათ ყველა, ვინც თაყვანს არა სცემს მხეცის ხატებას. "},
	{16, "16 და აიძულებს ყველას, დიდსა თუ მცირეს, მდიდარსა თუ ღარიბს, მონასა თუ თავისუფალს, ნიშანი დაისვან მარჯვენა ხელსა თუ შუბლზე. "},
	{17, "17 ასე რომ, ვერავინ იყიდის ან გაყიდის რამეს, მათ გარდა, ვისაც აქვს ნიშანი - მხეცის სახელი, ან მისი სახელის რიცხვი. "},
	{18, "18 აქაა სიბრძნე; ვისაც გაგების თავი აქვს, გამოითვალოს მხეცის რიცხვი, რადგანაც ესაა რიცხვი კაცისა, და მისი რიცხვი - ექვსას სამოცდაექვსი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct ka14 poems[] = {
	{1, "1 და ვიხილე: აჰა, კრავი იდგა სიონის მთაზე და მასთან ას ორმოცდაოთხი ათასი, რომლებსაც ჰქონდათ შუბლზე მისი სახელი და სახელი მისი მამისა. "},
	{2, "2 და მომესმა ხმა ზეცით, როგორც მრავალი წყლის ზათქი და როგორც ქუნილის ხმა; ხოლო ხმა, მე რომ მომესმა, მექნარეთა ხმასა ჰგავდა, რომელნიც უკრავენ ქნარზე. "},
	{3, "3 და გალობდნენ ახალ საგალობელს ტახტის წინაშე და ოთხი ცხოველისა და უხუცესთა წინაშე; და არავის შეეძლო ესწავლა ეს საგალობელი, ას ორმოცდაოთხი ათასის გარდა, რომელნიც გამოსყიდულ იქნენ ქვეყნით. "},
	{4, "4 ესენი არიან, რომელთაც თავი არ შეუბილწავთ დიაცებთან, რადგანაც არიან ქალწულნი; ესენი არიან, რომელნიც მისდევენ კრავს, სადაც არ უნდა მიდიოდეს იგი; ესენი არიან კაცთა შორის გამოსყიდულნი, როგორც პირველნაყოფი ღვთისა და კრავისათვის. "},
	{5, "5 მათი ბაგენი არ იცნობენ სიცრუეს, რადგანაც უბიწონი არიან. "},
	{6, "6 და ვიხილე შუა ცაში მფრინავი სხვა ანგელოზი, რომელსაც ჰქონდა მარადიული სახარება მიწის მკვიდრთათვის, რათა ეხარებინა ყოველი ტომისა და ხალხის, ენისა და ერისათვის. "},
	{7, "7 და ხმამაღლა ამბობდა: გეშინოდეთ ღვთისა და დიდება მიაგეთ მას, რადგანაც მოვიდა მისი სამსჯავროს ჟამი; თაყვანი ეცით მას, რომელმაც შექმნა ცა და მიწა, ზღვა და წყალთა წყარონი. "},
	{8, "8 მას მოჰყვა მეორე ანგელოზი, რომელიც ამბობდა: დაემხო, დაემხო ბაბილონი, დიდი ქალაქი, რომელმაც ასვა ყველა ხალხს ღვინო თავისი სიძვის რისხვისა. "},
	{9, "9 მათ მოჰყვა მესამე ანგელოზი, რომელიც ხმამაღლა ამბობდა: ვინც თაყვანს სცემს მხეცს ან მის ხატებას და შუბლსა თუ ხელს აღიბეჭდავს მისი ნიშნით, "},
	{10, "10 ისიც შესვამს ღვთის რისხვის ღვინოს, შეუზავებლად ჩასხმულს მისი მრისხანების სასმისში, და ეწამება გოგირდითა და ცეცხლით წმიდა ანგელოზთა და კრავის წინაშე. "},
	{11, "11 კვამლი მათი წამებისა ავა უკუნითი უკუნისამდე და არც დღისით და არც ღამით აღარ ექნებათ მოსვენება მხეცისა თუ მისი ხატების თაყვანისმცემელთ და მისი სახელის ნიშნით აღბეჭდილთ. "},
	{12, "12 აქ არის წმიდათა მოთმინება, რომელნიც იმარხავენ ღვთის მცნებებს და იესოს რწმენას. "},
	{13, "13 და მომესმა ხმა ზეცით, რომელმაც მითხრა: დაწერე: ნეტარ არიან მკვდარნი, უფალში რომ აღესრულებიან ამიერიდან. დიახ, - ამბობს სული, - რათა განისვენონ თავიანთ შრომათაგან და თან წაიტანონ თავიანთი საქმენი. "},
	{14, "14 გავიხედე და, აჰა, თეთრი ღრუბელი, ღრუბელზე კი მჯდომარე, კაცის ძის მსგავსი: თავს ედგა ოქროს გვირგვინი და ხელთ ეპყრა მჭრელი ნამგალი. "},
	{15, "15 გამოვიდა მეორე ანგელოზი ტაძრიდან და შეღაღადა ღრუბელზე მჯდომს: მიუშვი შენი ნამგალი და მომკე, რადგანაც მოვიდა მკის ჟამი და მოიწია სამკალი ქვეყნად. "},
	{16, "16 ღრუბელზე მჯდომმა დაუშვა თავისი ნამგალი ქვეყნად და მომკა ქვეყანა. "},
	{17, "17 სხვა ანგელოზი გამოვიდა ციური ტაძრიდან და ჰქონდა მასაც მჭრელი ნამგალი. "},
	{18, "18 გამოვიდა საკურთხევლიდან სხვა ანგელოზი, რომელსაც ჰქონდა ხელმწიფება ცეცხლზე და ხმამაღლა შესძახა მჭრელი ნამგლის მქონეს: მიუშვი ეგ მჭრელი ნამგალი და მოისთვლე მტევნები, რადგანაც დამწიფდა ყურძენი ქვეყნად. "},
	{19, "19 დაუშვა ანგელოზმა ნამგალი ქვეყნად და მოისთვლა მტევნები ქვეყნისა და ჩაყარა ისინი ღვთის რისხვის ვეება საწნახელში. "},
	{20, "20 დაიწურა საწნახელი ქალაქგარეთ და წარმოსდინდა სისხლი საწნახელს, აღვირამდე რომ სწვდებოდა ცხენებს, ათას ექვსასი უტევანის მანძილზე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct ka15 poems[] = {
	{1, "1 და ვიხილე სხვა ნიშანი ცაში, დიდი და საკვირველი: შვიდი ანგელოზი უკანასკნელი შვიდი წყლულებით, რომლებითაც მთავრდებოდა ღვთის რისხვა. "},
	{2, "2 და ვიხილე თითქოს მინის ზღვა, ცეცხლშერეული, და მხეცის, მისი ხატისა და მისი სახელის რიცხვის მძლეველნი, მინის ზღვაზე რომ იდგნენ და ხელთ ეპყრათ ღვთის ქნარები. "},
	{3, "3 და გალობდნენ მოსეს, ღვთის მონის, საგალობელს და საგალობელს კრავისას: დიადია და საკვირველი შენი საქმენი, უფალო ღმერთო, ყოვლისმპყრობელო: წრფელია და ჭეშმარიტი შენი გზანი, ხალხთა მეუფეო! "},
	{4, "4 ვის არ ეშინოდეს, უფალო, და არ ადიდებდეს შენს სახელს? ვინაიდან მხოლოდ შენა ხარ წმინდა; ამიტომაც გეახლება ყველა ხალხი და თაყვანს გცემს შენ, რადგანაც გამოჩნდა შენი სამართალი. "},
	{5, "5 შემდგომ ამისა გავიხედე, და, აჰა, გამოჩნდა ტაძარი მოწმობის კარვისა ცაში. "},
	{6, "6 გამოვიდა ტაძრიდან შვიდი ანგელოზი, რომლებსაც ჰქონდათ წყლულება შვიდი, სელის წმიდა და ბრწყინვალე სამოსით მოსილნი და მკერდზე ოქროს სარტყლით შემოგარსულნი. "},
	{7, "7 ოთხ ცხოველთაგან ერთ-ერთმა შვიდ ანგელოზს მისცა ოქროს შვიდი თასი, უკუნითი უკუნისამდე ცოცხალი ღვთის რისხვით აღვსილი. "},
	{8, "8 და აღივსო ტაძარი ღვთის დიდებისა და მისი ძლიერების კვამლით, ასე რომ, აღარავის შეეძლო ტაძარში შესვლა, ვიდრე არ აღსრულდებოდა შვიდი ანგელოზის წყლულება შვიდი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct ka16 poems[] = {
	{1, "1 და მომესმა ტაძრიდან მგრგვინავი ხმა, შვიდ ანგელოზს რომ ეუბნებოდა: წადით და დასთხიეთ ქვეყნად შვიდი თასი ღვთის რისხვისა. "},
	{2, "2 წავიდა პირველი და დასთხია თავისი თასი ქვეყნად; და მოიწყლა სასტიკი და საზარელი წყლულებით ხალხი, რომელსაც ჰქონდა მხეცის ნიშანი და თაყვანს სცემდა მის ხატს. "},
	{3, "3 მეორე ანგელოზმა დასთხია თავისი თასი ზღვაზე, რომელიც იქცა თითქოს მკვდრის სისხლად, და ყოველი სულდგმული ამოწყდა ზღვაში. "},
	{4, "4 მესამემ მდინარეებსა და წყალთა წყაროებზე დასთხია თავისი თასი, და წყალი სისხლად იქცა. "},
	{5, "5 მაშინ მომესმა ხმა წყალთა ანგელოზისა, რომელმაც თქვა: მართალი ხარ, უფალო, რომელიც ხარ და იყავი: მართალი ხარ, წმიდაო, რადგანაც ასე განსაჯე. "},
	{6, "6 რაკიღა წმიდათა და წინასწარმეტყველთა სისხლი დასთხიეს, შენც სასმელად სისხლი მიეც მათ, და ღირსნიც არიან. "},
	{7, "7 და მომესმა ხმა საკურთხევლიდან, რომელმაც თქვა: დიახ, უფალო ღმერთო, ყოვლისმპყრობელო, მართალი და ჭეშმარიტია შენი მსჯავრი. "},
	{8, "8 მეოთხე ანგელოზმა თავისი თასი დასთხია მზეზე, და მიეცა მზეს კაცთა დაბუგვა ცეცხლით. "},
	{9, "9 დაიწვნენ კაცნი სიცხით და ჰგმეს სახელი ღვთისა, რომელსაც აქვს ხელმწიფება მათ წყლულებზე, მაგრამ არ მოინანიეს, რომ დიდება მიეგოთ მისთვის. "},
	{10, "10 მეხუთემ თავისი თასი დასთხია მხეცის ტახტზე და დაბნელდა საუფლო მისი, და სიმწრისაგან იკვნეტდნენ თავიანთ ენებს. "},
	{11, "11 და ჰგმობდნენ ცის ღმერთს თავიანთი სიმწრისა და წყლულების გამო, მაგრამ არ მოინანიეს თავიანთი საქმენი. "},
	{12, "12 მეექვსემ დასთხია თავისი თასი დიდ მდინარეზე ევფრატისა, და დაშრა მისი წყალი, რათა გამზადებულ იქნეს მეფეთა გზა, რომელნიც მოდიან მზის აღმოსავლით. "},
	{13, "13 და ვიხილე ურჩხულის პირით, მხეცის პირით და ცრუ წინასწარმეტყველთა პირით გამომავალი სამი უწმინდური სული, გომბეშოს მსგავსი. "},
	{14, "14 ესენი არიან ეშმაკთა სულები, რომლებიც ახდენენ სასწაულებს და გადიან მთელი ქვეყნიერების მეფეებთან, რათა თავი მოუყარონ მათ საბრძოლველად ყოვლისმპყრობელი ღმერთის დიად დღეს. "},
	{15, "15 აჰა, მოვალ, როგორც მპარავი: ნეტა მას, ვინც ფხიზლობს და იცავს თავის სამოსს, რათა შიშვლად არ იაროს და არ იხილონ მისი სირცხვილი. "},
	{16, "16 და შეკრიბეს ისინი იმ ადგილას, რომელსაც ებრაულად ჰქვია ჰარმაგედონი. "},
	{17, "17 მეშვიდე ანგელოზმა დასთხია თავისი თასი ჰაერში და მოისმა ციური ტაძრის ტახტიდან მგრგვინავი ხმა, რომელმაც თქვა: აღსრულდა. "},
	{18, "18 და იქმნა ელვა და ქუხილი, გრგვინვა და დიდი მიწისძვრა, რომლის მსგავსიც არ ყოფილა მას შემდეგ, რაც კაცნი არიან ქვეყნად. "},
	{19, "19 სამ ნაწილად გაიყო დიდი ქალაქი, დაემხნენ წარმართთა ქალაქები და მოხსენიებულ იქნა დიდი ბაბილონი ღვთის წინაშე რათა სასმისით მისცემოდა ღვინო მისი მძვინვარების რისხვისა. "},
	{20, "20 ყველა კუნძული გაუჩინარდა და აღარსად ჩანდნენ მთები. "},
	{21, "21 ტალანტის ოდენა სეტყვა თავს დაატყდა ზეციდან ხალხს, და ჰგმო სეტყვით მოწყლულმა ხალხმა სახელი ღვთისა, რადგანაც მძიმე იყო მისი წყლულება. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct ka17 poems[] = {
	{1, "1 მოვიდა ერთი ანგელოზი იმ შვიდთაგან, რომელთაც ჰქონდათ შვიდი თასი, და მითხრა: მოდი და გიჩვენებ სამსჯავროს დიდი მეძავისას, რომელიც ზედ აზის მრავალ წყალს; "},
	{2, "2 რომელთანაც ისიძვეს ქვეყნიერების მეფეებმა და ქვეყნის ყოველი მკვიდრი დაითრო ღვინით მისი სიძვისა. "},
	{3, "3 და წამიყვანა უდაბნოში სულით, და ვიხილე ქალი, ზურგზე რომ აჯდა წითელ მხეცს, რომელსაც, გმობის სახელებით სავსეს, შვიდი თავი და ათი რქა ჰქონდა. "},
	{4, "4 ხოლო ქალს ემოსა პორფირი და ძოწეული, ოქროთი, პატიოსანი თვლებითა და მარგალიტებით შემკული, და ხელთ ეპყრა სიბილწითა და მისი სიძვის უწმინდურებით სავსე ოქროს ბარძიმი. "},
	{5, "5 და ეწერა შუბლზე საიდუმლო სახელი: დიდი ბაბილონი, მეძავთა და მიწიერ სიბილწეთა დედა. "},
	{6, "6 და ვიხილე, რომ მთვრალი იყო წმიდათა და იესოს მოწამეთა სისხლით, და მიკვირდა, მის მხილველს, ესოდენ დიდი საკვირველება. "},
	{7, "7 მაშინ ანგელოზმა მითხრა: რად გიკვირს? მე გეტყვი საიდუმლოს ქალისას და მისი მტვირთველი მხეცისას, რომელსაც აქვს შვიდი თავი და ათი რქა. "},
	{8, "8 მხეცი, რომელიც იხილე, იყო და აღარ არის, მაგრამ ამოვა უფსკრულიდან და წარსაწყმედლად წავა, და დედამიწის მკვიდრნი, რომელთა სახელებიც ჩაწერილი არ არის სიცოცხლის წიგნში ქვეყნიერების დასაბამიდან, განცვიფრდებიან, როდესაც იხილავენ მხეცს, რომელიც იყო და აღარ არის, მაგრამ კვლავ მოვა. "},
	{9, "9 აქ საჭიროა გონება, რომელსაც აქვს სიბრძნე: შვიდი თავი შვიდი მთაა, რომლებზედაც ზის ქალი, - და შვიდი მეფე, "},
	{10, "10 რომელთაგანაც ხუთი დაემხო, ერთი არის, სხვა კი ჯერაც არ მოსულა, მაგრამ როდესაც მოვა, დიდხანს ვერ გაძლებს. "},
	{11, "11 ხოლო მხეცი, რომელიც იყო და აღარ არის, მერვეა შვიდთაგან, და წარსაწყმედლად მიდის. "},
	{12, "12 ათი რქა, შენ რომ იხილე, ათი მეფეა, რომელთაც ჯერ არ მიუღიათ მეფობა, მაგრამ, როგროც მეფენი, მხეცთან ერთად მიიღებენ ხელმწიფებას, ერთი საათით. "},
	{13, "13 ერთი აზრი აქვთ და თავიანთ ძალას და ხელმწიფებას მისცემენ მხეცს. "},
	{14, "14 ერთადვე შეებრძოლებიან კრავს, მაგრამ კრავი იმძლავრებს მათზე, რადგანაც ის არის უფლებათა უფალი და მეუფეთა მეუფე, ხოლო მასთან მყოფნი ხმობილნი, რჩეულნი და სარწმუნონი არიან. "},
	{15, "15 კვლავ მითხრა მე: წყალნი, რომელნიც იხილე, სადაც ზის დიდი მეძავი, ხალხები არიან და ბრბონი, ერები და ენანი. "},
	{16, "16 ათი რქა, შენ რომ იხილე, და მხეცი მოიძულებენ, გაძარცვავენ და გააშიშვლებენ მეძავს, შეჭამენ მის ხორცს და ცეცხლს მისცემენ მას. "},
	{17, "17 რადგანაც ღმერთმა ჩაუდო გულში, აღასრულონ მისი ნება, ყონ ერთი ნება და მისცენ თავიანთი მეფობა მხეცს, ვიდრე არ აღსრულდება ღვთის სიტყვა. "},
	{18, "18 ხოლო ქალი, შენ რომ იხილე, დიდი ქალაქია, რომლის მეუფებასაც ჰმორჩილებს ქვეყნის ყოველი მეფე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct ka18 poems[] = {
	{1, "1 შემდგომ ამისა, ვიხილე ზეცით ჩამომავალი სხვა ანგელოზი, რომელსაც ჰქონდა დიდი ხელმწიფება, და განათდა დედამიწა მისი დიდებით. "},
	{2, "2 შეღაღადა და ხმამაღლა თქვა: დაემხო, დაემხო ბაბილონი, დიდი ქალაქი, და ეშმაკთა სამკვდროდ, ყოველი უწმინდური სულის სამყოფლად და ყოველი უწმინდური და ბილწი ფრინველის საბუდრად იქცა. "},
	{3, "3 რადგანაც მისი სიძვის მძვინვარე ღვინით დაითრო ყველა ხალხი, ქვეყნის მეფეებმა ისიძვეს მასთან და ქვეყნის ვაჭარნი დამდიდრდნენ მისი ფუფუნების სიუხვით. "},
	{4, "4 და მომესმა მეორე ხმა ზეცით, რომელმაც თქვა: გამოდი, მაგისგან, ჩემო ხალხო, რათა არ ეზიაროთ მის ცოდვებს და არ მოიწყლათ მისი წყლულებით. "},
	{5, "5 რადგანაც უწიეს მისმა ცოდვებმა ზეცას, და გაიხსენა ღმერთმა უსამართლობა მისი. "},
	{6, "6 მიაგეთ მას, როგორც მან მოგაგოთ და, მისი საქმისამებრ, ორმაგადაც მიაგეთ; სასმისით, რომლითაც გასმევდათ, ორმაგად ასვით მას. "},
	{7, "7 რამდენადაც მოჰქონდა თავი დიდებით და ფუფუნებით, იმდენადვე მიაგეთ ტანჯვა-ვაება; რადგანაც გულში ამბობს: დედოფლად ვზივარ, ქვრივი როდი ვარ, და არ ვიხილავ გლოვას. "},
	{8, "8 ამიტომაც მოვლენ ერთ დღეს მისი წყლულებანი, სიკვდილი, გლოვა და შიმშილი, და დაიწვის ცეცხლით, რადგანაც ძლიერია უფალი ღმერთი, რომელიც განიკითხავს მას. "},
	{9, "9 იტირებენ და ივაგლახებენ მის გამო ქვეყნის მეფენი, რომელნიც სიძვით და ფუფუნებით ცხოვრობდნენ მასთან, როდესაც იხილავენ მისი ხანძრის კვამლს. "},
	{10, "10 და მისი ტანჯვის შიშით შორს გამდგარნი ასე იტყვიან: ვაი, ვაი, დიდო ქალაქო ბაბილონო, მძლავრო ქალაქო, რადგანაც ერთ საათში მოვიდა შენი განკითხვა. "},
	{11, "11 ქვეყნის ვაჭარნი იტირებენ და ივაგლახებენ მის გამო, რადგანაც აღარავინ იყიდის მათ საქონელს, "},
	{12, "12 ოქროსა და ვერცხლის საქონელს, პატიოსან თვლებს და მარგალიტს, ბისონს და პორფირს, აბრეშუმსა და ძოწეულს, სურნელოვან ხეს და სპილოს ძვლის ნაირგვარ ნაკეთობას, ძვირფასი ხის, რვალის, რკინისა თუ მარმარილოს ათასგვარ ჭურჭელს, "},
	{13, "13 დარიჩინსა და საკმეველს, გუნდრუკს და მირონს, ღვინოს და ზეთს, ფქვილსა და ხორბალს, ცხვარსა და ძროხას, ცხენებს და ეტლებს, კაცთა ხორცსა და სულს. "},
	{14, "14 შენი სულის სასურველი ხილი გაგშორდა, ყოველივე ბრწყინვალე და პოხიერი ხელიდან გამოგეცალა, და ვეღარასდროს იპოვი მათ. "},
	{15, "15 ყოველივე ამით მოვაჭრენი, რომელნიც დამდიდრდნენ მისგან, შორს დადგებიან მისი ტანჯვის შიშით, იტირებენ და ივაგლახებენ. "},
	{16, "16 და იტყვიან: ვაი, ვაი, დიდო ქალაქო, პორფირითა და ძოწეულით მოსილო, ოქროთი, პატიოსანი თვლებითა და მარგალიტებით შემკულო. "},
	{17, "17 რადგანაც ერთ საათში იავარ-იქნა ესოდენ დიდი სიმდიდრე. და ყოველი მესაჭე, მეხომალდე თუ მენავე შორს დადგა;"},
	{18, "18 და მისი ხანძრის შემყურეთ შებღავლეს და თქვეს: რომელი ქალაქი შეედრებოდა ამ დიდ ქალაქს? "},
	{19, "19 თავზე ნაცარი წაიყარეს და ტირილითა და გლოვით ამბობდნენ: ვაი, ვაი, დიდო ქალაქო, რომლის ძვირფასეულობითაც დამდიდრდა ყველა, ვისაც ხომალდი ჰქონდა ზღვაში: რადგანაც ერთ საათში აოხრდა. "},
	{20, "20 ხარობდეთ მასზე, ცაო, წმიდაო მოციქულნო და წინასწარმეტყველნო, რადგანაც ღმერთმა თქვენი სამართალი მოჰკითხა მას. "},
	{21, "21 ერთმა მძლეთა-მძლე ანგელოზმა აიღო ქვა, ვეება დოლაბის მსგავსი, ზღვაში ჩააგდო და თქვა: ასე სწრაფად შთაინთქმება ბაბილონი, დიდი ქალაქი, და აღარ იქნება. "},
	{22, "22 მეჩანგეთა და მეწინწილეთა, მესტვირეთა და მესაყვირეთა ხმა აღარ იჟღერებს შენში, აღარ დარჩება არცერთი ხელოსანი, არც ხელოსნობა, და დოლაბის ხმა მიწყდება შენში. "},
	{23, "23 აღარც სანთლის ნათელი ინათებს შენში და მეფე-დედოფლის ხმა ჩაკვდება შენში, რადგანაც შენი ვაჭრები დედამიწის მთავრები იყვნენ და შენი გრძნეულებით ცთუნებულ იქნა ყოველი ხალხი. "},
	{24, "24 და პოვნილ იქნა შენში წინასწარმეტყველთა, წმიდათა და ამ ქვეყნად ყველა მოკლულის სისხლი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct ka19 poems[] = {
	{1, "1 შემდგომ ამისა, მომესმა ცაში მგრგვინავი ხმა, როგორც ხმა ურიცხვი ხალხისა, რომელიც ამბობდა: ალილუია! ხსნა, დიდება და ძალი ჩვენი ღვთისაა! "},
	{2, "2 რადგანაც ჭეშმარიტი და სამართლიანია მისი განკითხვა, ვინაიდან განიკითხა დიდი მეძავი, თავისი სიძვით რომ გახრწნა ქვეყანა, და იძია მისი ხელიდან თავისი მონების სისხლი. "},
	{3, "3 განმეორებით ითქვა: ალილუია! და მისი კვამლი ადის უკუნითი უკუნისამდე. "},
	{4, "4 ოთხი ცხოველი და ოცდაოთხი უხუცესი დაემხნენ და თაყვანი სცეს ტახტზე მჯდომარე ღმერთს, და თქვეს: ამინ! ალილუია! "},
	{5, "5 და გამოვიდა ხმა ტახტით, რომელმაც თქვა: აქებდეთ ჩვენს ღმერთს ყოველი მონა მისი და მოშიში მისი, მცირე თუ დიდი. "},
	{6, "6 და მომესმა ხმა, როგორც დიდძალი ხალხის, მრავალი წყლისა და საზარი ქუხილის ხმა, რომელმაც თქვა: ალილუია! რადგანაც გამეფდა უფალი ღმერთი ჩვენი, ყოვლისმპყრობელი. "},
	{7, "7 გვიხაროდეს და ვილხენდეთ, და დიდება მივაგოთ მას, ვინაიდან მოვიდა კრავის ქორწილი და მისმა სასძლომ განიმზადა თავი. "},
	{8, "8 და მიეცა მას შესამოსად წმიდა და ნათელი ბისონი, რადგანაც წმიდათა სიმართლეა იგი. "},
	{9, "9 და მითხრა მე: დაწერე: ნეტარნი არიან კრავის საქორწინო სერობაზე წვეულნი. და მითხრა: ესენი არიან ჭეშმარიტი სიტყვები ღვთისა. "},
	{10, "10 ფეხქვეშ ჩავუვარდი, რომ თაყვანი მეცა მისთვის, მაგრამ მან მითხრა: ნუ იზამ ამას; თანამონა ვარ შენი და შენი ძმებისა, რომლებსაც აქვთ მოწმობა იესოსი. მე კი არა, ღმერთს ეცი თაყვანი, რადგანაც იესოს მოწმობა არის წინასწარმეტყველების სული. "},
	{11, "11 ვიხილე გახსნილი ცა და, აჰა, თეთრი ცხენი და მისი მხედარი, რომელიც იწოდება სარწმუნოდ და ჭეშმარიტად, რადგანაც სიმართლით განიკითხავს და იბრძვის. "},
	{12, "12 თვალები ცეცხლის ალს მიუგავდა, მრავალი გვირგვინი ედგა თავზე და ზედ ეწერა სახელი, რომელიც არავინ იცის მის გარდა. "},
	{13, "13 სისხლით ნაღები სამოსით იყო მოსილი, და სახელი მისი - ღვთისა სიტყვა. "},
	{14, "14 ციური ლაშქარი მისდევდა, თეთრ ცხენებზე ამხედრებული და სპეტაკი და წმიდა ბისონით მოსილი. "},
	{15, "15 მისი პირიდან გამოდიოდა ბასრი მახვილი, რათა მოესრა წარმართნი, რკინის კვერთხით ემწყემსა ისინი და დაეწურა ყოვლისმპყრობელი ღვთის რისხვის მძვინვარე ღვინის საწნახელი. "},
	{16, "16 ხოლო სამოსსა და თეძოზე აწერია მისი სახელი: მეუფეთა მეუფე და უფლებათა უფალი. "},
	{17, "17 და ვიხილე გზაზე მდგარი ერთი ანგელოზი, ხმამაღლა რომ შესძახა და უთხრა შუა ცაში მფრინავ ყველა ფრინველს: მოდით და ღვთის დიდ სერობაზე შემოკრბით, "},
	{18, "18 რათა ჭამოთ მეფეთა, ათასისთავთა და ძლიერთა ხორცი, ცხენთა თუ მხედართა, მონათა თუ თავისუფალთა, დიდთა თუ მცირეთა ხორცი. "},
	{19, "19 ვიხილე მხეცი, დედამიწის მეფენი და მათი ლაშქარნი, ერთად შეკრებილნი, რათა შებმოდნენ ცხენზე მჯდომსა და მის მხედრობას. "},
	{20, "20 შეპყრობილ იქნა მხეცი და მასთან ერთად ცრუ წინასწარმეტყველიც, მის წინაშე რომ ახდენდა სასწაულებს, რითაც აცთუნა მხეცის ნიშნის მიმღებნი და მისი ხატის მოთაყვანენი, და ორივენი ცოცხლად იქნენ ჩაყრილი გოგირდით მოგიზგიზე ცეცხლის ტბაში. "},
	{21, "21 დანარჩენები კი მოისრნენ ცხენზე მჯდომარის მახვილით, რომელიც გამოდიოდა მისი პირიდან, და ყველა ფრინველი მიაძღა მათ მძორს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct ka20 poems[] = {
	{1, "1 ვიხილე ზეცით ჩამომავალი ანგელოზი, რომელსაც ხელთ ეპყრა უფსკრულის გასაღები და გრძელი ჯაჭვი. "},
	{2, "2 და შეიპყრო ურჩხული, დასაბამიერი გველი, რომელიც არის ეშმაკი და სატანა, და შეკრა იგი ათასი წლით. "},
	{3, "3 უფსრულში ჩააგდო და შიგ გამომწყვდეული ბეჭდით დაბეჭდა, რათა აღარ აცთუნებდეს ხალხებს, ვიდრე არ გასრულდება ათასი წელი, რის შემდეგაც მცირედი ხნით დაიხსნის თავს. "},
	{4, "4 ვიხილე ტახტნი და მათზე მსხდომარენი, რომელთაც მიეცა ხელმწიფება მსჯავრის აღსრულებისა, და იესოს მოწმობისა და ღვთის სიტყვისათვის თავმოკვეთილთა სულები, რომლებიც არც მხეცს ეთაყვანენ, არც მის ხატებას, და არ მიიღეს მისი ნიშანი თავიანთ შუბლსა თუ ხელზე; ამიტომაც გაცოცხლდნენ და ქრისტესთან ერთად სუფევდნენ ათას წელიწადს. "},
	{5, "5 დანარჩენი მკვდრები კი არ გაცოცხლებულან ათასი წლის გასრულებამდე. ეს არის პირველი აღდგომა. "},
	{6, "6 ნეტარი და წმიდაა ყველა, ვისაც წილი უდევს პირველ აღდგომაში. მეორე სიკვდილის ხელმწიფება არ ვრცელდება მათზე, არამედ იქნებიან მღვდლები ღვთისა და ქრისტესი, ვისთან ერთადაც იმეფებენ ათას წელიწადს. "},
	{7, "7 ხოლო ათასი წლის გასრულების შემდეგ სატანა თავს დაიხსნის საპყრობილედან. "},
	{8, "8 და გამოვა, რათა ქვეყნიერების ოთხსავ მხარეს აცთუნოს ხალხები, გოგი და მაგოგი, და საბრძოლველად შეკრიბოს ისინი, რომელთა სიმრავლე, როგორც ქვიშა ზღვისა, "},
	{9, "9 მართლაც მოედვნენ მიწის მთელ სივრცეს და გარს შემოადგნენ წმიდათა ბანაკსა და საყვარელ ქალაქს; მაგრამ ჩამოეშვა ცეცხლი ზეცით და შთანთქა ისინი. "},
	{10, "10 ხოლო ეშმაკი, რომელმაც აცდუნა ისინი, ჩაგდებულ იქნა ცეცხლისა და გოგირდის ტბაში, სადაც არიან მხეცი და ცრუ წინასწარმეტყველი; და ეწამებიან დღე და ღამ უკუნითი უკუნისამდე. "},
	{11, "11 მაშინ ვიხილე დიდი თეთრი ტახტი და მასზე მჯდომარე, ვისი სახისგანაც ილტვოდნენ მიწა და ცა, და აღარ აღმოჩნდა ადგილი მათი. "},
	{12, "12 და ვიხილე ტახტის წინ მდგომარე მკვდრები, დიდნი თუ მცირენი, და გადაშლილი წიგნები. გადაიშალა სხვა წიგნიც, რომელიც არის სიცოცხლის წიგნი, და, თანახმად იმისა, რაც წიგნებში წერია, მათი საქმისამებრ განკითხულ იქნენ მკვდრები. "},
	{13, "13 ზღვამ, სიკვდილმა და ჯოჯოხეთმა დააბრუნეს თავიანთი მკვდრები, და, თანახმად მისი საქმისა, განკითხულ იქნა თვითეული. "},
	{14, "14 სიკვდილი და ჯოჯოხეთი კი დაინთქნენ ცეცხლის ტბაში, და სწორედ ცეცხლის ეს ტბაა მეორე სიკვდილი. "},
	{15, "15 ცეცხლის ტბაშივე ჩავარდა, ვინც არ იყო ჩაწერილი სიცოცხლის წიგნში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct ka21 poems[] = {
	{1, "1 მერე ვიხილე ახალი ცა და ახალი მიწა, რადგანაც პირველი ცა და პირველი მიწა გადაეგო, და ზღვა აღარ არის. "},
	{2, "2 ვიხილე წმიდა ქალაქი, ახალი იერუსალიმი, ღვთისაგან ჩამომავალი ზეცით, სასძლოსავით გამზადებული და სასიძოსთვის შემკული. "},
	{3, "3 და მომესმა მგრგვინავი ხმა ტახტით, რომელმაც თქვა: აჰა, კარავი ღვთისა კაცთა შორის, რომელიც დაემკვიდრება მათში, და თვით ღმერთი იქნება მათთან. "},
	{4, "4 შეაშრობს ღმერთი მათ თვალზე ცრემლს, და აღარ იქნება სიკვდილი: აღარც გლოვა, აღარც ტირილი და ტანჯვა იქნება, რადგანაც გადაეგო ყოველივე უწინდელი. "},
	{5, "5 ხოლო ტახტზე მჯდომარემ თქვა: აჰა, ყველაფერს შევქმნი ახალს. მე კი მითხრა: დაწერე, რადგან ეს სიტყვები სარწმუნოა და ჭეშმარიტი. "},
	{6, "6 კვლავ მითხრა მე: აღსრულდა. მე ვარ ანი და ჰაე, დასაბამი და დასასრული. და უსასყიდლოდ ვასმევ მწყურვალს სიცოცხლის წყლის წყაროს. "},
	{7, "7 მძლეველი დაიმკვიდრებს ამას, და მე ვიქნები მისი ღმერთი, ხოლო ის იქნება ჩემი ძე. "},
	{8, "8 მხდალთა და ურწმუნოთა, ბილწთა და მკვლელთა, მეძავთა და გრძნეულთა, კერპთაყვანისმცემელთა და ცრუთა ხვედრი კი ტბაშია, ცეცხლითა და გოგირდით მოგიზგიზეში. და ეს არის მეორე სიკვდილი. "},
	{9, "9 მაშინ მოვიდა ერთი იმ შვიდ ანგელოზთაგან, რომელთაც ჰქონდათ უკანასკნელი წყლულებით სავსე შვიდი თასი, და მითხრა: მოდი და გიჩვენებ ქალს, სასძლოს კრავისას. "},
	{10, "10 ამიყვანა სულით დიდსა და მაღალ მთაზე, და მიჩვენა დიდი ქალაქი, წმიდა იერუსალიმი, ღვთისაგან რომ ჩამოდიოდა ზეცით, "},
	{11, "11 და ჰქონდა დიდება ღვთისა, ხოლო მისი მნათობი პატიოსან თვალსა ჰგავდა, ბროლივით გამჭვირვალე იასპის ქვას. "},
	{12, "12 ვრცელი და მაღალი გალავნით შემოზღუდულს თორმეტი ბჭე ჰქონდა, ბჭეებზე - თორმეტი ანგელოზი, და ზედ ეწერა ისრაელის თორმეტი ტომის სახელი. "},
	{13, "13 აღმოსავლეთით სამი ბჭე, ჩრდილოეთით სამი, სამხრეთით სამი, დასავლეთით სამი. "},
	{14, "14 ქალაქის გალავანს თორმეტი საძირკველი ჰქონდა, და მათზე კრავის თორმეტი მოციქულის თორმეტი სახელი. "},
	{15, "15 ჩემთან მოუბარს საზომად ოქროს ლერწამი ჰქონდა, რათა გაეზომა ქალაქი, მისი ბჭენი და გალავანი. "},
	{16, "16 ხოლო ქალაქი ოთხკუთხედად ძევს, და მისი სიგრძე იგივეა, რაც სიგანე. გადაზომა ქალაქი ლერწმით თორმეტი ათას უტევანზე, და მისი სიგრძე, სიგანე და სიმაღლე ერთმანეთის ტოლნი აღმოჩნდნენ. "},
	{17, "17 გაზომა მისი გალავანი, და გამოვიდა ას ორმოცდაოთხი წყრთა, კაცის საზომით, ანუ იგივე საზომით ანგელოზისა. "},
	{18, "18 თვით გალავანი იასპით იყო ნაგები, ქალაქი კი წმიდა მინის მსგავსი ბაჯაღლო ოქროთი. "},
	{19, "19 ქალაქის გალავნის საძირკვლები ნაირგვარი ძვირფასი ქვით იყო შემკული: პირველი საძირკველი - იასპით, მეორე - საფირონით, მესამე - ქალკედონით, მეოთხე - ზურმუხტით, "},
	{20, "20 მეხუთე - სარდონიკით, მეექვსე - სარდიონით, მეშვიდე - ქრისოლითით, მერვე - ბივრილით, მეცხრე - ტოპაზით, მეათე - ქრისოპრასით, მეთერთმეტე - იაკინთით, მეთორმეტე - ამეთვისტოთი. "},
	{21, "21 თორმეტი ბჭე თორმეტი მარგალიტი იყო, თვითეული ბჭე თითო მარგალიტია, ქალაქის მოედანი კი - ბაჯაღლო ოქრო, ჭვირვალე მინის მსგავსი. "},
	{22, "22 ტაძარი კი ვერ ვიხილე მასში, რადგანაც მისი ტაძარი ყოვლისმპყრობელი ღმერთია და კრავი. "},
	{23, "23 ქალაქს არც მზე სჭირდება მანათობლად და არც მთვარე, რადგანაც ღვთის დიდებამ გაანათა იგი, ხოლო მისი სანთელი არის კრავი. "},
	{24, "24 ხალხები ივლიან მის ნათელში და მიწიერი მეფენი თავიანთ დიდებასა და პატივს შეიტანენ მასში. "},
	{25, "25 მისი ბჭენი არ დაიხშვიან დღისით, ღამე კი არასოდეს იქნება იქ. "},
	{26, "26 და მიიტანენ მასში ხალხთა დიდებასა და პატივს. "},
	{27, "27 ვერ შევა მასში ვერავითარი უწმინდური, ვერცერთი ცრუ და ბილწი, არამედ მხოლოდ ისინი, ვინც ჩაწერილია კრავის სიცოცხლის წიგნში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct ka22 poems[] = {
	{1, "1 და მიჩვენა სიცოცხლის წყლის მდინარე, კამკამა, როგორც ბროლი, რომელიც მოედინებოდა ღვთისა და კრავის ტახტიდან. "},
	{2, "2 მისი მოედნის შუაში და მდინარის გაღმა-გამოღმა სიცოცხლის ხეა, ყოველთვიურად რომ გამოაქვს თორმეტი ნაყოფი, ხის ფოთლები კი კურნავენ ხალხებს. "},
	{3, "3 აღარაფერი დარჩება დაწყევლილი, ღვთისა და კრავის ტახტი იქნება იქ, და მისი მონები მოემსახურებიან მას. "},
	{4, "4 იხილავენ მის სახეს და მათ შუბლზე იქნება მისი სახელი. "},
	{5, "5 ღამე აღარ იქნება იქ, ასე რომ, აღარც სანთელი დასჭირდებათ და არც მზის ნათელი, რადგანაც ღმერთი გაანათლებს მათ, და იმეფებენ უკუნითი უკუნისამდე. "},
	{6, "6 და მითხრა: ეს სიტყვები სარწმუნოა და ჭეშმარიტი. წინასწარმეტყველთა სულების უფალმა ღმერთმა მოავლინა თავისი ანგელოზი, რათა უჩვენოს მონებს თვისას, რაც უნდა მოხდეს მალე. "},
	{7, "7 აჰა, მოვალ მალე. ნეტარია, ვინც ინახავს ამ წიგნის წინასწარმეტყველების სიტყვებს. "},
	{8, "8 მე, იოანემ, ვიხილე და ვისმინე ეს, და როცა ვიხილე და ვისმინე, დავემხე ანგელოზის ფერხთით, რომელმაც მაჩვენა ყოველივე ეს, რათა თაყვანი მეცა. "},
	{9, "9 მაგრამ მან მითხრა: ნუ იზამ ამას, რადგანაც მე შენი, შენი წინასწარმეტყველი ძმებისა და იმათი თანა-მონა ვარ, ვინც ინახავს ამ წიგნის სიტყვებს. მე კი არა, ღმერთს ეცი თაყვანი. "},
	{10, "10 კვლავ მითხრა მე: ნუ დაბეჭდავ ამ წიგნის წინასწარმეტყველების სიტყვებს, რადგანაც ახლოა ჟამი. "},
	{11, "11 უსამართლო კვლავ უსამართლობდეს, ბილწი კვლავინდებურად ბილწობდეს, მართალი კვლავ მართლობდეს და წმიდა კვლავაც წმიდობდეს. "},
	{12, "12 აჰა, მოვალ მალე. ჩემთანაა ნაცვლისგება ჩემი, და მისი საქმისამებრ მივაგებ ყოველს. "},
	{13, "13 მე ვარ ანი და ჰაე, პირველი და უკანასკნელი, დასაბამი და დასასრული. "},
	{14, "14 ნეტა მათ, რომელნიც რეცხავენ თავიანთ სამოსს, რათა ჰქონდეთ უფლება სიცოცხლის ხის მიმართ, რომ ბჭით შევიდნენ ქალაქში. "},
	{15, "15 ხოლო გარეთ ძაღლები და გრძნეულნი, მეძავნი და მკვლელნი, კერპთმსახურნი და სიცრუის მოყვარენი და მოქმედნი დგანან. "},
	{16, "16 მე, იესომ, მოვავლინე ჩემი ანგელოზი, რათა ეკლესიებში გიმოწმოთ ეს. მე ვარ დავითის ფესვი და მოდგმა, ცისკრის კაშკაშა ვარსკვლავი. "},
	{17, "17 სული და სასძლო ამბობენ: მოდი! მსმენელმაც თქვას: მოდი! მწყურვალი მოვიდეს და მსურველმა უსასყიდლოდ მიიღოს სიცოცხლის წყალი. "},
	{18, "18 ვუმოწმებ ყველას, ვინც ისმენს ამ წიგნის წინასწარმეტყველების სიტყვებს: თუ ვინმე რამეს დაურთავს მათ, ღმერთი დაურთავს მას წყლულებს, რომლებიც წერია ამ წიგნში. "},
	{19, "19 ხოლო თუ ვინმე რამეს მოაკლებს ამ წიგნის წინასწარმეტყველების სიტყვებს, ღმერთი მოაკლებს მას წილს სიცოცხლის ხიდან, წმიდა ქალაქიდან და იქიდან, რაც ჩაწერილია ამ წიგნში. "},
	{20, "20 ამის დამმოწმებელი ამბობს: ჰო, მოვალ მალე! ამინ; ჰო, მოდი, უფალო იესო! "},
	{21, "21 ჩვენი უფლის, იესო ქრისტეს მადლი ყველა თქვენგანთან. ამინ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};