#include <map>
#include <string>
class Bible21
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
	struct ka6	{ int val; const char *msg; };
	struct ka7	{ int val; const char *msg; };
	struct ka8	{ int val; const char *msg; };
	struct ka9	{ int val; const char *msg; };
	struct ka10	{ int val; const char *msg; };
	struct ka11	{ int val; const char *msg; };
	struct ka12	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 სიტყვანი ეკლესიასტესი, ძისა დავითისა, იერუსალიმის მეფისა. "},
	{2, "2 ამაოება ამაოებათა, თქვა ეკლესიასტემ, ამაოება ამაოებათა, ყოველივე ამაოა. "},
	{3, "3 ადამიანს რას ჰმატებს შრომა, რომელსაც იგი მზის ქვეშ ეწევა? "},
	{4, "4 თაობა მიდის, თაობა მოდის, ეს ქვეყანა კი უცვლელია უკუნისამდე. "},
	{5, "5 აღმოხდება მზე და ჩადის იგი, უბრუნდება თავის ადგილს და კვლავ იქიდან ამობრწყინდება. "},
	{6, "6 სამხრეთისაკენ მიჰქრის ქარი, გაბრუნდება ჩრდილოეთისკენ; ბრუნავს, ბრუნავს, მიჰქრის ქარი და უბრუნდება ისევ თავის წრეს. "},
	{7, "7 ყველა მდინარე ზღვებისაკენ მიედინება, ზღვა კი მაინც არ აღივსება; მდინარენი საითკენაც მიედინებოდნენ, კვლავაც იქითკენ მიედინებიან. "},
	{8, "8 უძლურია ყოველი სიტყვა, არ ძალუძს კაცს ყოველივეს თქმა; თვალი ხედვით ვერ გაძღება, ყური სმენით ვერ აღივსება. "},
	{9, "9 რაც ყოფილა, იგივე იქნება და რაც მომხდარა, იგივე მოხდება; არაფერია მზის ქვეშ ახალი. "},
	{10, "10 ნახავენ რასმე და იტყვიან: აჰა, ახალი. ესეც ყოფილა ჩვენს წინარე საუკუნეში. "},
	{11, "11 არ დარჩენილა ხსოვნა იმათი, ვინც წინათ იყო; და მომდევნოთაც, ვინც იქნებიან, არ გაიხსენებს მათი მიმყოლი. "},
	{12, "12 მე, ეკლესიასტე, მეფე ვიყავ ისრაელისა იერუსალიმში. "},
	{13, "13 ვიწყე კვლევა გულმოდგინებით, გონებით განსჯა ყოველივესი, რაიც მომხდარა ცისქვეშეთში; ეს მძიმე საქმე მიუჩინა უფალმა ადამის ძეთ სატანჯველად. "},
	{14, "14 განვიცადე ყოველი საქმე, რაც კი მომხდარა მზისქვეშეთში; და აჰა, ვცანი - ამაო არის ყველაფერი და ქარის დევნა. "},
	{15, "15 გამრუდებულს ვეღარ გამართავ, ხოლო ნაკლულს ვეღარაფრით ვეღარ შეავსებ. "},
	{16, "16 ვუთხარი ჩემს თავს: აჰა, მოვიპოვე და განვიმრავლე ცოდნა ყოველთა უპირატესად, ვინც არსებულა ჩემს უწინარეს იერუსალიმში, და ეზიარა გონება ჩემი განუზომელ სიბრძნეს და ცოდნას. "},
	{17, "17 როცა მივაპყარ გულისყური, შევიცან სიბრძნე, მეცნიერება, უმეცრება და სისულელე, მივხვდი - ამასაც არა აქვს აზრი. "},
	{18, "18 რადგან, როცა დიდია სიბრძნე, დარდიც დიდია; მრავლის შეცნობა ადამიანს წუხილს უმრავლებს."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 ვუთხარი ჩემს თავს: მოდი, გამოვცდი მხიარულებას და მივეცემი სიამეთა - და აჰა, ესეც ამაოება ყოფილა მხოლოდ. "},
	{2, "2 მივხვდი, გართობა ფუჭი საქმეა; მხიარულება რის მაქნისია? "},
	{3, "3 ვიფიქრე, ღვინით დამებანგა ჩემი სხეული, ხოლო გონებას სიბრძნით ეფხიზლა; დავდგომოდი გზას სიბრიყვისას, ვიდრე ვნახავდი, რა სიკეთეა კაცთათვის მასში, რასაც იქმნიან ცისქვეშეთში, სანამ ცოცხლობენ. "},
	{4, "4 დიდი საქმე ჩავიდინე, ავიგე სახლნი, ჩავყარე ვაზი, "},
	{5, "5 გავიშენე ჩემთვის ბაღები და წალკოტები, დავრგე ხეხილი ყოველგვარი,"},
	{6, "6 წყალსატევები მოვაწყვე, რომ მოერწყათ ნორჩი ტევრები,"},
	{7, "7 შევიძინე მონა-მხევალნი, და მრავლად მესხნენ სახლში სახლეულნი; მყავდა ცხვარ-ძროხა იმათზე მეტი, ვისაც ჩემს უწინ უმეფია იერუსალიმში. "},
	{8, "8 დავაგროვე ოქრო და ვერცხლი, მეფეთა განძი ყოველი მხარის; გავიჩინე მგალობელნი, კაცნი და ქალნი, და სიამენი ხორციელნი, ულამაზეს ხარჭათა დასი. "},
	{9, "9 განვიდიდე და გავმდიდრდი უმეტეს მათსა, ვინც ჩემს წინარე არსებულა იერუსალიმს; და სიბრძნე ჩემი მევე მეყუდნა. "},
	{10, "10 არ უარვყავი არაფერი, რაც კი მომთხოვეს ჩემმა თვალებმა, არ დავაოკე გული ჩემი სიხარულისგან, რადგან ხარობდა ჩემი გული ჩემი ნაღვაწით. ეს ყოველივე იყო ვედრი ჩემი შრომისა. "},
	{11, "11 მერმე, როდესაც გადავხედე ყოველივეს, რაც კი შექმნა ჩემმა მარჯვენამ, და ყოველ საქმეს, ჩემს ნამოქმედარს, მივხვდი, ამაო რომ ყოფილა ეს ყველაფერი, ქარისნაბერი, და რომ არ არის სარგებელი ამ მზისქვეშეთში. "},
	{12, "12 რადგან რაღა ქმნას ადამიანმა, რომელიც მოვა შემდგომ მეფისა, რომელსაც უკვე ყველაფერი უქმნია ქვეყნად? "},
	{13, "13 ოდეს ვიკვლიე, რა არის სიბრძნე ანუ სიბრიყვე და უმეცრება, ვნახე, რომ სიბრძნე სიბრიყვეზე უპირატესობს, ისევე როგორც ნათელი ბნელზე. "},
	{14, "14 ბრძენი კაცი გონებითა ჭვრეტს, უგუნური კი ბნელში დავალს. და ვუწყი, მაინც მოწევნადი ერთი აქვს ყველას. "},
	{15, "15 გულს ვუთხარ მაშინ: მეც უგუნურის ბედი მეწევა; მაშ, რადღა ვიყავ მე სხვაზე ბრძენი? და გულსვე ვუთხარ: ამაოება ყოფილა ესეც. "},
	{16, "16 მარადიულად არ ეხსომებათ არც ბრძენკაცი, არც უგუნური; გაივლის ჟამი, ყველაფერი დაივიწყება. ვაგლახ, რომ კვდება ბრძენი კაცი უგუნურივით. "},
	{17, "17 და შევიძულე მე ეს ცხოვრება, რადგან მემწარა ყველაფერი, რაც მზის ქვეშ ხდება, რადგან ყოველი ამაოა, ქარების დევნა. "},
	{18, "18 და მოვიძულე ყოველივე ნაღვაწი ჩემი, რაც მიღვაწია ამ მზისქვეშეთში, და რაც სხვას უნდა დავუტოვო, ჩემს შემდგომ მოსულს. "},
	{19, "19 არავინ უწყის, ვის შეხვდება ჩემი ნაღვაწი, ბრძენს თუ უგუნურს, რაიც სიბრძნით მომიღვაწია ამ მზისქვეშეთში? აჰა, კიდევ ამაოება. "},
	{20, "20 და წარვუხოცე იმედი ჩემს თავს, რომ აღარაფერს მოველოდე იმ ღვაწლისაგან, რაც მზისქვეშეთში გამიწევია. "},
	{21, "21 ნახავ კაცს, იღვწის, არ იშურებს სიბრძნეს და ცოდნას, მაგრამ ნაღვაწი სხვას ხვდება წილად, ვისაც არასდროს უღვაწნია ამ საქმისათვის. ამაოება არის ესეც და უდიდესი ბოროტება. "},
	{22, "22 მაშ, რაღა რჩება ადამიანს შრომისა და ზრუნვის შედეგად, რომელსაც იგი მზის ქვეშ ეწევა? "},
	{23, "23 დღენი მისნი სატანჯველია, საზრუნავი მისი - წუხილი, ღამითაც არ ისვენებს, შფოთავს გული. აჰა, კვლავ ამაოება. "},
	{24, "24 კაცისათვის არაფერია იმაზე კარგი, რომ ჭამოს, სვას და დატკბეს თავისი ნაღვაწით. ეს გამოვცადე, რადგან ესეც ღმერთის ხელთაა. "},
	{25, "25 ვინ ჭამს ანუ სვამს, ან განცხრომას ვინ მიეცემა მის გარეშე?"},
	{26, "26 ვისაც ის ითნევს, მას მიანიჭებს სიბრძნეს ცოდნასა და სიხარულს; ხოლო ცოდვილს კი მოხვეჭისათვის საზრუნავს უჩენს, რათა ღვთის სათნოს დაუტოვოს ეს მონაგარი. ამაოება არის ესეც და ქარის დევნა."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 ყოველივეს თავის დრო აქვს და ყველაფერს თავისი ჟამი ამ ცისქვეშეთში. "},
	{2, "2 ჟამი შობისა და ჟამი სიკვდილისა; ჟამი დანერგვისა და ჟამი დანერგულის აღმოფხვრისა. "},
	{3, "3 ჟამი მოკვდინებისა და ჟამი განკურნებისა; ჟამი ნგრევისა და ჟამი შენებისა. "},
	{4, "4 ჟამი ტირილისა და ჟამი სიცილისა; ჟამი გლოვისა და ჟამი ლხინისა. "},
	{5, "5 ჟამი ქვათა მიმოფანტვისა და ჟამი მათი შეგროვებისა; ჟამი მიჯნურთა პაემანისა და ჟამი მათი გაყრისა. "},
	{6, "6 ჟამი პოვნისა და ჟამი დაკარგვისა; ჟამი შენახვისა და ჟამი გაფლანგვისა. "},
	{7, "7 ჟამი დარღვევისა და ჟამი შეკერვისა; ჟამი დუმილისა და ჟამი უბნობისა. "},
	{8, "8 ჟამი სიყვარულისა და ჟამი სიძულვილისა; ჟამი ომისა და ჟამი მშვიდობისა. "},
	{9, "9 რას არგებს მაშვრალს შრომა მისი? "},
	{10, "10 კიდევაც ვნახე საზრუნავი, რომელიც ღმერთმა მიუჩინა ადამის ძეთ მათ სატანჯველად. "},
	{11, "11 მან ყველაფერი კეთილად შექმნა თავის დროისთვის, თვით იდუმალის შეცნობად აღძრა გონება კაცთა, ოღონდ ისე, რომ ვერ გაუგონ ღვთის ნამოქმედარს თავი და ბოლო. "},
	{12, "12 ვუწყი, რადგან არაფერია კაცისათვის იმაზე კარგი, რომ გაიხაროს და ქმნას სიკეთე, ვიდრეღა ცოცხლობს. "},
	{13, "13 თუ კაცსა ვისმე არ აკლდება სასმელ-საჭმელი და შრომისა წილ სიკეთეს ჰპოვებს, ეს მადლია, ღვთის ნაბოძები. "},
	{14, "14 ვუწყი ისიც, რომ ყოველივე, ღვთის მიერ ქმნილი, იარსებებს უკუნისამდე; არც დამატება სჭირდება რამის, არც გამოკლება. ასე ქმნა ღმერთმა, მის წინაშე შიში რომ ჰქონდეთ. "},
	{15, "15 რაიც ყოფილა, უკვე არის დიდი ხანია; და რაც იქნება, ის უკვე იყო. და აწ გარდასულს მხოლოდ ღმერთი გამოიძიებს. "},
	{16, "16 კიდევ ვიხილე მზისქვეშეთში: განსჯის ადგილი დაეჭირა უკანონობას. მართლის ადგილი მტყუან კაცს ეპყრა. "},
	{17, "17 მაშინ ვთქვი გულში: ღმერთი განსჯის მართალს და მტყუანს, როცა ყველაფერს და ყოველ საქმეს დაუდგება იქ თავის ჟამი. "},
	{18, "18 და ვთქვი ჩემს გულში: ასე გამოცდის თურმე ღმერთი ადამის ძეთა, რათა დარწმუნდნენ, რომ თავისთავად პირუტყვები არიან მხოლოდ. "},
	{19, "19 რადგან კაცის და პირუტყვის ხვედრი ერთია - ერთის სიკვდილი მეორისას ჰგავს და ყველას ერთი სული უდგას, კაცი პირუტყვზე ვერაფრით ვერ უპირატესობს, რადგან ყველაფერი ამაოა. "},
	{20, "20 ყოველივე ერთ ადგილს მივა; ყველაფერი მიწისგანაა და ყველაფერი მიწად იქცევა. "},
	{21, "21 რომელი იტყვის, რომ კაცთა სული ზევით მიილტვის, ხოლო პირუტყვის ქვევით ჩადის, ქვესკნელისკენ? "},
	{22, "22 ვხედავ, კაცთათვის სხვა სიკეთე რომ არ ყოფილა, თუ არ იხარა თავის ნაღვაწით, რადგან ესაა მისი წილი ამ მზისქვეშეთში, ვინ დაანახვებს, რა მოხდება შემდგომად მისა?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 კვლავაც ვხედავდი ძალადობას, რაც კი ხდებოდა ამ მზისქვეშეთში: აჰა იღვრება ჩაგრულთა ცრემლი და მათ არავინ ანუგეშებს; მათ მჩაგვრელთა ხელშია ძალა, არავინა ჰყავთ ნუგეშისმცემი. "},
	{2, "2 უფრო ბედნიერად შევრაცხე დიდიხნის მკვდარნი მათზე, ვინც ჯერაც ცოცხლობენ კიდევ. "},
	{3, "3 და ორთავეზე ბედნიერი მაინც ის არის, ვინც ჯერაც არ დაბადებულა და არ უხილავს ბოროტება, რაც მზის ქვეშ ხდება. "},
	{4, "4 ისიცა ვნახე, რომ სიბეჯითე ყველა საქმეში მხოლოდ ერთურთის შურით არის გამოწვეული. ამაოება ყოფილა ესეც და ქარის დევნა. "},
	{5, "5 ბრიყვს გულზე ხელი დაუკრეფია და თავის ხორცს ჭამს. "},
	{6, "6 ერთი პეშვი სიმშვიდე სჯობს მთელ კალთა გარჯას და ფუჭ საზრუნავს. "},
	{7, "7 კიდევ და კიდევ განვიცადე ამაოება ამ მზისქვეშეთში. "},
	{8, "8 არსებობს კაცი მარტოხელა, არ ჰყავს არავინ, არც ძმა, არც შვილი, ხოლო მის შრომას ბოლო არ უჩანს და ვერ გაძღება მისი თვალი დოვლათის ხილვით. ვისთვისღა ვშრომობ და სიამეს რისთვის ვიკლებდი? ამაოება არის ესეც და ფუჭი საქმე. "},
	{9, "9 მარტო ყოფნას სჯობს ორნი იყვნენ, რადგან კეთილად მიეზღვებათ მათ საშრომელში. "},
	{10, "10 თუ დაეცნენ, ერთი მაინც წამოაყენებს თავის ამხანაგს. მაგრამ ვაი, მარტომყოფს, თუ დაეცა ვინღა უშველის? "},
	{11, "11 თუ ორნი დაწვნენ, გათბებიან; მარტომყოფს კი რაღა გაათბობს! "},
	{12, "12 თუ ერთს დასძლევს ვინმე, ორი ხომ გაუმკლავდება. მალე არ გაწყდება სამმაგი ძაფი. "},
	{13, "13 ღატაკი, მაგრამ ბრძენი ყმაწვილი სჯობს მოხუცებულ და ბრიყვ მეფეს, რომელიც უკვე ვერას ისწავლის. "},
	{14, "14 რადგან იგი საპყრობილიდანაც გამოვა მეფედ, თუნდაც თავის სამეფოში უპოვრად იშვას. "},
	{15, "15 ვიხილე: ყოველ მკვიდრს მზისქვეშეთში ყმაწვილი ახლავს, ეს მისი სხვაა, მის ნაცვლად დადგება. "},
	{16, "16 არ უჩანს დასასრული ხალხს, ვინც მათ უწინარეს იყო, და არც შემდგომნი მოინატრებენ მათ. რადგან ესეც ამაოებაა და ქარის დევნა. "},
	{17, "17 ფეხს ნუ აუჩქარებ ღვთის სახლისკენ მიმავალი; გაფრთხილდი, მსხვერპლი უგუნურთა მსგავსად არ შესწირო, რადგან არ უწყიან, უკეთურებას რომ სჩადიან."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 ნუ გისწრებს ენა და გული შენი ნუ გაჩქარის სიტყვის წარმოთქმას ღვთის წინაშე, რადგან ღმერთი ცაშია, შენ კი - მიწაზე. ამიტომ იკმარე ცოტა სიტყვები. "},
	{2, "2 როგორც მრავლადაა სიზმარში ამბები, ისე მრავალსიტყვაა უგუნურის ნაუბარი. "},
	{3, "3 თუ ღმერთს აღთქმას მისცემ, ნუ დააყოვნებ მის აღსრულებას, რადგან უპირონი არად ვარგანან. რასაც აღუთქვამ, აღუსრულე. "},
	{4, "4 სჯობს არ აღუთქვა, ვიდრე აღთქმული არ აღუსრულო. "},
	{5, "5 ნუ ათქმევინებ შენს ბაგეებს ისეთ სიტყვას, რომ ცოდვაში ჩაიგდო თავი; ნურც იმართლებ თავს ანგელოსის წინაშე, შევცდიო. რად უნდა განრისხდეს ღმერთი შენს ხმაზე და დაღუპოს შენი ხელით ქმნილი? "},
	{6, "6 რადგან ბევრს სიზმრებს ბევრი ამაო სიტყვა ახლავს; შენ კი ღვთისა გეშინოდეს. "},
	{7, "7 თუ სადმე ქვეყნად იხილავ ღატაკთა შევიწროებას და სიმართლისა და ჭეშმარიტების შერყვნას, ნუ გაიკვირვებ, რადგან მაღალს უთვალთვალებს მასზე მაღალი; ხოლო მათ ზემოთ კიდევ არის უფრო მაღალი. "},
	{8, "8 უკეთესია ის ქვეყანა, სადაც მეფე ქვეყნისთვის იღწვის. "},
	{9, "9 ფულის მოყვარული ფულით ვერ გაძღება, და არც სიმდიდრის მოყვარული თავის შემოსავლით. ესეც ამაოებაა. "},
	{10, "10 ბევრ დოვლათს ბევრი მჭამელი ჰყავს; რაღა დარჩება პატრონს მისას? მხოლოდ ყურება. "},
	{11, "11 ტკბილია ძილი მშრომელი კაცის, გინდ ცოტა ჭამოს, გინდ ბევრი; ხოლო სიმაძღრე ძილს უფრთხობს მდიდარს. "},
	{12, "12 არის, მიხილავს მტანჯველი ბოროტება ამ მზისქვეშეთში: პატრონის საზიანოდ დამარხული სიმდიდრე. "},
	{13, "13 დაიკარგება ეს სიმდიდრე უბედური შემთხვევის გამო და შვილი მისი ხელცარიელი დარჩება; "},
	{14, "14 ისევ შიშველი გაბრუნდება, როგორც მოვიდა დედის მუცლიდან და ვეღარაფერს მოიხვეჭს შრომით. "},
	{15, "15 ესეც მტანჯველი ბოროტებაა: როგორც მოვიდა, ისე რომ წავა. რა სიკეთეა, ფუჭად რომ შრომობს? "},
	{16, "16 თან თავის დღეებს ბნელში ამოჭამს, დარდით, ტკივილით გულგასენილი. "},
	{17, "17 აი, სად ვხედავ მე სიკეთეს, შესაფერ საქმეს: ჭამოს კაცმა, სვას და იხაროს თავისი ღვაწლით ამ მზისქვეშეთში დღენი მისნი, ღმერთმა რომ მისცა; რადგან ესაა მისი ხვედრი. "},
	{18, "18 კაცს ღმერთი აძლევს ქონებასა და სიმდიდრეს და იმის შნოსაც, რომ მოიხმაროს, მიიღოს წილი და გაიხაროს თავისი შრომით; ეს ყველაფერი ღვთის წყალობაა. "},
	{19, "19 და რაკი ბევრს ვეღარაფერს გაიხსენებს კაცი თავის სიცოცხლეში, ღმერთი მისცემს მას გულის სიხარულს."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ka6 poems[] = {
	{1, "1 არის ბოროტება, რომელიც ვიხილე მზისქვეშეთში და მძიმეა იგი კაცთათვის. "},
	{2, "2 მისცემს კაცს ღმერთი ქონებას, სიმდიდრეს და დიდებას, და აჰა, ყველაფერი აქვს, რაც კი ინატრა, მაგრამ ღმერთი არ მოახმარებს და სხვა, უცხო ვინმე, მოიხმარს. ამაოება არის ეს და უბედურება. "},
	{3, "3 კიდეც რომ შვას კაცმა ასი შვილი და იცოცხლოს მრავალი წელი, მაგრამ ვერ იგემოს სიამე და საფლავიც აღარ ეღირსოს, ვიტყვი, უჯობდა დედის მუცელს მოწყვეტილიყო. "},
	{4, "4 ფუჭად რომ მოვიდა და ბნელში წავიდა, ბნელში რომ დაინთქა სახელი მისი; "},
	{5, "5 ვისაც მზე არ უნახავს და არც გაუგია, იმ კაცზე უფრო მოსვენებულია. "},
	{6, "6 თუნდაც იცოცხლოს ორი ათას წელს და ვერაფერი სიკეთე ნახოს, რა ბედენაა, მაინც ყველა ერთ ადგილს მივა. "},
	{7, "7 ადამიანის ყოველი შრომა პირისთვისაა, მაგრამ სული არ აღივსება. "},
	{8, "8 რადგან რა უპირატესობა აქვს ბრძენს უგუნურზე? ან და ღატაკს, რომელმაც იცის, როგორ გაუძლოს ცხოვრებას? "},
	{9, "9 სჯობს თვალით ნახო, ვიდრე გულს აჰყვე - ამაოება არის ესეც და ქარის დევნა. "},
	{10, "10 რაც კი არსებობს, ყოველივეს დიდი ხანია სახელი ჰქვია; არ არის კაცი, ესეც ცნობილია: ძლიერთან დავა კაცს არ შეუძლია. "},
	{11, "11 ბევრი რამეა, ამაოებას რომ ამრავლებს; რა უპირატესობა აქვს კაცს? "},
	{12, "12 რადგან ვინ უწყის, რა არის კარგი კაცისთვის მის ამაო წუთისოფელში, რომელსაც აჩრდილივით ატარებს? ვინ აუწყებს კაცს, რა მოხდება მის შემდეგ მზის ქვეშ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct ka7 poems[] = {
	{1, "1 კარგი სახელი სჯობს ძვირფას ნელსაცხებელს, დღე სიკვდილისა - გაჩენის დღეს. "},
	{2, "2 ტირილში წასვლა სჯობს ლხინში წასვლას, რადგან იქ არის ბოლო კაცისა; ცოცხალმა კაცმა ეს ყურად იღოს. "},
	{3, "3 მწუხარება სჯობს სიცილს, რადგან სახის დაღვრემისას კეთილია გული. "},
	{4, "4 ბრძენთა ფიქრები გლოვის სახლშია, უგუნურთა ფიქრები - მხიარულების სახლში. "},
	{5, "5 სჯობს ბრძენისაგან კიცხვას ისმენდე, ვიდრე ბრიყვისგან ქება-დიდებას. "},
	{6, "6 რადგან ბრიყვთა სიცილი ქვაბის ქვეშ ფიჩხის ტკაცუნს ჰგავს; ამაოებაა ეს. "},
	{7, "7 გაჭირვება ბრძენს გამოაჩენს, ხოლო ქრთამი რყვნის გულს კაცისას. "},
	{8, "8 საქმის ბოლო სჯობს მის დასაწყისს; სულგრძელი კაცი სჯობს ამპარტავანს. "},
	{9, "9 გულისწყრომად ნუ იჩქარი, რადგან გულისწყრომა უგუნურთა მკერდში ბუდობს. "},
	{10, "10 ნუ იტყვი: წარსული დროება აწმყოს რად სჯობდაო, რადგან სიბრძნე არ ახლავს ამ კითხვას. "},
	{11, "11 კარგია სიბრძნე და დოვლათი, დიდად სარგოა მზის მჭვრეტელთათვის. "},
	{12, "12 სიბრძნეც დაიფარავს კაცს და ფულიც დაიფარავს, მაგრამ სიბრძნე უპირატესია; მის მფლობელს აცოცხლებს. "},
	{13, "13 შეხედე ღვთის შექმნილს: ვინ გამართავს მისგან გამრუდებულს? "},
	{14, "14 კეთილდღეობისას იბედნიერე, ძნელბედობისას ფრთხილად მოიქეც! ესეც და ისიც ღმერთმა შექმნა ერთმანეთის საპირისპიროდ, რათა კაცმა მის უკან ვერაფერი შეიცნოს. "},
	{15, "15 ბევრი რამ ვნახე ჩემს ამაო წუთისოფელში: მართალი იღუპება თავის სიმართლეში, ბოროტეული დღეგრძელობს თავის ბოროტებაში. "},
	{16, "16 ნუ იქნები ზედმეტად მართალი და მეტისმეტად ნუ დაბრძენდები - რად გინდა, რომ შეძრწუნდე? "},
	{17, "17 მეტისმეტად ნუ იბოროტებ, არც გაბრიყვდე - რად გინდა, რომ უდროოდ მოკვდე? "},
	{18, "18 უმჯობესია, ერთიც იყო და მეორეც, არც ერთი უარყო და არც მეორე; რადგან ღვთის მოშიში ყველაფრისგან თავს აღწევს. "},
	{19, "19 სიბრძნე ბრძენისათვის ძალაა, ქალაქის ათ მბრძანებელზე აღმატებული. "},
	{20, "20 არ იპოება ქვეყნად მართალი კაცი, რომელიც იქმოდეს კეთილ საქმეს და არ სცოდავდეს. "},
	{21, "21 ყველა სიტყვას, რასაც ამბობენ, ყურს ნუ მიუგდებ, რათა არ გესმოდეს, შენი მონა როგორ გაგინებს. "},
	{22, "22 რადგან ბევრჯერ გამოგიცდია, შენც რომ აგინებდი სხვებს. "},
	{23, "23 ყოველივე ეს სიბრძნით გამოვიკვლიე; ვთქვი: ბრძენი ვარ-მეთქი, მაგრამ სიბრძნე შორსაა ჩემგან. "},
	{24, "24 შორია, რაც იყო, და ღრმა არის, ღრმა, ვინ მიაგნებს? "},
	{25, "25 გულს ვიდევ, შემეცნო, შემესწავლა, გამომეკვლია, რა არის სიბრძნე და გონიერება, რათა მცოდნოდა, რომ უმეცრება ბოროტებაა. "},
	{26, "26 მივხვდი, სიკვდილზე მწარეა დიაცი, მახე და ბადეა მისი გული,ბორკილებია ხელები მისი; ღვთის სათნო გადაურჩება, ხოლო ცოდვილი მისგან დატყვევდება. "},
	{27, "27 აი, რას მივხვდი, თქვა ეკლესიასტემ: თანმიყოლებით უნდა მისდიო, რომ აზრს მიაგნო. "},
	{28, "28 კიდევ ამას ეძიებდა გონება ჩემი, მაგრამ ვერ ვპოვე: ათასიდან ერთი მამაკაცი ვპოვე, მაგრამ მათ შორის ვერა ვპოვე ვერცერთი ქალი. "},
	{29, "29 აჰა, ეს ვპოვე მხოლოდ: ღმერთმა წრფელი შექმნა კაცი, ისინი კი ზედმეტ თავსატეხს მრავლად იჩენენ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct ka8 poems[] = {
	{1, "1 ბრძენს ვინ შეედრება და ვინ შეიცნობს საგანთა ბუნებას? სიბრძნე ადამიანს სახეს უნათლებს და მისი სახის სიტლანქე იცვლება. "},
	{2, "2 გეუბნები, ასრულებდე მეფის ბრძანებას, თუნდაც ღვთისადმი მიცემული ფიცის გამო. "},
	{3, "3 ნუ ისწრაფვი მისგან წასვლას და ბოროტ საქმეს ნუ დაადგები, რადგან რასაც ისურვებს, ყველაფერს გააკეთებს. "},
	{4, "4 ვინაიდან სიტყვა მეფისა კანონია; ვინ ჰკადრებს მას, რას აკეთებო? "},
	{5, "5 ცნების შემნახველს ავი საქმე არ შეემთხვევა; ჟამსაც და წესსაც ბრძენკაცის გული გრძნობს. "},
	{6, "6 ვინაიდან ყველაფერს ჟამი და წესი აქვს, ადამიანის უბედურება კი ის არის, "},
	{7, "7 რომ მან არ იცის; რა მოხდება; ან ვინ ეტყვის მას, როგორ მოხდება? "},
	{8, "8 არავის ძალუძს ქარის შეჩერება, ვერავინ განაგებს დღეს სიკვდილისას, ვერვის დაითხოვენ ბრძოლის ველიდან, ვერ იხსნის სიბოროტე მის პატრონს. "},
	{9, "9 ეს ყველაფერი ვიხილე და დავაკვირდი ყველა საქმეს, რაც მზისქვეშეთში მომხდარა; და ის დროც ვნახე, როცა კაცი კაცზე მძლავრობდა თავისდა საზიანოდ. "},
	{10, "10 კიდევაც ვნახე ბოროტეულნი დამარხულნი, ადრე რომ მოდიოდნენ წმიდა ადგილას და ბრუნდებოდნენ; დავიწყებულ იქმნენ იმ ქალაქში, სადაც ამგვარად იქცეოდნენ. ესეც ამაოებაა. "},
	{11, "11 რაკი სწრაფადვე არ ისჯება ბოროტი საქმე, ამიტომ ბედავს კაცი ბოროტების ჩადენას. "},
	{12, "12 ცოდვილმა კაცმა ასჯერაც რომ ჩაიდინოს ბოროტი საქმე, მიეტევება; მე ისიც ვიცი, რომ მიეგებათ მადლი ღვთისმოსავთ, რომელთაც ეშინიათ ღვთისა. "},
	{13, "13 არ მიეგებათ მადლი ბოროტეულთ და ლანდივით დღემოკლე იქნება ყველა, ვისაც ღვთისა არ ეშინია. "},
	{14, "14 არის კიდევ ამაოება, ქვეყნად რომ ხდება: მართლებს ბოროტეულთა საქმეთაებრ მიეგებათ; და არიან ბოროტეულნი, რომელთაც მართალთა საქმეთაებრ მიეგებათ. ვთქვი: ესეც ამაოებაა. "},
	{15, "15 და შევაქე მე მხიარულება, რადგან არ ყოფილა სხვა სიკეთე ადამიანისთვის მზისქვეშეთში, გარდა იმისა, რომ სვას, ჭამოს და იმხიარულოს; ეს ყოველივე ახლავს მას მის საშრომელში დღენი მისნი, ღმერთმა რომ უბოძა მზისქვეშეთში. "},
	{16, "16 როცა გულს ვიდევ, შემეცნო სიბრძნე და მომეხილა ყოველი საქმე, რაც ქვეყნად ხდება, ჩემს თვალებს ძილი არ უნახავთ არც დღე, არც ღამე. "},
	{17, "17 ვიხილე ღვთის ყოველი საქმე, რომ ვერ მიხვდება ადამიანი ვერაფერ საქმეს, რაც მზის ქვეშ ხდება; რაც უნდა დაშვრეს და იძიოს, ვერას მიხვდება; თუნდაც ბრძენკაცმა თქვას: მივხვდიო, ვერას მიხვდება."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct ka9 poems[] = {
	{1, "1 ეს ყოველივე გულში ჩავიდევი და გამოვიკვლიე ეს ყველაფერი, რომ მართალნი, ბრძენნი და მათი ნამოქმედარნი ღვთის ხელთაა; არც სიყვარული, არც სიძულვილი არ უწყის კაცმა და არც სხვა რამე, რაც მის წინაა. "},
	{2, "2 ერთი ხვედრი აქვს ყველას: მართალს და უკუღმართს, კეთილს და ბოროტს, სუფთას და მირეულს, მსხვერპლის შემწირველს და მსხვერპლის არშემწირველს, როგორც კეთილს, ისე ცოდვილს, როგორც მოფიცარს, ისე ფიცის მოშიშს. "},
	{3, "3 უბედურებაა მზისქვეშეთში, რომ ყველას ერთი ხვედრი აქვს; ადამის ძეთა გულებიც აღსავსეა სიბოროტით და სიშლეგეა მათ გულებში, ვიდრე ცოცხლობენ; ამის შემდგომ კი მკვდრებში გადავლენ. "},
	{4, "4 რადგან ცოცხლებში შერაცხილს კიდევ აქვს იმედი; რადგან ცოცხალი ძაღლი მკვდარი ლომის უმჯობესია. "},
	{5, "5 რადგან ცოცხალმა იცის, რომ მოკვდება; მკვდრებმა კი არაფერი იციან და აღარც საზღაური მიეზღვებათ, რადგან მათი ხსოვნა დავიწყებას მიეცა. "},
	{6, "6 წარხდა მათი სიძულვილიც, შურიც და ტრფობაც; აღარ ექნებათ, აწ და მარადის წილი იმაში, რაც მზის ქვეშ ხდება. "},
	{7, "7 წადი, მხიარულად ჭამე შენი პური და გულის სიხარულით სვი შენი ღვინო, რაკი ღმერთმა მოგიწონა ნამოქმედარი. "},
	{8, "8 მუდამ სპეტაკი გქონდეს სამოსელი და ზეთი არ მოაკლდეს თავს შენსას. "},
	{9, "9 დატკბი სიცოცხლით ქალთან ერთად, რომელიც გიყვარს შენს წუთისოფელში, და რომელიც მოგცა ღმერთმა მზისქვეშ შენს წუთისოფელში, რადგან ესაა შენი ხვედრი სიცოცხლეში და იმ შრომაში, რასაც შენ მზისქვეშ ეწეოდი. "},
	{10, "10 რისი კეთების ძალაც შესწევს შენს ხელებს, აკეთე; რადგან არც საქმე, არც საფიქრალი, ცოდნა, ან სიბრძნე არ გაგყვება შავეთში, სადაც მიდიხარ. "},
	{11, "11 ისიც შევიტყვე ამ მზისქვეშეთში, რომ მკვირცხლთა ნებაზე არაა რბოლა, არც მამაცთა ნებაზეა ომი, არც ბრძენთა ნებაზეა პური, არც გონიერთა ნებაზეა სიმდიდრე, არც მცოდნეთა ნებაზეა მადლი; რადგან დრო და შემთხვევა განაგებს ყველაფერს. "},
	{12, "12 რადგან ადამიანმა არ უწყის თავისი ჟამი; ავ ბადეში გახვეული თევზებივით და მახეში გაბმული ჩიტებივით იქნებიან შეპყრობილნი ადამის ძენი ავბედით ჟამს, რომელიც მოულოდნელად ეწევა მათ. "},
	{13, "13 ეს სიბრძნეც შევიტყვე მზისქვეშეთში და საგულისხმოდ შევრაცხე იგი: "},
	{14, "14 იყო ქალაქი მცირე და ხალხიც ცოტა; მოადგა ქალაქს დიდი მეფე, ალყა შემოარტყა და შემოაშენა დიდი სიმაგრეები. "},
	{15, "15 აღმოჩნდა იქ კაცი ვინმე უპოვარი, მაგრამ ბრძენი და იხსნა ქალაქი თავისი სიბრძნით, მაგრამ უპოვარი იგი არავის აღარ გახსენებია. "},
	{16, "16 ვთქვი: სიბრძნე ძალზე უპირატესია, მაგრამ უპოვარის სიბრძნეს აბუჩად იგდებენ და მის სიტყვებს ყურს არავინ უგდებს. "},
	{17, "17 ბრძენთა სიტყვები, წყნარად ნათქვამი, უმჯობესია, ვიდრე სულელთა მთავრის ყვირილი. "},
	{18, "18 ბრძოლის საჭურველს სიბრძნე სჯობია, ერთი ცოდვილი კი ბევრ სიკეთეს დაღუპავს."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct ka10 poems[] = {
	{1, "1 შხამიანი ბუზები აფუჭებენ და ალპობენ სურნელოვან ზეთს; მცირედი სიბრიყვე უფრო ძვირფასია ზოგჯერ, ვიდრე სიბრძნე და დიდება. "},
	{2, "2 ბრძენს გული მარჯვნივ აქვს, ბრიყვს - მარცხნივ. "},
	{3, "3 სადაც არ უნდა წავიდეს ბრიყვი, ბრიყვადვე რჩება, ყველას ეუბნება, რომ ბრიყვია. "},
	{4, "4 თუ თავს დაგატყდა უფროსის რისხვა, შენს ადგილს ნუ მიატოვებ, რადგან თვინიერს დიდი ცოდვებიც მიეტევება. "},
	{5, "5 არის სიბოროტე კიდევ, მზისქვეშ რომ ვიხილე: თითქოს მბრძანებლისაგან მომდინარე შეცდომა იყოს. "},
	{6, "6 სიბრიყვე განდიდდა მეტად, ხოლო მდიდრები დაბლა სხედან. "},
	{7, "7 ვნახე მონები, ცხენებზე მსხდარნი, ხოლო მთავარნი მონებივით ფეხით მავალნი. "},
	{8, "8 ორმოს გამთხრელი თავად ჩავარდება შიგ, ხოლო კედლის დამანგრეველს გველი დაშხამავს. "},
	{9, "9 ვინც ქვებს მიათრევს, წელს ქვავე მოსწყვეტს; ხის გამჩეხავს ხევე დაასახიჩრებს. "},
	{10, "10 ცული თუ დაგიჩლუნგდა და არ გალესე, ზედმეტი ძალა დაგადგება; ჭკუით უნდა წარმართო საქმე. "},
	{11, "11 თუ შეულოცველს უკბინა გველმა, შემლოცველი ვეღარ უშველის. "},
	{12, "12 ბრძენის სიტყვები მადლია, ბრიყვს კი მისი ბაგეები ღუპავს. "},
	{13, "13 მისი სიტყვების დასაბამი სიბრიყვეა, ხოლო შედეგი - ავი სიშლეგე. "},
	{14, "14 ბრიყვი მრავალსიტყვაა, მაგრამ არ უწყის კაცმა, რა მოხდება; ვინ აუწყებს, მის შემდგომ რა იქნება? "},
	{15, "15 ბრიყვს დაჰქანცავს თავისი შრომა, რადგან მან არ იცის ქალაქისკენ მიმავალი გზა. "},
	{16, "16 ვაი, შენდა, ქვეყანავ, ბავშვი რომ გიზის მეფედ და შენი დიდებულები დილიდანვე რომ იწყებენ ჭამას! "},
	{17, "17 ბედნიერი ხარ, ქვეყანავ, რომ შენი მეფე არავის ჰმონებს და შენი დიდებულები თავის დროზე რომ ჭამენ, ძალთა მოკრებად, არა სალხინოდ! "},
	{18, "18 სიზარმაცისგან ჭერი ჩამოიქცევა, გულხელდაკრეფისგან წყალი ჩამოვა სახლში. "},
	{19, "19 სამხიარულოდ იმართება პურობა; ღვინო სიხარული ავსებს სიცოცხლეს, ხოლო ფული ყველაფერზე პასუხს აგებს. "},
	{20, "20 შენ ფიქრშიც კი ნუ აგინებ მეფეს, საწოლ ოთახშიაც ნუ აგინებ დიდებულს: რადგან ცის ფრინველი წაუღებს ამბავს და ფრთოსანი აუწყებს სიტყვას. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct ka11 poems[] = {
	{1, "1 წყალს გაატანე შენი პური, რადგან მრავალთა დღეთა შემდგომ კვლავ მოიძიებ. "},
	{2, "2 მიეც ნაწილი ქონებისა შვიდს, რვასაც კი, რადგან არ იცი, რა უბედურება მოელის ქვეყანას. "},
	{3, "3 როცა ღრუბელი აივსება, წვიმაც იწვიმებს ქვეყანაზე; თუ დაეცა ხე სამხრეთში ან ჩრდილოეთში, სადაც დაეცა, იქვე დარჩება. "},
	{4, "4 ვინც ქარს აკვირდება, ვერ დათესავს; ვინც ღრუბლებს შესცქერის, ვერას მოიმკის. "},
	{5, "5 როგორც არ უწყი გზა ქარისა და როგორ ისახება ძვლები სავსე მუცელში, ასევე არ უწყი საქმენი ღვთისა, რომელმაც ყოველივე შექმნა. "},
	{6, "6 დილით თესე შენი თესლი და მწუხრისას ნუ დაისვენებს შენი ხელი; რადგან არ იცი, რომელი უფრო სასიკეთოა; იქნებ ორივე ერთნაირად კარგი გამოდგეს. "},
	{7, "7 ტკბილია სინათლე და საამურია თვალთათვის მზის ჭვრეტა. "},
	{8, "8 თუნდაც მრავალი წელი იცოცხლოს კაცმა და იმხიარულოს, ახსოვდეს, რომ მრავლად იქნება შავი დღეები; ყველაფერი, რაც მოვა, ამაოა. "},
	{9, "9 იხარე, ყრმაო, ვიდრე ნორჩი ხარ; გაამოს შენმა გულმა სიყმაწვილეში, მიჰყევ შენს გულს და თვალთა მზერას; ოღონდ იცოდე, ყველაფრის ამის გამო სამსჯავროზე წარგადგენს ღმერთი. "},
	{10, "10 უკუიყარე გულიდან დარდი და სხეულს არიდე უამური რამ, რადგან ბავშვობაც და სიყმაწვილეც ამაოა და წარმავალი."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct ka12 poems[] = {
	{1, "1 გახსოვდეს შენი გამჩენი შენს სიჭაბუკეში, ვიდრე დაგიდგებოდეს მწარე დღეები და გეწეოდეს წლები, რომლებზეც იტყვი, რაღაში მადგიან მე ისინიო? "},
	{2, "2 ვიდრე დაბნელდებოდეს მზე, ნათელი და მთვარე და ვარსკვლავები, ვიდრე ღრუბლები კიდევ ჩანან წვიმის შემდეგ, "},
	{3, "3 იმ დღემდე, ვიდრე დაფრთხებოდნენ სასახლის მცველნი და მეომარნი დაუძლურდებოდნენ, ვიდრე შეწყვეტდნენ სამუშაოს მეწისქვილე ქალები (რადგან მცირედნიღა დარჩებიან), ვიდრე ნათელი დააკლდებოდეთ სარკმლიდან მჭვრეტელთ, "},
	{4, "4 ვიდრე დაიგმანებოდეს ქუჩის კარები, მიჩუმდებოდეს დოლაბის ხმაური, მიწყდებოდეს ფრინველთა ჟრიამული, დადუმდებოდეს ყოველი გალობა, "},
	{5, "5 შეეშინდებოდეთ სიმაღლისაც და გზებზე შიში დაივანებდეს, აყვავდებოდეს ნუში, დამძიმდებოდეს კალია და დაცხრებოდეს ვნება, - როცა მიდის კაცი თავის საუკუნო სახლისაკენ და უკან მიჰყვებიან მოტირალნი, - "},
	{6, "6 ვიდრე გაწყდებოდეს ვერცხლის საბელი და გატყდებოდეს ოქროს ჭურჭელი, დაიმსხვრეოდეს დოქი წყაროსთან, ჩაეშვებოდეს ოწინარის ბორბალი ჭაში, "},
	{7, "7 მიიქცეოდეს მტვერი მიწად, როგორც იყო და სული დაუბრუნდებოდეს ღმერთს, რომელმაც შთაბერა. "},
	{8, "8 ამაოება ამაოებათა, თქვა ეკლესიასტემ, ყოველივე ამაო. "},
	{9, "9 თავად ხომ ბრძენი იყო ეკლესიასტე, ხალხსაც შეასწავლა სიბრძნე. იკვლევდა, იძიებდა და თხზავდა იგავებს მრავალს. "},
	{10, "10 ეძებდა ეკლესიასტე საჭირო სიტყვებს და წრფელად დაიწერა ჭეშმარიტი სიტყვები. "},
	{11, "11 ბრძენთა სიტყვები წვერგამახული სოლებია, ჩაჭედილი ლურსმნებია. იგავთა კრებული ერთი მწყემსისგან შთაგონებული. "},
	{12, "12 კიდევ გეტყვი, შვილო, ყურად იღე: ბევრი წიგნების წერას ბოლო არ ექნება და ზედმეტი ფიქრი სხეულს ადუნებს. "},
	{13, "13 მოვისმინოთ ყველაფრის თავი და ბოლო: ღვთისა გეშინოდეს და დაიცავი მცნებანი მისნი, რადგან ეს არის კაცის თავი და თავი."},
	{14, "14 რადგან ყველა საქმეს სამსჯავროზე მიიტანს ღმერთი, ყოველივე დაფარულს, კეთილს თუ ბოროტს."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};