#include <map>
#include <string>
class Bible17
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
	struct ka6	{ int val; const char *msg; };
	struct ka7	{ int val; const char *msg; };
	struct ka8	{ int val; const char *msg; };
	struct ka9	{ int val; const char *msg; };
	struct ka10	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 ეს მოხდა ახაშვეროშის დროს, იმ ახაშვეროშისა, რომელიც მეფობდა ას ოცდაშვიდ მხარეზე ინდოეთიდან მოყოლებული ვიდრე ქუშამდე. "},
	{2, "2 იმ დროს, როცა იჯდა მეფე ახაშვეროში სამეფო ტახტზე შუბანში, სატახტოში, "},
	{3, "3 თავისი მეფობის მესამე წელს გაუმართა ლხინი თავის მთავრებს, თავის მორჩილთ, სპარსელთა და მიდიელთა სარდლებს, ხელისუფალთ და მხარეთა განმგებელთ, "},
	{4, "4 და აჩენდა თავისი სამეფოს დიდებულ სიმდიდრეს და თავისი სიდიადის ბრწყინვალებას მრავალ დღეს, ას ოთხმოც დღეს. "},
	{5, "5 როცა ჩათავდა ეს დღეები, გაუმართა მეფემ მთელს ხალხს, ვინც კი შუშანში, სატახტოში იყო, დიდსა და პატარას, შვიდდღიანი ლხინი სასახლის ბაღში. "},
	{6, "6 მრავალფერი ქსოვილები ეკიდა ბისონისა და ძოწის ძაფებით ვერცხლის რგოლებზე და მარმარილოს სვეტებზე. ოქროსა და ვერცხლის საწოლები იდგა ალებასტრით, მარმარილოთი, სადაფითა და შავი მარმარილოთი მოფენილ იატაკზე. "},
	{7, "7 სასმელს ოქროს სასმისებით სვამდნენ, მრავალფრი სასმისებით. უხვად იყო სამეფო ღვინო, მეფეთა საკადრისი. "},
	{8, "8 წესისამებრ სვამდნენ, არავინ იყო დამძალებელი, რადგან ასე დაუდგინა მეფემ სახლთუხუცესებს, თითოეულის ნება-სურვილისამებრ მოქცეულიყვნენ. "},
	{9, "9 ვაშთი დედოფალმაც გადაიხადა ლხინი ბანოვანთათვის მეფე ახაშვეროშის ერთ-ერთ სასახლეში. "},
	{10, "10 მეშვიდე დღეს, როცა ღვინომ გაამხიარულა მეფის გული, უბრძანა მეჰუმანს, ბიზეთას, ჰარბონას, ბიგთას, აბაგთას, ზეთარს და ქარქასს - შვიდ საჭურისს, მეფე ახაშვეროშის წინაშე მომსახურეთ, "},
	{11, "11 მოეყვანათ ვაშთი დედოფალი მეფის წინაშე სამეფო გვირგვინით, რომ ეჩვენებინა ხალხებისთვის და მთავრებისთვის მისი სილამაზე, რადგან მშვენიერი იყო სახით. "},
	{12, "12 არ ისურვა ვაშთი დედოფალმა მისვლა მეფის ბრძანებაზე, საჭურისების პირით რომ ეცნობა. დიდად გაწყრა მეფე და რისხვით აენთო. "},
	{13, "13 უთხრა მეფემ ბრძენკაცებს, დროჟამის მცოდნეთ (რადგან ასე წყდებოდა სამეფო საქმე რჯულისა და სამართლის მცოდნეთა წინაშე. "},
	{14, "14 მისი დაახლოებული პირები კი იყვნენ: ქარშენა, შეთარი, ადმათა, თარშიში, მერესი, მარსენა და მემუქანი - შვიდი სპარსელი და მიდიელი მთავარი, მეფის პირისმხილველნი და პირველ ადგილზე მჯდომელნი სამეფოში): "},
	{15, "15 რისი ღირსია ვაშთი დედოფალი, რჯულის მიხედვით, რომ არ შეასრულა მეფე ახაშვეროშის ბრძანება, საჭურისების პირით რომ ეცნობა? "},
	{16, "16 თქვა მემუქანმა მეფისა და მთავრების წინაშე: არა მხოლოდ მეფე გააწბილა ვაშთი დედოფალმა, არამედ ყველა მთავარი და ყველა ხალხი, ვინც კი მეფე ახაშვეროშის მთელს სახელმწიფოში ცხოვრობს. "},
	{17, "17 რადგან მიუვათ დედოფლის ამბავი ქალებს და ისინიც დაამცირებენ თავიანთ ქმრებს, იტყვიან: ვაშთი დედოფლის მიყვანა ბრძანა მეფე ახაშვეროშმა თავის წინაშე, მაგრამ არ მივიდაო იგი. "},
	{18, "18 ამიერიდან სპარსელ და მიდიელ მთავართა ცოლები, რომლებიც შეიტყობენ დედოფლის ამბავს, შეეპასუხებიან მეფის მთავრებს. ბევრი დამცირება და წყენა შეგხვდება. "},
	{19, "19 თუ მეფე ინებებს, გაიცეს მისგან სამეფო ბრძანება, ჩაიწეროს სპარსელთა და მიდიელთა რჯულში უცვალებელად, რომ აღარ შევიდეს ვაშთი მეფე ახაშვეროშის წინაშე. ხოლო მისი დედოფლობა მეფემ სხვას მისცეს, მასზე უკეთესს. "},
	{20, "20 მოივლის მეფის ბრძანება მთელს მის სამეფოს, თუმცა ვრცელია იგი, და ყველა ცოლი, აზნაური თუ მდაბიო, პატივისცემით მოეპყრობა თავის ქმარს. "},
	{21, "21 მოეწონათ ეს სიტყვა მეფესა და მთავრებს. მემუქანის სიტყვისამებრ მოიქცა მეფე. "},
	{22, "22 დაუგზავნა წერილები სამეფოს სამთავროებს - თითოეულ სამთავროს თავისი დამწერლობით და თითოეულ ხალხს თავის ენაზე, რომ ყოველი კაცი ბატონი ყოფილიყო თავის სახლში და თავისი ხალხის ენაზე ელაპარაკა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 ამ ამბების შემდეგ, როცა დაუცხრა მეფე ახაშვეროშს რისხვა, გაიხსენა მან ვაშთი, მისი საქციელი და მასზე გამოტანილი განაჩენი. "},
	{2, "2 თქვეს მეფის მხლებლებმა, მისმა მსახურებმა: მოუძებნონ მეფეს ლამაზი ყმაწვილი ქალები. "},
	{3, "3 დააყენოს მეფემ ზედამხედველნი თავისი სამეფოს ყველა სამთავროში, რომ თავი მოუყარონ ყველა ლამაზ ყმაწვილ ქალს შუშანში, სატახტოში, და ჩააბარონ სადიაცო სახლში მეფის საჭურისს, დიაცთა მცველს ჰეგეს, რომელიც დაურიგებს მათ ფერუმარილს. "},
	{4, "4 ქალწულმა, რომელიც თვალში მოუვა მეფეს, იდედოფლოს ვაშთის ნაცვლად. მოეწონა ნათქვამი მეფეს და ასეც მოიქცა. "},
	{5, "5 იყო ერთი იუდაელი კაცი შუშანში, სატახტოში, სახელად მარდოქაი, ძე იაირისა, ძისა შიმყისა, ძისა კიშისა, ბენიამინელი, "},
	{6, "6 რომელიც გადასახლებული იყო იერუსალიმიდან იექონიასთან, იუდას მეფესთან, ერთად გადასახლებულთა შორის, რომელნიც ნაბუქოდონოსორმა, ბაბილონის მეფემ გადაასახლა. "},
	{7, "7 პატრონობდა იგი ჰადასას ანუ ესთერს, თავის ბიძაშვილს, რადგან არც მამა ჰყადა მას, არც დედა. ტანადი და პირმშვენიერი იყო ყმაწვილი ქალი. როცა დედ-მამა დაეხოცა, იშვილა იგი მარდოქაიმ. "},
	{8, "8 როცა გამოაცხადეს მეფის ბრძანება და დადგენილება და თავი მოუყარეს უამრავ ყმაწვილ ქალს შუშანში, სატახტოში, და ჩააბარეს ჰეგეს, მაშინ მიიყვანეს ესთერიც მეფის სახლში და ჩააბარეს ჰეგეს, დიაცთა მცველს. "},
	{9, "9 მოეწონა მას ყმაწვილი ქალი, რომელმაც მადლი პოვა მის თვალში. სასწრაფოდ მიაცემინა მისთვის ფერუმარილი და კუთვნილი წილი, მიაჩენინა შვიდი რჩეული მხევალი მეფის სახლიდან და მხევლებთან ერთად სადიაცო სახლის უკეთეს სადგომში გადაიყვანა. "},
	{10, "10 არ გაუმჟღავნებია ესთერს თავისი ერი და სამშობლო, რადგან დაარიგა მარდოქაიმ, არ გაემჟღავნებინა. "},
	{11, "11 ყოველდღე ჩაივლიდა ხოლმე მარდოქაი სადიაცო სახლის ეზოს წინ, ესთერის ჯანმრთელობისა და ამბის გასაგებად. "},
	{12, "12 როცა მოუწევდა ყმაწვილ ქალს რიგი მეფე ახაშვეროშთან შესასვლელად თორმეტი თვის ბოლოს, როგორც დაწესებული იყო ქალებისთვის (რადგან ამდენი ხანი სჭირდებოდა მათ დაზელვას: ექვსი თვე მირონის ზეთით და ექვსი თვე ბალსამონით და სხვა სადიაცო ნელსაცხებლებით), "},
	{13, "13 მაშინ შევიდოდა ყმაწვილი ქალი მეფესთან. რაც არ უნდა მოეთხოვა, თან გაატანდნენ ხოლმე სადიაცო სახლიდან მეფის სახლში მიმავალს. "},
	{14, "14 საღამო ხანს შედიოდა და დილით ბრუნდებოდა სხვა სადიაცო სახლში, შააბგაზის, მეფის საჭურისის და ხარჭათა მცველის ხელქვეით. მეტჯერ აღარ შედიოდა მეფესთან, თუ არ ინებებდა მეფე მის დაძახებას, თუ სახელდებით არ დაუძახებდა. "},
	{15, "15 როცა მოუწია ესთერს, მარდოქაის ბიძის, აბიხაილის ასულს, რომელიც ნაშვილები ჰყავდა მას, მეფესთან შესვლის რიგმა, არაფერი მოუთხოვია, გარდა იმისა, რაც დაწესებული ჰქონდა ჰეგესგან, მეფის საჭურისისა და დიაცთა მცველისგან. ყველა მისი მნახველის თვალში მადლი ჰქონდა ნაპოვნი ესთერს. "},
	{16, "16 მიჰგვარეს ესთერი მეფე ახაშვეროშს მის სამეფო სახლში მეათე თვეს, ანუ ტებეთის თვეში, მისი მეფობის მეშვიდე წელს. "},
	{17, "17 შეუყვარდა მეფეს ესთერი ყველა ქალზე უფრო, ყველა ქალწულზე მეტი მადლი და წყალობა ჰპოვა ესთერმა მის წინაშე. და დაადგა თავზე სამეფო გვირგვინი მეფემ და ვაშთის ნაცვლად გაადედოფლა. "},
	{18, "18 გაუმართა მეფემ დიდი ლხინი თავის მთავრებსა და მორჩილთ, ლხინი ესთერის სახელზე და შეუმსუბუქა ტვირთი სამთავროებს და მეფურად გასცა საჩუქრები. "},
	{19, "19 როცა მეორეჯერ მოუყარეს თავი ქალწულებს, სამეფო კარიბჭესთან იჯდა მარდოქაი. "},
	{20, "20 არ გაუმჟღავნებია ესთერს თავისი სამშობლო და ერი, როგორც დარიგებული იყო მარდოქაისგან. ახლაც ისევე ასრულებდა ესთერი მარდოქაის სიტყვას, როგორც მაშინ, როცა მის მეურვეობაში იყო. "},
	{21, "21 იმ ხანებში, როცა სამეფო კარიბჭესთან იჯდა მარდოქაი, გაცოფდნენ ბიგთანი და თერეში, მეფის ორი საჭურისი, ზღურბლის მცველები და მეფე ახაშვეროშზე ხელის აღმართვა განიზრახეს. "},
	{22, "22 შეიტყო ეს ამბავი მარდოქაიმ და აცნობა დედოფალ ესთერს, ხოლო ესთერმა მარდოქაის სახელით მოახსენა მეფეს. "},
	{23, "23 გამოძიებული იქნა საქმე, დადასტურდა და ორივენი ხეზე ჩამოკიდეს. ეს ყველაფერი ჩაიწერა მატიანის წიგნში მეფის თვალწინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 ამ ამბების შემდეგ განადიდა მეფე ახაშვეროშმა ჰამან ჰამდათას ძე, აგაგიელი, აღაზევა და დაუდგა სავარძელი ყველა მთავარზე მაღლა, ვინც კი ჰყავდა. "},
	{2, "2 მეფის ყველა მორჩილი, ვინც კი იყო სამეფო კარიბჭესთან, მუხლს იყრიდა და თაყვანს სცემდა ჰამანს, რადგან ასე ჰქონდა მასზე ნაბრძანები მეფეს. მაგრამ მარდოქაის არ მოუყრია მუხლი და არ უცია თაყვანი. "},
	{3, "3 ეუბნებოდნენ მეფის მორჩილნი, სამეფო კარიბჭესთან ვინც იყვნენ, მარდოქაის: რატომ არ ემორჩილები მეფის ბრძანებას? "},
	{4, "4 ყოველდღე რომ ეუბნებოდნენ და ყურს არ უგდებდა მათ, შეატყობინეს ჰამანს, რათა ენახათ იდგებოდა თუ რა თავის სიტყვაზე მარდოქაი, რადგან ნათქვამი ჰქონდა მათთვის, რომ იუდაელი იყო. "},
	{5, "5 დაინახა ჰამანმა, რომ მუხლს არ იყრიდა და თაყვანს არ სცემდა მას მარდოქაი, და რისხვით აღივსო ჰამანი. "},
	{6, "6 იუკადრისა, მხოლოდ მარდოქაიზე აღემართა ხელი. რაკი მოახსენეს მარდოქაის გვარტომობა, გადაწყვიტა ჰამანმა, მოესრა მთელი იუდაელობა, მარდოქაის ერი, ყველა, ვინც კი ახაშვეროშის სამეფოში იყო. "},
	{7, "7 პირველ თვეს, ანუ ნისანის თვეში, მეფე ახაშვეროშის მეთორმეტე წელს, დაიწყეს ფურის, ანუ წილის ყრა ჰამანის თვალწინ და ყრიდნენ წილს დღიდან დღემდე და თვიდან თვემდე, თორმეტ თვეს, ანუ ადარის თვემდე. "},
	{8, "8 უთხრა ჰამანმა მეფე ახაშვეროშს: არის ერთი ხალხი, განთესილი და გაფანტული სხვა ხალხებს შორის შენი სამეფოს ყველა სამთავროში. მათი რჯული განსხვავდება ყველა ხალხის რჯულისგან და არ ასრულებენ მეფის კანონებს. არა ხამს მეფისთვის მათი დატოვება. "},
	{9, "9 თუ მეფე ინებებს, გადაწყდეს მათი განადგურება. ათი ათას ქანქარ ვერცხლს მივუწონი ხელში მოხელეებს, რომ სამეფო ხაზინაში შეიტანონ. "},
	{10, "10 წაიძრო მეფემ ხელიდან ბეჭედი და მისცა ჰამან ჰამდათას ძეს, აგაგიელს, იუდაელთა მტერს. "},
	{11, "11 უთხრა მეფემ ჰამანს: ვერცხლიც გეძლევა და ხალხიც, მოექეცი, როგორც გენებოს. "},
	{12, "12 შეიყარნენ მეფის მწერლები პირველი თვის მეცამეტე დღეს და ყველაფერი ისე დაიწერა, როგორც ჰამანმა უბრძანა მეფის სატრაპებს, თითოეული სამთავროს განმგებელს, ყოველი ხალხის მთავარს, თითოეულ სამთავროს თავისი დამწერლობით და თითოეულ ხალხს თავის ენაზე. მეფე ახაშვეროშის სახელით დაიწერა და სამეფო ბეჭდით დაიბეჭდა. "},
	{13, "13 დაეგზავნა წერილები შიკრიკების ხელით მეფის ყველა სამთავროს, რომ გაეწყვიტათ, დაეხოცათ, მოესპოთ ყველა იუდაელი, ყმაწვილიდან მოხუცამდე, დედაწულიანად, ერთ დღეს, მეთორმეტე თვის, ანუ ადარის, მეცამეტე დღეს, და დაეტაცებინათ მათი ქონება. "},
	{14, "14 ბრძანების პირი, როგორც კანონი, უნდა წაეღოთ ყველა სამთავროში და გამოეცხადებინათ მთელი ხალხისთვის, რათა მზად ყოფილიყვნენ ამ დღისთვის. "},
	{15, "15 სასწრაფოდ წაიღეს შიკრიკებმა მეფის ბრძანება. გამოცხადდა თუ არა კანონი შუშანში, სატახტო ქალაქში, დასხდნენ პურობად მეფე და ჰამანი. შუშან-ქალაქი კი ტიროდა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 შეიტყო მარდოქაიმ ყველაფერი, რაც მოხდა. შემოიხია მარდოქაიმ სამოსელი, ჩაიცვა ჯვალო და თავზე ნაცარი დაიყარა. გავიდა შუაგულ ქალაქში და ხმამაღლა და მწარედ მოთქვამდა. "},
	{2, "2 მივიდა სამეფო კარიბჭემდე, რადგან ჯვალოთი შემოსილს სამეფო კარიბჭეში შესვლა არ შეეძლო. "},
	{3, "3 ყველა სამთავროში, ყველგან, სადაც კი მეფის ბრძანება და კანონი მივიდა, დიდი გლოვა ჰქონდათ იუდაელებს, მარხვა, ტირილი და გოდება. ჯვალო და ნაცარი ეგო ბევრს. "},
	{4, "4 მივიდნენ ესთერთან მისი მოახლეები და საჭურისები და ყველაფერი უამბეს. დიდად შეშფოთდა დედოფალი. გაუგზავნა სამოსელი, რომ შემოსილიყო მარდოქაი და გაეძრო ჯვალო, მაგრამ არ მიიღო. "},
	{5, "5 იხმო ესთერმა ჰათაქი, მეფის საჭურისთაგანი, რომელიც მისთვის ჰყავდა მიჩენილი მეფეს, და უბრძანა წასულიყო მარდოქაისთან, რომ გაეგო მისი ამბავი. "},
	{6, "6 გავიდა ჰათაქი მარდოქაისთან ქალაქის მოედანზე, სამეფო კარიბჭის წინ რომ არის. "},
	{7, "7 მოახსენა მარდოქაიმ ყველაფერი, რაც შეემთხვა, და იმ ვერცხლის ამბავიც, რომელიც უნდა შეეტანა ჰამანს სამეფო ხაზინაში იუდაელთა გასაწყვეტად. "},
	{8, "8 დაწერილი კანონის პირიც, შუშანში რომ გამოვიდა მათ გასაწყვეტად, მისცა ჰათაქს, რომ ეჩვენებინა ესთერისთვის და ეცნობებინა. დაავალა ესთერს, წასულიყო მეფესთან, რათა შევედრებოდა მას და პატიება გამოეთხოვა თავისი ხალხისთვის. "},
	{9, "9 მოვიდა ჰათაქი და მოახსენა ესთერს მარდოქაის ნათქვამი. "},
	{10, "10 უთხრა ესთერმა ჰათაქს და დააბარა მარდოქაისთან: "},
	{11, "11 მეფის ყველა მორჩილმა და მეფის სამთავროების ხალხმა იცის, რომ ყოველ კაცს თუ ქალს, ვინც კი დაუძახებლად შევა მეფესთან შიდა ეზოში, ერთი სასჯელი ელის - სიკვდილი. მხოლოდ ის გადარჩება, ვისკენაც თავის ოქროს კვერთხს გაიშვერს მეფე. მე კი ოცდაათი დღეა, რაც მეფეს არ დავუძახივარ. "},
	{12, "12 მიუტანეს მარდოქაის ესთერის სიტყვები. "},
	{13, "13 უთხრა პასუხად მარდოქაიმ ესთერს: ნუ ფიქრობ გულში, რომ შენ ერთი გადარჩები მეფის სახლში იუდაელთაგან. "},
	{14, "14 რადგან თუ ახლა დაიდუმებ, სხვა მხრიდან მოვა იუდაელთა შვება და ხსნა, შენი მამისსახლი კი დაიღუპება. ვინ იცის, იქნებ ამ ჟამისთვის ეწიე დედოფლობას? "},
	{15, "15 უთხრა პასუხად ესთერმა მარდოქაის: "},
	{16, "16 წადი, თავი მოუყარე შუშანის მთელს იუდაელობას, იმარხულეთ ჩემთვის, არ ჭამოთ და არ სვათ სამ დღეს, არც დღისით, არც ღამით. მეც ვიმარხულებ ჩემს მხევლებთან ერთად, მერე წავალ მეფესთან, თუმცა წესი არ არის. თუ დავიღუპები, დავიღუპო. "},
	{17, "17 წავიდა მარდოქაი და ყველაფერი ისე გააკეთა, როგორც ესთერმა დაარიგა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 მესამე დღეს დედოფლურად შეიმოსა ესთერი და მეფის სახლის შიდა ეზოში გაჩერდა, მეფის სახლის წინ. მეფე კი თავის სამეფო ტახტზე იჯდა სამეფო სახლში, შესასვლელის პირდაპირ. "},
	{2, "2 როგორც კი დაინახა მეფემ ეზოში მდგარი დედოფალი ესთერი, მადლი ჰპოვა ესთერმა მის თვალში და გაიშვირა მეფემ მისკენ ოქროს კვერთხი, ხელში რომ ეჭირა. მიუახლოვდა ესთერი და შეეხო კვერთხის წვერს. "},
	{3, "3 უთხრა მეფემ: რა იყო, დედოფალო ესთერ? რა სათხოვარი გაქვს? ნახევარი სამეფოც რომ იყოს, მოგეცემა. "},
	{4, "4 თქვა ესთერმა: თუ მეფე ინებებს, მობრძანდნენ მეფე და ჰამანი დღეს ნადიმზე, რომელიც მოვუმზადე მას. "},
	{5, "5 თქვა მეფემ: სასწრაფოდ დაუძახეთ ჰამანს, რომ შესრულდის ესთერის სიტყვა. მივიდნენ მეფე და ჰამანი ნადიმზე, რომელიც გამზადებული ჰქონდა ესთერს. "},
	{6, "6 უთხრა მეფემ ესთერს ღვინის სმის დროს: რა სათხოვარი გინდა რაამ აგისრულდეს? რას მეხვეწები? ნახევარი სამეფოც რომ იყოს, აგისრულდება. "},
	{7, "7 მიუგო ესთერმა და უთხრა: აი, ჩემი სათხოვარი და სახვეწარი: "},
	{8, "8 თუ მადლი მიპოვნია მეფის თვალში, და თუ მეფე ინებებს ჩემი სათხოვრის მოცემას და სახვეწარის ასრულებას, მოვიდნენ მეფე და ჰამანი ხვალ ნადიმზე, რომელსაც გავმართავ მათთვის. ხვალ მოვიქცევი მეფის სიტყვისამებრ. "},
	{9, "9 გავიდა იმ დღეს ჰამანი მხიარული და კმაყოფილი, მაგრამ როგორც კი დაინახა ჰამანმა სამეფო კარიბჭესთან მჯდარი მარდოქაი, რომელიც არ ამდგარა და არც განძრეულა მის წინ, რისხვით აივსო ჰამანი მარდოქაის მიმართ. "},
	{10, "10 მაგრამ თავი შეიკავა ჰამანმა. მივიდა სახლში და დაიბარა მეგობრები და ზერეში, თავისი ცოლი. "},
	{11, "11 მოუყვა მათ ჰამანი თავისი დიდების, დოვლათისა და უამრავი შვილის ამბავს, როგორ განადიდა იგი მეფემ და როგორ აღაზევა სხვა მთავრებზე, მეფის მორჩილებზე. "},
	{12, "12 თქვა ჰამანმა: არავინ მოუწვევია ესთერ დედოფალს მეფესთან ერთად გამზადებულ ნადიმზე ჩემს მეტი. ხვალაც მიწვეული ვარ მეფესთან ერთად. "},
	{13, "13 ეს ყველაფერი არად მიჩანს, ვიდრე იუდაელ მარდოქაის ვხედავ სამეფო კარიბჭესთან მჯდარს. "},
	{14, "14 უთხრეს მას ზერეშმა, მისმა ცოლმა და მეგობრებმა: დაამზადებინე ორმოცდაათწყრთიანი ძელი და დილით უთხარი მეფეს, მასზე ჩამოჰკიდონ მარდოქაი. მერე გულმხიარულად წადი მეფესთან ერთად ნადიმზე. მოეწონა ეს სიტყვა ჰამანს და დაამზადებინა ძელი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ka6 poems[] = {
	{1, "1 იმ ღამით ძილი გაუკრთა მეფეს. მოატანინა სამახსოვრო წიგნი - მატიანე და უკითხავდნენ მეფეს. "},
	{2, "2 აღმოჩნდა ჩაწერილი, როგორ ამხილა მარდოქაიმ ბიგთანა და თერეში, მეფის ორი საჭურისი, ზღურბლის მცველნი, რომელთაც მეფე ახაშვეროშზე ხელის აღმართვა ჰქონდათ განზრახული. "},
	{3, "3 თქვა მეფემ: რა პატივი და დიდება ხვდა ამისთვის მარდოქაის? მიუგეს მეფეს მისმა მორჩილებმა: არაფერი ხვდომია. "},
	{4, "4 თქვა მეფემ: ვინ არის ეზოში? ჰამანი იყო მოსული მეფის სახლის გარეთა ეზოში იმის სათქმელად, რომ ჩამოეკიდათ მარდოქაი მისთვის გამზადებულ ძელზე. "},
	{5, "5 უთხრეს მეფეს მისმა მორჩილებმა: აჰა, ჰამანი დგას ეზოში. თქვა მეფემ: შემოვიდეს. "},
	{6, "6 შევიდა ჰამანი. უთხრა მას მეფემ: რა უნდა გავუკეთოთ კაცს, ვისი პატივიც სურს მეფეს? თქვა გულში ჰამანმა: ვისი პატივი უნდა სურდეს მეფეს, თუ არა ჩემი? "},
	{7, "7 უთხრა ჰამანმა მეფეს: იმ კაცს, ვისი პატივიც სურს მეფეს, "},
	{8, "8 მიართვან სამეფო შესამოსელი, რაც ემოსა მეფეს და ცხენი, რომელზეც იჯდა მეფე, როცა სამეფო გვირგვინი დაადგეს თავზე. "},
	{9, "9 მიართვან შესამოსელი და ცხენი მეფის უპირველესი კარისკაცის ხელით, შემოსონ ის კაცი, ვისი პატივიც სურს მეფეს, მიიყვანონ ცხენით ქალაქის მოედანზე და გამოაცხადონ მის წინაშე: ასე ექცევიან იმ კაცს, ვისი პატივიც სურს მეფეს! "},
	{10, "10 უთხრა ჰამანს მეფემ: სასწრაფოდ აიღე შესამოსელი და ცხენი, როგორც თქვი, და მოექეცი ასე მარდოქაის, იუდაელს, სამეფო კარიბჭესთან რომ ზის. არაფერი დააკლო შენს სათქმელს. "},
	{11, "11 აიღო ჰამანმა შესამოსელი და ცხენი, შემოსა მარდოქაი, გაიყვანა ცხენით ქალაქის მოედანზე და გამოაცხადა მის წინაშე: ასე ექცევიან იმ კაცს, ვისი პატივიც სურს მეფეს! "},
	{12, "12 დაბრუნდა მარდოქაი სამეფო კარიბჭესთან. ჰამანი კი გაეშურა შინისკენ, დამწუხრებული და თავჩაქინდრელი. "},
	{13, "13 უამბო ჰამანმა ზერეშს, თავის ცოლს, და მეგობრებს ყველაფერი, რაც შეემთხვა. უთხრეს მისმა ბრძენკაცებმა და ზერეშმა, მისმა ცოლმა: თუ იუდაელთა მოდგმის არის მარდოქაი, რომლის გამოც ემხობი, ვერ დასძლევ მას, არამედ ნამდვილად დაემხობი მის წინაშე. "},
	{14, "14 ამას ეუბნებოდნენ, რომ მოვიდნენ მეფის საჭურისები და დააჩქარეს ჰამანი, წასულიყო ესთერის გამართულ ნადიმზე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct ka7 poems[] = {
	{1, "1 ეწვივნენ მეფე და ჰამანი სანადიმოდ ესთერ დედოფალს. "},
	{2, "2 უთხრა მეფემ ესთერს მეორე დღესაც, ღვინის სმის დროს: რა გაქვს სათხოვარი, ესთერ დედოფალო? მოგეცმა. რა გაქვს სახვეწარი? ნახევარი სამეფოც რომ იყოს, აგისრულდება. "},
	{3, "3 თქვა პასუხად ესთერ დედოფალმა: თუ მადლი მიპოვნია შენს თვალში, მეფევ, და თუ ინებებს მეფე, მომეცეს ჩემი სიცოცხლე ჩემს სათხოვარში და ჩემი ერი ჩემს სახვეწარში. "},
	{4, "4 რადგან გაყიდული ვართ მე და ჩემი ერი დასაღუპად, ამოსაწყვეტად და მოსასპობად. მონებად და მხევლებად რომ გავყიდულიყავით, დავიდუმებდი, მაგრამ მტერი ვერ აანაზღაურებს მეფის ზარალს. "},
	{5, "5 თქვა მეფე ახაშვეროშმა და ჰკითხა ესთერ დედოფალს: ვინ არის იგი და სად არის, ვინც გაბედა ეს საქმე? "},
	{6, "6 თქვა ესთერმა: ორგული კაცია ეს ბოროტი ჰამანი. შედრკა ჰამანი მეფისა და დედოფლის წინაშე. "},
	{7, "7 ადგა მეფე ნადიმიდან განრისხებული და გავიდა სასახლის ბაღში. ხოლო ჰამანი დარჩა, რათა პატიება გამოეთხოვა ესთერ დედოფლისგან, რადგან ხედავდა, რომ ავი ხვედრი ელოდა მეფისგან. "},
	{8, "8 როცა სასახლის ბაღიდან სანადიმო დარბაზში დაბრუნდა მეფე, დამხობილი დახვდა ჰამანი საწოლზე, რომელზეც ესთერი იყო. თქვა მეფემ: დედოფალზეც რომ ძალადობს ჩემთან სახლში! სიტყვა დასცდა მეფის ბაგეს და დაუფარეს სახე ჰამანს. "},
	{9, "9 თქვა ხარბონამ, საჭურისთაგანმა, მეფის კარისკაცმა: აჰა, ჰამანის სახლში დგას ის ძელიც, ჰამანმა რომ მოუმზადა მარდოქაის, მეფეზე კარგის მოლაპარაკეს, ორმოცდაათი წყრთაა სიმაღლით. თქვა მეფემ: მასზე ჩამოაღრჩვეთ. "},
	{10, "10 ჩამოაღრჩვეს ჰამანი იმ ძელზე, მარდოქაისთვის რომ ჰქონდა გამზადებული, და დაცხრა მეფის რისხვა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct ka8 poems[] = {
	{1, "1 იმ დღეს მისცა მეფე ახაშვეროშმა ესთერ დედოფალს ჰამანის სახლი, იუდაელთა მტრისა. მარდოქაი კი ეახლა მეფეს, რადგან გაუცხადა ესთერმა, თუ რა იყო იგი მისი. "},
	{2, "2 წაიძრო მეფემ ბეჭედი, ჰამანისთვის წართმეული, და მისცა მარდოქაის. ხოლო ესთერმა ჰამანის სახლის ზედამხედველად დაადგინა მარდოქაი. "},
	{3, "3 კვლავ ელაპარაკა მეფეს ესთერი, დაემხო მის ფეხქვეშ და ატირდა. ემუდარებოდა გაეუქმებინა ჰამან აგაგიელის სიავე და განზრახვა, რომელიც იუდაელთა წინააღმდეგ ჰქონდა განზრახული. "},
	{4, "4 გაიშვირა მეფემ კვერთხი ესთერისკენ და წამოდგა ესთერი და დადგა მეფის წინაშე. "},
	{5, "5 თქვა: თუ მეფე ინებებს, თუ მადლი მიპოვნია მის წინაშე, თუ მოსაწონია ეს საქმე მეფისათვის და მეც კეთილად ვჩანვარ მის თვალში, უკანვე იქნას გამოთხოვილი წერილები, ჰამან ჰამადათას ძის, აგაგიელის, განზრახვა, რომელიც დაწერა მან მეფის ყველა სამთავროში მცხოვრები იუდაელების მოსასპობად. "},
	{6, "6 რადგან, როგორ ვუყურო უბედურებას, რაც ჩემს ერს უნდა შეემთხვას, როგორ ვუყურო ჩემი მშობლიური ხალხის განადგურებას? "},
	{7, "7 უთხრა ბეფე ახაშვეროშმა ესთერ დედოფალს და მარდოქაის, იუდაელს: აჰა, ხომ მივეცი ესთერს ჰამანის სახლი, თავად კი ძელზე ჩამოვკიდე, რადგან იუდაელებზე აპირებდა ხელის აღმართვას. "},
	{8, "8 ახლა დაწერეთ, რაც გინდათ. დაწერეთ იუდაელთა გამო მეფის სახელით და სამეფო ბეჭდით დაბეჭდეთ, რადგან არ შეიცვლება მეფის სახელით დაწერილი და სამეფო ბეჭდით დაბეჭდილი წერილი. "},
	{9, "9 მაშინ დაუძახეს მეფის მწერლებს სივანის თვის ოცდამესამე დღეს და ყველაფერი ისე დაიწერა, როგორც უბრძანა მარდოქაიმ იუდაელებს, მეფისნაცვლებს, მხარეთა განმგებლებსა და მთავრებს - ინდოეთიდან ქუშამდე, ასოცდაშვიდ სამთავროს, ყოველ სამთავროს თავისი დამწერლობით და ყოველ ხალხს თავის ენაზე, იუდაელებსაც თავიანთი დამწერლობით და თავიანთ ენაზე. "},
	{10, "10 დაწერა მეფე ახაშვეროშის სახელით, დაბეჭდა სამეფო ბეჭდით და დააგზავნა წერილები ცხენოსანი შიკრიკების, სახელმწიფო ცხენსაშენში ნაშობ რაშებზე ამხედრებულთა ხელით, "},
	{11, "11 რომ მეფე ნებას აძლევს იუდაელებს, რომელ ქალაქშიც არ უნდა იყვნენ, შეიკრიბონ და დაიცვან თავი, მოსპონ, დახოცონ, გაწყვიტონ ვინც კი არის მძლავრი ხალხში და სამთავროში, ვინც ავიწროებს მათ და მათ ცოლ-შვილს, და ნადავლად წაიღონ მათი ქონება, "},
	{12, "12 ერთი დღის მანძილზე მეფე ახაშვეროშის ყველა სამთავროში, მეთორმეტე თვის, ანუ ადარის, მეცამეტე დღეს. "},
	{13, "13 წერილის პირი უნდა გაეცათ, როგორც კანონი ყველა სამთავროში, ხალხისთვის გამოსაცხადებლად, რომ მზად ყოფილიყვნენ იუდაელები ამ დღისთვის მტერზე შურის საძიებლად. "},
	{14, "14 სახელმწიფო რაშებზე ამხედრებულმა შიკრიკებმა სწრაფად მიმოატარეს მეფის ბრძანება. კანონი კი შუშანში, სატახტოში, გამოცხადდა. "},
	{15, "15 გამოვიდა მარდოქაი მეფისგან ლურჯი და თეთრი ფერის სამეფო შესამოსელში, ოქროს დიდი გვირგვინით, ბისონისა და ძოწეული მოსასხამით. ყიჟინებდა და ხარობდა შუშან-ქალაქი. "},
	{16, "16 იუდაელთათვის იყო ნათელი, სიხარული, შვება და ლხენა. "},
	{17, "17 ყველა სამთავროში, ყველა ქალაქში, ყველგან, სადაც კი მივიდა მეფის ბრძანება და კანონი, სიხარული და შვება ჰქონდათ იუდაელებს, ლხინი და საზეიმო დღე. ქვეყნის ბევრი ხალხი გაიუდაელდა, რადგან იუდაელთა შიშმა მოიცვა ისინი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct ka9 poems[] = {
	{1, "1 მეთორმეტე თვის, ანუ ადარის, მეცამეტე დღეს, როცა მოაწია მეფის ბრძანებისა და კანონის აღსრულების ჟამმა (იმ დღეს, როცა იუდაელთა მტრები აპირებდნენ მათ ძლევას, თუმცა პირუკუ კი მოხდა, იუდაელებმა ძლიეს თავიანთ მოძულეთ), "},
	{2, "2 შეიკრიბნენ იუდაელნი თავ-თავის ქალაქებში, მეფე ახაშვეროშის ყველა სამთავროში, რათა ხელი აღემართათ თავიანთ მოსისხლეებზე. ვერავინ დაუდგა მათ წინ, რადგან მათმა შიშმა მოიცვა ყოველი ხალხი. "},
	{3, "3 მხარეთა მთავრებმა, მეფისნაცვლებმა, განმგებლებმა და სამეფო საქმეთა აღმსრულებლებმა პატივი მიაგეს იუდაელებს, რადგან მარდოქაის შიშისზარით იყვნენ მოცულნი. "},
	{4, "4 რადგან დიდი იყო მარდოქაი მეფის სასახლეში და მისწვდა მისი ამბავი ყველა სამთავროს, რადგან უფრი და უფრო დიდი ხდებოდა ეს კაცი, მარდოქაი. "},
	{5, "5 დასცხეს მტრებს იუდაელებმა, გაწყვიტეს მახვილით და მოსპეს. როგორც უნდოდათ, ისე მოექცნენ თავიანი მოძულეებს. "},
	{6, "6 შუშანში, სატახტო ქალაქში, დახოცეს და მოსპეს იუდაელებმა ხუთასი კაცი. "},
	{7, "7 ფარშანდათა, დალფონი და ასფათა, "},
	{8, "8 ფორათა, ადალია და არიდათა, "},
	{9, "9 ფარმაშთა, არისაი, არიდაი და იეზათა. - "},
	{10, "10 დახოცეს ჰამან ჰამადათას ძის, იუდაელთა მტრის, ათი ვაჟი, მაგრამ გასაძარცვავად ხელი არ აღუმართავთ. "},
	{11, "11 იმავე დღეს მიუვიდა შუშანში, სატახტოში, მეფეს დახოცილთა სია. "},
	{12, "12 უთხრა მეფემ ესთერ დედოფალს: ხუთასი კაცი და ჰამანის ათი ვაჟიშვილი გაწყვიტეს და მოსპეს იუდაელებმა შუშანში, სატახტო ქალაქში. მეფის სხვა სამთავროებში რაღას იზამდნენ? რა სათხოვარი გაქვს? მოგეცემა. კიდევ რა სახვეწარი გაქვს? აგისრულდება. "},
	{13, "13 თქვა ესთერმა: თუ მეფე ინებებს, ხვალაც დაანებონ შუშანელ იუდაელებს იმის გაკეთება, რაც დღეს გააკეთეს - ხეზე ჩამოჰკიდონ ჰამანის ვაჟები. "},
	{14, "14 თქვა მეფემ: იყოს ასე. გამოცხადდა განკარგულება შუშანში და ჩამოჰკიდეს ჰამანის ათი ვაჟი. "},
	{15, "15 შეიკრიბნენ შუშანელი იუდაელები ადარის თვეშიც, მეთოთხმეტე დღეს, და გაწყვიტეს შუშანში ასი კაცი, გასაძარცვად კი ხელი არ აღუმართავთ. "},
	{16, "16 შეიკრიბნენ დანარჩენი იუდაელნი, მეფის სამთავროებში რომ იყვნენ, დადგნენ თავის დასაცავად, რომ მოესვენათ მტრებისგან, და ამოხოცეს თავიანთი მოძულენი - სამოცდათხუთმეტი ათასი კაცი. მაგრამ გასაძარცვად ხელი არ აღუმართავთ. "},
	{17, "17 ეს იყო ადარის თვის მეცამეტე დღეს. მეთოთხმეტე დღეს კი მოისვენეს და ლხინისა და სიხარულის დღედ აქციეს ეს დღე. "},
	{18, "18 იკრიბებოდნენ შუშანის იუდაელები მეცამეტე და მეთოთხმეტე დღეს, ხოლო მეთხუთმეტე დღეს ისვენებდნენ, ლხინისა და სიხარულის დღედ გაიხადეს. "},
	{19, "19 ამიტომ არის, რომ სოფლელი იუდაელებისათვის, რომლებიც უგალავნო დაბებში ცხოვრობენ, ადარის მეთოთხმეტე დღე სიხარულისა და ლხინის, ზეიმისა და ერთმანეთისთვის საჩუქრების გაგზავნის დღეა. "},
	{20, "20 დაწერა ეს ამბები მარდოქაიმ და დაუგზავნა წერილები ყველა იუდაელს, მეფე ახაშვეროშის ყველა სამთავროში მცხოვრებს, ახლო მყოფს და შორს მყოფს, "},
	{21, "21 რომ დაეწესებინათ ყოველწლიური ზეიმი ადარის თოთხმეტსა და თხუთმეტში, "},
	{22, "22 რა დღეებშიც მოისვენეს იუდაელებმა მტრებისაგან და რა თვეშიც მწუხარება სიხარულით შეეცვალათ და გლოვა - ზეიმად, რათა ექციათ ეს დღეები ლხინისა და სიხარულის დღეებად, ერთმანეთისთვის საჩუქრების გაგზავნისა და ღარიბ-ღატაკთა მოკითხვის დღეებად. "},
	{23, "23 მიიღეს იუდაელებმა, რისი გაკეთებაც თავად დაიწყეს და რასაც სწერდა მათ მარდოქაი, "},
	{24, "24 როგორ ჩაიფიქრა ჰამან ჰამდათას ძემ, აგაგიელმა, მთელი იუდაელობის მტერმა, იუდაელთა დაღუპვა და ჰყარა ფური, ანუ წილი, მათ გასაწყვეტად და გასანადგურებლად, "},
	{25, "25 როგორ წარუდგა მეფეს სიტყვით, რომ ჩამოეღრჩოთ მარდოქაი. მაგრამ მის თავზე მოიქცა ავი განზრახვა, რაც იუდაელებზე ჰქონდა ჩაფიქრებული და ხეზე ჩამოჰკიდეს იგი და მისი ვაჟიშვილები. "},
	{26, "26 ამიტომაც უწოდეს ამ დღეებს ფურიმი, ფურის, ანუ წილის, სახელი. ამიტომაც თანახმად ამ წერილის სიტყვებისა და საკუთარი თვალით ნანახისა, თანახმად იმისა, რაც მათ შეემთხვათ, "},
	{27, "27 დაადგინეს და დაუწესეს იუდაელებმა თავიანთ თავს, თავიანთ შთამომავლობას და ყველას, მათთან შეხიზნულთ, რომ მოუშლელად ეზეიმათ ეს ორი დღე წლიდან წლამდე, დათქმულ დროს, დაწერილისამებრ, "},
	{28, "28 ხსომებოდათ ეს დღეები და ეზეიმათ ყოველ თაობაში, ყოველ საგვარეულოში, ყოველ სამთავროში და ყოველ ქალაქში. ფურიმის დღეები ყოფილიყო ეს დღეები, არ გაუქმებულიყო იუდაელთა შორის და არ გამქრალიყო შთამომავლობაში მათი ხსოვნა. "},
	{29, "29 დაჟინებით წერდნენ დედოფალი ესთერ აბიხაილის ასული და იუდაელი მარდოქაი, რომ შეესრულებინათ ეს მეორე წერილი ფურიმის თაობაზე. "},
	{30, "30 დაუგზავნა წერილები მთელს იუდაელობას, ახაშვეროშის სამეფოს ასოცდაშვიდ სამთავროში, მშვიდობისა და სიმტკიცის სიტყვები, "},
	{31, "31 რათა დაეცვათ ფურიმის ეს დღეები განსაზღვრულ დროს, როგორც დაუწესეს მათ იუდაელმა მარდოქაიმ და ესთერ დედოფალმა, როგორც თავად მათ დაუწესეს თავიანთ თავს და თავიანთ შთამომავლობას - მარხვისა და მოთქმის დღეები. "},
	{32, "32 ესთერის ბრძანებამ დააწესა ეს ფურიმი და წიგნშიც ჩაიწერა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct ka10 poems[] = {
	{1, "1 დაადო ხარკი მეფე ახაშვეროშმა ქვეყანას და ზღვის კუნძულებს. "},
	{2, "2 მისი სიქველისა და გმირობის საქმე, მარდოქაის დიდების ამბავი, როგორ განადიდა იგი მეფემ, მიდიელ და სპარსელ მეფეთა მატიანეშია ჩაწერილი. "},
	{3, "3 რადგან იუდაელი მარდოქაი მეორე კაცი იყო მეფე ახაშვეროშის შემდეგ, იუდაელთა შორის განდიდებული და დაფასებული თავის მრავალრიცხოვან მოძმეთა შორის, სიკეთის მაძიებელი თავის ერისათვის და სიტყვის შემწევი მთელი თავისი მოდგმის სამშვიდობოდ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};