#include <map>
#include <string>
class Bible23
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
	struct ka6	{ int val; const char *msg; };
	struct ka7	{ int val; const char *msg; };
	struct ka8	{ int val; const char *msg; };
	struct ka9	{ int val; const char *msg; };
	struct ka10	{ int val; const char *msg; };
	struct ka11	{ int val; const char *msg; };
	struct ka12	{ int val; const char *msg; };
	struct ka13	{ int val; const char *msg; };
	struct ka14	{ int val; const char *msg; };
	struct ka15	{ int val; const char *msg; };
	struct ka16	{ int val; const char *msg; };
	struct ka17	{ int val; const char *msg; };
	struct ka18	{ int val; const char *msg; };
	struct ka19	{ int val; const char *msg; };
	struct ka20	{ int val; const char *msg; };
	struct ka21	{ int val; const char *msg; };
	struct ka22	{ int val; const char *msg; };
	struct ka23	{ int val; const char *msg; };
	struct ka24	{ int val; const char *msg; };
	struct ka25	{ int val; const char *msg; };
	struct ka26	{ int val; const char *msg; };
	struct ka27	{ int val; const char *msg; };
	struct ka28	{ int val; const char *msg; };
	struct ka29	{ int val; const char *msg; };
	struct ka30	{ int val; const char *msg; };
	struct ka31	{ int val; const char *msg; };
	struct ka32	{ int val; const char *msg; };
	struct ka33	{ int val; const char *msg; };
	struct ka34	{ int val; const char *msg; };
	struct ka35	{ int val; const char *msg; };
	struct ka36	{ int val; const char *msg; };
	struct ka37	{ int val; const char *msg; };
	struct ka38	{ int val; const char *msg; };
	struct ka39	{ int val; const char *msg; };
	struct ka40	{ int val; const char *msg; };
	struct ka41	{ int val; const char *msg; };
	struct ka42	{ int val; const char *msg; };
	struct ka43	{ int val; const char *msg; };
	struct ka44	{ int val; const char *msg; };
	struct ka45	{ int val; const char *msg; };
	struct ka46	{ int val; const char *msg; };
	struct ka47	{ int val; const char *msg; };
	struct ka48	{ int val; const char *msg; };
	struct ka49	{ int val; const char *msg; };
	struct ka50	{ int val; const char *msg; };
	struct ka51	{ int val; const char *msg; };
	struct ka52	{ int val; const char *msg; };
	struct ka53	{ int val; const char *msg; };
	struct ka54	{ int val; const char *msg; };
	struct ka55	{ int val; const char *msg; };
	struct ka56	{ int val; const char *msg; };
	struct ka57	{ int val; const char *msg; };
	struct ka58	{ int val; const char *msg; };
	struct ka59	{ int val; const char *msg; };
	struct ka60	{ int val; const char *msg; };
	struct ka61	{ int val; const char *msg; };
	struct ka62	{ int val; const char *msg; };
	struct ka63	{ int val; const char *msg; };
	struct ka64	{ int val; const char *msg; };
	struct ka65	{ int val; const char *msg; };
	struct ka66	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 ხილვა ესაიასი, ამოცის ძისა, იუდაზე და იერუსალიმზე რომ იხილა, იუდას მეფეების - ყუზიას, იოთამის, ახაზის და ხიზკიაჰუს დროს. "},
	{2, "2 ისმინე, ცაო, ყური მიგდე, მიწავ! რადგან უფალი ლაპარაკობს. შვილები აღვზარდე და აღვაზევე, ისინი კი განმიდგნენ. "},
	{3, "3 ხარმა იცის თავისი მფლობელი და ვირმა თავისი პატრონის ბაგა, ისრაელმა კი არ იცის; ჩემს ერს არაფრის გაგება არა აქვს. "},
	{4, "4 ვაი, ბრალეულო ხალხო, ცოდვით დამძიმებულო ერო, ბოროტეულთა მოდგმავ, წარწყმედილო შვილებო! მიტოვებული ჰყავთ უფალი, დაგმობილი ჰყავთ ისრაელის წმიდა, ზურგი შეუქცევიათ! "},
	{5, "5 სად რა დაგერტყმით კიდევ, ურჩობას რომ აგრძელებთ? მთელი თავი დასნეულებული გაქვთ, გული შეღონებული. "},
	{6, "6 ტერფიდან თხემამდე საღი ადგილი აღარ შეგრჩათ: ყველგან ჭრილობა და წყლული, დაჩირქებული იარები, გამოურწყველი და შეუხვეველი, მალამოთი დაუამებელი. "},
	{7, "7 მოოხრებულია თქვენი ქვეყანა, გადამწვარია თქვენი ქალაქები, თქვენს მინდვრებს გადამთიელნი ჭამენ თქვენს თვალწინ და მოოხრებულია, თითქოს ურდოებს დაერბიოთ. "},
	{8, "8 დარჩა სიონის ასული, როგორც ქოხი ნავენახარში, როგორც ხულა ნაბოსტნარში, როგორც ალყაშემორტყმული ქალაქი. "},
	{9, "9 ეს მცირე ნატამალი რომ არ დაერჩინა ჩვენთვის ცაბაოთ უფალს, სოდომად ვიქცეოდით, გომორას დავემსგავსებოდით! "},
	{10, "10 ისმინეთ უფლის სიტყვა, თქვე სოდომის მთავრებო! ყურადიღეთ ჩვენი ღვთის რჯული, თქვე გომორელებო! "},
	{11, "11 რას ვაქნევ თქვენს უზომო საკლავებს, ამბობს უფალი. გამძღარი ვარ თქვენი აღსავლენი ვერძებით და კურატების ქონით. აღარ მსურს მოზვრების, კრავებისა და ვაცების სისხლი! "},
	{12, "12 რომ მოდიხართ და პირისპირ მეცხადებით, ვინ დაგავალათ ჩემი ეზოების თელვა? "},
	{13, "13 ნუღა მომიტანთ მაგ ფუჭ შესაწირავს, საძაგელია ჩემთვის საკმეველი, ახალმთვარობები და შაბათები ჯარობები ვეღარ ამიტანია! უკეთურება და დღესასწაული? "},
	{14, "14 თქვენი ახალმთვარობები და ზეიმები შეიძულა ჩემმა სულმა, ტვირთად დამაწვა, დავიღალე მათი ზიდვით. "},
	{15, "15 ხელებს რომ აღაპყრობთ, თვალს გარიდებთ; ლოცვებსაც რომ მიმრავლებთ, არ ვისმენ; ხელები სისხლითა გაქვთ სავსე! "},
	{16, "16 განიბანეთ, განიწმიდეთ, ავი საქმეები თვალთაგან განმარიდეთ, შეწყვიტეთ ბოროტის ქმნა. "},
	{17, "17 სიკეთის ქმნა ისწავლეთ, ეძიეთ სამართალი, შეეწიეთ ჩაგრულს, განიკითხეთ ობოლი, ქვრივს გამოესარჩლეთ. "},
	{18, "18 მერე მოდით და ცილობა ვყოთ, ამბობს უფალი: მეწამულიც რომ იყოს თქვენი ცოდვები, თოვლივით გასპეტაკდება; ჭიაფერივით წითელიც რომ იყოს, მატყლის ფთილასავით გახდება. "},
	{19, "19 თუ მორჩილნი იქნებით და გამგონენი, მიწის დოვლათს შეჭამთ; "},
	{20, "20 თუ განდგებით და გაურჩდებით, მახვილი შეგჭამთ! რადგან უფლის ბაგენი მეტყველებენ. "},
	{21, "21 როგორ ქცეულა მეძავად ერთგული ქალაქი! სამართლით სავსე იყო, სიმართლე სუფევდა იქ, ახლა კი კაცისმკვლელები არიან. "},
	{22, "22 ხენჯად იქცა შენი ვერცხლი, შენს ღვინოს წყალი შეერია. "},
	{23, "23 შენი მთავრები განდგომილნი არიან და ქურდთა თანამზრახველები; ყველას ქრთამი უყვარს და მოსაკითხებზე ნადირობენ; ობოლს არ განიკითხავენ და ქვრივის საჩივარი არ სწვდებათ. "},
	{24, "24 ამიტომ ამბობს მეუფე, ცაბაოთ უფალი, ისრაელის ძლიერი: ოჰ, როგორ ამოვიყრი ჩემს მოსისხლეთა ჯავრს, როგორც ვიძიებ შურს ჩემს მტრებზე! "},
	{25, "25 მოვაქცევ შენკენ ხელს და, თითქოს ტუტეში გამეფეროს შენი ხენჯიანი ვერცხლი, ყოველგვარ მინარევს მოგაცილებ. "},
	{26, "26 მოვაქცევ შენს მსაჯულებს, როგორც წინათ იყვნენ, და შენს მრჩეველებს, როგორც დასაწყისში იყვნენ; ამის შემდეგ სიმართლის ქალაქი დაგერქმეეა, უტყუარი სატახტო. "},
	{27, "27 სიონი სამართლით გამოისყიდება და მისკენ მოცეულნი - სიმართლით! "},
	{28, "28 დამნაშავენი და ცოდვილნი ერთად გაწყდებიან და უფლის მიმტოვებელნი დაიღუპებიან. "},
	{29, "29 რადგან შერცხვენილნი იქნებიან მუხების გამო, რომელთაც შეჰხაროდით, და გაწბილდებიან ბაღების გამო, რომლებიც აირჩიეთ. "},
	{30, "30 რადგან ფოთოლდამჭკნარ მუხასავით და ურწყავი ბაღივით შეიქნებით. "},
	{31, "31 ძლიერი ძენძად იქცევა და მისი საქმე - ნაპერწკალად; ორივე ერთად აბრიალდება და ჩამქრობი არავინ იქნება. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 სიტყვა, რომელიც იხილა ესაიამ, ამოცის ძემ, იუდაზე და იერუსალიმზე. "},
	{2, "2 უკანასკნელ დღეებში იქნება, რომ უფლის სახლის მთა მთათა სათავეში დადგინდება, აღიმართება მწვერვალებზე მაღლა და ყოველი ერი მისკენ დაიწყებს დენას. "},
	{3, "3 დაიძრება უთვალავი ხალხი და იტყვის: მოდი, ავიდეთ უფლის მთაზე, იაკობის სახლში; გვასწავლოს თავისი გზები და მისი ბილიკებით ვიაროთ, რადგან რჯული სიონიდან გამოვა და უფლის სიტყვა - იერუსალიმიდან. "},
	{4, "4 სამართალს განიკითხავს იგი ერებს შორის და ამხილებს უთვალავ ხალხებს; მახვილებისგან სახნისებს გამოჭედავენ და შუბებისგან - ნამგლებს, ერი ერზე აღარ აღმართავს მახვილს და აღარავინ ისწავლის ომს. "},
	{5, "5 ჰოი, იაკობის სახლო! მოდით და უფლის ნათელში ვიაროთ! "},
	{6, "6 მაგრამ შენ მოიკვეთე შენი ერი, იაკობის სახლი, რადგან აღმოსავლეთით ავსებულან ისინი და ჯადოქრობით ფილისტიმელთა მსგავსად; უცხო თესლთა შვილებთან გადასკვნილან. "},
	{7, "7 ავსებულა მათი ქვეყანა ოქრო-ვერცხლით და ბოლო არ უჩანს მათ საგანძურებს; ავსებულა მათი ქვეყანა ცხენებით და ბოლო არ უჩანს მათ ეტლებს. "},
	{8, "8 ავსებულა მათი ქვეყანა კერპებით და ეთაყვანებიან საკუთარ ნახელავს, რაც მათმა თითებმა გამოძერწა. "},
	{9, "9 დამცირდა ადამიანი, დამდაბლდა კაცი, შენ კი არ პატიობ მათ. "},
	{10, "10 კლდეში შეასწარ, მიწაში ჩაემალე უფლის ზარტეხილს და მისი სიდიადის ელვარებას! "},
	{11, "11 დამდაბლდებოდა ადამიანის ამაყი მზერა და კაცთა მედიდურება დამცირდება, მხოლოდ უფალი იქნება მაღალი იმ დღეს! "},
	{12, "12 რადგან დაუდგება ცაბაოთ უფლის დღე ყველა ამაყსა და მედიდურს, ყველა აღზევებულს, და დამდაბლდება. "},
	{13, "13 ყველა ლიბანურ კედარს, მაღალს და აზიდულს, ყველა ბაშანურ მუხას, "},
	{14, "14 ყველა მაღალ მთასა და ყველა აზიდულ მწვერვალს, "},
	{15, "15 ყველა მაღალ გოდოლს და ყველა გამაგრებულ გალავანს, "},
	{16, "16 ყველა თარშიშულ ხომალდს და ყველა თვალწარმტაც მორთულობას. "},
	{17, "17 დამცირდება ადამიანის სიამაყე და კაცთა მედიდურება დამდაბლდება, მხოლოდ უფალი იქნება მაღალი იმ დღეს. "},
	{18, "18 და ყოველგვარი კერპი გაცამტვერდება. "},
	{19, "19 შევლენ კლდის ქვაბებში და მიწის ნაპრალებში დაემალება ხალხი უფლის ზარტეხილს და მისი სიდიადის ელვარებას, როცა ქვეყნის შესაზარად შეიმართება. "},
	{20, "20 იმ დღეს კაცი თხუნელებსა და ღამურებს გადაუყრის თავის ვერცხლის კერპებს და თავის ოქროს კერპებს, სათაყვანოდ რომ გაიკეთა. "},
	{21, "21 რათა კლდეთა მღვიმეებში და პიტალოთა ბზარებში დაემალოს უფლის ზარტეხილს და მისი სიდიადის ელვარებას, როცა ქვეყნის შესაზარად შეიმართება. "},
	{22, "22 ბარემ გაეცალეთ ადამიანს, ნესტოებში რომ უდგას სული, რადგან რაღა ღირსება აქვს მას? "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 რადგან, აჰა, მეუფე, ცაბაოთ უფალი, წაართმევს იერუსალიმს და იუდას სახსარს და სასოს, პურის მთელ სახსარს; "},
	{2, "2 ვაჟკაცს და მეომარს, მსაჯულს და ქადაგს, მისანს და უხუცესს, "},
	{3, "3 ორმოცდაათისთავს და დიდებულს, მრჩეველს და ბრძენ ხელოვანს, გრძნეულ შემლოცველს. "},
	{4, "4 სარდლებად ბიჭ-ბუჭებს დავუდგენ და ქარაფშუტები იბატონებენ მათზე. "},
	{5, "5 დაითრგუნება ხალხი, კაცი კაცს დაჩაგრავს, მოყვასი მოყვასს; ბავშვი გაუმედიდურდება მოხუცს, უღირსი - პატივდებულს. "},
	{6, "6 რადგან კაცი დაიჭერს თავის ძმას თავის მამის სახლში: სამოსელი გქონია, გაგვიხდი მთავრად, შენს ხელთ ქვეშ იყოს ეს ნანგრევებიო. "},
	{7, "7 დაიფიცებს იმ დღეს და იტჟვის: ვერ ვიქნები განმგებელი, არა მაქვსო სახლში პური, არც სამოსელი, ნუ დამადგენო ერის მთავრად. "},
	{8, "8 რადგან დაემხო იერუსალიმი და დაეცა იუდა, რადგან მათი სიტყვა და საქმე შეურაცხყოფაა უფლისათვის, უპატიობაა მისი დიდების თვალში. "},
	{9, "9 მათივე გამომეტყველება ამხილებს მათ და სოდომელებივით აცხადებენ თავიანთ ცოდვას, არ მალავენ, ვაი მათ სულს! ბოროტება მიაგეს საკუთარ თავს! "},
	{10, "10 უთხარით მართალს, რომ სიკეთეს ეწევა, რომ ყველა თავის ნამოქმედარს შეჭამს. "},
	{11, "11 ვაი უკეთურს, ბოროტეულს, რადგან მოიმკის თავისი ხელის ნამოქმედარს! "},
	{12, "12 ჩემს ერს ბავშვები ჩაგრავენ და დიაცები უბატონდებიან. ჩემო ერო, შენმა მეგზურებმა დაგაბნიეს და გზა-კვალი აგირიეს! "},
	{13, "13 წარდგა სამხილებლად უფალი და დგას ხალხთა განსასჯელად. "},
	{14, "14 უფალი მსჯავრს სდებს თავისი ერის უხუცესებს და თავკაცებს: თქვენ გააჩანაგეთ ვენახი, ღარიბ-ღატაკთაგან წართმეულით აგივსიათ სახლები. "},
	{15, "15 რატომ თელავთ ჩემ ერს და აჭირვებთ ღარიბ-ღატაკთ? ამბობს მეუფე, ცაბაოთ უფალი. "},
	{16, "16 თქვა უფალმა: რაკი გამედიდურდნენ სიონის ასულნი, ყელმოღერებით და ურცხვი მზერით მიმოდიან, ლაღად მოსეირნობენ და ფეხებზე რგოლებს მოაჟღარუნებენ. "},
	{17, "17 თავს გაუქაჩლებს მეუფე სიონის ასულთ და სარცხვინელს გაუშიშვლებს მათ. "},
	{18, "18 იმ დღეს აართმევს მათ მეუფე ფეხსამკაულ შიბებს, თავსაკრავებს და ყელსაბამებს, "},
	{19, "19 საყურეებს, სამაჯურებს და პირბადეებს, "},
	{20, "20 მჯიღებს, ფეხსამკაულებს და სარტყლებს, სუნამოს ჭურჭლებს და ავგაროზებს, "},
	{21, "21 ბეჭდებს და ნესტოს რგოლებს, "},
	{22, "22 ძვირფას შესამოსელს, მოსასხამებს, მანდილებს და ქისებს, "},
	{23, "23 სარკეებს, პერანგებს, თავსაბურველს და ხალათებს. "},
	{24, "24 სურნელების ნაცვლად აუვად სიმყრალე, სარტყელის ნაცვლად ექნებათ ჯვალო, ნაწნავ-კულულების ნაცვლად სიქაჩლე, მოსასხამის ნაცვლად ტომარა, მშვენების ნაცვლად ცეცხლის დაღი. "},
	{25, "25 შენი ვაჟკაცები მახვილისგან დაეცემიან და შენი გმირები ბრძოლაში დაიხოცებიან. "},
	{26, "26 მისი კარიბჭენი მოჰყვებიან მოთქმას და გოდებას, თავად კი მტვერში იჯდება იავარქმნილი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 ჩაებღაუჭება შვიდი დედაკაცი ერთ მამაკაცს იმ დღეს და ეტყვის: ჩვენ ჩვენს პურს შევჭამთ და ჩვენი საკუთარი სამოსელით შევიმოსებით, ოღონდ შენი სახელი დაგვეწეროს, აგვხადე სირცხვილი. "},
	{2, "2 იმ დღეს იქცევა უფლის მორჩი მშვენებად და პატივად, და მიწის ნაყოფი ღირსებად და დიდებად ისრაელის ნატამალისთვის. "},
	{3, "3 სიონს შემონახული და იერუსალიმში დარჩენილი წმიდად იქნება წოდებული ყველა, ვინც განწესებულია იერუსალიმში სასიცოცხლოდ, "},
	{4, "4 როცა ჩამორეცხავს მეუფე მწვირეს სიონის ასულებს და გაწმედს იერუსალიმის წიაღს სისხლისაგან განკითხვის სულით და ხანძრის სულით. "},
	{5, "5 მაშინ შექმნის უფალი სიონის მთის ყოველ ადგილზე და ყოველ საკრებულოს თავზე ნისლსა და კვამლს დღისით და ცეცხლის ნათებას ღამით, რადგან ყოველ დიდებას საფარველი გადაეფარება. "},
	{6, "6 კარავი ჩრდილად იქნება დღის პაპანებაში და თავშესაფრად და საყუდრად ავდარსა და წვიმაში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 ვუმღერებ ჩემს შეყვარებულს სიყვარულის სიმღერას მის ვენახზე: ჰქონდა ვენახი ნაყოფიერ გორაკზე ჩემს შეყვარებულს. "},
	{2, "2 დაბარა, ქვები მოაცილა, ჩაყარა წითელი ვაზი, ჩადგა კოშკი მის შუაგულში, საწნახელიც ამოკვეთა იქ და დაელოდა, ვიდრე სავსე მტევნებს გამოიღებდა. მაგრამ ხენეში ნაყოფი გამოიღო. "},
	{3, "3 ახლა განგვსაჯეთ, იერუსალიმის მცხოვრებნო და იუდას ხალხო, მე და ჩემი ვენახი. "},
	{4, "4 კიდევ რა უნდა გამეკეთებინა ჩემი ვენახისთვის და რა დავაკელი? რატომ გამოიღო ხენეში ნაყოფი, როცა სავსე მტევნებს ველოდი? "},
	{5, "5 ახლა გაგიცხადებთ, რას დავმართებ ჩემს ვენახს: ღობეს მოვურღვევ, რომ გაპარტახდეს; ზღუდეს მოვუნგრევ, რომ გაითელოს. "},
	{6, "6 გავაველურებ, არ გაისხლება და არ დაიბარება, და ამოვა იქ ნარი და ეკალი, ღრუბლებს ვუბრძანებ, წვიმა არ აწვიმოს მათზე. "},
	{7, "7 რადგან ცაბაოთ უფლის ვენახი ისრაელის სახლი და იუდას ხალხია, მისი სანატრელი ნერგი, სამართალს მოელოდა და, აჰა, სისხლის ღვრაა! სიმართლეს და, აჰა, სასოწარკვეთილი ძახილია! "},
	{8, "8 ვაი თქვენ, სახლების სახლებზე მიმდგმელნო და ყანების ყანებზე მიმჯრელნო, რომ ადგილი აღარსად დარჩა და თქვენს გარდა აღარავინ ცხოვრობს დედამიწაზე. "},
	{9, "9 ყურში ჩამესმა ცაბაოთ უფლისგან: მრავალი სახლი გაუდაბურდება, დიდნი და კეთილნაგებნი გაუკაცრიელდებიან. "},
	{10, "10 ნამდვილად, ათ ქცევა ვენახში ერთი ბათიც არ მოვა და ერთი ხომერი თესლიდან ერთი ეფაც არ მოვა! "},
	{11, "11 ვაი მათ, დილაადრიანვე დასალევს რომ ეძებენ და გვიანობამდე ღვინით ხურდებიან! "},
	{12, "12 ებანი, ქნარი, დოლი, სტვირი და ღვინო მათი ლხინია; არ უყურებენ ღვთის საქმეს და მისი ხელის ნამოქმედარს ვერ ხედავენ. "},
	{13, "13 ამიტომ დატყვევდება ჩემი ერი უგუნურებისთვის; მისი დიდებულები შიმშილით გაწყდებიან და მის მდაბიორებს წყურვილი გაახმობს. "},
	{14, "14 ამიტომაც გაფართოვდა შავეთი და ხახა უსაზომოდ დააფჩინა. ჩახდება იქ მისი დიდება და უხვება, მისი შვება და ლხენა; "},
	{15, "15 მოდრკება ადამის ძე და კაცი დამცირდება, ამპარტავანთა თვალი დაიხრება. "},
	{16, "16 მაგრამ აღზევდება ცაბაოთ უფალი სამსჯავროზე და წმიდა ღმერთი იწმიდებს სამართალში. "},
	{17, "17 გაიკვებებიან ცხვრები თავიანთ ფარეხში და ნასუქალთა ნარჩენებს უცხონი შეჭამენ. "},
	{18, "18 ვაი მათ, გარყვნილების თოკებით რომ იზიდავენ დანაშაულს და თითქოს ეტლის აღვირებით - ცოდვას. "},
	{19, "19 რომ ამბობენ: ისწრაფოს, დააჩქაროს თავისი საქმე, რომ ვიხილოთ; მოახლოვდეს, მოვიდეს განგება ისრაელის წმიდისა, რომ მივხვდეთ. "},
	{20, "20 ვაი მათ, ვინც ბოროტებას სიკეთეს არქმევს და სიკეთეს - ბოროტებას; ვინც ბნელს ნათლად სახავს და ნათელს - ბნელად, სიმწარეს სიტკბოდ სახავს და სიტკბოს - სიმწარედ! "},
	{21, "21 ვაი ბრძენებს თავიანთ თვალში და გონიერთ თავიანთი ჭკუით! "},
	{22, "22 ვაი გმირებს ღვინის სმაში და ვაჟკაცებს სასმელის გაზავებაში! "},
	{23, "23 ვაი დამნაშავის გამამართლებელს ქრთამის გულისთვის და ალალმართლის გამამტყუნებელს! "},
	{24, "24 როგორც ცეცხლის ენა ჭამს ჩალას და ალი ბუგავს თივას, ასე ჩალპება მათი ფესვი და გაცამტვერდება მათი ყვავილი, რადგან შეიძულეს ცაბაოთ უფლის რჯული და ისრაელის წმიდის შეგონება არად ჩააგდეს. "},
	{25, "25 ამიტომ აინთო უფლის რისხვა თავისი ხალხის მიმართ, ხელი მოუღერა მათ და დაჰკრა, შეიძრნენ მთები და მათი გვამები ნაგავივით ეყარა ქუჩებში; მაინც არ დაცხრა მისი რისხვა და კვლავ მოღერებულია მისი ხელი. "},
	{26, "26 შორიდან აღუმართავს დროშას ხალხებს, სტვენით მოუხმობს ქვეყნის კიდიდან და ისიც ქარის უსწრაფესად გაჩნდება. "},
	{27, "27 არავინ იქნება დამაშვრალი მათ შორის, არც შებარბაცებული; არ ჩათვლემს, არ დაიძინებს, სარტყელი არ შეეხსნება წელზე და ფეხსამოსის თასმები არ დაუწყდება. "},
	{28, "28 წამახული აქვს ისრები და ყველა მშვილდი მოზიდული აქვს; კაჟივითაა მისი ცხენის ფლოქვები და მისი ეტლის ბორბლები ქარიშხალია. "},
	{29, "29 მისი ღრიალი ლომის ღრიალია, ლომის ბოკვერებივით ბდღვინავს; დაიღრიალებს და მსხვერპლს დაეცემა, გაიტაცებს და ვერავინ იხსნის. "},
	{30, "30 დაუღრიალებს იმ დღეს, როგორც ზღვა ღრიალებს; დახედავს მიწას კაცი და, აჰა, წყვდიადი და წუხილი! ნათელი დაბნელდება მისი ჯანღებისგან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ka6 poems[] = {
	{1, "1 მეფე ყუზიას სიკვდილის წელს ვიხილე უფალი, მჯდარი ამაღლებულ, ზეამართულ ტახტზე, და მისი კალთები ავსებდა ტაძარს. "},
	{2, "2 თავთით სერაფიმები ედგნენ, ექვს-ექვსი ფრთა ესხა თითოეულს; ორით სახეს იფარავდნენ, ორით ფეხებს იფარავდნენ, ორით ფრენდნენ. "},
	{3, "3 ერთი მეორეს გასძახოდნენ და ამბობდნენ: წმიდაა! წმიდაა! წმიდაა ცაბაოთ უფალი! მისი დიდებით სავსეა ქვეყნიერება! "},
	{4, "4 შეიძრა ზღურბლთა საძირკვლები ამ ძახილის ხმაზე და კვამლით აივსო სახლი. "},
	{5, "5 ვიფიქრე: ვაი მე, დავიღუპე, რადგან ბაგეუწმიდური კაცი ვარ და ბაგეუწმიდურ ხალხში ვცხოვრობ-მეთქი, ჩემმა თვალებმა კი მეუფე, ცაბაოთ უფალი იხილეს. "},
	{6, "6 მოფრინდა ჩემთან ერთ-ერთი სერაფიმი და ხელში სამსხვერპლოდან აღებული მუგუზალი ეჭირა მაშით. "},
	{7, "7 ბაგეზე შემახო და მითხრა: აჰა, შეეხო ეს შენს ბაგეს და მოგცილდა უკეთურება, მიტევებულია შენი ცოდვა. "},
	{8, "8 მომესმა ხმა მეუფისა, რომელიც ამბობდა, ვინ მივავლინო და ვინ გაგვეგზავნება? ვთქვი: აჰა, მიმავლინე. "},
	{9, "9 თქვა: წადი და უთხარი მაგ ხალხს: სმენით მოისმენთ, მაგრამ ვერ გაიგებთ; ხილვით თხილავთ, მაგრამ ვერ მიხვდებით. "},
	{10, "10 უგრძნობს გახდი მაგ ხალხის გულს, სასმენელთ დაუმძიმებ და სახედველთ აუხვევ, რომ თვალით ვერ ხედავდეს, ყურით ვერ ისმენდეს, გულით ვერ ხვდებოდეს, რომ არ მოიქცეს და არ განიკურნოს. "},
	{11, "11 ვთქვი: როდემდის, უფალო? თქვა: ვიდრე ქალაქები უმკვიდროდ არ გადაშენდება, სახლები არ გაუკაცრიელდება და მიწა არ გაუდაბურდება. "},
	{12, "12 გადახვეწავს ადამიანებს უფალი და დიდი უდაბურება დასადგურდება ქვეყანაში. "},
	{13, "13 კიდევ მეათედი დარჩება მათგან და ისიც გადაიბუგება. მაგრამ როგორც მოჭრილ ბელეკონს და მუხას რჩება ძირი, ასევე წმიდა მოდგმა იქნება მათი ძირი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct ka7 poems[] = {
	{1, "1 იუდას მეფის ახაზის დროს, იოთამის ძისა, ყუზიას ძისა, გამოვიდნენ რეცინ არამის მეფე და ფეკახ რემალიას ძე, ისრაელის მეფე, იერუსალიმის ასაღებად, მაგრამ ვერ აიღეს. "},
	{2, "2 ემცნო დავითის სახლს: ეფრემში დაბანაკდა არამიო. მაშინ შეირხა მისი გული და მისი ხალხის გული, როგორც ხეები ირხევიან ტყეში ქარისაგან. "},
	{3, "3 უთხრა უფალმა ესაიას: წადით შენ და შენი შვილი შეარ-იაშუბი და შეხვდით ახაზს ზემო ტბორის წყალსადენის ბოლოს, მრეცხავთა მინდვრის გზაზე, "},
	{4, "4 და უთხარი: მშვიდად იყავი, ნუ შეშინდები და გულს ნუ შეგიღონებს აკვამლებული მუგუზლების ეს ორი კუდი - რეცინ არამელისა და რემალიას ძის სიბრაზე. "},
	{5, "5 რადგან შეითქვნენ შენს წინააღმდეგ არამი, ეფრემი და რემალიას ძე და თქვეს: "},
	{6, "6 გავილაშქროთ იუდაზე, დავეცეთ და გავტეხოთ, დავუსვათ მეფედ ტაბეალის ძე. "},
	{7, "7 ასე ამბობს უფალი ღმერთი: ეს არ მოხდება, ეს არ იქნება! "},
	{8, "8 რადგან არამის თავი დამასკოა და დამასკოს თავი - რეცინი. კიდევ სამოცდახუთი წელი და მოსწყდება ერს ეფრემი. "},
	{9, "9 ეფრემის თავი სამარიაა და სამარიის თავი - რემალიას ძე. თუ არ გჯერათ, ურწმუნონი ყოფილხართ. "},
	{10, "10 კვლავ უთხრა უფალმა ახაზს: "},
	{11, "11 მოსთხოვე უფალს, შენს ღმერთს, შენთვის ნიშანი დაბლა ქვესკნელიდან ან მაღლა ზესკნელიდან. "},
	{12, "12 უთხრა ახაზმა: არ მოვთხოვ და არ გამოვცდი უფალს. "},
	{13, "13 უთხრა: ახლა ისმინე, დავითის სახლო, არ კმარა შენთვის, რომ ხალხს აღონებ, ახლა ჩემი ღმერთიც გინდა შეაღონო? "},
	{14, "14 ამიტომ თავად მოგცემს მეუფე ნიშანს: აჰა, მუცლადიღებს ქალწული და შობს ძეს, და უწოდებს საბელად ემანუელს. "},
	{15, "15 ერბოსა და თაფლს უნდა ჭამდეს, ვიდრე ბოროტების უკუგდებას და სიკეთის არჩევას არ ისწავლის. "},
	{16, "16 მაგრამ ვიდრე ყრმა ისწავლიდეს ბოროტის უკუგდებას და სიკეთის არჩევას, გაუდაბურდება ეს მიწა, რომელსაც შენ მისი ორი მეფის გამო განუდექი. "},
	{17, "17 ისეთ დღეებს მოგივლენს უფალი შენ და შენს ხალხს, და შენი მამის სახლს, როგორიც არ დამდგარა იუდასგან ეფრემის განდგომის დღიდან - მოგივლენს აშურის მეფეს. "},
	{18, "18 იმ დღეს სტვენით მოუხმობს უფალი ბუზებს, ეგვიპტის ჭაობებში რომ არიან, და ფუტკრებს, აშურის ქვეყანაში რომ არიან. "},
	{19, "19 მოვლენ და შეესევიან გაუდაბურებულ ხეობებს, კლდეთა ნაპრალებს, ყოველ ძეძვნარს და ყოველ საძოვარს. "},
	{20, "20 იმ დღეს გაუპარსავს ჩემი მეუფე მდინარის გაღმიდან ნაქირავები სამართებლით - აშურის მეფით - თავს და ფეხის ბალანს და წვერსაც მოკვეცავს. "},
	{21, "21 იმ დღეს გამოზრდის კაცი ერთ დეკეულს და ორ ცხვრს. "},
	{22, "22 რა რძესაც მოიწველიან, იმის ერბოს შეჭამს, რადგან ერბოთი და თაფლით გამოიკვებება ქვეყანაში დარჩენილი მთელი ხალხი. "},
	{23, "23 იმ დღეს ყოველი ადგილი, სადაც ათასი ვერცხლის საღირალი ათასი ძირი ვაზი იყო ჩაყრილი, ჯაგნარად და ეკალ-ნარად გადაიქცევა. "},
	{24, "24 მშვილდ-ისრებით შემოვლენ იქ, რადგან მთელი ქვეყანა ჯაგნარად და ეკალ-ნარად იქნება გადაქცეული. "},
	{25, "25 ვერცერთ მთაზე, რომელიც თოხით ითოხნებოდა, ვერ მიხვალ ჯაგნარისა და ეკალ-ნარის შიშით; ხარების გასარეკი და ცხვრების გასათელი გახდება იგი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct ka8 poems[] = {
	{1, "1 მითხრა უფალმა: აიღე დიდი დაფა და ზედ გარკვევით დაწერე: იჩქარე სათარეშოდ, ისწრაფე საძარცვად. "},
	{2, "2 ავიყვანე სანდო მოწმეები - ურია მღვდელი და ზაქარია ბარაქიას ძე. "},
	{3, "3 დავუახლოვდი ქადაგ ქალს, რომელმაც მუცლადიღო და შვა ვაჟი. მითხრა უფალმა: დაარქვი სახელად მაჰერ-შალალ ხაშ-ბაზ (იჩქარე სათარეშოდ, ისწრაფე საძარცვავად). "},
	{4, "4 რადგან, ვიდრე ყმაწვილი ისწავლიდეს დაძახებას: მამი და დედი, დამასკოს დოვლათს და სამარიის ნადავლს აშურის მეფეს მიუტანენ. "},
	{5, "5 კიდევ მელაპარაკა უფალი და ასე მითხრა: "},
	{6, "6 რაკი შეიძულა ამ ხალხმა სილოამის მდორე წყალი და შეჰხარის რეცინს და რემალიას ძეს, "},
	{7, "7 ამიტომაც მიაქცევს მათზე ჩემი მეუფე ძლიერ და უზღვავ წყალს (აშურის მეფეს და მთელ მის დიდებას). აპირთავდება მისი კალაპოტი და გადაიღვრება ნაპირებზე. "},
	{8, "8 შეაღწევს იუდაში, დატბორავს და ანიაღვრდება, კისრამდე ასწვდება; ფრთებს გაშლის და აავსებს შენი ქვეყნის მთა-ბარს, ემანუელ! "},
	{9, "9 დაეცით ყიჟინა, ხალხებო, და ძრწოდეთ! ყური უგდეთ, შორი ქვეყნისანო! იარაღი აისხით და ძრწოდეთ! იარაღი აისხით და ძრწოდეთ! "},
	{10, "10 ქმენით თათბირი, გაცუდდება! თქვით სიტყვა, არ შესრულდება, რადგან ჩვენთან არის ღმერთი (ემანუელი)  "},
	{11, "11 რადგან ასე მითხრა უფალმა, როცა ხელი ჩამავლო და გამაფრთხილა, არ მევლო ამ ხალხის გზით. "},
	{12, "12 ნუ დაარქმევთ შეთქმულებას ყველაფერს, რასაც ეს ხალხი შეთქმულებას არქმევს და მისი შემაშინებელი ნუ შეგაშინებთ, ნუ შეგზარავთ. "},
	{13, "13 მხოლოდ ცაბაოთ უფალს ეკრძალეთ, ის არის თქვენი შემაშინებელი და თქვენი შემზარავი. "},
	{14, "14 ის იქნება საწმიდარად და დაბრკოლების ლოდად და წაფორხილების კლდედ ისრაელის ორი სახლისთვის. ბადედ და მახედ იერუსალიმის მკვიდრისათვის. "},
	{15, "15 ბევრი წაიფორხილებს მასზე, დაეცემიან და დაილეწებიან, გაებმებიან და გაიხლართებიან. "},
	{16, "16 შეჰკარი ეს ანდერძი, დაბეჭდე რჯული ჩემს მოწაფეებში. "},
	{17, "17 მე ველი უფალს, რომელიც პირს იფარავს იაკობის სახლისგან, და ვესავ მას. "},
	{18, "18 აჰა, მე და ეს ბავშვები, უფალმა რომ მომცა ნიშებად და სასწაულებად ისრაელში ცაბაოთ უფლისგან, რომელიც სიონის მთაზეა დავანებული. "},
	{19, "19 თუ გითხრეს: დაეკითხეთო მესულთანებს და ჯადოქრებს, რომ ჩურჩულებენ და სტვენენო, განა თავის ღმერთს არ ეკითხება ხალხი, განა მკვდრებს ეკითხება ცოცხალთა გამო? "},
	{20, "20 მიმართეთ რჯულსა და ანდერძს! თუ არ ამბობენ ამ სიტყვის მიხედვით, ნათქვამს არა აქვს აზრი. "},
	{21, "21 ჩაივლის იქ გატანჯული და მშიერი. როცა დაიმშევა, გაავდება, გმობას დაუწყებს თავის მეფეს და თავის ღმერთს და მაღლა აიხედავს. "},
	{22, "22 მიწას დახედავს და, აჰა, დაინახავს გასაჭირს და სიბნელეს - წყვდიადს განუჭვრეტელს და უკუნეთში გაიტყორცნება. "},
	{23, "23 მაგრამ აღარ იქნება წყვდიადი შეჭირვებულისთვის. როგორც წინა დროებამ დაამცირა ზებულონის ქვეყანა და ნაფთალის ქვეყანა, ასე უკანასკნელ დროს განადიდებს ზღვისპირეთს, წიაღიორდანეს და წარმართთა გალილეას. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct ka9 poems[] = {
	{1, "1 ხალხმა, ბნელში მოარულმა, იხილა ნათელი დიდი, წყვდიადის ქვეყანაში მცხოვრებლებს ნათელი გამოუბრწყინდა. "},
	{2, "2 შენ გაამრავლე ხალხი, გაუზარდე მას სიხარული; მხიარულობდნენ შენ წინაშე, როგორც მკის დროს იციან სიხარული, როგორც ხარობენ ნადავლის გაყოფისას. "},
	{3, "3 რადგან შენ დალეწე მისი კირთების უღელი, და მისი ბეჭების კეტი - მისი დამჩაგვრელის კვერთხი, როგორც მიდიანის დღეს. "},
	{4, "4 რადგან ყოველი ხამლი, ბრძოლაში ნატარები, და სამოსელი, სისხლში ნათრევი, დასაწვავი იქნება, როგორც ცეცხლის კერძი. "},
	{5, "5 რადგან შეგვეძინა შვილი, მოგვეცა ძე და უფლობა იყო მის ბეჭებზე, ეწოდა სახელად საკვირველი მრჩეველი, ღმერთი ძლიერი, მარადისობის მამა, მშვიდობის მთავარი. "},
	{6, "6 ხელმწიფების განსადიდებლად და უბოლოო მშვიდობისთვის დავითის ტახტზე და მის სამეფოში, მის განსამტკიცებლად და გასაძლიერებლად სამართალში და სიმართლეში აწ და მარადის. ცაბაოთ უფლის შური აღასრულებს ამას. "},
	{7, "7 სიტყვა მოუვლინა უფალმა იაკობს და გარდამოვიდა ისრაელზე. "},
	{8, "8 გაიგებს მთელი ერი - ეფრემი და სამარიის მკვიდრი, მედიდურად და გულდიდად რომ ლაპარაკობს: "},
	{9, "9 აგურები ჩამოცვენილია, თლილი ქვებით დავიწყებთ შენებასო; ლეღვსულელი გახეხილია, კედარით შევცვლითო. "},
	{10, "10 აუმხედრებს მას უფალი რეცინის მტრებს და ააგულიანებს მის დუშმანებს. "},
	{11, "11 არამი აღმოსავლეთით და ფილისტიმელი დასავლეთით - და პირაშკმით ჭამენ ისრაელს. მაინც არ დამცხრალა მისი რისხვა და კვლავ მოღებულია მისი ხელი. "},
	{12, "12 ხალხი არ მიქცეულა თავისი მგვემელისკენ და ცაბაოთ უფალს არ ეძიებს. "},
	{13, "13 მოსწყვიტა ისრაელს უფალმა თავი და კუდი, რტოები და ღერო ერთ დღეს. "},
	{14, "14 მოხუცი და პატივდებული თავია, სიცრუის ქადაგმოძღვარი კი - კუდი. "},
	{15, "15 ამ ხალხს მისი წინამძღოლნი გზა-კვალს ურევენ და მათგან გაძღოლილნი იკარგებიან. "},
	{16, "16 ამიტომაც თავის ჭაბუკებზე არ ხარობს უფალი და ქვრივ-ობლებს არ იბრალებს, რადგან ყველანი უკეთურნი და ბოროტეულნი არიან, და ყოველი პირი სიბილწეს ლაპარაკობს. მაინც არ დამცხრალა მისი რისხვა და კვლავ მოღერებულია მისი ხელი. "},
	{17, "17 რადგან აღიგზნო ბოროტება, როგორც ცეცხლი, ძეძვისა და ნარ-ეკლის შემჭმელი, აბრიალდება უსიერ ტევრში და აღიმართება კვამლის სვეტები. "},
	{18, "18 ცაბაოთ უფლის რისხვისაგან დაბნელდება მიწა და ხალხი ცეცხლის კერძი შეიქნება, ერთი მეორეს არ დაინდობს. "},
	{19, "19 მარჯვნივ გამოგლეჯს, მშიერი დარჩება; მარცხნივ შეჭამს, ვერ გაძღება. ყველანი თავის მკლავის ხორცს დაუწყებენ ჭამას. "},
	{20, "20 მენაშე ეფრემს, ეფრემი მენაშეს, ორივენი ერთად იუდას ესხმის. მაინც არ დამცხრალა მისი რისხვა და კვლავ მოღერებულია მისი ხელი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct ka10 poems[] = {
	{1, "1 ვაი უსამართლო განაჩენის გამომტანთ და უკანონო მსჯავრისმდებელთ, "},
	{2, "2 სამართლისგან რომ განარიდებენ ღარიბ-ღატაკთ, ამტყუნებენ ჩემი ერის ჩაგრულს, ქვრივებს ნადავლად იტაცებენ და ობლებს ძარცვავენ! "},
	{3, "3 რას იზამთ განკითხვისა და დაქცევის დღეს, შორიდან რომ მოდის? ვისთან გაიქცევით შეწევნისთვის და თქვენს დიდებას სად დატოვებთ? "},
	{4, "4 ვინ სად ჩაიჩოქებს ტყვეთა შორის, ვინ სად დაეცემა დახოცილთა შორის! მაინც არ დამცხრალა მისი რისხვა და კვლავ მოღერებულია მისი ხელი. "},
	{5, "5 ვაი აშურს, კვერთხს ჩემი რისხვისა! კეტი მათ ხელში ჩემი გულისწყრომაა. "},
	{6, "6 უღვთო ხალხის წინააღმდეგ გავგზავნი და ჩემი რისხვის ხალხზე გალაშქრებას ვუბრძანებ, რომ დაატყვევოს და გაძარცვოს, გათელოს ქუჩის ტალახივით. "},
	{7, "7 მაგრამ ის ასე არ განსჯის და მისი გული ასე არ იზრახავს; არამედ განადგურებაა მის გულში და ხალხების ერთიანად მოსპობა. "},
	{8, "8 რადგან ამბობს: განა ჩემი მთავრები ყველანი მეფეები არ არიან? "},
	{9, "9 განა ქალნო და ქარქემიში ერთი არ არის? განა არფადი და ხამათი ერთი არ არის? განა დამასკო და სამარია ერთი არ არის? "},
	{10, "10 როგორც მისწვდა ჩემი ხელი კერპთა სამეფოებს, რომელთაც მეტი ჰყავთ ჩამოსხმული ღმერთები, ვიდრე იერუსალიმს და სამარიას; "},
	{11, "11 როგორც სამარიას და მის კერპებს მოვექეცი, განა ისევე არ მოვექცევი იერუსალიმს და მის სათაყვანებლებს? "},
	{12, "12 როცა მოათავებს უფალი ყველა თავის საქმეს სიონის მთაზე და იერუსალიმში, მაშინ მოვკითხავ აშურის მეფეს მისი დიდგულობის ნაყოფს - მის ქედმაღლურ მზერას. "},
	{13, "13 რადგან ნათქვამი აქვს: ჩემი ხელის ძალით ვქმენი ეს და ჩემი სიბრძნით, რადგან გამჭრიახი ვარ; მე გადავწიე ხალხთა სამანები და გავძარცვე მათი საგანძურები, ბუმბერაზივით ჩამოვყარე ტახტებზე მსხდომარენი. "},
	{14, "14 ბუდესავით მოძებნა ჩემმა ხელმა ხალხთა საბადებელნი; მიტოვებულ კვერცხებს რომ კრეფენ, ისე ავკრიფე მთელი ქვეყანა, ფრთა არ შერხეულა, პირი არ გაღებულა, ხმა არ დაძრულა. "},
	{15, "15 თუ ეყოყოჩება ცული მჩეხელს, თუ ედიდგულება ხერხი მხერხელს? ვითომ დაეღირება კვერთხი მის მომქნევს, ვითომ თავისით აღიმართება კეტი, თითქოს ხე არ იყოს? "},
	{16, "16 ამიტომ სიმჭლევეს მოუვლენს მეუფე, ცაბაოთ უფალი მის ნასუქალებს და მისი დიდების ქვეშ ცეცხლის ხანძარივით ატყდება ხანძარი. "},
	{17, "17 ცეცხლად გადაიქცევა ისრაელის ნათელი და ხანძრად - მისი წმიდა, ერთ დღეში დაწვავს და გადაბუგავს მის ძეძვს და ნარ-ეკალს. "},
	{18, "18 გაანადგურებს სულით ხორცამდე მისი ჭალების და ბაღ-ვენახების დიდებას, ჩაჭკნება და ჩაიხაშმება. "},
	{19, "19 გამეჩხერდება მისი მაღნარი და ბავშვიც კი დაითვლის დარჩენილ ხეებს. "},
	{20, "20 იმ დღეს აღარ დაენდობა ისრაელის ნატამალი და იაკობის სახლის ნარჩომი თავის მგვემელს; უფალს, ისრაელის წმიდას, დაენდობა დარწმუნებით. "},
	{21, "21 ნატამალი დაუბრუნდება, იაკობის ნატამალი ძლიერ ღმერთს! "},
	{22, "22 თუმცა ზღვის ქვიშასავით იქნება შენი ერი, ისრაელ, მაგრამ ნატამალი დაუბრუნდება მას. გადაწყვეტილია დაქცევა - შურისმგებელი სამართლიანობა. "},
	{23, "23 რადგან გადაწყდა ეს დაქცევა და აღასრულებს მეუფე, ცაბაოთ უფალი მთელ ქვეყანაზე. "},
	{24, "24 ამიტომ ასე ამბობს მეუფე, ცაბაოთ უფალი: ნუ გეშინია აშურისა, ჩემო ერო, სიონის მკვიდრო! კვერთხით გცემს და კეტს გიღერებს, როგორც ეგვიპტელნი იქცეოდნენ. "},
	{25, "25 რადგან, სულ ცოტაც და, შეწყდება გულისწყრომა და ჩემი რისხვა მათ დასაქცევად აღინთება. "},
	{26, "26 მოუქნევს მას ცაბაოთ უფალი შოლტს, როგორც მიდიანს დასცხო ყორების კლდესთან და აღიმართება წყალზე მისი კვერთხი, როგორც ეგვიპტეში აღმართა. "},
	{27, "27 იმ დღეს ჩამოგეხსნება მისი ტვირთი მხრებიდან და მისი უღელი ქედიდან, და გასკდება უღელი სიმსუქნისგან. "},
	{28, "28 ის მიდის ყაიათში, ჩაუვლის მიგრონს, მიქმასში საჭურველს გადაინახავს; "},
	{29, "29 გაივლის კლდეკარს, გებაყში გაათევს ღამეს, რამა შეძრწუნდება, საულის გიბყა გაიფანტება. "},
	{30, "30 აყიჟინდი შენს ხმაზე, გალიმის ასულო! გესმოდეს, ლაიშა, ბედშავო ყანათოთო! "},
	{31, "31 მადმენა გაიქცა, გებიმელებმა თავს უშველეს. "},
	{32, "32 კიდევ ერთი დღით ნობში დაყოვნდება, ხელს მოუღერებს სიონის ასულის მთას, იერუსალიმის ბორცვს. "},
	{33, "33 აჰა, მეუფე, ცაბაოთ უფალი, ზარდაცემით ლეწავს რტოებს; ტანმაღალნი გაიჩეხებიან და აღზევებულნი დაემხობიან. "},
	{34, "34 გაკაფავს რკინით ტყის უღრანს და დაეცემა ლიბანი ძლიერის ხელით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct ka11 poems[] = {
	{1, "1 ამოვა ყლორტი იესეს ღეროდან და მისი ფესვის ამონაყარი გაიხარებს. "},
	{2, "2 დაივანებს მასზე უფლის სული, სული სიბრძნისა და გონიერებისა, სული რჩევისა და სიმხნევისა, სული შეგნებისა და უფლის შიშისა. "},
	{3, "3 ის უფლის შიშით ისულდგმულებს, დანახულით არ განსჯის და გაგონილით არ დაიწყებს მხილებას. "},
	{4, "4 სიმართლით განსჯის ღარიბ-ღატაკთ, სისწორით განიკითხავს ქვეყნის ბედშავთ, დაჰკრავს მიწას თავის ბაგეთა კვერთხს და თავის პირისქარით ბოროტეულს მოაკვდინებს. "},
	{5, "5 სიმართლე იქნება სარტყლად მის წელზე და სიწრფელე სარტყლად მის ფერდებზე, "},
	{6, "6 დადგება მგელი ცხვართან ერთად და ვეფხვი დაბინავდება ციკანთან ერთად. ხბო, ლომი და ნასუქალი პირუტყვი ერთად იქნებიან და ჩვილი ბავშვი წაუძღვება მათ. "},
	{7, "7 ძროხა და დედადათვი ერთად მოსძოვენ და მათა შვილები ერთმანეთის გვერდით დაწვებიან, ლომი ძროხასავით შეჭამს ჩალას. "},
	{8, "8 ძუძუთა ბავშვი უნასის ხვრელთან ითამაშებს და ძუძუანასხლეტი ასპიტის ბუდეში ჩაყოფს ხელს. "},
	{9, "9 არავინ იბოროტებს და არავინ იბილწებს მთელ ჩემ წმიდა მთაზე, რადგან აივსება მიწა უფლის ცოდნით, როგორც ზღვა არის წყლებით დაფარული. "},
	{10, "10 იმ დღეს ხალხთა დროშად იდგება იესეს ფესვი და მისკენ დაიწყებენ დენას ტომები; დიდება იქნება მისი საშვებელი. "},
	{11, "11 იმ დღეს მეორედ გაიწვდის უფალი ხელს, რომ გამოისყიდოს თავისი ერის ნატამალი, რომელიც გადაურჩება აშურს, ეგვიპტეს, ფატროსს, ქუშს, ელამს, შინეყარს, ხაბათს და ზღვისპირეთს. "},
	{12, "12 დროშას აღუმართავს ხალხებს, შეკრებს გადახვეწილ ისრაელს და ქვეყნის ოთხივე კუთხიდან თავს მოუყრის გაფანტულ იუდას. "},
	{13, "13 გაქარწყლდება ეფრემის შური და იუდას მტრები აღარ იქნებიან, ეფრემს აღარ შეშურდება იუდასი და იუდა აღარ უმტრობს ეფრემს. "},
	{14, "14 მხარდამხარ გაფრინდებიან ფილისტიმელთაკენ დასავლეთით, ერთად გაძარცვავენ აღმოსავლეთლებს, ხელს დაადებენ ედომს და მოაბს, და ყამონელნი მათი მორჩილნი გახდებიან. "},
	{15, "15 ამოაშრობს უფალი ეგვიპტის ზღვის სრუტეს, ხელს აღმართავს მდინარეზე თავის ქარტეხილში, შვიდ ტოტად განწვალავს მას, რომ ფეხშემოსილმა გადაიაროს. "},
	{16, "16 გამოუჩნდება გზა-სავალი მისი ერის ნატამალს, რომელიც აშურს გადაურჩება, როგორც გამოუჩნდა ისრაელს, როცა ეგვიპტიდან ამოდიოდა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct ka12 poems[] = {
	{1, "1 შენ იტყვი იმ დღეს: გმადლობ, უფალო, რომ განმირისხდი; რომ დაცხრა შენი რისხვა და მანუგეშე. "},
	{2, "2 აჰა, ღმერთია ჩემი ხსნა, ვესავ და არ მეშინია, რადგან უფალია ჩემი ძალა და სიმღერა, უფალი! ის იყო ჩემი მხსნელი. "},
	{3, "3 სიხარულით ამოხაპავთ წყალს ხსნის წყაროებიდან. "},
	{4, "4 იტყვით იმ დღეს: მადლობდეთ უფალს, ახსენებდეთ მის სახელს, აცხადებდეთ მის საქმეებს ხალხებში, გაახსენებდეთ რომ მაღალია მისი სახელი. "},
	{5, "5 უმღერეთ უფალს, რადგან დიდებულად იღვაწა, მთელ ქვეყანას მოედო ეს ამბავი. "},
	{6, "6 იხარე და იზეიმე, სიონის ასულო, რადგან დიდია თქვენ შუაგულში ისრაელის წმიდა! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct ka13 poems[] = {
	{1, "1 განაჩენი ბაბილონისა, რომელიც იხილა ესაიამ, ამოცის ძემ: "},
	{2, "2 ხმელ გორზე აღმართეთ დროშა, ხმამაღლა გასძახეთ, ხელი დაუქნიეთ, რომ შემოვიდნენ მთავართა კარიბჭით. "},
	{3, "3 მე ვუბრძანე ჩემს განწმედილთ, მოვუხმე კიდეც ჩემს ძლიერთ ჩემი რისხვისათვის, ჩემი სიდიადით მოზეიმეთ. "},
	{4, "4 მთებზე გუგუნია, თითქოს მრავალი ხალხისაგან, ერთად თავშეყრილი ხალხების სამეფოთა ჟრიამული; ცაბაოთ უფალი თავად ათვალიერებს საომრად გამზადებულ ლაშქარს. "},
	{5, "5 შორი ქვეყნებიდან, ცის კიდიდან მოდიან, უფალი და მისი რისხვის იარაღი მთელი ქვეყნის დასაქცევად. "},
	{6, "6 მოთქვამდეთ, რადგან ახლოვდება უფლის დღე, მოდის როგორც რბევა ყოვლადძლიერისგან. "},
	{7, "7 ამიტომაც დაუძლურდა ყოველი მკლავი და ყოველი კაცის გული შემდრკალია. "},
	{8, "8 შიშისზარი აქვთ, კრუნჩხვებმა და ტკივილებმა შეიპყრეს, მშობიარე ქალივით იტანჯებიან, გაოგნებულნი შეჰყურებენ ერთმანეთს, სახეზე ცეცხლი ეკიდებათ. "},
	{9, "9 აჰა, დადგა უფლის დღე - დღე სასტიკი, დღე რისხვისა და გაცეცხლებისა ქვეყნიერების იავარსაყოფად და ცოდვილთა წარსახოცად მისი პირისაგან. "},
	{10, "10 რადგან ცის ვარსკვლავები და მისი ხომლი ჩაქრებიან, დაბნელდება ამომავალი მზე და მთვარე აღარ მოაფენს თავის ნათელს. "},
	{11, "11 მოვკითხავ ქვეყნიერებას მის სიავეს და ბოროტეულთ - მათ დანაშაულს; ბოლოს მოვუღებ ამპარტავანთა ქედმაღლობას და მტარვალთა სიამაყეს დავამდაბლებ. "},
	{12, "12 დავაფასებ კაცს ხალას ოქროზე მეტად და ადამიანს - ოფირის ზოდზე მეტად. "},
	{13, "13 ამიტომაც შევაზანზარებ ცას და შეირყევა დედამიწა თავისი ადგილიდან ცაბაოთ უფლის გულისწყრომისას და მისი რისხვის ანთების დღეს. "},
	{14, "14 შეიქნებიან დევნილი ქურციკებივით და უმწყემსოდ დარჩენილ ფარასავით; ყველა თავის ხალხს მიაშურებს, ყველა თავის ქვეყნისკენ გაიქცევა. "},
	{15, "15 ვისაც მიასწრებენ, განგმირავენ, ვისაც დაიჭერენ, მახვილით დასცემენ. "},
	{16, "16 მათი ჩვილები მათ თვალწინ გაიჭეჭყებიან, მათი სახლები გაიძარცვება, მათი ცოლები გაუპატიურდებიან. "},
	{17, "17 აჰა, აღვძრავ მათზე მიდიელებს, რომლებიც ვერცხლს არად აგდებენ და ოქრო არ ახარებთ. "},
	{18, "18 მათი მშვილდები ყმაწვილკაცებს შემუსრავს; მუცლის ნაყოფს არ შეიწყალენენ, ბავშვებს არ შეიბრალებს მათი თვალი. "},
	{19, "19 ბაბილონი - სამეფოთა მშვენება, ქალდეველთა დიდების სამკაული, დაემსგავსება უფლისგან დაქცეულ სოდომს და გომორას. "},
	{20, "20 არასოდეს გაკაცრიელდება და არ გაშენდება უკუნისამდე; არაბი არ დაიკარვებს იქ და არც მწყემსები დაიბინავებენ. "},
	{21, "21 უდაბნოს მხეცები გაიჩენენ იქ ბუნაგს და მიკიოტებით აივსება მათი სახლები, სირაქლემები დასახლდებიან იქ და ალქაჯები გათელავენ იქაურობას. "},
	{22, "22 ტურები მოჰყვებიან კივილს გაოხრებულ სასახლეებში და ველური ძაღლები აყმუვლდებიან მის საზეიმო დარბაზებში; მოაწევს მისი ჟამი და მისი დღეები აღარ გაგრძელდება. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct ka14 poems[] = {
	{1, "1 რადგან შეიწყალებს უფალი იაკობს და კიდევ გამოარჩევს ისრაელს, მათსავე მიწაზე დაასახლებს. უცხონი შეეთვისებიან მათ და მიემაგებიან იაკობის სახლს. "},
	{2, "2 აიყვანენ მათ ხალხები და მიიყვანენ თავიანთ ადგილზე, დაისაკუთრებს მათ ისრაელი უფლის მიწაზე მონებად და მხევლებად, დაატყვევებენ თავიანთ დამატყვევართ და თავიანთ მჩაგვრელებზე იბატონებენ. "},
	{3, "3 იმ დღეს, როცა ამოგასუნთქებს უფალი ჭირ-ვარამისგან და შფოთისაგან, და მძიმე სატანჯველისგან, რომლითაც იტანჯები. "},
	{4, "4 წარმოთქვამ ამ იგავს ბაბილონის მეფეზე და იტყვი: როგორ მოეღო ბოლო მტარვალს! როგორ მოეღო ბოლო მძლავრობას! "},
	{5, "5 როგორ შემუსრა უფალმა უკეთურთა არგანი, ხელმწიფეთა კვერთხი, "},
	{6, "6 რისხვით რომ სცემდა ხალხებს შეუსვენებლივ, ბრაზით რომ იმონებდა ტომებს, დაუოკებლად დევნიდა მათ! "},
	{7, "7 დაისვენა, დამყუდროვდა მთელი ქვეყანა, მხიარულად ყიჟინობს. "},
	{8, "8 ალვები ხარობენ შენს გამო, ლიბანის ნაძვები: რა რომ შენ გდიხარ, ხის მჭრელი აღარ ამოსულა ჩვენთან. "},
	{9, "9 ქვესკნელამდე შეიძრა შავეთი შენს შესახვედრად, გააღვიძა აჩრდილნი, მიწის მთავარნი; წამოაყენა მათი ტახტებიდან ხალხთა მეფენი. "},
	{10, "10 ყველანი ალაპარაკდებიან და გეტყვიან: შენც ჩვენსავით დაუძლურდი, ჩვენ დაგვემსგავსე. "},
	{11, "11 შავეთს ჩაინთქა შენი დიდება, შენი ქნარების ხმა; ქვეშ მატლი გიგია, და ზედ ჭიაღუა გახურავს. "},
	{12, "12 როგორ ჩამოემხე ციდან, მთიებო, ძეო განთიადისა! მიწას დაენარცხე, ხალხთა მტარვალო! "},
	{13, "13 გუშინ ამბობდი: ცად ავხდები, ღვთის ვარსკვლავთა ზემოთ ტახტს დავიდგამ და დავჯდები საკრებულო მთაზე, ჩრდილო კალთებზე. "},
	{14, "14 მაღლა ღრუბლებში ავიჭრები, უზენაესს გავუტოლდებიო! "},
	{15, "15 მაგრამ შავეთში ჩადიხარ, ქვესკნელის უფსკრულებში. "},
	{16, "16 შენი შემხედვარი მოგაშტერდება, ჩაფიქრდება: ეს ის კაცია, მიწას რომ არყევდა, სამეფოებს რომ აზანზარებდა? "},
	{17, "17 ქვეყანას რომ უდაბნოდ აქცევდა, ქალაქებს ანგრევდა და თავის ტყვეებს შინ არ აბრუნებდა? "},
	{18, "18 ხალხთა ყოველი მეფე, ყველანი დიდებაში განისვენებენ, თავთავის სახლებში. "},
	{19, "19 შენ კი უსაფლავოდ გდიხარ, როგორც საძულველი, უდროული ნაშობი, როგორც დახოცილთა, მახვილით განგმირულთა სამოსელი, ქვიან ორმოში ჩაგდებული, როგორც გათელილი გვამი. "},
	{20, "20 ვერ შეუერთდები მათ საფლავში, რადგან დაღუპე შენი ქვეყანა და ამოწყვიტე შენი ხალხი; აღარ მოიხსენება ბოროტეულთა თესლი სამარადისოდ. "},
	{21, "21 საკლავად განამზადე მისი შვილები მამების ცოდვებისთვის, რომ არ აღდგნენ და არ დაიმკვიდრონ ქვეყანა, მტრებით არ აავსონ. მიწის პირი. "},
	{22, "22 აღვდგები მათ წინააღმდეგ, ამბობს ცაბაოთ უფალი, და აღმოვუფხვრი ბაბილონს სახელს და ნატამალს, მონაგარს და მისხისმისხს, ამბობს უფალი. "},
	{23, "23 ზღარბთა და ჭანჭყობთა სამკვიდროდ გავხდი და განადგურების ცოცხით გავხვეტავ, ამბობს ცაბაოთ უფალი. "},
	{24, "24 დაიფიცა ცაბაოთ უფალმა და თქვა: როგორც ჩავიფიქრე, ისე იქნება; როგორც გადავწყვიტე, ისე მოხდება. "},
	{25, "25 შევმუსრავ აშურს ჩემს მიწაზე და გავთელავ ჩემს მთებზე, გადაიგდება ქედიდან უღელი და მხრებიდან ტვირთი ჩამოეხსნებათ. "},
	{26, "26 აჰა, განაჩენი, მთელი ქვეყნისათვის გამოტანილი, და აჰა ხელი, ყოველ ხალხზე მოღერებული! "},
	{27, "27 ცაბაოთ უფლის განაჩენს ვინ შეცვლის და მოღერებულ ხელს ვინ შეაბრუნებს? "},
	{28, "28 ასეთი განაჩენი იყო მეფე ახაზის სიკვდილის წელს. "},
	{29, "29 ნუ გიხარია, ფილისტიმის ქვეყანავ, რომ დაილეწა შენი მგვემელის კვერთხი, რადგან გველის ფესვიდან გამოვა უნასი და მისი ნაშიერი მფრინავი გველეშაპი იქნება. "},
	{30, "30 უპოვართა პირმშონი გამოიკვებებიან და ღარიბ-ღატაკნი სამშვიდობოს დამყუდრდებიან; შიმშილით მოვკლავ შენს ფესვს და შენს ნარჩომს ამოვწყვიტავ. "},
	{31, "31 მოთქვამდე, კარიბჭევ, გოდებდე, ქალაქო, ძრწოდე, ფილისტიმის ქვეყანავ, რადგან ჩრდილოეთიდან წამოვა კვამლი და გაიფანტება მისი ბანაკი. "},
	{32, "32 რას იტყვიან ხალხის მოციქულები? - რომ უფალმ აფუძნა სიონი და რომ იქ არის მისი ერის ჩაგრულთა საესავი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct ka15 poems[] = {
	{1, "1 მოაბის განაჩენი. იმ ღამით, როცა გაძარცვეს ყარი, გაცამტვერდა მოაბი, რადგან იმ ღამით გაძარცვეს კირი, გაცამტვერდა მოაბი. "},
	{2, "2 ავიდა ტაძრად და დიბონში, გორაკებზე სატირლად; ნებოზე და მედებაზე გოდებს მოაბი; ყველას თავი გადაპარსული აქვს, წვერები ყველას მოკვეცილი აქვს. "},
	{3, "3 ქუჩებში ჯვალო არტყიათ, ბანებზე და მოედნებზე ყველა გოდებს, ცრემლად იღვრებიან. "},
	{4, "4 კივის ხეშბონი და ელყალე, იაჰაცას წვდება მათი ხმა; ამიტომ აყვირდნენ მოაბის მებრძოლები, შეშფოთებულია მისი სული. "},
	{5, "5 ჩემი გული კვნესის მოაბზე, მისი დევნილნი ცოღარში აფარებენ თავს, ყეგლათ-შელიშიაში; რადგან მოთქმა-მოთქმით მიჰყვებიან ლუხითის აღმართს, რადგან განწირული ხმით კივიან ხორონაიმის გზაზე. "},
	{6, "6 რადგან გაოხრდა ნიმრიმის წყლები, რადგან დაჭკნა ბალახი, განადგურდა მდელო, მწვანე აღარ არის. "},
	{7, "7 ამიტომ ტირიფთა ხევიც კი წაიღებს მათ ნარჩენებს და მარაგს. "},
	{8, "8 დაუარა მოთქმამ მოაბის საზღვრებს, გოდება მისწვდა ეგლაიმს და გოდება მისწვდა ბეერ-ელიმს. "},
	{9, "9 რადგან სისხლით აივსო დიმონის წყლები, რადგან ამას არ ვაკმარებ დიმონს, ლომებს მივუსევ მოაბის ნარჩომს და მიწის ნატამალს! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct ka16 poems[] = {
	{1, "1 გაუგზავნეთ კრავი ქვეყნის მპყრობელს სელაყიდან სიონის ასულის მთაზე უდაბნოს წიაღ! "},
	{2, "2 ბუდემოშლილი, დევნილი ფრინველივით იქნებიან მოაბის ასულნი არნონის ფონებთან. "},
	{3, "3 მიეცი რჩევა, ქმენი სამართალი, გადმოაფარე შენი ჩრდილი შუადღისას, როგორც ღამით; დაიფარე ლტოლვილი, ნუ გასცემ დევნილს. "},
	{4, "4 შეგეხიზნონ ჩემი ლტოლვილი მოაბელები, შეიფარე ყაჩაღებისგან, ვიდრე არ შეწყდება მძლავრობა, ვიდრე ბოლო არ მოეღება ყაჩაღობას, ვიდრე დამთრგუნველი არ გადაშენდება ამ ქვეყნიდან, "},
	{5, "5 და წყალობით დამყარდება ტახტი და რწმენით დაჯდება მასზე დავითის კარავში მსაჯული, მსჯავრის მძებნელი და მოსწრაფე სამართლის ქმნაში. "},
	{6, "6 გვსმენია მოაბის ყიფი, მეტისმეტი სიამაყე, მისი ქედმაღლობა, მისი მედიდურობა, მისი სიცოფე, ფუჭი ქადილი. "},
	{7, "7 ამიტომ ივალალოს მოაბმა, ყველამ ივალალოს მოაბზე. იგლოვეთ კირ-ხარესეთის ტყლაპები, განადგურებულნო! "},
	{8, "8 რადგან გადახმა ხეშბონის ყანები, სიბმას ვენახები; ხალხთა მბრძანებლებმა აკაფეს მისი რჩეული ვაზი, იაყზერამდე, უდაბნოში რომ მიიკლაკნებოდა, მისი გაშლილი რტოები ზღვის გაღმა რომ უწვდენდა. "},
	{9, "9 ამიტომ დავიტირებ იაყზერის ტირილით სიბმას ვენახს, ჩემი ცრემლებით მოგრწყავთ, ხეშბონო და ელყალე, რადგან თქვენს რთველში და მკაში ჩამწყდარია ჰედადის ძახილი. "},
	{10, "10 ლხენა და სიხარული წაერთვა ქარმელს და ვენახებში აღარ გაისმება სიმღერა და გუგუნი, საწნახლებში ღვინოს აღარ წურავენ; შევწყვიტე ჰედადის ძახილი. "},
	{11, "11 ამიტომაც ქნარივით თრთის ჩემი შიგნეული მოაბზე და ჩემი გული - კირ-ხარესზე. "},
	{12, "12 აჰა, გამოჩნდება დაქანცული მოაბი გორაკზე და შევა თავის საწმიდარში სალოცავად, მაგრამ არაფერი ეშველება. "},
	{13, "13 ეს არის სიტყვა, რომელიც რა ხანია წარმოთქვა უფალმა მოაბზე. "},
	{14, "14 ახლა კი ასე ამბობს უფალი: სამ წელიწადში, ქირავნობის ვადაში, დამცირდება მოაბის დიდება, თუმცა დიდია სიმრავლე მათი და მცირედიღა იქნება ნარჩომი, არად ჩასაგდები. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct ka17 poems[] = {
	{1, "1 დამასკოს განაჩენი. აჰა, წაერთმევა დამასკოს ქალაქობა და ნანგრევების გროვად იქცევა! "},
	{2, "2 გაუდაბურდება ყაროყერის ქალაქები, ცხვრის ფარათა საძოვრებად იქცევა, დაწვებიან და ვერავინ დააფრთხობს მათ. "},
	{3, "3 არაფერი დარჩება ეფრემის ციხე-სიმაგრისგან, დამასკოს სამეფოსგან და არამის ნატამალისგან, ისრაელიანთა დიდებას გაჰყვებიან, ამბობს ცაბაოთ უფალი. "},
	{4, "4 იმ დღეს დაილევა იაკობის დიდება და მისი მსუქანი ხორცი დამჭლევდება. "},
	{5, "5 იქნება ისე, თითქოს მომკელს აეღოს ყანა და მისი მკლავს მოემკას თავთავები; იქნება ისე, როგორც რეფაიმის ველზე თავთავები იკრიფება. "},
	{6, "6 დარჩება ნამცვრევი, რამდენიც რჩება ზეთისხილის ჩამობერტყვის შემდეგ: ორი, სამი მარცვალი წვერში, ოთხი, ხუთი მსხმოიარე ტოტებზე! ამბობს უფალი, ღმერთი ისრაელისა. "},
	{7, "7 იმ დღეს მიიხედავს ადამიანი თავისი შემოქმედისკენ და თვალებს მიაპყრობს ისრაელის წმიდას. "},
	{8, "8 აღარ მიხედავს თავისი ნახელავი სამსხვერპლოებისკენ და თავისი თითებით ნაკეთებ აშერებს და მზეებს აღარ მოიკითხავს. "},
	{9, "9 იმ დღეს უღრან და გაუვალ ტყეს დაემსგავსება მისი გამაგრებული ქალაქები, ისრაელიანთაგან მიტოვებული, და გაუდაბურდება. "},
	{10, "10 რადგან დავიწყებული გყავს შენი ხსნის ღმერთი და კლდე შენი სიმტკიცისა აღარ გახსოვს; რადგან გაგიშენებია ნეტარების ბაღები და უცხო ვაზი ჩაგიყრია. "},
	{11, "11 იმ დღეს ააღორძინებს შენს დარგულს და იმ დილას ააყვავებ შენს დათესილს, მაგრამ ალოობისას უკურნებელ მწუხარებას მოიმკი. "},
	{12, "12 ვაი, ხმაურს დიდძალი ხალხისა! ხმაურობენ ზღვის ხმაურით. ვაი, ხალხების ღრიალს! ღრიალებენ ადიდებული წყლის ღრიალით. "},
	{13, "13 ხალხები ღრიალებენ ადიდებული წყლის ღრიალით; დააფრთხობს მათ და შორს გაიქცევიან, გაიხვეტებიან, ქარისაგან, როგორც მთაზე თივის ბულული და ბზის მტვერი ქარბორბალასგან. "},
	{14, "14 დადგება მწუხრი და, აჰა, დაეცემა შიშისზარი და განთიადამდე ვეღარ გაძლებს. ასეთია ჩვენი მტარვალების ხვედრი და ჩვენი მძარცველების წერა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct ka18 poems[] = {
	{1, "1 ვაი, ქვეყანას, ფრთებმოშრიალეს, ქუშის მდინარეთა გაღმა! "},
	{2, "2 ზღვით რომ აგზავნით მალემსრბოლებს წყალზე მოცურავე ლერწმის - ნავებით! გასწით, მკვირცხლთ მოციქულნო, მოჭიმულ და ალესილ ხალხთან, საშიშარ ერთან დასაბამიდან დღესამომდე, ხალხთა დამთრგუნველთან და გამთელავთან, რომლის ქვეყანას ხევები სერავენ! "},
	{3, "3 ქვეყნიერების მკვიდრნო და მიწის ბინადარნო, თვალი გეჭიროთ, როცა დროშა აღიმართება მთებზე და ყური უგდეთ, როცა ბუკს დაჰკრავენ! "},
	{4, "4 რადგან ასე მითხრა უფალმა: მე მშვიდად გადმოვიხედავ ჩემი სამყოფლიდან ხვატის კაშკაშივით მოწმენდილზე, ნამის ღრუბელივით მკის პაპანებაში; "},
	{5, "5 რადგან რთველის წინ, როცა გადასული იქნება ყვავილობა და ნაყოფი დამწიფებული, დანით აკაფავს ლერწმებს და ყლორტებს მოაშორებს ვაზს. "},
	{6, "6 ყველაფერი მთის ონავარ ფრინველებს და მიწის მხეცებს დარჩებათ; დაიზაფხულებენ იქ ონავარი ფრინველები და მიწის ყოველი მხეცი იქ დაიზამთრებს. "},
	{7, "7 იმ დღეს ძღვენს მიართმევს ცაბაოთ უფალს ცაბაოთ უფლის სახელის ადგილზე, სიონის მთაზე, მოჭიმული და ალესილი ერი, დასაბამიდან დღესამომდე საშიშარი ერი, ხალხი დამთრგუნველი და გამთელავი, რომლის ქვეყანას ხევები სერავენ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct ka19 poems[] = {
	{1, "1 ეგვიპტის განაჩენი. აჰა, ამხედრებულია უფალი მსუბუქ ღრუბელზე და მიდის ეგვიპტეში. შეირყევიან მის წინაშე ეგვიპტის კერპები და დაუდნებათ მკერდში ეგვიპტელებს გულები. "},
	{2, "2 ავამხედრებ ეგვიპტელს ეგვიპტელზე: ძმა ძმას დაუწყებს ბრძოლას, მოყვასი მოყვასს, ქალაქი ქალაქს, სამეფო სამეფოს. "},
	{3, "3 დაიშრიტება ეგვიპტის სული მის წიაღში და ჩავფუშავ მის თათბირს; კერპებს, მჩხიბავებს, მესულთანეებს და ჯადოქრებს დაუწყებენ ძებნას სამკითხაოდ. "},
	{4, "4 ჩავაგდებ ეგვიპტელებს სასტიკი ბატონის ხელში და მტარვალი მეფე იხელმწიფებს მათზე, ამბობს მეუფე, ცაბაოთ უფალი. "},
	{5, "5 წყალი დაწყდება ზღვაში, ნილოსი დაიწრიტება და დაშრება, "},
	{6, "6 მდინარეები ამყრალდება, დაიკლებს და დაშრება ეგვიპტის არხები, დაჭკნება ლელი და ლერწამი. "},
	{7, "7 გადაშიშვლდება მდინარეთა ნაპირები და მდინარეთა შესართავები, გადახმება ჭალებში ნათესი, განქარდება და გაცამტვერდება. "},
	{8, "8 დაღონდებიან მეთევზეები, აკვნესდებიან მდინარეში ანკესის მსროლელნი და წყლებზე ბადეთა გამშლელნი დაიწყებენ გოდებას. "},
	{9, "9 შერცხვებიან ვარცხნილი სელის მკეთებელნი და მაქმანების მქსოველნი. "},
	{10, "10 დაილეწება მისი დაზგები, ქირის მუშები დამწუხრდებიან. "},
	{11, "11 შეიშალნენ ცოყანის მთავრები, გაცუდდა ფარაონის ბრძენი მრჩევლების თათბირი. როგორღა ეტყვით ფარაონს: ბრძენთა შვილი ვარ მე, აღმოსავლეთის მეფეთა შვილიო? "},
	{12, "12 სად არიან შენი ბრძენები, რომ გამცნონ და გაგაგებინონ, რა გადაუწყვიტა ცაბაოთ უფალმა ეგვიპტეს? "},
	{13, "13 გაბრიყვდნენ ცოყანის მთავრები, მოტყუვდნენ ნოფის მთავრები. შეაცდინეს ეგვიპტე მისი ტომების თავკაცებმა. "},
	{14, "14 რეტი დაასხა მათ უფალმა და აატორტმანეს ეგვიპტე ყველა საქმეში, როგორც რწყევისას ტორტმანებს მთვრალი. "},
	{15, "15 არაფერი ექნება ეგვიპტეს გასაკეთებელი, რისი გაკეთებაც თავსა და კუდს, შტოსა და ღეროს შეეძლება. "},
	{16, "16 იმ დღეს დიაცებივით იქნებიან ეგვიპტელები, შეშინდებიან და დაფრთხებიან ცაბაოთ უფლის ხელის მოქნევისგან, მათზე რომ მოიქნევს ხელს. "},
	{17, "17 შიშისზარად ექცევა ეგვიპტეს იუდას მიწა; ყველას, მის გამხსენებელს, შეაძრწუნებს ცაბაოთ უფლის განაჩენი, მასზე რომ განაჩინა. "},
	{18, "18 იმ დღეს ხუთი ქალაქი იქნება ეგვიპტეში, ქანაანურად მოლაპარაკე და ცაბაოთ უფლის დამფიცებელი; ერთს დაერქმევა მზის ქალაქი. "},
	{19, "19 იმ დღეს იქნება უფლის სამსხვერპლო ეგვიპტის ქვეყნის შუაგულში და უფლის სვეტი მის საზღვართან. "},
	{20, "20 იქნება ეს ცაბაოთ უფლის ნიშად და სასწაულად ეგვიპტის ქვეყანაში, რადგან შეღაღადეს უფალს დამთრგუნველთა გამო და მოუვლენს უფალი მაცხოვარს და პატრონს და იხსნის მათ. "},
	{21, "21 გამოეცხადება უფალი ეგვიპტელებს და შეიცნობენ ეგვიპტელები უფალს იმ დღეს; შესწირავენ მსხვერპლსა და ძღვენს, აღუთქვამენ აღთქმებს და აღასრულებენ კიდეც. "},
	{22, "22 დაჰკრავს უფალი ეგვიპტეს, დაჰკრავს და განკურნავს კიდეც; მიიქცევიან უფლისაკენ, შეიწყნარებს მათ და განკურნავს. "},
	{23, "23 იმ დღეს გზა გავა ეგვიპტიდან აშურამდე და ივლის აშური ეგვიპტეში და ეგვიპტე აშურში; დაემონება ეგვიპტე უფალს აშურთან ერთად. "},
	{24, "24 იმ დღეს მესამე იქნება ისრაელი ეგვიპტესთან და აშურთან ერთად; კურთხევა იქნება ქვეყნის შუაგულში, "},
	{25, "25 რადგან ბრძანებს კურთხევას ცაბაოთ უფალი: კურთხეულ იყოს ჩემი ერი ეგვიპტე, ჩემ ხელთა ქმნილება აშური და ჩემი სამკვიდრო ისრაელი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct ka20 poems[] = {
	{1, "1 იმ წელს მოადგა აშდოდს აშურის მეფის, სარგონის გამოგზავნილი დართანი, ბრძოლა გაუმართა აშდოდს და აიღო იგი. "},
	{2, "2 მაშინ გამოუცხადა უფალმა სიტყვა ესაიას, ამოცის ძეს, და უთხრა: წადი, შეიხსენი ჯვალო წელიდან და ხამლები გაიძვრე ფეხზე. ასეც მოიქცა: ტანშიშველმა და ფეხშიშველმა დაიწყო სიარული. "},
	{3, "3 თქვა უფალმა: როგორც ჩემი მორჩილი ესაია დადიოდა ტანშიშველი და ფეხშიშველი სამ წელიწადს, ასე იქნება ნიშად და სასწაულად ეგვიპტისთვის და ქუშისთვის. "},
	{4, "4 ასე წაასხამს აშურის მეფე ეგვიპტის ტყვეებს და ქუშის ლტოლვილებს - ჭაბუკებს და მოხუცებულთ, ტანშიშველთ და ფეხშიშველთ, უკანალგატიტვლებულთ ეგვიპტის შესარცხვენად. "},
	{5, "5 შეეშინდებათ და შერცხვებათ ქუშის გამო, მათი იმედისა, და ეგვიპტის გამო, მათი მშვენებისა. "},
	{6, "6 იტყვის ამ ზღვისპირეთის მცხოვრები იმ დღეს: აჰა, რის იმედზე ვყოფილვართ, შეწევნას რომ ვითხოვდით იქ აშურის მეფისგან თავის დასახსნელად! როგორ გადავრჩებით? "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct ka21 poems[] = {
	{1, "1 ზღვის უდაბნოს განაჩენი. სამხრეთში ამტყდარი გრიგალები, ის მოდის უდაბნოდან, საშინელი ქვეყნიდან. "},
	{2, "2 სასტიკი ხილვა გამომეცხადა: დამარბეველი არბევს და მძარცველი ძარცვავს. შეიმართე, ელამო, შემოადექ, მიდიავ! ბოლო მოვუღე ყოველ კვნესას. "},
	{3, "3 ამიტომ მიცახცახებს ნაწლავები, მშობიარის ტკივილებმა შემიპყრო, კრუნჩხვისაგან არაფერი მესმის, შეშფოთებისგან ვერაფერს ვხედავ. "},
	{4, "4 გული მითრთის, მზარავს შიში, სიამის საღამო ძრწოლად გადამექცა. "},
	{5, "5 ტაბლა გაშლილია, დაგებულია საგებელი; ჭამენ და სვამენ. აღდექით, მთავარნო, გაპოხეთ ფარები! "},
	{6, "6 რადგან ასე მითხრა უფალმა: მიდი, დააყენე დარაჯი. გამოაცხადოს, რასაც დაინახავს! "},
	{7, "7 ხედავს ეტლიონს, დაწყვილებულ ცხენოსნებს, სახედართა ეტლიონს, აქლემების ეტლიონს. აკვირდება, გულისყურით აკვირდება. "},
	{8, "8 იყვირა მჭვრეტელმა; საყარაულო კოშკზე ვდგავარ, უფალო, დღენიადაგ და ჩემს სადარაჯოზე ვარ მთელი ღამეები. "},
	{9, "9 აჰა, მოდის ეტლიონი, დაწყვილებული ცხენოსნები! კვლავ თქვა: დაეცა, დაეცა ბაბილონი და ყველა კერპი მისი ღმერთებისა მიწას დაენარცხა. "},
	{10, "10 ჩემო გალეწილო და განიავებულო, რაც ცაბაოთ უფლისგან, ისრაელის ღვთისგან, გავიგონე, ის გამოგიცხადეთ. "},
	{11, "11 დუმას განაჩენი. მე მომძახიან სეყირიდან: ყარაულო, ღამის რომელია? ყარაულო, ღამის რომელია? "},
	{12, "12 ამბობს ყარაული: დილა დგება და ღამეა მაინც. თუ კითხვა გინდათ, იკითხეთ; გაბრუნდით და ისევ მოდით! "},
	{13, "13 არაბთა განაჩენი. არაბთა ტყეში გაათიეთ ღამე, დედანის ქარავნებო! "},
	{14, "14 წყალი მიაგებეთ მწყურვალებს, თემას ქვეყნის მკვიდრნო, პურით დახვდით ლტოლვილებს. "},
	{15, "15 რადგან მახვილებს გაექცნენ, გალესილ მახვილებს, მოჭიმულ მშვილდს და ბრძოლის სასტიკებას. "},
	{16, "16 რადგან ასე მითხრა უფალმა: ერთ წელიწადში, ქარავნობის ვადაში, ბოლო მოეღება კედარის მთელ დიდებას. "},
	{17, "17 მცირეღა იქნება მამაც კედარელ მშვილდოსანთა დანარჩომი, რადგან უფალს, ისრაელის ღმერთს აქვს ნაბრძანები. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct ka22 poems[] = {
	{1, "1 ხილვის ხეობის განაჩენი. რა დაგემართათ, ყველანი რომ ბანზე გამოშლილხართ? "},
	{2, "2 გნიასით სავსევ, აჩოჩქოლებულო ქალაქო, შფოთიანო ქალაქო! შენი განგმირულნი მახვილით არ განგმირულან და ბრძოლაში არ დახოცილან. "},
	{3, "3 შენი მთავრები, ყველანი ერთად, მშვილდს გაექცნენ, ყველა შენი მოძიებული შებორკილია, ყველა შორს გაქცეული შებორკილია! "},
	{4, "4 ამიტომ ვთქვი: დამეხსენით, ტირილით გავმწარდები! არ მანუგეშოთ ჩემი ერის ასულის დაღუპვის გამო. "},
	{5, "5 რადგან ზრიალის, დგრიალის და ფორიაქის დღე ხილვის ხეობაში მეუფისგან, ცაბაოთ უფლისგანაა; გალავანს ანგრევს და კივილი მთას სწვდება. "},
	{6, "6 ელამს კაპარჭი მოაქვს, ეტლოსნები და მხედრები მოდიან, და კიროსმა ფარი გააშიშვლა. "},
	{7, "7 შენი რჩეული ყანები ეტლებმა აგივსეს და ცხენოსნები კარიბჭეს მიაწყდნენ. "},
	{8, "8 აეხადა საფარველი იუდას და შენ მოიკითხე იმ დღეს საჭურველი მაღნარის სახლში. "},
	{9, "9 ნახეთ, რომ ბევრია ნაპრალი დავითის ქალაქში და ქვემო ტბორში წყალი დააგუბეთ."},
	{10, "10 აღრიცხული გაქვთ სახლები იერუსალიმში და ანგრევთ სახლებს გალავნის გასამაგრებლად. "},
	{11, "11 მოაწყვეთ წყალსატევი ორ კედელს შორის ძველი ტბორის წყლისათვის, მაგრამ არად აგდებთ მის შემქმნელს, არ უყურებთ მას, ვინც დასახა იგი დიდი ხნის წინათ. "},
	{12, "12 იმ დღეს მოგიწოდათ მეუფემ, ცაბაოთ უფალმა, რომ გეტირათ და გეგლოვათ, თავი მოგეპარსათ და ჯვალო შემოგერტყათ წელზე. "},
	{13, "13 მაგრამ, აჰა, ლხინი და სიხარულია, ხარების ჟლეტა და ცხვრების ხოცვა, ხორცის ჭამა და ღვინის სმა. ვჭამოთ და ვსვათო, ხვალ მაინც დავიხოცებითო. "},
	{14, "14 გამოეცხადა ჩემს ყურს ცაბაოთ უფლისაგან: არ გეპატიებათ ეს დანაშაული სიკვდილამდე, თქვა მეუფემ, ცაბაოთ უფალმა. "},
	{15, "15 ასე თქვა მეუფემ, ცაბაოთ უფალმა: ადექი, მიდი მაგ კარისკაცთან, შებნასთან, სასახლეს რომ განაგებს; "},
	{16, "16 აქ რა გესაქმება, აქ ვინა გყავს, აქ რომ ითხრი სამარეს? მაღალზე გაუჭრია საფლავი, კლდეში გამოუკვეთავს განსასვენებელი. "},
	{17, "17 აჰა, დაგამხობს უფალი ძლიერი დამხობით და დაგჭმუჭნის, "},
	{18, "18 როგორც გორგალს გორგლად დაგგორგლავს, ბურთივით გაგაგორებს ვრცელ მიწაზე. იქ მოკვდები და იქ იქნება შენი დიდების ეტლები - შენი ბატონის სახლის თავსლაფი! "},
	{19, "19 გადაგაყენებ შენი სამსახურიდან და გადავარდები შენი ადგილიდან. "},
	{20, "20 იმ დღეს მოვუხმობ ჩემს მორჩილს ელიაკიმს, ხილკიაჰუს ძეს. "},
	{21, "21 და შენი შესამოსელით შეგმოსავ, შენს სარტყელს შემოვარტყამ და ხელში ჩავაბარებ შენს ძალაუფლებას. ის იქნება მამა იერუსალიმის მკვიდრთათვის და იუდას სახლისთვის. "},
	{22, "22 მხარზე გადავკიდებ დავითის სახლის გასაღებს და მის გაღებულს ვერავინ დაკეტავს; დაკეტავს და ვერავინ გააღებს. "},
	{23, "23 სამსჭვალივით ჩავარჭობ მყარ ადგილზე და მამამისის სახლის დიდების ტახტად შეიქნება. "},
	{24, "24 მასზე ჩამოკიდებენ მამამისის სახლის მთელს დიდებას - მოდგმას და მონაშენს, ყველა მცირე ჭურჭელს თასიდან ყოველ ქოთნამდე. "},
	{25, "25 იმ დღეს, ამბობს ცაბაოთ უფალი, მოირყევა მყარ ადგილზე ჩარჭობილი სამსჭვალი, გადატყდება და ჩამოვარდება, და მოსწყდება ტვირთი, ზედ რომ აწევს, რადგან უფალმა ბრძანა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view23() {
struct ka23 poems[] = {
	{1, "1 ტვიროსის განაჩენი. ივალალეთ, თარშიშის ხომალდებო, რადგან დაქცეულია ტვიროსი, აღარც სახლებია, აღარც მისასვლელი! ქითიმის ქვეყნიდან გამოეცხადა მას. "},
	{2, "2 დადუმდით, ზღვისპირეთის მცხოვრებნო, და შენ, ვინც ივსებოდი ზღვათა დამლახველი ციდონელი ვაჭრებით! "},
	{3, "3 დიდი წყლებით მისდიოდა შიხორის მარცვალი ნილოსის ნამკალი - მისი ჭირნახული, და იყო ხალხების ბაზარი. "},
	{4, "4 გრცხვენოდეს, ციდონო! რადგან ზღვამ თქვა, ზღვის ძალა ამბობს: სალმობაში არ ვყოფილვარ და არც მიშვია, ვაჟკაცები არ გამომიკვებავს და ქალწულები არ გამიზრდია. "},
	{5, "5 როგორც კი მიაწევს ხმა ეგვიპტემდე, შეძრწუნდებიან ტიროსის გამო. "},
	{6, "6 თარშიშში წადით, ივალალეთ, ზღვისპირეთის მცხოვრებნო! "},
	{7, "7 ეს არის თქვენი მოზეიმე ქალაქი, რომელსაც ძველ დღეებში აქვს დასაბამი? საკუთარი ფეხით გადაიხვეწება შორეთში! "},
	{8, "8 ვინ გადაუწყვიტა ეს ტვიროსს, გვირგვინთა მიმნიჭებელს, რომლის ვაჭრები მთავრები არიან და მისი სოვდაგრები - ქვეყნის დიდებულნი? "},
	{9, "9 ცაბაოთ უფალმა გადაუწყვიტა ეს, რომ გაეცუდებინა ყოველი მშვენების სიამაყე და დაემცირებინა ქვეყნის დიდებულნი. "},
	{10, "10 გადაიარე ნილოსივით შენი მიწა, თარშიშის ასული, სხვა გასასვლელი აღარ არის! "},
	{11, "11 ხელი მოუღერა ზღვას და შეძრა სამეფოები; უფალმა ბრძანა ქანაანზე, დაექციათ მისი ციხე-სიმაგრენი. "},
	{12, "12 თქვა: ვეღარ იზეიმებ, ციდონის ქალწულო, დათრგუნულო, ადექი, ქითიმში გადადი, მაგრამ იქაც არ გექნება საშველი. "},
	{13, "13 აჰა, ქალდეველთა ქვეყანა! ადრე არ იყო ეს ხალხი. აშურმა დააფუძნა ის ველურთაგან. მიადგეს კოშკები და დაამხეს მისი სასახლეები, ნანგრევებად აქციეს. "},
	{14, "14 ივალალეთ, თარშიშის ხომალდებო, რადგან იავარქმნილა თქვენი სიმტკიცე! "},
	{15, "15 იმ დღიდან იქნება, რომ არავის ემახსოვრება ტვიროსი სამოცდაათ წელიწადს ერთი მეფის ზეობის კვალობაზე. სამოცდაათი წლის ბოლოს აუხდება ტიროსს მეძავის სიმღერა. "},
	{16, "16 აიღე ქნარი, მოიარე ქალაქი, დავიწყებულო მეძავო; დაუკარ ტკბილად, ბევრი იმღერე, რომ გაგიხსენონ! "},
	{17, "17 სამოცდაათი წლის თავზე მოხედავს უფალი ტვიროსს და ისიც დაიბრუნებს თავის გასამრჯელოს; დაიწყებს ბოზობას ქვეყნიერების ყველა სამეფოსთან დედამიწის ზურგზე. "},
	{18, "18 მისი ნავაჭრი და გასამრჯელო უფლისათვის იქნება შეწირული. არც დაუნჯდება, არც დაიბეჭდება, რადგან უფლის წინაშე მცხოვრებთათვის იქნება მისი ნავაჭრი, რომ მაძღრისად ჭამონ და დიდებულად შეიმოსონ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view24() {
struct ka24 poems[] = {
	{1, "1 აჰა, გააპარტახებს უფალი მიწას და გააცამტვერებს, დაკრუნჩხავს მის ზედაპირს და გაფანტავს მის მცხოვრებთ. "},
	{2, "2 რა ერი და რა მღვდელი მაშინ, რა ყმა და რა მისი ბატონი, რა მოახლე და რა მისი ქალბატონი, რა მყიდველი და რა გამყიდველი, რა მოვალე და რა მევალე, რა მსესხებელი და რა მევასხე! "},
	{3, "3 მთელი ქვეყანა გაპარტახდება და პირწმინდად გაიძარცვება, რადგან უფალმა წარმოთქვა ეს სიტყვა. "},
	{4, "4 დამწუხრდა, დაღონდა ქვეყანა; დაჭკნა, დაღონდა სოფელი, დაჭკნენ ქვეყნიერთა დიდებულნი. "},
	{5, "5 წაიბილწა მიწა მის მკვიდრთა ქვეშ, რადგან გადაუდგნენ რჯულს, დაარღვიეს კანონი, გატეხეს საუკუნო აღთქმა. "},
	{6, "6 ამიტომ წყევლა ჭამს მიწას და ისჯებიან მისი მკვიდრნი; ამიტომ გადაიბუგნენ მიწიერნი და მცირენიღა გადარჩნენ. "},
	{7, "7 გამწარდა მაჭარი, დაჭკნა ვაზი, კვნესის ყველა გულმხიარული. "},
	{8, "8 გაცუდდა დაფდაფთა მხიარულება, შეწყდა მოზეიმეთა ყიჟინა, გაცუდდა ქნარის მხიარულება. "},
	{9, "9 აღარ მღერიან ღვინის სმისას, გაუმწარდა თაფლუჭი მის მსმელს. "},
	{10, "10 დაინგრა ნარბევი ქალაქი, გამოიკეტა ყველა სახლი, ვერავინ შედის. "},
	{11, "11 ღვინოს მისტირიან ქუჩებში, ჩამწარდა ყოველი სიხარული, განიდევნა მხიარულება ქვეყნიდან. "},
	{12, "12 უდაბურება დასადგურდა ქალაქში და ჩამოიქცა კარიბჭე. "},
	{13, "13 რადგან ასე იქნება შუაგულ ქვეყანაში, ხალხთა შორის, როგორც ზეთისხილის ჩამობერტყვის დროს, როგორც მცვრევის დროს, როცა დამთავრებულია რთველი. "},
	{14, "14 ხმას იმაღლებენ და ყიჟინებენ, ზღვიდან დასძახიან უფლის დიდებას. "},
	{15, "15 ამიტომ ადიდეთ უფალი აღმოსავლეთში და უფლის, ისრაელის ღვთის სახელი - ზღვისპირეთში. "},
	{16, "16 ქვეყნის კიდიდან გვესმის გალობა: დიდება მართალს! მაგრამ მე ვთქვი: ვაგლახ მე! ვაგლახ მე! ვაი მე! მზაკვარნი მზაკვრობენ, მზაკვარნი ზაკვით იმოსებიან. "},
	{17, "17 შიში, ხარო და ხაფანგია შენს წინ, ქვეყნის მკვიდრო! "},
	{18, "18 შიშის ხმაზე გაქცეული ხაროში ჩავარდება, ხაროდან ამოსული ხაფანგში გაებმება; რადგან გაიღება ცათა სარკმელები და მიწის საფუძვლები შეზანზარდება. "},
	{19, "19 ფეთქებით აფეთქდა დედამიწა, ნაფოტებად დანაფოტდა დედამიწა, დამხობით დაემხო დედამიწა. "},
	{20, "20 მთვრალივით ბარბაცებს დედამიწა და ხუხულასავით ირყევა; ცოდვამ დაამძიმა, დაეცა და ვეღარ დგება. "},
	{21, "21 მოვა ის დღე და დასჯის უფალი ცათა მხედრობას მაღლა ცაში და მიწის მეფეებს დაბლა მიწაზე. "},
	{22, "22 შეიყრებიან ერთად ტუსაღებივით დილეგში, კლიტულებში გამოიმწყვდევიან და დიდი ხნის შემდეგ დაისჯებიან. "},
	{23, "23 მაშინ გაფითრდება მთვარე და შერცხვება მზე, რადგან გამეფდება ცაბაოთ უფალი სიონის მთაზე და იერუსალიმში, და თავის უხუცესთა წინაშე გამოაჩენს დიდებას. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view25() {
struct ka25 poems[] = {
	{1, "1 უფალო, შენ ღმერთი ხარ ჩემი! შენ გადიდებ და შენს სახელს ვმადლობ, რადგან შენ მოიმოქმედე საკვირველებანი - ძველი განგებანი, მტკიცე და სარწმუნო. "},
	{2, "2 რადგან ქვის ყორედ აქციე ქალაქი, ციხე-სიმაგრენი - ნანგრევებად, უცხოთა სასახლე აღარ არის ქალაქში, აღარასოდეს აშენდება. "},
	{3, "3 ამიტომ მოწიწებით გახსენებენ ძლიერი ხალხები, მტარვალთა ქალაქებს შიში ექნებათ შენი. "},
	{4, "4 რადგან შენა ხარ საპყართა სიმტკიცე, გლახაკთა სიმტკიცე მათ გასაჭირში, თავშესაფარი ქარიშხალში, ჩრდილი პაპანებაში; რადგან მტარვალთა სუნთქვა კედელს მიხლილი ქარიშხალია, "},
	{5, "5 როგორც ხვატი უდაბნოში. უცხოთა ხმაურს შენ აცხრობ; როგორც ხვატი ღრუბლის ჩრდილში, ასე ითრგუნება მტარვალთა სიმღერა. "},
	{6, "6 გაუმართავს ცაბაოთ უფალი ყველა ხალხს ამ მთაზე ნადიმს მსუყე კერძებით, ნადიმს ძველი ღვინით, ძვლის ტვინიანი მსუყე კერძებით, ძველი, დაწმენდილი ღვინით. "},
	{7, "7 გააუქმებს ამ მთაზე საფარველს, ერებს რომ აფარია და საბურველს, ხალხებს რომ ბურავთ. "},
	{8, "8 შთანთქავს სიკვდილს სამუდამოდ და მოსწმედს ცრემლს უფალი ღმერთი ყოველ პირისახეს, წარხოცავს თავისი ერის სირცხვილს მთელი ქვეყნიდან, რადგან უფალმა ბრძანა. "},
	{9, "9 იტყვიან იმ დღეს: აჰა, ეს არის ღმერთი ჩვენი, მას ვესავდით და გვიხსნა! ეს არის უფალი, მას ვესავდით! ვიშვათ და გავიხაროთ მისმიერი ხსნით! "},
	{10, "10 რადგან დაადგრება უფლის ხელი ამ მთას და გაითელება მოაბი თავის ადგილზე, როგორც ჩალა ითელება სანეხვეზე. "},
	{11, "11 ხელებს გაშლის მის შუაგულში, როგორც მოცურავე შლის საცურაოდ ხელებს, მაგრამ დასცემს უფალი მის სიამაყეს მისი ხელის ხრიკებთან ერთად. "},
	{12, "12 ჩამოაქცევს, დაამხობს შენი გალავნის მაღალ ბურჯებს, მიწასთან გაასწორებს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view26() {
struct ka26 poems[] = {
	{1, "1 იმ დღეს იმღერებენ ამ სიმღერას იუდას ქვეყანაში: მაგარი ქალაქი გვაქვს; ხსნას დაგვიდებს ზღუდედ და გალავნად. "},
	{2, "2 გააღეთ ჭიშკრები, შემოვიდეს მართალი ერი, რწმენის შემნახველი! "},
	{3, "3 ზრახვაშეურყეველს მშვიდობაში იფარავ, რადგან შენზეა მონდობილი. "},
	{4, "4 მიენდეთ უფალს უკუნისამდე, რადგან უფალი ღმერთია საუკუნო კლდე. "},
	{5, "5 რადგან დაამდაბლა მაღლის მკვიდრნი, აღზევებული ქალაქი; დაამხო იგი, მიწასთან გაასწორა, გააცამტვერა. "},
	{6, "6 თრგუნავს მას ფეხი, ბეჩავის ფეხი, მათხოვართა ტერფები. "},
	{7, "7 სწორია მართალთა გზა. შენ ასწორებ მართალთა სავალს. "},
	{8, "8 შენი სამსჯავროს გზაზედაც, უფალო, შენ გესავდით; შენს სახელს და შენს სახსენებელს ელტვოდა სული. "},
	{9, "9 ჩემი სამშვინველი გნატრობდა ღამღამობით, ჩემი სული გეძებდა ჩემს გულში დილით; რადგან, როდესაც მსჯავრს სდებდი ქვეყანას, სამყაროს მკვიდრთა სიმართლე ისწავლეს. "},
	{10, "10 შეწყალებულ იქნება ბოროტეული, მაგრამ სიმართლეს ვერ ისწავლის; იუკუღმართებს წრფელ ქვეყანაში და უფლის დიდებას არად ჩააგდებს. "},
	{11, "11 უფალო, შემართულია შენი ხელი, მაგრამ ვერ ხედავენ. დაინახონ შენი შური შენი ხალხის გამო და შერცხვებათ; ცეცხლმა შეჭამოს შენი მტრები. "},
	{12, "12 უფალო, შენ მოაფენ მშვიდობას ჩვენზე; შენ გვიკეთებ ყველა ჩვენ საქმეს. "},
	{13, "13 უფალო, ღმერთო ჩვენო! შენს გარდა სხვა მეუფენი გვბატონობდნენ, მაგრამ მხოლოდ შენში ვახსენებთ შენს სახელს. "},
	{14, "14 მკვდრები არიან, არ გაცოცხლდებიან; აჩრდილები აღარ აღდგებიან, რადგან შენ დასაჯე და მოსპე ისინი. მათი სახსენებელი წარხოცე. "},
	{15, "15 შენ გაგიმრავლებია ხალხი, უფალო, გაგიმრავლებია ხალხი! განდიდებულხარ, განგივრცია ქვეყნის კიდეები. "},
	{16, "16 უფალო, შენ გეძებდნენ გასაჭირში, გულში ლოცულობდნენ, შენ კი უმზადებდი სასჯელს. "},
	{17, "17 როგორც ორსული ქალი, შობად მიწევნული, იტანჯება, კივის ტკივილისგან, ასე ვართ ჩვენ, უფალო, შენ წინაშე! "},
	{18, "18 მუცლადვიღეთ, ტანჯვაში ვიყავით და აჰა, ქარი ვშობეთ; ქვეყანას ხსნა ვერ მოვუტანეთ, არ დაეცნენ ქვეყნიერების მცხოვრებნი. "},
	{19, "19 გაცოცხლდებიან შენი მკვდრები, აღდგებიან გვამები; გაიღვიძეთ და იყიჟინგთ, მტვერში დავანებულნო! რადგან ნათლის ცვარია შენი ცვარი და აჩრდილთა ქვეყანაზე მოაფენ მას. "},
	{20, "20 წადი, ჩემო ხალხო, შედით თქვენ-თქვენ ოთახებში და გამოიკეტეთ კარი. მცირეხანს შეაფარე თავი, ვიდრე რისხვა გადაივლიდეს. "},
	{21, "21 რადგან, აჰა, უფალი გამოდის თავისი ადგილიდან ქვეყნის მკვიდრთა დასასჯელად მათი ცოდვისთვის; მიწა გამოაჩენს თავის სისხლს და აღარ დაფარავს თავის დახოცილებს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view27() {
struct ka27 poems[] = {
	{1, "1 იმ დღეს დასჯის უფალი სასტიკი, დიდი და ძლიერი მახვილით ლევიათანს, გველს მოსრიალეს, და ლევიათანს, გველს დაკლაკნილს, და მოკლავს გველეშაპს, ზღვაში მყოფელს. "},
	{2, "2 იმ დღეს იმღერეთ სანატრელ ვენახზე: "},
	{3, "3 მე, უფალი, მცველი ვარ მისი, ყოველწამს ვარწყულებ და ვიცავ დღითა და ღამით, რათა არავინ დააზიანოს. "},
	{4, "4 რისხვა არ არის ჩემში; მაგრამ დამიყარონ ბრძოლაში ნარ-ეკალი! გადავთელავ მათ და ერთიანად გადავწვავ. "},
	{5, "5 ან მოეჭიდოს ჩემს სიმტკიცეს, ზავი დამიდოს, დამიდოს ზავი! "},
	{6, "6 დადგება ჟამი და ფესვს გაიდგამს იაკობი, გაიხარებს და ყლორტებს გამოყრის ისრაელი და მთელს ქვეყნიერებას აავსებს ნაყოფით. "},
	{7, "7 თუ უგვემია იგი მისთა მგვემელთა გვემით, თუ უხოცია იგი მისთა მხოცელთა ხოცვით? "},
	{8, "8 უკიდურეს რისხვაში შენ სჯი მას გადახვეწით. აიტაცებდა თავისი ძლიერი ქროლვით აღმოსავლეთის ქარიან დღეს. "},
	{9, "9 ამიტომ წარიხოცება ამით: იაკობის დანაშაული და, აჰა, ეს იქნება მისი ცოდვის მიტევების ნაყოფი; როცა კირის ნაფშხვენებივით აქცევს სამსხვერპლოს ლოდებს, როცა აღარ იდგებიან აშერები და მზის კერპები. "},
	{10, "10 რადგან უდაბნოსავით გამარტოსულდა ციხე-სიმაგრე. მიაგდეს და მიატოვეს საცხოვრებელი, ხბო დაბალახობს იქ, იქ ბინავდება და მის ფოთლებს კორტნის. "},
	{11, "11 როცა გახმება მისი ტოტები და ჩამოიმტვრევა, მივლენ ქალები, რომ ცეცხლი წაუკიდონ, რადგან უგუნურია ეს ხალხი, ამიტომ არ შეიბრალებს მისი შემქმნელი და მისი გამომსახველი არ შეიწყალებს. "},
	{12, "12 იმ დღეს გალეწავს უფალი თავთავებს ევფრატიდან ეგვიპტის ხევამდე და თქვენც, ისრაელიანებო, სათითაოდ აიკრიფებით. "},
	{13, "13 ამ დღეს ახმიანდება დიდი საყვირი და მოვლენ აშურის ქვეყანაში დაკარგულნი და ეგვიპტის ქვეყანად გაგდებულნი, რომ თაყვანისცენ უფალს წმიდა მთაზე იერუსალიმში."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view28() {
struct ka28 poems[] = {
	{1, "1 ვაი, ეფრემის მემთვრალეთა სიამაყის გვირგვინს და მისი დიდებული მშვენების დამჭკნარ ყვავილს, ღვინით დაძლეულთა პოხიერი მინდვრების თავზე! "},
	{2, "2 აჰა, უფლის ძლიერი და მაგარი, როგორც სეტყვის თქეში, დამქანცველი ქარიშხალი, როგორც წყალდიდობის ნიაღვარი, მიწას დაანარცხებს თავისი ხელით. "},
	{3, "3 ფეხით გაითელება ეფრემის მემთვრალეთა სიამაყის გვირგვინი! "},
	{4, "4 მისი დიდებული მშვენების დამჭკნარი ყვავილი სახიერი მინდვრების თავზე იქნება როგორც ნაადრევი ხილი, ზაფხულამდე მოუწევნელი, რომელსაც თვალს მოჰკრავს თუ არა მნახველი, ხელთ იგდებს და იმწამსვე ყლაპავს. "},
	{5, "5 იმ დღეს ცაბაოთ უფალი იქნება დიდების გვირგვინი და ბრწყინვალე ჯიღა თავისი ერის ნარჩომისათვის. "},
	{6, "6 და სამართლის სულად სამსჯავროში მჯდომელისთვის, ძლიერებად - მომხდურთა უკუმქცეველისათვის კარიბჭიდან. "},
	{7, "7 მაგრამ ესენიც ბარბაცებენ ღვინისაგან და ირხევიან თაფლუჭისგან; მღვდელი და ქადაგი ბარბაცებენ თაყლუჭისგან, ჩანთქმული ღვინით, ირხევიან თაფლუჭისგან, ბარბაცებენ ხილვების დროს, მერყეობენ სამართლის განკითხვისას. "},
	{8, "8 რადგან ყოველი სუფრა სავსეა ნარწყევით, სუფთა ადგილი აღარ დარჩა. "},
	{9, "9 ვინ უნდა დამოძღვროს ცოდნით და ვის უნდა ჩააგონოს ამბავი? - რძეს მოწყვეტილთ, ძუძუანასხლეტთ? "},
	{10, "10 რადგან რჩევა რჩევაზე, რჩევა რჩევაზე, წესი წესზე, წესი წესზე, ცოტა აქ, ცოტა იქ; "},
	{11, "11 რადგან ლუღლუღა ბაგეებით და უცხოთა ენით დაელაპარაკება ამ ხალხს. "},
	{12, "12 მან უთხრა მათ: აჰა, საშვებელი, მიეცით შვება მაშვრალს! აჰა, განსვენება! მაგრამ მოსმენა არ უნდოდათ. "},
	{13, "13 მაშინ უფლის სიტყვად იქცევა მათთვის რჩევა რჩევაზე, რჩევა რჩევაზე, წესი წესზე, წესი წესზე, ცოტა აქ, ცოტა იქ, რომ იარონ და გულაღმა გადაყირავდნენ, დაილეწონ, მახეში მოექცნენ და შეპყრობილ იქნენ. "},
	{14, "14 ამიტომ ისმინეთ უფლის სიტყვა, მაგინებელნო, ამ ხალხის მბრძანებელნო იერუსალიმში! "},
	{15, "15 რადგან ამბობთ: აღთქმა გვაქვს დადებული სიკვდილთან და კავშირი შევკარით შავეთთან; როცა წარმხოცელი შოლტი ჩამოივლის, ვერ მოგვწვდება, რადგან სიცრუე გავიხადეთ თავშესაფრად და ტყუილი - საფარველად. "},
	{16, "16 ამიტომ ასე ამბობს უფალი ღმერთი: აჰა, ქვა დავდგი სიონზე საძირკვლად, ქვა გამონაცადი, ძვირფასი ქვაკუთხედი, მყარი საძირკველი; მასზე დანდობილი, არ აჩქარდება. "},
	{17, "17 დავდებ სამართალს ლარად და სიმართლეს - შვეულდ, და სეტყვა წარხოცავს სიცრუის თავშესაფარს და წყალი წაიღებს ტყუილის საფარველს. "},
	{18, "18 გაცუდდება თქვენი აღთქმა სიკვდილთან და თქვენი კავშირი შავეთთან ვერ გაძლებს; როცა წარმხოცელი შოლტი ჩამოივლის, მისი გასათელი შეიქნებით. "},
	{19, "19 როგორც კი ჩამოივლის, შეგიპყრობთ თქვენ; რადგან ყოველ დილით ჩამოივლის, დღისით და ღამით. მისი ამბის გაგონებაც კი ზარდამცემი იქნება. "},
	{20, "20 რადგან მოკლე იქნება საწოლი ფეხის გასაშლელად და ვიწრო იქნება საბანი გადასახურავად. "},
	{21, "21 რადგან აღიმართება უფალი როგორც ფერაციმის მთაზე, შეიძვრის როგორც გიბყონის ველზე თავისი საქმის, უცხო საქმის აღსასრულებლად და თავისი ქმედების, საოცარი ქმედების ჩასადენად. "},
	{22, "22 ახლა მოეშვით შეგინებას, რომ არ მოგიჭიროთ თქვენმა საკვრელებმა, რადგან გავიგე რომ გადაწყვეტილია მეუფისგან, ცაბაოთ უფლისგან მთელი ქვეყნის განადგურება. "},
	{23, "23 ყურადიღეთ და ისმინეთ ჩემი ხმა, გაიგონეთ და შეისმინეთ ჩემი სიტყვა: "},
	{24, "24 განა სულმუდამ ხნავს მხვნელი დასათესად? განა სულმუდამ აბრუნებს და ფარცხავს თავის მიწას? "},
	{25, "25 განა არ ასწორებს მის ზედაპირს, მიმოფანტავს სოინჯს და თესავს კვლიავს, ჩადებს ხორბალს ხნულში და ქერს თავის ადგილზე და ასლს ყანის კიდეებზე? "},
	{26, "26 ესა აქვს წესად დადებულთ, მისმა ღმერთმა დამოძღვრა იგი. "},
	{27, "27 რადგან კევრით არ ლეწავენ სოინჯს და ურმის ბორბალს არ ატარებენ კვლიავზე, რადგან სოინჯი კეტით იცეხვება და ჯოხით - კვლიავი. "},
	{28, "28 პური ილეწება, მაგრამ ბოლომდე არ ინაყება; გრიალებენ ურმის ბორბალი და ცხენები, მაგრამ არ ნაყავენ მას. "},
	{29, "29 ესეც ცაბაოთ უფლისგან მოდის; საკვირველია მისი რჩევა და სიბრძნე მისი - დიდებული. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view29() {
struct ka29 poems[] = {
	{1, "1 ვაი არიელს, არიელს, ქალაქს, დავითი სადაც დაბანაკდა! მიუმატე წელიწადს წელიწადი, ერთმანეთს მიჰყვეს დღესასწაულები. "},
	{2, "2 შევაჭირვებ არიელს, ატყდება ვაი და ვიში და არიელად შეიქნება ჩემთვის. "},
	{3, "3 ბანაკად შემოგადგები ირგვლივ და კოშკებს შემოგავლებ, გოდოლებს აღვმართავ შენს წინააღმდეგ. "},
	{4, "4 ჩაიფლობი, მიწიდან დაიწყებ ლაპარაკს და ჩაიხშობა შენი ნათქვამი, ლანდივით ამოვა შენი ხმა მიწიდან და მტვერიდან აჩურჩულდება შენი ნათქვამი. "},
	{5, "5 მტვრის კორიანტელივით იქნება შენი ურიცხვი მტერი და განიავებულ ბზესავით - ურიცხვი მტარვალი. მოხდება უცბად ანაზდეულად. "},
	{6, "6 ცაბაოთ უფალი გამოგეცხადება გრგვინვით და მიწისძვრით და მაღალი ხმით, ქარიშხლით და გრიგალით და შემჭმელი ცეცხლის ალით. "},
	{7, "7 სიზმარივით, ღამეულ ჩვენებასავით იქნება არიელზე გალაშქრებული დიდძალი ხალხი და ყველა, ვინც თავს ესხმის მას და მის ციხე-სიმაგრეებს, ვინც მას აჭირვებს. "},
	{8, "8 როგორც მშიერს ესიზმრება, თითქოს ჭამდეს, გაეღვიძება და, აჰა, ცარიელი აქვს მუცელი; როგორც მწყურვალს ესიზმრება, თითქოს სვამდეს, გაეღვიძება და, აჰა, ღონემიხდილია და სწყურია მის სულს. ასე იქნება დიდძალი ხალხი, რომელიც თავს ესხმის სიონის მთას. "},
	{9, "9 თავი გაიშტერეთ და გაშტერდით! თავი დაიბრმავეთ და დაბრმავდით! მთვრალები არიან, მაგრამ არა ღვინით, ბარბაცებენ, მაგრამ არა თაფლუჭით. "},
	{10, "10 რადგან გადმოღვარა თქვენზე უფალმა ძილქუშის სული და დაგიხუჭათ თვალები, წინასწარმეტყველნო, და დაგიფარათ თავები, მისნებო. "},
	{11, "11 იქნება თქვენთვის მთელი ეს ხილვა როგორც დაბეჭდილი წიგნის სიტყვები, რომელსაც აძლევენ წიგნის მცოდნეს და ეუბნებიან: წაიკითხე, ის კი ამბობს: არ შემიძლია, რადგან დაბეჭდილია წიგნი. "},
	{12, "12 ეძლევა წიგნი წიგნის უცოდინარს და ეუბნებიან: წაიკითხე, ის კი ამბობს; არ ვიგი წიგნი. "},
	{13, "13 თქვა უფალმა: რაკი პირით მომიახლოვდა ეს ხალხი და ბაგით მადიდებს მხოლოდ, გულით კი შორს არის ჩემგან და გაზეპირებულ ანდერძად ექცათ ჩემდამი მოწიწება, "},
	{14, "14 ამიტომ, აჰა, საკვირველს რასმე მოვახდენ ამ ხალხზე, გასაოცარს და საკვირველს; დაიკარგება მათ ბრძენთა სიბრძნე და მათ გონიერთა გონიერება უჩინო იქნება. "},
	{15, "15 ვაი მათ, ვინც ღრმად მალავენ უფლისაგან თავიანთ ზრახვებს და ბნელში აქვთ თავიანთი საქმეები, და ამბობენ: ვინ არის ჩვენი დამნახველი, ვინ არის ჩვენი მცნობელი? "},
	{16, "16 თქვე უკუღმართებო! თუ შერაცხილა თიხა მექოთნის სწორად? თუ უთქვამს შექმნილს შემქმნელისთვის, ან შეგიქმნივარო? თუ უთქვამს ნასახს დამსახველისთვის, გაგება არ გაქვსო? "},
	{17, "17 ცოტაც, სულ ცოტაც და გადაიქცევა ლიბანი ხოდაბუნად და ხოდაბუნი მაღნარად შეირაცხება. "},
	{18, "18 გაიგონებენ იმ დღეს ყრუები წიგნის სიტყვებს და ბრმათა თვალები ბნელიდან და უკუნიდან გამოიხედავენ. "},
	{19, "19 ბედშავს მოემატება სიხარული უფალში და ღარიბი-ღატაკნი ისრაელის წმიდაში გაიხარებენ. "},
	{20, "20 რადგან აღარ იქნება მტარვალი და ბოლო მოეღება მაგინებელს, ამოწყდებიან ერთიანად ბოროტ საქმეზე მღვიძარენი; "},
	{21, "21 რომლებიც სიტყვით აცთუნებენ ადამიანს, მახეს უგებენ კარიბჭესთან მომჩივანს და არაფრის გულისთვის აძევებენ მართალს. "},
	{22, "22 ამიტომ ასე ეუბნება უფალი იაკობის სახლს, აბრაამის გამომსყიდველი: ამიერიდან არ იქნება შერცხვენილი იაკობი, ამიერიდან არ გაუფითრდება სახე. "},
	{23, "23 რადგან როცა დაინახავს თავის მონაგარს, ჩემს ხელთა ქმნილებას, თავის წიაღში, წმიდაყოფენ ჩემს სახელს, წმიდაყოფენ იაკობის წმიდას და ისრაელის ღვთის შიში ექნებათ. "},
	{24, "24 ჭკუადაბნეულნი გონს მოეგებიან და ჭირვეულნი დაიმოძღვრებიან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view30() {
struct ka30 poems[] = {
	{1, "1 ვაი ამბოხებულ შვილებს, ამბობს უფალი, რჩევას რომ მიჰყვებიან, მაგრამ არა ჩემსას! ზრახვას რომ იზრახავენ, მაგრამ არა ჩემის სულისას, რათა ცოდვა მიუსართონ ცოდვას. "},
	{2, "2 ეგვიპტეში რომ ჩადიან და ჩემს ბაგეებს არ ეკითხებიან, რათა ფარაონის მფარველობა ეძებონ და ეგვიპტის ჩრდილს შეაფარონ თავი! "},
	{3, "3 სირცხვილად ექცევათ მათ ფარაონის მფარველობა და ეგვიპტის ჩრდილში შეფარება - დამცირებად. "},
	{4, "4 რადგან მათი მთავრები ცოყანში არიან და მათმა მოციქულებმა ხანეს მიაღწიეს. "},
	{5, "5 ყველა სირცხვილს ჭამს იმ ხალხის გამო, რომელიც ვერ გამოადგებათ მათ, ვერც იხსნის, ვერც უშველის, მხოლოდ შეარცხვენს და მოაყივნებს. "},
	{6, "6 ნეგების პირუტყვთა განაჩენი. ტანჯვისა და წვალების ქვეყნის გავლით, საიდანაც გამოდიან ხვადი და ძუ ლომი, ასპიტი და მფრინავი გველეშაპი, ჩოჩრების ზურგით მიაქვთ თავიანთი დოვლათი და აქლემების კუზით - თავიანთი განძეულობა იმ ხალხთან, რომელიც არ გამოადგებათ. "},
	{7, "7 ეგვიპტის შემწეობა ფუჭი და ამაოა, ამიტომ შევარქვი მას უქმად მოტრაბახე. "},
	{8, "8 ახლა წადი და ფიქალზე დაუწერე ეს მათ და წიგნში ამოკვეთე, რომ დარჩეს სამომავლოდ, უკუნისამდე. "},
	{9, "9 რადგან ურჩია ეს ხალხი, მატყუარა შვილები არიან, შვილები, რომელთაც არ უნდათ უფლის რჯულის გაგონება; "},
	{10, "10 რომლებიც ეუბნებიან მისნებს: ნურაფერს ხედავთ, და წინასწარმეტყველთ: ნუ გვიწინასწარმეტყველებთ სიმართლეს, გვითხარით საამური სიტყვები, სასეიროდ გვიწინასწარმეტყველეთ! "},
	{11, "11 გზიდან გადადექით, ბილიკიდან გადაუხვიეთ, ისრაელის წმიდა მოგვაშორეთო. "},
	{12, "12 ამიტომ ასე ამბობს ისრაელის წმიდა: რადგან შეიძულეთ ეს სიტყვა, ძალადობის და ცბიერების იმედი გაქვთ და ამას ემყარებით, "},
	{13, "13 ამიტომ ეს დანაშაული იქნება თქვენთვის მაღალ კედელზე გაჩენილი ბზარივით, რომელიც გაარღვევს მას და ერთ წამში, ანაზდეულად ჩამოაქცევს. "},
	{14, "14 დაინგრევა, როგორც იმსხვრევა მექოთნეთა ჭურჭელი, უწყალოდ დალეწილი, და ერთ ნატეხსაც ვერავინ იპოვნის მის ნამსხვრევებში, რომ კერიდან ცეცხლი აიღოს ან საგუბარიდან წყალი ამოხაპოს. "},
	{15, "15 რადგან ასე ამბობს უფალი ღმერთი, ისრაელის წმიდა: უკან მოქცევით და დავანებით გადარჩებოდით, სიმშვიდეში და სასოებაში იქნებოდა თქვენი ძალა, მაგრამ არ ინდომეთ, "},
	{16, "16 თქვით: არა, ცხენებით გავიქცევით, ამიტომაც გაიქცევით! მკვირცხლებზე ავმხედრდებითო, იმიტომაც მკვირცხლები იქნებიან თქვენი მდევრები. "},
	{17, "17 ათასი გაიქცევა ერთის მუქარაზე; ხუთის მუქარაზე ყველანი გაიქცევით, ვიდრე სამანივით არ შერჩებით მთის წვერს და მაღლობს - ნიშანივით. "},
	{18, "18 მაინც სურს უფალს თქვენი შეწყალება და მაინც აღდგება თქვენს შესაბრალებლად, რადგან სამართლის ღმერთია უფალი, ნეტარია ყოველი მისი მოესავი. "},
	{19, "19 რადგან ერი სიონში იცხოვრებს, იერუსალიმში; აღარ გექნება სატირალი, წყალობით შეგიწყალებს შენი ღაღადების ხმაზე; როგორც კი მოესმება, პასუხს გაგცემს. "},
	{20, "20 მოგცემთ უფალი ჭირში პურსა და სიმწარეში წყალს და აღარ დაიმალება თქვენი მოძღვარი და იხილავენ თქვენს მოძღვარს თქვენი თვალები. "},
	{21, "21 თქვენს ყურებს მოესმება სიტყვა თქვენს უკან: აჰა, გზა, იარეთ მასზე, როცა მარჯვნივ ან მარცხნივ გადაუხვევთ. "},
	{22, "22 სიბილწედ შერაცხავთ ვერცხლით მოჭედილ თქვენს კერპებს და თქვენი აღალმების ოქროს შესამოსელს, გაფანტავთ როგორც სიბინძურეს, განვედო, ეტყვით. "},
	{23, "23 მოსცემს წვიმას შენს თესლს, რომელსაც დათესავ მიწაზე, და პურს - მიწის მოსავალს, რომელიც მსუყე და მაწიერი იქნება; იბალახებს იმ დღეს შენი საქონელი გაშლილ საძოვარზე. "},
	{24, "24 ხარები და ვირები, მიწას რომ ამუშავებენ, მარილიან საკვებს შეჭამენ, გადარჩეულს ნიჩბითა და სანიავებლით. "},
	{25, "25 ყოველ მაღალ მთაზე და ყოველ შემაღლებულ გორაკზე გაჩნდება ღელეები, წყლის ნიაღვრები დიდი შემუსრვის დღეს, როცა დაეცემიან გოდოლები. "},
	{26, "26 მთვარის ნათელი მზის ნათელივით იქნება და მზის ნათელი გაშვიდკეცდება შვიდი დღის ნათელივით; მაშინ შეუხვევს უფალი ჭრილობას თავის ერს და თავის დანარტყამს განუკურნავს. "},
	{27, "27 აჰა, უფლის სახელი შორიდან მოდის; გიზგიზებს მისი რისხვა და შენივთდა კვამლი, მისი ბაგეები სავსეა წყრომით და მისი ენა მჭამელი ცეცხლია. "},
	{28, "28 მისი სუნთქვა, როგორც მოვარდნილი ნიაღვარი, ყველამდე უწვდენს, რომ გაცხრილოს ხალხები აღსპოლვის ცხრილში; რომ ლაგამი ამოსდოს ყბაზე ხალხებს გზა-კვალის ასარევად. "},
	{29, "29 სიმღერა გექნებათ როგორც დღესასწაულის განათვლის ღამეს და გულის სიხარული როგორც სალამურით მიმავალს უფლის მთაზე, ისრაელის კლდეზე ასასვლელად. "},
	{30, "30 გამოსცემს უფალი თავის დიდეხულ ხმას და თავის შემართულ მკლავს გამოაჩენს მძვინვარე რისხვაში და შემჭმელი ცეცხლის ალში, მეხისტეხაში და თავსხმაში, ქვის სეტყვაში. "},
	{31, "31 რადგან უფლის ხმაზე დაფრთხება აშური, როცა ატყდება კვერთხის ცემა. "},
	{32, "32 ყოველ ჩავლაზე დამსჯელი კეტისა, რომელსაც მათზე შემართავს უფალი, დაფდაფთა და ქნართა ხმა გაისმება და მოღერებული მკლავით შეებმება მათ. "},
	{33, "33 რადგან დიდიხნის მოწყობილია კოცონი, მეფისთვის გამზადდა, გაღრმავდა და გაფართოვდა. უხვად არის მასზე ცეცხლი და შეშა. უფლის სუნთქვა, როგორც გოგირდის ნიაღვარი, გააჩაღებს მას. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view31() {
struct ka31 poems[] = {
	{1, "1 ვაი ეგვიპტეში ჩამავალთ შემწეობისთვის, ცხენებისა და ეტლების მოიმედეთ, რადგან ბევრია, და მხედრებზე დანდობილთ, რადგან ძალზე ძლიერები არიან. არ უყურებენ ისრაელის წმიდას და უფალს არ ეკითხებიან. "},
	{2, "2 მაგრამ ბრძენია ის და უბედურება მოაქვს. არ გადათქვამს თავის სიტყვებს, წინ აღუდგება უკეთურთა სახლს და ავისმქმნელთა შემწეობას. "},
	{3, "3 კაცნია ეგვიპტელნი, არა ღმერთნი; მათი ცხენები ხორცია, არა სული. როცა უფალი მოიქნევს ხელს, წაიფორხილებს შემწე და დაეცემა შეწევნილიც. და ყველანი ერთიანად დაიღუპებიან. "},
	{4, "4 რადგან ასე მითხრა უფალმა: როგორც ბრდღვინავს ლომი ან ლომის ბოკვერი თავის მსხვერპლზე, თუნდაც შემოადგეს მწყემსების გუნდი, არ ეშინია მათი ყვირილისა და არც მათ სიმრავლეს უფრთხის - ასე ჩამოვა ცაბაოთ უფალი საომრად სიონის მთაზე და მის გორაკზე. "},
	{5, "5 როგორც ჩიტი ბარტყებს, ასე დაიფარავს ცაბაოთ უფალი იერუსალიმს, დაიფარავს და იხსნის, მოუფრთხილდება და გადაარჩენს. "},
	{6, "6 დაუბრუნდით მას, ისრაელიანებო, ვისაც ღრმად განუდექით! "},
	{7, "7 რადგან მოისვრის იმ დღეს ყოველი კაცი თავის ვერცხლის კერპებს და თავის ოქროს კერპებს, რომლებიც თქვენმა ცოდვილმა ხელებმა გააკეთეს. "},
	{8, "8 არკაცური მახვილით დაეცემა აშური და არაადამიანური მახვილი შეჭამს მას; მახვილს გაექცევა, მის ჭაბუკებს კი დაიმონებენ. "},
	{9, "9 შიშით ჩაუვლის თავის კლდეს და დაფრთხებიან მისი მთავრები დროშის წინაშე, ამბობს უფალი, რომელსაც ცეცხლი აქვს სიონზე და სახმილი - იერუსალიმში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view32() {
struct ka32 poems[] = {
	{1, "1 აჰა, სიმართლით იმეფებს მეფე და მთავრები სამართლიანად იმთავრებენ. "},
	{2, "2 თითოეული იქნება როგორც საფარი ქარში, თავშესაფარი ავდარში, როგორც წყლის ნაკადულები უდაბნოში, როგორც მაღალი კლდისგან დაფენილი ჩრდილი ურწყულ მიწაზე. "},
	{3, "3 არ დაიბინდება მხედველთა თვალები და მსმენელთა ყურები გამახვილდება. "},
	{4, "4 თავქარიანთა გული ეზიარება ცოდნას და ჩლიფიანთა ენა ნათლად ამეტყველდება. "},
	{5, "5 აღარ დაერქმევა უგვანს ღირსეული და გაიძვერას აღარ ეთქმის პატიოსანი. ძუნწს ხელგაშლილად არ მოიხსენებენ. "},
	{6, "6 რადგან უგვანი უგვანად ლაპარაკობს და მისი გული ბოროტს იზრახავს, რათა უკეთურება ჩაიდინოს და უფალზე მრუდედ ილაპარაკოს, ცარიელზე დატოვოს მშიერი და მწყურვალს სასმელი წაართვას. "},
	{7, "7 ძუნწს ბოროტი აქვს იარაღი, მზაკვრობას იზრახავს, რომ ბედშავი ცრუ სიტყვებით დაღუპოს, მართალსაც რომ ამბობდეს გლახაკი. "},
	{8, "8 ღირსეული კი ღირსეულს იზრახავს და ღირსებაზე დგას. "},
	{9, "9 უზრუნველო ქალებო, წამოდექით, უსმინეთ ჩემს ხმას! უდარდელო ასულნო, ყურად იღეთ ჩემი ნათქვამი! "},
	{10, "10 ერთი წელიც და შეშფოთდებით, უდარდელნო, რადგან ბოლო მოეღება რთველს, მოსავლის აღების ჟამი არ დადგება. "},
	{11, "11 გეშინოდეთ, უზრუნველნო, შფოთავდეთ, უდარდელნო! განიძარცვეთ, გაშიშვლდით და წელი მოისარტყლეთ. "},
	{12, "12 მკერდს იცემდეთ სანატრელი ყანების გამო, ნაყოფიერ ვენახთა გამო. "},
	{13, "13 ჩემი ხალხის მიწის გამო, სადაც ძეძვი და ეკალი გაიხარებს; ვაგლახ, ყველა მხიარული სახლის გამო, მოზეიმე ქალაქთა გამო! "},
	{14, "14 რადგან დარბაზები დაცარიელდება და ხმაურიან ქალაქს მიატოვებენ; ბორცვი და გოდოლი გამოქვაბულად იქცევა უკუნისამდე, კანჯართა საჯირითოდ, ჯოგების საძოვრად. "},
	{15, "15 ვიდრე არ გადმოვა ჩვენზე ზეგარდმო სული და უდაბნო წალკოტად არ გადაიქცევა და წალკოტი მაღნარად არ შეირაცხება. "},
	{16, "16 მაშინ დაივანებს უდაბნოში სამართალი და სიმართლე დამკვიდრდება წალკოტში. "},
	{17, "17 მაშინ სამართალი შეიქმს მშვიდობას და შვება და მყუდროება იქნება სამართლის ნაყოფი უკუნისამდე. "},
	{18, "18 დამკვიდრდება ჩემი ერი მშვიდობის სამყოფელში, მყუდრო სავანეებში და უზრუნველ სადგომებში. "},
	{19, "19 მოვა სეტყვა და ტყე დაბლა ჩამოიწევს და ქალაქი ბარად გაივაკებს. "},
	{20, "20 ბედნიერები ხართ, ვინც ყველგან თესავთ, სადაც წყალია, და ნებაზე უშვებთ ხარს და სახედარს! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view33() {
struct ka33 poems[] = {
	{1, "1 ვაი შენ, დამარბეველო, თავად დაურბეველო, გამცემო და თავად გაუცემელო! როცა მოათავებ რხევას, შენც დაირბევი; როცა შეწყვეტ გამცემლობას, შენ გაგცემენ! "},
	{2, "2 უფალო, შეგვიწყალე, შენ გესავთ! იყავი მათ მკლავად დილაობით და ჩვენს სახსრად გასაჭირში! "},
	{3, "3 შენი ხმის გრიალზე გარბიან ერები, წამოიმართები და იფანტებიან ხალხები. "},
	{4, "4 აიკრიფება თქვენი ნადავლი, როგორც კრეფს ბოცომკალი; დაესხმის, როგორც კალიის ურდო ესხმის. "},
	{5, "5 აღზევებულია უფალი, რადგან მაღლაა დავანებული, აავსო სიონი სამართლითა და სიმართლით. "},
	{6, "6 ის იქნება შენი დროების სიმტკიცე, სახსართა სიუხვე, სიბრძნე და ცოდნა; უფლის შიშია მისი საუნჯე. "},
	{7, "7 აჰა, აყვირდებიან მათი ბუმბერაზნი გარეთ, მშვიდობის მოციქულნი მწარედ ატირდებიან. "},
	{8, "8 გაუდაბურდა გზები, გადაშენდა მგზავრი; დარღვეულია აღთქმა, მოწმენი ათვალწუნებული, ადამიანი არადჩაგდებული. "},
	{9, "9 გლოვობს, მწუხარებს მიწა, შერცხვენილია ლიბანი, გადამჭკნარი; შარონი უდაბნოს დაემსგავსა, ხაშანს და ქარმელს დასცვივდა ფოთოლი. "},
	{10, "10 ახლა აღვდგები, ამბობს უფალი, ახლა ავმაღლდები, ახლა ავიმართები. "},
	{11, "11 თივით ორსულნო, ჩალას დაბადებთ; ცეცხლია თქვენი სუნთქვა, თქვენივე შემჭმელი. "},
	{12, "12 საკირის საწვავად იქცევიან ხალხები, აკაფელი ძეძვივით ჩაიწვებიან ცეცხლში. "},
	{13, "13 გესმათ, შორეულნო, ჩემი ნამოქმედარი, გეცოდინოთ, ახლობელნო, ჩემი ძლიერება! "},
	{14, "14 შეშინდნენ ცოდვილნი სიონზე, შიშისზარმა შეიპყრო უკეთურნი; რომელი ჩვენგანი გაუძლებს მშთანთქმელ ცეცხლს? რომელი ჩვენგანი გაუძლებს მარადიულ სახმილსო? "},
	{15, "15 მართლად მსვლელი და წრფელად მოუბარი, ძალადობით მონახვეჭის მოძულე, ქრთამისაგან ხელის დამფერთხავი, ყურის დამხშობი სისხლიან ამბავზე და თვალის დამხუჭველი ბოროტების ცქერაზე - "},
	{16, "16 აი, ვინ დაივანებს მაღალში; კლდეთა სიმაგრეები იქნება მისი საფარი, მიეცემა მური და ექნება წყალი დაუწყვეტელი. "},
	{17, "17 შენი თვალები იხილავენ მეფეს თავის მშვენებაში, დაინახავენ შორეულ ქვეყანას. "},
	{18, "18 შენი გული გაიხსენებს შიშს: სად არის აღმრიცხველი? სად არის ამწონელი? სად არის გოდოლთა აღმრიცხველი? "},
	{19, "19 თავგასულ ხალხს არ იხილავ, ხალხს მძიმედ მეტყველს, ვისიც არავის ესმის, ენაბორძიკას, ვისაც ვერავინ უგებს. "},
	{20, "20 შეხედე სიონს, ჩვენი დღესასწაულების ქალაქს. შენი თვალები იხილავენ იერუსალიმს, მყუდრო სავანეს, აუშლელ კარავს! არ დაიძვრის სამარადისოდ მისი პალოები და არცერთი მისი საბელი არ გაწყდება. "},
	{21, "21 რადგან იქ გვეყოლესა უფლის ძალი მდინარეთა და ფართე არხების ნაცვლად; ნიჩბებიანი ხომალდი ვერ შევა მასში და ძლიერი გემი იქ ვერ გაივლის. "},
	{22, "22 რადგან უფალია ჩვენი მსაჯული, უფალია ჩვენი რჯულმდებელი, უფალია ჩვენი მეფე; ის გვიხსნის ჩვენ. "},
	{23, "23 მოშვებულია შენი სახელები, ვეღარ იჭერს ფუძეზე ანძას და ვეღარ იშლება იალქნები. მაშინ განაწილდება დიდძალი ნადავლი, კოჭლებიც დაიწყებენ ალაფობას. "},
	{24, "24 არ იტყვის მცხოვრები, ავად ვარო. ხალხს, მასში დამკვიდრებულს, მიეტევება დანაშაული. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view34() {
struct ka34 poems[] = {
	{1, "1 ახლოს მოდით, ერებო, რომ გაიგონოთ! ყურადღებით იყავით, ხალხებო! გაიგონოს მიწამ და მისმა სავსებამ, ქვეყანამ და ყოველმა მისმა აღმონაცენმა! "},
	{2, "2 რადგან უფლის რისხვაა ყველა ერზე და გაცეცხლება მთელს მათ მხედრობაზე; შერისხა ისინი, დასახოცად გასწირა. "},
	{3, "3 მათი დახოცილები გადაიყრებიან, მათი გვამები სიმყრალეს აუშვებენ და მთები დალბებიან მათი სისხლისგან. "},
	{4, "4 დალბება ცის მთელი მხედრობა და ცა ეტრატივით დაიგრაგნება, ჩამოცვივა მთელი მხედრობა, როგორც ფურცელი ცვივა ვაზს და მჭკნარი ფოთოლი - ლეღვის ხეს. "},
	{5, "5 რადგან დაითრო ცაში ჩემი მახვილი; აჰა, დაეშვება ის ედომზე და ჩემგან შერისხულ ხალხზე დასასჯელად. "},
	{6, "6 უფლის მახვილი სავსეა სისხლით, გაპოხილია ქონით, კრავთა და თიკანთა სისხლით, კერძების თირკმელთა ქონით; რადგან მსხვერპლშეწირვა აქვს უფალს ბოცრაში და დიდი ხოცვა ედომის მიწაზე. "},
	{7, "7 კამეჩები დაეცემიან მასთან ერთად და ხბორები ხარებთან ერთად, დაითრობა სისხლით მიწა და ქონით გაიპოხება მისი მტვერი. "},
	{8, "8 რადგან შურისგების დღე აქვს უფალს, ნაცვალგების წელი სიონის სარჩელისთვის. "},
	{9, "9 მისი ხევები კუპრად გადიქცევა და მისი მტვერი - გოგირდად, მისი მიწა მოგიზგიზე კუპრი გახდება. "},
	{10, "10 არ ჩაქრება არც დღე, არც ღამე; უკუნისამდე იდინებს კვამლი, თაობიდან თაობამდე უკაცრიელი იქნება და არავინ იქნება იქ გამვლელი სამარადისოდ. "},
	{11, "11 ჭოტი და ზღარბი დაიმკვიდრებენ მას, ბუკიოტი და ყორანი დაიბუდებენ მასში; გასჭიმავს მასზე უსახურობის ლარს და უდაბურობის შვეულს. "},
	{12, "12 მისი აზნაურნი სამეფოს ვერ გამოაცხადებენ იქ; მისი მთავარნი გადაშენდებიან. "},
	{13, "13 მის დარბაზებში ეკალი ამოვა, ქაცვი და ძეძვი - მის ციხე-სიმაგრეებში, ტურების სადგომად იქცევა და სირაქლემათა საცხოვრებლად. "},
	{14, "14 ყოველი ჯურის მხეცი შეეყრება ერთმანეთს, ოჩოკოჩი ოჩოკოჩს დაუწყებს ხმობას; აქ დაიბუდებს ალი და იპოვის სადგურს. "},
	{15, "15 აქ მოიკალათებს გველი, დაყრის კვერცხეხს, გამოჩეკავს და თავის ჩრდილში მოუყრის თავს; აქ მოიყრიან თავს ძერები სათითაოდ. "},
	{16, "16 მოძებნეთ უფლის წიგნში და წაიკითხეთ: არცერთი მათგანი არ დააკლდება, სათითაოდ საძებარნი არ იქნებიან, რადგან თავად მისმა ბაგემ ბრძანა და მისმა სულმა თავი მოუყარა. "},
	{17, "17 მან უყარა მათ წილი და მისმა ხელმა დაუდგინა საზღვარი; საუკუნოდ დაიმკკიდრებენ მას, თაობიდან თაობამდე იქ იცხოვრებენ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view35() {
struct ka35 poems[] = {
	{1, "1 მოილხენს უდაბნო და ხრიოკი, გაიხარებს ტრამალი და შროშანივით აყვავდება. "},
	{2, "2 აყვავდება და გაიხარებს, იქნება ლხენა და სიხარული; ლიბანის დიდება მიეცემა მას, ქარმელის და შარონის სიდიადე; იხილავენ ისინი უფლის დიდებას და ჩვენი ღმერთის სიდიადეს. "},
	{3, "3 გააძლიერეთ ღონემიხდილი ხელები და მოკვეთილი მუხლები გაიმაგრეთ! "},
	{4, "4 უთხარით გულშემდრკალთ: გამაგრდით, ნუ გეშინიათ! აჰა, ღმერთი თქვენი, მოვა შურისგება, ღვთის საზღაური; ის მოვა და გიხსნით თქვენ. "},
	{5, "5 მაშინ აეხილებათ თვალები ბრმებს და ყრუებს სასმენელნი გაეხსნებათ. "},
	{6, "6 მაშინ ირემივით იხტუნებს მკელობელი და მუნჯის ენა იგალობებს, რადგან ამოხეთქავს უდაბნოში წყალი და ტრამალზე - ნიაღვრები. "},
	{7, "7 დასიცხული მიწა ტბორად გადიქცევა და ხრიოკები წყაროსთვლებად; ტურების სადგომი, სადაც ბუდობენ, ლელით და ლერწმით გადამწვანდება. "},
	{8, "8 შარაგზა იქნება იქ და წმიდა გზა დაერქმევა მას; უწმიდური იქ ვერ გაივლის; გზიანად მავალისთვის იქნება იგი და ბრიყვები არ იყიალებენ. "},
	{9, "9 არ გამოჩნდება იქ ლომი და სასტიკი მხეცი არ დაადგება მას, არ გაჭაჭანდება იქ; მხოლოდ გამოხსნილნი ივლიან. "},
	{10, "10 უფლის გამოსყიდულნი დაბრუნდებიან და მხიარული ყიჟინით მივლენ სიონზე, საუკუნო სიხარული იქნება მათ თავზე, შვება და სიხარული ეწევა მათ და ტანჯვა-წუხილი განშორდებათ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view36() {
struct ka36 poems[] = {
	{1, "1 მეფე ხიზკიაჰუს მეთოთხმეტე წელს მოადგა სანხერიბი, აშურის მეფე, იუდას ყველა ციხე-ქალაქს და აიღო ისინი. "},
	{2, "2 გაგზავნა აშურის მეფემ რაბშაკე ლაქიშიდან იერუსალიმისკენ მეფე ხიზკიაჰუსთან დიდძალი ჯარით; და დადგა იგი ზემო ტბორის წყალსადინართან, მრეცხავთა მინდვრის გზაზე. "},
	{3, "3 გავიდნენ მასთან სასახლის მოურავი ელიაკიმ ხილკიაჰუს ძე, შებნა მწერალი და იოახ ასაფის ძე, მემატიანე. "},
	{4, "4 უთხრა მათ რაბშაკემ: უთხარით ხიზკიაჰუს, ასე ამბობს-თქო დიდი მეფე, აშურის მეფე: რისი იმედი გაქვს, ასე რომ დაიმედებულხარ? "},
	{5, "5 გეუბნები: განა მხოლოდ სიტყვები - თათბირი და სიმამაცე უნდა ბრძოლას, ახლა ვისი იმედი გაქვს, რომ გადამიდექი? "},
	{6, "6 აჰა, მაგ გატეხილი ლერწმის - ეგვიპტის იმედი გაქვს, რომელსაც თუ კაცი დაეყრდნო, ხელში შეერჭობა და გაუხვრეტს. ასეთია ფარაონი, ეგვიპტის მეფე, ყველასათვის, ვისაც კი მისი იმედი აქვს. "},
	{7, "7 რომ მეუბნებით, უფლის, ჩვენი ღმერთის იმედი გვაქვსო, ეს ის ღმერთი ხომ არ არის, გორაკები და სამსხვერპლოები რომ გაუუქმა ხიზკიაჰუმ და უთხრა იუდას და იერუსალიმს: ამ სამსხვერპლოსთან ეცით თაყვანიო? "},
	{8, "8 ახლა მოდი და გაეჯიბრე ჩემს ბატონს, აშურის მეფეს; ათას ცხენს მე მოგცემ და, აბა, მხედრებს თუ იშოვი მათთვის. "},
	{9, "9 აბა, როგორ უკუაქცევ ერთ მოხელეს ჩემი ბატონის უმდაბლეს მსახურთაგან, როცა თავად ეგვიპტის ეტლების და ცხენების იმედზე ხარ? "},
	{10, "10 მერედა, განა უფლის ნების გარეშე მოვადექი ამ ადგილს გასანადგურებლად? უფალმა მიბრძანა: დაეცი მაგ ქვეყანას და გაანადგურეო! "},
	{11, "11 მიუგეს ელიაკიმმა, შებნამ და იოახმა რაბშაკეს: ელაპარაკე შენს მორჩილთ არამის ენაზე, რადგან გვესმის. იუდაურად ნუ გველაპარაკები ამ ხალხის გასაგონად, გალავანზე რომ არიან. "},
	{12, "12 უთხრა მათ რაბშაკემ: მარტო შენს ბატონთან და შენთან სალაპარაკოდ როდი გამომგზავნა ჩემმა ბატონმა, არამედ მაგ ხალხთანაც, გალავანზე რომ დამჯდარა, რომ თქვენთან ერთად ჭამოს თავისი განავალი და სვას თავისი ფსელი. "},
	{13, "13 დადგა რაბშაკე და ხმამაღლა გაჰყვირა იუდაურად და თქვა: ისმინეთ სიტყვა დიდი მეფისა, აშურის მეფისა. "},
	{14, "14 ასე ამბობს მეფე: არ შეგაცდინოთ ხიზკიაჰუმ, რადგან ვერ გიხსნით იგი. "},
	{15, "15 ნუ გაიმედებთ ხიზკიაჰუ უფლით, გვიხსნის უფალი და არ ჩაუგდებსო ხელში ამ ქალაქს აშურის მეფეს. "},
	{16, "16 ნუ დაუჯერებთ ხიზკიაჰუს, რადგან ასე ამბობს აშურის მეფე: დამიზავდით და გადმოდით ჩემს მხარეზე; ჭამოს თითოეულმა თავისი ყურძენი და ლეღვი, სვას თავისი ჭის წყალი, "},
	{17, "17 სანამ მოვიდოდე და წაგიყვანდეთ თქვენი ქვეყნისნაირ ქვეყანაში, პურისა და ღვინის ქვეყანაში, ყანებისა და ვენახების ქვეყანაში. "},
	{18, "18 არ შეგაცდინოთ ხიზკიაჰუმ, რომ ამბობს, გვიხსნისო უფალი. რომელი ხალხის ღმერთს უხსნია თავისი ქვეყანა აშურის მეფის ხელიდან? "},
	{19, "19 სად არიან ხამათისა და არფადის ღმერთები? სად არიან სეფარვაიმის ღმერთები? თუ იხსნეს სამარია ჩემი ხელიდან? "},
	{20, "20 რომელ ღმერთს უხსნია ამ ქვეყნების ღმერთთა შორის თავისი ქვეყანა ჩემი ხელიდან, რომ უფალმა იხსნას ჩემი ხელიდან იერუსალიმი? "},
	{21, "21 დუმდა ხალხი და პასუხს არ აძლევდა, რადგან მეფისგან ჰქონდათ ნაბრძანები, არ გაეცათ პასუხი. "},
	{22, "22 მივიდნენ ელიაკიმ ხილკიაჰუს ძე, სასახლის მოურავი, შებნა მწერალი და იოახ ასაფის ძე, მემატიანე, ხიზკიაჰუსთან შემოხეული სამოსელით და მოახსენეს რაბშაკეს სიტყვები. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view37() {
struct ka37 poems[] = {
	{1, "1 როცა გაიგონა ეს ხიზკიაჰუმ, სამოსელი შემოიხია, ჯვალოთი შეიმოსა და უფლის სახლში შევიდა. "},
	{2, "2 გააგზავნა ელიაკიმი, სასახლის მოურავი, შებნა მწერალი და ჯვალოთი მოსილი მღვდელმთავრები ესაია წინასწარმეტყველთან, ამოცის ძესთან. "},
	{3, "3 უთხრეს: ასე ამბობს ხიზკიაჰუ: გაჭირვების, სასჯელის და შერცხვენის დღე არის ეს დღე, რადგან საშოს კარს არიან მომდგარი ბავშვები, მაგრამ არ არის შობის ღონე. "},
	{4, "4 ვინძლო გაიგონოს უფალმა, შენმა ღმერთმა, სიტყვები რაბშაკესი, რომელიც აშურის მეფემ, მისმა ბატონმა, გამოგზავნა, რათა დაემცირებინა ცოცხალი ღმერთი და ეგინებინა სიტყვებით, რომლებიც გაიგონა უფალმა, შენმა ღმერთმა. აღავლინე ლოცვა დარჩენილთათვის, ვინც კი არიან. "},
	{5, "5 მივიდნენ მეფე ხიზკიაჰუს მორჩილნი ესაიასთან. "},
	{6, "6 უთხრა მათ ესაიამ: ასე უთხარით თქვენს ბატონს: ასე ამბობს-თქო უფალი: ნუ გეშინიათ გაგონილი სიტყვებისა, რითაც მაგინებენ აშურის მეფის მსახურნი. "},
	{7, "7 აჰა, მივუვლენ სულს და გაიგებს ამბავს და თავის ქვეყანაში გაბრუნდება. მისივე ქვეყანაში დავცემ მახვილით. "},
	{8, "8 დაბრუნდა რაბშაკე და, აჰა, ლიბნას ეომება აშურის მეფე, რადგან გაიგო, რომ ლახიშიდან დაძრულა იგი. "},
	{9, "9 თირჰაკაზე, ქუშის მეფეზეც, გაიგო, უთხრეს: აჰა, შენთან საომრად გამოვიდაო. მაშინ ისევ გაუგზავნა მოციქულები ხიზკიაჰუს და დააბარა მათ: "},
	{10, "10 ასე უთხარით ხიზკიაჰუს, იუდას მეფეს: არ შეგაცდინოს-თქო შენმა ღმერთმა, რომლის იმედიც გაქვს, რომ ფიქრობ, არ ჩავარდებაო იერუსალიმი აშურის მეფის ხელში. "},
	{11, "11 ხომ გსმენია, რა უყო აშურის მეფემ ყველა ქვეყანას, როგორ ააოხრა ისინი. შენ რა გიხსნის? "},
	{12, "12 აბა, თუ უხსნიათ ღმერთებს თავ-თავისი ხალხები, რომლებსაც მუსრი გაავლო ჩემმა მამა-პაპამ - გოზანი, ხარანი, რეცეფი; ყედენიანები, თელასარში რომ არიან? "},
	{13, "13 სად არიან ხამათის მეფე, არფადის მეფე, სეფარვაიმ-ქალაქის, ჰენაღისა და ღივას მეფე? "},
	{14, "14 გამოართვა ხიზკიაჰუმ წერილი მოციქულებს, წაიკითხა, ავიდა უფლის სახლში და უფლის წინაშე გაშალა წერილი. "},
	{15, "15 ილოცა ხიზკიაჰუმ უფლისადმი და თქვა: "},
	{16, "16 ცაბაოთ უფალო, ღმერთო ისრაელისა, ქერუბიმებზე მჯდომელო! შენ ხარ ერთადერთი ღმერთი ქვეყნიერების ყველა სამეფოსი, შენი შექმნილია ცა და მიწა "},
	{17, "17 ყური მოაპყარ, უფალო, და ისმინე; თვალი გაახილე, უფალო, და დაინახე; გაიგონე სანხერიბის სიტყვები, ცოცხალი ღვთის საგინებლად რომ შემოთვალა. "},
	{18, "18 მართალია, უფალო, რომ მოაოხრეს აშურის მეფეებმა ხალხები და მათი ქვეყნები, "},
	{19, "19 ცეცხლს მისცეს მათი ღმერთები და გაანადგურეს, რადგან ღმერთები კი არ ყოფილან ისინი, არამედ ხისგან და ქვისგან კაცის ხელით ნაკეთები საგნები. "},
	{20, "20 აწ გვიხსენ, უფალო, ღმერთო ჩვენო, მისი ხელიდან, რათა გაიგოს ქვეყნიერების ყველა სამეფომ, რომ შენ ხარ უფალი, ერთადერთი ღმერთი. "},
	{21, "21 შეუთვალა ესაია ამოცის ძემ ხიზკიაჰუს: ასე ამბობს უფალი ღმერთი ისრაელისა: შევიწყნარე, რასაც მევედრებოდი აშურის მეფის, სანხერიბის წინააღმდეგ. "},
	{22, "22 აი, სიტყვა, რომელიც უფალმა ბრძანა მის წინააღმდეგ, დაგცინის ქალწული ასული სიონისა, თავს აქნევს შენს უკან ასული იერუსალიმისა. "},
	{23, "23 ვის ლანძღავდი, ვის აგინებდი? ვისზე აღიმაღლე ხმა და ვისზე შემართე მედიდურად თვალი? ისრაელის წმიდაზე! "},
	{24, "24 შენს მორჩილთა პირით ლანძღავდი უფალს და ამბობდი: ჩემი უამრავი ეტლით ავედი მთის წვერზე, ლიბანის ფერდზე. გავჩეხე მაღალი ნაძვები, რჩეული ალვები, შევაღწიე მის უკიდურეს სამყოფელში, მის უღრან ტევრში. "},
	{25, "25 ამოვთხარე და შევსვი წყალი, საკუთარი ფეხის ტერფებით ამოვაშრე ეგვიპტის მდინარეები. "},
	{26, "26 ნუთუ არ გსმენია, რომ მე დიდი ხნის წინათ მქონდა ეს გამზადებული, ძველთაგანვე მქონდა დასახული? ახლა მოვაწიე, რომ ნანგრევებად ქცეულიყო ციხე-ქალაქები. "},
	{27, "27 მათ მცხოვრებლებს ღონე მიეხადათ, შეშინდნენ და შერცხვნენ, მინდვრის ბალახივით შეიქნენ, მწვანე ჯეჯილივით, ბანზე მოდებული ხავსივით, შეღერებამდე დაშაშრული თავთავივით. "},
	{28, "28 ვიცი შენი ჯდომა, შენი გამოსვლა და შესვლა, შენი სიცოფე ჩემ წინააღმდეგ. "},
	{29, "29 იმის გამო, რომ ცოფობ ჩემ წინააღმდეგ და მისწვდა ჩემს ყურებს შენი ამპარტავნობის ამბავი, ნესტოებში რგოლებს გაგიყრი და პირში ლაგამს ამოგდებ, იმავე გზით დაგაბრუნებ, რომლითაც მოხვედი. "},
	{30, "30 ეს გქონდეს ნიშნად: ამ წელიწადს ნაგერალი ჭამეთ, მეორე წელიწადს - ველურად გაზრდილი, მესამე წელიწადს თესეთ და მოიმკეთ, ჩაყარეთ ვაზი და ჭამეთ ნაყოფი. "},
	{31, "31 კვლავ გაიდგამს ქვემოთ ფესვს იუდას სახლის დარჩენილი ნატამალი და მაღლა ნაყოფს გამოიღებს. "},
	{32, "32 რადგან იერუსალიმიდან გამოვა დანარჩომი და ნატამალი - სიონის მთიდან; ცაბაოთ უფლის შური აღასრულებს ამას. "},
	{33, "33 ამიტომაც ამბობს უფალი აშურის მეფეზე: ვერ შევა ამ ქალაქში, ისარს ვერ შეისვრის, ვერ მიეჭრება ფარმომარჯვებული და მიწაყრილს წინ ვერ აღუმართავს. "},
	{34, "34 უკან გაბრუნდება იმავე გზით, რომლითაც მოვიდა, ვერ შევა ამ ქალაქში, ამბობს უფალი. "},
	{35, "35 მე დავიფარავ ამ ქალაქს, რომ ვიხსნა ის ჩემთვის და დავითისთვის, ჩემი მორჩილისთვის. "},
	{36, "36 გავიდა უფლის ანგელოზი და მუსრი გაავლო აშურის ბანაკში ასოთხმოცდახუთი ათას კაცს. ადგნენ დილით და, აჰა, მკვდარია ყველა. "},
	{37, "37 აიყარა, წავიდა, გაბრუნდა სანხერიბი, აშურის მეფე, და ცხოვრობდა ნინევეში. "},
	{38, "38 ერთხელაც, როცა ლოცულობდა თავისი ღმერთის, ნისროქის სახლში, მახვილით მოკლეს ის ადრამელექმა და შარეცერმა, მისმა შვილებმა, და არარატის ქვეყანას შეაფარეს თავი. მის ნაცვლად მისი ძე, ესარხადონი გამეფდა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view38() {
struct ka38 poems[] = {
	{1, "1 იმ ხანებში სასიკვდილოდ დასნეულდა ხიზკიაჰუ. მივიდა მასთან ესაია ამოცის ძე, წინასწარმეტყველი, და უთხრა: ასე ამბობს უფალი: ანდერძი დაუტოვე შენს სახლს, რადგან მოკვდები, ვერ გადარჩებიო. "},
	{2, "2 კედლისკენ მიაბრუნა პირი ხიზკიაჰუმ და შეევედრა უფალს: "},
	{3, "3 უფალო! გაიხსენე, მტკიცედ და წრფელად რომ დავდიოდი შენს წინაშე, კეთილად რომ ვიქცეოდი შენს თვალში. და მწარედ ატირდა ხიზკიაჰუ. "},
	{4, "4 იყო უფლის სიტყვა ესაიას მიმართ, მეტყველი: "},
	{5, "5 წადი და უთხარი ხიზკიაჰუს: ასე ამბობს-თქო უფალი, დავითის, მამაშენის ღმერთი: გავიგონე შენი ვედრება, დავინახე შენი ცრემლი და, აჰა, კიდევ თხუთმეტ წელიწადს შევმატებ შენს დღეებს. "},
	{6, "6 დაგიხსნი შენ და ამ ქალაქს აშურის მეფის ხელიდან და დავიფარავ ამ ქალაქს. "},
	{7, "7 ეს იყოს შენთვის სასწაულად უფლისაგან, რომ აღასრულებს უფალი იმ სიტყვას, რომელიც თქვა: "},
	{8, "8 აჰა, ათი საფეხურით დავაბრუნებ უკან მზის ჩრდილს, რომელიც უკვე ჩამოსულია ახაზის საფეხურებზე. და უკან დაბრუნდა მზე ათი საფეხურით საფეხურებზე, რომლებიც უკვე ჩავლილი ჰქონდა. "},
	{9, "9 წერილი ხიზკიაჰუსი, იუდას მეფისა, როცა სნეული იყო და განიკურნა სნეულებისგან: "},
	{10, "10 ვიფიქრე, შავეთის ბჭეებს მივადექი-მეთქი ჩემი ცხოვრების შუაძალზე, წამერთვა-მეთქი დარჩომილი წლები; "},
	{11, "11 ვიფიქრე, ვერ ვიხილავ-მეთქი უფალს, უფალს ცოცხალთა ქვეყანაზე, ვეღარ ვნახავ-მეთქი ადამიანს წუთისოფლის მცხოვრებთა შორის; "},
	{12, "12 აიყარა-მეთქი ჩემი ყოფა და გამეცალა, როგორც მწყემსის კარავი; დავახვიე-მეთქი ჩემი სიცოცხლის ძაფი და, აჰა, ძირში მომკვეთს-მეთქი. დღიდან ღამემდე ბოლოს მიღებდი. "},
	{13, "13 დილამდე ველოდი, რომ ლომივით შემიმუსრავდა ძვლებს; დღიდან ღამემდე ბოლოს მიღებდი. "},
	{14, "14 როგორც წერო, როგორც მერცხალი, ისე ვჭყიოდი. მტრედივით მოვთქვამდი; თვალები მაღლა მქონდა აპყრობილი: უფალო, გამიჭირდა, მიშველე-მეთქი! "},
	{15, "15 რა მეთქმის? მითხრა და აასრულა: სულგამწარებული გავათრევ ჩემს წლებს. "},
	{16, "16 უფალო, ამით ცოცხლობს კაცი და ამ ყველაფერშია ჩემი სულის სიცოცხლე. შენ აღმადგინე და გამაცოცხლე. "},
	{17, "17 აჰა, ჩემი სიმრთელისთვის ვიწვნიე სიმწარე და შენ ამოზიდე ჩემი სული არარაობის ორმოდან, რადგან შენს ზურგს უკან მოისროლე ჩემი ცოდვები. "},
	{18, "18 რადგან შავეთი არ გმადლობს შენ, სიკვდილი არ დაგიწყებს დიდებას, ქვესკნელში ჩამავალთ აღარა აქვთ შენი სიმტკიცის იმედი. "},
	{19, "19 ცოცხალი, მხოლოდ ცოცხალია, რომ გმადლობს შენ, როგორც მე დღეს; მამა აუწყებს შვილებს შენს სიმტკიცეს. "},
	{20, "20 უფალი მყავს სახსრად და ჩვენც ავახმიანებთ ჩემს საკრავებს მთელი სიცოცხლე უფლის სახლში. "},
	{21, "21 თქვა ესაიამ: მოიტანეთ ლეღვის ტყლაპი, წყლულზე დაადეთ და მორჩება. "},
	{22, "22 თქვა ხიზკიაჰუმ: რა იქნება იმის ნიშნად, რომ შევძლებ უფლის სახლში ასვლას? "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view39() {
struct ka39 poems[] = {
	{1, "1 ამ დროს გამოუგზავნა მეროდახ-ბალადან ბალადანის ძემ, ბაბილონის მეფემ, ხიზკიაჰუს წერილები და ძღვენი, რადგან გაგებული ჰქონდა, რომ ავად იყო და მომაგრდა. "},
	{2, "2 გაიხარა ხიზკიაჰუმ და დაათვალიერებინა მათ თავისი საუნჯე - ოქრო-ვერცხლი, ნელსურნელებანი, ძვირფასი ზეთი, საჭურველის სახლი და ყველაფერი, რაც კი მის საგანძურებში იპოვებოდა. ერთი ნივთიც არ დარჩენილა არც მის სახლში და არც მთელს მის სამფლობელოში, რომ არ ეჩვენებინოს მათთვის ხიზკიაჰუს. "},
	{3, "3 მივიდა ესაია წინასწარმეტყველი ხიზკიაჰუსთან და უთხრა: რა თქვეს ამ კაცებმა და საიდან მოვიდნენ შენთან? მიუგო ხიზკიაჰუმ: შორი ქვეყნიდან მოვიდნენ, ბაბილონიდან. "},
	{4, "4 თქვა: რა ნახეს შენს სახლში? მიუგო ხიზკიაჰუმ: ყველაფერი ნახეს, რაც სახლში მაქვს. არაფერი დარჩენილა ჩემს საგანძურებში, რომ არ მეჩვენებინოს მათთვის. "},
	{5, "5 უთხრა ესაიამ ხიზკიაჰუს: ისმინე ცაბაოთ უფლის სიტყვა: "},
	{6, "6 აჰა, დადგება ჟამი და ყველაფერს, რაც სახლში გაქვს, და რაც შენს მამა-პაპას დღემდე მოუხვეჭავს, ბაბილონში წაიღებენ. აღარაფერი დარჩება, ამბობს უფალი. "},
	{7, "7 წაასხამენ შენს შვილებსაც, რომელნიც შენგან გამოვლენ, რომელთაც შენ წარმოშობ, და საჭურისებად გახდიან ბაბილონის მეფის სასახლეში. "},
	{8, "8 უთხრა ხიზკიაჰუმ ესაიას: კარგია უფლის სიტყვა, შენ რომ წარმოთქვი. დასძინა: რადგან ჩემს დროში მაინც იქნება მშვიდობა და სიმტკიცე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view40() {
struct ka40 poems[] = {
	{1, "1 ანუგეშეთ, ანუგეშეთ, ჩემი ხალხი, ამბობს თქვენი ღმერთი. "},
	{2, "2 მოუოხეთ გული იერუსალიმს და ახარეთ, რომ დასრულდა მისი ლაშქრობა, რომ მიტევებულია მისი დანაშაული, რომ ორმაგად მიეზღო უფლის ხელით მისი ცოდვებისათვის. "},
	{3, "3 ხმაა მღაღადებლისა: უდაბნოში გაამზადეთ უფლის გზა, მოასწორეთ ტრამალზე სავალი ჩვენი ღვთისათვის! "},
	{4, "4 ყოველი ტაფობი მაღლა აიწევს და ყოველი მთა და ბორცვი დადაბლდება. ფერდობი დავაკდება და მთაგრეხილები გასწორდება. "},
	{5, "5 გამოცხადდება უფლის დიდება და ყოველი ხორციელი ერთად იხილავს, რადგან უფლის პირი ლაპარაკობს. "},
	{6, "6 ხმა ამბობს: ახარე. კითხულობს: რა ვახარო? ბალახია ყოველი ხორციელი და ყოველი მშვენება მისი - მინდვრის ყვავილი. "},
	{7, "7 ხმება ბალახი, ჭკნება ყვავილი, როცა უფლის ქარი დაუბერავს მას. ასეა, ბალახია ხალხი. "},
	{8, "8 გახმება ბალახი, დაჭკნება ყვავილი, ჩვენი ღვთის სიტყვა კი დგას საუკუნოდ. "},
	{9, "9 ადი მთამაღალზე, მახარობელო სიონო! აღიმაღლე შენი ხმაძლიერი, მახარობელო იერუსალიმო! აღიმაღლე, ნუ გეშინია! უთხარი იუდას ქალაქებს, აქ არის-თქო თქვენი ღმერთი! "},
	{10, "10 აჰა, მოვა უფალი ღმერთი ძლიერებით და იხელმწიფებს მისი მკლავი, აჰა, საზღაური მასთანაა და მის წინაშეა გასამრჯელო. "},
	{11, "11 როგორც მწყემსი, დამწყესავს ის თავის ფარას, თავისი მკლავით მოუყრის თავს კრავებს და თავისი უბით წაიყვანს, და დედაცხვარს წინ გაუძღვება. "},
	{12, "12 ვის ამოურწყავს წყალი თავისი პეშვით და ცა მტკაველით ვის გაუზომავს, ვის დაუთვლია მიწის მტვერი, ვის აუწონია მთები სასწორზე და მთაგრეხილები - პინებზე? "},
	{13, "13 ვის დაუსაზღვრავს უფლის სული და ვინ განასწავლა ის თავისი რჩევით? "},
	{14, "14 ვის სთხოვა რჩევა, რომ განსწავლულიყო, ვინ აცოდინა მას სამართლის გზა, ვინ აცოდინა სიბრძნე და გონების გზა ვინ ჩააგონა? "},
	{15, "15 აჰა, სარწყულის ერთი წვეთივით არიან ხალხები და ქვიშასავით სასწორის პინებზე. აჰა, მტვერივით ახვეტავს კუნძულებს! "},
	{16, "16 ლიბანი არ ეყოფა დასაწვავად და მისი მხეცები აღსავლენ მსხვერპლად! "},
	{17, "17 ყველა ხალხი არარაობაა მის წინაშე, ფუჭად და ამაოდ შეირაცხებიან მის თვალში. "},
	{18, "18 ვის მიამსგავსებ ღმერთს და რომელ მსგავსებას დაუყენებ გვერდით? "},
	{19, "19 ხელოსნის ჩამოსხმულია კერპი, ოქრომჭედლისგან ოქროთი დაფერილი და ვერცხლის შიბებით შემკული. "},
	{20, "20 ვისაც ენანება ეს შესაწირავი, ულპობელ ხეს ირჩევს, და ეძებს მარჯვე ოსტატს ისეთი კერპის გასაკეთებლად, რომ არ ბარბაცებდეს. "},
	{21, "21 ნუთუ არ იცით, ნუთუ არ გსმენიათ, ნუთუ არ გემცნოთ დასაბამიდან? ნუთუ არ გაგიგიათ ქვეყნის დაფუძნებიდან? "},
	{22, "22 ის ზის მიწის კამარაზე და მისი მკვიდრნი კალიებს გვანან; გაფინა ცა მსუბუქი ქსოვილივით და კარავივით გაშალა საცხოვრებლად. "},
	{23, "23 არარაობად აქცევს მთავრებს, არაფრად აგდებს ქვეყნის მსაჯულებს. "},
	{24, "24 ის იყო დაინერგნენ, ის იყო ჩაითესნენ, ის იყო მიწაში ფესვი გაიდგეს, რომ დაუბერა მათ და გადახმენ, ჩალასავით გახვეტა ისინი ქარიშხალმა. "},
	{25, "25 ვის შემადარებთ, რომ გავუტოლდე? ამბობს წმიდა. "},
	{26, "26 ზეცად აღაპყარით თვალნი და შეხედეთ, ვინ შექმნა ესენი? მან, ვისაც სათვალავით გამოჰყავს მათი მხედრობა; ვინც სახელდებით უხმობს მათ ყველას, არავინ დააკლდება ძალამოსილს და ყოვლადძლიერს. "},
	{27, "27 რატომ ამბობ, იაკობ, და რატომ ლაპარაკობ, ისრაელ, დაფარულიაო ჩემი გზა უფლისაგან და ღვთისგან განუკითხავიაო ჩემი სამართალი? "},
	{28, "28 განა არ იცი? ნუთუ არ გსმენია? მარადიული ღმერთია უფალი, ქვეყნის კიდეების შემქმნელი. არ იღლება და არ იქანცება, მიუწვდომელია მისი განგება. "},
	{29, "29 ის აღონიერებს დაღლილ-დაქანცულს და უძლურს ძალას ჰმატებს. "},
	{30, "30 იღლებიან ჭაბუკები და იქანცებიან, მაგარი ვაჟკაცები ემხობიან. "},
	{31, "31 უფლის მოსავნი კი განიახლებენ ძალას, არწივივით გაშლიან ფრთებს, გაიქცევიან და არ დაიღლებიან, ივლენ და არ დაიქანცებიან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view41() {
struct ka41 poems[] = {
	{1, "1 იდუმეთ ჩემს წინაშე, ზღვისპირელნო! ხალხებმა განიახლონ ძალი, რომ ახლოს მოდგნენ და მაშინ ილაპარაკონ! ერთად მოვახლოვდეთ მსჯავრისათვის. "},
	{2, "2 ვინ აღძრა აღმოსავლეთით იგი, ვისაც გამარჯვება ხვდება ყოველ ნაბიჯზე? მის წინაშე მიიყვანა ხალხები და მეფეები დაუმორჩილა. მან გაუცამტვერა მახვილი, ჩალასავით დაულეწა მშვილდი. "},
	{3, "3 დაედევნება მათ, მშვიდობით ჩაივლის გზაზე, სადაც ფეხი არავის დაუდგამს. "},
	{4, "4 ვინ ჩაიდინა ეს, ვინ მოიმოქმედა? თაობათა გამომხობმა დასაბამით. მე ვარ უფალი - პირველი და უკანასკნელი. მე ვარ იგი. "},
	{5, "5 დაინახეს ზღვისპირელებმა და შეეშინდათ, ქვეყნის კიდეები შეძრწუნდნენ, მოახლოვდნენ და მოვიდნენ. "},
	{6, "6 ერთმანეთს ეშველებიან, ერთი მეორეს ეუბნებიან: გამაგრდი! "},
	{7, "7 მოქანდაკე ამხნევებს ჩამომსხმელს, უროთი მბეგველი - გვერდზე მცემელს; ეტყვის ნაწიბურზე, კარგიაო, და ამაგრებს ლურსმნებით, რომ არ ირყეოდეს. "},
	{8, "8 შენ კი, ისრაელ, ჩემო მორჩილო, იაკობ, რომელიც ამოგარჩიე, ჩემი საყვარელი აბრაამის თესლო, "},
	{9, "9 რომელიც წამოგიყვანე ქვეყნის კიდეებიდან და მისი შორი კუთხეებიდან გამოგიხმე, გითხარი: ჩემი მორჩილი ხარ შენ, ამოგარჩიე და არ უკუგაგდებ-მეთქი. "},
	{10, "10 ნუ გეშინია, რადგან შენთანა ვარ მე; ნუ დაფრთხები, რადგან შენი ღმერთი ვარ მე; გაგამხნევებ და შეგეწევი ჩემი მხსნელი მარჯვენით-მეთქი. "},
	{11, "11 აჰა, შერცხვება და მიიმალება ყველა შენი მრისხველი, არარად იქცევიან და დაიღუპებიან-მეთქი შენი მოდავენი. "},
	{12, "12 ძებნას დაუწყებ მათ და ვერ იპოვნი, შენს მოშუღარ ხალხს; არარად იქცევიან შენს წინააღმდეგ ომის ამტეხნი. "},
	{13, "13 რადგან მე ვარ უფალი, შენი ღმერთი, შენი მარჯვენის განმამტკიცებელი, მთქმელი შენდა მიმართ: ნუ გეშინია, მე შეგეწევი. "},
	{14, "14 ნუ გეშინია მატლო იაკობ, ერთი შეწვა ისრაელო! მე შეგეწევი, ამბობს უფალი და შენი გამომსყიდველი ისრაელის წმიდა. "},
	{15, "15 აჰა, გაქცევ გალესილ, ახალთახალ, დაკბილულ კევრად; გალეწავ მთებს და დააქუცმაცებ, ბზესავით გახდი მთაგრეხილებს. "},
	{16, "16 გაანიავებ და ქარი წაიღებს მათ, ქარიშხალი გაფანტავს; შენ კი გაიხარებ უფალში, ისრაელის წმიდაში განდიდდები. "},
	{17, "17 ჩაგრულნი და უპოვარნი წყალს ეძებენ, მაგრამ არ არის; ენა გამშრალი აქვთ წყურვილისგან. მე, უფალი, შევეხმიანები, ისრაელის ღმერთი მათ არ მივატოვებ. "},
	{18, "18 გავხსნი ნაკადულებს ხმელგორებზე და წყაროებს ტრამალებში; უდაბნოს წყლის ტბორად ვაქცევ, ხრიოკ მიწას - წყაროსთვალად. "},
	{19, "19 დავრგავ უდაბნოში ნაძვს, ურთხელს, მურტსა და ზეთისხილს; აღვმართავ ტრამალზე ალვას ნეკერჩახლთან და ბზასთან ერთად. "},
	{20, "20 რათა დაინახონ და გაიგონ, მიხვდნენ და დარწმუნდნენ, რომ უფლის ხელმა მოიმოქმედა და ისრაელის წმიდამ შექმნა ეს. "},
	{21, "21 წარმოადგინეთ თქვენი სარჩელი, ამბობს უფალი. მოიტანეთ თქვენი საჩივრები, ამბობს იაკობის მეუფე. "},
	{22, "22 მოდგნენ და გაგვიცხადონ მოწევნადი. გამოგვიცხადეთ დასაბამი, რომ განვჭვრიტოთ და მივხვდეთ მის დასასრულს, ანდა მომავალი გვამცნეთ. "},
	{23, "23 გამოგვიცხადეთ მოსახდენი და მივხვდეთ, რომ ღმერთები ხართ. ქმენით კეთილი, გინდა ბოროტი, რომ ვუყურებდეთ და ვხედავდეთ თქვენთან ერთად. "},
	{24, "24 აჰა, არარაობა ხართ და თქვენი საქმეც არარაობაა; სისაძაგლეს ირჩევენ თქვენით. "},
	{25, "25 ჩრდილოეთიდან აღვძარი და მოვიდა; მზის აღმოსავლიდან უხმობს ჩემს სახელს და მოდის; მთავრები თითქოს თიხაა და მეთუნესავით დაჯეგავს აყალოს. "},
	{26, "26 ვინ გამოაცხადა დასაბამით, რომ გვცოდნოდა? ადრიდანვე, რომ გვეთქვა: ის მართალია? მაგრამ არავის გამოუცხადებია, არავის უცნობებია, არავის გაუგია თქვენი ნათქვამი. "},
	{27, "27 მე პირველმა სიონს: აჰა, აჰა, ისინი-მეთქი! და იერუსალიმს: მახარობელს მოგცემ-მეთქი! "},
	{28, "28 გავიხედე და არავინ იყო, არ იყო მრჩეველი მათ შორის, რომ შევკითხოდი და პასუხი გაეცათ. "},
	{29, "29 აჰა, არარანი არიან ყველანი, ფუჭია მათი საქმეები, მათი კერპები ქარია და სიცარიელე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view42() {
struct ka42 poems[] = {
	{1, "1 აჰა ჩემი მორჩილი, რომლისთვისაც ხელი მაქვს ჩავლებული; ჩემი რჩეული, რომელიც მოისურვა ჩემმა გულმა. მასზე გარდამოვავლინე ჩემი სული, ის გაუჩენს სამართალს ხალხებს. "},
	{2, "2 ის არ იყვირებს და არ აუწევს ხმას, არავის გააგონებს თავის ხმას ქუჩაში. "},
	{3, "3 გადატეხილ ლერწამს არ დაულეწავს და მბჟუტავ პატრუქს არ ჩაუქრობს, სამართალს სიმართლით გააჩენს. "},
	{4, "4 არ შედრკება და არ მოეშვება, ვიდრე ქვეყნად სამართალს არ დაამყარებს. მის რჯულს მოელიან ზღვისპირელნი. "},
	{5, "5 ასე ამბობს ღმერთი, უფალი, ცათა შემოქმედი და მათი გარდამთხმელი, მიწის გადამშლელი მისი ნაყოფებითურთ, სუნთქვის მიმნიჭებელი მის მცხოვრებთათვის და სულისა - მასზე მავალთათვის: "},
	{6, "6 მე, უფალმა, წრფელად მოგიწოდე და ხელი ჩაგჭიდე, შეგინახვ და დაგადგინე აღთქმად ერისთვის, სინათლედ ხალხებისთვის, "},
	{7, "7 რომ ბრმებს თვალები აეხილოთ, რომ საპყრობილედან გამოვიდნენ ტყვეები და დილეგიდან - ბნელში მსხდომარენი. "},
	{8, "8 მე ვარ უფალი, ეს არის ჩემი სახელი; ჩემს დიდებას არ მივცემ სხვას და ჩემს ქებას - გამოქანდაკებულ კერპებს. "},
	{9, "9 აჰა, ამხდარია წინანდელნი და ამიერიდან ახალს გამოგიცხადებთ; ვიდრე აღმოცენდებოდეს, გაცნობებთ. "},
	{10, "10 უმღერეთ უფალს ახალი სიმღერა, მისი სადიდებელი ქვეყნის კიდეთაგან, ვინც ზღვაში დახვალთ და ყველამ, რაც მას ავსებს, კუნძულებო და მისთა მკვიდრნო! "},
	{11, "11 ხმა აღიმაღლოს უდაბნომ და მისმა ქალაქებმა, დაბა-სოფლებმა, სადაც კედარი ცხოვრობს, იზეიმონ კლდეთა მცხოვრებლებმა, მთათა მწვერვალიდან იყიჟინონ! "},
	{12, "12 მიაგონ უფალს პატივი და მისი სადიდებელი ზღვისპირელთა შორის გამოაცხადონ! "},
	{13, "13 როგორც გმირი, გამოვა უფალი; როგორც მეომარი, შურით აღივსება, აგრგვინდება, ყიჟინასაც დასცემს, ძალას გამოაჩენს მტრების წინააღმდეგ. "},
	{14, "14 დიდხანს ვდუმარებდი, ვჩუმდი, თავს ვიკავებდი; ახლა ავკივლდები მშობიარესავით, გავანადგურებ და ვშთანთქავ ერთიანად. "},
	{15, "15 გავაუდაბურებ მთებსა და ბორცვებს და გადავახმობ მათ ყოველ სიმწვანეს, მდინარეებს ხმელეთად ვაქცევ და ამოვაშრობ წყალსატევებს. "},
	{16, "16 წავიყვან ბრმებს მათთვის უცნობი წებით და მათთვის უცნობ ბილიკებზე გავატარებ; ბნელს ნათლად ვაქცევ მათ წინაშე და ოღრო-ჩოღროებს - ვაკეებად. აი, ამ საქმეებს მოვიმოქმედებ და არ მივატოვებ მათ. "},
	{17, "17 უკან დაიხევენ, სირცხვილით შერცხვებიან ქანდაკთა მოესავნი, კერპებს რომ ეუბნებიან: ჩვენი ღმერთები ხართო. "},
	{18, "18 ყრუებო, ისმინეთ! ბრმებო, იყურეთ, რომ დაინახოთ! "},
	{19, "19 ვინ არის ჩემი მორჩილივით ბრმა და ყრუ ჩემი მოციქულივით, მე რომ გავგზავნე? ვინ არის ბრმა ჩემი გამოსყიდულივით და ბრმა უფლის მორჩილივით? "},
	{20, "20 ბევრი გინახავს და არ შეგინახავს; სასმენელი ღია გაქვს და არ გესმის. "},
	{21, "21 უფალმა ინება თავის სიმართლისთვის განედიდებინა და განეთქვა რჯული. "},
	{22, "22 მაგრამ ეს ხალხი გაძარცულია და დარბეული, გამოქვაბულებში არიან ჩაყრილნი და საპყრობილეებში გამოკეტილნი; ტყვედ მიჰყავთ, მხსნელი კი არ არის; იტაცებენ და არავინ ამბობს: დააბრუნე! "},
	{23, "23 რომელმა თქვენგანმა გაიგონა ეს? ყური ვინ მიაპყრო და ვინ მოისმინა მოწევნადი? "},
	{24, "24 ვინ მისცა დამარბეველს იაკობი და ისრაელი - მძარცველებს? განა ეს უფალი არ იყო, რომელსაც შევცოდეთ, არ ვიარეთ მის გზებზე და მისი რჯული არ შევისმინეთ? "},
	{25, "25 გადმოაფრქვია მათზე თავისი რისხვის ცეცხლი და ომის სისასტიკე გიზგიზებდა მის ირგვლივ და ვერ მიმხვდარიყო, წვავდა და გულისხმაში ვერ ჩავარდნილიყო. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view43() {
struct ka43 poems[] = {
	{1, "1 ახლა ასე ამბობს უფალი, შენი შემქმნელი, იაკობ, და შენი გამომსახველი, ისრაელ: ნუ გეშინია, რადგან მე გიხსენი შენ, შენი სახელით მოგიწოდე, ჩემი ხარ შენ. "},
	{2, "2 როცა წყლებს გადახვალ, შენთან ვიქნები, და მდინარეებს - არ წაგიღებენ; როცა ცეცხლში შეხვალ, არ დაიწვები და ალი არ მოგეკიდება. "},
	{3, "3 რადგან მე ვარ უფალი, შენი ღმერთი, ისრაელის წმიდა, შენი მაცხოვარი; შენს გამოსასყიდად ეგვიპტეს გავიღებ, ქუშსა და საბას - შენს სანაცვლოდ. "},
	{4, "4 რადგან შენ ძვირფასი ხარ ჩემს თვალში, რადგან პატივდებული ხარ და მიყვარხარ; სხვა ხალხს გავიღებ შენს სანაცვლოდ და ტომებს - შენი სულისათვის. "},
	{5, "5 ნუ გეშინია, რადგან შენთანა ვარ; აღმოსავლეთიდან მოვიყვან შენს ნატამალს და დასავლეთიდან შემოგკრებ. "},
	{6, "6 ვეტყვი ჩრდილოეთს: გაუშვი! და სამხრეთს: არ დააკავო! მოიყვანე ჩემი ვაჟები შორეთიდან და ჩემი ასულები - ქვეყნის კიდიდან. "},
	{7, "7 ყველა, ვინც ჩემი სახელით არის წოდებული და ვინც ჩემი დიდებისთვის შევქმენი, გამოვსახე და გავაჩინე. "},
	{8, "8 გამოიყვანონ ხალხი ბრმა, თუმცა თვალხილული, ყრუნი, თუმცა ყურთა მქონებელნი. "},
	{9, "9 ყოველი ხალხი ერთად შეიკრიბოს და შეერთდნენ ერები! ვინ გააცხადებს მათ შორის ამას და წინანდელ ამბებს ვინ გვამცნობს? მოიყვანონ მოწმეები და თავი იმართლონ, მოისმინონ და თქვან: ჭეშმარიტია! "},
	{10, "10 თქვენა ხართ ჩემი მოწმენი, ამბობს უფალი და ჩემი მორჩილნი, რომელნიც ავირჩიე, რომ გცოდნოდათ და გერწმუნათ ჩემი, მიმხვდარიყავით, რომ მე ვარ ეს. ჩემამდე არ გამოსახულა ღმერთი და ჩემს შემდეგაც არ იქნება. "},
	{11, "11 მე ვარ, მე ვარ უფალი და არავინაა ჩემს გარდა მაცხოვარი! "},
	{12, "12 მე ვთქვი და ვიხსენი და გამოვაცხადე, რომ არ არის თქვენს შორის უცხო ღმერთი, თქვენა ხართ ჩემი მოწმენი, ამბობს უფალი, და მე ღმერთი ვარ. "},
	{13, "13 დასაბამიდან მე იგივე ვარ და ვერავინ იხსნის ჩემი ხელიდან. მოვიმოქმედებ და ვინ შეცვლის? "},
	{14, "14 ასე ამბობს უფალი, თქვენი მხსნელი, ისრაელის წმიდა: თქვენი გულისთვის გავგზავნე ბაბილონს, წამოვასხი ლტოლვილნი ერთიანად და ქალდეველნი, ხომალდებში რომ ყიჟინებდნენ. "},
	{15, "15 მე ვარ უფალი, თქვენი წმიდა, ისრაელის შემქმნელი, თქვენი მეფე. "},
	{16, "16 ასე ამბობს უფალი, ზღვაში გზის მიმცემი და ბილიკისა ბობოქარ წყლებში; "},
	{17, "17 ეტლთა და მხედრობის, ლაშქრისა და ძლიერ მეომართა გამომტყუებელი. ერთად დაწვნენ აღუდგომელად, დაილივნენ, სანთელივით ჩაქრნენ. "},
	{18, "18 ადრინდელი არ გახსოვთ და გარდასულზე არ ფიქრობთ. "},
	{19, "19 აჰა, ახალს მოვიმოქმედებ, ახლავე აღმოცენდება. ნუთუ ვერ შეამჩნევთ? გზას გავიყვან უდაბნოში, ტრამალში - მდინარეებს. "},
	{20, "20 პატივს მომაგებენ ველური მხეცები - ტურები და სირაქლემები, რადგან წყალი გავაჩინე უდაბნოში, მდინარეები - ტრამალში, რომ დავარწყულო ჩემი ერი, ჩემი რჩეული. "},
	{21, "21 ჩემთვის გამოვსახე ეს ერი, ჩემს სადიდებელს იტყვის. "},
	{22, "22 შენ არ მოგიხმივარ, იაკობ, რომ ჩემთვის დამშვრალიყავ, ისრაელ! "},
	{23, "23 არ მოგიყვანია ჩემთვის ცხვარი აღსავლენად და საკლავით არ გიცია პატივი; არ მიმსახურებიხარ ძღვენით და არ დამიღლიხარ საკმევლის კმევით. "},
	{24, "24 არ გიყიდია ჩემთვის ვერცხლით სურნელებანი და არ გაგიძღივარ შენი საკლავების ქონით. შენ კი მამსახურებდი შენი ცოდვებით და მღლიდი შენი დანაშაულებით. "},
	{25, "25 მე ვარ, მე, ვინც წარვხოცავდი შენს შეცოდებებს ჩემი გულისთვის და შენს ცოდვებს არ ვიხსენებდი. "},
	{26, "26 გამახსენე, განვიკითხოთ ერთმანეთი; მოჰყევი, რომ თავი გაიმართლო. "},
	{27, "27 შენმა პირველმა მამამ შესცოდა და შენი შუამავლები ამიჯანყდნენ მე. "},
	{28, "28 ამიტომ დავამდაბლე საწმიდარის მთავრები, დასარისხებლად გადავეცი იაკობი და ისრაელი - შესაგინებლად. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view44() {
struct ka44 poems[] = {
	{1, "1 ახლა ისმინე, იაკობ, ჩემო მორჩილო, და ისრაელ, ჩემო რჩეულო! "},
	{2, "2 ასე ამბობს უფალი, შენი შემქმნელი და დედის საშოში შენი გამომსახველი, რომელიც შეგეწევა შენ: ნუ გეშინია, ჩემო მორჩილო იაკობ, და იეშურუნ, ჩემო რჩეულო. "},
	{3, "3 რადგან წყალს მივუღვრი ურწყულს და ნაკადულებს - გამომშრალ მიწას; ჩემს სულს მივუღვრი შენს ნატამალს და ჩემს კურთხევას - შენს შთამომავლებს. "},
	{4, "4 აღმოცენდებიან როგორც ჯეჯილი მდელოთა შორის, როგორც ტირიფები წყლისპირებზე. "},
	{5, "5 ერთი იტყვის: უფლისა ვარ, მეორე იაკობის სახელს დაირქმევს; სხვა დაიწერს საკუთარ ხელზე - უფლისა და ისრაელის სახელით იქნება წოდებული. "},
	{6, "6 ასე ამბობს უფალი, ისრაელის მეუფე და მისი მხსნელი, ცაბაოთ უფალი: მე ვარ პირველი და მე ვარ უკანასკნელი, და ჩემს გარდა არ არის ღმერთი. "},
	{7, "7 ვინ არის ჩემი მსგავსი? თქვას და გამოაცხადოს, გადმომილაგოს, რა მოხდა მას შემდეგ, რაც ძველი ხალხი დავამკვიდრე; გამოუცხადონ მომავალი და მოწევნადი. "},
	{8, "8 ნუ შიშობ, ნუ თრთი. განა თავიდანვე მე არ გამცნე, მე არ გამოგიცხადე? თქვენა ხართ ჩემი მოწმენი. განა არის ჩემს გარდა ღმერთი? არ არის სხვა კლდე, არავინ ვიცი. "},
	{9, "9 კერპის გამომსახველნი არარაობაა ყველანი და მათი ძვირფასეულობა უსარგებლოა; თავად არიან ამის მოწმენი. ვერაფერს ხედავენ, ვერაფერს მიმხვდარან, ამიტომაც შერცხვებიან. "},
	{10, "10 ვინ გამოსახა ღმერთი და ვინ ჩამოასხა ქანდაკი, არაფრის მაქნისი? "},
	{11, "11 აჰა, შერცხვებიან მისი თანამდგომნი, რადგან ხელოსნებიც ადამის მოდგმისანი არიან; შეიკრიბონ ყველანი, გამოცხადდნენ; ზარი დაეცეთ და შერცხვნენ ერთიანად. "},
	{12, "12 რკინითხურო ჭედავს მას და ამუშავებს ნაკვერცხლებზე, კვერავს ჩაქუჩებით, ამუშავებს მას თავისი მკლავის ძალით; შივდება და ძალა ეცლება; წყალს არ სვამს და ქანცი წყდება. "},
	{13, "13 ხითხურო გაჭიმავს ძაფს და შემოხაზავს წვერმახით, ამუშავებს ხელეჩოთი, ფარგლით შემოხაზავს მას და შექმნის მისგან კაცის სახესავით, ადამიანის სილამაზესავით, სახლში დასადგმელად. "},
	{14, "14 კედრებს გაჩეხავს, შეარჩევს ძელქვას ან მუხას და მოიმარაგებს ტყის ხეთა შორის; დარგავს კედარს და წვიმა გაზრდის. "},
	{15, "15 დასაწვავად იქცევა ადამიანისთვის: აიღებს მათგან და თბება; ღუმელსაც ახურებს და პურს აცხობს, ღმერთსაც აკეთებს და თაყვანს სცემს, აკეთებს კერპს და განერთხმის მის წინაშე. "},
	{16, "16 მის ნახევარს ცეცხლში წვავს, ნახევრით ხორცს ჭამს, მწვადს წვავს და ძღება; თბება კიდეც და ამბობს: ოჰ, გავთბი, ცეცხლი დავინახეო! "},
	{17, "17 მისი მონარჩენი კი ღმერთად აქცია, თავის კერპად, რომლის წინაშე განრთხმულია, თაყვანს სცემს და ლოცულობს, ეუბნება: დამიფარე, რადგან ღმერთი ხარ ჩემიო. "},
	{18, "18 არაფერი ესმით, ვერაფერს ხვდებიან, რადგან ამოუქოლათ თვალები, რომ ვერაფერი დაინახონ, და გულები - რომ ვერაფერს მიხვდნენ. "},
	{19, "19 გულისხმაში ვერ მოდიან, არც ჭკუა აქეთ და არც გონება, რომ თქვან: ნახევარი ცეცხლში დავწვი, პურიც გამოვაცხვე ნაკვერცხლებზე, ხორცი შევწვი და ვჭამე; დანარჩენი სიბილწედ უნდა ვაქციო, ხის ნატეხის წინაშე უნდა განვერთხაო? "},
	{20, "20 ნაცარს მწყემსავს, მოტყუებული გული გზაკვალს ურევს, ვერ იხსნის თავს და ვერ ამბობს: განა სიცრუე არ არის ჩემს მარჯვენაში? "},
	{21, "21 გაიხსენე ეს, იაკობ და ისრაელ, რადგან ჩემი მორჩილი ხარ! ჩემი გამოსახული ხარ, ჩემი მორჩილი ხარ, ისრაელ, არ დამავიწყდები. "},
	{22, "22 ნისლივით წარვხოცავ შენს დანაშაულს და ჯანღივით - შენს ცოდვას; დამიბრუნდი, რადგან მე გამოგისყიდე. "},
	{23, "23 გიხაროდეთ, ცანო, რადგან უფალმა მოიმოქმედა ეს! იყიჟინეთ, მიწის სიღრმეებო, სიხარულით იხმიანეთ, მთებო, ტყევ და ყოველო ხევ, რაც მასში ხარ, რადგან უფალმა გამოისყიდა იაკობი და ისრაელში განდიდდა. "},
	{24, "24 ასე ამბობს უფალი, შენი გამომსყიდველი და შენი გამომსახველი დედის საშოში: მე ვარ უფალი, რომელმაც ყოველივე შექმნა; მარტომ გადაჭიმა ცა და თავად გადაფინა მიწა, "},
	{25, "25 რომელმაც ჩაშალა ცრუწინასწარმეტყველთა ნიშნები, გამოაჩინა მკითხავთა სიბრიყვე, უკან დაახევინა ბრძენებს და მათი ცოდნა სიგიჟედ აქცია. "},
	{26, "26 რომელიც განამტკიცებს თავისი მორჩილის სიტყვას და თავის მოციქულთა რჩევას განასრულებს, რომელიც ეუბნება იერუსალიმს: დასახლდები! და იუდას ქალაქებს: აშენდებით და მის ნანგრევებს მე აღვადგენ! "},
	{27, "27 რომელიც ეუბნება ღურღუმელს: ამოშრი და მე დავწრეტ შენს მდინარეებს! "},
	{28, "28 რომელიც ამბობს კიროსზე: ჩემი მწყემსია და ყოველ სურვილს შემისრულებს! და ეუბნება იერუსალიმს: აშენდები! და სასახლეს: ჩაიყრება შენი საძირკველი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view45() {
struct ka45 poems[] = {
	{1, "1 ასე უთხრა უფალმა თავის ცხებულს, კიროსს, რომლის მარჯვენა მიჭირავს, რათა ხალხები დავამხო მის წინაშე და სარტყელი შევუხსნა მეფეებს, რათა კარიბჭენი გაიხსნას მის წინაშე და ჭიშკრები არ ჩაიკეტოს. "},
	{2, "2 მე წაგიძღვები და ოღრო-ჩოღროებს გავასწორებ, სპილენძის კარებს შევლეწავ და რკინის ურდულებს დავამტვრევ, "},
	{3, "3 მოგცემ წყვდიადის საგანძურებს და საიდუმლოდ დამარხულ სიმდიდრეს, რათა მიხვდე, რომ მე უფალი ვარ, შენთვის სახელის მწოდებელი, ისრაელის ღმერთი. "},
	{4, "4 ჩემი მორჩილის, იაკობის, და ისრაელის, ჩემი რჩეულის, გულისათვის გიწოდებ სახელს და გნათლავ, თუმცა არ მიცნობ. "},
	{5, "5 მე უფალი ვარ და მეტი არავინაა, არ არის ღმერთი ჩემს გარდა. მე გარტყამ სარტყელს, თუმცა არ მიცნობ. "},
	{6, "6 რათა გაიგონ მზის აღმოსავლეთში და დასავლეთში, რომ არავინაა ჩემს გარდა, რომ მე ვარ უფალი და მეტი არავინაა. "},
	{7, "7 ნათლის გამომსახველი და ბნელის შემქმნელი, მშვიდობისმყოფელი და ჭირის შემქმნელი. მე ვარ უფალი, ამის ყოველის შემოქმედი. "},
	{8, "8 იწვეთოს მაღლიდან ზეცამ და ღრუბლებმა ასხურონ სიმართლე, გადაიხსნას მიწა და ხსნამ ინაყოფოს, და სამართალი აღმოცენდეს მასთან ერთად! მე, უფალმა, შევქმენი ეს. "},
	{9, "9 ვაი თავის გამჩენთან მოდავეს, ერთ ნამსხვრევს თიხის ნამსხვრევთაგან! თუ უთქვამს თიხას თავის გამომსახველისთვის: რას აკეთებო? და შენს ქმნილებას არა აქვსო ხელები? "},
	{10, "10 ვაი მას, ვინც მამას ეუბნება: რისთვის გამაჩინეთ? და ქალს: რისთვის იტანჯეო? "},
	{11, "11 ასე ამბობს უფალი, ისრაელის წმიდა და მისი გამჩენი: შემეკითხებით ჩემი შვილების მომავალზე და ჩემ ხელთა ქმნილებაზე მიბრძანებთ რასმე? "},
	{12, "12 მე შევქმენი მიწა და ადამი გავაჩინე მასზე, ჩემი ხელით გადავფინე ცა და მთელი მისი მხედრობა განვაწესე. "},
	{13, "13 მე აღვძარი ის სიმართლით და ყოველი მისი გზა გავასწორე; ის ააშენებს ჩემს ქალაქს და გაათავისუულებს ჩემს ტყვეებს უსასყიდლოდ და ძღვენის გარეშე, ამბობს ცაბაოთ უფალი. "},
	{14, "14 ასე ამბობს უფალი: ეგვიპტის ჭირნახული და ნავაჭრი ქუშისა და საბაელთა, ახოვან კაცთა, შენთან მოვა და შენი იქნება; შენ შეგიდგებიან, წამოვლენ ბორკილდასხმულნი და გეთაყვანებიან, ვედრებას დაგიწყებენ. ნამდვილად შენშია ღმერთი და სხვა ღვთაება არავინაა. "},
	{15, "15 ჭეშმარიტად, შენა ხარ ღმერთი დაფარული, ისრაელის ღმერთი, მაცხოვარი. "},
	{16, "16 შერცხვებიან და შეცბუნდებიან ყველანი, ერთიანად ჩაცვივდებიან სირცხვილში კერპთა მკეთებელნი. "},
	{17, "17 უფალი იხსნის ისრაელს საუკუნო ხსნით; არ შერცხვებიან და არ შეცბუნდებიან უკუნითი უკუნისამდე. "},
	{18, "18 რადგან ასე ამბობს უფალი, ცათა შემოქმედი (ის არის ღმერთი, რომელმაც მიწა გამოსახა და შექმნა; მან დაამყარა იგი, საუკაცრიელოდ არ შეუქმნია, დასასახლებლად გამოსახა): მე ვარ უფალი და მეტი არავინაა. "},
	{19, "19 საიდუმლოდ, ბნელი ქვეყნის ადგილზე, არ მილაპარაკნია; არ მითქვამს იაკობის მოდგმისათვის: ამაოდ მეძებთ-მეთქი. მე ვარ უფალი, სიმართლის მთქმელი, სიწრფელეთა გამომცხადებელი. "},
	{20, "20 შეგროვდით და მოდით, ახლოს მოდექით ერთად, ხალხებიდან გადარჩენილნო! არაფერი ესმით თავიანთი ხის კერპების მტვირთველებს და იმ ღმერთის მლოცველთ, რომელსაც არ ძალუძს გადარჩენა. "},
	{21, "21 გამოაცხადეთ, მოდექით, მოითათბირეთ ერთმანეთში: ვინ გვასმინა ეს ძველთაგანვე, დიდი ხნის წინათ ვინ გამოაცხადა? ეს მე არ ვიყავი, უფალი? არ არის სხვა ღმერთი ჩემს გარდა; მართალი ღმერთი და მაცხოვარი ჩემს გარდა არავინაა. "},
	{22, "22 ჩემკენ მოიქეცით და გადარჩებით, ქვეყნის ყოველი კუთხისანო, რადგან მე ვარ ღმერთი და სხვა არავინაა. "},
	{23, "23 ჩემი თავი მაქვს დაფიცებული, ჩემი პირიდან გამოვიდა სიმართლე და ჩემი სიტყვა არ გადაითქმის, რადგან ყოველი მუხლი ჩემს წინაშე მოიყრება, ყოველი ენა მე დამიფიცავს. "},
	{24, "24 მხოლოდ უფალშია, იტყვიან ჩემზე, სიმართლე და ძალა. მასთან მივლენ და შერცხვებიან ყველანი, ვინც მასზე ჯავრობდნენ. "},
	{25, "25 უფალში გამართლდება და განდიდდება მთელი მოდგმა ისრაელისა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view46() {
struct ka46 poems[] = {
	{1, "1 ჩაიღუნა ბელი, მოიკაკვა ნებო; მათი კერპები მხეცებს და პირუტყვებს აჰკიდეს. მძიმეა თქვენი სატარებელი, როგორც დაქანცული ცხოველის ტვირთი! "},
	{2, "2 მოიკაკვნენ, ჩაიღუნენ ერთიანად, ვერ შეძლეს ტვირთის გადარჩენა და თავადაც ტყვეობაში წავიდნენ. "},
	{3, "3 მისმინე, იაკობის სახლო და ისრაელის სახლის მთელო ნარჩომო, ჩემო აყვანილო მუცლიდანვე, საშოდანვე ჩემო ნატარებო: "},
	{4, "4 შენს სიბერემდე მე იგივე ვარ და მოხუცობამდე მე გატარებ, მე შეგქმენი და მე აგიყვან, მე გატარებ და მე გადაგარჩენ. "},
	{5, "5 ვის შემადარებთ, რომ გამისწოროთ? ვის გამიტოლებთ, რომ ვემსგავსო? "},
	{6, "6 ქისიდან ჰყრიან ოქროს და ვერცხლს სასწორზე წონიან; ქირაობენ ოქრომჭედელს, რომ მისგან ღმერთი გააკეთებინონ. მერე ქედს უხრიან და თაყვანს სცემენ. "},
	{7, "7 მხარზე შეიდგამენ და ატარებენ, მერე ჩამოდგამენ თავის ადგილზე. დგას და ადგილიდან არ იძვრის, შესძახიან და პასუხს არა სცემს, გასაჭირში ვერ ეშველება. "},
	{8, "8 ეს გაიხსენეთ და გამაგრდით, გულთან მიიტანეთ, ცოდვილნო! "},
	{9, "9 გაიხსენეთ წინანდელნი, დასაბამიერნი, რადგან მე ღმერთი ვარ და არ არის სხვა ღმერთი, არავინაა ჩემი მსგავსი. "},
	{10, "10 დასაბამითვე ვაცხადებ მომავალს და ძველიდანვე, რაც ჯერ არ მომხდარა. ვამბობ: აღსრულდება ჩემი განზრახული და ყოველ სურვილს ავასრულებ. "},
	{11, "11 გამოვიხმობ აღმოსავლეთიდან ონავარ ფრინველს, შორი ქვეყნიდან - ჩემი განზრახულის აღმსრულებელს; ვთქვი და დიაღაც მოვახდენ; დავსახე და დიაღაც გავაკეთებ. "},
	{12, "12 მისმინეთ მე, გულგაკერპებულნო, სიმართლეს განშორებულნო! "},
	{13, "13 მოვაახლოვე ჩემი სიმართლე, შორს არ არის, და ჩემეული ხსნა არ დააყოვნებს. მე მივცემ ხსნას სიონს, და ისრაელს - ჩემს დიდებას! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view47() {
struct ka47 poems[] = {
	{1, "1 ჩამოდი და ჩაჯექი მტვერში, ბაბილონის ასულო! დაჯექი მიწაზე უტახტოდ, ქალდეველთა ასულო! რადგან აღარ გერქმევა ნაზი და ნებიერი. "},
	{2, "2 აიღე დოლაბი და დაფქვი ფქვილი; მოიხადე პირბადე, აიკრიფე კალთები, გაიშიშვლე წვივები და გადადი მდინარეებზე. "},
	{3, "3 გაშიშვლდება შენი სარცხვინელი და გამოჩნდება შენი აუგი. შურს ვიძიებ და ვერავინ დამაკავებს. "},
	{4, "4 ჩვენი მხსნელი - ცაბაოთ უფალია მისი სახელი - ისრაელის წმიდაა. "},
	{5, "5 იჯექი მდუმარედ და წადი ბნელში, ქალდეველთა ასულო, რადგან აღარ გერქმევა სამეფოთა დედოფალი. "},
	{6, "6 განრისხებული ვარ ჩემს ხალხზე, ტალახად ვაქციე ჩემი წილხვდომილი და ხელში მოგეცი ისინი; არ მოეპყარი მათ სიბრალულით, მოხუცებულს დიდად დაუმძიმე უღელი. "},
	{7, "7 შენ კი თქვი: საუკუნოდ ვარო ქალბატონი! გულთან არ გაგიკარებია ეს ამბები, არ გიფიქრია მათ აღსასრულზე. "},
	{8, "8 ახლა კი ისმინე ეს, გაფუფუნებულო, მშვიდად რომ ზიხარ და გულში ფიქრობ: მე ვარ და ჩემს მეტი არავინ არისო. ქვრივად არ ვიჯდები და არც შვილმკვდარი ვიქნებიო. "},
	{9, "9 მოვა შენზე წამისყოფით ერთ დღეს ეს ორივე, შვილმკვდარობა და ქვრივობა. სრულად გეწევა შენ ეს, არ გიშველის შენი ურიცხვი გრძნეულებები, შენი მაგარი ჯადოები. "},
	{10, "10 შენი სიავის იმედი გქონდა, ამბობდი: არავინ არის ჩემი დამნახავიო. შენი სიბრძნე და ცოდნა გაცთუნებდა და ამბობდი გულში: მე ვარ და ჩემს მეტი არავინ არისო. "},
	{11, "11 გეწევა უბედურება და არ გეცოდინება მისი სახსარი, ჭირი დაგატყდება და ვერ აირიდებ; ანაზდად გეწევა განადგურება, ვერც გაიგებ. "},
	{12, "12 იდექი შენს ჯადოებზე და შენს უამრავ გრძნეულებებზე, რისთვისაც ზრუნავდი სიყმაწვილიდანვე! იქნებ გიშველოს, იქნება ზარი დასცე. "},
	{13, "13 დაღლილი ხარ ბევრი თათბირისგან; აბა, წარდგნენ ცათა მზომელნი, ვარსკვლავთმჭვრეტელნი, ახალ მთვარეთა მცნობელნი და გიხსნან მოწევნადისგან! "},
	{14, "14 აჰა, ჩალასავით არიან, ცეცხლმა გადაბუგა ისინი, საკუთარი თავიც ვერ იხსნეს ალისაგან; ნაკვერცხალიც არ დარჩა გასათბობად, არც ცეცხლი მის წინ დასაჯდომად! "},
	{15, "15 ასე იქნებიან შენთვის ისინი, ვისთანაც შრომობდი და სავაჭროდ დადიოდი სიყმაწვილიდანვე. ყველა თავის გზაზე წახეტიალდება, შენი მშველელი კი არავინ იქნება. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view48() {
struct ka48 poems[] = {
	{1, "1 ისმინე ეს, იაკობის სახლო, ისრაელის სახელით წოდებულნო, იუდას წყლებიდან გამოსულნო, უფლის სახელის მოფიცარნო, ისრაელის ღმერთს რომ ახსენებთ, თუმცა არა ჭეშმარიტებით და არა სიმართლით! "},
	{2, "2 რადგან წმიდა ქალაქის სახელით იწოდებიან და ისრაელის ღმერთს ემყარებიან - ცაბაოთ უფალია მისი სახელი. "},
	{3, "3 თავიდანვე გავაცხადე წინანდელნი, ჩემი ძირიდან არის გამოსული. მე გამოვიტანე სააშკარაოზე; ანაზდად ვმოქმედებდი და სრულდებოდა. "},
	{4, "4 რაკი ვიცოდი, რომ ჯიუტი ხარ და რკინის ძარღვები გაქვს კისერზე და სპილენძის შუბლი. "},
	{5, "5 მე გამცნე შენ თავიდანვე, გამოგიცხადე, ვიდრე ასრულდებოდა, რომ არ გეთქვა; ჩემმა კერპმა აასრულა ეს, ჩემს ბუთსა და ქანდაკს ჰქონდა ნაბრძანებიო. "},
	{6, "6 შენ მოგისმენია; ახლა იხილეთ ეს ყველაფერი. ნუთუ არ აღიარებთ? ამიერიდან გიცხადებ ახალ ამბებს, დაფარულთ, რომლებიც არ იცოდი. "},
	{7, "7 ახლა ასრულდნენ ისინი და არა წინათ; დღემდე არაფერი გსმენიათ მათზე, რომ არ თქვათ: აჰა, ხომ ვიცოდიო. "},
	{8, "8 არც გსმენია და არც იცოდი, აქამდე ყურიც არ გქონია გახსნილი; რადგან ვიცოდი, რომ ღალატს ჩაიდენდი და შემცოდე გერქვა დედის მუცლიდანვე. "},
	{9, "9 ჩემი სახელის გულისათვის ვაყოვნებ რისხკას და ჩემი დიდებისათვის გარიდებ მას, რომ არ მოგსპო. "},
	{10, "10 აჰა, გამოგადნე, მაგრამ ვერცხლი არ გამოვიდა; სიმწრის ქურაში გამოგცადე. "},
	{11, "11 ჩემი თავისთვის, ჩემი თავისთვის ვაკეთებ ამას, რადგან როგორ შევალახვინო ჩემი სახელი? ჩემს დიდებას სხვას არ მივცემ. "},
	{12, "12 მისმინე, იაკობ და ისრაელ, ჩემო წოდებულო: ეს მე ვარ, მე ვარ პირველი და მე ვარ უკანასკნელიც. "},
	{13, "13 ჩემმა ხელმა დააფუძნა მიწა და ჩემმა მარჯვენამ გადაჭიმა ცა. მოვუხმობ მათ და ერთად დადგებიან. "},
	{14, "14 შეიკრიბენით ყველანი და ისმინეთ: ვინ გამოაცხადა მათ შორის ეს ამბები? უფალმა შეიყვარა იგი. აასრულებს თავის ნება-სურვილს ბაბილონზე და ქალდეველებზე შემართავს მკლავს. "},
	{15, "15 მე, მე ვიყავი, რომ ვილაპარაკე; მოვუწოდე კიდეც, მოვიყვანე და გზა წარვუმართე. "},
	{16, "16 მომიახლოვდით, ისმინეთ ეს: საიდუმლოდ არც თავიდანვე მილაპარაკნია; რაც რომ ეს მოხდა, მე იქა ვარ. ახლა კი უფალმა ღმერთმა და მისმა სულმა მომავლინა. "},
	{17, "17 ასე ამბობს უფალი, შენი მხსნელი, ისრაელის წმიდა; მე ვარ უფალი, შენი ღმერთი, დამმოძღვრავი სასიკეთოდ, სავალ გზაზე შენი წარმმართველი. "},
	{18, "18 ნეტავ ყურადგეღო ჩემი მცნებები! მაშინ მდინარესავით იქნებოდა შენი სიმრთელე და ზღვის ტალღებივით - შენი სიმართლე. "},
	{19, "19 ქვიშასავით იქნებოდა შენი თესლი და მისი მარცვლებივით - შენი წიაღის ნაშიერი. არ ამოიკვეთებოდა მისი სახელი, არ გაქრებოდა ჩემს წინაშე. "},
	{20, "20 გამოდით ბაბილონიდან, გაერიდეთ ქალდეველებს! მხიარული ხმით გამოაცხადეთ, ამცნეთ ეს, ქვეყნის კიდემდე მიაწვდინეთ, თქვით: იხსნა უფალმა, თავისი მორჩილი იაკობი! "},
	{21, "21 არ მოსწყურებიათ უდაბნოებში, სადაც დაჰყავდა; კლდიდან უდინა მათ წყალი, კლდე გააპო და იჩქეფა წყალმა. "},
	{22, "22 არ არის მშვიდობა, ამბობს უფალი, ბოროტეულთათვის. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view49() {
struct ka49 poems[] = {
	{1, "1 მისმინეთ, ზღვისპირელნო, და გამიგონეთ, შორეულო ხალხებო! უფალმა მუცლიდან მომიწოდა, დედის წიაღიდან ახსენა ჩემი სახელი. "},
	{2, "2 გალესილი მახვილივით ქმნა ჩემი ბაგე, თავისი ხელის ჩრდილში დამმალა; წამახული ისარივით გამხადა და თავის კაპარჭში შემინახა. "},
	{3, "3 მითხრა: ჩემი მორჩილი ხარ, ისრაელ, შენით გამოვაჩენ ჩემს დიდებას. "},
	{4, "4 მე კი ვამბობდი: ამაოდ დავშვერ, ფუჭად და უსაზმნოდ დავხარჯე ძალა. ჭეშმარიტად, უფალთან არის ჩემი სამართალი და ჩემს ღმერთთან - ჩემი საზღაური! "},
	{5, "5 ახლა ამბობს უფალი, მუცლიდანვე ჩემი გამომსახველი თავის მორჩილად, რომ თავისკენ მიაქციოს იაკობი და ისრაელი თავისთან შეკრიბოს, რათა ვიდიდო უფლის თვალში და ჩემი ღმერთი იყოს ძალი ჩემი. "},
	{6, "6 თქვა: ცოტაა, ჩემი მორჩილი რომ იყავი იაკობის შტოთა აღსადგენად და ისრაელის ნატამალის მოსაქცევად; ხალხების ნათელად გაგხდი, რომ ჩემმა ხსნამ ქვეყნის კიდემდე მიაღწიოს. "},
	{7, "7 ასე ეუბნება უფალი, ისრაელის გამომსყიდველი, მისი წმიდა, დაბეჩავებულს, ხალხებისგან შეზიზღებულს, ხელმწიფეთა მონას: მეფენი დაინახავენ და წამოდგებიან, მთავარნი თაყვანს სცემენ უფლის გამო, რომელიც მტკიცეა, და ისრაელის წმიდის გამო, რომელმაც შენ ამოგარჩია. "},
	{8, "8 ასე ამბობს უფალი: მოწყალების ჟამს შეგიწყნარე და ხსნის დღეს შეგეწიე, დაგიცავ და გაგხდი აღთქმად ხალხისათვის ქვეყნის აღსადგენად, უკაცრიელ სამკვიდროთა დასანაწილებლად, "},
	{9, "9 გამომწყვდეულთათვის სათქმელად: გამოდით! და ბნელში მყოფთათვის: გამოჩნდით! გზებზე დაიწყებენ ძოვას და ყოველ ხმელგორზე ექნებათ საძოვარი. "},
	{10, "10 არ მოშივდებათ და არ მოსწყურდებათ, ვერას დააკლებს მათ ხვატი და მზის არმური, რადგან მათი შემბრალებელი გაუძღვება მათ და წყლის სათავეებთან მიიყვანს. "},
	{11, "11 ყოველ მთას ჩემსას გზად გადავაქცევ და ჩემი შარაგზები მაღლა აიწევა. "},
	{12, "12 აჰა, ესენი შორიდან მოდიან, აჰა, ესენი - ჩრდილოეთიდან და დასავლეთიდან, ესენი კი - სინიმის ქვეყნიდან! "},
	{13, "13 გაიხარე, ცაო, და ილხინე, მიწავ, სიხარულით იყიჟინეთ მთებო, რადგან ანუგეშა უფალმა თავისი ხალხი და შეიბრალა თავისი წამებულნი. "},
	{14, "14 თქვა სიონმა: მიმატოვა უფალმა და მეუფემ დამივიწყაო. "},
	{15, "15 განა დაივიწყებს ქალი თავის ჩვილს? არ შეიბრალებს თავისი მუცლის ნაშიერს? მათ რომც დაივიწყონ, მე არ დაგივიწყებ შენ. "},
	{16, "16 აჰა, ხელისგულებზე მყავხარ გამოსახული, შენი კედლები მუდამ ჩემს წინაა. "},
	{17, "17 აჩქარდებიან შენი მშენებელნი; შენი დამაქცევარნი და მაოხრებელნი კი წავლენ შენგან. "},
	{18, "18 თვალი მოატარე ირგვლივ და იხილე: ყველანი შეკრებილან, შენთან მოდიან! როგორც მე ვარ ცოცხალი, ამბობს უფალი, ასე შეიმოსავ სამკაულად ყველას და მოირთვები მათით, როგორც პატარძალი. "},
	{19, "19 რადგან შენს ნაოხარში და უკაცრიელ ადგილებში, შენს აკლებულ მიწაზე, ახლა ნამდვილად ვიწროდ იქნები მის მცხოვრებთა გამო. შენი ჩამყლაპავნი კი გაგშორდებიან. "},
	{20, "20 კიდეც გეტყვიან ყურში კვლავ შეძენილი შენი შვილები: მევიწროება ადგილი. მიმიშვი, რომ ვიცხოვრო! "},
	{21, "21 იტყვი გულში; ვინ გამიჩინა ესენი? მე ხომ შვილმკვდარი ვიყავი, ბერწი, განდევნილი და მოწანწალე. ვინ გამიზარდა? მარტო რომ ვიყავი დარჩენილი, ესენი სადღა იყვნენ? "},
	{22, "22 ასე ამბობს უფალი ღმერთი: აჰა, ხალხებისკენ გავიწვდი ხელს და ერებს აღვუმართავ ჩემს დროშას; უბით წამოიყვანენ შენს ვაჟებს და შენი ასულეხი მხრებზე ეყოლებათ აყვანილი. "},
	{23, "23 მეფეები შენი გამზრდელები იქნებიან, მათი დედოფლები კი - შენი ძიძები; პირქვე დამხობით გცემენ თაყვანს და შენ ფეხთა მტვერს დაუწყებენ ლოკვას, რათა გაიგონ, რომ მე უფალი ვარ და არ შერცხვება ჩემს მოიმედეს. "},
	{24, "24 თუ წართმევია ოდესმე ძლიერს ნადავლი ან თუ წასვლია ტყვე გამარჯვებულს? "},
	{25, "25 ჭეშმარიტად, ასე ამბობს უფალი: რომც წაერთვას ტყვე ძლიერს და ნადავლი წაუვიდეს ძალმომრეს, გამოგესარჩლები შენს მოსარჩლესთან და შენს შვილებს გადავარჩენ. "},
	{26, "26 საკუთარ ხორცს შევაჭმევ მჩაგვრელებს და, როგორც მაჭრით, ისე დათვრებიან საკუთარა სისხლით. მაშინ გაიგებს ყოველი ხორციელი, რომ მე ვარ უფალი, შენი მხსნელი და გამომსყიდველი, იაკობის ძლიერი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view50() {
struct ka50 poems[] = {
	{1, "1 ასე ამბობს უფალი: სად არის დედაშენის გაყრის წიგნი, რომლითაც გავუშვი იგი? ან რომელი ჩემი მევალისთვის მიმიყიდიხართ? აჰა, თქვენი ცოდვების გამო ხართ გაყიდულნი და თქვენს დანაშაულთა გამოა გაშვებული დედათქვენი. "},
	{2, "2 რატომ არავინ იყო, როცა მოვედი; როცა ვიძახდი და არავინ იყო პასუხის გამცემი? მოკლე ხომ არ არის ჩემი ხელი და იქნებ არ ძალუძს გამოსყიდვა? ან იქნებ არ არის ჩემში ძალა დასახსნელად? აჰა, ზღვებს ვაშრობ ჩემი დამუქრებით, უდაბნოდ ვაქცევ მდინარეებს, მისი თევზები ლპებიან უწყლობით და წყურვილით იხოცებიან. "},
	{3, "3 მე ვმოსავ ცას წყვდიადით და ჯვალოს ვაფარებ მოსასხამად. "},
	{4, "4 უფალმა ღმერთმა მომცა სწავლულთა ენა, რომ შემეძლოს დამაშვრალის სიტყვით გამხნევება. ის აღვიძებს, ყოველი დილით აღვიძებს ჩემს ყურს, რომ მესმოდეს, როგორც სწავლულებს ესმით. "},
	{5, "5 უფალმა ღმერთმა გამიხსნა სასმენელი და მე არ გავურჩებულვარ, უკან არ მივქცეულვარ. "},
	{6, "6 ზურგი მქონდა მიშვერილი ჩემი მცემელისთვის და ყბები - წვერების მგლეჯელისთვის; არ დამიფარავს პირისახე დამცირებისგან და ფურთხებისგან. "},
	{7, "7 მაგრამ უფალი ღმერთი შემეწეოდა მე, ამიტომაც არ დავმცირებულვარ; ამიტომაც კაჟად ვაქციე ჩემი პირისახე და ვიცი, რომ არ შევრცხვები. "},
	{8, "8 ახლოს არის ჩემი გამმართლებელი. ვინ არის, რომ მედავება? დავდგეთ ერთად, ვინ არის ჩემი მომჩივანი? ახლოს მოვიდეს. "},
	{9, "9 აჰა, უფალი შემეწევა; ვინ გამამტყუნებს? აჰა, სამოსელივით გაცვთებიან ყველანი, ჩრჩილი შეჭამთ მათ. "},
	{10, "10 ვინ არის თქვენში უფლის მოშიში, ყურისმგდებელი მისი მორჩილის ხმისა, ვინ დადის ბნელში და არა აქვს ნათელი? ესავდეს უფლის სახელს. "},
	{11, "11 აჰა, ცეცხლის წამკიდებლებო, კოცონების გამჩაღებლებო, ყველანი შემოდით თქვენი ცეცხლის ალში და თქვენს გაჩაღებულ კოცონებში. ეს დაგემართებათ ჩემი ხელით: კერპებისთვის შეიწირებით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view51() {
struct ka51 poems[] = {
	{1, "1 მისმინეთ, სიმართლის მადევარნო, უფლის მძებნელნო! შეხედეთ კლდეს, საიდანაც ხართ გამოკვეთილნი, და ორმოს ღრმულს, საიდანაც ხართ ამოთხრილნი! "},
	{2, "2 შეჰედეთ აბრაამს, თქვენს მამას, და სარას, თქვენს მშობელს, რადგან როცა ერთი იყო, მაშინ მოვუწოდე მას, ვაკურთხე და გავამრავლე. "},
	{3, "3 რადგან ანუგეშებს უფალი სიონს, ანუგეშებს ყოველ მის ნაოხარს; სამოთხედ გადააქცევს მის უდაბნოს და უფლის ბაღად მის ტრამალს, სიხარული და შვება გაჩნდება იქ, სამადლობელი და გალობის ხმები. "},
	{4, "4 გამიგონე, ჩემო ერო, და ჩემო ტომო, ყური დამიგდე, რადგან ჩემგან გამოვა რჯული და სინათლედ დავუდგენ ხალხებს ჩემს სამართალს. "},
	{5, "5 ახლოვდება ჩემი სიმართლე, მოაწია ჩემმა ხსნამ და ჩემი მკლავი განსჯის ხალხებს. მე დამენდობიან ზღვისპირელნი და ჩემი მკლავის იმედი ექნებათ. "},
	{6, "6 თვალი ააპყარით ცისკენ და დაბლა მიწას დახედეთ; რადგან ცა კვამლივით განქარდება და მიწა სამოსელივით გაცვთება, მისი მცხოვრებნი ქინქლებივით დაიხოცებიან; ჩემი ხსნა კი საუკუნოდ დარჩება და ჩემი სიმართლე არ დაირღვევა. "},
	{7, "7 მისმინეთ, სიმართლის მცოდნენო, ხალხო, ვისაც გულში გაქვთ ჩემი რჯული. ნუ გეშინიათ კაცთაგან შეურაცხებისა და მათი ლანძღვა-გინება ნუ შეგაკრთობთ; "},
	{8, "8 რადგან სამოსელივით შეჭამს მათ ჩრჩილი და მატყლივით შეჭამს მათ ჭია; ჩემი სიმართლე კი საუკუნოდ დარჩება და ჩემი ხსნა თაობიდან თაობაში გადავა. "},
	{9, "9 აღდექ, აღდექ, ძალი შეიმოსე, უფლის მკლავო! აღდექ, როგორც ძველ დროში, ძველ თაობებში. განა შენ არა ხარ რაჰაბის გამკვეთელი, ურჩხულის გამგმირავი? "},
	{10, "10 განა შენ არ ამოაშრე ზღვა, დიდი უფსკრულის წყლები? და ზღვის სიღრმეები გზად გადააქციე თავდახსნილთა გადასავლელად? "},
	{11, "11 უფლის გამოსყიდულნი მობრუნდებიან და გახარებულნი მოვლენ სიონზე; მარადიული სიხარული იქნება მათ თავზე, ლხენას და სიხარულს ეწევიან, ვაება და კვნესა კი უკუიქცევა. "},
	{12, "12 მე ვარ, მე, თქვენი ნუგეშისმცემელი! ვინა ხარ, რომ გეშინია მკვდარი კაცისა და ადამის ძისა, ბალახად რომ შეირაცხება? "},
	{13, "13 დაგვიწყებია უფალი, შენი შემქმნელი, ცათა გარდამთხმელი და მიწის დამფუძნებელი, და გეშინია მუდამდღე, გამუდმებით, მჩაგვრელის რისხვისა, დასაღუპავად რომ ემზადება. მაგრამ სად არის მჩაგვრელის რისხვა? "},
	{14, "14 მალე გათავისუფლდება დამონებული, არ მოკვდება დილეგში და არ მოაკლდება პური. "},
	{15, "15 მე ვარ უფალი, შენი ღმერთი, რომელიც აღელვებს ზღვას და ბობოქრობენ მისი ზვირთები. ცაბაოთ უფალია მისი სახელი. "},
	{16, "16 ჩავდევი ჩემი სიტყვები შენს ბაგეებში და ჩემი ხელის ჩრდილში შეგიფარე, რათა დავნერგო ახალი ცა და დავაფუძნო ახალი მიწა, რომ ვუთხრა სიონს: ჩემი ერი ხარ! "},
	{17, "17 გაიღვიძე, გაიღვიძე, ადექი, იერუსალიმო, რომელმაც შესვი უფლის ხელიდან მისი რისხვის თასი, ძირისძირამდე შესვი ფიალა, სიბრუკის თასი. "},
	{18, "18 არავინ არის მისი წინამძღოლი მის ნაშობ ვაჟებს შორის და ხელის ჩამჭიდებელი მის გაზრდილ ვაჟებს შორის. "},
	{19, "19 ეს ორი რამ შეგემთხვა შენ; ვინ შეგიცოდებს? დაღუპვა და დაქცევა, შიმშილი და მახვილი! ვითი განუგეშო? "},
	{20, "20 შენს შვილებს ქანცი გაუწყდათ, ყოველი ქუჩის თავში ყრიან, ბადეში გახვეულ ირმებივით, სავსენი უფლის რისხვით, შენი ღვთის მძვინვარებით. "},
	{21, "21 ამიტომ გაიგონე ეს, ბედშავო, მთვრალო, მაგრამ უღვინოდ! "},
	{22, "22 ასე ამბობს შენი მეუფე, უფალი და შენი ღმერთი, მოსარჩლე თავისი ხალხისა: აჰა, გართმევ შენი ხელიდან სიბრუვის თასს, ფიალას, თასს ჩემი რისხვისა, რომ მეტჯერ აღარ შესვა იგი. "},
	{23, "23 და ხელში მივცემ მას შენს მტანჯველებს, რომლებიც გეუბნებოდნენ: დაწექი, რომ გადაგიართთ, და შენც მიწასავით გახადე შენი ზურგი და ქუჩასავით - გამვლელთათვის. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view52() {
struct ka52 poems[] = {
	{1, "1 გაიღვიძე, გაიღვიძე, შეიმოსე ძალი შენი, სიონო! შეიმოსე შენი დიდების სამოსელი, იერუსალიმო, წმიდა ქალაქო, რადგან აღარ შემოგივა წინდაუცვეთელი და უწმიდური! "},
	{2, "2 ჩამოიფერთხე მტვერი, აღდექ, ტყვე იერუსალიმო! გაიხსენი შენი ქედის საკვრელები, დატყვევებულო სიონის ასულო! "},
	{3, "3 რადგან ასე ამბობს უფალი: მუქთად იყავით გაყიდულნი და უსასყიდლოდ გამოისყიდებით. "},
	{4, "4 რადგან ასე ამბობს უფალი, ღმერთი: ეგვიპტეში იყო ჩასული ჩემი ერი ოდესღაც საცხოვრებლად და აშური თრგუნაედა მას არაფრისთვის. "},
	{5, "5 რა მინდა აქ ახლა, ამბობს უფალი, როცა ჩემი ხალხი მუქთად არის წაყვანილი. მისი მთავარნი ქვითინებენ, ამბობს უფალი, და გამუდმებით, დღენიადაგ, ილანძღება ჩემი სახელი. "},
	{6, "6 ამიტომ შეიცნობს ჩემი ერი ჩემს სახელს; ამიტომ სწორედ იმ დღეს, შეიცნობს, რომ ეს მე ვარ, ვინც ლაპარაკობს: აჰა, მე ვარ! "},
	{7, "7 რა საამურია მთებზე მახარობლის ნაბიჯები, მშვიდობის გამომცხადებლის, სიკეთის მახარობლის, ხსნის გამომცხადებლის, რომელიც ეუბნება სიონს: გამეფდა შენი ღმერთი! "},
	{8, "8 აჰა, გაისმა ხმა შენი დარაჯების! ერთად აუწიეს სმას და ყიჟინებენ, რადგან თვალდათვალ ხედავენ, რომ ბრუნდება სიონზე უფალი. "},
	{9, "9 იყიჟინეთ ერთად, იერუსალიმის ნაოხარნო, რადგან ანუგეშა უფალმა თავისი ხალხი, გამოისყიდა იერუსალიმი. "},
	{10, "10 გაიშიშვლა უფალმა თავისი წმიდა მკლავი ყველა ხალხის წინაშე და იხილავენ ქვეყნის კიდეები ხსნას ჩვენი უფლისა. "},
	{11, "11 წამოდით, წამოდით, გამოდით მანდედან! უწმიდურს ნუ მიეკარებით. გამოდით მისგან! განიწმიდენით, უფლის საჭურჭლის მტვირთველნო! "},
	{12, "12 რადგან ფაცაფუცით არ გამოხვალთ და სირბილით არ ივლით, რადგან უფალი წაგიძღვებათ და ისრაელის ღმერთი გამოგყვებათ უკან. "},
	{13, "13 აჰა, მოჭკვიანდება ჩემი მორჩილი, გაიმართება, აღზევდება და დიდად ამაღლდება. "},
	{14, "14 რაზომ აძრწუნებდა ბევრს შენი ხილვა (რადგან არავინ იყო მასზე მახინჯი კაცთა შორის და მასზე შეურაცხი ადამის ძეთა შორის!), "},
	{15, "15 იმზომ გაიხარებს შენზე ბევრი ხალხი, პირს მოკუმავენ მეფეები, რადგან მოუთხრობელს იხილავენ და ჯერარსმენილს გაიგონებენ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view53() {
struct ka53 poems[] = {
	{1, "1 ვინ დაიჯერა ჩვენგან სმენილი და უფლის მკლავი ვის გამოეცხადა? "},
	{2, "2 ამოიზარდა როგორც მორჩი მის წინაშე და როგორც ფესვი ურწყული მიწიდან; არც ღირსება ჰქონია და არც მშვენება, რომ ზედ შეგვეხედა, არც იერი, რომ მივეზიდეთ. "},
	{3, "3 საძულველი იყო, კაცთაგან ათვალწუნებული, გატანჯული და სნებამორეული, ერთი იმათგანი, ვისაც პირს არიდებენ. საძულველი იყო და არად ვაგდებდით. "},
	{4, "4 ნამდვილად კი, მან იკისრა ჩვენი სნებები და იტვირთა ჩვენი სატანჯველი; ჩვენ კი გვეგონა, ღვთისგან იყო ნაცემ-ნაგვემი და დამცირებული. "},
	{5, "5 მაგრამ ის ჩვენი ცოდვებისთვის იყო დაჭრილი, ჩვენი უკეთურობებისთვის დალეწილი; მასზე იყო სასჯელი ჩვენი სიმრთელისთვის და მისი წყლულებით ჩვენ განვიკურნეთ. "},
	{6, "6 ყველანი ცხვრებივით დავეხეტებოდით, თითოეული ჩვენ-ჩვენ გზას ვადექით, უფალმა კი მას შეჰყარა ყოველი ჩვენგანის უკეთურება. "},
	{7, "7 ევნო და ეწამა, მაგრამ არ დაუძრავს ბაგე; კრავივით დასაკლავად მიიყვანეს და, როგორც ცხვარი დუმს მპარსველთა წინაშე, მასაც არ დაუძრავს ბაგე. "},
	{8, "8 საპყრობილედან და სამსჯავროდან იქნა წაყვანილი და ვინ იფიქრებდა მის მოდგმაზე, როცა ცოცხალთა მიწიდან მოიკვეთა; ჩემი ხალხის ცოდვებისთვის დაისაჯა. "},
	{9, "9 მიეცა სამარხი ბოროტეულთა გვერდით და მდიდართან ერთად თავის სიკვდილში, რადგან სიავე არ ჩაუდენია და მის ბაგეში სიცრუე არ ყოფილა. "},
	{10, "10 უფალმა ინება მისი ტანჯვა და სნება შეჰყარა. როცა გასწირავ მის სიცოცხლეს ცოდვის გამოსასყიდ მსხვერპლად, იხილავს იგი თავის ნაგრამს, გაუხანგრძლივდება დღეები, უფლის ნება მისი ხელით წარიმართება. "},
	{11, "11 თავის სულისკვეთების ნაყოფს იხილავდა და დაამდებოდა; მისი სიბრძნით ბევრს გაამართლებს მართალი, ჩემი მორჩილთ, და სხვათა შეცოდებებს იტვირთავს. "},
	{12, "12 ამიტომ მრავალში მივცემ მას წილს და ძლიერებთან ერთად გაინაწილებს ნადავლს, რადგან სასიკვდილოდ გაწირა თავი და ცოდვილთა შორის შეირაცხა; მრავალთა ცოდვები ჰქონდა გვირთად და ცოდვილებს ესარჩლებოდა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view54() {
struct ka54 poems[] = {
	{1, "1 გაიხარე, ბერწო, უშობელო! სიხარულით აყიჟინდი, სალმობის განუცდელო! რადგან მიტოვებულს მეტი შვილები ეყოლება, ვიდრე გათხოვილს, ამბობს უფალი. "},
	{2, "2 გააფართოვე შენი კარვის ადგილი და გადაჭიმონ შენი ჩარდახების გადასახურავნი. ნუ დაინანებ, დააგრძელე შენი თოკები და გაამაგრე შენი პალოები. "},
	{3, "3 რადგან მარჯვნივ და მარცხნივ განივრცობი, შენი მოდგმა ხალხებს დაიმკვიდრებს და უკაცრიელ ქალაქებს დაასახლებენ. "},
	{4, "4 ნუ გეშინია, რადგან არ შერცხვები; ნუ დაიმალები, რადგან არ იქნები შეგინებული, რადგან დაივიწყებ ყრმობისდროინდელ სირცხვილს და შენი ქვრივობის მოყივნებას აღარ გაიხსენებ. "},
	{5, "5 რადგან შენი შემქმნელია შენი ქმარი, ცაბაოთ უფალია მისი სახელი; ისრაელის წმიდაა შენი გამომსყიდველი, მთელი ქვეყნის ღმერთად წოდებული. "},
	{6, "6 რადგან უფალმა მოგიხმო, როგორც ცოლს, გაშვებულს და სულგამწარებულს, როგორც ყრმობისდროინდელ ცოლს, შეძულებულს, ამბობს შენი ღმერთი. "},
	{7, "7 მცირე ხნით მყავდი მიტოვებული და დიდი შებრალებით შეგკრებ. "},
	{8, "8 ერთწამს რისხვით დავიფარე სახე შენგან და საუკუნო წყალობით შეგიბრალებ, ამბობს შენი გამომსყიდველი უფალი. "},
	{9, "9 რადგან ეს ნოეს წყლებია ჩემთვის: როგორც დავიფიცე, რომ აღარ მოვავლენდი ნოეს წყლებს ქვეყანაზე, ასე ვფიცავ, რომ აღარ განვრისხდები შენზე და აღარ დაგემუქრები. "},
	{10, "10 რადგან მთები შეიძვრებიან და ბორცვები შეირყევიან, ჩემი შენდამი წყალთბა კი არ შეიძვრის და ჩემი სამშვიდობო აღთქმა არ შეირყევა, ამბობს შენი მწყალობელი უფალი. "},
	{11, "11 დაჩაგრულია, ქარნაცემო, უნუგეშებელო! აჰა, შემოგიშენებ კედლებს ძვირფასი ქვებით და საფუძვლად საფირონს დაგიდებ. "},
	{12, "12 ლალის ქონგურებს და ელვარე ქვის კარიბჭეებს გაგიკეთეა, მთელი გალავანი პატიოსანი ქვებისგან გექნება. "},
	{13, "13 შენი ვაჟები, ყველანი, უფლის დამოძღვრილნი იქნებიან და დიდი იქნება შენი ვაჟების კეთილდღეობა. "},
	{14, "14 სიმართლით განმტკიცდები, შორს იქნები გასაჭირისგან, რადგან არაფრის შეგეშინდება, და საფრთხისაგან, რადგან არ მოგეკარება. "},
	{15, "15 კი მოგიხდებიან, მაგრამ არა ჩემგნით; შენი მომხდური შენს წინაშე დაეცემა. "},
	{16, "16 აჰა, მე შევქმენი მჭედელი, რომელიც უბერავს ცეცხლის მუგუზლებს და ჭედავს იარაღს თავისი ხელობით. მევე შევქმენი დამღუპველი, რომ ანადგუროს. "},
	{17, "17 ყოველი იარაღი, შენს წინააღმდეგ გამოჭედილი, გაცუდდება და ყოველ ენას, შენს წინააღმდეგ აღმდგარს სამსჯავროზე, გაამტყუნებ. ესაა წილხვედრი უფლის მორჩილთა და მათი გამართლება ჩემგნით, ამბობს უფალი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view55() {
struct ka55 poems[] = {
	{1, "1 ჰოი, მწყურვალნო, ყველანი წყალთან მიდით, და ვერცხლის უქონელნო, წადით, იყიდეთ და ჭამეთ! წადით და იყიდეთ უვერცხლოდ და უსასყიდლოდ ღვინო და რძე! "},
	{2, "2 რისთვის ხარჯავთ ვერცხლს, თუ ბურს ვერ შოულობთ? რისთვის შრომობთ, თუ ვერ ძღებით? მე მომისმინეთ და შეჭამთ საუკეთესოს, ნოყიერი საკვებით დაიტკბობთ სულს. "},
	{3, "3 ყური მომაპყარით და ჩემთან მოდით; მისმინეთ და იცოცხლებს თქვენი სული. დაგიდებთ საუკუნო აღთქმას დავითის მტკიცე სიქველეთა გამო. "},
	{4, "4 აჰა, დავსვი ხალხების მოწმედ, ხალხების ბელადად და მბრძანებლად. "},
	{5, "5 აჰა, ხალხს, რომელსაც არ იცნობ, მოუწოდებ, და ხალხი, რომელიც არ გიცნობს, შენსკენ გამოეშურება უფლის, შენი ღმერთის გამო და ისრაელის წმიდის გამო, რადგან მან განგადიდა შენ. "},
	{6, "6 ეძებეთ უფალი, როცა შეიძლება მისი პოვნა; მოუხმეთ მას, როცა ახლოს არის იგი. "},
	{7, "7 მიატოვოს ბოროტეულმა თავისი გზა და ცოდვილმა კაცმა - თავისი ზრახვები; მიაქციოს უფლისკენ და ის შეიწყალებს მას, და ჩვენი ღმერთისკენ, რადგან მრავალგზის მიმტევებელია. "},
	{8, "8 რადგან ჩემი ზრახვები არ არის თქვენი ზრახვები და ჩემი გზები არ არის თქვენი გზები, ამბობს უფალი. "},
	{9, "9 რადგან როგორც ცა არის მაღალი მიწაზე, ასევე მაღალია ჩემი გზები თქვენს გზებზე და ჩემი ზრახვები თქეენს ზრახვებზე. "},
	{10, "10 რადგან როგორც წვიმა და თოვლი ჩამოდის ციდან და უკან არ ბრუნდება, თუ არ მორწყა მიწა, თუ არ აშობინა და არ აღმოაცენებინა, რომ მისცეს თესლი მთესველს და პური მჭამელს, "},
	{11, "11 ასევე იქნება ჩემი სითყვა, რომელიც გამოდის ჩემი პირიდან. ფუჭად არ დაბრუნდება ჩემთან, თუ არ აღასრულა ჩემი ნება და არ მიაღწია იმას, რისთვისაც მივავლინე. "},
	{12, "12 რადგან სიხარულით გახვალთ და მშვიდობით იქნებით ნატარები; მთები და ბორცვები მხიარულ ყიჟინას დასცემენ თქვენს წინაშე და მინდვრის ყველა ხე ტაშს შემოჰკრავს. "},
	{13, "13 ეკლის ადგილზე ალვისხე ამოვა და ქაცვის ადგილზე მურტი ამოვა; და იქნება უფლისათვის სახელად და საუკუნო ნიშნად, რომელიც არ წაიშლება. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view56() {
struct ka56 poems[] = {
	{1, "1 ასე ამბობს უფალი: შეინახეთ რჯული და ქმენით სამართალი, რადგან სადაც არის, მოვა ჩემი ხსნა და ჩემი სამართალი გაცხადდება. "},
	{2, "2 ნეტარია ის კაცი, ვინც აკეთებს ამას და ადამის ძე, ვინც ამას ეჭიდება; უმწიკვლოდ შემნახველი შაბათისა და ყოველი ავის ქმნისგან ხელის დამყენებელი. "},
	{3, "3 ნუ იტყვის უცხოს შვილი, უფალს მიკრული, უფალმა ჩემს ხალხს მომწყვიტაო, და ნუ იტყვის საჭურისი, აჰა, გამხმარი ხე ვარო, "},
	{4, "4 რადგან ამბობს უფალი: საჭურისებს, რომლებიც ინახავენ ჩემს შაბათებს, ირჩევენ ჩემთვის სასურველს და მტკიცედ უჭირავთ ჩემი აღთქმა, "},
	{5, "5 მივცემ ჩემს სახლში და ჩემს კედლებს შორის ძეგლს და სახელს, ჩემს ვაჟებზე და ასულებზე უკეთესს, საუკუნო სახელს მივცემ, რომელიც არ წაიშლება. "},
	{6, "6 უცხოთა შვილებს, რომლებიც მიეკრნენ უფალს, რომ ემსახურონ უფალს და უყვარდეთ მისი სახელი, რომ იყვნენ მისი მორჩილნი, ყველას, შაბათის უმწიკვლოდ შემნახველს და ჩემი აღთქმის მტკიგედ დამჭერს, "},
	{7, "7 მივიყვან ჩემს წმიდა მთაზე და ჩემს სამლოცველო სახლში გავახარებ. მათი აღსავლენნი და მათი მსხვერპლნი სასურველი იქნება ჩემს სამსხვერპლოზე, რადგან ჩემს სახლს ყველა ხალხის სამლოცველო სახლი დაერქმევა. "},
	{8, "8 ამბობს უფალი ღმერთი, გაფანტული ისრაელის შემკრები: კიდევაც შევკრებ და მივუმატებ უკვე შეკრებილებს. "},
	{9, "9 ველის მხეცებო და ტყის მხეცებო, ყველანი მოდით და ჭამეთ! "},
	{10, "10 დარაჯები ბრმები არიან ყველანი, უმეცრები არიან ყველანი; მუნჯი ძაღლები არიან, ყეფა არ შეუძლიათ, თვლემენ, ძირს ყრიან, ძილის მოყვარულნი. "},
	{11, "11 ხარბი ძაღლები არიან, გაუმაძღარნი. მწყემსებს არაფრის გაგება არა აქვთ, ყველა თავის გზას ადგას, თითოეული თავის კერძ ანგარებას ეძებს. "},
	{12, "12 მოდით, ვიშოვი ღვინოს და დავთვრეთო სასმელით; დღესაც გვეყოფა და ხვალისთვისაც ბევრი დარჩებაო! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view57() {
struct ka57 poems[] = {
	{1, "1 იღუპება მართალი კაცი და არავინ არის, გულთან რომ მიიტანოს; ქველი ხალხი იხოცება, მაგრამ ვერავინ ხვდება, რომ ბოროტების მიზეზით იღუპება მართალი. "},
	{2, "2 ის გადის სამშვიდობოს; განისვენებენ თავ-თავიანთ საწოლებში წრფელი გზით მავალნი. "},
	{3, "3 ახლოს მოდექით, ჯადოქრის შვილებო, მემრუშეთა და მეძავთა თესლო! "},
	{4, "4 ვის ამასხარავებთ, ვის წინააღმდეგ მოგიღიავებიათ პირი? ვისთვის გამოგიყვიათ ენა? განა ცოდვის შვილები არა ხართ თქვენ, სიცრუის თესლი? "},
	{5, "5 რომ გახურებულხართ მუხებს შორის, ყოველი ხემხვივანის ქვეშ, ბავშვთა დამკვლელნო ხევებში, კლდეთა ნაპრალებში? "},
	{6, "6 რიყის ქვებშია თქვენი ხვედრი; ისინია, ისინი შენი წილი, სწორედ მათ უღვრიდი საღვრელს და ძღვენს სწირავდი. როგორ ავიტანო ეს დამშვიდებით? "},
	{7, "7 მაღალ და დიდ მთაზე გაქვს მოწყობილი საწოლი; იქაც კი ახვედი მსხვერპლის შესაწირად. "},
	{8, "8 კარსა და წყრთილებს უკან დაგისვამს შენი ნიშნები, რადგან ჩემგან გაიშიშვლე თავი და მაღლა ახვედი, გააფართოვე შენი საწოლი და კავშირი შეჰკარი მათთან, შეიყვარე მათი საწოლი კაცობის შემყურემ. "},
	{9, "9 წახვედი მეფესთან ზეთნაცხები, გაიუხვე ნელსაცხებლები, შორიდან აგზავნი მოციქულებს, ქვესკნელამდე დაიმდაბლე თავი. "},
	{10, "10 დაგღალა ბევრმა სიარულმა, მაგრამ არ გითქვამს: ფუჭიაო. სიცოცხლეს გრძნობდი ხელში, ამიტომაც არ დაცემულხარ. "},
	{11, "11 ვის უფრთხოდი და ვისი გეშინოდა, რომ მღალატობდი და არ გახსოვდი, გულზე არ გქონდი დადებული? ალბათ რომ ვდუმდი კარგა ხანი, იმიტომაც არ გქონდა ჩემი შიში. "},
	{12, "12 მე გიცხადებდი შენს სიმართლეს და საქმეებს, მაგრამ სარგებლობა არ მოჰქონდა შენთვის. "},
	{13, "13 როცა შემომღაღადებ, მაშინ გიხსნას შენი კერპების კრებულმა. ყველას ერთიანად აიტაცებს ქარი, ქროლვა წაიღებს. ჩემი მოსავი კი ქვეყანას დაიმკვიდრებს და ჩემს წმიდა მთას დაეპატრონება. "},
	{14, "14 თქვა: გატკეპნეთ, გატკეპნეთ, გზა გაამზადეთ! მოაშორეთ ბორკილი ჩემი ხალხის გზას! "},
	{15, "15 რადგან ასე ამბობს მაღალი და აღზევებული, მარადმსუფევი და წმიდასახელიანი: მე ვსუფევ მაღალში და სიწმიდეში, მაგრამ მე ვარ ტანჯულთანაც და სულით გლახაკთან, რათა ცხოველვყო გლახაკთა სული და ცხოველვყო ტანჯულთა გული. "},
	{16, "16 რადგან საუკუნოდ არ ვიქნები დამუქრებული და სამუდამოდ არ ვიქნები განრისხებული, რადგან ჩემგნით არის სული ხორცშესხმული და სამშვინველნი მე შევქმენი. "},
	{17, "17 მისი ანგარების ცოდვის გამო განვრისხდი და ვგვემე იგი, სახე დავმალე და ვმრისხანებდი; ის კი, განდგომილი, მადიოდა თავისი გულის გზით. "},
	{18, "18 მე დავინახე მისი გზები და განვკურნავ მას, წავუძღვები და მივუზღავ ნუგეშს მას და მის თანამგლოვართ. "},
	{19, "19 და შევუქმნი სიტყვას ბაგეებში: მშვიდობა, მშვიდობა შორებელთ და ახლობელთ! ამბობს უფალი, და განვკურნავ მას. "},
	{20, "20 ბოროტეულნი აღელვებულ ზღვას გვანან, რომელიც ვერ წყნარდება, და მისი ტალღები ისვრიან ლაფსა და ტალახს. "},
	{21, "21 არ არის მშვიდობა, ამბობს ჩემი ღმერთი, ბოროტეულთათვის. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view58() {
struct ka58 poems[] = {
	{1, "1 ხმამაღლა იყვირე, თავს ნუ დაიზოგავ; ბუკივით აღიმაღლე ხმა და გამოუცხადე ჩემს ხალხს მისი დანაშაული და იაკობის სახლს მისი ცოდვები. "},
	{2, "2 ყოველდღე მეძებენ მე და ჩემი გზების გაგება სურთ იმ ხალხის მსგავსად, სიმართლით რომ იქცევიან და თავიანთი ღმერთის სამართალს არ ივიწყებენ; მართალს სამართალს მეკითხებიან და ღმერთთან სიახლოვე სურთ. "},
	{3, "3 რისთვის ვმარხულობთ, თუკი არ გვხედავ? რისთვის ვიტანჯავთ თავს, თუკი არ გვამჩნევ? აჰა, მარხვის დროს სიამეს ეძებთ და ყოველგვარ ჟინს იკლავთ. "},
	{4, "4 აჰა, მარხულობთ, რომ იდავოთ და იშუღლოთ, და ბოროტად ურტყათ მუშტები, არ მარხულობთ როგორც დღეს, რათა ცას მისწვდეს თქვენი ხმა. "},
	{5, "5 განა ასეთი მარხვაა სასურველი ჩემთვის, როცა კაცი თავს იტანჯავს და ლერწამივით ხრის თავს და ქვეშ ჯვალო და ნაცარი აქვს დაგებული? განა ამას ჰქვია მარხვა და უფლის სათნო დღე? "},
	{6, "6 განა ეს არ არის მარხვა, მე რომ ავირჩიე: რომ დახსნა ბოროტების საკვრელნი, დაწყვიტო უღლის აპეურები, თავისუფლად გაუშვა დათრგუნვილნი და დალეწო ყველა უღელი? "},
	{7, "7 რომ მშიერს გაუყო შენი პური და უსახლკარო ღარიბ-ღატაკნი სახლში შეიყვანო, რომ შემოსო შიშველი, როცა დაინახავ, და შენს სისხლსა და ხორცს არ დაემალო? "},
	{8, "8 მაშინ განთიადივით გამობრწყინდება შენი ნათელი და დაჩქარდება შენი განკურნება, შენი სიმართლე წაგიძღვება წინ და უფლის დიდება უკან გამოგყვება. "},
	{9, "9 მაშინ მოუხმობ და ხმას გაგცემს უფალი; შეჰღაღადებ და იტყვის: აქ ვარ! თუ შეწყვეტ ჩაგვრას, ცილისწამებას და ავსიტყვაობას; "},
	{10, "10 თუ სულს არ დაიშურებ მშიერისთვის და ტანჯულ კაცს გულს მოუფონებ, წყვდიადში ამოგიბრწყინდება ნათელი და შენი ბნელი შუადღესავით იქნება. "},
	{11, "11 უფლის მიერ იქნები მუდამ ნატარები და გვალვებში სულს დაგიამებს; ძვლებს გაგიმაგრებს და იქნები მორწყული ბაღივით და წყაროსავით, რომლის წყლები არასოდეს დაშრება. "},
	{12, "12 აგიშენდება ძველი ნაოხარნი, აღადგენ ძველისძველ საძირკვლებს და დაგერქმევა დანგრეულის ამშენებელი, გზათა განმაახლებელი მკვიდრი ხალხისათვის. "},
	{13, "13 თუ შეაბრუნებ შენს ფეხს შაბათისგან, რომ დათრგუნო სურვილი ჩემს წმიდა დღეს, შერაცხავ შაბათს სანეტაროდ და უფლის წმიდად მის განსადიდებლად, და პატივს მიაგებ მას, არ მოიქცევი შენი ჩვეულებით, სურვილს არ აისრულებ და ფუჭსიტყვაობას არ მოჰყვები, "},
	{14, "14 მაშინ ინეტარებ უფალში, დედამიწის მაღლობებზე დაგსვამ და იაკობის, მამაშენის, მემკვიდრეობით გამოგკვებავ, რადგან უფლის ბაგეებმა ბრძანა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view59() {
struct ka59 poems[] = {
	{1, "1 აჰა, არ დამოკლებულა უფლის ხელი რომ ხსნა არ შეეძლოს, და არ დამძიმებულა მისი ყური, რომ ვერ ისმინოს. "},
	{2, "2 მხოლოდ თქვენი უკეთურებანი იყო გამყოფი თქვენსა და თქვენს ღმერთს შორის და თქვენმა ცოდვებმა დაფარეს მისი სახე თქვენგან და აღარ ესმოდა მას, "},
	{3, "3 რადგან თქვენი ხელები სისხლით არის შებღალული და თითები თქვენი - უკეთურებით; თქვენი ბაგეები სიცრუეს მეტყველებენ, თქვენი ენა სიბილწეს ლაპარაკობს. "},
	{4, "4 არავინ მოითხოვს სიმართლით და არავინ განიკითხვის ჭეშმარიტებით; ფუჭია მათი საესავი და ცრუობენ; ჩაესახვით ამაოება და ტყუილს ბადებენ. "},
	{5, "5 ასპიტის კვერცხებს ჩეკავენ და ობობას აბლაბუდას ქსოვენ; მათი კვერცხების მჭამელი კვდება და, თუ გატყდა, უნასი იჩეკება. "},
	{6, "6 მათი აბლაბუდა სამოსელისთვის არ ვარგა და თავიანთ ნაკეთებს ვერ ჩაიცვამენ; მათი ნაკეთები უკეთური ნაკეთებია და ძალადობაა მათ ხელებში. "},
	{7, "7 ფეხები სიავისკენ გაურბით და უბრალო სისხლის დასაღვრელად მიიჩქარიან; მათი ზრახვები უკეთური ზრახვებია, ნგრევა და პარტახია მათ გზებზე. "},
	{8, "8 მშვიდობის გზები მათ არ უწყიან და მათ ბილიკებზე არ არის სამართალი; თავადვე გაიმრუდეს გზა-სავალი და მასზე მავალმა არავინ იცის მშვიდობა. "},
	{9, "9 ამიტომაც განგვშორდა სამართალი და ვერ გვწვდება სიმართლე. მოველით ნათელს და, აჰა, წყვდიადია! გაბრწყინებას - და ბნელში დავდივართ! "},
	{10, "10 ბრმებივით ვეპოტინებით კედლებს და ხელებს ვაცეცებთ, თითქოს თვალები არ გვქონდეს; ვფორხილობთ შუადღისას როგორც ბინდში, როგორც მკვდრები უკუნეთში. "},
	{11, "11 დათვებივით ვღრიალებთ ყველანი და მტრედებივით ვკვნესით; მოველით სამართალს და არ ჩანს, ხსნას და შორს არის ჩვენგან. "},
	{12, "12 რადგან გამრავლდა ჩვენი დანაშაულები შენს წინაშე და ჩვენი ცოდვები ჩვენს წინააღმდეგ მოწმობენ; რადგან ჩვენთანაა ჩვენი დანაშაულები და ჩვენი შეცოდებანი ჩვენვე ვუწყით: "},
	{13, "13 უფლის ღალატი და უარყოფა, ჩვენი ღვთისაგან განრიდება, ავის და უკუღმართის ზრახვა, სიცრუის ჩაფიქრება და გულიდან აღმოთქმა. "},
	{14, "14 უკუიქცა სამართალი და სიმართლე შორს გადგა, რადგან წაფორხილდა ქუჩაში ჭეშმარიტება და სიწრფელე ვეღარ შემოდის. "},
	{15, "15 გამქრალია ჭეშმარიტება და სიავეს განრიდებული ძლეულია; უფალი ხედავს და თვალში ავად უჩანს, რომ არ არის სამართალი. "},
	{16, "16 ხედავს, რომ არ არის კაციშვილი, და უკვირს, რომ არავინაა ქომაგი. მაშინ მისი მკლავი ეშველება და მისი სიმართლე განამტკიცებს მას. "},
	{17, "17 ჯავშანივით შეიმოსა სიმართლე და ხსნის მუზარადი დაირქვა თავზე; ნაცვალგების სამოსელი ჩაიცვა და მოსასხამივით მოისხა შური. "},
	{18, "18 საქმეთაებრ მიუზღავს ყველას: მტრებს - რისხვას, მოძულეთ - საქმეთაებრ, ზღვისპირელებს, საქმეთაებრ მიუზღავს. "},
	{19, "19 შეუშინდებიან დასავლეთში უფლის სახელს და მზის აღმოსავლეთში - მის დიდებას, რადგან ნიაღვარივით მოვა მტერი, უფლის ქარი გამორეკავს მათ. "},
	{20, "20 მოუვა გამომსყიდველი სიონს და მათ, ვინც ცოდვას განერიდნენ იაკობში, ამბობს უფალი. "},
	{21, "21 აჰა, ეს არის ჩემი აღთქმა მათთვის, ამბობს უფალი: ჩემი სული, რომელიც შენზეა, და ჩემი სიტყვები, რომლებიც ჩავდევი შენს ბაგეებში, არ მოსცილდება შენს ბაგეებს, შენი ნაშიერის ბაგეებს, შენი ნაშიერის ნაშიერის ბაგეებს, ამბობს უფალი ამიერიდან და უკუნისამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view60() {
struct ka60 poems[] = {
	{1, "1 აღდექ, განათდი, რადგან მოაწია შენმა ნათელმა და უფლის დიდება გაბრწყინდა შენზე. "},
	{2, "2 რადგან, აჰა, წყვდიადი დაფარავს ქვეყანას და ბნელი - ხალხებს, შენზე კი უფალი ინათებს და მისი დიდება გამოგეცხადება. "},
	{3, "3 ხალხები მოვლენ შენს ნათელზე და შენი სხივის ელვარებაზე. "},
	{4, "4 ირგვლივ მოატარე თვალი და იხილე: ყველანი შეკრებილან და შენსკენ მოდიან; შენი ვაჟები შორიდან მოვლენ და შენს ასულებს მხრებით მოიყვანენ. "},
	{5, "5 მაშინ დაინახავ და გაბრწყინდები, აგიძგერდება და გაგეხსნება გული, რადგან შენკენ მოიქცევა ზღვის სიუხვე და ხალხთა დოვლათი შენთან მოვა. "},
	{6, "6 უამრავი აქლემები დაგფარავენ, მიდიანის და ყეფას კოზაკები; ყველანი შებადან მოვლენ, ოქროსა და გუნდრუკს მოგიტანენ და უფლის სადიდებლებს გააცხადებენ. "},
	{7, "7 კედარის მთელი ცხვარი შენთან შეგროვდება, ნებაიოთის ვერძები შენს სამსახურში იქნებიან, ნებით ავლენ ჩემს სამსხვერპლოზე და ჩემი დიდების სახლს განვადიდებ. "},
	{8, "8 ვინ არის, ღრუბელივით რომ მოფრინავს და მტრედივით თავისი სამტრედისკენ? "},
	{9, "9 რადგან მე მელიან ზღვისპირელნი, თარშიშის ხომალდები სათავეში დგანან, რომ შორიდან მომიყვანონ შენი ვაჟები მათ ვერცხლთან და ოქროსთან ერთად უფლის, შენი ღვთის სახელისთვის და ისრაელის წმიდისათვის, რადგან მან განგადიდა შენ. "},
	{10, "10 ააშენებენ უცხოთა ძენი შენს კედლებს და მათი მეფენი დაგიწყებენ სამსახურს; თუმცა რისხვით გგვემე, მაგრამ სიყვარულით შეგიბრალებ. "},
	{11, "11 მუდამ ღია იქნება შენი კარიბჭენი, არ ჩაიკეტება დღითა და ღამით, რათა მოგიტანონ ხალხთა დოვლათი და მათი მეფეები მოგიყვანონ. "},
	{12, "12 რადგან ხალხი და სამეფო, რომელიც არ დაგემორჩილება, დაიღუპება და ეს ხალხები განადგურდებიან. "},
	{13, "13 ლიბანის დიდება შენთან შოვა, ალვა, ნეკერჩხალი და ბზა - ერთიანად, ჩემი საწმიდარის ადგილის გასამშვენებლად, რომ ჩემი კვარცხლბეკი განვადიდო. "},
	{14, "14 ქედმოხრილნი მოვლენ შენს წინაშე შენი მჩაგვრელების შვილები და შენს ფეხთა ტერფებთან დაემხობა ყველა შენი მოძულე; გიწოდებენ საუფლო ქალაქს, სიონს ისრაელის წმიდისა. "},
	{15, "15 ნაცვლად იმისა, რომ იყო მიტოვებული და მოძულებული, ვისაც არავინ ეკარება, საუკუნო მშვენებად გაგხდი, სიხარულად თაობიდან თაობაში. "},
	{16, "16 ხალხთა ღალით გამოიკვებები და მეფეთა დოვლათით გამოიზრდები, და გეცოდინება, რომ მე ვარ უფალი, შენი მხსნელი და გამომსყიდველი, იაკობის ძლიერი. "},
	{17, "17 სპილენძის ნაცვლად ოქროს მოგიტან და რკინის ნაცვლად მოგიტან ვერცხლს, ხეების ნაცვლად - სპილენძს და ქვების ნაცვლად - რკინას. შენს განმგებელად მშვიდობას გავხდი და ზედამხედველად - სიმართლეს. "},
	{18, "18 აღარ გაისმება ძალადობა შენს ქვეყანაში, ძარცვა და გლეჯა - შენს საზღვრებში; ხსნას უწოდებ შენს კედლებს და სადიდებეღას - შენს კარიბჭეებს. "},
	{19, "19 დღისით მზე აღარ გექნება მნათობად და არც მთვარის ბრწყინვალება გაგინათებს: უფალი გეყოლება საუკუნო მნათობად და შენი ღმერთი - შენს დიდებად. "},
	{20, "20 აღარ ჩაესვენება შენი მზე და შენი მთვარე აღარ დაცხრება, რადგან უფალი გეყოლება საუკუნო მნათობად და შენი გლოვის დღეები დასრულდება. "},
	{21, "21 შენი ერი ერთიანად მართალი იქნება და საუკუნოდ დაიმკვიდრებს ქვეყანას ჩემი დარგული მორჩი, ჩემ ხელთა ქმნილება, რათა იდიდოს. "},
	{22, "22 მცირე ათასად გადაიქცევა და უმრწემესი - ძლიერ ხალხად. მე, უფალი, თავის დროზე დავაჩქარებ ამას. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view61() {
struct ka61 poems[] = {
	{1, "1 სული უფლისა, ღვთისა, ჩემზეა გადმოსული, რადგან მცხო მე უფალმა გლახაკთათვის სახარებლად; მომავლინა გულშემუსვრილთა განსაკურნებლად, ტყვეთათვის თავისუფლების გამოსაცხადებლად და შებორკილთა ასახსნელად. "},
	{2, "2 გამოსაცხადებლად უფლის წყალობის წელიწადისა და ჩვენი ღვთის შურისგების დღისა, სანუგეშებლად ყოველი მგლოვიარისა; "},
	{3, "3 დასაწესებლად, რომ სიონზე მგლოვიარეთ მისცენ გვირგვინი ნაცრის ნაცვლად, სიხარულის ზეთი - გლოვის ნაცვლად, ქება-დიდების სამოსელი - მჭმუნვარების სულის ნაცვლად, რათა ეწოდოთ მათ სიმართლის მუხები - საუფლო ნერგი, რომ იდიდონ. "},
	{4, "4 ააშენებენ ძველთაძველ ნაოხარებს, აღადგენენ წინადროინდელ უკაცრიელ ადგილებს და განაახლებენ დანგრეულ ქალაქებს, თაობიდან თაობაში უკაცრიელთ. "},
	{5, "5 დადგებიან უცხონი და დამწყესავენ თქვენს ცხვარს, უცხოთა შვილები იქნებიან თქვენი მიწათმოქმედნი და მევენახენი. "},
	{6, "6 თქვენ კი უფლის მღვდლებად იქნებით წოდებულნი და ჩვენი ღვთის მსახურნი დაგერქმეგათ; ხალხთა დოვლათს შეჭამთ და მათი დიდება გადმოვა თქვენზე. "},
	{7, "7 სირცხვილის ნაცვლად ორმაგად მოგეზღვებათ; შეურაცხების ნაცვლად თავიანთ წილზე გაიხარებენ, ამიტომ თავიანთ ქვეყანაში ორმაგ წილს დაიმკვიდრებვნ. საუკუნო სიხარული ექნებათ მათ. "},
	{8, "8 რადგან მე, უფალს, მიყვარს სამართალი და მძულს ძალადობა და უკეთურება, სიყვარულით მივაგებ მათ საზღაურს და საუკუნო აღთქმას დავუდებ. "},
	{9, "9 განითქმება მათი თესლი ხალხებში და მათი მოდგმა ერებს შორის, და ყოველი მათი დამნახველი აღიარებს, რომ ისინი უფლისაგან კურთხეული თესლია. "},
	{10, "10 ლხენით ვილხენ უფალში და ხარობს ჩემი სული ჩემს ღმერთში, რადგან შემმოსა ხსნის სამოსელით სიმართლის მოსასხამი მომასხა; როგორც სიძე იმკობა გვირგვინით და როგორც დედოფალი ირთვება სამკაულებით. "},
	{11, "11 რადგან როგორც მიწა აღმოაცენებს თავის ამონაზარდს და ბაღი ამოზრდის თავის დანათესს, ასევე უფალი ღმერთი ამოზრდის სიმართლეს და სადიდებელს ყოველი ხალხის წინაშე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view62() {
struct ka62 poems[] = {
	{1, "1 სიონის გამო არ დავდუმდები და იერუსალიმის გამო არ დავმშვიდდები, ვიდრე ნათელივით არ გამოჩნდება მისი სიმართლე და ანთებული ლამპარივით მისი ხსნა. "},
	{2, "2 დაინახავენ ხალხები შენს სიმართლეს - და ყოველი მეფე შენს დიდებას; გიწოდებენ ახალ სახელს, რომელსაც უფლის ბაგეები გამოკვეთენ. "},
	{3, "3 იქნები მშვენების შარავანდად უფლის ხელში და სამეფო გვირგვინად შენი ღვთის მარჯვენაში. "},
	{4, "4 აღარ დაგიძახებენ მიტოვებულს და შენს ქვეყანას აღარ დაერქმევა უკაცრიელი, რადგან გეწოდება ჩემი სასურველი და შენს ქვეყანას - დაპატრონებული, რადგან შენ ჰსურხარ უფალს და ქვეყანას პატრონი ეყოლება. "},
	{5, "5 როგორც ყმაწვილი ეპატრონება ქალწულს, ასე დაგეპატრონებიან შენი შვილები; როგორც ხარობს სიძე დედოფლით, ასე გაიხარებს შენით შენი ღმერთი. "},
	{6, "6 შენს გალავანზე, იერუსალიმო, დავაყენე ყარაულები; არასოდეს დადუმდებიან, არც დღისით, არც ღამით. უფლის გამახსენებელნო, ნუ დაიდუმებთ! "},
	{7, "7 ნუ მოასვენებთ მას, ვიდრე არ დაამყარებს იერუსალიმს და არ გახდის მას სადიდებლად ქვეყანაზე. "},
	{8, "8 დაიფიცა უფალმა თავისი მარჯვენა და მკლავი თავის ძლიერების. თუ მივცე კვლავ ხორბალი საზრდოდ შენს მტრებს და თუ შესვან უცხოთა შვილებმა შენი ღვინო, შენი ჭირნახული! "},
	{9, "9 რადგან მისი მომკალნი თავად შეჭამენ მას და იტყვიან უფლის ქებას; მისი მკრეფელნი თავად შესვამენ ჩემი საწმიდარის ეზოებში. "},
	{10, "10 შედით, შედით, კარიბჭეებში, გაუმზადეთ სავალი ხალხს! მოასწორეთ, მოასწორეთ გზა, გაწმიდეთ ქვებისგან! დროშა აღუმართეთ ხალხებს. "},
	{11, "11 აჰა, გამოუცხადა უფალმა ქვეყნის კიდეებს: უთხარით სიონის ასულს: აჰა, მოდის შენი ხსნა. აჰა, მასთანვეა მისი საზღაური და მის წანაა მისი გასამრჯელო! "},
	{12, "12 დაარქმევენ მას: წმიდა ერი, უფლის გამოსყიდული. შენ კი დაგერქმევა: მოძებნილი ქალაქი, მიუტოვებელი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view63() {
struct ka63 poems[] = {
	{1, "1 ეს ვინ არის, ედომიდან რიამ მოდის, ბოცრადან - მეწამულით მოსილი? ეს ვინ არის თავისი ბრწყინვალე სამოსელით, თავისი ძალის სიდიადით მომავალი? ეს მე ვარ, სიმართლის მეტყველი, ხსნის შემძლებელი! "},
	{2, "2 რატომ არის წითელი შენი ტალავარი და შენი სამოსელი საწნახელში დაწურულივით? "},
	{3, "3 მე მარტო ვწურავდი ღვინოს და ხალხთაგან არავინ იყო ჩემთან. ვწურავდი ჩემი რისხვისას და ვწნეხავდი ჩემი მძვინვარებისას, და მისი სისხლი მოესხურა ჩემს სამოსელს და შევბღალე ჩემი ტალავარი. "},
	{4, "4 რადგან შურისგების დღე ჩემს გულშია და ჩემ გამოსყიდულთა წელიწადი დამდგარია. "},
	{5, "5 მიმოვიხედე და არ იყო შემწე, დავიქანცე და არ იყო მშველელი: ჩემმა მკლავმა მიხსნა მე და ჩემმა რისხვამ მიშველა მე. "},
	{6, "6 დავთრგუნე ხალხები მძვინვარებით და დავათვრე ჩემი რისხვით, მიწაზე დავღვარე მათი სისხლი. "},
	{7, "7 მადლს მივაგებ უფალს, ქება-დიდებას უფალს ყველა წყალობისთვის, რაც მოიმოქმედა ჩვენთვის უფალმა, და დიდი სიკეთისთვის, ისრაელის სახლისადმი რომ მოიმოქმედა თავისი სიბრალულით და დიდი სიყვარულით. "},
	{8, "8 თქვა: ჩემი ხალხია ისინი, შვილებია, არ ცრუობენ, და მოევლინა მათ მხსნელად. "},
	{9, "9 ყველა მათ გასაჭირში მათთვის უჭირდა და მისი პირის ანგელოზმა იხსნა ისინი. სიყვარულით და სიბრალულით გამოისყიდა, ხელში აიყვანა და დაატარებს უკუნითიდან. "},
	{10, "10 მაგრამ აჯანყდნენ და შეაწუხეს მისი წმიდა სული, ამიტომაც მტრად გაუხდა მათ და ბრძოლა გაუმართა. "},
	{11, "11 მაშინ გაიხსენა მოსეს ძველი დღეები მისმა ხალხმა: სად არის მათი ამომყვანი ზღვიდან თავისი ფარის მწყემსთან ერთად? სად არის თავისი წმიდა სულის ჩამდგმელი მათ წიაღში, "},
	{12, "12 წარმმართველი მოსეს მარჯვენისა თავისი დიდებული მკლავით? გამპობელი წყლებისა მათ წინაშე საუკუნო სახელის შესაქმნელად? "},
	{13, "13 მორევში მათი გამომყვანი წაუფორხილებლად უდაბნოს ცხენებივით? "},
	{14, "14 ხეობაში ჩასული ნახირივით დაავანა ისინი უფლის სულმა. ასე მიუძღვებოდი შენს ხალხს შენი დიდებული სახელის შესაქმნელად. "},
	{15, "15 გადმოიხედე ციდან და იხილე შენი წმიდა და დიდებული სამყოფელიდან: სად არის შენი შური და ძლიერება? შენი გულისწუხილი და სიბრალული შემწყდარია ჩემს მიმართ. "},
	{16, "16 შენა ხარ ჩვენი მამა, რადგან აბრაამმა არ უწყის ჩვენი თავი და ისრაელი არა გვცნობს ჩვენ; შენ, უფალი, ხარ ჩვენი მამა. ჩვენი გამომსყიდველია შენი სახელი უკუნითიდან. "},
	{17, "17 რისთვის გადაგვახვევინე, უფალო, შენი გზებიდან, რისთვის გაგვიქვავე გულები, რომ აღარ გვეშინია შენი? მობრუნდი შენს მორჩილთან შენი სამკვიდროს შტოთა გულისათვის! "},
	{18, "18 მცირეხანს ეპყრა შენს წმიდა ხალხს, ჩვენმა მტრებმა გათელეს შენი საწმიდათი. "},
	{19, "19 ისე ვართ, თითქოს არ გეხელმწიფოს ჩვენზე უკუნითიდან, თითქოს ზედ არ გვეწეროს შენი სახელი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view64() {
struct ka64 poems[] = {
	{1, "1 ნეტავ გააპობდე ცას და ჩამოხვიდოდე! დადნებოდნენ მთები შენს წინაშე! როგორც გიზგიზებს ცეცხლმოკიდებული ფიჩხი, როგორც წყალს ადუღებს ცეცხლი! რომ აცოდინო შენი სახელი შენს მტრებს! შეძრწუნდებოდნენ შენს წინაშე ხალხები. "},
	{2, "2 როცა ახდენდი სასწაულებს, რომელთაც არ ველოდი, ჩამოდიოდი და მთები დნებოდნენ შენს წინაშე. "},
	{3, "3 უკუნითიდან არ სმენიათ, ყური არ მოუკრავთ, თვალს არ უხილავს სხვა ღმერთი შენს გარდა, რომელიც ასე მოქცეოდეს თავის მოიმედეს. "},
	{4, "4 შენ ეგებები მას, ვინც სიხარულით სჩადის სიმართლეს და ახსოვხართ თავის გზებზე. აჰა, მრისხანე, რადგან ცოდვა გვაქვს ჩადენილი, რა ხანია, და როგორღა გადავრჩებით? "},
	{5, "5 ყველანი უწმიდურებივით შევიქენით და ყოველი ჩვენი სიქველე წარმავალი სამოსელივითაა; ფოთოლივით ვართ ყველანი დამჭკნარნი და ჩვენი ცოდვებისგან, როგორც ქარისგან, წაღებულნი. "},
	{6, "6 არავინაა შენი სახელის მხმობელი, რომ გამოიფხიზლოს თავი და მოგეჭიდოს, რადგან სახე დაფარული გაქვს ჩვენგან და გვადნობ ჩვენივე ცოდვების ხელით. "},
	{7, "7 ახლა კი, უფალო, ჩვენი მამა ხარ, ჩვენ თიხა ვართ და შენ ჩვენი გამომსახველი. შენი ხელის ქმნილება ვართ ყველანი. "},
	{8, "8 მეტისმეტად ნუ მრისხანებ, უფალო, და სამარადისოდ ნუ გახსოვს ჩვენი ცოდვა. აჰა, მოგვხედე, შენი ხალხი ვართ ყველანი! "},
	{9, "9 შენი წმიდა ქალაქები უდაბნოდ იქცა; გაუდაბურდა სიონი, გაუკაცრიელდა იერუსალიმი! "},
	{10, "10 ჩვენი სახლი, წმიდა და დიდებული, სადაც ჩვენი მამა-პაპა ქებას აღგივლენდა, ცეცხლს მიეცა და ჩვენი სანატრელი ადგილები გაუკაცრიელდა. "},
	{11, "11 ნუთუ არ შეგძრავს, უფალო, ეს ამბები? ნუთუ კვლავ იდუმებ და გაგვტანჯავ მეტისმეტად? "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view65() {
struct ka65 poems[] = {
	{1, "1 მე შევაცნობინე ჩემი თავი მათ, ვისაც არ ვუკითხივარ; აღმოვუჩნდი მათ, ვისაც არ ვუძებნივარ; მე ვუთხარი: აქა ვარ, აქა ვარ-მეთქი, ხალხს, რომელსაც არ უხსენებია ჩემი სახელი. "},
	{2, "2 დღენიადაგ ხელს ვიშვერ მოჯანყე ხალხისაკენ, რომელიც უკეთური გზით დადის, თავისი ზრახვების კვალზე; "},
	{3, "3 ხალხისაკენ, რომელიც დაუფარავად შეურაცხმყოფს გამუდმებით, მსხვერპლს სწირავს ჭალებში და აგურებზე საკმეველს აკმევს. "},
	{4, "4 დამჯდარა საფლავებს შორის და გამოქვაბულებში აღამებს, ჭამს ღორის ხორცს და მურდალი შეჭამადი უდგათ ჭურჭლებში. "},
	{5, "5 ამბობენ: განვედ, არ მომეკარო, რადგან შენზე წმიდა ვარო! ეს კვამლია ჩემს ნესტოებში, ცეცხლი, რომელიც მთელი დღე გიზგიზებს. "},
	{6, "6 აჰა, დაწერილია ჩემს წინაშე: არ დავდუმდები, ვიდრე საზღაურს არ მივაგებ; საზღაურს მივაგებ მათ უბეს. "},
	{7, "7 მათი ცოდვებისთვის და მათი მამა-პაპის ცოდვებისთვის ერთიანად, ამბობს უფალი, ყველას, ვინც საკმეველს აკმევდა მთებზე და გორაკებზე, და მგმობდნენ მე; უბეში მივუზომავ მათ წარსულ საქმეებს. "},
	{8, "8 ასე ამბობს უფალი: როცა ყურძნის მტევანში წვენი იპოვება, ამბობენ: ნუ გააფუჭებ, რადგან კურთხევაა მასში. ასევე მოვიქცევი მეც ჩემს მორჩილთა გულისათვის, რათა ყველა არ დავღუპო. "},
	{9, "9 გამოვიყვან იაკობისგან თესლს და იუდადან ჩემი მთების მემკვიდრეს; დაიმკვიდრებენ მათ ჩემი რჩეულნი და ჩემი მორჩილნი და დასახლდებიან იქ. "},
	{10, "10 გახდება შარონი ცხვრის საძოვარად და ყაქორის ხეობა - საქონლის სადგომად, ჩემი ერისათვის, რომელიც მომძებნის. "},
	{11, "11 თქვენ კი, უფლის მიმტოვებელნო, ჩემი წმიდა მთის დამვიწყებელნო, გადისათვის სუფრის გამშლელნო და მენისათვის თასის ამვსებნო, "},
	{12, "12 სამახვილოდ გაგწირავთ და ყველანი დასაკლავად დაიჩოქებთ, რადგან გეძახდით და არ გამაგონეთ, გელაპარაკებოდით და არ გესმოდათ, ავს სჩადიოდით ჩემს თვალში და, რაც მე არ მომწონდა, იმას ირჩევდით. "},
	{13, "13 ამიტომ ასე ამბობს უფალი ღმერთი: აჰა, მაძღარნი იქნებიან ჩემი მორჩილნი, თქვენ კი იშიმშილებთ! აჰა, დარწყულებული იქნებიან ჩემი მორჩილნი, თქვენ კი გეწყურებათ! აჰა, გაიხარებენ ჩემი მორჩილნი, თქვენ კი შერცხვებით! "},
	{14, "14 აჰა, იყიჟინებენ ჩემი მორჩილნი, გულმხიარულნი, თქვენ კი იყვირებთ გულმწუხარენი და ივალალებთ სულგამწარებულნი! "},
	{15, "15 დაუტოვებთ თქვენს სახელს დასაწყევლად ჩემს რჩეულებს, მოგაკვდინებთ უფალი ღმერთი და თავის მორჩილთ სხვა სახელს დაარქმევს. "},
	{16, "16 ვინც კურთხეული იქნება ამ ქვეყანაზე, ჭეშმარიტების ღმერთისგან იქნება კურთხეული; ვინც მოფიცარი იქნება ამ ქვეყანაზე, ჭეშმარიტების ღმერთის მოფიცარი იქნება; რადგან დავიწყებული იქნება წარსული სალმობანი და ჩემს თვალებს მიეფარება. "},
	{17, "17 რადგან, აჰა, შევქმნი ახალ ცას და ახალ მიწას, აღარ გაიხსენება წინანდელნი და ფიქრადაც არავის მოუვა. "},
	{18, "18 მხოლოდ იხარებთ და იმხიარულებთ სულმუდამ ჩემს შექმნილზე, რადგან, აჰა, შევქმნი იერუსალიმს სამხიარულოდ და მის ხალხს - გასახარებლად. "},
	{19, "19 მეც გავიხარებ იერუსალიმის გამო და ვიმხიარულებ ჩემი ხალხის გამო; აღარ გაისმება იქ ხმა ტირილისა და ხმა მოთქმისა. "},
	{20, "20 არ იქნება იქ არც ბავშვი და არც მოხუცებული, რომლის დღეები არ იყოს ავსებული; რადგან ჭაბუკივით მოკვდება ასი წლის კაცი, ცოდვილი კი ას წელსაც დაწყევლილი იქნება. "},
	{21, "21 ააშენებენ სახლებს და იცხოვრებენ, ჩაყრიან ვაზებს და მათ ნაყოფს შეჭამენ. "},
	{22, "22 არ ააშენებენ სხვის საცხოვრებელად, არ დარგავენ სხვის შესაჭმელად, რადგან ჩემი ხალხის ასაკი ხის ასაკივით იქნება და თავადვე გაცვეთენ საკუთარი ხელის ქმნილებას ჩემი რჩეულები. "},
	{23, "23 ფუჭად აღარ დაშვრებიან ისინი და დასაღუპად აღარ დაბადებენ შვილებს; რადგან უფლის კურთხეული მოდგმა იქნებიან ისინი და მათი შთამომავალნი მათთანავე იქნებიან. "},
	{24, "24 ისე მოხდება, რომ ვიდრე მომიხმობდნენ, ხმას გავცემ; ვიდრე ლაპარაკში იქნებიან, მოსმენილი მექნება უკვე. "},
	{25, "25 მგელი და კრავი ერთად დაიწყებენ ძოვას და ლომი ძროხასავით შეჭამს თივას, გველს კი საჭმელად მტვერი ექნება; არ იბოროტებენ და არც რასმე წაახდენენ მთელს ჩემს წმიდა მთაზე, ამბობს უფალი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view66() {
struct ka66 poems[] = {
	{1, "1 ასე ამბობს უფალი: ცა ტახტია ჩემი და ქვეყანა კვარცხლბეკი ჩემი. სად არის სახლი, რომელსაც მიშენებთ მე და სად არის ადგილი, ჩემი დასავანებელი? "},
	{2, "2 ჩემმა ხელმა შექმნა ეს ყველაფერი და ასე გაჩნდა ეს ყველაფერი, ამბობს უფალი. აი, ვის მივაპყრობ მზერას - გლახაკს და სულგამწარებულს, ჩემი სიტყვების მოშიშს. "},
	{3, "3 არის ხარის დამკვლელი და არის კაცის მკვლელი, ცხვრის შემწირველი და ძაღლის კისრის მომგრეხელი, ძღვენის აღმავლენი და ღორის სისხლის დამღვრელი, გუნდრუკის მკმეველი და კერპის მაკურთხეველი. როგორც თითოეულს თავისი გზა აქვს არჩეული და თითოეულის სული თავის სიბილწეში პოულობს ნეტარებას, "},
	{4, "4 მეც ავარჩევ მათთვის უბედურებებს და შიშისზარს მოვუვლენ მათ, რადგან ვეძახდი და არავინ იყო პასუხის გამცემი, ვლაპარაკობდი და არავის ესმოდა, სიავეს სჩადიოდნენ ჩემს თვალში და, რაც არ მომწონდა, იმას ირჩევდნენ. "},
	{5, "5 ისმინეთ უფლის სიტყვა, მისი სიტყვის მოშიშნო: ამბობენ თქვენი ძმები - თქვენი მოძულენი და ჩემი სახელისთვის თქვენი უარისმყოფელნი: გამოაჩინოს უფალმა თაეისი დიდება, რომ ვიხილოთო თქვენი სიხარული. მაგრამ შერცხვებიან ისინი. "},
	{6, "6 აჰა, ხმა განგაშისა ქალაქიდან, ხმა სასახლიდან, ხმა უფლისა, თავისი მტრებისთვის საზღაურის მიმგებელისა. "},
	{7, "7 ვიდრე ასტკივდებოდა, დაბადა; ვიდრე კრუნჩხვა დაემართებოდა, ვაჟი გააჩინა. "},
	{8, "8 ვის სმენია ასეთი ამბავი, ვის უნახავს ასეთი საქმე? თუ შობილა მიწა ერთ დღეში, თუ დაბადებულა ხალხი ერთბაშად, როგორც ასტკივდა სიონს და დაბადა თავისი ვაჟები? "},
	{9, "9 მე ვარ გამღები საშოსი და როგორ არ ვაშობიებ? ამბობს უფალი. როგორ ჩავკეტავ, როცა მე ვარ მამშობიარებელი? ამბობს შენი ღმერთი. "},
	{10, "10 იმხიარულეთ იერუსალიმთან ერთად და ყველამ გაიხარეთ მისით, მისმა მოყვარულებმა! ლხენით ილხინეთ მასთან ერთად, ყველამ, ვინც მოთქვამდა მასზე! "},
	{11, "11 რათა მოსწოვოთ და გაძღეთ მისი მანუგეშებელი ძუძუებით; რათა მოსწოვოთ და დატკბეთ მისი დიდების სიუხვით. "},
	{12, "12 რადგან ასე ამბობს უფალი: აჰა, მოვაფენ მასზე მშვიდობას, მდინარესავით და ხალხთა დოვლათს მოვარდნილი ნიაღვარივით. გამოიზრდებით, მკლავზე იქნებით აყვანილი და მუხლებზე ნასათუთები. "},
	{13, "13 როგორც დედა ანუგეშებს კაცს, ისე განუგეშებთ მეც და იერუსალიმში იქნებით ნუგეშცემულნი. "},
	{14, "14 დაინახავთ და გაიხარებს თქვენი გული, ჯეჯილივით აყვავდება თქვენი ძვლები და უფლის ხელი გამოეცხადება მის მორჩილთ, რისხვა კი - მის მტრებს. "},
	{15, "15 რადგან, აჰა, ცეცხლში მოდის უფალი და ქარიშხალივითაა მისი ეტლი, რომ გიზგიზში მოაქციოს თავისი რისხვა და ცეცხლის ალში - თავისი ბრაზი. "},
	{16, "16 რადგან ცეცხლით განსჯის უფალი და თავისი მახვილით ყოველ ხორციელს, და ბევრნი იქნებიან უფლის დახოცილნი. "},
	{17, "17 ისინი, ვინც იწმიდებიან და სუფთავდებიან საკერპო ჭალებში შესასვლელად, სადაც ერთმანეთის გვერდით მდგარნი ჭამენ ღორის ხორცს, უსურმაგს და თაგვებს, ერთიანად დაიღუპებიან, ამბობს უფალი. "},
	{18, "18 რადგან მე ვუწყი მათი საქმენი და ზრახვანი. მოდის ჟამი ყველა ხალხისა და ენათა შეკრებისა; მოვლენ და იხილავენ ჩემს დიდებას. "},
	{19, "19 დავადებ მათ ნიშანს და მათ ნატამალს გავგზავნი ხალხებთან: თარშიშში, ფულში, ლუდში, მშვიდლოსნებთან, თუხალში, იავანში, შორეულ კუნძულებზე, სადაც არ სმენიათ ჩემი ამბავი და არ უხილავთ ჩემი დიდება. ისინი გაუცხადებენ ხალხებს ჩემს დიდებას. "},
	{20, "20 წამოიყვანენ შენს ძმებს ყოველი ხალხიდან ძღვნად უფლისათვის ცხენებით და ეტლებით, ტახტრევნებით, ჯორებით და აქლემებით ჩემს წმიდა მთაზე, იერუსალიმში, ამბობს უფალი, როგორც ისრაელიანებს მიაქვთ ძღვენი სუფთა ჭურჭლებით საუფლო სახლში. "},
	{21, "21 მათგანაც ავიყვან მღვდლებად და ლევიანებად, ამბობს უფალი. "},
	{22, "22 რადგან როგორც ახალი ცა და ახალი მიწა, რომელთაც შევქმნი, წარდგებიან ჩემს წინაშე, ამბობს უფალი, ასევე წარდგება თქვენი თესლი და თქვენი სახელი. "},
	{23, "23 მაშინ იქნება, რომ ახალი მთვარიდან ახალ მთარემდე, შაბათიდან შაბათამდე, მოვა ყოველი ხორციელი ჩემს წინაშე სათაყვანოდ, ამბობს უფალი. "},
	{24, "24 გამოვლენ და იხილავენ ჩემი შემცოდე ხალხის გვამებს, რადგან მათი მატლი არ მოკვდება და მათი ცეცხლი არ ჩაქრება. და შესაზიზღი იქნებიან ყოველი ხორციელისთვის. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};