#include <map>
#include <string>
class Bible30
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
	struct ka6	{ int val; const char *msg; };
	struct ka7	{ int val; const char *msg; };
	struct ka8	{ int val; const char *msg; };
	struct ka9	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 ამოსის, თეკოაყელი მწყემსის სიტყვები, რომლებიც იხილა მან ისრაელის გამო იუდას მეფის ყუზიას დროს და ისრაელის მეფის იერობოამ იოაშის ძის დროს, მიწისძვრამდე ორი წლით ადრე. "},
	{2, "2 თქვა: უფალი იგრგვინებს სიონიდან და ხმას გამოსცემს იერუსალიმიდან; ატირდებიან მწყემსთა საძოვრები და გახმება ქარმელის მწვერვალი. "},
	{3, "3 სამ დანაშაულს ვაპატიებ დამასკოს, მეოთხეს აღარ ვაპატიებ, რადგან რკინის უროებით ნაყავდნენ გალაადს. "},
	{4, "4 ცეცხლს შევუნთებ ხაზაელის სახლს და ცეცხლი შეჭამს ბენ-ჰადადის დარბაზებს. "},
	{5, "5 დავლეწავ დამასკოს ურდულებს, ამოვძირკვავ ავენის ხეობის მკვიდრთ და ედენის სახლის კვერთხისმპყრობელს; გადაიხვეწება არამის ხალხი კირში, ამბობს უფალი. "},
	{6, "6 ასე თქვა უფალმა: სამ დანაშაულს ვაპატიებ ღაზას, მეოთხეს აღარ ვაპატიებ, რადგან დედაბუდიანად გადახვეწეს ისრაელი, რომ ედომს დარჩენოდა ქვეყანა. "},
	{7, "7 ცეცხლს წავუკიდებ ღაზის გალავანს და ცეცხლი შთანთქავს მის დარბაზებს. "},
	{8, "8 ამოვძირკვავ აშდოდის მკვიდრთ და აშკელონელ კვერთხისმპყრობელს; ყეკრონზეც შევმართავ ხელს და საბოლოოდ გაწყდება ფილისტიმელთა ნატამალი, ამბობს უფალი. "},
	{9, "9 ასე ამბობს უფალი: სამ დანაშაულს ვაპატიებ ტვიროსს, მეოთხეს აღარ ვაპატიებ, რადგან ტყვედ ჩაუგდეს მთელი ხალხი ედომს, აღარ გაიხსენეს ძმური აღთქმა. "},
	{10, "10 ცეცხლს წავუკიდებ ტვიროსის გალავანს და ცეცხლი შთანთქავს მის დარბაზებს. "},
	{11, "11 ასე ამბობს უფალი: სამ დანაშაულს ვაპატიებ ედომს, მეოთხეს აღარ ვაპატიებ, რადგან მახვილით ხელში დევნიდა თავის ძმას, ჩაიხშო სიბრალული; მუდამ ბრდღვინავს რისხვით და ბრაზს ინახავს გულში. "},
	{12, "12 ცეცხლს წავუკიდებ თემანს და ცეცხლი შთანთქავს ბოცრას დარბაზებს. "},
	{13, "13 ასე თქვა უფალმა: სამ დანაშაულს ვარტიებ ყამონელებს, მეოთხეს აღარ ვაპატიებ, რადგან ფატრავდნენ ორსულ ქალებს გალაადში, რომ გაეფართოებინათ თავიანთი საზღვრები. "},
	{14, "14 ცეცხლს წავუკიდებ რაბას გალავნებს და ცეცხლი შთანთქავს მის დარბაზებს ყიჟინით ბრძოლის დღეს, ქარბორბალათი ქარიშხლიან დღეს. "},
	{15, "15 ტყვედ ჩავარდება მათი მეფე დიდებულებთან ერთად, ამბობს უფალი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 ასე ამბობს უფალი: სამ დანაშაულს ვაპატიებ მოაბს, მეოთხეს აღარ ვაპატიებ: კირად გამოწვა ედომის მეფის ძვლები. "},
	{2, "2 ცეცხლს წავუკიდებ მოაბს და შთანთქავს კერიოთის დარბაზებს; მოკვდება მოაბი აურზაურში, საომარ ყიჟინაში და საყვირის ხმაზე. "},
	{3, "3 ამოვძირკვავ მსაჯულს მისი წიაღიდან და დავხოცავ ყველა მთავარს მასთან ერთად, ამბობს უფალი. "},
	{4, "4 ასე ამბობს უფალი: სამ დანაშაულს ვაპატიებ იუდას, მეოთხეს აღარ ვაპატიებ, რადგან უკუაგდეს უფლის რჯული და არ იცავენ მის წესებს; რადგან გზა-კვალი აურიეს მათ ცრუღმერთებმა, რომელთაც მათი მამა-პაპა მისდევდა. "},
	{5, "5 ცეცხლს წავუკიდებ იუდას და შთანთქაას იერუსალიმის დარბაზებს. "},
	{6, "6 ასე ამბობს უფალი: სამ დანაშაულს ვაპატიებ ისრაელს, მეოთხეს აღარ ვაპატიებ, რადგან ვერცხლზე ჰყიდიან მართალს და ღარიბ-ღატაკს - წყვილი ხამლისთვის. "},
	{7, "7 მიწის მტვერს ნატრულობენ უმწეოთა თავზე და გზიდან აცდენენ ბეჩავ ხალხს; შვილი და მამა ერთ ქალთან მიდიან ჩემი წმიდა სახელის შესალახავად. "},
	{8, "8 დაგირავებულ სამოსელზე განრთხმულან ყოველ სამსხვერპლოსთან და გამოძალულ ღვინოს სვამენ ღვთის სახლში. "},
	{9, "9 გავანადგურებ ამორეველს მის წინაშე, კედარივით რომ ამაღლდა და მუხასავით გამაგრდა; გავანადგურებ მაღლა მის ნაყოფს და დაბლა მის ფესვებს. "},
	{10, "10 იმისთვის გამოგიყვანეთ ეგვიპტის ქვეყნიდან და ორმოცი წელი გატარეთ უდაბნოში, რომ დაგემკვიდრებინათ ამორეველთა ქვეყანა. "},
	{11, "11 შენს ძეთა შორის აღვძარი წინასწარმეტყველნი და შენს ყრმათა შორის - მოწმიდარნი; ასე არ იყო, ისრაელიანებო? ამბობს უფალი. "},
	{12, "12 თქვენ კი ღვინოს ასმევდით მოწმიდარებს და უბრძანებდით წინასწარმეტყველთ, ნუ წინასწარმეტყველებთო! "},
	{13, "13 აჰა, გადაგჯეგავთ, როგორც ძნებით სავსე ურემი ჯეგავს. "},
	{14, "14 მკვირცხლი დაკარგავს სირბილის უნარს და ძლიერი ძალას ვერ მოიცემს; მამაცი კაცი თავს ვერ დაიხსნის. "},
	{15, "15 მშვილდის მპყრობელი ვერ გაუძლებს, ვერც ფეხმარდი ვერ გადარჩება და ვერც მხედარი ვერ იხსნის თავს. "},
	{16, "16 გულმაგარიც კი მამაცთა შორის შიშველი გაიქცევა იმ დღეს, ამბობს უფალი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 ისმინეთ ეს სიტყვა, რომელიც თქვენზე თქვა უფალმა, ისრაელიანებო, მთელს მოდგმაზე, რომელიც ეგვიპტიდან გამოვიყვანე: "},
	{2, "2 მხოლოდ თქვენ გცანით მთელი ქვეყნის მოდგმათა შორის, ამიტომაც მოგკითხავთ ყველა თქვენს დანაშაულს. "},
	{3, "3 აბა, თუ ივლიან ორნი ერთად, თუ ერთმანეთში არ შეთანხმდნენ? "},
	{4, "4 აბა, თუ ბრდღვინავს ლომი ტყეში, როცა ნადავლი არ ეგულება? თუ გამოსცემს ხმას ბოკვერი თავისი ბუნაგიდან, როცა არაფერი აქვს შესაპყრობი? "},
	{5, "5 აბა თუ გაებმება ჩიტი ბადეში, თუ მიწაზე მახე არ არის დაგებული? "},
	{6, "6 აბა, თუ ახმიანებულა ბუკი ქალაქში და ხალხს არ შეშინებია? თუ მომხდარა ქალაქში უბედურება უფლის უნებურად? "},
	{7, "7 რადგან არაფერს მოიმოქმედებს უფალი ღმერთი, თუ არა გაუცხადა თავისი საიდუმლო თავის მორჩილთ, წინასწარმეტყველთ. "},
	{8, "8 ლომი ბრდღვინავს - ვინ არ შეშინდება! უფალი ღმერთი ლაპარაკობს - ვინ არ გაქადაგდება! "},
	{9, "9 გააგონეთ დარბაზებს აშდოდში და დარბაზებს ეგვიპტის ქვეყანაში, უთხარით: შეიკრიბენით სამარიის მთებზე და იხილეთ დიდი შფოთი მათ შორის და ძალადობა მის წიაღში! "},
	{10, "10 არ იციან სიმართლის ქმნა, ამბობს უფალი, ძარცვა-გლეჯით ავსებენ საგანძურებს თავიანთ დარბაზებში. "},
	{11, "11 ამიტომ ასე ამბობს უფალი ღმერთი: მტერი შემოადგება ირგვლივ ქვეყანას, დაამხობს შენს ციხე-სიმაგრეს და დარბაზებს გაგიძარცვავს. "},
	{12, "12 ასე ამბობს უფალი: როგორც მწყემსი გადაარჩენს ლომის ხახიდან ორ ბარკალს ან ყურის ნაგლეჯს, ასე გადარჩებიან ისრაელიანები, სამარიაში საწოლის კუთხეში მსხდომნი და დამასკოში სარეცელზე. "},
	{13, "13 ისმინეთ და დაუმოწმეთ იაკობის სახლს, ამბობს უფალი ღმერთი, ცაბაოთ ღმერთი. "},
	{14, "14 რადგან იმ დღეს, როცა მოვკითხავ ისრაელს მის შეცოდებებს და მოვკითხავ სამსხვერპლოთა გამო ბეთელში, მოეკვეთება რქები სამსხვერპლოს და მიწად დაემხობა. "},
	{15, "15 დავაქცევ ზამთრის სახლს ზაფხულის სახლთან ერთად, განადგურდება სპილოსძვლის სახლები და ბევრი სახლი აღიგვება, ამბობს უფალი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 ისმინეთ ეს სიტყვა, ბაშანის ფურებო, სამარიის მთებზე რომ ხართ, რომ ავიწროებთ ბეჩავთ და ჩაგრავთ ღარიბ-ღატაკთ, რომ ეუბნებით თქვენს პატრონებს: მოგვიტანე, რომ დავლიოთო! "},
	{2, "2 დაიფიცა უფალმა ღმერთმა თავისი სიწმიდე და, აჰა, დაგიდგებათ დღე და თქვენ კაუჭებით წაგათრევენ და თქვენს შთამომავლებს თევზის ანკესებით. "},
	{3, "3 ერთმანეთის მიყოლებით გახვალთ კედლის განანგრევში და დააგდებთ სასახლეს, ამბობს უფალი. "},
	{4, "4 წადით ბეთელში და შესცოდეთ; გილგალში ამრავლეთ ცოდვები, ყოველ დილას მიიტანეთ თქვენი მსხვერპლი და ყოველ მესამე დღეს თქვენი მეათედები. "},
	{5, "5 შესწირეთ სამადლობელი მსხვერპლი საფუვრიანიდან, გაახმაურეთ თქვენი ნებაყოფლობითი შესაწირი და ქვეყანას გააგებინეთ; რადგან ეს გიყვართ, ისრაელიანებო, ამბობს უფალი ღმერთი. "},
	{6, "6 აკაწკაწებული კბილები მოგეცით ყველა თქვენს ქალაქში და უპურობა ყველა თქვენს ადგილზე, მაინც რ მოქცეულხართ ჩემკენ, ამბობს უფალი. "},
	{7, "7 წვიმაც კი შეგიწყვიტე მკამდე სამი თვით ადრე; ვაწვიმებდი ერთ ქალაქზე და მეორე ქალაქზე არ ვაწვიმებდი; ერთი ყანა წვიმით ირწყვებოდა, მეორე ყანა კი, უწვიმარი, ხმებოდა. "},
	{8, "8 მიეხეტებოდა ორი, სამი ქალაქი ერთ ქალაქში წყლის სასმელად და ვერ იკლავდნენ წყურვილს; მაინც არ მოქცეულხართ ჩემკენ, ამბობს უფალი. "},
	{9, "9 მუსრი გაგავლეთ ჟანგით და სიყვითლით; თქვენი უამრავი ბაღები და ვენახები, ლეღვები და ზეთისხილი კალიამ გადაჭამა, და მაინც არ მოქცეულხართ ჩემკენ, ამბობს უფალი. "},
	{10, "10 შეგყარეთ ჭირი ეგვიპტის გზაზე, ვხოცავდი მახვილით თქვენს ყრმებს, როცა თქვენს ცხენებს ვიტაცებდი და თქვენი ბანაკების სიმყრალე თქვენს ნესტოებს მივაწვდინე; მაინც არ მოქცეულჰართ ჩემკენ, ამბობს უფალი. "},
	{11, "11 დაგაქციეთ, როგორც ღმერთმა სოდომი და გომორი დააქცია, და მაინც არ მოქცეულხართ ჩემკენ, ამბობს უფალი. "},
	{12, "12 ამიტომ ასე მოგექცევი, ისრაელ, და რაკი ამას დაგმართებ, გაემზადე შენი ღვთის შესახვედრად, ისრაელ! "},
	{13, "13 რადგან, აჰა, მთათა გამომსახველი და ქარის შემქმნელი, კაცისთვის მისი ფიქრის გამომცხადებელი, ნათლის ბნელად გარდამქცეველი და ქვეყნის სიმაღლეთა გამთელავი! უფალი, ცაბაოთ ღმერთია მისი სახელი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 ისმინეთ ეს სიტყვა, რომელსაგ ვამბობ თქვენზე როგორც საგოდებელს, ისრაელის სახლო! "},
	{2, "2 დაეცა, ვეღარ დგება ისრაელის ქალწული; მიწაზეა განრთხმული, არავინაა მისი წამომყენებელი! "},
	{3, "3 რადგან ასე ამბობს უფალი ღმერთი: ქალაქს, ათასის გამომყვანს, ასიღა შერჩა და ასის გამომყვანს ათიღა შერჩა ისრაელის სახლიდან. "},
	{4, "4 რადგან ასე ეუბნება უფალი ღმერთი ისრაელის სახლს: მეძებეთ და ცოცხალი დარჩებით! "},
	{5, "5 ნუ ეძებთ ბეთელს და გილგალში ნუ მიდიხართ, ბერშებაში ნუ დაიარებით; რადგან დატყვევდება გილგალი და ბეთელი გაცამტვერდება. "},
	{6, "6 ეძებეთ უფალი და ცოცხალი დარჩებით, რომ ცეცხლივით არ წაეკიდოს იოსების სახლს შთასანთქმელად, რადგან არავინ იქნება ჩამქრობი ბეთელში. "},
	{7, "7 სამართალს აბზინდად რომ აქცევთ და სიმართლეს მიწად რომ თელავთ! "},
	{8, "8 რომელმაც შექმნა ხომლი და ორიონი, რომელიც წყვდიადს დილად გადააქცევს და დღეს ღამესავით აბნელებს, რომელიც უხმობს ზღვის წყლებს და მიწის პირზე მოაქცევს, უფალია მისი სახელი. "},
	{9, "9 დაქცევით დაატყდება თავს ძლიერს და ეწევა დაქცევა ციხე-სიმაგრეს. "},
	{10, "10 შეიძულეს სამსჯავროში მამხილებელი და წრფელად მოუბარი შეიძაგეს. "},
	{11, "11 ამიტომ, რაკი თრგუნავთ ბეჩავ ხალხს და უკანასკნელ ლუკმას აცლით, თლილი ქვებით ააგებთ სახლებს, მაგრამ იქ ვერ იცხოვრებთ; საუცხოო ვენახებს გააშენებთ, მაგრამ ვერ შესვამთ მათ ღვინოს. "},
	{12, "12 რადგან ვუწყი უამრავი შენი დანაშაული და მძიმე ცოდვები: მართალს ავიწროებთ, ქრთამს იღებთ და სამსჯავროდან დევნით ღარიბ-ღატაკთ. "},
	{13, "13 ამიტომაც დუმს ბრძენი კაცი ასეთ დროში, რადგან ეს ცუდი დროებაა. "},
	{14, "14 ეძიეთ სიკეთე და არა ბოროტება, რათა ცოცხალი დარჩეთ; ცაბაოთ უფალიც თქვენთან იქნება, როგორც თქვენ ამბობთ. "},
	{15, "15 შეიძულეთ ბოროტი და კეთილი შეიყვარეთ; დაამკვიდრეთ სამსჯავროში სამართალი, ვინძლო შეიწყალოს უფალმა, ცაბაოთ ღმერთმა, იოსების ნატამალი! "},
	{16, "16 რადგან ასე ამბობს უფალი, ცაბაოთ ღმერთი: ყველა ქუჩაზე გლოვა იქნება და იტყვიან ყველა შუკაში: ვაი, ვაი! მოუხმობენ მიწათმოქმედს საგოდებლად და საგლოვად - მოტირალებს. "},
	{17, "17 ყველა ვენახში გლოვა იქნება; როცა მე გავივლი შენს წიაღში, ამბობს უფალი. "},
	{18, "18 ვაი, უფლის დღის მონატრულთ! რისთვის გინდათ უფლის დღე? ბნელია ის და არა ნათელი. "},
	{19, "19 როგორც ლომისგან გაქცეულ კაცს დახვდება დათვი, ან სახლში მისული მიეყუდება კედელს და გველი უკბენს. 20. განა ბნელი არ არის უფლის დღე და არა ნათელი? წყვდიადია და შუქის ნატამალი არ არის მასში. "},
	{20, "21 მძულს, მეზიზღება თქვენი დღესასწაულები და ვეღარ ვისუნთქავ თქვენს ზეიმებში! "},
	{21, "22 აღარ ვიღებ თქვენს აღსავლენებს და ძღვენებს, ზედაც არ ვუყურებ ნასუქალ ხარებს, სამადლობელ მსხვერპლად რომ მწირავთ. "},
	{22, "23 განმარიდეთ თქვენი სიმღერების ხმაურს, თქვენი ქნარის ხმის მოსმენა აღარ მსურს. "},
	{23, "24 წყალივით იდინოს სამართალმა და იყოს სიმართლე დაუწყვეტელ ნაკადულივით. "},
	{24, "25 განა მოგქონდათ ჩემთან მსხვერპლი და ძღვენი ორმოცი წლის მანძილზე უდაბნოში, ისრაელის სახლო? "},
	{25, "26 დაატარებდით თქვენი მოლოქის და ქიუნის კარავს, თქვენს კერპებს, თქვენი ღმერთის რაფანის ვარსკვლავს, თქვენსავე ნაკეთებს. "},
	{26, "27 ამიტომაც დამასკოს იქით გადაგასახლებთ, ამბობს უფალი. ცაბაოთ ღმერთია მისი სახელი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ka6 poems[] = {
	{1, "1 ვაი უზრუნველთ სიონზე და უდარდელთ სამარიის მთაზე, სახელოვანთ უპირველეს ხალხში, ვისთანაც მიდის ისრაელის სახლი! "},
	{2, "2 მოიარეთ ქალნე და ნახეთ, იქიდან დიდი ხამათისკენ გასწიეთ და ფილისტიმელთა გეთში ჩადით; ნუთუ თქვენზე უკეთესია ეს სამეფოები ან თქვენს საზღვრებზე ვრცელია მათი საზღვრები? "},
	{3, "3 ხომ არ გგონია, დააცდევინო უბედურების დღეს ან დააჩქარო მძლავრობის მეუფება? "},
	{4, "4 განისვენებენ სპილოსძვლის საწოლზე და ნებივრობენ თავიანთ სარეცლებზე; ფარის ცხვარსა და ბაგაზე დაბმულ ხბორებს ჭამენ. "},
	{5, "5 ქნარს აჟღრიალებენ და დავითივით მგალობელად მოაქვთ თავი. "},
	{6, "6 სამსხვერპლო თასებიდან სვაშენ ღვინოს და საუცხოო ზეთით იპოხებიან, არ ადარდებთ იოსების უბედურება. "},
	{7, "7 ამიტომაც ტყვედ წავლენ ახლა, ტყვეთა თავში მოქცეულნი, და ნებიერთა სიხარულის ხმა შეწყდება. "},
	{8, "8 დაიფიცა უფალმა ღმერთმა თავისი თავი, ამბობს უფალი, ცაბაოთ ღმერთი: მძულს იაკობის ამპარტავნობა და მეზიზღება მისი დარბაზები; ამიტომაც გავცემ ქალაქს და მის სისავსეს. "},
	{9, "9 მოხდება ისე, თუ ათი კაცი დარჩა ერთ სახლში, დაიხოცებიან ყველანი. "},
	{10, "10 როცა ნათესავი თუ ჭირისუფალი აიღებს მათ, რომ სახლიდან გაიტანოს მათი ძვლები, და ეტყვის სახლის შიგნით მყოფს, თუ დაგრჩა ვინმეო, ისიც უპასუხებს: არავინო, უთხრას: ჩუმად! რადგან არ ეგების უფლის სახელის ხსენება. "},
	{11, "11 რადგან, აჰა, უფალი ბრძანებს და დააქუცმაცებს დიდ სახლებს და გააცამტვერებს პატარა სახლებს. "},
	{12, "12 თუ ურბენიათ ცხენებს კლდეზე, ან თუ უხნავთ ის ხარებით? თქვენ კი შხამად აქციეთ სამართალი და აბზინდად - სიმართლის ნაყოფი. "},
	{13, "13 ჰე, ამაოებით მოხარულნო, რომ ამბობთ, განა ჩვენი ძალით არ შევიძინეთ რქებიო? "},
	{14, "14 რადგან, აჰა, აღვძრავ ხალხს შენს წინააღმდეგ, ისრაელის სახლო, ამბობს უფალი, ცაბაოთ ღმერთი, და მიგკუჭავს ხამათის მისადგომიდან უდაბნოს ხევამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct ka7 poems[] = {
	{1, "1 ასე მახილვინა უფალმა ღმერთმა: აჰა, შექმნა მან კალია გვიანი ბალახის ამოსვლისას, და აჰა, აღმოცენდა ბალახი სამეფო თიბვის შემდეგ. "},
	{2, "2 როცა მოათავა ბალახის ჭამა მიწაზე, მე ვთქვი: უფალო ღმერთო, მომიტევე! რა გადაარჩენს იაკობს? რადგან ისედაც მცირეა-მეთქი. "},
	{3, "3 გადაიფიქრა უფალმა, არ მოხდებაო, თქვა უფალმა. "},
	{4, "4 ასე მახილვინა უფალმა ღმერთმა: აჰა, მოუხმო უფალმა ღმერთმა ცეცხლის სასჯელს და შთანთქა მან დიდი უფსკრული და შთანთქა ყანები. "},
	{5, "5 მე ვთქვი: უფალო ღმერთო! დააყენე. რა გადაარჩენს იაკობს? რადგან ისედაც მცირეა-მეთქი. "},
	{6, "6 გადაიფიქრა უფალმა, არც ეს მოხდებაო, თქვა უფალმა ღმერთმა. "},
	{7, "7 ასე მახილვინა: აჰა, დგას უფალი შვეულ კედელზე და შვეული უჭირავს ხელში. "},
	{8, "8 მითხრა უფალმა: რას ხედავ, ამოს? ვუთხარი: შვეულს. თქვა უფალმა: აჰა, დავდებ შვეულს ჩემი ერის, ისრაელის, შუაგულში; მეტს აღარ ვაპატიებ მას. "},
	{9, "9 გაუკაცურდება ისაკის გორაკები და ისრაელის საწმიდარები განადგურდება; მახვილით აღვდგები იერობოამის სახლის წინააღმდეგ. "},
	{10, "10 შეუთვალა ამაციამ, ბეთილის მღვდელმა, იერობოამს, ისრაელის მეფეს: შეთქმულებას გიწყობს ამოსი შუაგულ ისრაელის სახლში; მიწა ვერ აიტანს მის სიტყვებს; "},
	{11, "11 რადგან ასე ამბობს ამოსი: მახვილით მოკვდება იერობოამი და ტყვედ წავაო ისრაელი თავისი ქვეყნიდან. "},
	{12, "12 უთხრა ამაციამ ამოსს: მისანო, გაიქეცი იუდას ქვეყანაში, იქ ჭამე პური და იქ იწინასწარმეტყველე. "},
	{13, "13 ბეთილში ნუღარ იწინასწარმეტყველებ, რადგან ის სამეფო საწმიდარია და სამეფო სახლი. "},
	{14, "14 მიუგო ამოსმა ამაციას და უთხრა: მე არც წინასწარმეტყველი ვარ და არც წინასწარმეტყველის შვილი; მწყემსი ვარ მე და ლეღვის მომყვანი; "},
	{15, "15 წამომიყვანა უფალმა ფარიდან და მითხრა უფალმა, წადი, უწინასწარმეტყველე ჩემს ერს, ისრაელსო. "},
	{16, "16 ახლა ისმინე უფლის სიტყვა. შენ ამბობ, არ იწინასწარმეტყველო ისრაელის წინააღმდეგ და არ იქადაგო ისაკის სახლის წინააღმდეგო. "},
	{17, "17 ამიტომ, ასე ამბობს უფალი: შენი ცოლი იბოზებს ქალაქში და შენი ვაჟები და ასულები მახვილით დაეცემიან; შენი მიწა საბელით დანაწილდება, უწმიდურ მიწაზე მოკვდები შენ, ისრაელი კი ტყვედ წავა თავისი ქვეყნიდან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct ka8 poems[] = {
	{1, "1 ასე მახილვინა უფალმა. ღმერთმა: აჰა, მოწეული ხილით სავსე კალათა. "},
	{2, "2 მითხრა: რას ხედავ, ამოს? ვთქვი: მოწეული ხილით სავსე კალათას-მეთქი. მითხრა უფალმა: მოაწია ჩემი ერის, ისრაელის, ბოლომ. მეტს აღარ ვაპატიებ. "},
	{3, "3 მოთქმით იტყვიან სასახლის სიმღერებს იმ დღეს, ამბობს უფალი ღმერთი; უამრავი გვამი იქნება, ყველგან დაყრიან უხმოდ. "},
	{4, "4 ისმინეთ ეს, ღარიბ-ღატაკთა შთამთქმელნო და ქვეყნის ბეჩავთა დამღუპველნო; "},
	{5, "5 რომ ამბობთ: როდის გავა ახალმთვარობა, რომ გავყიდოთ პური, და შაბათი, რომ გავაღოთ ბეღლები, შევამციროთ ეფა, გავზარდოთ შეკელი და ვიტყუოთ მრუდე სასწორითო, "},
	{6, "6 ვიყიდოთ ვერცხლით ბეჩავნი და წყვილი ხამლით ღარიბ-ღატავნი, პურის განაცხრიბოი კი გავყიდოთო? "},
	{7, "7 დაიფიცა უფალმა იაკობის დიდება, თუკი ოდესმე დავივიწყოო ერთი მათი ნამოქმედარიც კი. "},
	{8, "8 ნუთუ არ შეიძვრება მიწა ამის გამო და არ მოჰყვება გოდებას ყოველი მისი მკვიდრი? აიწევს ერთიანად ნილოსივით, მოვარდება და უკუიქცევა ეგვიპტის მდინარესავით. "},
	{9, "9 იმ დღეს იქნება, ამბობს უფალი ღმერთი, რომ შუადღისას ჩავიყვან მზეს და დღის სინათლეზე დავაბნელებ ქვეყანას. "},
	{10, "10 დღესასწაულებს გლოვად გადაგიქცევთ და ყველა თქვენს სიმღერას გოდებად; ჯვალოს შემოგახვევთ წელზე და ყველა თავი გადაიპარსება; ავატირებ ქვეყანას, როგორც მხოლოდშობილზე ტირიან, და მწარე დღე იქნება მისი ბოლო! "},
	{11, "11 აჰა, დგება დღეები, ამბობს უფალი ღმერთი, როცა მოვავლენ ქვეყანაზე შიმშილს, არა შიმშილს პურისას და წყურვილს წყლისას, არამედ უფლის სიტყვების მოსმენისას. "},
	{12, "12 იხეტიალებენ ზღვიდან ზღვამდე და ჩრდილოეთიდან აღმოსავლეთამდე; მი-და-მოივლიან უფლის სიტყვის საძებნელად, მაგრამ ვერ ჰპოვებენ. "},
	{13, "13 ღონე მიეხდებათ იმ დღეს მშვენიერ ქალწულებს და ჭაბუკებს წყურვილისგან. "},
	{14, "14 სამარიელ აშიმას მოფიცარნი, რომ ამბობენ: ცოცხალია შენი ღმერთი დანი, ცოცხალია ბერშებას გზაო, დაეცემიან და ვეღარ ადგებიან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct ka9 poems[] = {
	{1, "1 ვიხილე უფალი, სამსხვერპლოსთან მდგარი, და მითხრა: დაჰკარი ბუღაურებს, რომ შეირყეს ზღურბლი და თავზე დაამხე მათ ყველას; მათ საბოლოოს მე მოვსვრავ მახვილით, გამქცევი ვერსად გაიქცევა და მათგან ვერავინ გადარჩება. "},
	{2, "2 ქვესკნელშიც რომ ჩაიმარხონ, იქიდან ამოიყვანს მათ ჩემი ხელი; ზეცაშიც რომ ავიდნენ, იქიდან ჩამოვიყვან; "},
	{3, "3 ქარმელის წვერზეც რომ დაიმალონ, იქაც მოვძებნი მათ და შევიპყრობ; ჩემს თვალსაც რომ მიეფარონ ზღვის ფსკერზე, იქ ვუბრძანებ გველებს და დაკბენენ მათ; "},
	{4, "4 ტყვედაც რომ ჩაუვარდნენ თავიანთ მტრებს, ვუბრძანებ მახვილს, რომ იქ ამოხოცოს ისინი. თვალს დავადგამ მათ ავბედითად და არა სასიკეთოდ. "},
	{5, "5 უფალი, ცაბაოთ ღმერთი, თუ შეეხო დედამიწას, დადნება იგი და ატირდება ყოველი მისი მკვიდრი; აიწევს მაღლა ნილოსივით და დაბლა დაიწევს ეგვიპტის მდინარესავით. "},
	{6, "6 ცაში აიგო მან თავისი სამყოფელი და მიწაზე დააფუძნა თავისი კამარა; მოუხმობს ზღვის წყლებს და მიუღვრის მათ მიწის ზედაპირს: უფალია. მისი სახელი. "},
	{7, "7 განა ქუშელებივით არა ხართ ჩემთვის, ისრაელიანებო? ამბობს უფალი; განა ისრაელი არ ამოვიყვანე ეგვიპტის ქვეყნიდან, როგორც ფილისტიმელნი ქაფთორიდან და არამელნი კირიდან? "},
	{8, "8 აჰა, უფლის ღვთის თვალი ცოდვილ სამეფოზეა და აღვგვი მას პირისაგან მიწისა, ოღონდ საბოლოოდ არ აღვგვი იაკობის სახლს, ამბობს უფალი. "},
	{9, "9 რადგან, აჰა, ვბრძანებ და გავცხრილავ ისრაელის სახლის ყველა ხალხს, როგორც ხორბალი იცხრილება. და ერთი მარცვალიც არ დავარდება მიწაზე. "},
	{10, "10 მახვილით მოკვდება ყველა ცოდვილი ჩემს ერში, რომლებიც ამბობენ, არ დააჩქარებო, არ მოაწევო ჩვენზე უბედურებას. "},
	{11, "11 მას ჟამს აღვმართავ დავითის დამხობილ კარავს: გარღვეულს შევკრავ, დანგრეულს გავამთელებ და ისე აღვადგენ, როგორც ძველ დროში იყო. "},
	{12, "12 რათა დაეპატრონონ ედომის ნატამალს და ყველა ხალხს, რომელთა შორისაც ჩემი სახელი იხსენიება, ამბობს უფალი ღმერთი, ამის მოქმედი. "},
	{13, "13 აჰა, დადგება დრო, ამბობს უფალი, როცა მხვნელი თავს წაადგება მომკელს და ყურძნის მწურავი - მთესველს; ბადაგად დაიღვრებიან მთები და გორაკები დადნებიან. "},
	{14, "14 დავაბრუნებ ტყვეობიდან ჩემს ერს, ისრაელს; ააშენებენ გაუკაცურებულ ქალაქებს და დასახლდებიან; ჩაყრიან ვენახებს და დალევენ მათ ღვინოს, გააშენებენ ბაღებს და შეჭამენ მათ ხილს. "},
	{15, "15 დავნერგავ მათ თავიანთ მიწაზე და აღარ აღმოიფხვრებიან თავიანთი მიწიდან, რომელიც მივეცი მათ, ამბობს უფალი, შენი ღმერთი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};