#include <map>
#include <string>
class Bible19
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
	struct ka6	{ int val; const char *msg; };
	struct ka7	{ int val; const char *msg; };
	struct ka8	{ int val; const char *msg; };
	struct ka9	{ int val; const char *msg; };
	struct ka10	{ int val; const char *msg; };
	struct ka11	{ int val; const char *msg; };
	struct ka12	{ int val; const char *msg; };
	struct ka13	{ int val; const char *msg; };
	struct ka14	{ int val; const char *msg; };
	struct ka15	{ int val; const char *msg; };
	struct ka16	{ int val; const char *msg; };
	struct ka17	{ int val; const char *msg; };
	struct ka18	{ int val; const char *msg; };
	struct ka19	{ int val; const char *msg; };
	struct ka20	{ int val; const char *msg; };
	struct ka21	{ int val; const char *msg; };
	struct ka22	{ int val; const char *msg; };
	struct ka23	{ int val; const char *msg; };
	struct ka24	{ int val; const char *msg; };
	struct ka25	{ int val; const char *msg; };
	struct ka26	{ int val; const char *msg; };
	struct ka27	{ int val; const char *msg; };
	struct ka28	{ int val; const char *msg; };
	struct ka29	{ int val; const char *msg; };
	struct ka30	{ int val; const char *msg; };
	struct ka31	{ int val; const char *msg; };
	struct ka32	{ int val; const char *msg; };
	struct ka33	{ int val; const char *msg; };
	struct ka34	{ int val; const char *msg; };
	struct ka35	{ int val; const char *msg; };
	struct ka36	{ int val; const char *msg; };
	struct ka37	{ int val; const char *msg; };
	struct ka38	{ int val; const char *msg; };
	struct ka39	{ int val; const char *msg; };
	struct ka40	{ int val; const char *msg; };
	struct ka41	{ int val; const char *msg; };
	struct ka42	{ int val; const char *msg; };
	struct ka43	{ int val; const char *msg; };
	struct ka44	{ int val; const char *msg; };
	struct ka45	{ int val; const char *msg; };
	struct ka46	{ int val; const char *msg; };
	struct ka47	{ int val; const char *msg; };
	struct ka48	{ int val; const char *msg; };
	struct ka49	{ int val; const char *msg; };
	struct ka50	{ int val; const char *msg; };
	struct ka51	{ int val; const char *msg; };
	struct ka52	{ int val; const char *msg; };
	struct ka53	{ int val; const char *msg; };
	struct ka54	{ int val; const char *msg; };
	struct ka55	{ int val; const char *msg; };
	struct ka56	{ int val; const char *msg; };
	struct ka57	{ int val; const char *msg; };
	struct ka58	{ int val; const char *msg; };
	struct ka59	{ int val; const char *msg; };
	struct ka60	{ int val; const char *msg; };
	struct ka61	{ int val; const char *msg; };
	struct ka62	{ int val; const char *msg; };
	struct ka63	{ int val; const char *msg; };
	struct ka64	{ int val; const char *msg; };
	struct ka65	{ int val; const char *msg; };
	struct ka66	{ int val; const char *msg; };
	struct ka67	{ int val; const char *msg; };
	struct ka68	{ int val; const char *msg; };
	struct ka69	{ int val; const char *msg; };
	struct ka70	{ int val; const char *msg; };
	struct ka71	{ int val; const char *msg; };
	struct ka72	{ int val; const char *msg; };
	struct ka73	{ int val; const char *msg; };
	struct ka74	{ int val; const char *msg; };
	struct ka75	{ int val; const char *msg; };
	struct ka76	{ int val; const char *msg; };
	struct ka77	{ int val; const char *msg; };
	struct ka78	{ int val; const char *msg; };
	struct ka79	{ int val; const char *msg; };
	struct ka80	{ int val; const char *msg; };
	struct ka81	{ int val; const char *msg; };
	struct ka82	{ int val; const char *msg; };
	struct ka83	{ int val; const char *msg; };
	struct ka84	{ int val; const char *msg; };
	struct ka85	{ int val; const char *msg; };
	struct ka86	{ int val; const char *msg; };
	struct ka87	{ int val; const char *msg; };
	struct ka88	{ int val; const char *msg; };
	struct ka89	{ int val; const char *msg; };
	struct ka90	{ int val; const char *msg; };
	struct ka91	{ int val; const char *msg; };
	struct ka92	{ int val; const char *msg; };
	struct ka93	{ int val; const char *msg; };
	struct ka94	{ int val; const char *msg; };
	struct ka95	{ int val; const char *msg; };
	struct ka96	{ int val; const char *msg; };
	struct ka97	{ int val; const char *msg; };
	struct ka98	{ int val; const char *msg; };
	struct ka99	{ int val; const char *msg; };
	struct ka100	{ int val; const char *msg; };
	struct ka101	{ int val; const char *msg; };
	struct ka102	{ int val; const char *msg; };
	struct ka103	{ int val; const char *msg; };
	struct ka104	{ int val; const char *msg; };
	struct ka105	{ int val; const char *msg; };
	struct ka106	{ int val; const char *msg; };
	struct ka107	{ int val; const char *msg; };
	struct ka108	{ int val; const char *msg; };
	struct ka109	{ int val; const char *msg; };
	struct ka110	{ int val; const char *msg; };
	struct ka111	{ int val; const char *msg; };
	struct ka112	{ int val; const char *msg; };
	struct ka113	{ int val; const char *msg; };
	struct ka114	{ int val; const char *msg; };
	struct ka115	{ int val; const char *msg; };
	struct ka116	{ int val; const char *msg; };
	struct ka117	{ int val; const char *msg; };
	struct ka118	{ int val; const char *msg; };
	struct ka119	{ int val; const char *msg; };
	struct ka120	{ int val; const char *msg; };
	struct ka121	{ int val; const char *msg; };
	struct ka122	{ int val; const char *msg; };
	struct ka123	{ int val; const char *msg; };
	struct ka124	{ int val; const char *msg; };
	struct ka125	{ int val; const char *msg; };
	struct ka126	{ int val; const char *msg; };
	struct ka127	{ int val; const char *msg; };
	struct ka128	{ int val; const char *msg; };
	struct ka129	{ int val; const char *msg; };
	struct ka130	{ int val; const char *msg; };
	struct ka131	{ int val; const char *msg; };
	struct ka132	{ int val; const char *msg; };
	struct ka133	{ int val; const char *msg; };
	struct ka134	{ int val; const char *msg; };
	struct ka135	{ int val; const char *msg; };
	struct ka136	{ int val; const char *msg; };
	struct ka137	{ int val; const char *msg; };
	struct ka138	{ int val; const char *msg; };
	struct ka139	{ int val; const char *msg; };
	struct ka140	{ int val; const char *msg; };
	struct ka141	{ int val; const char *msg; };
	struct ka142	{ int val; const char *msg; };
	struct ka143	{ int val; const char *msg; };
	struct ka144	{ int val; const char *msg; };
	struct ka145	{ int val; const char *msg; };
	struct ka146	{ int val; const char *msg; };
	struct ka147	{ int val; const char *msg; };
	struct ka148	{ int val; const char *msg; };
	struct ka149	{ int val; const char *msg; };
	struct ka150	{ int val; const char *msg; };
	struct ka151	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 ნეტარია კაცი, რომელიც არ მისდევს უღმრთოთა რჩევას და ცოდვილთა გზას არ ადგას, არ ზის ავყიათა საკრებულოში. "},
	{2, "2 არამედ უფლის რჯულშია მისი მისწრაფება და მის რჯულზე ფიქრობს იგი დღედაღამ. "},
	{3, "3 და იქნება იგი წყლის ნაკადებთან დანერგილ ხესავით, თავის დროზე რომ იძლევა ნაყოფს და არ დაჭკნება ფოთოლი მისი. და ყოველივეში, რასაც იქმს, წარმატებულია. "},
	{4, "4 უღმრთონი ასე კი არ არიან, ბზეს წააგვანან, ქარისგან აღგვილს. "},
	{5, "5 ამიტომ ვერ წამოიმართებიან უღმრთონი სასამართლოში, ხოლო ცოდვილნი - მართალთა კრებულში. "},
	{6, "6 რადგან უფალმა უწყის მართალთა გზა, უღმრთოთა გზა კი წარიხვეტება. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 რატომ ბობოქრობენ ხალხები და ერები ესწრაფიან ამაოებას? "},
	{2, "2 ამქვეყნიური მეფეები ამხედრებულან და შეთქმულან წარჩინებულნი უფლის წინააღმდეგ, და მის ცხებულზე გალაშქრებულან. "},
	{3, "3 დავგლეჯთ მათს სადავეებს და მოვიშორებთ მათს ხუნდებსო. "},
	{4, "4 მკვიდრი ზეცისა გაიცინებს, უფალი აბუჩად აიგდებს მათ. "},
	{5, "5 მაშინ ეტყვის მათ თავისი რისხვით და თავისი გულისწყრომით შეაძრწუნებს: "},
	{6, "6 მე ვაკურთხე მეფე ჩემი სიონზე - ჩემს წმიდა მთაზე. "},
	{7, "7 გაუწყებთ უფლის კანონმდებლობას: უფალმა მითხრა: ძე ხარ ჩემი, დღეს გშობე შენ; "},
	{8, "8 მთხოვე და მოგცემ ხალხებს სამემკვიდროდ, ხოლო ქვეყნის კიდეებს - სამკვიდრებლად. "},
	{9, "9 შენ დალეწავ მათ რკინის კვერთხით, მეთუნის ჭურჭელივით დაამსხვრევ. "},
	{10, "10 ახლა კი გონს მოდით, მეფენო! განისწავლენით, ქვეყნის მსაჯულნო! "},
	{11, "11 ემსახურეთ უფალს შიშით და შეჰღაღადეთ თრთოლვით. "},
	{12, "12 ეამბორეთ ძეს, რომ არ განრისხდეს იგი და არ დაიღუპოთ გზაში, რადგან მალე აღიგზნება რისხვა მისი. ნეტარ არს ყველა, ვინც მასზეა მინდობილი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 ფსალმუნი დავითისა. როცა გაურბოდა თავის ძეს აბესალომს.  "},
	{2, "2 უფალო! როგორ მომრავლდნენ ჩემი მტრები. ჩემს წინააღმდეგ აღდგა მრავალი. "},
	{3, "3 ბევრი ეუბნება ჩემს სულს: არ არის მისთვის შემწეობა ღმერთისმიერი. სელა. "},
	{4, "4 და შენ, უფალო, ჩემი ფარი ხარ, ჩემი დიდება და ამმაღლებელი ჩემი თავისა. "},
	{5, "5 ჩემი ხმით მოვუხმობ უფალს და ის მიპასუხებს თავის წმიდა მთიდან. სელა. "},
	{6, "6 ვწვები, ვიძინებ და ვიღვიძებ, რადგან უფალი შემწეა ჩემი. "},
	{7, "7 ვერ შემაშინებს სიმრავლე ხალხის, გარს რომ მერტყმიან ყოველი მხრიდან. "},
	{8, "8 აღსდეგ, უფალო, მიხსენი, ჩემო ღმერთო, რადგან შენ ულეწავ ყბებს ყველა ჩემს მტერს, ბოროტეულებს უმუსრავ კბილებს. "},
	{9, "9 უფლისაგან არის ხსნა და ქენი კურთხევა შენს ერზე. სელა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 გუნდის ლოტბარს, დავითის საგალობელი, ფსალმუნი.  "},
	{2, "2 მიპასუხე, ოდეს მოგიხმობ, ჩემი სიმართლის ღმერთო. შევიწროების ჟამს შენ მაძლევდი გასაქანს, შემიწყალე და ისმინე ჩემი ლოცვა. "},
	{3, "3 შვილნო კაცისა! როდემდე იქნება ღირსება ჩემი დამცირებული? როდემდე გეყვარებათ ამაოება და ეძიებთ სიყალბეს? სელა. "},
	{4, "4 უწყოდეთ, რომ ამოირჩია ღმერთმა წმიდანი: უფალი ისმენს, ოდეს მოვუხმობ მას. "},
	{5, "5 ძრწოდეთ და ნუ შესცოდავთ, გულში იზრახეთ იქვენს საწოლებში და იყუჩეთ. სელა. "},
	{6, "6 შესწირეთ შესაწირავები სიმართლისა და უფალს მიენდეთ. "},
	{7, "7 მრავალნი ამბობენ: ვინ გვიჩვენებს სიკეთეს? გადმოგვაფინე შუქი შენი სახისა, უფალო! "},
	{8, "8 შენ მიეცი სიხარული ჩემს გულს უფრო მეტი, ვიდრე მათია პურის და მაჭრის სიუხვისას. "},
	{9, "9 მშვიდად დავწვები და დავიძინებ, რადგან შენ, უფალო, მხოლოდ შენ მამყოფებ უშიშრად. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 დავითის ფსალმუნი სალამურზე, გუნდის ლოტბარისათვის.  "},
	{2, "2 ჩემი ნათქვამი ყურად იღე, უფალო, ჩასწვდი ჩემს გულისთქმას. "},
	{3, "3 ისმინე ჩემი ღაღადი, მეუფევ ჩემო და ღმერთო ჩემო, რადგან შენს მიმართ ვლოცულობ. "},
	{4, "4 უფალო! დილდილობით მოისმინე ჩემი ხმა, დილაადრიან შევემზადები შენთვის და დაგელოდები. "},
	{5, "5 რადგან არა ხარ ბოროტების მოყვარული ღმერთი, ბოროტება ვერ დაისადგურებს შენთან. "},
	{6, "6 ვერ დადგებიან ქედმაღალნი შენს წინაშე: შენ გძულს ყველა, ვინც უსამართლობის ჩამდენია. "},
	{7, "7 შენ დაღუპავ სიცრუის მთქმელს; სისხლისმსმელი და მაოხრებელნი კი წავლენ შენგან. "},
	{8, "8 ხოლო მე შენი უხვი წყალობით მოვალ შენს სახლში, ვეთაყვანები შენს წმიდა ტაძარს შენდამი შიშით. "},
	{9, "9 უფალო! მატარე შენი სიმართლის გზით ჩემი მტრების გამო, გაასწორე შენი გზა ჩემს წინაშე. "},
	{10, "10 რადგან არ არის ჭეშმარიტება მათს ბაგეებში, ბილწია მათი შიგნეულობა, მათი ხორხი ღია საფლავია, მათი ენები ქლესაობენ. "},
	{11, "11 განსაჯე ისინი, ღმერთო, დაეცნენ თავიანთი ზრახვების გამო; თავიანთი ცოდვების სიმრავლისათვის მოიშორე ისინი, რადგან აღსდგენ შენს წინააღმდეგ,"},
	{12, "12 და გაიხაროს ყველამ, ვინც შენზეა მონდობილი, იმხიარულონ უკუნისამდე; და დაიცავ მათ, და გაიხარებენ შენით, ვისაც შენი სახელი უყვარს. "},
	{13, "13 რადგან შენ აკურთხებ მართალს, უფალო; შენი წყალობით შემოსავ, როგორც ჯავშნით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ka6 poems[] = {
	{1, "1 რვასიმიან საკრავზე საგალობელი, გუნდის ლოტბარს, დავითის ფსალმუნი.  "},
	{2, "2 უფალო! შენი გულისწყრომით ნუ მამხილებ და შენი რისხვით ნუ დამსჯი. "},
	{3, "3 შემიწყალე, უფალო, რადგან უძლური ვარ; განმკურნე, უფალო, რადგან შეძრწუნდნენ ჩემი ძვლები. "},
	{4, "4 ჩემი სულიც შეძრწუნებულია და შენ, უფალო, როდემდე? "},
	{5, "5 შემობრუნდი, უფალო, გადაარჩინე ჩემი სული, მიხსენი შენი წყალობისათვის. "},
	{6, "6 რადგან არ არის შენი გახსენება სიკვდილში; ვიღა შეგასხამს ქვესკნელიდან ქება-დიდებას? "},
	{7, "7 მოვიქანცე ვაებით. ყოველღამ ვბან ჩემს საწოლს, ცრემლებით ვალტობ ჩემს სარეცელს. "},
	{8, "8 დაიშრიტა წუხილით ჩემი თვალი, გადმომცვივდა ყოველთა მტერთა გამო. "},
	{9, "9 განმშორდით ყოველნი, მოქმედნი უსამართლობისა, რადგან ისმინა უფალმა ჩემი გოდების ხმა. "},
	{10, "10 ისმინა უფალმა ჩემი ვედრება; უფალი შეიწყნარებს ჩემს ლოცვას. "},
	{11, "11 გაწბილდებიან და საშინლად შეძრწუნდებიან ყოველნი მტერნი ჩემნი; უკუიქცევიან და შერცხვებიან მეყსეულად. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct ka7 poems[] = {
	{1, "1 გალობა დავითისა, ქუშ ბენიამინელის გამო რომ უმღერა უფალს:  "},
	{2, "2 უფალო, ღმერთო ჩემო! შენზე ვარ მონდობილი. მიხსენი ყველა მდევნელისაგან და გადამარჩინე. "},
	{3, "3 რათა არ დაგლიჯოს, ვითარცა ლომმა, სული ჩემი, დალეწოს და არ იყოს მხსნელი. "},
	{4, "4 უფალო, ღმერთო ჩემო! თუ რამ გავაკეთე, თუ უსამართლობა გამოვიდა ჩემი ხელიდან, "},
	{5, "5 თუ ჩემთვის მშვიდობის მსურველს ბოროტებით გადავუხადე და გავაგდე თუნდაც ჩემი მტერი ხელცარიელი, - "},
	{6, "6 დაე, დევნოს მტერმა სული ჩემი და წამოეწიოს, დაე, დედამიწაზე დაანარცხოს სიცოცხლე ჩემი და მტვრად აქციოს ღირსება ჩემი. სელა. "},
	{7, "7 აღსდექ, უფალო, შენი რისხვით, ამაღლდი გულისწყრომით ჩემს მტრებზე, გამოიღვიძე ჩემთვის სამართალზე, რომელიც შენ დადე მცნებად. "},
	{8, "8 გარს შემოგეხვევა გუნდი ხალხთა, მის ზემოთ ამაღლდი მწვერვალზე. "},
	{9, "9 უფალი განსჯის ერებს. განმიკითხე, უფალო, ჩემი სიმართლით და უბიწოებით, რომელიც ჩემშია. "},
	{10, "10 შეწყდეს ბოროტება ბიწიერთა, ხოლო მართალი გაამართლე, რადგან შენა ხარ გულისა და ზრახვების შემმოწმებელი, ღმერთო მართალო! "},
	{11, "11 ჩემი ფარი უპყრია ღმერთს, გულმართალთა მხსნელს. "},
	{12, "12 ღმერთი მართალი მსაჯულია და ღმერთი - რისხვის მფრქვეველი ყოველდღე. "},
	{13, "13 მახვილს გალესავს - თუ არ მორჯულდა, შვილდს მოზიდავს და დაუმიზნებს. "},
	{14, "14 მომაკვდინებელი იარაღი გაამზადა მისთვის, ისრებს წარმართავს მდევნელთა მიმართ. "},
	{15, "15 აჰა, ჩაესახება სიმრუდე, დაორსულდება უკუღმართობით და შობს სიცრუეს. "},
	{16, "16 ორმო თხარა და ღრმად ამოკვეთა, სხვისთვის გაამზადა ორმო და თვითონ ჩავარდა. "},
	{17, "17 მისი ავგულობა მის თავზე დატრიალდება და მისი ბოროტება მის თხემზე დაეცემა. "},
	{18, "18 ვადიდებ უფალს მისი სიმართლით და ვუგალობებ უზენაესი უფლის სახელს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct ka8 poems[] = {
	{1, "1 გუნდის ლოტბარს, გათის საკრავზე, დავითის ფსალმუნი.  "},
	{2, "2 უფალო, ჩვენო მბრძანებელო! რაოდენ დიდია შენი სახელი მთელ ქვეყანაზე, ცათა ზემოთ სწვდება შენი დიდება. "},
	{3, "3 ჩვილთა და ძუძუმწოვართა ბაგეებიდან გამართე ხოტბა, რათა დაგედუმებინა შენი მტერი და შურისმგებელი. "},
	{4, "4 როცა შევხედავ შენს ცას - შენი თითების ნამოქმედარს, მთვარესა და ვარსკვლავებს, რომლებიც დააფუძნე, "},
	{5, "5 რა არის კაცი, რომ იხსენიებ? ან ძე ადამიანისა, რომ ყურადღებას აქცევ? "},
	{6, "6 ბევრად არ დაგიმცირებია იგი ანგელოზებზე; დიდება და ღირსება დაადგი გვირგვინად. "},
	{7, "7 გააბატონე იგი შენი ხელის ნამოქმედარზე; ყოველივე მას დაუმორჩილე. "},
	{8, "8 ყველა პირუტყვი - წვრილფეხა და მსხვილფეხა, ასევე ნადირი ველისა; "},
	{9, "9 ფრინველი ცისა და თევზი ზღვისა, და წყლის ბილიკებით რომ მოძრაობენ. "},
	{10, "10 უფალო, ჩვენო მბრძანებელო! რაოდენ დიდია შენი სახელი მთელს ქვეყანაზე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct ka9 poems[] = {
	{1, "1 გუნდის ლოტბარს, ლაბანის სიკვდილზე, დავითის ფსალმუნი.  "},
	{2, "2 გადიდებ, უფალო, მთელი გულით, ვილაპარაკებ შენს სასწაულებს. "},
	{3, "3 ვიმხიარულებ და ვილხენ შენით, ვუმღერებ შენს სახელს, უზენაესო. "},
	{4, "4 ოდეს მიიქცევიან ჩემი მტრები უკან, მარცხს განიცდიან და დაიღუპებიან შენს წინაშე. "},
	{5, "5 რადგან შენ გაარჩიე ჩემი დავა და სამართალი; დაბრძანდი ტახტზე, სიმართლის მსაჯულო. "},
	{6, "6 განრისხდი ერებზე, მოსპე ბოროტი, მათი სახელი ამოშალე უკუნითი უკუნისამდე. "},
	{7, "7 მტერი გაქრა, გაპარტახდა სამუდამოდ და შენ დაანგრიე ქალაქები, მათთან ერთად მოისპო მათი ხსენება. "},
	{8, "8 ხოლო უფალი იარსებებს უკუნისამდე. მან მოამზდა სამართლისთვის თავისი ტახტი. "},
	{9, "9 და ის სიმართლით განსჯის მსოფლიოს, გაასამართლებს ხალხებს სისწორით. "},
	{10, "10 უფალი იქნება ჩაგრულის შემწე და დასაყრდენი გაჭირვების ჟამს. "},
	{11, "11 შენ მოგენდობიან შენი სახელის მცოდნენი, ვინაიდან არ მიატოვებ, უფალო, შენს მაძიებლებს. "},
	{12, "12 უგალობეთ უფალს, სიონის მკვიდრს, აუწყეთ მისი საქმენი ერებს. "},
	{13, "13 რადგან იძიებს მათ სისხლს, გაიხსენებს მათ, არ დაივიწყებს ტვირთმძიმეთა გოდებას. "},
	{14, "14 შემიწყალე, უფალო, იხილე ჩემი შეჭირვება ჩემი მტრებისგან, აღმამაღლე სიკვდილის კარიბჭიდან. "},
	{15, "15 რათა განვაცხადო ყოველი შენი ქება კარიბჭეში სიონის ასულისა, ვილხინო შენმიერი შველით. "},
	{16, "16 ჩაცვივდნენ ერები თავიანთ ამოთხრილ ორმოში, მათ გამზადებულ ბადეში გაება მათი ფეხი. "},
	{17, "17 ცნობილია უფალი, სამართლის მოქმედი. ბოროტი გაება თავისი ხელით დაგებულ მახეში. სელა. "},
	{18, "18 დაუბრუნდებიან ბოროტნი ჯოჯოხეთს, ყველა ერი, ვინც დაივიწყა ღმერთი. "},
	{19, "19 სამუდამოდ არ იქნება დავიწყებული ღატაკი, სამარადისოდ დაკარგული - უპოვართა იმედი. "},
	{20, "20 აღსდექ, უფალო, ნუ იმძლავრებს კაცი; დაე, გასამართლდნენ ერები შენს წინაშე. "},
	{21, "21 უფალო, შიშის ზარი დაეცი მათ; დაე, შეიტყონ ერებმა, რომ კაცუნები არიან ისინი. სელა. "},
	{22, "21 რატომ დგახარ, უფალო, შორს? თვალს მარიდებ გაჭირვების ჟამს. "},
	{23, "22 ამპარტავნობით დევნის ბოროტი ღატაკს; შეპყრობილნი იქნებიან მზაკვრობით, რომელიც განიზრახეს. "},
	{24, "24 რადგან ტრაბახობს ბოროტი თავისი სულის ავხორცობით, ხოლო ანგარების მოყვარული უარყოფს უფალს. "},
	{25, "25 ბოროტი თავისი ქედმაღლობით უგულებელყოფს, მისი აზრით არ არსებობს ღმერთი. "},
	{26, "26 გამარჯვებულია მისი გზა ყოველჟამს; მიუწვდომელია მისდამი შენი სამართალი, თავის მტრებს სულის შებერვით ამარცხებს. "},
	{27, "27 თავის გულში ამბობს: „არ წავბორძიკდები, თაობიდან თაობამდე არ შემხვდება სიავე“. "},
	{28, "28 მისი პირი სავსეა წყევლით, თაღლითობით და სიცრუით; მისი ენა სიმრუდე და უკუღმართობაა. "},
	{29, "29 ჩასაფრდება ეზოს უკან, სამალავიდან მოკლავს უდანაშაულოს, მისი თვალები საწყლებს უთვალთვალებენ. "},
	{30, "30 დაუდარაჯდება საფარში, როგორც ლომი შამბნარში ჩაუსაფრდება საწყალს მოსატაცებლად, მოიტაცებს, ოდეს მოამწყვდევს თავის ბადეში. "},
	{31, "31 მოიღუნება, გაწვება და საწყლებს თავის ბრჭყალებში მოაქცევს. "},
	{32, "32 თავის გულში ამბობს: „დაივიწყა ღმერთმა, თავის სახე დამალა, რომ არ იხილოს აღარასოდეს“. "},
	{33, "33 აღსდექ, უფალო ღმერთო, აღმართე ხელი, ნუ დაივიწყებ ჩაგრულებს. "},
	{34, "34 რად უგულებელყო ბოროტმა ღმერთი? გულში იზრახა, რომ არ მოჰკითხავ. "},
	{35, "35 უმზერ შენ, ვინაიდან ხედავ წყენასა და შევიწროებას, რათა სამაგიერო გადაუხადო შენი ხელით, შენ განდობს თავის თავს ჩაგრული, შენ იყავ ობლის შემწე. "},
	{36, "36 გადაამსხვრიე ბოროტისა და უკეთურის მკლავი, რომ ეძიონ მისი ბოროტება და ვერ იპოვონ. "},
	{37, "37 უფალი არის ხელმწიფე უკუნითი უკუნისამდე, განქარდებიან ხალხები მისი ქვეყნიდან. "},
	{38, "38 უფალო, მოისმინე მორჩილთა ნატვრა; შეამზადე მათი გული, მიაპყარ ყური; "},
	{39, "39 გაუსამართლე ობოლს და ჩაგრულს, რომ აღარ დევნონ კაცთაგანი ამ ქვეყანაზე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct ka10 poems[] = {
	{1, "1 გუნდის ლოტბარს, დავითის ფსალმუნი. უფალზე ვარ მინდობილი; როგორ ეტყვით ჩემს სულს: „გადაიხვეწე ჩიტივით თქვენს მთებში“. "},
	{2, "2 რადგან აგერ ბოროტნი მოზიდავენ მშვილდს, ლარზე მიამაგრებენ ისარს, რომ სიბნელიდან ესროლონ გულმართლებს. "},
	{3, "3 თუ საძირკვლები დანგრეულია, მართალმა რა ჰქნას? "},
	{4, "4 უფალი თავის წმიდა ტაძარშია, ცაშია უფლის ტახტი; მისი თვალები იმზირებიან, ქუთუთოები ამოწმებენ ადამის შვილებს. "},
	{5, "5 უფალი მართალს გადაარჩენს, ხოლო ბოროტი და ძალადობის მოყვარული სძულს მის სულს. "},
	{6, "6 ნაკვერჩხალს აწვიმებს ბოროტთა ზედა, ცეცხლსა და გოგირდს; და ქარბორბალა ხვედრია მათი. "},
	{7, "7 რადგან მართალია უფალი, უყვარს სიმართლე. გულწრფელი იხილავს მის სახეს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct ka11 poems[] = {
	{1, "1 დავითის საგალობელი რვასიმიან საკრავზე, გუნდის ლოტბარს.  "},
	{2, "2 მიხსენი, უფალო, რადგან აღარ არსებობს ღვთისმოსავი, რადგან გამქრალან ჭეშმარიტნი კაცთა მოდგმიდან. "},
	{3, "3 ტყუილს ეტყვიან ერთიმეორეს, ქლესა ტუჩებით ორპირულად ლაპარაკობენ; "},
	{4, "4 მოსპობს უფალი ქლესა ბაგეებს, გოროზად მოლაპარაკე ენებს. "},
	{5, "5 რომელნიც ამბობენ: ჩვენი ენებით ვიმძლავრებთ, ბაგენი ჩვენი ჩვენთანაა; ვინ გვიბატონებს? "},
	{6, "6 ღარიბთა დარბევისა და ჩაგრულთა კვნესის გამო აღვდგები, ამბობს უფალი, აღმოვუჩენ შველას, ვისაც მახე დაუგეს. "},
	{7, "7 უფლის სიტყვები წმიდა სიტყვებია, მიწის ქურაში გაწმედილი ვერცხლი, შვიდჯერ გადახალისებული. "},
	{8, "8 უფალო, შენ შეინახავ მათ, დაიცავ ამ თაობიდან უკუნისამდე. "},
	{9, "9 ირგვლივ ბოროტნი მიმოდიან, რაკი ამაღლდნენ უღირსები კაცთა მოდგმიდან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct ka12 poems[] = {
	{1, "1 გუნდის ლოტბარს, დავითის ფსალმუნი.  "},
	{2, "2 როდემდე დამივიწყებ, უფალო, სამუდამოდ? როდემდე იქნები პირმიქცეული ჩემგან? "},
	{3, "3 როდემდე ვინახო ზრახვანი ჩემს სულში, ნაღველი ჩემს გულში ყოველდღიურად? როდემდე აღზევდება მტერი ჩემზე? "},
	{4, "4 მომხედე, მიპასუხე, უფალო, ღმერთო ჩემო! მოჰფინე სინათლე ჩემს თვალებს, რომ არ დავიძინო სასიკვდილოდ. "},
	{5, "5 თორემ იტყვის ჩემი მოძულე: „დავძლიე იგი“. გაიხარებენ ჩემი მტრები, თუ წავბორძიკდი. "},
	{6, "6 ხოლო მე შენი წყალობის იმედი მაქვს, შენი შველით იხარებს ჩემი გული; ვუგალობებ უფალს, ჩემს კეთილისმყოფელს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct ka13 poems[] = {
	{1, "1 ლოტბარს, დავითის ფსალმუნი. თქვა უგუნურმა თავის გულში: „არ არის ღმერთი“. გაირყვნენ, სისაძაგლე ჩაიდინეს; არავინ არის კეთილის მქნელი. "},
	{2, "2 უფალმა ზეციდან გადმოხედა ადამიანთა შვილებს, რომ დაენახა, თუ არის ვინმე ჭკუათმყოფელი, ღმერთს რომ ეძიებს. "},
	{3, "3 ყველამ უარყო, ერთაანად საძულველნი გახდნენ; არ არის მქნელი კეთილისა, ერთიც არ არის. "},
	{4, "4 ნუთუ ვერ შეუგნიათ უკანონოების ჩამდენთ, ჩემი ხალხის მჭამელთ, პურს რომ სჭამენ და ღმერთს არ უხმობენ? "},
	{5, "5 იქ შეკრთნენ შიშით, რადგან ღმერთი მართალთა თაობაშია. "},
	{6, "6 თქვენ დასცინეთ რჩევას საწყლისას, რაკი ღმერთია მისი მფარველი. "},
	{7, "7 ვინ მისცემს სიონიდან ისრაელს ხსნას? ოდეს შემოაქცევს ღმერთი თავის ხალხის ტყვეობას, მოილხენს იაკობი, გაიხარებს ისრაელი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct ka14 poems[] = {
	{1, "1 ფსალმუნი დავითისა. უფალო! ვინ დაისადგურებს შენს კარავში? ვინ დამკვიდრდება შენს წმიდა მთაზე? "},
	{2, "2 ვინც უმწიკვლოდ დადის, სიმართლის მოქმედია და ჭეშმარიტებას ლაპარაკობს თავის გულში. "},
	{3, "3 ვინც არავის გასჭორავს თავისი ენით, ცუდს არ გაუკეთებს მოყვასს და აუგს არ იტყვის ახლობელზე. "},
	{4, "4 ვის თვალშიც დამცირებულია საზიზღარი, ხოლო ღვთის მოშიშებს პატივსა სცემს; ვინც დაიფიცებს თავის საზიანოდ და არ შეცვლის; "},
	{5, "5 ვინც ფულს ვახშით არ გასცემს და ქრთამს უდანაშაულოზე არ აიღებს; ამის მოქმედი არასოდეს წაფორხილდება. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct ka15 poems[] = {
	{1, "1 გალობა დავითისა. დამიფარე უფალო, რადგან შენზე ვარ მონდობილი. "},
	{2, "2 მე ვუთხარი უფალს: შენ ხარ ჩემი ბატონი; ჩემი სიკეთე შენს გარეშე არ არსებობს. "},
	{3, "3 წმიდანებთან, რომლებიც დედამიწაზე არიან და ძლიერებთან, - მათთან არის ჩემი ყველა სურვილი. "},
	{4, "4 დარდი გაუმრავლდეთ, ვინც უცხო კერპებისცნ ისწრაფის. მე არ ვასხურებ მათს სისხლიან შესასხურებელს და არც მოვიტან პირზე მათ სახელს. "},
	{5, "5 უფალი ჩემი მემკვიდრეობისა და თასის ნაწილია შენს ხელშია ჩემი ხვედრი. "},
	{6, "6 ჩემი მამულები მშვენიერ ადგილებში მერგო, სამკვიდროც მოსაწონია ჩემთვის. "},
	{7, "7 ვადიდებ უფალს, რომ დამარიგა; ღამღამობით მწვრთნიან ჩემი გულისთქმანი. "},
	{8, "8 წარმოვიდგენ უფალს ჩემს პირდაპირ მუდამ, რადგან ჩემს მარჯვნივ არის, არ დავეცემი. "},
	{9, "9 ამიტომ გაიხარა ჩემმა გულმა და ილხინა ჩემმა ღირსებამ; ჩემი ხორციც მოისვენებს იმედნეულად. "},
	{10, "10 რადგან არ დაუტოვებ ჩემს სულს ჯოჯოხეთს, გასახრწნელად არ გაიმეტებ შენს წმიდას. "},
	{11, "11 მასწავლე გზა ცხოვრებისა, სისავსე სიხარულის შენი სახის წინაშე, ნეტარება - შენი მარჯვენით უკუნისამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct ka16 poems[] = {
	{1, "1 ლოცვა დავითისა. ისმინე, უფალო, სიმართლე, ყური მოაპყარ ჩემს ღაღადს, გაიგონე ჩემი ლოცვა უბიწო ბაგეებიდან. "},
	{2, "2 შენგან გამოვა ჩემი სამართალი, შენი თვალები განჭვრეტენ სწორად. "},
	{3, "3 შენ გასინჯვ ჩემი გული, მომინახულე ღამით, გამომცადე, ვერაფერს იპოვი; არ განუდგება ჩემი პირი განზრახვას ჩემსას. "},
	{4, "4 ადამიანურ მოქმედებაში, შენთა ბაგეთა სიტყვის თანახმად, თავს ვიცავდი უკუღმართი გზებისაგან. "},
	{5, "5 გაამაგრე ჩემი ნაბიჯები შენს გზაზე, დაე, არ გადაუხვიონ ჩემმა ტერფებმა. "},
	{6, "6 მე მოგიხმობ, რადგან მომისმენ, ღმერთო; ყური მომაპყარ, მოისმინე ჩემი სიტყვები. "},
	{7, "7 გვიჩვენე გასაოცარი წყალობა, დაიმედებულთა მხსნელო მტრებისაგან შენი მარჯვენით. "},
	{8, "8 შემინახვ თვალისჩინივით, შენი ფრთების ჩრდილქვეშ შემიფარე. "},
	{9, "9 ბოროტთაგან, რომელნიც თავს მესხმიან, მტრებისაგან, გარს რომ მერტყმიან სულის ამოსახდელად. "},
	{10, "10 ისინი ქონში ჩაიკეტნენ, მათი ბაგეები ამპარტავნობით ლაპარაკობენ, "},
	{11, "11 ყოველ ნაბიჯზე აწ გარს გვერტყმიან, გვითვალთვალებენ, რათა ძირს დაგვცენ. "},
	{12, "12 ისინი წააგვანან ლომს, მსხვერპლზე რომ ოცნებობს და ლომის ბოკვერს, საფარში მჯდომარეს. "},
	{13, "13 აღდექ, უფალო, წინ გადაუდექი, დააჩოქე, გადაარჩინე ჩემი სული ბოროტისაგან შენი მახვილით. "},
	{14, "14 იმ კაცებისაგან - შენი ხელით, უფალო, ამქვეყნიური კაცებისაგან, რომელთაც წილი სიცოცხლეში აქვთ, რომელთა მუცლებს ავსებ შენი საგანძურებიდან; რათა გაძღნენ მათი შვილები და ნარჩენი თავიანთ ბავშვებს დაუტოვონ. "},
	{15, "15 მე სიმართლით ვიხილავ შენს სახეს, გავძღები გამოღვიძებისას შენი სახების მზერით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct ka17 poems[] = {
	{1, "1 გუნდის ლოტბარს. უფლის მორჩილი დავითისა, რომელმაც წარმოთქვა უფლის მიმართ სიტყვები ამ გალობისა იმ დღეს, როცა უფალმა გადაარჩინა ყველა თავისი მტრის ხელთაგან და საულის ხელთაგან.  "},
	{2, "2 და თქვა: შეგიყვარებ, უფალო, სიმტკიცევ ჩემო. "},
	{3, "3 უფალო, კლდევ და სიმაგრევ ჩემო და მხსნელო ჩემო, ღმერთო ჩემო, - ჩემი კლდე ხარ, თავშესაფარი. ფარო ჩემო და დამხმარეო, საყრდენო ჩემო. "},
	{4, "4 ქებულია, ვიძახი, უფალი, და მტრებისაგან გადამარჩენს. "},
	{5, "5 გარს შემომერტყა სიკვდილის ხვია და შემაძრწუნეს ნაკადებმა უკუღმართებმა. "},
	{6, "6 შუა მოვექეც ბორკილებში ჯოჯოხეთისა და წინ სიკვდილის ხაფანგები გადამეღობა. "},
	{7, "7 გაჭირვებაში ვუხმობდი უფალს და ღმერთსა ჩემსა მოვუწოდებდი. ისმინა ხმა ჩემი თავისი სამხილიდან და მისწვდა მის ყურს ჩემი ღაღადი. "},
	{8, "8 შეძრწუნდა და შეირყა დედამიწა, შეკრთნენ მთათა ფუძენი; შეძრწუნდნენ, რადგან განრისხდა იგი. "},
	{9, "9 აღმოხდა კვამლი მისი რისხვისა, ცეცხლი მომსვრელი მის ბაგეთაგან, ნაკვერჩხლები აღმოენთნენ მისგან. "},
	{10, "10 დახარა ცანი და გარდმოვიდა, და მის ფეხთა ქვეშ - ნისლი უკუნი. "},
	{11, "11 ქერუბიმებზე ამხედრდა და გაფრინდა, და გაეშურა ქარის ფრთებით. "},
	{12, "12 წყვდიადი თავის საფარად აქცია, გარემო მისი - საბურველად, მძიმე ღრუბლები, სიბნელე წყლისა. "},
	{13, "13 მისი პირის ბრწყინვალებით გაიფანტნენ ღრუბლები, სეტყვა და ნაკვერჩხლები. "},
	{14, "14 და დაიგრგვინა უფალმა ზეცაში, და ზეციერმა გამოსცა ხმა თავისი სეტყვით და ნაკვერჩხლებით. "},
	{15, "15 გაუშვა ისრები და მიმოფანტა, ელვანი მრავალნი - და განაბნია. "},
	{16, "16 და გამოჩნდნენ წყარონი წყალთა და გაშიშვლდნენ ფუძენი სამყაროსი შენს მრისხანე დაძახილზე, უფალო, შენი პირის ქარის ქროლვაზე. "},
	{17, "17 გამომიწოდა სიმაღლიდან, ამომიყვანა. მრავალ წყალთაგან გამომიხსნა. "},
	{18, "18 დამიხსნა ძლიერი მტრისაგან და მოძულეთაგან ჩემთა, ჩემზე ძლიერნი რომ იყვნენ. "},
	{19, "19 აღდგნენ ჩემს წინააღმდეგ ჩემი გაჭირვების ჟამს, და უფალი იყო ჩემი საყრდენი. "},
	{20, "20 გამომიყვანა გაშლილ სივრცეზე, მიშველა, რადგან ვუყვარვარ მე. "},
	{21, "21 მიზღო უფალმა ჩემი სიმართლით, ჩემთა ხელთა სიწმიდის კვალობაზე დამაჯილდოვა. "},
	{22, "22 ვინაიდან მივყვებოდი უფლის გზებს და არ ვცოდავდი ღმერთის წინაშე; "},
	{23, "23 ვინაიდან ჩემს თვალწინაა ყველა მისი მცნება და მისი კანონებიდან არ გადამიხვევია. "},
	{24, "24 უცოდველი ვიყავი მის წინაშე და თავს ვიცავდი შეცოდებისგან. "},
	{25, "25 და მომიზღო უფალმა ჩემი სიმართლით, ჩემთა ხელთა სიწმიდის კვალობაზე მის თვალთა წინაშე. "},
	{26, "26 გულმოწყალეს წყალობით ექცევი, გულმართალს - გულმართლად. "},
	{27, "27 ჭეშმარიტს ჭეშმარიგად ექცევი, უკუღმართს - უკუღმართად; "},
	{28, "28 რადგან საწყალ ხალხს იხსნი და მედიდურ თვალებს ამდაბლებ. "},
	{29, "29 ამიტომ ანთებ ჩემს ლამპარს, უფალო; ჩემი ღმერთი სინათლედ მიქცევს სიბნელეს. "},
	{30, "30 შენით ვამარცხებ ლაშქარს და ჩემი ღმერთის შეწევნით გადავევლები გალავანს. "},
	{31, "31 უმწიკვლოა გზა ღმერთისა, ხალასია სიტყვა უფლისა; ფარია იგი ყველასათვის, ვინც მას მიენდობა. "},
	{32, "32 რადგან ვინ არის ღმერთი, გარდა უფლისა? ანდა ვინ არის ბურჯი, გარდა ჩვენი ღმერთისა? "},
	{33, "33 ღმერთი მიმატებს ძალას და სწორ გზას მაძლევს. "},
	{34, "34 ჩემს ფეხებს ირმისას ამსგავსებს და ჩემს სიმაღლეებზე მაყენებს. "},
	{35, "35 ომს ასწავლის ჩემს ხელებს და რვალის მშვილდს ადრეკინებს ჩემს მკლავებს. "},
	{36, "36 მომეცი ფარი შენი ხსნისა და შემეწიე შენი მარჯვენით. და განმადიდე შენი წყალობით. "},
	{37, "37 გამიფართოვე ნაბიჯი ჩემს ქვეშ და ჩემი კანჭები აღარ წაბორძიკებულან. "},
	{38, "38 დავედევნები ჩემს მტრებს და წამოვეწევი და არ დავბრუნდები, ვიდრე არ მოვსპობ. "},
	{39, "39 დავამარცხებ და წამოდგომას ვეღარ შეძლებენ, ჩემთა ფეხთა ქვეშ განირთხმებიან. "},
	{40, "40 და შენ შთამბერე ძალა საომრად, მოდრიკე ჩემზე აღმდგარნი ჩემს ფეხქვეშ. "},
	{41, "41 ჩემს მტრებს ზურგი შენ აბრუნებინე ჩემგან და მე ამოვწყვეტ ჩემს მოძულეებს. "},
	{42, "42 იღაღადებენ და მშველელი არ ეყოლებათ, უფლის მიმართ - და არ უპასუხებს. "},
	{43, "43 გავაცამტვერებ, როგორც ქარი მტვერს, გავთელავ, როგორც ტალახს ქუჩაში. "},
	{44, "44 მიხსენი ხალხის დავისაგან, დამაყენე ერთა უფროსად, ხალხი, რომელსაც არ ვიცნობდი, მემსახუროს მე. "},
	{45, "45 ყურის მოკვრითაც მორჩილნი გახდებიან ჩემს წინაშე, უცხო ტომები პირფერულად მომეპყრობიან. "},
	{46, "46 უცხო ტომები გაილევიან და ათრთოლდებიან თავიანთ სიმაგრეებში. "},
	{47, "47 უკვდავია უფალი და დიდებულია სიმაგრე ჩემი! და ამაღლდება ღმერთი - ჩემი მშველელი. "},
	{48, "48 ღმერთი, რომელიც შურს იძიებს ჩემთვის და მიმორჩილებს ერებს. "},
	{49, "49 ჩემო მხსნელო მტრებისაგან! შენ ამამაღლე მათზე, ვინც აღმდგარია ჩემს წინააღმდეგ! და უკეთური კაცისაგან მიხსენი. "},
	{50, "50 ამისთვის გადიდებ ერებში, უფალო, და შენს სახელს ვუგალობებ. "},
	{51, "51 ამრავლებს შველას მეფისათვის და წყალობას თავისი ცხებულისთვის - დავითისა და მისი მოდგმისთვის უკუნითი უკუნისამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct ka18 poems[] = {
	{1, "1 გუნდის ლოტბარს, დავითის საგალობელი.  "},
	{2, "2 ცანი ღაღადებენ ღმერთის დიდებას და მისთა ხელთა ნამოქმედარს გვამცნობს სამყარო. "},
	{3, "3 დღე დღეს გადასცემს სიტყვას, ღამე კი ღამეს უმხელს აზრს. "},
	{4, "4 არც მთქმელია და არც ნათქვამი, სადაც მათი ხმა არ ისმოდეს. "},
	{5, "5 მთელი დედამიწის ზურგზე გადის მათი ხაზი და სამყაროს კიდეებამდე აღწევს მათი სიტყვები; მან მზეს დაუდგა კარავი მათში. "},
	{6, "6 და ის ვითარცა ნეფე, გამოდის საქორწინო გავალაკიდან; გმირივით ხარობს გარბენას გზისას. "},
	{7, "7 ცათა კიდიდან არის მისი აღმოსავალი და მისი ბრუნვა - მათ კიდეებამდე, და ვერაფერი ემალება მის მხურვალებას. "},
	{8, "8 რჯული უფლისა სრულყოფილია, სულს განამტკიცებს; მცნება უფლისა ჭეშმარიტია, გააბრძნობს გულუბრყვილოებს. "},
	{9, "9 მართებულია უფლის ბრძანებანი, გულს ახარებენ; მცნება უფლისა სპეტაკია, შუქს აძლევს თვალებს. "},
	{10, "10 შიში უფლისა წმიდა არის, მარადიული. უფლის განსჯანი - ჭეშმარიტნი, მართალნი ერთობ. "},
	{11, "11 სასურველი არიან ოქროზე და თვით ბაჯაღლოზე მეტად და უტკბილესნი თაფლისა და გოლეულისა. "},
	{12, "12 და შენი მორჩილი მათით არის განათებული; დიდია საზღაური მათი დაცვისათვის. "},
	{13, "13 ვინ გულისხმა-ჰყოს შეცდომები? განმწმინდე მე დაფარულთაგან. "},
	{14, "14 ბოროტთაგანც განაშორე მორჩილი შენი, რათა არ გაბატონდნენ ჩემზე; მაშინ უმწაკვლო შევიქმნები და თავს დავაღწევ დიდ ცოდვას. "},
	{15, "15 დაე, იყოს შენთვის სასურველი სიტყვანი ჩემი პირისა და ზრახვანი ჩემი გულისა, უფალო, ბურჯო და დამხსნელო ჩემო."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct ka19 poems[] = {
	{1, "1 გუნდის ლოტბარს, დავითის საგალობელი.  "},
	{2, "2 გიპასუხოს შენ უფალმა გაჭირვების დღეს, აგამაღლოს შენ იაკობის ღმერთის სახელმა. "},
	{3, "3 გამოგიგზავნოს შემწეობა საწმიდრიდან. და სიონიდან შეგამაგროს შენ. "},
	{4, "4 გაიხსენოს ყველა შენი შესაწირავი და მსუყედ ექმნეს აღსავლენი შენი. სელა. "},
	{5, "5 მოგცეს შენ შენი გულისამებრ და აღგისრულოს ყოველი შენი განაზრახი. "},
	{6, "6 ვიმხიარულებთ შენი შველით და ღმერთის სახელით დროშას ავაფრიალებთ; ყველა შენი სათხოვარი შეგისრულოს უფალმა. "},
	{7, "7 ახლა მივხვდი, რომ იხსნა უფალმა ცხებული თვისი, თავისი წმიდა ზეციდან უპასუხებს მას თავისი მხსნელი მარჯვენის ძლიერებით. "},
	{8, "8 ზოგნი ეტლებით და ზოგნი ცხენებით, ჩვენი კი ჩვენი ღმერთის სახელს ვიხსენებთ; "},
	{9, "9 ისინი მოიდრიკნენ და დაეცნენ, ჩვენ კი წამოვდექით და წელში გავიმართეთ. "},
	{10, "10 უფალო, გვიხსენი. დაე, მეუფემ შეგვისმინოს ჩვენი მოხმობის დღეს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct ka20 poems[] = {
	{1, "1 გუნდის ლოტბარს, დავითის საგალობელი.  "},
	{2, "2 უფალო, შენი სიძლიერით იხარებს მეფე და შენი შველით მოილხენს მეტად. "},
	{3, "3 შენ შეუსრულე მას გულის ნატვრა და სათხოვარი მისთა ბაგეთა არ უკუაგდე. სელა. "},
	{4, "4 რადგან წინ შეაგებე კეთილი კურთხევანი, თავზე დაადგი გვირგვინი წმინდა ოქროსი. "},
	{5, "5 სიცოცხლე გთხოვა და მიეცი მას, დღეგრძელობა უკუნითი უკუნისამდე. "},
	{6, "6 დიდია ღირსება მისი შენი შემწეობით, დიდება და დიდმშვენიერება მიანიჭე მას. "},
	{7, "7 შენ უბოძე მას კურთხევანი სამარადჟამოდ, ალხინე იგი სიხარულით შენს წინაშე. "},
	{8, "8 რადგანაც მეფე მინდობილი არის უფალზე და ზეციერის მოწყალებით არ დაეცემა. "},
	{9, "9 შენი ხელი მისწვდება ყველა მტერს შენსას, მარჯვენა გაანადგურებს შენს მოძულეებს. "},
	{10, "10 ცეცხლოვან თონეს დაამსგავსებ მათ შენი რისხვის ჟამს; უფალი თავისი რისხვით დასწვავს, ხოლო ცეცხლი შთანთქავს მათ. "},
	{11, "11 შენ მათ ნაშიერს წარხოც ქვეყნიდან და მათ მოდგმას ძეთაგან კაცთა. "},
	{12, "12 რადგან სიავე განიზრახეს შენს წინააღმდეგ, ბოროტს ზრახვიდნენ და ვერ შეიძლეს, "},
	{13, "13 ვინაიდან შენ უკუშეაქცევ მათ, შენს მშვილდს მიმართავ მათი სახისაკენ. "},
	{14, "14 ამაღლდი შენი ძალით, უფალო; ჩვენ ვუმღერებთ და ვუგალობებთ შენს ძლიერებას. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct ka21 poems[] = {
	{1, "1 გუნდის ლოტბარს, ცისკრის აღმობრწყინებისას, დავითის ფსალმუნი.  "},
	{2, "2 ღმერთო ჩემო! ღმერთო ჩემო! რად მიმატოვე? შორს არის ჩემი შველისაგან სიტყვები ჩემი ღაღადისისა. "},
	{3, "3 ღმერთო ჩემო! მოგიხმობ დღისით და არ მიპასუხებ, ღამით - და არ არის სიმშვიდე ჩემთვის. "},
	{4, "4 შენ კი, წმიდაო, მკვიდრობ ისრაელის ხოტბათა შორის. "},
	{5, "5 შენით იმედოვნებდნენ ჩვენი მამები, იმედოვნებდნენ და იხსენი კიდეც. "},
	{6, "6 შენ გევედრებოდნენ და გადარჩნენ; შენით იმედოვნებდნენ და არ გაწბილდნენ. "},
	{7, "7 მე კი მატლი ვარ და არა კაცი, საძრახისი ადამიანთა და საძულველი ერისა. "},
	{8, "8 ყველა, ვინც მხედავს, მე დამცინის; მქირდავენ და თავს გადააქნევენ. "},
	{9, "9 ღმერთზე მინდობილს იგი დაიხსნის, ის გადაარჩენს, თუ ნებავს იგი. "},
	{10, "10 რადგან შენ გამომიყვანე დედის მუცლიდან, დამამშვიდე დედის მკერდზე. "},
	{11, "11 შენით ვიმედოვნებდი დაბადებიდან; დედის მუცლიდან შენ ხარ ჩემი ღმერთი. "},
	{12, "12 ნუ გამშორდები, რაკი ახლოა უბედურება, ხოლო შემწე არავინ არის. "},
	{13, "13 ირგვლივ მომადგნენ მე მოზვრები აურაცხელნი, ბაშანის ხარებმა რკალი შემომარტყეს. "},
	{14, "14 პირი დააღეს ჩემს წინააღმდეგ, ვითარცა ლომმა, მსხვერპლს დადევნებულმა და მბრდღვინავმა. "},
	{15, "15 ვითარცა წყალი დავიღვარე და დაიშალნენ ჩემი ძვლები; ცვილს დაემსგავსა ჩემი გული, დადნა ჩემს გვამში. "},
	{16, "16 გამოიფიტა ჩემი ძალა, ვითარცა თიხა; ენა სასაზე მიმეკრა და მიმიყვანა სიკვდილის პირას. "},
	{17, "17 რადგან გარს შემომეხვივრენ მე ძაღლები, ბოროტთა ხროვა წრედ შემომერტყა ლომის მსგავსად ჩემი ხელ-ფეხის გასაგმირავად. "},
	{18, "18 მთელი ჩემი ძვლები დაითვლება; ისინი მიჭვრეტენ ნიშნის მოგებით. "},
	{19, "19 ჩემს სამოსელს ინაწილებენ და წილს ყრიან ჩემს კვართზე. "},
	{20, "20 და შენ, უფალო, ნუ დამშორდები; სიმძლავრევ ჩემო, ჩემდა შემწედ გამოეშურე. "},
	{21, "21 გადაარჩინე ჩემი სული მახვილისაგან და ძაღლისაგან სული ჩემი, მარტოდ შთენილი. "},
	{22, "22 მიხსენი ლომის ხახისაგან და მარტორქისგან გადამარჩინე. "},
	{23, "23 ჩემს ძმებს მოვუთხრობ შენს სახელზე, კრებულთა შორის შეგაქებ შენ. "},
	{24, "24 უფლის მოშიშნო! ადიდეთ იგი; პატივი სცეს იაკობის მთელმა მოდგმამ და ეშინოდეს მისი ისრაელის მთელ მოდგმას. "},
	{25, "25 რადგან არ დაამცირა მან და არ უგულებელყო ტანჯვა გლახაკისა, და არ მოარიდა პირი თავისი, და უსმინა მას, როცა მოუხმობდა. "},
	{26, "26 შენს გამოა ჩემი ხოტბა მრავალ კრებულში, შენთა მოშიშთა წინაშე გადაგიხდი აღთქმულს. "},
	{27, "27 ჭამონ ღატაკთა და დანაყრდნენ, ადიდონ უფალი მისმა მაძიებლებმა; სამარადჟამოდ იცოცხლონ თქვენმა გულებმა. "},
	{28, "28 გაიხსენებენ და უფალთან დაბრუნდებიან ქვეყნიერების ყველა კიდენი, და თაყვანს სცემს ყველა ტომი ხალხებისა. "},
	{29, "29 რადგანაც უფალს შვენის მეფობა და იგი არის ხალხთა მბრძანებელი. "},
	{30, "30 ჭამს და თაყვანს სცემს ამ ქვეყნის ყველა გათქვირებული, მის წინაშე ქედს მოიხრის ყველა, ვინც მტვრად უნდა იქცეს, ვისაც არ ძალუძს თავისი სულის გადარჩენა. "},
	{31, "31 შთამომავლობა ემსახუროს მას; მოუთხრობს თაობებს უფლის შესახებ. "},
	{32, "32 მოვლენ და მოუყვებიან მის სიმართლეს ხალხს, ახალშობილს, რაც მოიმოქმედა უფალმა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct ka22 poems[] = {
	{1, "1 საგალობელი დავითისა. უფალი ჩემი მწყემსია, არაფერი არ მომაკლდება. "},
	{2, "2 ხასხასა მოლზე დამასვენებს და წყნარ წყლებზე წამიძღვება მე. "},
	{3, "3 სულს დამიწყნარებს, სიმართლის კვალზე დამაყენებს თვისი სახელის გულისათვის. "},
	{4, "4 შავეთის ველზეც რომ ვიარო, ბოროტისა არ მეშინია, რადგან შენა ხარ ჩემთან; მანუგეშებენ შენი კვერთხი და შენი საყრდენი. "},
	{5, "5 გააწყე ტაბლა ჩემს წინაშე ჩემს მტერთა თვალწინ. ზეთი სცხე ჩემს თავს; სავსეა თასი ჩემი პირთამდე. "},
	{6, "6 ასე, სიკეთე და წყალობა დამდევს კვალდაკვალ მთელი სიცოცხლე და დავმკვიდრდები უფლის სახლში დღენი მრავალნი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view23() {
struct ka23 poems[] = {
	{1, "1 საგალობელი დავითისა. უფლისა არის ქვეყნიერება და სავსება მისი, სამყარო და მისი მკვიდრნი. "},
	{2, "2 რადგან ზღვებზე დააფუძნა მან იგი და მდინარეებზე მოაწყო იგი. "},
	{3, "3 ვინ ავა უფლის მთაზე ან ვინ დადგება მის წმიდა ადგილზე? "},
	{4, "4 ვისაც ხელები სუფთა აქვს და გული სპეტაკი, ვინც მიუღწეველს არ წაპოტინებია და ყალბად არ დაუფიცია, "},
	{5, "5 ის მიიღებს კურთხევას უფლისაგან და წყალობას თავისი მხსნელი ღმერთისაგან. "},
	{6, "6 ეს არის თაობა მაძიებელთა, ვინც მოიძიებს სახებას შენსას, ღმერთო იაკობისა! სელა. "},
	{7, "7 მაღლა ასწიეთ, კარიბჭეებო, თქვენი თავები, და აიწიეთ, კარნო მარადნო, რომ შემოვიდეს მეფე დიდებისა. "},
	{8, "8 ვინ არის ეს მეფე დიდებისა? უფალი მტკიცე და ძლიერი, უფალი - ომში ძლევამოსილი. "},
	{9, "9 მაღლა ასწიეთ კარიბჭეებო, თქვენი თავები, და აიწიეთ, კარნო მარადნო, რომ შემოვიდეს მეფე დიდებისა. "},
	{10, "10 ვინ არის ეს მეფე დიდებისა? უფალი ძალთა. ის არის მეფე დიდებისა. სელა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view24() {
struct ka24 poems[] = {
	{1, "1 დავითის ფსალმუნი. შენსკან აღვაპყარ, უფალო, სული ჩემი. "},
	{2, "2 ღმერთო ჩემო! შენ გესავ, ნუ შევრცხვები, ნუ იზეიმებს მტერი ჩემზე. "},
	{3, "3 ასევე ყველა, ვინც შენით სასოებს, ნუ შერცხვება. შერცხვნენ ამაოდ შემცოდველნი. "},
	{4, "4 შენი გზები მაუწყე, უფალო, მასწავლე შენი კვალი. "},
	{5, "5 წარმიძეღ შენი ჭეშმარიტებით და მასწავლე, რადგან შენა ხარ ღმერთი ჩემი ხსნისა; შენ გესავ ყოველდღე. "},
	{6, "6 გაიხსენე, უფალო, წყალობა შენი და გულმოწყალება შენი, რადგან ისინი საუკუნოა. "},
	{7, "7 ცოდვანი ჩემი სიჭაბუკისა და ბრალი ჩემი არ გაიხსენო; გამიხსენე შენი გულმოწყალებით, შენი სიკეთით, უფალო. "},
	{8, "8 კეთილი არის უფალი და მართალი, ამიტომ ცოდვილთ აყენებს გზაზე. "},
	{9, "9 წაუძღვება თავმდაბალთ სამართალში და თავიანთ გზას ასწავლის მორჩილთ. "},
	{10, "10 ყველა გზა უფლისა წყალობაა და ჭეშმარიტება მის აღთქმათა და მცნებათა შემნახველთათვის. "},
	{11, "11 შენი სახელისათვის, უფალო, შემინდე ჩემი შეცოდება, რადგან დიდია იგი. "},
	{12, "12 ვინ არის კაცი მოშიში ღვთისა? მას გზას უჩვენებს ამოსარჩევად. "},
	{13, "13 მისი სული კეთილად განისვენებს და მისი მოდგმა დაიმკვიდრებს ქვეყანას. "},
	{14, "14 საიდუმლო უფლისა - მოშიშთა მისთა, და თავის აღთქმას აუწყებს მათ. "},
	{15, "15 ჩემი თვალები მიმართულია მუდამ უფლისკენ, რადგანაც იგი მახისაგან იხსნის ჩემს ფეხებს. "},
	{16, "16 გადმომხედე და შემიწყალე მე, ვინაიდან მარტოდმარტო და ბედუკუღმართი ვარ. "},
	{17, "17 განივრცო ტანჯვა ჩემი გულისა, მიხსენი ჩემი გაჭირვებიდან. "},
	{18, "18 შეხედე ჩემს ტანჯვას და დაქანცულობას და მაპატიე ყველა ჩემი შეცოდება. "},
	{19, "19 შეხედე, როგორ გამრავლდნენ ჩემი მტრები და საშინელი სიძულვილით შემიძულეს მე. "},
	{20, "20 შენ დაიფარე ჩემი სული და დამიხსენი, ნუ შევრცხვები, რადგანაც შენ გესავ. "},
	{21, "21 უბიწოებამ და სიმართლემ დამიფაროს მე, რაკიღა შენი იმედით ვარ. "},
	{22, "22 იხსენ, უფალო, ისრაელი ყოველი მისი გასაჭირიდან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view25() {
struct ka25 poems[] = {
	{1, "1 დავითისა. განმსაჯე, უფალო, რადგან ვიდოდი ჩემი სიწრფელით, უფალზე ვიყავ მინდობილი და არ წავბორძიკდები. "},
	{2, "2 გამომცადე, უფალო, და შემამოწმე, ბრძმედში გამოატარე შიგნეულობა და გული ჩემი. "},
	{3, "3 რადგან თვალწინ მიდგას შენი წყალობა და მივყვებოდი შენს ჭეშმარიტებას. "},
	{4, "4 არ დავმეგობრებივარ სიცრუის მოყვარულთ და მზაკვრებთან არ მივალ."},
	{5, "5 შევიძულე კრებული უკეთურთა და ბოროტთა გვერდით არ დავჯდები. "},
	{6, "6 ხელებს დავიბან უბიწოებით და გარს შემოვუვლი შენს სამსხვერპლოს, უფალო. "},
	{7, "7 რომ ვიღაღადო მადლობის ხმით და ყველა შენი საოცრება ვილაპარაკო. "},
	{8, "8 უფალო, შევიყვარე სავანე შენი სახლისა და. ადგილი - კარავი შენი დიდებისა. "},
	{9, "9 ნუ მოსპობ ჩემს სულს ცოდვილთა გვერდით და ჩემს სიცოცხლეს - სისხლისმსმელებთან. "},
	{10, "10 რომელთაც ხელთ აქვთ ბოროტება და მათი მარჯვენა სავსეა ქრთამით. "},
	{11, "11 ხოლო მე ვივლი უბიწოებით; მიხსენი მე და შემიწყალე. "},
	{12, "12 სწორ გზაზე დგას ჩემი ფეხი; საკრებულოებში ვადიდებ უფალს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view26() {
struct ka26 poems[] = {
	{1, "1 დავითისა. უფალი ჩემი შუქი არის და ხსნაა ჩემი - ვის შევუშინდე? უფალი ბურჯია ჩემი სიცოცხლისა - ვისგან შევძრწუნდე? "},
	{2, "2 თუ დამესხმიან თავს ბოროტნი ჩემი სხეულის შესასანსლად - მჩაგვრელნი ჩემნი და მტერნი ჩემნი, თვითონვე წაბორძიკდებიან და დაეცემიან. "},
	{3, "3 თუნდაც ჯარმა რომ დაიბანაკოს ჩემს წინააღმდეგ, არ შეშინდება ჩემი გული; თუ ომი ატყდა ჩემს წინააღმდეგ, მაინც იმედი მაქვს. "},
	{4, "4 ერთს ვთხოვდი უფალს, ამას ვევედრები: რომ დავემკვიდრო უფლის სახლში ჩემი სიცოცხლის მანძილზე, ვუმზერდე უფლის სიმშვენიერეს და იმის ტაძარს ვიხილავდე. "},
	{5, "5 რადგან შემიფარებს იგი თავის კარავში გაჭირვების ჟამს, დამმალავს თავისი კარვის სამალავში, კლდეზე ამამაღლებს. "},
	{6, "6 და ახლა მაღლა ავწევ თავს გარს შემოხვეული მტრების მიმართ და შევწირავ მის კარავში მსხვერპლსა ქებისა, ვუმღერებ და ვუგალობებ უფალს. "},
	{7, "7 ისმინე, უფალო, ჩემი ხმა, როცა მოგიხმობ; შემიწყალე და მიპასუხე. "},
	{8, "8 შენგან ამბობს ჩემი გული: მოძებნეთ ჩემი სახე. შენს სახეს მოვძებნი, უფალო. "},
	{9, "9 ნუ დამალავ შენს სახეს ჩემგან, რისხვით ნუ უკუაგდებ შენს მორჩილს. ჩემი შემწე იყავი უწინ, ახლა ხელს ნუ მკრავ და ნუ მიმატოვებ, ღმერთო, ჩემო მხსნელო, "},
	{10, "10 რადგან დამაგდო ჩემმა დედ-მამამ, ხოლო უფალი მიმიღებს მე. "},
	{11, "11 მიწინამძღვრე, უფალო, შენს გზაზე და დამაყენე სწორ კვალზე ჩემი მტრების გამო. "},
	{12, "12 ნუ გადამცემ ჩემი მტრების სურვილისამებრ, რადგან აღდგნენ ჩემს წინააღმდეგ ცრუ მოწმენი და ბოროტებით სუნთქავენ, "},
	{13, "13 რომ არ მერწმუნა ხილვა უფლის სიკეთისა ცოცხალთა ქვეყანაში. "},
	{14, "14 მიენდე უფალს, გამხნევდი და გაამაგრე შენი გული და გქონდეს უფლის იმედი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view27() {
struct ka27 poems[] = {
	{1, "1 დავითისა. შენ მოგიხმობ, უფალო, ჩემო ბურჯო! ნუ დადუმდები ჩემთვის; ვაი, თუ დადუმდე ჩემთვის და დავემგვანო საფლავში ჩასულებს. "},
	{2, "2 ისმინე ჩემი მუდარის ხმა, როცა მოგიხმობ, როცა ხელებს ავწევ შენი წმიდა ტაძრისაკენ. "},
	{3, "3 ნუ შემაერთებ ბოროტებთან და სიყალბის მქმნელთან, რომელნიც მოყვასებთან მშვიდობაზე ლაპარაკობენ, გულში კი სიავე უდევთ. "},
	{4, "4 მიუზღე მათ თავიანთი ნაქნარისამებრ და თავიანთი ბოროტმოქმედებისამებრ; მათთა ხელთა გაკეთებულის შესაფერისად მიუზღე მათ, გადაახდევინე მათი დამსახურებისამებრ. "},
	{5, "5 რადგან არ ესმით მოქმედებანი უფლისა და მისთა ხელთა ნასაქმარი. ის დაანგრევს მათ და აღარ ააშენებს. "},
	{6, "6 კურთხეულ არს უფალი, რომ შეისმინა ხმა ჩემი ვედრებისა. "},
	{7, "7 უფალი ბურჯია ჩემი და ფარი ჩემი. მისით სასოებს ჩემი გული და დამეხმარა, და გაიხარებს ჩემი გული და ჩემი სიმღერით ვიტყვი მის ქებას. "},
	{8, "8 უფალი ბურჯია თავისი ხალხისა და თავისი ცხებულის მხსნელი ფარია. "},
	{9, "9 ახსენი შენი ხალხი და აკურთხე შენი სამკვიდრო; მწყემსე ისინი და მოამაღლე უკუნითი უკუნისამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view28() {
struct ka28 poems[] = {
	{1, "1 ფსალმუნი დავითისა. უძღვენით უფალს, ღვთის შვილებო, უძღვენით უფალს ქება-დიდება. "},
	{2, "2 უძღვენით უფალს მისი სახელის დიდება; თაყვანი ეცით უფალს წმინდა ბრწყინვალებით. "},
	{3, "3 ხმა უფლისა წყლებზე; დიდების ღმერთმა დაიგრგვინა; უფლის (ხმა იყო) მრავალ წყალზე. "},
	{4, "4 ხმა უფლისა ძლიერებით, ხმა უფლისა ბრწყინვალებით. "},
	{5, "5 ხმა უფლისა დაამსხვრევს ნაძვებს; და დაამსხვრევს ლიბანის ნაძვებს უფალი. "},
	{6, "6 და ათამაშებს მათ ხბოსავით, ლიბანს და სირიონს - მარტორქის შვილის მსგავსად. "},
	{7, "7 ხმა უფლისა გაჰკვეთს ცეცხლის ალს. "},
	{8, "8 ხმა უფლისა უდაბნოს შეარყევს; შეარყევს უფალი კადეშის უდაბნოს. "},
	{9, "9 ხმა უფლისა ნაადრევად მოამშობიარებს ირმებს და გააშიშვლებს ტყეებს; და მის ტაძარში ყოველივე ამბობს დიდებას. "},
	{10, "10 უფალი იჯდა წარღვნის დროს და დაჯდება უფალი ხელმწიფედ უკუნისამდე. "},
	{11, "11 უფალი ძალას მისცემს თავის ხალხს, უფალი აკურთხებს თავის ხალხს მშვიდობით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view29() {
struct ka29 poems[] = {
	{1, "1 ფსალმუნი დავითისა, ქება სახლის განახლებისა. "},
	{2, "2 განგადიდებ შენ, უფალო, რადგან მიხსენი და ჩემზე მტრები არ გაახარე. "},
	{3, "3 უფალო, ღმერთო ჩემო! მოგიხმე და შენ განმკურნე მე. "},
	{4, "4 უფალო, შენ ამოიყვანე სული ჩემი ჯოჯოხეთიდან, და გამაცოცხლე, რომ საფლავში არ ჩავსულიყავ. "},
	{5, "5 უგალობეთ უფალს, მისო წმიდანებო, ადიდეთ ხსენება მისი სიწმიდისა. "},
	{6, "6 რადგან წამიერია რისხვა მისი, ხოლო სიცოცხლე - მისი სურვილით; ღამით გლოვა დაისადგურებს, ხოლო ცისკრის ჟამს - მხიარულება. "},
	{7, "7 და მე ვთქვი ჩემი ნეტარების ჟამს: არ დავეცემი უკუნისამდე. "},
	{8, "8 შენი სურვილით, უფალო, გადაარჩინე ჩემი მთა; დაფარე შენი სახე და - შევძრწუნდი. "},
	{9, "9 შენ მოგიხმობ, უფალო, და ჩემს ბატონს შევევედრები: "},
	{10, "10 რა სარგებლობა იქნება ჩემს სისხლში, როდესაც საფლავში ჩავალ? განა მტვერი შეგასხამს ხოტბას? განა შენს ჭეშმარიტებას განაცხადებს? "},
	{11, "11 უფალო, მომისმინე და შემიწყალე, იყავი შემწე ჩემი. "},
	{12, "12 შენ ჩემი წუხილი ცეკვად მიქციე, ძაძა გამხადე და სიხარულით შემმოსე. "},
	{13, "13 ამისათვის გიგალობებს სული ჩემი და არ დადუმდება, უფალო, ღმერთო ჩემო! შენ გადიდებ უკუნისამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view30() {
struct ka30 poems[] = {
	{1, "1 გუნდის ლოტბარს, დავითის ფსალმუნი.  "},
	{2, "2 შენ გესავ, უფალო, ნურც შევრცხვენილვარ ნურასოდეს; შენი სიმართლით გამომიხსენი. "},
	{3, "3 მომაპყარ ყური შენი, სწრაფად გადამარჩინე, იყავ ჩემთვის კლდე-ბურჯი, ციხე-სიმაგრე ჩემს დასახსნელად. "},
	{4, "4 რადგანაც ჩემი კლდე და ბურჯი ხარ; შენი სახელის გულისათვის გზა მიჩვენე და გამიძეხი. "},
	{5, "5 გამომიყვანე მახისაგან, რომელიც ჩუმად დამიგეს, რადგან შენა ხარ სიმაგრე ჩემი. "},
	{6, "6 შენს ხელს შევავედრებ ჩემს სულს. შენ დამიხსნი, უფალო, ღმერთო ჭეშმარიტო. "},
	{7, "7 შევიძულე ამაოების დამცველები და მე მივენდე უფალს. "},
	{8, "8 ვილხენ და ვიმხიარულებ შენი წყალობით. რადგან შენ იხილე ჩემი გაჭირვება, შეიცან ტანჯვა ჩემი სულისა. "},
	{9, "9 და არ მიმეცი ხელსა მტრისასა; ფართოდ დაამკვიდრე ფეხნი ჩემნი. "},
	{10, "10 შემიწყალე უფალო, რადგან მიჭირს; დაიშრიტა წუხილით თვალი ჩემი, სული ჩემი და მუცელი ჩემი. "},
	{11, "11 რადგან გაილია ნაღველში ჩემი სიცოცხლე და ჩემი წლები - გლოვაში. დაუძლურდა ჩემი ძალა ჩემი ცოდვებით და ჩემი ძვლები გაიხრწნა. "},
	{12, "12 ყველა ჩემი მტრისაგან შერცხვენილი შევიქენი და მეზობლებისაგან - მეტად, და საშიში ნაცნობთათვის; ვინც კი ქუჩაში დამინახავდა, გარბოდა ჩემგან. "},
	{13, "13 გულიდან ამომიგდეს, ვითარცა მკვდარი; დამსხვრეულ ჭურჭელს ვემსგავსებოდი. "},
	{14, "14 რადგან მესმოდა ცილისწამება მრავალთა, შიში ყოველი მხრიდან, რაჟამს შეითქვნენ ჩემს წინააღმდეგ, ჩემი სულის ამოხდა განიზრახეს. "},
	{15, "15 მე კი შენზე ვარ დაიმედებული, უფალო, ვთქვი: შენა ხარ ჩემი ღმერთი. "},
	{16, "16 შენს ხელთ არის ჩემი დრო-ჟამი. მიხსენი ჩემთა მდევართა და მტერთა ხელიდან. "},
	{17, "17 უჩვენე შენი ბრწყინვალე სახე შენს მორჩილს, გადამარჩინე შენი წყალობით. "},
	{18, "18 უფალო, ნუ შემარცხვენ, რადგან შენ მოგიხმობ, დაე, შერცხვნენ ბოროტნი და დადუმდნენ ქვესკნელში. "},
	{19, "19 დაე, დამუნჯდნენ ცრუ ბაგეები, რომელნიც უხეშად ლაპარაკობენ მართალზე - ქედმაღლობით და სიძულვილით. "},
	{20, "20 რაოდენ მრავალი გაქვს სიკეთე, შენთა მოშიშთათვის რომ ინახავ, შენს მსასოებელთ, რომ განუმზადე ადამის ძეთა წინაშე. "},
	{21, "21 შეიფარე ისინი შენი პირის საფარველქვეშ ადამიანის ხრიკებისაგან, დაიცავი ისინი ენით მომხდარი დავიდარაბისაგან. "},
	{22, "22 კურთხეულ არს უფალი, რომ მომივლინა საკვირველი თვისი წყალობა ალყაშემორტყმულ ქალაქში. "},
	{23, "23 და მე ვფიქრობდი ძრწოლით: „მოწყვეტილი ვარ შენთა თვალთაგან“, მაგრამ შენ ისმინე ხმა ჩემი მუდარისა, როცა მოგიხმე შემწეობისთვის. "},
	{24, "24 შეიყვარეთ უფალი, წმიდანებო მისნო; ერთგულებს იცავს უფალი და მრავალკეცად მიუზღავს ამპარტავნებს. "},
	{25, "25 გამხნევდით და გული გაიმაგრეთ ყველამ, ვისაც უფლის მოლოდინი გაქვთ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view31() {
struct ka31 poems[] = {
	{1, "1 მოძღვრება დავითისა. ნეტარია, ვისაც ეპატია დანაშაული, ვისიც ცოდვები დაიფარა. "},
	{2, "2 ნეტარ არს კაცი, ვისაც უფალი ცოდვას არ ჩაუთვლის და ვის სულშიც არ არის სიყალბე. "},
	{3, "3 როდესაც ვდუმდთ, გაცვითა ჩემი ძვლები ყოველდღიურმა გოდებამ ჩემმა. "},
	{4, "4 რადგან დღისით და ღამით მძიმდებოდა შენი ხელი ჩემზე, სინედლე ჩემი შეიცვალა ზაფხულის გვალვით. სელა. "},
	{5, "5 ცოდვა ჩემი გაუწყე და ბრალი ჩემი არ დამიმალავს. ვთქვი: ვაღიარებ ჩემს ცოდვებს უფლის წინაშე. და შენ მომიტევე დანაშაული ჩემი ცოდვისა. სელა. "},
	{6, "6 ამიტომ ილოცავს შენს მიმართ ყველა წმიდანი სვებედნიერ ჟამს; თუნდ იყოს წარღვნა წყალთა მრავალთა, ვერ მისწვდება მას. "},
	{7, "7 შენ ხარ მფარველი, გაჭირვებისაგან მიცავ, ხსნის სიხარული შემომარტყი გარს. სელა. "},
	{8, "8 გასწავლი შენ და დაგაყენებ სწორ გზაზე, რომლითაც ივლი, თვალს დავიჭერ შენზე. "},
	{9, "9 ნუ იქნებით, ვითარცა ცხენი, ვითარცა ჯორი უგუნური; ლაგამი და აღვირია მისი მოსართავი შესაკავებლად, რომ შენ არ მოგიახლოვდეს. "},
	{10, "10 მრავალი სატკივარი აქვს ბოროტს, უფალზე მინდობილი კი წყალობით არის გარემოცული. "},
	{11, "11 იხარეთ უფლის მიერ და იმხიარულეთ, წმიდანებო; და იზეიმეთ, გულით მართლებო. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view32() {
struct ka32 poems[] = {
	{1, "1 იხარეთ, მართალნო, უფალში; გულწრფელებს შეშვენით შექება. "},
	{2, "2 ადიდეთ უფალი ქნარით, ათსიმიანი ებნით უგალობეთ მას. "},
	{3, "3 უგალობეთ მას გალობა ახალი, უკეთ ააწყეთ ჰანგი მოძახილით. "},
	{4, "4 რადგან სწორია სიტყვა უფლისა და ყოველი საქმე მისი ჭეშმარიტია. "},
	{5, "5 უყვარს სიმართლე და სამართალი; უფლის წყალობით სავსეა ქვეყანა. "},
	{6, "6 უფლის სიტყვით შეიქმნა ზეცა და მისი ბაგეების ქარით - მთელი მისი საკრებულო. "},
	{7, "7 შეკრიბა, ვითარცა ტიკში, წყლები ზღვისანი, საცავებში მოათავსა უფსკრულები. "},
	{8, "8 ეშინოდეს უფლისა მთელ დედამიწას, თრთოდეს მისგან ყველა მკვიდრი სამყაროისა. "},
	{9, "9 რადგან მან თქვა და - შეიქმნა, მან ბრძანა და - არსებობს. "},
	{10, "10 უფალი ჩაშლის ხალხების აზრებს, გააცამტვერებს ხალხების ზრახვებს. "},
	{11, "11 აზრი უფლისა იარსებებს მარადიულად და თაობიდან თაობამდე - ზრახვანი მისნი. "},
	{12, "12 ნეტარ არს ხალხი, რომლისთვისაც უფალია ღმერთი, ხალხი - მისდა სამემკვიდრეოდ ამორჩეული. "},
	{13, "13 ზეციდან იმზირება უფალი, ხედავს ყველა ადამიანს. "},
	{14, "14 თავისი საბრძანისიდან უთვალთვალებს ქვეყნის ყველა მკვიდრს. "},
	{15, "15 მან შეჰქმნა გული თითოეულისა, და სწვდება ყველა მათ საქმეს. "},
	{16, "16 მეფეს ვერ უშველის ჯარის სიმრავლე, გმირს ვერ იხსნის დიდი ძალა. "},
	{17, "17 უიმედოა ცხენი შველისათვის და თავისი ჯარების სიმრავლე ვერ იხსნის. "},
	{18, "18 აი, თვალი უფლისა მის მოშიშთა თავზე, ვინც მის წყალობას ელის; "},
	{19, "19 რომ იხსნას მათი სული სიკვდილისაგან და ასაზრდოოს შიმშილობის დროს. "},
	{20, "20 ჩვენი სული მომლოდინეა უფლისა, ის არის დამხმარე და მფარველი ჩვენი. "},
	{21, "21 რადგან მისით ხარობს ჩვენი გული, რადგან ვესასოებით მის წმიდა სახელს. "},
	{22, "22 იყოს ჩვენდამი, უფალო, შენი წყალობა, რადგანაც შენზე ვამყარებთ იმედს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view33() {
struct ka33 poems[] = {
	{1, "1 დავითისა, როცა სიგიჟე მოიგონა აბიმელექის წინაშე და განიდევნა და წავიდა.  "},
	{2, "2 განვადიდებ უფალს ყოველჟამს, მარადისია მისი ქება ჩემს ბაგეებზე. "},
	{3, "3 უფლით იქადის ჩიმი სული; მოისმენენ თავმდაბლები და გაიხარებენ. "},
	{4, "4 ადიდეთ უფალი ჩემთან ერთად და განვადიდოთ მისი სახელი ერთობლივად. "},
	{5, "5 მე მოვიძიე უფალი და მიპასუხა და გამომიხსნა ყველა ჩემი განსაცდელისგან. "},
	{6, "6 მისი შემყურენი განათებულან და მათი პირი არ შერცხვენილა. "},
	{7, "7 აგერ გლახაკმა მოუხმო და უფალმა მოისმინა და ყველა გასაჭირისაგან იხსნა. "},
	{8, "8 დაიბანაკებს ანგელოზი უფლისა მის მოშიშთა ირგვლივ და გადაარჩენს მათ. "},
	{9, "9 განიცადეთ და ნახეთ, რომ კარგია უფალი; ნეტარება იმ კაცს, ვინც მასზეა მინდობილი. "},
	{10, "10 მოიშიშეთ უფლისა, წმიდანო, მისნო, რადგან არა აქვთ შეჭირვება მოშიშებს მისას. "},
	{11, "11 ძლიერნი ღატაკდებიან და დაიმშევიან, ხოლო უფლის მაძიებლებს არავითარი სიკეთე არ მოაკლდებათ. "},
	{12, "12 მოდით, შვილებო, მომისმინეთ: უფლის მოშიშებას გასწავლით თქვენ. "},
	{13, "13 ვინ არის კაცი, რომელსაც სურს სიცოცხლე, უყვარს დღეგრძელობა სიკეთის სანახავად? "},
	{14, "14 შეიკავე შენი ენა სიბოროტისგან და ბაგენი შენნი - ცბიერი სიტყვებისაგან. "},
	{15, "15 ერიდე ბააროტებას და ჰქმენ კეთილი; ეძიე მშვიდობა და მიჰყევი მას. "},
	{16, "16 უფლის თვალები მიპყრობილია წმიდანებისაკენ და მისი ყურები - მათი ლოცვისაკენ. "},
	{17, "17 პირი უფლისა - ბოროტმოქმედთა წინააღმდეგ, რათა წარხოცოს დედამიწიდან მათი სახსენებელი. "},
	{18, "18 მოუხმობენ და უსმენს უფალი და იხსნის ყველა გასაჭირისგან. "},
	{19, "19 ახლოა უფალი გულმოდრეკილებთან და სულით მორჩილებს იხსნის. "},
	{20, "20 მრავალი სიავე ხვდება მართალს და ყველაფრისგან იხსნის უფალი. "},
	{21, "21 ის იცავს მის ყოველ ძვალს, მათგან ერთიც არ შეიმუსრება. "},
	{22, "22 მოკლავს ცოდვილს ბოროტება, ხოლო მართლის მოძულენი პასუხს აგებენ. "},
	{23, "23 იხსნის უფალი თავის მორჩილთა სულს და პასუხს არ აგებენ, ვინც მასზეა მინდობილი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view34() {
struct ka34 poems[] = {
	{1, "1 დავითისა. ედავე, უფალო, ჩემს მოდავეებს, ებრძოლე ჩემს წინააღმდეგ მებრძოლთ. "},
	{2, "2 მოიმარჯვე ფარი და ჯავშანი და აღსდექ ჩემდა შესაწევნელად. "},
	{3, "3 იშიშვლე მახვილი და გზა გადაუკეტე ჩემს მდევნელებს: უთხარი ჩემს სულს: „შენი მხსნელი ვარ“. "},
	{4, "4 შერცხვნენ და გაწბილდნენ ჩემი სულის მაძიებელნი, უკუიქცნენ და სირცხვილნაჭამნი დარჩნენ ჩემზე სიავის მოფიქრალნი. "},
	{5, "5 შეიქნენ ვითარცა ჩელხი ქარის წინაშე და უფლის ანგელოზმა უკუაგდოს ისინი. "},
	{6, "6 იყოს მათი გზები ბნელი და მოლიპული და უფლის ანგელოზი სდევნიდეს მათ. "},
	{7, "7 რადგან უმიზეზოდ მომიმზადეს ორმო თავიანთი ხაფანგით, უმიზეზოდ არცხვენდნენ ჩემს სულს. "},
	{8, "8 და ეწიოს მას უბედურება მოულოდნელად და მახეში, რომელიც მოამზადა, თვითონ გაებას, დასაღუპავად ჩავარდეს შიგ; "},
	{9, "9 ჩემი სული კი იხარებდეს უფლით, ილხენდეს მისი შემწეობით. "},
	{10, "10 ყოველნი ძვალნი ჩემნი იტყვიან: უფალო, ვინ არის შენი მსგავსი? შენ იხსნი საწყალს ძლიერისაგან, ღარიბს და ღატაკს - მისი მძარცველისაგან. "},
	{11, "11 აღდგებიან ჩემს მიმართ ბოროტი ცრუმოწმენი; რაც არ ვიცი, იმას მკითხავენ. "},
	{12, "12 სიკეთის წილ ბოროტით მიხდიან, ჩემი სულის დაობლება სურთ. "},
	{13, "13 ხოლო მე მათი სნეულების ჟამს ძაძებს ვიცვამდი, ჩემს სულს მარხვით ვაძაბუნებდი და ჩემი ლოცვა ჩემთან ბრუნდებოდა. "},
	{14, "14 როგორც მეგობრის, როგორც ჩემი ძმის მიმართ, ისე ვიქცეოდი; მგლოვიარე დედასავით თავჩაღუნული ვიარებოდი. "},
	{15, "15 ხოლო ჩემი მარცხის ჟამს ხარობდნენ და იკრიბებოდნენ; იკრიბებოდნენ ჩემს წინააღმდეგ სულმდაბალნი და არ ვიცოდი - რატომ; სულს მიგლეჯდნენ და არ მეშვებოდნენ. "},
	{16, "16 პირფერული მანჭვა-დაცინვით აღრჭენდნენ კბილებს ჩემს წინააღმდეგ. "},
	{17, "17 უფალო, რამდენს უყურებ? დამიბრუნე ჩემი სული მათი გაპარტახებისგან, ლომის ბოკვერებისგან - მხოლოდშობილი ჩემი. "},
	{18, "18 მადლობას გეტყვი დიდ კრებულში, მირიად ხალხში შეგასხამ ხოტბას. "},
	{19, "19 არ გაიხარონ ჩემზე მტრებმა ტყუილუბრალოდ, ჩემი მოძულენი უმიზეზოდ თვალით ანიშნებენ ერთიმეორეს. "},
	{20, "20 რადგან მშვიდობაზე არ ლაპარაკობენ და ქვეყნიერების მორჩილთა მიმართ მზაკვრობას ფიქრობენ. "},
	{21, "21 ფართოდ გააღეს პირი ჩემზე, თქვეს: ოჰო! ოჰო! იხილა თვალმა ჩვენმა. "},
	{22, "22 შენ ხომ ნახე, უფალო, ნუ დადუმდები, ღმერთო, ნუ განმერიდები მე; "},
	{23, "23 გამოიღვიძე, გამოიღვიძე ჩემდა განსაკითხად, ღმერთო და უფალო ჩემო, ჩემი დავის გასარჩევად. "},
	{24, "24 გამასამართლე შენი სიმართლით და ნურავინ გაიხარებს ჩემზე. "},
	{25, "25 ნუ იტყვიან თავიანთ გულში: ოჰო! ასე გვენება. ნუ იტყვიან: ჩავყლაპეთ იგი. "},
	{26, "26 შერცხვნენ და გაწბილდნენ ყველანი, ვისაც ჩემი ცუდი უხარია, სირცხვილით შეიმოსონ, ვინც ჩემთან მედიდურად იქცევა. "},
	{27, "27 იგალობონ და იმხიარულონ ჩემი სიმართლის მსურველებმა და თქვან მარადჟამს: განდიდდეს უფალი, მისი მორჩილისთვის მშვიდობის მსურველი. "},
	{28, "28 და ჩემი ენა იღაღადებს სიმართლეს შენსას და ქებას შენსას დღენიადაგ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view35() {
struct ka35 poems[] = {
	{1, "1 გუნდის ლოტბარს, უფლის მორჩილი დავითისა.  "},
	{2, "2 ბიწიერება ცოდვილისა ამბობს ჩემს გულში: არ არის შიში ღმერთისა მის თვალთა წინაშე. "},
	{3, "3 რადგან ქლესაობს მასთან, თითქოს ეძებს მის დანაშაულს, რომ შეაძულოს. "},
	{4, "4 მისთა ბაგეთა სიტყვები სიცრუე და სიყალბეა, ჭკუა არ ყოფნის, რომ კეთილი ქმნას. "},
	{5, "5 უსამართლობას ფიქრობს თავის სარეცელზე, უკეთურ გზას ადგება, ბოროტს არ თაკილობს. "},
	{6, "6 უფალო, ზეცაშია შენი წყალობა, ჭეშმარიტება შენი - ღრუბლებამდე. "},
	{7, "7 სიმართლე შენი, ვითარცა მთები უფლისა, სამართალი შენი ღრმაა უფსკრულივით. ადამიანსა და პირუტყვს შენ შველი, უფალო. "},
	{8, "8 რადგან ძვირფასია შენი წყალობა, ღმერთო და ადამის ძენი შენს ფრთათა ქვეშ აფარებენ თავს. "},
	{9, "9 დაპურდებიან შენი სახლის ცხიმით და შენთა სიტკბოთა ხევიდან შეასვამ მათ. "},
	{10, "10 რადგან შენთან არის წყარო სიცოცხლისა. შენი შუქით ვხედავთ სინათლეს. "},
	{11, "11 მოჰფინე წყალობა შენი შენს მაღიარებლებს და სიმართლე შენი - გულწრფელებს. "},
	{12, "12 ნუ მოაღწევს ჩემთან ფეხი ამპარტავნისა და ხელი ბოროტთა ნუ გამდევნის მე. "},
	{13, "13 იქ დაეცნენ მოქმედნი უსამართლობისა, დავარდნენ და აღარ ძალუძთ წამოდგომა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view36() {
struct ka36 poems[] = {
	{1, "1 დავითისა. ნუ შეეხარბები ბოროტმოქმედებს, ნუ გშურს მათი, ვინც უკანონობას სჩადის. "},
	{2, "2 რადგან ბალახივით მალე გახმებიან და მწვანილივით დაჭკნებიან. "},
	{3, "3 მიენდე უფალს და ჰქმენ კეთილი; დაემკვიდრე ქვეყანაზე და მწყემსე სიმართლე. "},
	{4, "4 ისიამოვნე უფლის მიერ და ის აგისრულებს გულის წადილს. "},
	{5, "5 მიაქციე ღმერთზე შენი გზასავალი, მიენდე მას და ის აღასრულებს. "},
	{6, "6 და გამოიტანს ნათელივით სიმართლეს შენსას და შენს სამართალს - შუადღესავით. "},
	{7, "7 დაემორჩილე უფალს და დაელოდე მას. ნუ შეგშურდება თავის გზაზე წარმატებულის, კაცისა, რომელიც ბოროტს იზრახავს. "},
	{8, "8 მოეშვი მრისხანებას და მიატოვე გულისწყრომა; ნუ გამძვინვარდები, ვინძლო არ გაბოროტდე. "},
	{9, "9 რადგან ბოროტმოქმედნი ამოწყდებიან და უფალზე მინდობილნი დაიმკვიდრებენ ქვეყნიერებას. "},
	{10, "10 კიდევ ცოტა და აღარ იქნება ბოროტი, დაუკვირდები მის ადგილს და აღარ იქნება იგი. "},
	{11, "11 ხოლო თავმდაბალნი დაიმკვიდრებენ ქვეყნიერებას და დაამდებიან დიდი მშვიდობით. "},
	{12, "12 ცუდი განზრახვა აქვს ბოროტს მართლის მიმართ და კბილებს აღრჭენს მის წინააღმდეგ. "},
	{13, "13 უფალი დასცინის მას, რადგან ხედავს, რომ მოდის მისი დღე. "},
	{14, "14 მახვილი იშიშვლეს ბოროტებმა და მოზიდეს თავიანთი მშვილდი, რათა ძირს დასცენ ღარიბი და ღატაკი, მოსპონ გზიანები. "},
	{15, "15 მათი მახვილი მათსავე გულს განეწონება და მათი მშვილდები შეიმუსრება. "},
	{16, "16 მართლის მცირედი სჯობია ცოდვილთა დიდ სიმდიდრეს. "},
	{17, "17 რადგან მკლავები უკეთურთა შეიმუსრებიან, ხოლო მართალთა შემწე ღმერთია. "},
	{18, "18 იცის უფალმა დღენი უცოდველთა, და მათი მემკვიდრეობა უკუნისამდე იქნება. "},
	{19, "19 არ შერცხვებიან სიავის ჟამს და შიმშილის დღეებში დაპურდებიან. "},
	{20, "20 რადგან ბოროტნი დაიღუპებიან და მტერნი უფლისა, ვითარცა ნასუქი ცხვრები, გაქრებიან, კვამლში გაქრებიან. "},
	{21, "21 ბოროტი ისესხებს და არ გადაიხდის, მართალი კი შეიბრალებს და მისცემს. "},
	{22, "22 რადგან მის მიერ ნაკურთხნი დაიმკვიდრებენ ქვეყანას, მის მიერ დაწყევლილნი კი ამოწყდებიან. "},
	{23, "23 უფლის მიერ წარიმართება ნაბიჯები კაცისა და მის გზას შეიყვარებს. "},
	{24, "24 კიდეც რომ წაბორძიკდეს, არ დაეცემა, რადგან ღმერთია დასაყრდენი მისი ხელისა. "},
	{25, "25 ყმაწვილი ვიყავი, კიდეც მოვხუცდი და არ მინახავს მსურველებმა და თქვან მარადჟამს: განდიდდეს უფალზე ხელგაწვდილი. "},
	{26, "26 ყოველდღე მოწყალებას გაიღებს და გაასესხებს, და მისი შთამომავალი კურთხეულია. "},
	{27, "27 ერიდე ბოროტს და ჰქმენ სიკეთე და იარსებებ სამრადჟამოდ. "},
	{28, "28 რადგან უფალი სამართლის მოყვარულია და არ მიატოვებს თავის წმიდანებს: სამარადისოდ დაცულნი იქნებიან. ბოროტთა ნაშიერი კი ამოწყდება. "},
	{29, "29 მართალნი დაიმკვიდრებენ ქვეყანას და იარსებებენ მასზე უკუნისამდე. "},
	{30, "30 წმიდანის ბაგენი სიბრძნეს წარმოთქვამენ და მისი ენა სიმართლეს ილაპარაკებს. "},
	{31, "31 რჯული მისი ღმერთისა მის გულშია, არ დაუსხლტება ნაბიჯები. "},
	{32, "32 ბოროტი უთვალთვალებს წმიდანს და მის მოკვლას აპირებს. "},
	{33, "33 უფალი არ მიატოვებს მის ხელში და არ გაამტყუნებს მისი განკითხვის ჟამს. "},
	{34, "34 მიენდე უფალს და დაიცავი მისი გზა, და ის აგამაღლებს, რომ დაიმკვიდრო ქვეყანა, და დაინახავ უკეთურთა განადგურებას. "},
	{35, "35 მინახავს ბოროტი მძვინვარე, ვარჯოვან ხესავით ფესვგადგმული. "},
	{36, "36 მაგრამ გადაიარა და აჰა, აღარ არის, დავეძებ მას და ვეღარ აპოულობ. "},
	{37, "37 დაიცავი უმანკოება და ნახე სისწორე, რადგან მომავალი ეკუთვნის მშვიდობიან კაცს. "},
	{38, "38 ხოლო ბრალეულნი ერთიანად მოისპობიან, ბოროტთა მომავალი გადაშენდება. "},
	{39, "39 ხოლო წმიდათა შველა უფლისაგან არის, ის არის მათი მფარველი გაჭირვების ჟამს. "},
	{40, "40 და დაეხმარება მათ უფალი და დაიხსნის; დაიხსნის ბოროტთაგან და უშველის, რადგან მასზე არიან მინდობილნი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view37() {
struct ka37 poems[] = {
	{1, "1 ფსალმუნი დავითისა, გასახსენებელი.  "},
	{2, "2 უფალო, შენი განრისხებისას ნუ მამხილებ და შენი რისხვის ჟამს ნუ დამსჯი. "},
	{3, "3 რადგან შენი ისრები ჩემშია განწონილი და შენი ხელი მამძიმებს მე. "},
	{4, "4 არ არის ჯანსაღი ადგილი ჩემს სხეულში შენი რისხვის გამო; არ არის მშვიდობა ჩემს ძვლებში ჩემი ცოდვის გამო. "},
	{5, "5 რადგან ცოდვანი ჩემნი გასცილდნენ ჩემს თავს, მძიმე ტვირთივით დამძიმდნენ ჩემგან. "},
	{6, "6 აყროლდნენ, დალპნენ ჩემი წყლულები ჩემი უგუნურობის გამო. "},
	{7, "7 წელში მოვიხარე, ერთობ დავმდაბლდი, მთელ დღეს ნაღვლიანი დავიარები. "},
	{8, "8 რადგან ჩემი წელი გათანგულია სიცხით და აღარ არის ჯანსაღი ადგილი ჩემს სხეულში. "},
	{9, "9 დავუძლურდი და დავძაბუნდი მეტისმეტად, ვღრიალებ ჩემი გულის სატკივრით. "},
	{10, "10 უფალო, შენს წინაშეა ყველა ჩემი სურვილი და ჩემი ოხვრაც დაფარული არ არის შენგან. "},
	{11, "11 ჩემი გული თრთის, ძალღონე განმიდგა და თვალთა ჩემთა სინათლე - აღარც ის არის ჩემთან. "},
	{12, "12 ჩემი მოყვარულნი და მეგობარნი განერიდნენ ჩემს წყლულებს, და ჩემი ახლობლები შორს გამიდგნენ. "},
	{13, "13 მახე დამიგეს ჩემი სულის მაძიებლებმა, ჩემი სიავის მსურველები ბჭობენ სიცრუეს, და მთელ დღეს მზაკვრობაზე ფიქრობენ. "},
	{14, "14 მე კი ვერ ვისმენ, ვითარცა ყრუ და ვითარცა მუნჯი, პირს რომ ვერ აღებს. "},
	{15, "15 და დავემგვანე კაცს, რომელსაც არ ესმის და რომლის ბაგეებსაც არ გააჩნია პასუხი. "},
	{16, "16 რადგან შენ გელოდები, უფალო, შენ უპასუხე, უფალო, ღმერთო ჩემო. "},
	{17, "17 რადგან ვთქვი: ნუმც გაიხარონ ჩემზე; თუ ფეხი გადამიბრუნდა, გაბატონდებიან ჩემზე. "},
	{18, "18 რადგან მარცხისთვის მე მზადა ვარ და ჩემი სატკივარი ჩემს წინაა მუდამ. "},
	{19, "19 რადგანაც ჩემს ბრალს განვაცხადებ, ვიდარდებ ჩემს ცოდვაზე. "},
	{20, "20 ჩემი მტრები კი ცოცხლობენ, ძლიერდებიან და მრავლდებიან ჩემი ამაოდ მოძულენი. "},
	{21, "21 კეთილის წილ ბოროტის გადამხდელნი მმტრობენ იმისთვის, რომ კეთილს ვცდილობ. "},
	{22, "22 ნუ მიმატოვებ, უფალო, ღმერთო ჩემო, ნუ გამშორდები. "},
	{23, "23 გამოეშურე ჩემს შესაწევნად, უფალო, მშველელო ჩემო! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view38() {
struct ka38 poems[] = {
	{1, "1 გუნდის ლოტბარს, იედუთუნს, დავითის ფსალმუნი.  "},
	{2, "2 ვიფიქრე: დავიცავ ჩემს გზებს ჩემი ენის შეცოდებისგან, ალიკაპს ავიკრავ პირზე, ვიდრე ბოროტი იმყოფება ჩემს პირდაპირ. "},
	{3, "3 დავმუნჯდი, დავდუმდი სიკეთეზეც კი; მაგრამ ვაება გამიძლიერდა. "},
	{4, "4 გახურდა გული ჩემი ჩემს შიგნით, ჩემს აზრებში ცეცხლი აღეგზნო; ვიწყე ლაპარაკი ჩემი ენით: "},
	{5, "5 მაუწყე, უფალო, ჩემი აღსასრული და როგორია ხანგრძლივობა ჩემი დღეების, შევიტყო, რა არის ჩემი ბედისწერა. "},
	{6, "6 აჰა, გოჯებით მომეცი მე დღენი, ხოლო არსება ჩემი არაფერია შენს წინაშე; არამედ სრული ამაოებაა ყოველი ძე ხორციელი. სელა. "},
	{7, "7 ამიტომ აჩრდილს მიუყვება ადამიანი, მაგრამ ამაოდ ფაციფუცობს, აგროვებს და არ იცის, ვის დარჩება. "},
	{8, "8 და ახლა რას ვესავ, უფალო? შენზეა ჩემი იმედი. "},
	{9, "9 ყოველი ჩემი ბრალისაგან გადამარჩინე, ნუ გამხდი ბრიყვის გასალანძღავად. "},
	{10, "10 დავმუნჯდი, ბაგეს აღარ გავაღებ, რადგან შენ ჰყავი ასეთნაირად. "},
	{11, "11 ამარიდე სასჯელი შენი; შენი ხელის დარტყმისაგან დარბეული ვარ. "},
	{12, "12 თუ ცოდვისათვის მხილებით დასჯი ადამიანს, ვითარცა ჩრჩილი, გაილევა მისი მშვენება, მხოლოდ ამაოებაა ყოველი კაცი. სელა. "},
	{13, "13 მოისმინე ჩემი ლოცვა, უფალო, და ჩემს ვედრებას ყური მოაპყარ; ჩემი ცრემლის მიმართ ნუ დადუმდები, რადგან მწირი ვარ შენთან და ხიზანი, ვითარცა ჩემი მამა-პაპანი. "},
	{14, "14 განზე განმიდექ, რათა მოვმაგრდე, ვიდრე წავიდოდე და აღარ ვიქნებოდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view39() {
struct ka39 poems[] = {
	{1, "1 გუნდის ლოტბარს, დავითის ფსალმუნი.  "},
	{2, "2 მტკიცედ ვესავდი უფალს და მომხედა მე, და მოისმინა ჩემი ვედრება. "},
	{3, "3 და ამომიყვანა საზარელი ორმოდან, გაუვალი ლაფიდან, და დააყენა კლდეზე ფეხნი ჩემნი, წარმართა ჩემი ნაბიჯები. "},
	{4, "4 და მისცა ჩემს ბაგეებს ახალი გალობა - განსადიდებლად ჩვენი ღმერთისა. ბევრი ნახავს და შეშინდება და მიენდობა უფალს. "},
	{5, "5 ნეტარ არს კაცი, ვინც უფალზე ამყარებს იმედს, და არ მიმართავს კადნიერთ და სიცრუის მოტრფიალეთ. "},
	{6, "6 ბევრი რამ გააკეთე შენ, უფალო, ღმერთო ჩემო; შენს სასწაულებსა და ჩანაფიქრებზე ჩვენს მიმართ - ვინ შეგედრება შენ! ვიქადაგებ და ვილაპარაკებ; მრავალია და ძნელია სათქმელად. "},
	{7, "7 მსხვერპლი და შესაწირავი არ ისურვე; ყურები გამიმახვილე; აღსავლენი და ცოდვის მსხვერპლი არ მოგითხოვია; "},
	{8, "8 მაშინ ვთქვი: აი, მოვედი; წიგნის გრაგნილში წერია ჩემზე. "},
	{9, "9 შენი სურვილის შესრულება მინდოდა, ღმერთო, და რჯული შენი ჩემს გულშია. "},
	{10, "10 სიმართლეს მოვუთხრობდი დიდ კრებულს; აჰა, ბაგენი ჩემნი არ მომიკუმავს, უფალო, შენ უწყი. "},
	{11, "11 შენი სიმართლე არ დამიფარავს ჩემს გულში, შენს ერთგულებასა და შენს ხსნაზე ვლაპარაკობდი, შენი წყალობა და ჭეშმარიტება არ დამიმალავს დიდი კრებულისათვის. "},
	{12, "12 შენ, უფალო, არ დამილიო შენი თანაგრძნობა; შენი წყალობა და შენი ჭეშმარიტება მუდამ მიცავენ მე. "},
	{13, "13 რადგანაც გარე შემომეხვია აურაცხელი უბედურება, წამომეწივნენ ცოდვანი ჩემნი და არ შემეძლო დანახვა; ჩემი თმის ბეწვებზე მეტად მომრავლდნენ და გულმა მიმატოვა. "},
	{14, "14 ისურვე, უფალო, ჩემი დახსნა; უფალო, ჩემს დასახმარებლად გამოეშურე. "},
	{15, "15 დაე, შერცხვნენ და გაწბილდნენ, ვინც ჩემი სულის დაღუპვას ეძებს, უკუიქცნენ და თავი მოეჭრათ ჩემს ავის მდომებს; "},
	{16, "16 დაე, შეძრწოლდნენ სირცხვილისაგან, ვინც მეუბნებოდა: ოჰო, ოჰო! "},
	{17, "17 გაიხაროს და გამხიარულდეს ყველა, ვინც შენ გეძებს, მუდამ თქვან შენი შველის მოყვარულებმა: დიდია უფალი. "},
	{18, "18 ხოლო მე ღარიბ-ღატაკი ვარ; უფალი იფიქრებს ჩემზე. ჩემი დამხმარე და მხსნელი შენა ხარ, ღმერთო ჩემო, ნუ დააყოვნებ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view40() {
struct ka40 poems[] = {
	{1, "1 გუნდის ლოტბარს, დავითის ფსალმუნი.  "},
	{2, "2 ნეტარ არს, ვინც ფიქრობს ღატაკზე. უბედურების დღეს გადაარჩენს მას უფალი. "},
	{3, "3 უფალი დაიცავს მას და აცოცხლებს და ბედნიერი იქნება ქვეყანაზე; და არ გადასცემს მის მტრებს მათი სურვილისამებრ. "},
	{4, "4 უფალი გაამაგრებს მას მისი სნეულების სარეცელზე; მთელ მის სარეცელს შენ შეცვლი მისი ავადმყოფობის ჟამს. "},
	{5, "5 ვთქვი მე: უფალო, შემიწყალე, განმიკურნე ჩემი სული, რადგან შეგცოდე. "},
	{6, "6 ჩემი მტრები ავს იტყვიან ჩემზე: „როდის მოკვდება და გაქრება მისი სახელი“. "},
	{7, "7 და თუ მოვა სანახავად, ტყუილს ილაპარაკებს; მისი გული სიცრუეს თხზავს; გარეთ გავა და ალაპარაკდება. "},
	{8, "8 ერთთავად ჩემზე ჩურჩულებენ ყველანი, ვინც მოძულეა ჩემი; ბოროტს ფიქრობენ ჩემზე. "},
	{9, "9 სისაძაგლე აცუნდრუკებს მას და, თუ დაწვა, ვეღარ წამოდგება. "},
	{10, "10 ჩემთან მშვიდობიანად მყოფმაც კი, რომლის იმედიც მქონდა, რომელიც ჩემს პურს ჭამდა, ტერფი აღმართა ჩემს წინააღმდეგ. "},
	{11, "11 ხოლო შენ, უფალო, შემიწყალე, და წამომაყენე, და მე მივუზღავ მათ. "},
	{12, "12 ამით ვიცოდი, რომ გიყვარდი, რომ არ გაიხარებს მტერი ჩემზე. "},
	{13, "13 და მე ჩემი უბიწოებისათვის შემეწევი და შენს წინაშე დამაყენებ სამარადისოდ. "},
	{14, "14 კურთხეულ არს უფალი, ღმერთი ისრაელისა უკუნითი უკუნისამდე. ამინ, ამინ! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view41() {
struct ka41 poems[] = {
	{1, "1 გუნდის ლოტბარს, მოძღვრება კორახის ძეთა.  "},
	{2, "2 როგორც ირემი მიილტვის წყლის ნაკადულებისაკენ, ისე მოილტვის ჩემი სული შენსკენ, ღმერთო! "},
	{3, "3 ძლიერი და უკვდავი ღმერთის წყურვილი აქვს ჩემს სულს: როდის მოვალ და ვიხილავ სახეს ღმერთისას. "},
	{4, "4 ჩემი ცრემლები პურად მქონდა დღისით და ღამით, რაკი მეტყოდნენ ყოველდღიურად: სად არის ღმერთი შენი? "},
	{5, "5 ამის გახსენებაზე სული მეღვრება, რადგან ვიდოდი ხალხის გროვაში, მათთან ერთად მივდიოდი უფლის სახლამდე მოზეიმე გუნდის მხიარულებისა და მადლიერების ხმით. "},
	{6, "6 რას დაღვრემილხარ, სულო ჩემო, და რად დამკვნესი? მიენდე ღმერთს, რადგან კვლავ ვადიდებ მას მისი შველისთვის. "},
	{7, "7 ღმერთო ჩემო, დაღვრემილია სული ჩემი: ამიტომ გიხსენიებ იორდანისა და ხერმონის მიწიდან, მიცყარის მთიდან. "},
	{8, "8 უფსკრული უფსკრულს გასძახის შენი სადინარების ხმით; ყველა ტალღამ და ზვირთმა შენმა ჩემზე გადაიარა. "},
	{9, "9 დღისით გამოგზავნის უფალი თავის წყალობას და ღამით ვუგალობებ მას ჩემთან. ჩემი სიცოცხლის ღმერთისადმი ლოცვას აღვავლენ. "},
	{10, "10 ვუთხარი ღმერთს, ჩემს ქომაგს: რად დამივიწყე? რად მაიძულე, რომ ვიარო მტრისაგან შეჭირვებულმა. "},
	{11, "11 ჩემი ძვლების შემუსვრის დროს მლანძღავდნენ ჩემი მტრები, მეუბნებოდნენ ყოველდღე: სად არის ღმერთი შენი? "},
	{12, "12 რას დაღვრემილხარ, სულო ჩემო, და რად დამკვნესი? მიენდე ღმერთს, რადგან კვლავ ვადიდებ მას - ჩემს დამხსნელსა და ჩემს ღმერთს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view42() {
struct ka42 poems[] = {
	{1, "1 განმიკითხე, ღმერთო, და გამომესარჩლე უკეთურ ხალხთან, ცბიერი და ბოროტი კაცისაგან მიხსენი. "},
	{2, "2 რადგან შენ ნარ ღმერთი ჩემი სიმაგრისა. რად მიმატოვე? რად მაიძულე, რომ ვიარო მტრისაგან შეჭირვებულმა? "},
	{3, "3 გამოავლინე შუქი შენი და ჭეშმარიტება შენი. ისინი წამიძღვებიან და მიმიყვანენ შენს წმიდა მთასთან და შენს სამკვიდროსთან. "},
	{4, "4 და მივალ ღმერთის სამსხვერპლოსთან, ჩემი დაუშრეტელი სიხარულის ღმერთთან და გადიდებ შენ ქნარით, ღმერთო, ჩემო ღმერთო! "},
	{5, "5 რას დაღვრემილხარ, სულო ჩემო, და რას დამკვნესი? მიენდე ღმერთს, რადგან კვლავაც განვადიდებ მას - ჩემს დამხსნელსა და ჩემს ღმერთს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view43() {
struct ka43 poems[] = {
	{1, "1 გუნდის ლოტბარს, კორახის ძეთა მოძღვრება.  "},
	{2, "2 ღმერთო, ჩვენი ყურით მოვისმინეთ, ჩვენი მამები გვიამბობდნენ, თუ რა საქმე მოიმოქმედე მათ დღეებში, უძველეს დროში. "},
	{3, "3 შენ შენი ხელით განდევნე ხალხები, ხოლო ისინი დანერგე; გაანადგურე ერები და განდევნე. "},
	{4, "4 ვინაიდან მათ ხმლით არ მოუპოვებიათ ქვეყანა, და მათ მკლავებს არ დაუხსნიათ ისინი, არამედ შენმა მარჯვენამ, შენმა მკლავმა და შენი სახის ნათელმა, რადგან მათდამი კეთილგანეწყვე. "},
	{5, "5 შენ ხარ ის, ხელმწიფეო ჩემო, ღმერთო; უბოძე შველა იაკობს. "},
	{6, "6 შენით დავანარცხებთ ჩვენს მტრებს; შენი სახელით გავთელავთ, ვინც აღდგება ჩვენს წინააღმდეგ. "},
	{7, "7 რადგან ჩემს მშვილდზე არა ვარ დანდობილი და ჩემი მახვილი არ დამიხსნის. "},
	{8, "8 არამედ შენ გვიხსნი ჩვენი მტრებისაგან და ჩვენს მოძულეებს შეარცხვენ. "},
	{9, "9 ღმერთით ვტრაბახობდით ყოველდღე და შენს სახელს ვადიდებთ უკუნისამდე. სელა. "},
	{10, "10 მაგრამ მიგვატოვე და შეგვარცხვინე, და არ გამოდიხარ ჩვენს მხედრობასთან. "},
	{11, "11 უკუგვაქციე მტრისაგან და ჩვენმა მოძულეებმა გაგვძარცვეს ჩვენ. "},
	{12, "12 მიგვეცი ჩვენ, როგორც ცხვარი, შესაჭმელად, და დაგვფანტე ხალხებს შორის. "},
	{13, "13 გაჰყიდე შენი ერი სარგებლის გარეშე, და არ იდავე მათ ფასზე. "},
	{14, "14 მიგვეცი შესარცხვენად მეზობლებს, დასაცინად და საგინებლად - ჩვენს ირგვლივ მყოფთ. "},
	{15, "15 იგავად გვაქციე ხალხებს შორის, თავის გასაქნევ-გამოსაქნევად ერებს შორის. "},
	{16, "16 ყოველდღე ჩემი აუგი ჩემს წინაშეა და სირცხვილი მიფარავს სახეს "},
	{17, "17 შემარცხვენლისა და მაგინებლის ხმისაგან, მტრისა და შურისმაძიებლის პირისაგან. "},
	{18, "18 ყოველივე ეს გვეწია ჩვენ, და მაინც არ დაგივიწყეთ შენ, არ გაგვიმრუდებია შენი აღთქმა. "},
	{19, "19 არ უკუქცეულან ჩვენი გულები და არც ჩვენს ტერფებს გადაუხვევიათ შენი გზიდან. "},
	{20, "20 როცა შენ შეგვმუსრე ტურების ადგილას და გადაგვაფარე სირცხვილის ჩრდილი. "},
	{21, "21 ჩვენ რომ დაგვევიწყებინა სახელი ჩვენი ღმერთისა, და ხელი გაგვეშვირა უცხო კერპებისთვის, "},
	{22, "22 განა ღმერთი არ გვაზღვევინებს ამას? რადგან მან იცის საიდუმლონი გულისა. "},
	{23, "23 ხოლო შენი გულისათვის გვკლავდნენ ყოველდღე, მივაჩნდით დასაკლავ ცხვრად. "},
	{24, "24 გამოიღვიძე, რატომ გძინავს, უფალო, გამოფხიზლდი, სამუდამოდ ნუ მიგვატოვებ. "},
	{25, "25 რატომ ფარავ შენს სახეს? ივიწყებ ჩვენს მწუხარებასა და გაჭირვებას? "},
	{26, "26 რადგან მეტისმეტად სულდამძიმებულნი ვართ, მიწას განერთხა ჩვენი მუცელი. "},
	{27, "27 აღსდექ ჩვენს დასახმარებლად და გვიხსენი შენი წყალობის გულისათვის. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view44() {
struct ka44 poems[] = {
	{1, "1 გუნდის ლოტბარს, შოშანის საკრავზე: მოძღვრება კორახისა, გალობა სიყვარულისა.  "},
	{2, "2 აღმოთქვა ჩემმა გულმა სიტყვა კეთილი. მე ვამბობ: ჩემი ნახელავი - მეფეს; ჩემი ენა კალამია სწრაფად მწერლისა. "},
	{3, "3 ადამის ძეთა უმშვენესი ხარ, მადლი იღვრება შენთა ბაგეთაგან, ამიტომ გაკურთხა ღმერთმა უკუნისამდე. "},
	{4, "4 წელზე შემოირტყი შენი მახვილი, გმირო, შენი დიდებით და მშვენებით. "},
	{5, "5 და ამ შენი მშვენებით დაბრძანდი ეტლზე ჭეშმარიტების, თვინიერებისა და სიმართლის გულისათვის, და აჩვენებს საოცრებას მარჯვენა შენი. "},
	{6, "6 შენი ისრები წამახულია, ხალხები ეცემიან შენს ფეხქვეშ; გულში ერჭობიან მეფის მტრებს. "},
	{7, "7 ტახტი შენი, ღმერთო, უკუნითი უკუნისამდეა, სიმართლის კვერთხია კვერთხი შენი მეუფებისა. "},
	{8, "8 შენ შეიყვარე სიმართლე და შეიძულე ბოროტება; ამიტომაც გცხო ღმერთმა, შენმა ღმერთმა, სიხარულის ზეთი შენს მეგობრებზე უმეტეს. "},
	{9, "9 მთელი შენი სამოსი - ვითარცა ზმირინი, ალოე და კასია; სპილოს ძვლის დარბაზებიდან გაგამხიარულებენ შენ. "},
	{10, "10 მეფეთა ასულნი შენს დიდებულებს შორის არიან; შენს მარჯვნივ დადგა დედოფალი ოფირის ოქროთი შემკული. "},
	{11, "11 მისმინე, ასულო, გამოიხედე და მომაპყარ ყური. და დაივიწყე ხალხი შენი და სახლი მამაშენისა. "},
	{12, "12 და დატკბება მეფე შენი მშვენებით, რადგან ის არის შენი უფალი, და თაყვანი ეცი მას. "},
	{13, "13 და ასულნი ტვიროსისა ძღვენით მოვლენ; მუდარას დაგიწყებენ ერის მდიდარნი. "},
	{14, "14 მთელი დიდება მეფის ასულისა შიგნითაა; მოოქროვილია მისი სამოსი. "},
	{15, "15 მოქარგული კაბით მოჰყავთ იგი მეფესთან; მის უკან ქალწულნი, დობილნი მისნი მოჰყავთ შენთან. "},
	{16, "16 მოჰყავთ სიხარულით და ლხინით, შედიან მეფის სრა-სასახლეში. "},
	{17, "17 შენს წინაპართა ადგილას იქნებიან ძენი შენნი; მათ დააყენებ მთავრებად მთელ დედამიწაზე. "},
	{18, "18 გავიხსენებ შენს სახელს თაობიდან თაობაში, ამიცომ ხალხები ხოტბას შეგასხამენ უკუნითი უკუნისამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view45() {
struct ka45 poems[] = {
	{1, "1 გუნდის ლოტბარს, გალობა კორახის ძეთა, ალამოთის საკრავზე.  "},
	{2, "2 ღმერთია ჩვენი მფარველი და ძალა, შემწე გაჭირვებაში, საძებარი ფრიად. "},
	{3, "3 ამიტომ არ შეგვეშინდება, თუნდაც პირი იცვალოს ქვეყნიერებამ და მთები დაიძრნენ ზღვათა გულისაკენ. "},
	{4, "4 იხმაურებენ, იბობოქრებენ წყალნი მათნი, მთები შეირყევიან მათი მედიდურობით. სელა. "},
	{5, "5 მდინარე, მისი ნაკადები გაახარებენ ღმერთის ქალაქს, წმიდა სადგომს ზენაარისას. "},
	{6, "6 ღმერთი მის შუაგულშია; არ წაბორძიკდება, ღმერთი შეეწევა მას გარიჟრაჟზე. "},
	{7, "7 ახმაურდნენ ხალხები, შეიძრნენ სამეფონი, გამოსცა ხმა - გაქრა ქვეყანა. "},
	{8, "8 ძალთა უფალი ჩვენთან არის; ჩვენი ბურჯია ღმერთი იაკობისა. სელა. "},
	{9, "9 მოდით, იხილეთ საქმენი უფლისანი, როგორ გააპარტახა დედამიწა. "},
	{10, "10 შეწყვეტს ომებს დედამიწის კიდით-კიდემდე, მშვილდს შემუსრავს და შუბს დაამსხვრევს, ეტლებს დაბუგავს ცეცხლით. "},
	{11, "11 შეჩერდით და გაიგეთ, რომ მე ვარ ღმერთი; ამაღლებული ხალხებს შორის, ამაღლებული ქვეყნიერებაზე. "},
	{12, "12 ძალთა უფალი ჩვენთან არის; ჩვენი ბურჯია ღმერთი იაკობისა. სელა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view46() {
struct ka46 poems[] = {
	{1, "1 გუნდის ლოტბარს, კორახის ძეთა ფსალმუნი.  "},
	{2, "2 ხალხნო ყოველნო, შემოჰკარით ტაში, შეჰღაღადეთ ღმერთს გალობის ხმით; "},
	{3, "3 რადგან საშიშია უფალი ზენაარი, დიდი ხელმწიფე მთელი ქვეყნისა. "},
	{4, "4 დაგვიმორჩილებს ხალხებს და ერებს - ჩვენთა ფეხთა ქვეშ. სელა. "},
	{5, "5 ამოგვირჩევს ჩვენს სამკვიდრებელს, მშვენებას იაკობისას, რომ შეიყვარა. სელა. "},
	{6, "6 ამაღლდა ღმერთი შეძახილის ჟამს, უფალი - საყვირის ხმაზე. "},
	{7, "7 უგალობეთ ღმერთს, უგალობეთ, უგალობეთ ჩვენს მეფეს, უგალობეთ. "},
	{8, "8 რადგან მთელი ქვეყნიერების მეფეა ღმერთი; უგალობეთ გონივრულად. "},
	{9, "9 გამეფდა ღმერთი ხალხებზე, ღმერთი ზის თავის წმიდა ტახტზე. "},
	{10, "10 მთავარნი ხალხთა შეიკრიბნენ აბრაამის ღმერთის ხალხად, რადგან ღმერთისაა ფარნი ქვეყნისანი; ამაღლდა ფრიად. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view47() {
struct ka47 poems[] = {
	{1, "1 ფსალმუნი, საგალობელი კორახის ძეთა.  "},
	{2, "2 დიდია უფალი და ქებულია მეტად ჩვენი ღმერთის ქალაქში, წმიდა მთაზე. "},
	{3, "3 ლამაზი მაღლობი, სიხარული მთელი ქვეყნიერებისა მთა სიონი; ჩრდილოეთ მხარეს ქალაქია დიდი მეფისა. "},
	{4, "4 ღმერთი თავის სადგომში ცნობილია, ვითარცა სიმაგრე. "},
	{5, "5 რადგან აგერ შეიკრიბნენ მეფენი და განვლეს ერთად. "},
	{6, "6 ნახეს მათ და განცვიფრდნენ, შეძრწუნდნენ და გაეჩქარნენ. "},
	{7, "7 ძრწოლამ შეიპყრო ისინი, იკლაკნებიან მშობიარესავით. "},
	{8, "8 აღმოსავლეთის ქარით შემუსრე ხომალდნი თარშიშისანი. "},
	{9, "9 როგორც ვისმინეთ, ისე ვიხილეთ ძალთა უფლის ქალაქში, ჩვენი ღმერთის ქალაქში; ღმერთი დააფუძნებს მას უკუნისამდე. სელა. "},
	{10, "10 ვფიქრობდი, ღმერთო, შენს წყალობაზე შენი ტაძრის შუაგულში. "},
	{11, "11 ვითარცა სახელი შენი, ღმერთო, შენი დიდებაც დედამიწის კიდით-კიდემდეა; სიმართლით სავსეა შენი მარჯვენა. "},
	{12, "12 დაე, იხაროს სიონის მთამ, იმხიარულონ იუდაელმა ქალწულებმა შენი სამართლის გამო; "},
	{13, "13 ყოველი მხრიდან მიადექით და გარს შემოუარეთ სიონს; დათვალეთ მისი კოშკები. "},
	{14, "14 გული დაუდეთ მის სიმაგრეებს; დაიარეთ მისი დარბაზები, რათა უამბოთ მომავალ თაობას. "},
	{15, "15 რადგან ის არის ღმერთი, ჩვენი ღმერთი უკუნითი უკუნისამდე; ის წაგვიძღვება ჩვენ სამარის კარამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view48() {
struct ka48 poems[] = {
	{1, "1 გუნდის ლობტარს, კორახის ძეთა ფსალმუნი.  "},
	{2, "2 ისმინეთ ესე, ხალხო ყოველო, ყური მოაპყარით ქვეყნიერების ყველა მცხოვრებო, "},
	{3, "3 უბრალოებმაც, დიდგვაროვნებმაც, მდიდარმა და ღარიბმა ერთად. "},
	{4, "4 ჩემი პირი წარმოთქვამს სიბრძნეს და ჩემი გულის ფიქრი გონიერებას. "},
	{5, "5 ყურს მივუგდებ იგავს, ქნარზე ამოვხსნი ჩემს გამოცანას, "},
	{6, "6 რად შემეშინდება უბედურების ჟამს, ჩემი გზების ცოდვა გარს შემომეხვევა? "},
	{7, "7 თავიანთი ძალით და უხვი სიმდიდრით დაიმედებულნი იტრაბახებენ. "},
	{8, "8 ძმა დახსნით ვერ დაიხსნის კაცს, ვერ მისცემს ღმერთს მის გამოსასყიდს. "},
	{9, "9 ძვირია მათი სულის გამოხსნა და არ ეგების უკუნისამდე. "},
	{10, "10 რომ ცოცხლად დარჩეს სამარადისოდ და არ იხილოს საფლავი. "},
	{11, "11 რადგანაც ხედავს: ბრძენნი იხოცებიან, ბრიყვისა და სულელის მსგავსად იღუპებიან და თავიანთ დოვლათს სხვას უტოვებენ. "},
	{12, "12 გულში ფიქრობენ, რომ მათი სახლები მუდმივია და მათი საცხოვრებლები - თაობიდან თაობამდე; თავიანთ სახელებს უწოდებენ მამულებს. "},
	{13, "13 ადამიანი პატივისცემაში ვერ დარჩება; მიმსგავსებულია დასაკლავ პირუტყვს. "},
	{14, "14 ეს მათი გზა მათი უგუნურობაა, თუმცა შემდგომნი მათნი იწონებენ. "},
	{15, "15 ცხვრებივით ჩაყრიან ჯოჯოხეთში; სიკვდილი მწყემსავს მათ, დილით კი წმიდანები გაბატონდებიან მათზე; და სიმაგრე მათი დაიშრიტება, საფლავია მათი სადგომი; "},
	{16, "16 ხოლო ღმერთი დაიხსნის ჩემს სულს ჯოჯოხეთისაგან, როცა ამომიყვანს. სელა. "},
	{17, "17 არ შეგეშინდეს, თუ გამდიდრდეს კაცი, თუ გამრავლდეს მისი სახლის დიდება. "},
	{18, "18 რადგან, როცა მოკვდება, ვერაფერს წაიღებს, თან არ ჩაჰყვება მისი დიდება. "},
	{19, "19 თუმცა თავიანთ სულს სიცოცხლეშივე აკურთხებენ და გადიდებენ შენ იმისათვის, რომ კეთილს იზამ. "},
	{20, "20 მივა მამების თაობასთან, რომელნიც ვერასოდეს ვერ იხილავენ სინათლეს. "},
	{21, "21 ადამიანი, რომელიც პატივისცემაშია და არ გაეგება, დამსგავსებულია დასაკლავ პირუტყვს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view49() {
struct ka49 poems[] = {
	{1, "1 ფსალმუნი ასაფისა. ღმერთმა ღმერთთამან, უფალმა დაილაპარაკა და მოუწოდა ქვეყნიერებას მზის ამოსვლიდან მის ჩასვლამდე. "},
	{2, "2 სიონიდან, მშვენიერების სრულქმნილებიდან, გამობრწყინდა უფალი. "},
	{3, "3 მოვა ჩვენი ღმერთი და ნუმც დადუმდება; მის წინაშე მწველი ცეცხლია და მის ირგვლივ - ძლიერი ქარიშხალი. "},
	{4, "4 გამოიძახებს ცას ზევიდან და დედამიწას თავისი ხალხის სამსჯავროზე: "},
	{5, "5 შემომიკრიბეთ ჩემი წმიდანები, რომელთაც აღთქმა დადეს ჩემთან შესაწირავზე. "},
	{6, "6 და წარმოთქვამენ ცანი მის სიმართლეს; რადგან ღმერთია მსაჯული იგი. სელა. "},
	{7, "7 ისმინე, ჩემო ხალხო, და გელაპარაკები; ისრაელო, გაგაფრთხილებ შენ. მე ვარ ღმერთი, შენი ღმერთი. "},
	{8, "8 მსხვერპლისათვის კი არ გისაყვედურებ; შენი შესაწირავები ყოველთვის ჩემს წინაშეა. "},
	{9, "9 არ შევიწირავ შენი სახლიდან ზვარაკს, არც შენი ფარეხებიდან ვაცებს. "},
	{10, "10 რადგან ჩემია ტყის ყველა ცხოველი, პირუტყვი ათასობით მთებში. "},
	{11, "11 ჩემთვის ცნობილია მთის ყველა ფრინველი და მინდვრის ცხოველები ჩემს წინაშე არიან. "},
	{12, "12 თუ მომშივდა, არ გეტყვი შენ, რადგან ჩემია მსოფლიო და სავსება მისი. "},
	{13, "13 ნუთუ ხარების ხორცსა ვჭამ და ვაცების სისხლს შევსვამ? "},
	{14, "14 მადლობა შესწირე ღმერთს და შეუსრულე უზენაესს აღთქმები შენი. "},
	{15, "15 და მომიხმე მე გაჭირვების დღეს; გადაგარჩენ და შენ განმადიდებ. "},
	{16, "16 ბოროტს კი უთხრა ღმერთმა: „რას ქადაგებ კანონებს და პირთან მიგაქვს ჩემი პირობა? "},
	{17, "17 შენ ხომ გძულს დარიგება და უკუმოისროლე ჩემი სიტყვები. "},
	{18, "18 როცა ქურდს დაინახავ, მასთან გაიქცევი, და გარყვნილებთან გაქვს წილი. "},
	{19, "19 პირი შენი მიშვებული გაქვს სიავეზე და შენი ენა თხზავს სიყალბეს. "},
	{20, "20 დაჯდები და შენს ძმაზე ლაპარაკობ და დედაშენის შვილის შერცხვენას ცდილობ. "},
	{21, "21 ეს ჩაიდინე შენ და მე გავჩუმდი; გეგონა, რომ მეც შენსავით ვარ; გამხილებ და შენს თვალწინ დაგიმტკიცებ. "},
	{22, "22 ჩაუფიქრდით ამას, ღმერთის დამვიწყებლებო, თორემ მოგსრავთ და ვერვინ გიშველით. "},
	{23, "23 მადლობის შემომწირავი განმადიდებს მე და ვინც სწორ გზას დაადგება, მას ვუჩვენებ შველას ღმერთისას“. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view50() {
struct ka50 poems[] = {
	{1, "1 გუნდის ლოტბარს, დავითის ფსალმუნი.  "},
	{2, "2 რაჟამს მივიდა მასთან ნათან წინასწარმეტყველი, მას შემდეგ, როცა ბათ-შებაყთან შევიდა.  "},
	{3, "3 შემიწყალე, ღმერთო, შენი წყალობისამებრ, შენი მრავალი შებრალებისამებრ წაშალე ჩემი დანაშაული. "},
	{4, "4 მრავლად განმბანე ჩემი ბრალისაგან და ჩემი ცოდვისაგან განმწმინდე. "},
	{5, "5 რადგან ვიცი ჩემი დანაშაული და ჩემი ცოდვა მუდამ თვალწინ მიდგას. "},
	{6, "6 შენ, მხოლოდ შენ შეგცოდე და ბოროტება ჩავიდინე შენს თვალში, ამიტომ მართალი ხარ შენს სიტყვებში და სწორი - შენს სამართალში. "},
	{7, "7 აჰა, უკანონოდ ჩავისახე და ცოდვით დაორსულდა ჩემზე დედაჩემი. "},
	{8, "8 აჰა, შენ შეიყვარე ჭეშმარიტება გულით და გამაგებინე სიბრძნე ფარული. "},
	{9, "9 მასხურე უსუპი და განვიწმინდები; განმბანე და თოვლზე მეტად გავსპეტაკდები. "},
	{10, "10 მომასმენინე ლხინი და მხიარულება, გაახარე ჩემი ძვლები, შენ რომ დათრგუნე. "},
	{11, "11 სახე არიდე ჩემს შეცოდებებს და ყველა ჩემი ბრალი წაშალე. "},
	{12, "12 სუფთა გული შეჰქმენი ჩემში, ღმერთო, და წრფელი სული განაახლე ჩემს სხეულში. "},
	{13, "13 ნუ უკუმაგდებ შენგან და ნუ წამართმევ შენი სიწმიდის სულს. "},
	{14, "14 დამიბრუნე სიხარული შენი ხსნით და დიდებული სულით გამამაგრე. "},
	{15, "15 ვასწავლი დამნაშავეებს შენს გზებს და ცოდვილნი დაბრუნდებიან შენთან. "},
	{16, "16 მიხსენ სისხლთაგან, ღმერთო, ღმერთო ჩემი ხსნისა, და ჩემი ენა ხოტბას შეასხამს შენს სიმართლეს. "},
	{17, "17 უფალო! გახსენი ჩემი ბაგენი და ჩემი პირი იტყვის შენს ქებას. "},
	{18, "18 რადგან მსხვერპლი არა გსურს, რომ შემოგწირო, და აღსავლენს არ ინებებ. "},
	{19, "19 შესაწირავი ღმერთისა - სული მოდრეკილი; მოდრეკილისა და მორჩილის გული არ დაამცირო, ღმერთო. "},
	{20, "20 კეთილი უყავ შენი სურვილით სიონს, ააშენე გალავნები იერუსალიმისა. "},
	{21, "21 მაშინ ისურვებ სიმართლის შესაწირავებს, აღსავლენსა და მთლად დასაწველს; მაშინ აიტანენ შენს სამსხვერპლოზე ზვარაკებს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view51() {
struct ka51 poems[] = {
	{1, "1 გუნდის ლოტბარს, მოძღვრება დავითისა.  "},
	{2, "2 როცა მივიდა დოეგ ედომელი და გააგებინა საულს და უთხრა, რომ მივიდა დავითი ახიმელექის სახლში.  "},
	{3, "3 რას ტრაბახობ ბოროტებით, ძლიერო? ღმერთის წყალობა საყოველდღეოა. "},
	{4, "4 ბოროტებას იზრახავს შენი ენა; როგორც გალესილი სამართებელი, მქმნელია სიყალბისა. "},
	{5, "5 გიყვარს ბოროტება სიკეთეზე მეტად, სიცრუე - სიმართლის ლაპარაკზე მეტად. სელა. "},
	{6, "6 გიყვარს ყოველგვარი ცილისწამება, ენა მზაკვარი; "},
	{7, "7 ამიტომ მოგთხრის ღმერთი სამუდამოდ, გაგანადგურებს, გაგაძევებს კარვიდან და შენს ფესვს ამოძირკვავს ცოცხალთა ქვეყნიდან. სელა. "},
	{8, "8 ნახავენ მართალნი და შეშინდებიან, და გაიცინებენ მასზე: "},
	{9, "9 აგერ კაცი, რომელმაც ღმერთი არ მიიჩნია თავის სიმაგრედ, არამედ თავისი დიდი სიმდიდრის იმედი ჰქონდა, თავის ბოროტებაში გამაგრდა. "},
	{10, "10 ხოლო მე, ვითარცა ამწვანებული ზეთისხე ღმერთის სახლში, ღმერთის წყალობაზე ვარ მინდობილი უკუნითი უკუნისამდე. "},
	{11, "11 გადიდებ მუდამ შენი ნამოქმედარისთვის და მივენდობი შენს სახელს, რადგან კარგია იგი შენს წმიდათა წინაშე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view52() {
struct ka52 poems[] = {
	{1, "1 გუნდის ლოტბარს, მახალათის საკრავზე, მოძღვრება დავითისა.  "},
	{2, "2 თქვა არამზადამ თავის გულში: „არ არის ღმერთი“, გაირყვნენ და ჩაიდინეს სისაძაგლე; აღარ არსებობს სიკეთის მქნელი. "},
	{3, "3 ღმერთი ციდან უჭვრეტს ადამის ძეთ, რომ დაინახოს არის თუ არა ვინმე ჭკუათმყოფელი, ღმერთს რომ ეძიებს. "},
	{4, "4 ყველა გაუკუღმართდა, გაიხრწნა ერთობ, კარგის მოქმედი ერთიც არ არის. "},
	{5, "5 ნუთუ ვერ შეიგნეს სიმრუდის მქნელებმა, ჩემს ერს რომ ჭამენ, თითქოს პურს ჭამდნენ, ღმერთს კი არ უხმობენ. "},
	{6, "6 იქ შეშინდნენ შიშით, სადაც არ იყო შიში, რადგან ღმერთი განაბნევს შენზე ამხედრებულთა ძვლებს: შენ შეარცხვენ მათ, რადგან ღმერთმა უკუაგდო ისინი. "},
	{7, "7 ნეტა მოვიდეს სიონიდან ხსნა ისრაელისა! ოდეს შემოაქცევს ღმერთი თავისი ხალხის ტყვეობას, ილხენს იაკობი, გაიხარებს ისრაელი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view53() {
struct ka53 poems[] = {
	{1, "1 გუნდის ლოტბარს, სიმებიან საკრავზე, მოძღვრება დავითისა.  "},
	{2, "2 როცა მოვიდნენ ზიფელნი და უთხრეს საულს: აჰა, დავითი ჩვენთან იმალება.  "},
	{3, "3 ღმერთო! შენი სახელით მიშველე და შენი ძალით გამასამართლე. "},
	{4, "4 ღმერთო! ისმინე ჩემი ლოცვა, მოაყურადე სიტყვებს ჩემი პირისა. "},
	{5, "5 რადგან უცხონი აღიძრენ ჩემზე და მოძალადეებმა იძიეს სული ჩემი, არ წარმოიდგინეს ღმერთი თავიანთ წინაშე. სელა. "},
	{6, "6 აგერ, ღმერთია ჩემი შემწე, ღმერთია ჩემი სულის გამმაგრებელი: "},
	{7, "7 მან მიაგოს ბოროტება ჩემს მტრებს; შენი ჭეშმარიტებით მოსპე ისინი. "},
	{8, "8 ნებით შემოგწირავ მსხვერპლს, ვადიდებ შენს სახელს, უფალო, რადგან კარგია. "},
	{9, "9 რადგან ყოველგვარ გაჭირვებას გადამარჩინა და მტერთა ჩემთა დაცემა იხილა თვალმა ჩემმა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view54() {
struct ka54 poems[] = {
	{1, "1 გუნდის ლოტბარს, სიმებიან საკრავზე, მოძღვრება დავითისა.  "},
	{2, "2 ისმინე, ღმერთო, ჩემი ლოცვა და ნუ განუდგები ჩემს ვედრებას. "},
	{3, "3 ყური მომაპყარ და მიპასუხე; ავტირდები ჩემს საუბარში და ავღაღადდები, "},
	{4, "4 მტრის ხმისაგან, ბოროტის მიერ შევიწროებისაგან; რადგან თავს მახვევენ სიმრუდეს და სიძულვილით მირისხდებიან. "},
	{5, "5 ჩემი გული თრთის ჩემს შიგნით და სიკვდილის საშინელება დამატყდა თავს. "},
	{6, "6 შიში და ძრწოლა მოდის ჩემზე და შიშის ზარი მიპყრობს. "},
	{7, "7 და ვამბობ: „ვინ მომცემს ფრთას, ვითარცა მტრედს?“ გავფრინდებოდი და დავბინავდებოდი. "},
	{8, "8 აჰა, შორს, შორს გადავიხვეწებოდი, უდაბნოში დავიდებდი ბინას. სელა. "},
	{9, "9 ავჩქარდებოდი, რომ მომენახა თავშესაფარი ძლიერი ქარისაგან, ქარიშხლისაგან. "},
	{10, "10 მოსპე, უფალო, დაჰყავი მათი ენები; რადგანაც ვხედავ ძალადობას და შუღლს ქალაქში. "},
	{11, "11 დღედაღამ გარეუვლიან მის კედლებს, სიმრუდე და წვალებაა მის შიგნით. "},
	{12, "12 ბოროტებაა მის შიგნით და არ სცილდება მის ქუჩებს სიცრუე და ვერაგობა. "},
	{13, "13 რადგან მტერი კი არ მლანძღავს, თორემ ავიტანდი; ჩემი მოძულე კი არ განდიდებულა ჩემზე, მას დავემალებოდი; "},
	{14, "14 შენ კი კაცი ხარ ჩემებრი, მეგობარი და მახლობელი ჩემი. "},
	{15, "15 ერთად რომ ვსაუბრობდით ტკბილად, ღვთის სახლში დავდიოდით მღელვარებით. "},
	{16, "16 დაატყდეს მათ სიკვდილი, ცოცხლად ჩავიდნენ ჯოჯოხეთში, რადგან ბოროტებაა მათ სადგომში, მათ შიგნით. "},
	{17, "17 ხოლო მე მოვუხმობ ღმერთს, და უფალი მიშველის. "},
	{18, "18 საღამოთი, დილით და შუადღბსას შევევედრები და შევტირებ, და მოისმენს ჩემს ხმას. "},
	{19, "19 მშვიდობიანად დაიხსნა ჩემი სული ჩემს წინააღმდეგ ომისაგან, რადგან ბევრნი იყვნენ ჩემზე აღმდგარნი. "},
	{20, "20 მოისმენს ღმერთი და უპასუხებს მათ დასაბამიდან მყოფი, სელა; რადგან არ არის ცვლილება მათში და არ ეშინიათ ღმერთისა. "},
	{21, "21 ხელი გაიწოდეს მათთვის მშვიდობის მსურველთა წინააღმდეგ, დაარღვიეს აღთქმა. "},
	{22, "22 ცხიმზე ჩვილია მათი ბაგეები, გულში კი ომი აქვთ; ზეთზე რბილია მათი სიტყვები, მაგრამ ისინი გაშიშვლებული ხმლებია. "},
	{23, "23 მიანდე უფალა შენი საზრუნავი და ის შეგეხიდება, იგი არასოდეს არ დაუშვებს წმიდანის წაბორძიკებას. "},
	{24, "24 ღმერთო, შენ ჩაგყავს ისინი ჯოჯოხეთში, სისხლის მოყვარულნი და ვერაგნი ნუ მიაღწევენ თავიანთ დღეთა ნახევარს; ხოლო მე შენ გესავ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view55() {
struct ka55 poems[] = {
	{1, "1 გუნდის ლოტბარს, მტრედზე, რომელიც მდუმარებს შორეთში. დავითის საგალობელი, როცა ფილისტიმელებმა შეიპყრეს იგი გათში.  "},
	{2, "2 შემიწყალე, ღმერთო, რადგან გათელვას მიპირებს კაცი, ყოველდღე მავიწროებს მოშუღარი. "},
	{3, "3 ჩანთქმას მითქვამენ ჩემი მტრები ყოველდღიურად, რადგან მრავალი მეომება, უზენაესო. "},
	{4, "4 საშიშროების დღეს შენ გესავ. "},
	{5, "5 ღმერთში ვადიდებ მისსავე სიტყვას, ღმერთზე ვარ მინდობილი - არ მეშინია, რას მიზამს ხორციელი? "},
	{6, "6 ყოველდღე ამახინჯებს ჩემს სიტყვებს; ბოროტია ყოველი მათი ზრახვა ჩემს მიმართ. "},
	{7, "7 გროვდებიან, მისაფრდებიან ისინი - ჩემი მდევრები, ჩემს ნაკვალევს უთვალთვალებენ, თითქოსდა ჩემს სულს ელოდებიან. "},
	{8, "8 ნუთუ ამ სიმრუდეს უნდა გადაურჩნენ? რისხვით დაამხე ერები, ღმერთო! "},
	{9, "9 ჩემი ხეტიალი გამოთვლილი გაქვს; შენს ჭურჭელში მოათავსე ჩემი ცრემლები - აგერ, შენს წიგნშია. "},
	{10, "10 მაშინ უკუიქცევიან ჩემი მტრები, რა დღესაც მოგიხმობ; ეს ვიცი, რომ ღმერთი ჩემთან არის. "},
	{11, "11 ღმერთში შევაქებ სიტყვას, უფალში შევაქებ სიტყვას; "},
	{12, "13 ღმერთს მივენდე - არ მეშინია; რას მიზამს კაცი? "},
	{13, "13 ჩემზეა, ღმერთო, შენი აღთქმები; სამადლობელს მოგიზღავ შენ. "},
	{14, "14 რადგან იხსენი ჩემი სული სიკვდილისაგან, აგერ, ჩემი ფეხი წაბორძიკებისაგან, რათა ვიარო ღმერთის წინაშე სიცოცხლის შუბით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view56() {
struct ka56 poems[] = {
	{1, "1 გუნდის ლოტბარს. ნუ მოსპობ. დავითის საგალობელი, როცა საულს გაექცა მღვიმეში.  "},
	{2, "2 შემიწყალე, ღმერთო, შემიწყალე, რადგან შენ მოგენდო ჩემი სული და შენი ფრთების ჩრდილქვეშ შევაფარებ თავს, ვიდრე გაჭირვება გადაივლიდეს. "},
	{3, "3 მოვუხმობ უზენაეს ღმერთს, ღმერთს, რომელიც ქველმოქმედია ჩემს მიმართ. "},
	{4, "4 გამომიგზავნის ციდან და მიშველის, შეარცხვენს ჩემი გათელვის მსურველს. სელა. გამომიგზავნის ღმერთი თავის წყალობას და ჭეშმარიტებას. "},
	{5, "5 ჩემი სული ლომების შუაგულშია; ვწევარ ცეცხლის ალში, ადამის ძეთა შორის, რომელთა კბილები მშვილდ-ისრებია და ენა - ბასრი მახვილი. "},
	{6, "6 ამაღლდი ცათა ზემოთ, ღმერთო; მთელ დედამიწაზეა შენი დიდება. "},
	{7, "7 ბადე გაამზადეს ჩემთა ფეხთათვის; ჩემი სული მოიდრიკა; ჩემს წინ ორმო გათხარეს, თვითონ ჩაცვივდნენ შიგ. სელა. "},
	{8, "8 წრფელია ჩემი გული, ღმერთო, წრფელია ჩემი გული. გიმღერებ და გიგალობებ. "},
	{9, "9 გამოიღვიძე, დიდებავ ჩემო, გამოაღვიძე ჩანგი და ქნარი; გამოვაღვიძებ ცისკარს. "},
	{10, "10 განგადიდებ ხალხებში, უფალო, გიგალობებ ერებში. "},
	{11, "11 რადგან დიდია ზეცამდე შენი წყალობა და ღრუბლებამდე - შენი ჭეშმარიტება. "},
	{12, "12 ამაღლდი ცათა ზემოთ, ღმერთო; მთელს დედამიწაზეა შენი დიდება. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view57() {
struct ka57 poems[] = {
	{1, "1 გუნდის ლოტბარს, ნუ მოსპობ, დავითის საგალობელი.  "},
	{2, "2 ნუთუ მართლა სიმართლეს ლაპარაკობთ, მოსამართლენო? სისწორით სჯით, ადამის ძენო? "},
	{3, "3 არამედ გულში უკუღმართობას თხზავთ, დედამიწაზე თქვენთა ხელთა ძალმომრეობას დებთ სასწორზე. "},
	{4, "4 გადაუხვიეს ბოროტებმა დაბადებიდანვე; გზას აცდნენ დედის მუცლიდანვე სიცრუის მქნელნი. "},
	{5, "5 მათი შხამი მსგავსია გველის შხამისა, ყრუ ასპიტისა, ყურს რომ დაიჩულავს. "},
	{6, "6 რომ არ ისმინოს ხმა შემლოცველთა, დაბრძენებულ მისანთ-მისნისა. "},
	{7, "7 ღმერთო! შენ შეუმუსრე მათ კბილები თავიანთ პირში; ლომთა ეშვები მოთხარე, უფალო! "},
	{8, "8 გაქრნენ, ვითარცა წყალი დაღვრილი; როცა ისრებს მოზიდავენ, იყოს გადამსხვრეულივით. "},
	{9, "9 ლოკოკინასავით დაუძლურდეს, ქალის საშოდან მოწყვეტილივით ვერ იხილოს მზე. "},
	{10, "10 ვიდრე იგრძნობდნენ თქვენი ქვაბები ძეძვს, იგი უმსაც და გამომცხვარსაც ქარში წარხვეტავს. "},
	{11, "11 გაიხარებს წმიდანი, როცა იხილავს შურისგებას; ფეხებს დაიბანს ბოროტის სისხლში. "},
	{12, "12 და იტყვის კაცი: აი, ნაყოფი წმიდანისა! მართლაც არსებობს ღმერთი, რომელიც ასამართლებს ქვეყნიერებას. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view58() {
struct ka58 poems[] = {
	{1, "1 გუნდის ლოტბარს, ნუ მოსპობ. დავითის საგალობელი, როდესაც საულმა გაგზავნა მისი სახლის საყარაულოდ, რომ მოეკლათ იგი.  "},
	{2, "2 მიხსენი ჩემი მტრებისაგან, ღმერთო; დამიცავი ჩემს წინააღმდეგ აღმდგართაგან. "},
	{3, "3 მიხსენი სიმრუდის ჩამდენთაგან და სისხლის მსმელთაგან გადამარჩინე. "},
	{4, "4 რადგანაც აგერ უთვალთვალებენ ჩემს სულს; შეგროვდნენ ძლიერნი ჩემს წინააღმდეგ; არც დანაშაული მიმიძღვის, არც შეცოდება, უფალო. "},
	{5, "5 უდანაშაულოდ გამორბიან და ემზადებიან, გამოიღვიძე ჩემს შესახვედრად და მომხედე. "},
	{6, "6 ხოლო შენ, უფალო, ღმერთო ძალთა, ღმერთო ისრაელისა, გამოიღვიძე, რომ მოჰკითხო ყველა ხალხს; არ დაინდო არც ერთი უკანონობის ჩამდენი. სელა. "},
	{7, "7 დაე, მობრუნდნენ საღამოობით, იყმუვლონ ძაღლივით და გარეუარონ ქალაქს. "},
	{8, "8 აგერ, წარმოანთხევენ თავიანთი პირით, მახვილი აქვთ ბაგეებში, აქაოდა, ვინ ისმენსო. "},
	{9, "9 ხოლო შენ, უფალო, დასცინებ მათ, აბუჩად აიგდებ ყველა ხალხს. "},
	{10, "10 მის ძლიერებას შენში დავიცავ, რადგან ღმერთია ჩემი საყრდენი. "},
	{11, "11 ღმერთი - ჩემი მწყალობელი წინ წამიძღვეს; ღმერთმა შემახედოს ჩემს მტრებზე. "},
	{12, "12 ნუ დახოცავ მათ, რომ არ დაივიწყოს ჩემმა ერმა, ახეტიალე შენი ძალით და დაამდაბლე, ფარო ჩვენო, უფალო. "},
	{13, "13 მათი პირის ცოდვა მათთა ბაგეთა ნალაპარაკევია; და გაებან მახეში თავიანთი ქედმაღლობისათვის, ტყუილი ფიცისა და პირფერობისათვის. "},
	{14, "14 მოსპე რისხვით, მოსპე, რომ აღარ იყვნენ; და შეიტყონ, რომ ღმერთი ბატონობს იაკობზე ქვეყნიერების კიდით-კიდემდე. სელა. "},
	{15, "15 დაე, დაბრუნდნენ საღამოობით, იყმუვლონ ძაღლივით და გარს შემოუარონ ქალაქს. "},
	{16, "16 დაე, იწოწიალონ საჭმლისათვის და მშივრებმა გაათიონ ღამე. "},
	{17, "17 ხოლო მე ვუმღერებ შენს სიძლიერეს და დილდილაობით ვიღაღადებ შენს წყალობაზე, რადგან შენ იყავი ჩემი ბურჯი და თავშესაფარი ჩემი გაჭირვების დღეს. "},
	{18, "18 სიძლიერევ ჩემო, შენ გიგალობებ, რადგან ღმერთია ჩემი ბურჯი, ღმერთი ჩემი მწყალობელი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view59() {
struct ka59 poems[] = {
	{1, "1 გუნდის ლოტბარს, შუშან-ყედუთის საკრავზე, დავითის საგალობელი, შესწავლისათვის.  "},
	{2, "2 როდესაც ეომებოდა შუამდინარეთის არამს და ცობის არამს; და დაბრუნდა იოაბი და გაანადგურა თორმეტი ათასი ედომელი მარილოვან ველზე.  "},
	{3, "3 ღმერთო, მიგვატოვე, გაგვაპარტახე, გაგვირისხდი, კვლავ აღგვადგინე. "},
	{4, "4 შეაზანზარე მიწა, გაკვეთე; განკურნე მისი ნამსხვრევები, რადგან მოირყა. "},
	{5, "5 აჩვენე შენს ერს სიძნელე, გვასვი ჩვენ ღვინო საწამლავგარეული. "},
	{6, "6 მიეცი შენს მოშიშებს დროშა ასაფრიალებლად ჭეშმარიტებისათვის. სელა. "},
	{7, "7 რათა გადარჩნენ, ვინც შენ გიყვარს, იხსენი შენი მარჯვენით და გვიპასუხე. "},
	{8, "8 ღმერთმა თქვა თავის წმიდაში: „ვიზეიმებ, დავყოფ შექემს და სუქოთის დაბლობს მივუზომავ“. "},
	{9, "9 ჩემია გალაადი და ჩემია მენაშე, ეფრემი სიმაგრეა ჩემი თავის, იუდა - კანონმდებელია ჩემი. "},
	{10, "10 მოაბი ქვაბია ჩემი განსაბანი, ედომზე ჩემს ფეხსაცმელს გავიშვერ; ჩემს წინაშე, ფილისტიმო, განადგურდები. "},
	{11, "11 ვინ შემიძღვება გამაგრებულ ქალაქში? ვინ შემიყვანს ედომში? "},
	{12, "12 თუ არა შენ, ღმერთო, რომელმაც მიგვატოვე და არ გამოდიხარ, ღმერთო, ჩვენს მხედრობასთან. "},
	{13, "13 მოგვმადლე შველა გაჭირვებაში, რადგან ამაოა ხსნა ადამიანისაგან. "},
	{14, "14 ღმერთის შეწევნით შევქმნით ლაშქარს, და ის დაამხობს ჩვენს მტრებს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view60() {
struct ka60 poems[] = {
	{1, "1 გუნდის ლოტბარს, სიმებიან საკრავზე. დავითისა.  "},
	{2, "2 ისმინე, უფალო, ვედრება ჩემი, ყური მოაპყარ ჩემს ლოცვას. "},
	{3, "3 ქვეყნის კიდიდან მოგღაღადებ გულგათანგული: სიმაღლით ჩემთვის მიუწვდომელ კლდეზე წარმიძეხ. "},
	{4, "4 რადგან შენა ხარ ჩემი მფარველი, ძლიერი კოშკი ხარ მტრისგან დამცველი. "},
	{5, "5 ვაცხოვრებ შენს კარვებში მარადის, თავს შევაფარებ შენი ფრთების საბურველში. სელა. "},
	{6, "6 რადგან შენ, ღმერთო, მოისმინე აღთქმანი ჩვენი, მიეცი სამკვიდრო, ვისაც შენი სახელისა ეშინია. "},
	{7, "7 დღეები მოუმატე მეფის დღეებს, მისი წლები - თაობიდან თაობამდე. "},
	{8, "8 იმყოფებოდეს მარად ღვთის წინაშე, წყალობა და ჭეშმარიტება იფარავდეს მას. "},
	{9, "9 ამგვარად ვუგალობებ შენს სახელს უკუნისამდე, რომ შევასრულო ჩემი აღთქმანი დღითი-დღე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view61() {
struct ka61 poems[] = {
	{1, "1 გუნდის ლოტბარს, იედუთუნისათვის. ფსალმუნი დავითისა.  "},
	{2, "2 მხოლოდ ღმერთისადმია მდუმარება ჩემი სულისა; მისგან არის ჩემი ხსნა. "},
	{3, "3 მხოლოდ ის არის ჩემი ბურჯი და ჩემი ხსნა, ჩემი სიმაგრე - აღარ დავეცემი მეტად. "},
	{4, "4 ვიდრემდე დაესხმით თავს ადამიანს? გადაიქცევით ყველანი, ვითარცა კედელი გადახრილი, ყორე მორყეული. "},
	{5, "5 განიზრახავენ მისი სიმაღლიდან გადმოგდებას, მიმართავენ სიცრუეს; პირით აკურთხებენ, გულით კი სწყევლიან. სელა. "},
	{6, "6 მხოლოდ ღმერთს დაელოდე, სულო ჩემო, რადგან მისგან არის ჩემი იმედი. "},
	{7, "7 მხოლოდ ის არის ჩემი ბურჯი და ჩემი ხსნა, ჩემი სიმაგრე - არ დავეცემი. "},
	{8, "8 ღმერთისგან არის ჩემი ხსნა და ჩემი ღირსება; სიმაგრე ჩემი ძალისა და ჩვმი თავშესაფარი ღმერთის მიერაა. "},
	{9, "9 მიენდეთ მას ყოველჟამს, ხალხნო, თქვენი გული გადმოღვარეთ მის წინაშე; ღმერთია ჩვენი თავშესაფარი. სელა. "},
	{10, "10 მხოლოდ არარაობანი არიან ადამის ძენი, ცრუობენ კაცთა შვილები; სასწორზე რომ დადო, ყველანი ერთად არარაობაზე უარესია. "},
	{11, "11 არ დაამყაროთ იმედი მძარცველობაზე და მტაცებლობას ნუ გამოედევნებით; დოვლათი ოდეს გაიზარდოს, ნუ მიაქცევთ ყურადღებას. "},
	{12, "12 ერთხელ თქვა ღმერთმა - ორჯერ მოვისმინე, რადგან ღმერთისაა ძალა. "},
	{13, "13 და შენი არს, უფალო, წყალობა, რადგან შენ მიუზღავ თითოეულს მისი ნამოქმედარის მიხედვით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view62() {
struct ka62 poems[] = {
	{1, "1 ფსალმუნი დავითისა. იუდას უდაბნოში ყოფნის დროს.  "},
	{2, "2 ღმერთო! შენ ხარ ჩემი ღმერთი, ცისკრის ჟამიდან გეძებ, სწყურიხარ ჩემს სულს. შენზე ნაღვლობს ჩემი სული უკაცრიელ და გამოფიტულ, უწყლო მიწაზე. "},
	{3, "3 ასე გიხილე წმიდაში, რათა მენახა სიძლიერე და პატიოსნება შენი. "},
	{4, "4 რადგან სიცოცხლეზე მეტია შენი წყალობა, ჩემი ბაგენი გაქებენ შენ. "},
	{5, "5 ამიტომ გადიდებ ჩემი სიცოცხლის მანძილზე, შენი სახელით აღვაპყრობ ხელებს. "},
	{6, "6 ვითარცა ცხიმით და სიმსუქნით დამსუყდეს სული ჩემი. "},
	{7, "7 როცა გიხსენებ ჩემს სარეცელზე, მთელ ღამეებს ვიფიქრებ შენზე. "},
	{8, "8 რადგან იყავი დამხმარე ჩემი, შენს ჩრდილქვეშ მოვილხენ. "},
	{9, "9 შენ მოგტმასნია სული ჩემი; ჩემი საყრდენია მარჯვენა შენი. "},
	{10, "10 ხოლო ისინი, ვინც ჩემი სულის დაღუპვას ეძებენ, ქვესკნელში შთავლენ. "},
	{11, "11 მახვილის წერა გახდებიან, მელების კერძი შეიქმნებიან. "},
	{12, "12 მეფე კი გაიხარებს, ღმერთის მიერ იქება ყველა, ვინც მას ფიცავს, რადგან დაიგმანება ტყუილის მოლაპარაკეთა პირი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view63() {
struct ka63 poems[] = {
	{1, "1 გუნდის ლოტბარს, ფსალმუნი დავითისა.  "},
	{2, "2 ისმინე, ღმერთო, ჩემი ხმა, როცა ვლოცულობ. მტრის შიშისაგან დაიცავი ჩემი სიცოცხლე. "},
	{3, "3 დამიფარე ვერაგთა ჩუმი ზრახვისაგან, სიმრუდის მოქმედთა ამბოხისაგან. "},
	{4, "4 რომელთაც ენა მახვილივით გაილესეს, მოზიდეს თავიანთი მშვილდი - მწარე სიტყვა, "},
	{5, "5 რათა საფრიდან ესროლონ უდანაშაულოს; მოულოდნელად ესვრიან და არ ეშინიათ. "},
	{6, "6 ძალას მოიკრებენ ცუდი საქმისათვის, მოითათბირებენ მახეების დაგებას, ამბობენ: ვინ შეამჩნევს მათ? "},
	{7, "7 ეძიებენ სიმრუდეს, ძიებას ძიებით ასრულებენ, ხოლო შიგნეული კაცისა და გული ღრმაა. "},
	{8, "8 და ესვრის ღმერთი ისარს, უეცრად დაწყლულდებიან. "},
	{9, "9 საკუთარი ენა დაამარცხებს მათ; გაიფანტება ყოველი მათი მხილველი. "},
	{10, "10 და შეშინდება ყველა კაცი და ილაპარაკებენ ღმერთის ნამოქმედარზე და მის ნაქნარს ჩაუკვირდებიან. "},
	{11, "11 გაიხარებს წმიდანი უფლის მიერ და მიენდობა მას, და დაიქადებენ გულმართლები."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view64() {
struct ka64 poems[] = {
	{1, "1 გუნდის ლოტბარს, ფსალმუნი დავითისა. გალობა.  "},
	{2, "2 შენ შეგშვენის ხოტბა, ღმერთო, სიონზე, და შენ აგისრულებენ აღთქმას. "},
	{3, "3 მომსმენო ლოცვისა, შენთან მოვა ყველა ხორციელი. "},
	{4, "4 ჩადენილმა ცოდვებმა დამჯაბნეს მე; ჩვენს დანაშაულს შენ შეგვინდობ. "},
	{5, "5 ნეტარ არს, ვისაც ამოირჩევ და დაიახლოებ, რომ იცხოვროს შენს ეზოში; გავძღებით შენი სახელის სიკეთით, წმიდაა შენი ტაძარი. "},
	{6, "6 საშიშარო, სიმართლით გვიპასუხე, ღმერთო, ჩვენო მხსნელო, სასოებავ დედამიწის ყველა კუთხისა და შორეული ზღვის მცხოვრებთა. "},
	{7, "7 განამზადა მთები თავისი ძალით, გარემოსილია ძლიერებით. "},
	{8, "8 აწყნარებ ზღვათა ხმაურს, მათი ტალღების ხმაურს და ერების მღელვარებას. "},
	{9, "9 და შეაშინებს კიდეთა მცხოვრებთ შენი სასწაულები, აღმოსავლეთსა და დასავლეთს გაამხიარულებ. "},
	{10, "10 კეთილად გაიხსენე ქვეყანა და მორწყე, დიდად გაამდიდრე იგი; ნაკადი ღმერთისა სავსეა წყლით; მოამზადე მათი პური, რადგან ასე წარმართე იგი. "},
	{11, "11 მის კვლებს არწყულებ, ასწორებ მის ბელტებს, ჟუჟუნა წვიმით ალბობ, მის აღმონაცენს აკურთხებ. "},
	{12, "12 გვირგვინი დაადგი შენი სიკეთის ზაფხულს და შენი ნაკვალევიდან წვეთავს სიმსუქნე. "},
	{13, "13 წვეთავენ უდაბნოს საძოვრებზე და ქედები ლხინით შეიმოსებიან. "},
	{14, "14 საძოვრები ცხვრით აივსებიან და დაბლობები მარცვლეულით დაიფარებიან; იღაღადებენ და იმღერებენ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view65() {
struct ka65 poems[] = {
	{1, "1 გუნდის ლოტბარს. გალობა - ფსალმუნი. შეჰღაღადეთ ღმერთს, მთელო ქვეყნიერებავ. "},
	{2, "2 უგალობეთ მისი სახელის ღირსებას, პატივი ეცით მის დიდებულებას. "},
	{3, "3 უთხარით ღმერთს: რა საშიშია შენი საქმენი, შენი ძალის სიმრავლით ქვეშ გაგეგებიან შენი მტრები. "},
	{4, "4 მთელი ქვეყნიერება თაყვანსა გცემს და გაქებს შენ, უგალობებს შენს სახელს. სელა. "},
	{5, "5 მოდით, ნახეთ ღმერთის ნამოქმედარი, საშიშია მისი მოქმედება ადამიანის შვილებზე. "},
	{6, "6 გადააქცია ზღვა ხმელეთად, მდინარე ფეხით გადალახეს; იქ გავიხარეთ მის გამო. "},
	{7, "7 გაბატონებულია თავისი სიძლიერით მსოფლიოზე, მისი თვალები ჭვრეტენ ერებს. ვინც ეურჩება, არ ამაღლდება. სელა. "},
	{8, "8 ადიდეთ, ხალხნო, ღმერთი ჩვენი და აღასმინეთ ხმა მისი ქებისა. "},
	{9, "9 შეუნარჩუნა ჩვენს სულს სიცოცხლე და არ გასწირა დასაცემად ჩვენი ფეხი. "},
	{10, "10 რადგან გამოგვცადე ჩვენ, ღმერთო, გადაგვადნე, როგორც ვერცხლი გადაადნეს. "},
	{11, "11 მოგვაქციე ბადეში, დაგვადგი ჩაგვრის უღელი წელზე. "},
	{12, "12 შეგვასვი კაცი თავზე; შევედით ცეცხლსა და წყალში და გამოგვიყვანე სახალვათოდ. "},
	{13, "13 მოვალ შენს სახლში შესაწირავებით, აღგისრულებ ჩემს აღთქმებს, "},
	{14, "14 რომ წარმოთქეეს ჩემმა ბაგეებმა და დაილაპარაკა ჩემმა პირმა ჩემი გაჭირვების ჟამს. "},
	{15, "15 მსუქან შესაწირავებს ამოგიტან ერკემლის საკმევლითურთ, შემოგწირავ მოზვრებს და ვაცებს.  სელა."},
	{16, "16 მოდით, მოისმინეთ ყველამ, ვისაც ღმერთის შიში გაქვთ, და გიამბობთ, რა გააკეთა ჩემი სულისთვის. "},
	{17, "17 მას მოვუხმობდი ჩემი ბაგეებით და აღვამაღლე იგი ჩემი ენით. "},
	{18, "18 სიმრუდე რომ შემემჩნია ჩემს გულში, არ მოისმენდა უფალი. "},
	{19, "19 ამიტომ მომისმინა ღმერთმა, ყური მოაპყრო ჩემი ლოცვის ხმას. "},
	{20, "20 კურთხეულ არს უფალი, რომ არ უარყო ჩემი ლოცვა და არ მომაკლო თავისი წყალობა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view66() {
struct ka66 poems[] = {
	{1, "1 გუნდის ლოტბარს, სიმებიან საკრავზე, ფსალმუნი - გალობა.  "},
	{2, "2 ღმერთი შეგვიწყალებს და გვაკურთხებს ჩვენ, გამოგვიშუქებს თავის სახეს. სელა. "},
	{3, "3 რათა შეიტყონ ქვეყნიერებაზე, რომ შენი გზა ყველა ხალხისათვის შველაა. "},
	{4, "4 გიწამებენ ხალხები, ღმერთო, გიწამებენ ხალხები ერთიანად. "},
	{5, "5 გაიხარებენ და ილხენენ ერები, რადგან გაასამართლებ ხალხებს სისწორით და ერებს ქვეყანაზე წაუძღვები. სელა. "},
	{6, "6 გიწამებენ ხალხები, ღმერთო, გიწამებენ ხალხები მათიანად. "},
	{7, "7 მიწამ მოგვცა ნაყოფი თვისი; გვაკურთხოს ღმერთმა, ჩვენმა ღმერთმა. "},
	{8, "8 გვაკურთხოს ღმერთმა და ეშინოდეთ მისი დედამიწის კიდით-კიდემდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view67() {
struct ka67 poems[] = {
	{1, "1 გუნდის ლოტბარს, დავითის ფსალმუნი, საგალობელი.  "},
	{2, "2 აღდგეს ღმერთი, განიბნენ მისი მტრები და მისი მოძულენი უკუიქცნენ მისგან. "},
	{3, "3 როგორც კვამლი გაიფანტება, ისე გაფანტე; როგორც ცვილი დადნება ცეცხლზე, ისე დაიღუპებიან ბოროტნი ღმერთის პირისაგან. "},
	{4, "4 ხოლო წმიდანები გაიხარებენ და მოილხენენ ღმერთის წინაშე და სიხარულით იზეიმებენ. "},
	{5, "5 აქეთ ღმერთი, იგალობეთ მისი სახელი, განადიდეთ ის, ვინც ცას სერავს; უფალია მისი სახელი და ილხინეთ მის წინაშე. "},
	{6, "6 მამა ობოლთა და მსაჯული ქვრივთა - ღმერთი მის წმიდა სადგომშია, "},
	{7, "7 ღმერთს შეჰყავს მარტოხელები სახლში, გამოჰყავს ტყვეები შესაფერის დროს, ხოლო ურჩნი ხრიოკზე რჩებიან. "},
	{8, "8 ღმერთო! როცა შენი ხალხის წინაშე გამოხვედი, როცა ფეხი დადგი უდაბნოში, სელა, "},
	{9, "9 დედამიწა შეირყა, ცანიც კი წვეთავდნენ ღმერთის პირისაგან; ეს სინაიც - ღმერთის პირისაგან, ისრაელის ღმერთისა. "},
	{10, "10 ბარაქიანი წვიმა აწვიმე, ღმერთო, შენს სამკვიდროს, და თუ დაუძლურდება, შენ გაამაგრებ. "},
	{11, "11 შენი ხალხი დასახლდა იქ, შენი სიკეთით განუმზადე ღარიბს, ღმერთო. "},
	{12, "12 უფალი იძლევა სიტყვას მახარობელთა დიდი გუნდისა. "},
	{13, "13 ჯარების მეფენი გარბიან, გარბიან, ხოლო სახლში მყოფი ნადავლს გაიყოფს. "},
	{14, "14 თუნდაც ცხვრის ბაკებში იწვეთ, მტრედის ფრთებს ჰგავხართ ვერცხლით დაფარულს და მის ნაკრტენს მოოქროვილს. "},
	{15, "15 როცა ყოვლისშემძლე გაფანტავს მეფეებს იქ, ცალმონის თოვლივით გაათეთრებს მას. "},
	{16, "16 მთა ღმერთისა - მთა ბაშანისა, მთაგრეხილი - მთა ბაშანისა. "},
	{17, "17 რატომ შეჰყურებთ შურით, მთაგრეხილებო, მთას, რომელიც ისურვა ღმერთმა თავის სამოსახლოდ და უფალი დაიმკვიდრებს სამუდამოდ? "},
	{18, "18 ღმერთის ეტლები უთვალავია, ათასეულები. მათ შორის არის უფალი სინაიზე, წმიდაში. "},
	{19, "19 შენ ახვედი მაღლა, დააბრუნე ტყვე, წამოიღე ძღვენი ადამიანისათვის, და ურჩებთანაც დაისადგურა უფალმა ღმერთმა. "},
	{20, "20 კურთხეულ არს უფალი, დღითი დღე ზრუნავს ჩვენზე; ღმერთია ჩვენი მშველერი. სელა. "},
	{21, "21 ღმერთი არის ჩვენთვის ღმერთი მშველელი და უფალი ღმერთის ხელში არის სიკვდილის გასაღები. "},
	{22, "22 მაგრამ ღმერთი თავს გაუჭეჭყავს თავის მტრებს, ბანჯგვლიან კეფას - დანაშაულის გზით მოსიარულეს. "},
	{23, "23 თქვა უფალმა: ბაშანიდან დავაბრუნებ; დავაბრუნებ ზღვის სიღრმეებიდან, "},
	{24, "24 რათა ჩადგა შენი ფეხი მტრების სისხლში, როგორც შენი ძაღლები ჰყოფდნენ შიგ თავიანთ ენას; "},
	{25, "25 ნახეს შენი სვლა, ღმერთო, სვლა ჩემი ღმერთისა, "},
	{26, "26 წინ წარდგნენ მგალობლები, უკან - მემუსიკენი, "},
	{27, "27 კრებულთა შორის ადიდეთ ღმერთი უფალი წყაროდან ისრაელისა. "},
	{28, "28 იქ ბენიამინი - უმრწემესი, წინ წახტა; იუდას თავადებმა ქვები დაუშინეს, ზებულონის თავადებმა, ნაფთალის თავადებმა. "},
	{29, "29 შენმა ღმერთმა მოგაკუთვნა შენ ძალა, ღმერთო, განამტკიცე ის, რაც მოიმოქმედე ჩვენთვის. "},
	{30, "30 შენი ტაძრის გამო, რომელიც იერუსალიმშია, საჩუქრებს მოგიტანენ მეფეები. "},
	{31, "31 შერისხე მხეცი ლერწმიანისა, ხარების ჯოგი ხალხის ხბოებს შორის, რომლებიც ტრაბახობენ ოქროს ზოდებით. "},
	{32, "32 მოვლენ დიდებულნი ეგვიპტიდან, ქუში გაუწოდებს ხელს. "},
	{33, "33 ქვეყნიერების სამეფონო! უმღერეთ ჩვენს ღმერთს, უგალობეთ უფალს. სელა. "},
	{34, "34 ამაღლებული ძველთუძველეს ცათა ცაში - აგერ ის გამოსცემს თავისი ხმით ძლიერების ხმას. "},
	{35, "35 მიეცით სიძლიერე ღმერთს; მისი სიდიადე ისრაელზეა და მისი სიძლიერე - ღრუბლებში. "},
	{36, "36 საშიში ხარ, ღმერთო, შენს ტაძარში; ღმერთი ისრაელისა - ის აძლევს ძალასა და სიმაგრეს ხალხს; კურთხეულ არს ღმერთი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view68() {
struct ka68 poems[] = {
	{1, "1 გუნდის ლოტბარს. შოშანის საკრავზე, დავითის ფსალმუნი.  "},
	{2, "2 მიხსენი, ღმერთო, რადგან სულამდე მოვიდა წყალი. "},
	{3, "3 ჩავიძირე გაუვალ ლაფში და არ არსებობს დასადგომი; შევედი წყლის სიღრმეში და სწრაფმა დინებამ წამიღო. "},
	{4, "4 მოვიქანცე ღაღადით, ყელი გამიშრა, თვალები ამომიღამდა ჩემი ღმერთის მოლოდინში. "},
	{5, "5 ჩემი თავის ბალანზე მეტია ჩემი უმიზეზოდ მოძულენი; გაძლიერდნენ ჩემი მოსპობის მსურველნი, ჩემზე ტყუილ-უბრალოდ გადამტერებულნი; რაც არ წამირთმევია, ის უნდა დავუბრუნო. "},
	{6, "6 ღმერთო, შენ უწყი ჩემი უვიცობა და ჩემი დანაშაული დაფარული არ არის შენგან. "},
	{7, "7 ნუ შერცხვებიან ჩემს გამო შენი მოიმედენი, უფალო, ღმერთო ძალთა; ნუ გაწბილდებიან ჩემს გამო, ვინც შენ გეძებს, ღმერთო ისრაელისა. "},
	{8, "8 რადგანაც შენი გულისათვის მივიღე ლანძღვა, სირცხვილმა დაფარა ჩემი სახე. "},
	{9, "9 შორეული გავხდი ჩემი ძმებისათვის და უცხო - დედაჩემის შვილთათვის. "},
	{10, "10 რადგან შენი სახელის შურმა დამღრღნა მე და შენთა მლანძღველთა ლანძღვა დამატყდა თავს. "},
	{11, "11 და ვტირი ჩემი სულის მარხვით, და მათი სალანძღავი გავხდი. "},
	{12, "12 და ჩავიცვი სამოსად ძაძა და იგავად ვიქეცი მათთვის. "},
	{13, "13 ჩემზე ლაპარაკობენ კარიბჭესთან მსხდომნი და მღერიან ღვინის მსმელნი. "},
	{14, "14 და მე ვლოცულობ შენს მიმართ, უფალო, სასურველ დროს; ღმერთო, შენი დიდი წყალობით მიპასუხე შენი შველის ჭეშმარიტებით. "},
	{15, "15 მიხსენი ლაფისგან და არ დავინთქა, გადამარჩინე ჩემთა მოძულეთა და წყლის სიღრმეთაგან. "},
	{16, "16 ნუ გამიტაცებს წყლის ტალღა და ნუ ჩამყლაპავს მორევი და ნუ შეიკრავს ჩემზე პირს ჭა. "},
	{17, "17 მიპასუხე, უფალო, რადგან კარგია შენი წყალობა; შენი დიდი სიბრალულით გადმომხედე. "},
	{18, "18 ნუ დაფარავ სახეს შენი მორჩილისგან, რადგან მიჭირს; სწრაფად მიპასუხე. "},
	{19, "19 მოუახლოვდი ჩემს სულს, გადაარჩინე; ჩემი მტრების ჯიბრით მიხსენი. "},
	{20, "20 შენ იცი ჩემი გალანძღვა, ჩემი გაწბილება და ჩემი შერცხვენა; შენს თვალწინ არიან ჩემი მტრები. "},
	{21, "21 დამცირებამ დაამსხვრია ჩემი გული და ქანცი გამიწყდა; ველოდი თანამგრძნობლებს და არავინ იყო, მანუგეშებელს და - ვერ ვპოვე. "},
	{22, "22 და აურიეს ჩემს საჭმელში ძირმწარე და წყურვილის დროს მასვეს ძმარი. "},
	{23, "23 იყოს მათი ტაბლა მათთვის ხაფანგად და სიმშვიდის ჟამს - მახედ. "},
	{24, "24 დაბნელდეს თვალნი მათნი და წელი მათი სამუდამოდ მოადუნე. "},
	{25, "25 გადმოაფრქვიე მათზე შენი მრისხანება და შენი რისხვის ალი ეწიოთ მათ. "},
	{26, "26 სამკვიდრებელი მათი გაპარტახდეს, მათ კარვებში არ იყოს მკვიდრი. "},
	{27, "27 ვინაიდან, ვინც შენ გვემე, დევნიან, და შენს გვემილთა სატკივარს ამრავლებენ. "},
	{28, "28 დაურთე ცოდვა მათს ცოდვას და ნუმც შეაღწევენ შენს სიმართლეში. "},
	{29, "29 ამოიშალონ ცოცხალთა წიგნიდან და წმიდანებთან ნუ ჩაიწერებიან. "},
	{30, "30 ხოლო მე ღარიბი და დავრდომილი ვარ. შენმა შველამ, ღმერთო, დამიფაროს მე. "},
	{31, "31 ვაქებ ღმერთის სახელს; გალობით განვადიდებ, მადლიერებით. "},
	{32, "32 და უფრო მოეწონება ეს უფალს, ვიდრე ხარი, მოზვერი რქიანი და ჩლიქიანი. "},
	{33, "33 რადგან მოუსმენს ღატაკებს უფალი და თავის ტყვეებს არ უგულებელყოფს. "},
	{34, "34 ნახავენ მოკრძალებულნი, გაიხარებენ და გაცოცხლდება გული თქვენი, მაძიებელნო ღმერთისა. "},
	{35, "35 განადიდებენ მას ცა და დედამიწა, ზღვები და ყოველი, მათში მოძრავი. "},
	{36, "36 რადგანაც ღმერთი დაიხსნის სიონს და ააშენებს იუდას ქალაქებს, და დასახლდებიან იქ და დაიმკვიდრებენ. "},
	{37, "37 მის მორჩილთა შთამომავლობა დაეუფლება მას და მისი სახელის მოყვარულნი დაბინავდებიან მასში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view69() {
struct ka69 poems[] = {
	{1, "1 გუნდის ლოტბარს, დავითის გასახსენებელი.  "},
	{2, "2 ისწრაფე, ღმერთო ჩემო, სახსნელად, უფალო, ჩემს დასახმარებლად. "},
	{3, "3 დაე, შერცხვნენ და გაწბილდნენ ჩემი სულის მაძიებელნი, უკუიქცნენ და დასაცინი გახდნენ ჩემი სიავის მდომნი. "},
	{4, "4 დაე, უკუიქცნენ სირცხვილნაჭამნი, ვინც მეუბნება: ოჰო! ოჰო! "},
	{5, "5 ილხინოს და გაიხაროს შენით ყველამ, ვინც შენ გეძიებს და გაიძახის მუდამ: „დიდია ღმერთი“, ვისაც უყვარს შველა შენმიერი. "},
	{6, "6 ხოლო მე ღარიბ-ღატაკი ვარ, ღმერთო, იჩქარე ჩემსკენ; ჩემი შემწე და მხსნელი ხარ შენ. უფალო, ნუ დააყოვნებ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view70() {
struct ka70 poems[] = {
	{1, "1 შენ გესავ, უფალო, ნურც შევრცხვენილვარ ნურასოდეს. "},
	{2, "2 შენი სიმართლით მიხსენი და გადამარჩინე, ყური მომაპყარ და მიშველე. "},
	{3, "3 იყავი ჩემთვის კლდოვანი თავშესაფარი, რომ მოვდიოდე შენთან მარადჟამს; გაეცი ბრძანება ჩემს საშველად, რადგან ჩემი ბურჯი და ჩემი სიმაგრე ხარ. "},
	{4, "4 ღმერთო ჩემო, მიხსენი ბოროტის ხელისაგან, უკანონობის მოქმედისა და მმარცველის ხელისაგან. "},
	{5, "5 რადგან შენა ხარ ჩემი იმედი, უფალო, ღმერთო ჩემო, ჩემი სასო ყრმობიდანვე. "},
	{6, "6 შენზე ვიყავი დაყრდნობილი მუცლიდანვე, შენ გამომიყვანე დედის წელიდან; შენ გეკუთვნის ჩემი ხოტბა მუდამ. "},
	{7, "7 საოცრებასავით ვიყავი მრავალთათვის; და შენ ხარ ჩემი ძალოვანი თავშესაფარი. "},
	{8, "8 ივსება ჩემი პირი შენი ქებით და შენმიერი ბრწყინვალებით ყოველდღიურად. "},
	{9, "9 ნუ უკუმაგდებ სიბერის ჟამს, უძლურების დროს ნუ მიმატოვებ. "},
	{10, "10 რადგან მოილაპარაკეს ჩემმა მტრებმა ჩემზე და ერთად მოითათბირეს ჩემი სულის წინააღმდეგ ჩასაფრებულებმა. "},
	{11, "11 და ამბობენ: ღმერთმა მიატოვა იგი; დაედევნეთ და შეიპყარით, რაკი არა ჰყავს მხსნელი. "},
	{12, "12 ღმერთო, ნუ დამშორდები; ღმერთო ჩემო, ჩემს შესაწევნად გამოეშურე. "},
	{13, "13 დაე, შერცხვნენ და მოისპონ ჩემი სულის მტრები; სირცხვილმა და გაწბილებამ დაბუროს ჩემთვის სიავის მაძიებლები. "},
	{14, "14 ხოლო მე ვესავდე და ვამრავლებდე ყოველნაირად შენს ქებას; "},
	{15, "15 ბაგენი ჩემი ილაპარაკებენ შენს სიმართლეზე, ყოველდღეა შველა შენმიერი, რადგან არ ვიცი მათი რიცხვი. "},
	{16, "16 შევალ უფალი ღმერთის ძლიერებით, გავიხსენებ შენს სიმართლეს, მხოლოდ შენსას. "},
	{17, "17 ღმერთო, შენ მასწავლიდი ყრმობიდანვე და დღესაც ვუბნობ შენს საოცრებაზე. "},
	{18, "18 ასევე მოხუცებულობამდე და ღრმა სიბერემდე, ნუ მიმატოვებ, ღმერთო, ვიდრე გავაცნობდე შენს ძალას ამ თაობას და ყველა მომავალს - შენს სიძლიერეს. "},
	{19, "19 ხოლო შენი სიმართლე, ღმერთო, ზეცამდეა, რომ ჰქმენ საქმენი დიდნი; ღმერთო, ვინ არის შენი ბადალი? "},
	{20, "20 შენ მაჩვენე მრავალი და მძიმე გაჭირვება; კვლავ გამაცოცხლე და დედამიწის უფსკრულიდან ამომიყვანე კვლავ. "},
	{21, "21 შენ გაამრავლე დიდება ჩემი და მობრუნდი ჩემს სანუგეშებლად. "},
	{22, "22 მეც მადლობას გადაგიხდი ებნის საკრავით, ვადიდებ შენს ჭეშმარიტებას, ღმერთო; გიგალობებ ქნარით, წმიდაო ისრაელისა. "},
	{23, "23 იხარებენ ჩემი ბაგენი, როს გიგალობებ შენ, და ჩემი სულიც, შენ რომ დაიხსენი. "},
	{24, "24 ჩემი ენაც ყოველდღე წარმოსთქვამს შენს სიმართლეს, რადგან შერცხვნენ და დამცირდნენ ჩემი ავის მაძიებელნი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view71() {
struct ka71 poems[] = {
	{1, "1 სოლომონის შესახებ. ღმერთო! შენი სამართალი მიეცი მეფეს და შენი სიმართლე - მეფის ძეს. "},
	{2, "2 გაასამართლოს შენი ერი სიმართლით და შენი ღატაკნი - სამართლიანად. "},
	{3, "3 მოუტანონ მთებმა მშვიდობა ერს და ბორცვებმა - სიმართლე. "},
	{4, "4 გაასამართლოს ერის ღატაკნი, იხსნას შვილი ღარიბისა და დაჩაგროს მჩაგვრელი. "},
	{5, "5 შენი შიში ექნებათ, ვიდრე მზე და მთვარეა, თაობიდან თაობამდე. "},
	{6, "6 იგი ჩამოვა, როგორც წვიმა მოთიბულ მდელოზე. როგორც წვეთები, მიწას რომ რწყავენ. "},
	{7, "7 მის დღეებში გაიფურჩქნება წმიდანი და გამრავლდება მშვიდობა, ვიდრე მთვარე არსებობს. "},
	{8, "8 და იბატონებს ზღვიდან ზღვამდე და მდინარიდან დედამიწის კიდემდე. "},
	{9, "9 მის წინაშე ქედს მოიდრეკენ უდაბნოს მცხოვრებნი და მისი მტრები მტვერს ალოკავენ. "},
	{10, "10 თარშიშისა და კუნძულთა მეფენი ხარკს მოუტანენ მას; არაბეთისა და შებას მეფენი ძღვენს მოართმევენ. "},
	{11, "11 და ყველა მეფე თაყვანსა სცემს მას, ყველა ხალხი დაემორჩილება. "},
	{12, "12 რადგანაც იხსნის ღარიბს, მღაღადებელს და ღატაკს, ვისაც არა ჰყავს შემწე. "},
	{13, "13 შეიწყნარებს დავრდომილსა და ღარიბს, და ღარიბთა სულებს დაიხსნის. "},
	{14, "14 ვერაგობისა და ძალადობისგან დაიხსნის მათ სულებს, ძვირფასია მათი სისხლი მის თვალში. "},
	{15, "15 იცოცხლებს და მისცემენ მას არაბეთის ოქროს და ილოცავენ მისთვის მუდამ, ყოველდღე აკურთხებენ მას. "},
	{16, "16 იქნება სიუხვე პურისა დედამიწაზე, მთათა მწვერვალზე. მისი ნაყოფი იბიბინებს, ვითარცა ტყე ლიბანისა; აბიბინდებიან ქალაქებში, როგორც ბალახი დედამიწაზე. "},
	{17, "17 მისი სახელი იქნება უკუნისამდე, ვიდრე მზე არსებობს, იბრწყინებს მისი სახელი, და იკურთხებიან მის მიერ, ყოველი ხალხი შენატრებს მას. "},
	{18, "18 კურთხეულ არს უფალი ღმერთი, ღმერთი ისრაელისა, მარტოდ მოქმედი სასწაულისა. "},
	{19, "19 და კურთხეულ არს სახელი მისი დიდებისა უკუნისამდე, და აივსება მისი დიდებით მთელი ქვეყნიერება. ამინ, ამინ! "},
	{20, "20 დამთავრდა ლოცვანი დავითისა, იესეს ძისა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view72() {
struct ka72 poems[] = {
	{1, "1 ფსალმუნი ასაფისა. რა კეთილია ღმერთი ისრაელის მიმართ, გულწრფელთა მიმართ. "},
	{2, "2 მე კი - კინაღამ გადაუხვიეს ჩემმა ფეხებმა, კინაღამ მომიცურდა ნაბიჯები. "},
	{3, "3 რადგან შემშურდა სულელებისა, რაკი ვხედავდი ბოროტების კეთილდღეობას. "},
	{4, "4 რადგან არა აქვთ შეჭირვება სიკვდილამდე და ჯანმრთელები არიან. "},
	{5, "5 ადამიანის სიძნელეებს არ განიცდიან და სხვა ადამიანებთან არ ტვირთმძიმობენ. "},
	{6, "6 ამიტომ მძივივით გარს შემოერტყა მათ ამპარტავნობა და ძალადობა სამოსელივით ჩაიცვეს. "},
	{7, "7 სიმსუქნისაგან თვალები გადმოკარკლეს, გულები აევსოთ სიბრიყვით. "},
	{8, "8 ყველას დასცინიან და ბოროტად ლაპარაკობენ ძალადობაზე, ქედმაღლურად ლაპარაკობენ. "},
	{9, "9 მათი პირი ცას მისწვდა და მათი ენა დედამიწაზე დაიარება. "},
	{10, "10 ამიტომ ბრუნდება მისი ერი აქ და სვამენ წყალს სავსე თასიდან. "},
	{11, "11 და ამბობენ: როგორ შეიტყობს ღმერთი? და განა აქვს გაგება უზენაესს? "},
	{12, "12 აჰა, ეს ბოროტნი, უზრუნველნი ამა სოფლისა, იხვეჭენ დოვლათს. "},
	{13, "13 ამაოდ გავისუფთავე გული და დავიბანე ხელები. "},
	{14, "14 და ვიყავი ნაგვემი ყოველდღე და ვიტანჯებოდი დილდილაობით. "},
	{15, "15 რომ მეთქვა: ვიმსჯელებ ასე, მაშინ შენი შვილების თაობას ვუღალატებდი. "},
	{16, "16 და ვიფიქრე, რომ შემეგნო ეს - მაგრამ ძნელი იყო ჩემს თვალში. "},
	{17, "17 ვიდრე მოვიდოდი ღვთის ტაძარში და გავიგებდი მათ ბოლოს. "},
	{18, "18 მაგრამ მოლიპულ გზაზე დააყენე ისინი და უფსკრულში გადაჩეხე. "},
	{19, "19 როგორ მეყსეულად განადგურდნენ, დაიღუპნენ, გაქრნენ შიშის ზარისაგან! "},
	{20, "20 როგორც სიზმარი ქარწყლდება გამოღვიძების შემდეგ, უფალო, ისე დაამცირებ მათ სახეებს, როცა გამოაფხიზლებ. "},
	{21, "21 როცა გული დამიძმარდა და შიგნეულობა დამეფლითა, "},
	{22, "22 უმეცარი ვიყავი და ვერ მივხვდი, პირუტყვივით ვიყავი შენს წინაშე. "},
	{23, "23 ხოლო მე მუდამ შენთანა ვარ, ხელთ გიპყრია მარჯვენა ჩემი. "},
	{24, "24 შენი რჩევით მიმიძღვი წინ და შემდგომ პატივით მიმიღებ. "},
	{25, "25 ვინ არის ჩემთვის ცაში? და შენს გარდა არავინ მსურს დედამიწაზე. "},
	{26, "26 ქანცგამოლეულია ჩემი სული და გული; ღმერთია ჩემი გულის სიმაგრე და ჩემი ხვედრი უკუნისამდე. "},
	{27, "27 რადგან, აჰა, შენგან განშორებულნი იღუპებიან; შენ მოსპობ ყველას, ვინც განზე განგიდგება. "},
	{28, "28 ხოლო ჩემთვის სასიკეთოა ღმერთთან მიახლოება; უფალ ღმერთზე ვამყარებ იმედს, რათა ვილაპარაკო ყველა შენს საქმეზე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view73() {
struct ka73 poems[] = {
	{1, "1 მოძღვრება ასაფისა. რატომ მიგვატოვე, უფალო - სამუდამოდ? აინთო შენი რისხვა შენი სამწყსოს ცხვარზე? "},
	{2, "2 გაიხსენე შენი თემი, რომელიც ადრევე შეიძინე, იხსენი ტომი შენი სამკვიდრო, ეს მთა სიონისა, რომელზეც შენი სავანეა, "},
	{3, "3 წარმართე შენი ნაბიჯები მარადიული ნანგრევებისკენ - ყოველივე დაუნგრევია მტერს. "},
	{4, "4 შენი მტრები ღმუიან შენს საკრებულოში; დადეს თავიანთი ნიშნები სასწაულების მაგიერ. "},
	{5, "5 ემსგავსებოდნენ იმათ, ვინც ხის ტოტებზე ცულს შემართავს. "},
	{6, "6 და ახლა ჩუქურთმები უროთი და ცულით დაამტვრიეს ერთიანად. "},
	{7, "7 ცეცხლს მისცეს შენი ტაძარი, მიწასთან გაასწორეს შენი სახელის სამკვიდრებელი. "},
	{8, "8 თქვეს თავიანთ გულში: გავანადგუროთ ისინი ერთიანად. დაწვეს ღმერთის ყველა საკრებულო დედამიწაზე. "},
	{9, "9 ჩვენს სასწაულებს ვეღარ ვხედავთ, აღარ გვყავს წინასწარმეტყველი და არვინ არის ჩვენთან, რომ იცოდეს - როდემდე? "},
	{10, "10 ღმერთო, როდემდე უნდა იგინოს მტერმა? ნუთუ მარადჟამს უნდა შელანძღოს მოშუღარმა შენი სახელი? "},
	{11, "11 რატომ სწევ უკან შენს ხელს და შენს მარჯვენას? გამოიღე შენი უბიდან და მოსპე. "},
	{12, "12 ხოლო ღმერთი მეფეა ჩემი ადრიდანვე, შველა-ხსნის მოქმედი ქვეყნიერებაზე. "},
	{13, "13 შენ გაკვეთე ზღვა შენი ძალით, წყალზე მიუმვრიე თავები ურჩხულებს. "},
	{14, "14 შენ გაუჭეჭყე თავი ლევიათანს, მიეცი საჭმელად იგი უდაბნოს ხალხს. "},
	{15, "15 შენ გააპე წყარო და ხევი, შენ დააშრე ძლიერი მდინარენი. "},
	{16, "16 შენია დღე, ღამეც შენია; შენ განამზადე მთვარე და მზე. "},
	{17, "17 შენ დაადგინე ყველა საზღვარი ქვეყნიერებისა, ზაფხულ-ზამთარი შენ დააარსე. "},
	{18, "18 გაიხსენე ეს: მტერი აგინებს უფალს და არამზადა ხალხი ლანძღავს შენს სახელს. "},
	{19, "19 მხეცებს ნუ მისცემ შენი გვრიტის სულს, შენი ღარიბების სიცოცხლეს ნუ დაივიწყებ. "},
	{20, "20 მიხედე აღთქმას, რადგან აივსო ქვეყნიერების ბნელი ადგილები ძალადობის სადგომებით. "},
	{21, "21 ნუ დაბრუნდება ჩაგრული გაწბილებულად, ღარიბ-ღატაკნი აქებენ შენს სახელს. "},
	{22, "22 აღდეგ, უფალო, ედავე შენს მოდავეებს, გაიხსენე შენი ლანძღვა არამზადებისაგან ყოველდღე. "},
	{23, "23 ნუ დაივიწყებ შენი მტრების ხმას; შენს მოწინააღმდეგეთა ხმაური ამოდის მუდამ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view74() {
struct ka74 poems[] = {
	{1, "1 გუნდის ლოტბარს. ნუ მოსპობ. ფსალმუნი ასაფისა. გალობა.  "},
	{2, "2 გადიდებთ შენ, ღმერთო, გადიდებთ, რადგან ახლოა შენი სახელი; ლაპარაკობენ შენს საოცრებებს. "},
	{3, "3 როცა გამოვნახავ დროს, გავასამართლებ სისწორით. "},
	{4, "4 ირყეოდნენ დედამიწა და მისი მცხოვრებნი, მე გავამაგრე მისი სვეტები. სელა. "},
	{5, "5 ვუთხარი სულელებს: ნუ მოჰყვებით ქედმაღლობას, "},
	{6, "6 ნუ მოჰყვებით მეტისმეტ ქედმაღლობას, ნუ ილაპარაკებთ ამპარტავნულად. "},
	{7, "7 რადგან არც აღმოსავლეთიდან და არც დასავლეთიდან, და არც უდაბნოდანაა მთები. "},
	{8, "8 ვინაიდან ღმერთი განსჯის: ერთს დაამდაბლებს და მეორეს აღამაღლებს. "},
	{9, "9 რადგან უფლის ხელშია თასი და ღვინო დუღს ნარევით სავსე, და ასხამს მისგან, მის თხლესაც კი სწურავენ და სვამენ ყოველნი ბოროტნი ქვეყნისა. "},
	{10, "10 ხოლო მე ვიტყვი ყოველ ჟამს, ვუგალობებ იაკობის ღმერთს. "},
	{11, "11 ბოროტთა რქებს მთლიანად დავამტვრევ, მართლის ღირსებას ავამაღლებ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view75() {
struct ka75 poems[] = {
	{1, "1 გუნდის ლოტბარს. სიმებიან საკრავზე. ფსალმუნი ასაფისა. გალობა. "},
	{2, "2 ცნობილია იუდაში ღმერთი, ისრაელში დიდია მისი სახელი. "},
	{3, "3 და იყო იერუსალიმში. მისი კარავი და მისი სადგომი - სიონში. "},
	{4, "4 იქ დაიმსხვრა მშვილდ-ისრები, ფარი და ხმალი, და ომი. სელა."},
	{5, "5 ბრწყინვალე და ძლიერი ხარ სანადირო მთებზე მეტად. "},
	{6, "6 გაცოფდნენ გულმაგრები, ჩათვლიმეს, დაეძინათ და ვერც ერთმა მოლაშქრემ ვეღარ ჰპოვა ხელები თვისი. "},
	{7, "7 შენი შემოტევით, ღმერთო იაკობისა, რული მოერია ეტლსაც და ცხენსაც. "},
	{8, "8 შენ საშიში ხარ და ვინ დაგიდგება წინ შენი განრისხების ჟამს? "},
	{9, "9 ციდან მოგვასმინე სამართალი; დედამიწა შეშინდა და მიწყნარდა; "},
	{10, "10 როცა აღდგა სამართლისათვის ღმერთი ქვეყნიერების ყველა ჩაგრულის გადასარჩენად. სელა. "},
	{11, "11 რაკი ადამიანის რისხვა იქცევა შენდა აღიარებად, ნაშთს რისხვისას მოთოკავ. "},
	{12, "12 აღუთქვით და გადაუხადეთ უფალ ღმერთს; ყველამ - მის ირგვლივ მყოფმა, საჩუქარი მიუძღვნას საშიშს."},
	{13, "13 ის დაამდაბლებს მბრძანებელთა სულს, შიშის ზარს დასცემს ამქვეყნიურ მეფეებს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view76() {
struct ka76 poems[] = {
	{1, "1 გუნდის ლოტბარს. იედუთუნის შესახებ. ასაფის ფსალმუნი.  "},
	{2, "2 ჩემი ხმა ღმერთის მიმართ და მე შევღაღადებ. ჩემი ხმა ღმერთის მიმართ და ის მომისმენს. "},
	{3, "3 ჩემი გაჭირვების დღეს უფალს ვეძიებ, ჩემი ხელი ღამღამობით გაწვდილია და არ ივანებს, უარს ამბობს ნუგეშისცემაზე ჩემი სული. "},
	{4, "4 გავიხსენებ ღმერთს და ვთრთი, ვისაუბრებ და უძლურდება ჩემი სული. სელა. "},
	{5, "5 თვალი არ დამახუჭინე; შევძრწუნდი და ვეღარ ვლაპარაკობ. "},
	{6, "6 ვიგონებდით ადრინდელ დღეებს, გარდასულ წლებს. "},
	{7, "7 გავიხსენებ ჩემს გალობას ღამღამობით, ჩემს გულთან ვისაუბრებ და განიცდის სული ჩემი. "},
	{8, "8 ნუთუ საუკუნოდ მიმატოვებს უფალი და აღარასოდეს მოისურვებს? "},
	{9, "9 ნუთუ სამუდამოდ გაქრა მისი წყალობა, დამთავრდა მისი სიტყვა თაობიდან თაობამდე? "},
	{10, "10 ნუთუ დაივიწყა შებრალება ღმერთმა? ნუთუ რისხვით უარყო სიბრალული? სელა. "},
	{11, "11 და ვთქვი: აი, ჩემი უბედურება - შეცვლა უზენაესის მარჯვენისა. "},
	{12, "12 გავიხსენებ უფლის საქმეებს, რადგანაც მახსოვს შენი ძველი სასწაულები. "},
	{13, "13 ჩავუკვირდები ყველა შენს ნამოქმედარს და შენს საქმეებზე ვისაუბრებ. "},
	{14, "14 ღმერთო! წმიდაა შენი გზა. რომელი ღმერთია ჩვენი ღმერთივით დიდი? "},
	{15, "15 შენა ხარ ღმერთი, სასწაულის მოქმედი; შენ გამოავლინე ხალხთა შორის ძლიერება შენი. "},
	{16, "16 შენი მკლავით დაიხსენი შენი ერი - ძენი იაკობისა და იოსებისა. სელა. "},
	{17, "17 გიხილეს წყლებმა, ღმერთო, გიხილეს წყლებმა - შეშინდნენ, უფსკრულნიც კი შეძრწუნდნენ. "},
	{18, "18 გადმოღვარეს წყლები ღრუბლებმა, ხმა გამოსცეს ცებმა, შენი ისრებიც მიმოფრენდნენ. "},
	{19, "19 შენი გრგვინვის ხმა ცის თაღზე - გაანათეს ელვებმა სამყარო, შეძრწუნდა და შეირყა დედამიწა. "},
	{20, "20 ზღვაშია შენი გზა და შენი ბილიკი - დიდ მდინარეებში, და შენი კვალი არ არის ცნობილი. "},
	{21, "21 უძღოდი, ვითარცა ცხვარს, შენს ხალხს მოსეს და აარონის ხელით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view77() {
struct ka77 poems[] = {
	{1, "1 მოძღვრება ასაფისა. ისმინე, ხალხო ჩემო, ჩემი კანონი; ყური მოაპყარით ჩემთა ბაგეთა ნათქვამს. "},
	{2, "2 იგავით გავხსნი პირს, ავამეტყველებ გამოცანებს დასაბამისა. "},
	{3, "3 რაც მიავისმინეთ და გავიგეთ, და ჩვენმა მამებმა გვიამბეს, "},
	{4, "4 არ დავუმალავთ ჩვენ მათს შვილებს, მომავალ თაობას ვუამბობთ უფლის ქება-დიდებას და მის ძლიერებას, და მის სასწაულებს, რაც მოიმოქმედა. "},
	{5, "5 დაუდგინა წესდება იაკობს და რჯული დაუდო ისრაელს, რაც დაუწესა ჩვენს მამებს საუწყებლად მათთა შვილთათვის. "},
	{6, "6 რათა შეიტყოს მომავალმა თაობამ, შვილებმა, რომელნიც დაიბადებიან, ვინძლო ადგნენ და გაუცხადონ თავიანთ შვილებს. "},
	{7, "7 და დაამყარონ ღმერთზე თავიანთი იმედი, და არ დაივიწყონ ღმერთის საქმენი, და დაიცვან მისი აღთქმანი. "},
	{8, "8 და არ ემსგავსონ თავიანთ მამებს, გულარძნილთა და ურჩთა თაობას, თაობას, რომ არ აწაღმართა გული თავისი და ურწმუნო-ჰყო უფლის მიმართ თავისი სული. "},
	{9, "9 ძენი ეფრემისა, აღჭურვილნი და მშვილდმოზიდულნი, უკუიქცნენ ბრძოლის დღეს. "},
	{10, "10 მათ არ დაიცვეს აღთქმა უფლისა და მის მცნებაზე სიარული აღარ ისურვეს. "},
	{11, "11 გადაივიწყეს მისი საქმენი და სასწაულნი, მათ რომ მოუვლინა. "},
	{12, "12 მათი მამების თვალწინ მოიმოქმედა სასწაული ეგვიპტის ქვეყანაში, ცოყანის ველზე. "},
	{13, "13 გააპო ზღვა და შიგ გაატარა ისინი, და კედელივით წამომართა წყლები. "},
	{14, "14 და უძღოდა დღისით ღრუბლით და მთელი ღამე - ცეცხლის შუქით. "},
	{15, "15 გააპო კლდენი უდაბნოში და დაარწყულა ვით უფსკრულის წყალსატევიდან. "},
	{16, "16 გადმოადინა ნაკადები კლდისაგან და წამოვიდნენ წყლები მდინარეებივით. "},
	{17, "17 ისინი კი განაგრძობდნენ შეცოდებას მის მიმართ, აბრაზებდნენ უზენაესს უდაბნოში. "},
	{18, "18 ცდიდნენ ღმერთს თავიანთ გულში, როს ხორაგეულს მოითხოვდნენ თავის სულისთვის. "},
	{19, "19 და ლაპარაკობდნენ ღმერთზე, ამბობდნენ: შეიძლებს ღმერთი უდაბნოში ტაბლის გამართვას? "},
	{20, "20 ჰა, კლდეს დაჰკრა და გადმოსკდა წყალი და გადმოინთხა ნაკადები. პურის მოცემაც თუ ძალუძს? ხორცს თუ მოუმზადებს თავის ხალხს? "},
	{21, "21 ამიტომაც, მოისმინა უფალმა და განრისხდა, და მოედო ცეცხლი იაკობს, და ისრაელზე აღზევდა რისხვა. "},
	{22, "22 რადგან არ დაუჯერეს ღმერთს და მის შველაზე არ დაამყარეს იმედი. "},
	{23, "23 და უბრძანა ღრუბლებს მაღლიდან და გახსნა ცათა ბჭეები. "},
	{24, "24 და გადმოაწვიმა მათზე მანანა საზრდოდ და ციური პური მისცა მათ. "},
	{25, "25 ძლიერთა პურსა ჭამდა კაცი; საზრდოს უგზავნიდა მათ მაძღრისად. "},
	{26, "26 აღძრა აღმოსავლეთის ქარი ზეცაზე და წარმართა თავისი ძალით სამხრეთის ქარი. "},
	{27, "27 და აწვიმა მათზე ხორცი, ვითარცა მტვერი, და ვითარცა ზღვის ქვიშა - ფრთოსანი ფრინველი. "},
	{28, "28 და ჩამოჰყარა მათი ბანაკის სიახლოვეს, გარშემო მათი საცხოვრისებისა. "},
	{29, "29 ჭამეს და გაძღნენ მეტისმეტად, და შეუსრულა სურვილი მათი. "},
	{30, "30 ჯერ არ მოყირჭებოდათ სურვილი, საჭმელი კიდევ პირში ჰქონდათ; "},
	{31, "31 რომ ღმერთის რისხვა აღიძრა მათზე და ამოხოცა სხვებზე მსუქნები და ჩააჩოქა რჩეულები ისრაელისა. "},
	{32, "32 მაინც შესცოდეს კიდევ და არ ირწმუნეს მისი სასწაულები. "},
	{33, "33 და დაასრულა ამაოებით მათი დღეები და მათი წლები ძრწოლით. "},
	{34, "34 როცა ხოცავდა, მაშინ მოიძიებდნენ მას. და ბრუნდებოდნენ და მიმართავდნენ ღმერთს. "},
	{35, "35 და იხსენიებდნენ, რომ ღმერთი მათი სიმაგრეა და უზენაესი ღმერთი მათი მხსნელია. "},
	{36, "36 და ელაქუცებოდნენ მას პირით და ენით ეცრუებოდნენ მას. "},
	{37, "37 ხოლო არ იყო მათი გული წრფელი მასთან და არც მის აღთქმას ერწმუნებოდნენ. "},
	{38, "38 და ის, გულმოწყალე, შეუნდობს ცოდვას და არ მოსპობს, მრავალჯერ უკუაგდებს თავის რისხვას და არ აღაგზნებს მთელ თავის გულისწყრომას. "},
	{39, "39 გაიხსენებს, რომ ხორციელნი არიან ისინი, სული, რომელიც გარდავა და აღარ ბრუნდება. "},
	{40, "40 რამდენჯერ გაუჯიუტდნენ უდაბნოში, განარისხეს უკაცრიელ ადგილას. "},
	{41, "41 ბრუნდებოდნენ და სცდიდნენ უფალს და შეურაცხყოფდნენ სიწმიდეს ისრაელისას. "},
	{42, "42 არ გაიხსენეს ხელი მისი, დღე, როცა დაიხსნა ისინი გასაჭირიდან. "},
	{43, "43 როცა მოიმოქმედა ეგვიპტეში სასწაულები თავისი და საოცრებანი ცოყანის ველზე. "},
	{44, "44 და გადააქცია სისხლად მდინარეები და ნაკადები მათი, რომ ვეღარ ესვათ. "},
	{45, "45 მიავლინა მათთან მწერნი, რომ დაეკბინათ ისინი და მყვარნი, რომ დაეღუპათ ისინი. "},
	{46, "46 და მისცა მუხლუხს მათი მოსავალი და მათი ნაჯაფი - კალიას. "},
	{47, "47 სეტყვით მოსრა ვენახი მათი და ლეღვსულელნი მათნი - თრთვილით. "},
	{48, "48 და მისცა სეტყვას მათი პირუტყვი და ხორშაკ ქარებს - ჯოგები მათი. "},
	{49, "49 მიავლინა მათთან თავისი რისხვის ალი, მრისხანება, მძვინვარება და გაჭირვება, როს წარმოგზავნა უკეთური ანგელოზები. "},
	{50, "50 გზა გაუკვალა თავის რისხვას, არ დაინდო სიკვდილისაგან მათი სული და მათი ცხოველები ჭირს მისცა. "},
	{51, "51 განგმირა ყოველი პირმშო ეგვიპტეში, პირველშობილნი - ხამის კარვებში. "},
	{52, "52 წაიყვანა ცხვარივით ხალხი თავისი და უდაბნოში, როგორც ფარას, ისე წარუძღვა. "},
	{53, "53 უძღოდა მათ იმედიანად და არ ეშინოდათ, ხოლო მათი მტრები ზღვამ დაფარა. "},
	{54, "54 მოიყვანა თავის წმიდა საზღვარზე, მთაზე, რომელიც მოიხელთა მისმა მარჯვენამ. "},
	{55, "55 განდევნა მათი გულისათვის ხალხები და გაუნაწილა მათი მამულები სამკვიდრებლად, და დაასახლა მათს კარვებში ტომები ისრაელისა. "},
	{56, "56 კვლავ გამოსცადეს და გაუჯიუტდნენ ღმერთს უზენაესს და მისი მცნებანი არ დაიცვეს. "},
	{57, "57 იხევდნენ და ღალატობდნენ თავიანთი მამების მსგავსად, უკან ბრუნდებოდნენ ყალბი მშვილდივით. "},
	{58, "58 განარისხეს იგი თავიანთი სამსხვერპლოებით და თავიანთი კერპებით გააღვიძეს მისი შური. "},
	{59, "59 მოისმინა ღმერთმა და განრისხდა და მეტისმეგად შეიძულა ისრაელი. "},
	{60, "60 მიატოვა შილოს სავანე, სადაც ადამიანებთან ერთად იყო დამკვიდრებული. "},
	{61, "61 და მისცა ტყვედ სიმაგრე თვისი და დიდება თვისი - მტრის ხელთ. "},
	{62, "62 და გასწირა სამახვილოდ ხალხი თავისი და თავის მემკვიდრეობაზე განრისხდა. "},
	{63, "63 მისი ჭაბუკები ცეცხლმა შეჭამა და მისი ქალწულები ვერ გათხოვდნენ. "},
	{64, "64 მისი მღვდლები ხმლით დაეცნენ და მის ქვრივებს არ უტირიათ. "},
	{65, "65 და გაიღვიძა, ვითარცა მძინარემ, უფალმა, როგორც დევგმირმა, ღვინისაგან გამოფხიზლებულმა. "},
	{66, "66 და განგმირა მისი მტრები ზურგში, სამუდამო სირცხვილი მიანიჭა მათ. "},
	{67, "67 დაიწუნა იოსების კარავი და ეფრემის ტომი არ ამოირჩია. "},
	{68, "68 ამოირჩია ტომი იუდასი, მთა სიონისა, რომელიც უყვარდა. "},
	{69, "69 მოაწყო ცასავით ტაძარი თვისი, დედამიწასავით სამუდამოდ დააფუძნა. "},
	{70, "70 ამოირჩია მორჩილი თვისი დავითი და წამოიყვანა იგი ცხვრის ფარებიდან. "},
	{71, "71 მეწველი ჯოგიდან მოიყვანა იგი იაკობის - თავისი ხალხის და ისრაელის - თავისი სამკვიდრებლის სამწყემსად. "},
	{72, "72 და მწყემსა ისინი თავისი სპეტაკი გულით და თავის ხელთა გონიერებით უძღოდა მათ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view78() {
struct ka78 poems[] = {
	{1, "1 ფსალმუნი ასაფისა. ღმერთო! ხალხები მოვიდნენ შენს სამკვიდრებელში, შებილწეს შენი წმიდა ტაძარი, იერუსალიმი ნანგრევებად აქციეს. "},
	{2, "2 მისცეს შენს მორჩილთა მძორი საჭმელად ცის ფრინველებს, შენთა წმიდათა სხეულები - მიწის ნადირებს. "},
	{3, "3 დაღვარეს სისხლი მათი წყალივით იერუსალიმის გარშემო და დამმარხავი არავინაა. "},
	{4, "4 სალანძღავი გავხდით ჩვენი მეზობლებისათვის, მასხრად ასაგდები და დასაცინი - ჩვენს ირგვლივ მყოფთათვის. "},
	{5, "5 როდემდე იქნები, უფალო, მუდმივად განრისხებული და იგიზგიზებს შური შენი, ვითარცა ცეცხლი? "},
	{6, "6 გადმოღვარე შენი რისხვა იმ ხალხებზე, შენ რომ არ გცნობენ, და იმ სამეფოებზე, შენს სახელს რომ არ შეჰღაღადებენ. "},
	{7, "7 რადგან შეჭამეს იაკობი და მისი სადგომი გააპარტახეს. "},
	{8, "8 ნუ გაგვიხსენებ წინაპართა ცოდვებს; მალე შეგვეგებოს წინ შენი წყალობა, რადგან მეტისმეტად დავჩაჩანაკდით. "},
	{9, "9 დაგვეხმარე, ღმერთო, ჩვენო მხსნელო, შენი სახელის ღირსებისათვის; გადაგვარჩინე და შეგვინდე ჩვენი ცოდვები შენი სახელის გულისათვის. "},
	{10, "10 რატომ უნდა თქვან ხალხებმა: სად არის მათი ღმერთი? ცნობილი გახდეს წარმართთა შორის ჩვენს თვალწინ. შურისძიება შენს მორჩილთა დაღვრილი სისხლისა. "},
	{11, "11 მოაღწიოს შენამდე ტუსაღის კვნესამ. შენი მკლავის სიძლიერით შეეწიე სასიკვდილოდ განწირულ შვილებს. "},
	{12, "12 დაუბრუნე ჩვენს მეზობლებს შვიდმაგად მათ წიაღში ის დამცირება, შენ რომ გამცირებდნენ, უფალო. "},
	{13, "13 ხოლო ჩვენ - შენი ხალხი და შენი სამწყსოს ცხვარი გაქებთ შენ მარადჟამს, თაობიდან თაობას მოვუთხრობთ შენს დიდებას. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view79() {
struct ka79 poems[] = {
	{1, "1 გუნდის ლოტბარს, შოშანიმ - ედუთის საკრავზე, ასაფის ფსალმუნი.  "},
	{2, "2 მწყემსო ისრაელისა, ყური მოგვაპყარ; წინ რომ უძღოდი, ვითარცა ცხვარს, იოსებს, ქერუბიმებზე ამხედრებული, გამოგვეცხადე. "},
	{3, "3 ეფრემის, ბენიამინისა და მენაშეს წინაშე წამომართე შენი სიძლიერე და მოდი ჩვენს სახსნელად. "},
	{4, "4 ღმერთო! მოგვაქციე ჩვენ; გაბრწყინდეს სახე შენი და დავიხსნებით. "},
	{5, "5 უფალო, ღმერთო ძალთაო, როდემდე იქნები განრისხებული შენი ხალხის ლოცვაზე? "},
	{6, "6 აჭმევ მათ ცრემლიან პურს და ასმევ ცრემლებს სამმაგად. "},
	{7, "7 დაგვსვი საშუღლოდ ჩვენს მეზობლებში და ჩვენი მტრები აბუჩად გვიგდებენ. "},
	{8, "8 უფალო, ღმერთო ძალთაო, მოგვაქციე ჩვენ, გაბრწყინდეს შენი სახე და დავიხსნებით. "},
	{9, "9 ეგვიპტიდან გადმოიტანე ვაზი, განდევნე ხალხები და დარგე ის. "},
	{10, "10 გაწმიდე მის წინ ადგილი, გაადგმევინე ფესვები და მან აავსო ქვეყანა. "},
	{11, "11 მთები დაფარა მისმა ჩრდილმა და მისმა ტოტებმა - ნაძვი ღმერთისა. "},
	{12, "12 ტოტები გაიტანა ზღვამდე და მდინარემდე - ყლორტები თვისი. "},
	{13, "13 რატომ დაანგრიე ზღუდენი მისნი და ყოველი გზად გამვლელი ძარცვავს მას? "},
	{14, "14 ანადგურებს მას ტყიური ტახი და ველის ნადირები ძოვენ მას. "},
	{15, "15 ღმერთო ძალთაო! მობრუნდი, გადმოგვხედე ციდან და იხილე, და მოხედე ამ ვაზს. "},
	{16, "16 გაამაგრე ის, რაც დარგო შენმა მარჯვენამ, და ყლორტები, შენთვის რომ გააძლიერე. "},
	{17, "17 დამწვარია ცეცხლით, აკაფულია; შენი სახის რისხვით დაიღუპებიან. "},
	{18, "18 იყოს შენი ხელი შენი მარჯვენის კაცზე, ადამის ძეზე, შენთვის რომ გააძლიერე. "},
	{19, "19 და არ უკუვდგებით შენგან, გვაცოცხლე და შენს სახელს მოვუხმობთ. "},
	{20, "20 უფალო, ღმერთო ძალთაო, მოგვაქციე ჩვენ; გაბრწყინდეს შენი სახე და დავიხსნებით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view80() {
struct ka80 poems[] = {
	{1, "1 გუნდის ლოტბარს, გათის საკრავზე. ასაფისა.  "},
	{2, "2 უგალობეთ ღმერთს, სიმაგრეს ჩვენსას, შეჰღაღადეთ იაკობის ღმერთს. "},
	{3, "3 ასწიეთ სიმღერა და დაუკარით დაირა, ტკბილხმიანი ქნარი ებანთან ერთად. "},
	{4, "4 დაუკარით ახალი თვის თავზე ბუკი, მთვარის მოვანების ჟამს, ჩვენი დღესასწაულის დღეს. "},
	{5, "5 რადგან ეს არის კანონი ისრაელისა, სამართალი იაკობის ღმერთისა. "},
	{6, "6 დაადგინა მოწმობად იოსებისათვის, როცა გამოვიდა ეგვიპტის ქვეყნიდან; ენა, რომელიც არ ვიცოდი, ვისმინე. "},
	{7, "7 მოვხსენი ტვირთი მის მხრებს. მისი ხელები გოდრისაგან განთავისუფლდნენ. "},
	{8, "8 გაჭირვებაში მომიხმე და გადაგარჩინე, გიპასუხე ელვის საფარში, გამოგცადე მერიბას წყლებზე. სელა. "},
	{9, "9 ისმინე, ჩემო ხალხო, და დაგიმოწმებ მე, ისრაელო, თუ მომისმენ. "},
	{10, "10 არ იყოს შენში სხვა ღმერთი და თაყვანი არ სცე უცხო ღმერთს. "},
	{11, "11 მე ვარ უფალი, ღმერთი შენი, შენი გამომყვანი ეგვიპტის ქვეყნიდან; განავრცე ძირი შენი და გავავსებ მას. "},
	{12, "12 არ ისმინა ჩემმა ხალხმა ხმა ჩემი და ისრაელი არ დამემორჩილა. "},
	{13, "13 და მივუშვი ისინი თავიანთ გულისწადილზე, იარონ თავიანთ ნებაზე. "},
	{14, "14 ჩემს ერს რომ ჩემი ესმინა და ისრაელს ჩემს გზაზე ევლო. "},
	{15, "15 მოკლე ხანში მოვდრეკდი მათს მტრებს და მათს მჩაგვრელებზე ხელს აღვმართავდი. "},
	{16, "16 უფლის მოძულენი იპირფერებდნენ მასთან და მათი ჟამი იქნებოდა სამარადისო. "},
	{17, "17 გამოვკვებავდი მათ მაწიერი ხორბლით და კლდის თაფლით დავანაყრებდი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view81() {
struct ka81 poems[] = {
	{1, "1 ფსალმუნი ასაფისა. უფალი ჩადგა საღვთო კრებულში, ღმერთებს შორის ჰქმნა სამართალი. "},
	{2, "2 როდემდე განიკითხავთ უმართებულოდ და პირფერობას გამოიჩენთ ბოროტთა მიმართ? სელა. "},
	{3, "3 განიკითხეთო საპყარი და ობოლი, ღარიბი და ღატაკი გაამართლეთ. "},
	{4, "4 გადაარჩინეთ ბეჩავი და უპოვარი, ბოროტთა ხელიდან გამოიხსენით. "},
	{5, "5 არ იციან და არ გაეგებათ, წყვდიადში დადიან; ირყევა ყველა საფუძველი დედამიწისა. "},
	{6, "6 მე განვაცხადე: თქვენ ხართ ღმერთები და უზენაესის ძენი ხართ თქვენ ყველანი. "},
	{7, "7 მაგრამ თქვენ დაიხოცებით, როგორც ადამიანები, და დაეცემით, როგორც თითოეული მთავართაგანი. "},
	{8, "8 აღსდექ, ღმერთო, განსაჯე ქვეყანა, რადგან შენ დაიმკვიდრებ ყველა ხალხს."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view82() {
struct ka82 poems[] = {
	{1, "1 გალობა ფსალმუნი ასაფისა.  "},
	{2, "2 ღმერთო! ნუ დადუმდები, ყურს ნუ მოიყრუებ და დამშვიდდები, ღმერთო! "},
	{3, "3 რადგანაც, აგერ, შენი მტრები ხმაურობენ და შენმა მოძულეებმა თავი წამოყვეს. "},
	{4, "4 შენი ხალხის საწინააღმდეგოდ მზაკვრობენ საიდუმლოდ და თათბირობენ შენს დაფარულებზე. "},
	{5, "5 თქვეს: „მოდით, ამოვძირკვოთ ისინი ხალხთაგან და აღარ იხსენიებოდეს სახელი ისრაელისა“. "},
	{6, "6 მოითათბირეს ერთსულოვნად, შენს წინააღმდეგ შეკრეს პირობა; "},
	{7, "7 ედომელთა ბანაკებმა და ისმაელიანებმა, მოაბმა და აგარის ნაშიერმა; "},
	{8, "8 გებალმა, ყამონმა და ყამალეკმა, ფილისტიმელებმა ტვიროსელებთან ერთად. "},
	{9, "9 აშურიც მათ შეუერთდა და შეიქნენ სახსარნი ლოტის ძეთათვის. სელა. "},
	{10, "10 დამართე მათ ისევე, როგორც მიდიანს, როგორც სისერას, როგორც იაბინს კიშონის ხევზე; "},
	{11, "11 განადგურდნენ ისინი ყენ-დორში, სასუქად იქცნენ დედამიწისთვის. "},
	{12, "12 მოექეცი მათ, მათს დიდებულებს ისევე, როგორც ყორებს და როგორც ზეებს, და როგორც ზებახს, როგორც ცალმუნაყს, ყველა მათს თავადს. "},
	{13, "13 რომ ამბობდნენ: დავიმკვიდროთ ჩვენთვის სამკვიდრებელი უფლისა. "},
	{14, "14 ღმერთო ჩემო, ჰყავ ისინი, ვითარცა ბზე, ვითარცა ნამჯა ქარში. "},
	{15, "15 ვითარცა ცეცხლი, დამწველი ტყისა, ვითარცა ალი, მთების მბუგავი, "},
	{16, "16 ისე დაედევნე მათ შენი რისხვით და შენი ქარიშხლით შეაძრწუნე ისინი. "},
	{17, "17 აავსე მათი პირი სირცხვილით, ვიდრე მოიძიებდნენ შენს სახელს, უფალო. "},
	{18, "18 შერცხვებიან და შეძრწუნდებიან სამარადჟამოდ, და სირცხვილნაჭამნი დაიღუპებიან. "},
	{19, "19 მიხვდებიან, რომ შენი სახელია უფალი, მხოლოდ შენა ხარ უზენაესი მთელ ქვეყნიერებაზე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view83() {
struct ka83 poems[] = {
	{1, "1 გუნდის ლოტბარს, გათის საკრავზე, კორახის ძეთა ფსალმუნი.  "},
	{2, "2 რაოდენ სასურველია შენი სადგომები, უფალო ძალთა! "},
	{3, "3 ნატრობს და ელტვის კიდეც ჩემი სული უფლის ეზოებს, გული ჩემი და სხეული ჩემი უმღერიან უკვდავ ღმერთს. "},
	{4, "4 ჩიტმაც კი ჰპოვა სახლი და მერცხალმა ბუდე თავისთვის, რომ ჩასხას ბარტყები თვისი შენს სამსხვერპლოებთან, უფალო ძალთა, მეუფევ ჩემო და ღმერთო ჩემო! "},
	{5, "5 ნეტარ არიან შენს სახლში მსხდომნი. მარადჟამს გადიდებენ შენ. სელა. "},
	{6, "6 ნეტარ არს კაცი, რომლის ძლიერებაც შენშია, გზაა მათ გულში. "},
	{7, "7 გლოვის ველზე გამვლელნი წყაროს აღმოაჩენენ და კურთხევით დაფარავს მათ წვიმა შემოდგომისა. "},
	{8, "8 ივლიან ძალით-ძალამდე, გამოცხადდებიან ღმერთთან სიონში. "},
	{9, "9 უფალო, ღმერთო ძალთა, მოისმინე ჩემი ლოცვა, მური მომაპყარ, ღმერთო იაკობისა. სელა. "},
	{10, "10 ჩვენო ფარო, დაინახე, ღმერთო, და შეხედე სახეში შენს ცხებულს. "},
	{11, "11 რადგან ერთი დღე შენს ეზოებში ათასზე უმჯობესია. ღმერთის სახლის ზღურბლთან დგომას ვარჩევ ბოროტების კარვებში ბინადრობას. "},
	{12, "12 რადგან მზე და ფარია უფალი ღმერთი. მადლსა და ღირსებას მისცემს უფალი, სიკეთეს არ მოაკლებს უბიწოდ მოარულთ. "},
	{13, "13 უფალო ძალთა! ნეტარია კაცი შენზე მონდობილი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view84() {
struct ka84 poems[] = {
	{1, "1 გუნდის ლოტბარს, კორახის ძეთა ფსალმუნი.  "},
	{2, "2 ისურვე, უფალო, ქვეყანა შენი, დააბრუნე ტყვე იაკობისა. "},
	{3, "3 აპატიე დანაშაული შენს ხალხს, დაფარე ყველა მისი ცოდვა. სელა. "},
	{4, "4 აგვარიდე მთელი შენი გულისწყრომა, დააცხრე შენი მრისხანება. "},
	{5, "5 მოგვაქციე, ღმერთო, ჩვენო მხსნელო, და გააუქმე შენი გაჯავრება ჩვენზე. "},
	{6, "6 ნუთუ საუკუნოდ გაგვირისხდები, თაობიდან თაობამდე გააგრძელებ შენს მრისხანებას? "},
	{7, "7 ნუთუ აღარ დაგვიბრუნებ სიცოცხლეს, რათა შენმა ერმა იხაროს შენით? "},
	{8, "8 გვიჩვენე, უფალო, შენი წყალობა და შემწეობა გვიბოძე შენი. "},
	{9, "9 მე კი მოვისმენ, თუ რას იტყვის უფალი ღმერთი; რადგან მშვიდობას იტყვის თავის ხალხზე და თავის წმიდანებზე, და აღარ გაიმეორებენ სიბრიყვეს. "},
	{10, "10 მართლაც ახლოა ხსნა მისმიერი მის მოშიშთათვის, რათა დიდებამ დაისადგუროს ჩვენს ქვეყანაში. "},
	{11, "11 შეიყრებიან წყალობა და ჭეშმარიტება, სიმართლე და მშვიდობა გადაჰკოცნიან ერთიმეორეს. "},
	{12, "12 ჭეშმარიტება დედამიწიდან აღმოცენდება და სიმართლე ზეციდან გადმოიხედავს. "},
	{13, "13 უფალიც გვიბოძებს სიკეთეს და ჩვენი მიწა მოგვცემს ნაყოფს. "},
	{14, "14 სიმართლე ივლის მის წინ და გზას გაუკაფავს მის ნაბიჯებს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view85() {
struct ka85 poems[] = {
	{1, "1 ლოცვა დავითის. მომაპყარ, უფალო, ყური, მიპასუხე, რადგან ღარიბ-ღატაკი ვარ მე. "},
	{2, "2 დაიფარე სული ჩემი, რადგან ღვთისმოსავი ვარ; იხსენი მორჩილი შენი, შენ, ჩემო ღმერთო, შენ რომ გესავს. "},
	{3, "3 შემიწყალე, უფალო, რადგან შენ მოგიხმობ ყოველდღე. "},
	{4, "4 ახარე სული შენი მორჩილისა, რადგან, უფალო, შენსკენ აღვაპყარ სული ჩემი. "},
	{5, "5 რადგან შენ, უფალო, კეთილი და შემბრალე ხარ, და დიდად მოწყალე ყველას მიმართ, ვინც მოგიხმობს. "},
	{6, "6 მოისმინე, უფალო, ლოცვა ჩემი და ყურად იღე ჩემი მუდარის ხმა. "},
	{7, "7 ჩემი გაჭირვების დღეს მოგიხმობ, რადგან მიპასუხებ. "},
	{8, "8 არ არსებობს შენი მსგავსი ღმერთებს შორის, უფალო, და არც მსგავსი საქმეთა შენთა. "},
	{9, "9 ყოველი ხალხი, შენს მიერ შექმნილი, მოვა და მუხლს მოიდრეკს შენს წინაშე, უფალო, და განადიდებს შენს სახელს. "},
	{10, "10 რადგან დიდი და სასწაულთმოქმედი ხარ, შენა ხარ ღმერთი ერთადერთი. "},
	{11, "11 დამაყენე, უფალო, შენს გზაზე; ვივლი შენი ჭეშმარიტებისამებრ. წარმართე ჩემი გული შენი სახელის მოშიშებით. "},
	{12, "12 გიწამებ, უფალო, ღმერთო ჩემო, მთელი გულით და განვადიდებ შენს სახელს უკუნისამდე. "},
	{13, "13 რადგან დიდია შენი წყალობა ჩემს მიმართ, და გადაარჩინე ჩემი სული ქვესკნელის ჯოჯოხეთისგან. "},
	{14, "14 ღმერთო! ბოროტმოქმედნი აღდგნენ ჩემს წინააღმდეგ და მტარვალთა კრებულმა მოინდომა ჩემი სული, და არ წარმოგიდგინეს თავიანთ წინაშე. "},
	{15, "15 ხოლო შენ, უფალო, ღმერთო შემბრალევ და ლმობიერო, მრავლის მომთმენო, დიდმოწყალე და ჭეშმარიტი ხარ. "},
	{16, "16 პირი ჰქენ ჩემსკენ და შემიწყალე, უბოძე შენი სიმაგრე შენს მორჩილს და იხსენი ძე შენი მხევლისა. "},
	{17, "17 მოიმოქმედე ჩემს მიმართ სასწაული სასიკეთო, და იხილონ ჩემმა მოძულეებმა და რცხვენოდეთ, რადგან შენ, უფალო, შემეწიე და ნუგეში მეცი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view86() {
struct ka86 poems[] = {
	{1, "1 კორახის ძეთა ფსალმუნი. გალობა. მისი საძირკველი წმიდა მთებშია. "},
	{2, "2 უყვარს უფალს სიონის ბჭეები იაკობის ყველა სამკვიდროზე მეტად. "},
	{3, "3 ქება-დიდებას ამბობენ შენზე, ღვთის ქალაქო. სელა. "},
	{4, "4 გავახსენებ რაჰაბსაა და ბაბილონს, ვინც მე მიცნობს. აჰა, ფილისტიმი და ტვიროსი ქუშთან ერთად - ეს დაიბადა იქ. "},
	{5, "5 სიონზე კი იტყვიან: ეს და ეს კაცი იშვა მის წიაღში, და უზენაესმა წარმართა იგი. "},
	{6, "6 უფალი ჩაწერს ხალხთა ნუსხაში: ეს დაიბადა აქ. სელა. "},
	{7, "7 მომღერლები და მესტვირენიც - ყველა ჩემი წყარო შენშია. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view87() {
struct ka87 poems[] = {
	{1, "1 გალობა. ფსალმუნი კორახის ძეთა, გუნდის ლოტარს, მახალათის საკრავზე საგალობლად. მოძღვრება ჰემან ეზრახელისა.  "},
	{2, "2 უფალო, ღმერთო ჩემო მხსნელო! დღისით ვღაღადებ, ღამით - შენს პირისპირ. "},
	{3, "3 მოვიდეს შენს წინაშე ჩემი ლოცვა, ყური მოაპყარ ვედრებას ჩემსას. "},
	{4, "4 რადგან აღივსო სიავით სული ჩემი და ჩემი სიცოცხლე ჯოჯოხეთს უახლოვდება. "},
	{5, "5 შევირაცხე მკვდრების გვერდით, შევიქენი, ვითარცა კაცი უძალღონო. "},
	{6, "6 მკვდრებს შორისა ვარ ჩაგდებული, ვითარცა მოწყლულნი, სამარეში მწოლიარენი, რომელთაც აღარ გაიხსენებ და რომელნიც შენი ხელით მოისრნენ. "},
	{7, "7 მომათავსე ქვესკნელის ორმოში, ბნელეთში, მორევში. "},
	{8, "8 მე დამატყდა თავს რისხვა შენი და ყველა შენი ტალღით დამტანჯე. სელა. "},
	{9, "9 შენ განმაშორე ნაცნობნი ჩემნი, საზიზღარი გამხადე მათთვის; დამაპატიმრეს და ვერ გამოვდივარ. "},
	{10, "10 თვალი ჩემი დანაღვლიანდა ტანჯვით; მოგიხმობდი, უფალო, ყოველდღე, შენსკენ ვიწვდიდი ხელებს. "},
	{11, "11 ნუთუ მკვდრებისთვის მოიმოქმედებ სასწაულს? თუ მიცვალებულნი წამოდგებიან და განგადიდებენ? სელა. "},
	{12, "12 განა საფლავში ილაპარაკებენ შენს წყალობაზე და შენს ჭეშმარიტებაზე - ჯოჯოხეთში? "},
	{13, "13 შეიცნობენ წყვდიადში შენს სასწაულებს და შენს სიმართლეს - დავიწყების ქვეყანაში? "},
	{14, "14 მე კი, უფალო, შენ გევედრებოდი და დილ-დილაობით ჩემი ლოცვა წინ გეგებებოდა. "},
	{15, "15 რად მიატოვე, უფალო, სული ჩემი, უკუიქციე პირისახე ჩემგან? "},
	{16, "16 ღარიბი ვარ და ტანჯული ყრმობიდანვე, შენს საშინელებებს ვზიდავ, ვუძლურდები. "},
	{17, "17 თავზე გადამიარა შენმა მრისხანებამ. შენმა შიშის ზარმა გამანადგურა. "},
	{18, "18 გარს მივლიდნენ წყლების მსგავსად ყოველდღიურად, ყველა ერთად მერტყმოდა გარს. "},
	{19, "19 შენ განმაშორე მოყვარე და მეგობარი, ჩემი ნაცნობნი ბნელით მოცულან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view88() {
struct ka88 poems[] = {
	{1, "1 მოძღვრება ეთან ეზრახელისა.  "},
	{2, "2 უფლის წყალობებს მარადჟამს ვუგალობებ. თაობიდან თაობას ვაცნობებ შენს ჭეშმარიტებას ჩემი პირით. "},
	{3, "3 რადგანაც ვთქვი: უკუნისამდე დაფუძნდეს წყალობა და ცათა შიგან განიმტკიცო ჭეშმარიტება შენი. "},
	{4, "4 დავდე პირობა ჩემს რჩეულთან, შევფიცე დავითს, ჩემს მორჩილს: "},
	{5, "5 უკუნისამდე გავამაგრებ შენს შთამომავლობას და თაობიდან თაობამდე დავაფუძნებ შენს ტახტს. სელა. "},
	{6, "6 განადიდებენ ცანი შენს საოცრებებს, უფალო, ასევე შენს ჭეშმარიტებას წმიდათა კრებულში. "},
	{7, "7 რადგან ვინ შეედრება ცაში უფალს? ვინ მიემსგავსება უფალს ღვთის შვილებში? "},
	{8, "8 ღმერთი დიდებულია წმიდათა კრებულში მეტისმეტად და საშიშია ყველასათვის მის ირგვლივ. "},
	{9, "9 უფალო, ღმერთო ძალთაო! ვინ არის შენებრ მედგარი, უფალო? და შენი ჭეშმარიტება შენს გარშემოა. "},
	{10, "10 შენ ბატონობ ზღვის მოქცევაზე, მის აბობოქრებულ ტალღებს შენ ამშვიდებ. "},
	{11, "11 შენ განართხე რაჰაბი, როგორც განგმირული; შენი ძლიერი მკლავით გაფანტე შენი მტრები. "},
	{12, "12 შენია ცანი, დედამიწაც შენია, სამყარო და მისი სავსება შენ დააფუძნე. "},
	{13, "13 ჩრდილოეთი და სამხრეთი შენ შეჰქმენი; თაბორი და ხერმონი შენს სახელს უმღერებენ. "},
	{14, "14 შენია მკლავი მაგარი; გააძლიერე ხელი შენი, მოამაღლე მარჯვენა შენი. "},
	{15, "15 სიმართლე და მართლმსაჯულებაა შენი ტახტის საფუძველი, წყალობა და ჭეშმარიტება წინ გეგებებიან. "},
	{16, "16 ნეტარ არს ხალხი, მცოდნე ბუკის ხმობისა: ისინი შენი სახის შუქით იარებიან, უფალო; "},
	{17, "17 შენი სახელით ილხენენ ყოველდღე და შენი სიმართლით ამაღლდებიან. "},
	{18, "18 რადგან შენა ხარ მშვენება მათი ძალისა, და შენი ნებით მომაღლდება ღირსება ჩვენი. "},
	{19, "19 რადგან უფლისაგან არის ჩვენი ფარი და წმიდა ისრაელისაგან - მეფე ჩვენი. "},
	{20, "20 მაშინ ელაპარაკე ხილვისას შენს წმიდანებს და ეთხარი: ვუბოძე დახმარება გმირს, ავამაღლე რჩეული ხალხისაგან. "},
	{21, "21 ვპოვე დავითი, მსახური ჩემი, წმიდა ზეთი ვცხე მას. "},
	{22, "22 რომ ჩემმა ხელმა წარმართოს იგი და ჩემმა მკლავმა გაამაგროს. "},
	{23, "23 ვერ დაჯაბნის მას მტერი და ურჯულო ვერ დაჩაგრავს მას. "},
	{24, "24 მოვსრავ მის წინაშე მის მტრებს და მის მოძულეებს დავამხობ. "},
	{25, "25 ჭეშმარიტება და წყალობა ჩემი მასთანაა და ჩემი სახელით მომაღლდება ღირსება მისი. "},
	{26, "26 ზღვას გადავაწვდენ მის ხელს და მდინარეებს - მის მარჯვენას."},
	{27, "27 ის მომიწოდებს: მამაჩემი ხარ, ჩემი ღმერთი და ბურჯი ჩემი ხსნისა; "},
	{28, "28 მეც უფროსობას ვუბოძებ მას, ქვეყნიერების მეფეებზე უმაღლესობას, "},
	{29, "29 უკუნისამდე შევუნახავ მას ჩემს წყალობას და ჩემი აღთქმა საიმედო იქნება მისთვის. "},
	{30, "30 და დავამკვიდრებ უკუნისამდე ნაშიერს მისას და მისი ტახტი - ვითარცა დღენი ცისანი. "},
	{31, "31 თუ მიატოვეს მისმა შვილებმა ჩემი რჯული და ჩემს სამართალს არ გაჰყვებიან, "},
	{32, "32 თუ ჩემს წესდებებს დაარღვევენ და ჩემს მცნებებს არ დაიცავენ, "},
	{33, "33 კვერთხით მოვკითხავ მათ დანაშაულს და გვემით - შეცოდებას. "},
	{34, "34 მაგრამ ჩემს წყალობას არ მოვუშლი მას და არ გავაცრუებ ჩემს ჭეშმარიტებას. "},
	{35, "35 არ შევბღალავ ჩემს აღთქმას და არ შევცვლი, რაც აღმოხდა ჩემს ბაგეებს. "},
	{36, "36 ერთხელ შევფიცე ჩემი სიწმიდით, განა ვეცრუები დავითს? "},
	{37, "37 მისი ნაშიერი მარადჟამს იქნება და მისი ტახტი, ვითარცა მზე, ჩემს პირისპირ. "},
	{38, "38 მკვიდრი იქნება, მთვარესავით, უკუნისამდე, და ჭეშმარიტი მოწმე ზეცაში. სელა. "},
	{39, "39 მაგრამ მიატოვე და შეიზიზღე, განრისხდი შენს ცხებულზე. "},
	{40, "40 უგულებელყავ აღთქმა შენს მორჩილთან, მიწას დაანარცხე გვირგვინი მისი. "},
	{41, "41 მოშალე ყველა ზღუდენი მისნი, ნანგრევებად აქციე სიმაგრენი მისნი. "},
	{42, "42 გაძარცვეს იგი გამვლელ-გამომვლელებმა, მეზობლების დასაცინი გახდა. "},
	{43, "43 მაღლა ასწიე მის მოშუღართა მარჯვენა, გაახარე ყველა მისი მტერი. "},
	{44, "44 თანაც დააჩლუნგე მისი მახვილი და არ შეეწიე ომში. "},
	{45, "45 გააცამტვერე სიწმიდე მისი და მისი ტახტი მიწასთან გაასწორე. "},
	{46, "46 შეამცირე დღენი მისი სიჭაბუკისა, და სირცხვილით შემოსე იგი. სელა. "},
	{47, "47 როდემდე დაგვემალები, უფალო, განუწყვეტლივ, ააგზნებ ცეცხლივით შენს მრისხანებას? "},
	{48, "48 გაიხსენე, რა არის ჩემი წუთისოფელი; რისთვის შეჰქმენი ფუჭად ყოველი ძე ადამისა? "},
	{49, "49 ვის არის ვაჟკაცი - იცოცხლოს და არ იხილოს სიკვდილი, გადაარჩინოს თავისი სული ჯოჯოხეთის ხელიდან? სელა. "},
	{50, "50 სად არის შენი ადრინდელი წყალობა, უფალო, დავითს რომ შეჰფიცე შენი ჭეშმარიტებით? "},
	{51, "51 გაიხსენე, უფალო, დამცირება შენს მორჩილთა, უბით რომ ვატარებ ყველა ძლიერი ხალხისაგან. "},
	{52, "52 როგორ ლანძღავენ შენი მტრები, უფალო, როგორ ლანძღავენ შენი ცხებულის კვალს. "},
	{53, "53 კურთხეულ არს უფალი უკუნისამდე. ამინ, ამინ! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view89() {
struct ka89 poems[] = {
	{1, "1 ლოცვა მოსესი, ღვთისკაცისა. უფალო! თავშესაფარი იყავ ჩვენთვის თაობიდან თაობამდე. "},
	{2, "2 ვიდრე მთები დაიბადებოდნენ და შექმნიდი დედამიწასა და სამყაროს, და უკუნითი უკუნისამდე შენა ხარ ღმერთი. "},
	{3, "3 კაცს დააბრუნებ ხრწნადობისათვის და ეტყვი: დაბრუნდით, ძენო ადამისანო! "},
	{4, "4 რადგან ათასი წელი შენს თვალში, ვითარცა გუშინდელი დღე, რომ გადაიარა, და მესამედი ღამისა. "},
	{5, "5 ღვართქაფივით გააქანებ მათ, ძალი მათი დილდილობით ბალახივით შეიცვლება: "},
	{6, "6 დილას ჰყვავის და ფერს იცვლის, საღამოს ჭკნება და ხმება. "},
	{7, "7 რადგანაც გავქრით შენი რისხვით და შენი გულისწყრომით შევძრწუნდით. "},
	{8, "8 ჩვენი დანაშაულებანი წინ დაიდე, ჩვენი საიდუმლო - შენი სახის შუქის წინ. "},
	{9, "9 რადგან ყველა ჩვენი დღე გაილია შენი რისხვით, ვკარგავთ ჩვენს წლებს ბგერის უსწრაფესად. "},
	{10, "10 ჩვენს წელთა რიცხვი სამოცდაათი წელიწადია, ხოლო ჯანმაგრობის დროს - ოთხმოცი წელიწადი; და ამათგან უმეტესი ჯაფა და უსამართლობაა, რადგანაც სწრაფად გაივლიან და ჩვენ მივფრინავთ. "},
	{11, "11 ვინ იცის შენი რისხვის ძალა და შენი შიშის კვალობაზე შენი გააფთრება? "},
	{12, "12 ჩვენი დღეების დათვლა გვასწავლე, რათა შევიძინოთ სიბრძნე გულისა. "},
	{13, "13 მობრუნდი, უფალო! ვიდრემდე? და ნუგეში ეცი შენს მორჩილებს. "},
	{14, "14 გაგვაძღე გარიჟრაჟზე შენი წყალობით, და ვიხაროთ და ვილხინოთ ყოველთა დღეთა ჩვენთა. "},
	{15, "15 გაგვამხიარულე იმ დღეთა წილ, რომ გვტანჯავდი, იმ წელთა წილ, გაჭირვება რომ ვნახეთ. "},
	{16, "16 იხილონ შენმა მორჩილებმა შენი საქმენი და შენი ბრწყინვალება - მათმა შვილებმა. "},
	{17, "17 და იყოს კეთილმოსურნეობა უფლისა, ჩვენი ღმერთისა, ჩვენდამი, და საქმე ჩვენი ხელისა წარმართე ჩვენთვის, და საქმე ჩვენი ხელისა წარმართე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view90() {
struct ka90 poems[] = {
	{1, "1 უზენაესის საფარქვეშ დამკვიდრებული ყოვლისშემძლის ჩრდილქვეშ ისვენებს. "},
	{2, "2 ვეტყვი უფალს: ჩემი მფარველი და სიმაგრეა ჩემი ღმერთი, რომელსაც ვესავ. "},
	{3, "3 რადგან ის დაგიხსნის მონადირის ხაფანგიდან, მომსრავი ჭირისაგან. "},
	{4, "4 თავის ფრთებს გადაგაფარებს და მის კალთებქვეშ შეაფარებ თავს; ფარი და ბურჯია მისი ჭეშმარიტება. "},
	{5, "5 ნუ შეგაშინებს საშინელება ღამისა, ისარი დღისით გაფრენილი. "},
	{6, "6 შავი ჭირი - ბნელში მოარული, სენი - შუადღის მძარცველი. "},
	{7, "7 დაეცემა შენს გვერდით ათასი და ათი ათასი შენს მარჯვნივ, შენ კი არ მოგეკარება. "},
	{8, "8 ოღონდ შენი თვალებით შეხედე და დაინახავ მისაგებელს ბოროტეულთა. "},
	{9, "9 რადგან, ღმერთო, შენ ხარ ჩემი თავშესაფარი, შენს საცხოვრისად აირჩიე უზენაესი. "},
	{10, "10 არ შეგემთხვევა სიავე და წყლული ვერ მიეკარება შენს კარავს. "},
	{11, "11 რადგან თავის ანგელოზებს უბრძანა შენზე - დაგიცვან ყველა შენს გზაზე. "},
	{12, "12 ხელში აყვანილს გატარებენ, რომ ფეხი არ წამოჰკრა ქვაზე. "},
	{13, "13 ლომსა და უნასს ფეხს დაადგამ, ლომის ბოკვერს და ურჩხულს გაქელავ. "},
	{14, "14 რაკი მისურვა, გადავარჩენ მას, დავიფარავ მას, რადგან იცნო ჩემი სახელი. "},
	{15, "15 მომიხმობს მე და ვუპასუხებ, მასთან ვარ გასაჭირში; გამოვიხსნი და ვასახელებ. "},
	{16, "16 დღეთა ხანგრძლივობით გავაძღებ და შემწეობას მოვუვლენ ჩემსას. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view91() {
struct ka91 poems[] = {
	{1, "1 ფსალმუნი. გალობა შაბათის დღისათვის.  "},
	{2, "2 კარგია ვადიდოთ უფალი და გუგალობოთ შენს სახელს, უზენაესო! "},
	{3, "3 გაუწყოთ დილდილობით შენი წყალობა და ჭეშმარიტება შენი ღამღამობით. "},
	{4, "4 ათსიმიანზე და ჩანგზე, გალობით - ქნარზე. "},
	{5, "5 რაკი გამამხიარულე, უფალო, შენი ნამოქმედარით, შენთა ხელთა ნასაქმარს ვუგალობებ. "},
	{6, "6 რაოდენ დიდია შენი საქმეები, უფალო, ფრიად ღრმაა შენი ზრახვები. "},
	{7, "7 უგუნური კაცი ვერ შეიცნობს და უმეცარი ვერ გაიგებს ამას, "},
	{8, "8 როცა ბოროტნი აყვავდებიან ბალახივით და აღორძინდება ყველა - მოქმედი სიმრუდისა, რომ დაიღუპონ საუკუნოდ. "},
	{9, "9 ხოლო შენ მაღალი ხარ მარადჟამს, უფალო! "},
	{10, "10 რადგანაც, აგერ, შენი მტრები, უფალო, რადგანაც, აგერ, შენი მტრები იღუპებიან, განიბნევიან ყველანი - სიმრუდის მოქმედნი. "},
	{11, "11 მოამაღლებ რქას ჩემსას მარტორქის რქისებრ, ცხებული ვარ ხასხასა ზეთით. "},
	{12, "12 უჭვრეტს ჩემი თვალი ჩემს მტრებს, ჩემს წინააღმდეგ აღმდგარ ბოროტმოქმედებზე გაიგონებენ ჩემი ყურები. "},
	{13, "13 წმიდანი ფინიკივით გაიფურჩქნება, ლიბანის კედარივით წამოიმართება. "},
	{14, "14 უფლის სახლში დარგულნი, ჩვენი ღმერთის ეზოებში აყვავდებიან; "},
	{15, "15 სიბერეშიც გამოიღებენ ნაყოფს - წვნიანსა და ხასხასას. "},
	{16, "16 რათა განვაცხადო, რომ მართალია უფალი, ჩემი საყრდენი, და არ არის მასში უსამართლობა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view92() {
struct ka92 poems[] = {
	{1, "1 უფალი მეფობს სიდიადით შემოსილი; შეიმოსა უფალი, ძლიერება გარს შემოირტყა; დააფუძნა სამყარო, რომ არ შეირყეს. "},
	{2, "2 გამზადებულია შენი ტახტი დასაბამიდან; მარადიული ხარ შენ. "},
	{3, "3 აიმაღლეს მდინარეებმა, უფალო, აიმაღლეს მდინარეებმა თავიანთი ხმა, აიმაღლებენ მდინარენი თავიანთ ხმაურს. "},
	{4, "4 წყალთა მრავალთა, ზღვის მძლავრ ტალღათა ხმებზე ძლიერია მაღლა უფალი. "},
	{5, "5 მცნებანი შენნი მტკიცეა ფრიად. შენს სახლს შეშვენის სიწმიდე, უფალო, სამარადჟამოდ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view93() {
struct ka93 poems[] = {
	{1, "1 ღმერთო შურისგებისა, უფალო! ღმერთო შურისგებისა, გამოჩნდი. "},
	{2, "2 ამაღლდი, მსაჯულო ქვეყნიერებისა, მიუზღე საზღაური ამპარტავნებს. "},
	{3, "3 ვიდრემდე მოილხენენ, ბოროტნი, უფალო, ვიდრემდე მოილხენენ ბოროტნი? "},
	{4, "4 ვიდრემდე წარმოთქვამენ, ლაპარაკობენ, ტრაბახობენ, ყვებიან სიმრუდის მოქმედნი. "},
	{5, "5 შენს ხალხს, უფალო, ჩაგრავენ და შენს სამემკვიდროს ტანჯავენ. "},
	{6, "6 ქვრივსა და ხიზანს ხოცავენ და ობლებს ღუპავენ. "},
	{7, "7 ამბობენ: ვერ იხილავს უფალი და ვერ გაიგებს ღმერთი იაკობისა. "},
	{8, "8 გონს მოდით, უგუნურნო ერისანო; უმეცარნო, როდის დაჭკვიანდებით? "},
	{9, "9 დამნერგავი ყურისა განა ვერ მოისმენს? თუ თვალის შემქმნელი ვერ დაინახავს? "},
	{10, "10 ხალხთა განმრიგე განა ვერ ამხილებს - ის, ვინც ასწავლის ადამიანს ჭკუას? "},
	{11, "11 უფალმა იცის ზრახვანი კაცისა, რადგან ამაოა ისინი. "},
	{12, "12 ნეტარია კაცი, რომელსაც დასჯი, უფალო, და შენს რჯულს ასწავლი. "},
	{13, "13 რათა დაასვენო ავი დღეებისგან, ვიდრე ბოროტს ორმო გაეთხრებოდეს. "},
	{14, "14 რადგან არ მოიშორებს უფალი თავის ხალხს და თავის სამემკვიდრეოს არ მიატოვებს. "},
	{15, "15 რადგან სიმართლესთან დაბრუნდება სამართალი და მის შემდეგ ყველა გულმართალი. "},
	{16, "16 ვინ აღუდგება ჩემს გამო ბოროტებას? ვინ ამომიდგება სიმრუდის მოქმედთა წინააღმდეგ? "},
	{17, "17 უფალი რომ არ ყოფილიყო ჩემი შემწე, ლამის დასახლდა ჩემი სული მდუმარებაში. "},
	{18, "18 თუ ვთქვი: მომიცურდა ფეხი, შენი წყალობა, უფალო, გამამაგრებს. "},
	{19, "19 როცა ფიქრები მომიმრავლდება გულში, შენი ნუგეში აამებს ჩემს სულს. "},
	{20, "20 ნუთუ გაგიტოლდება ტახტი უკუღმართთა, უსამართლობას რომ სჩადიან შენი კანონის საწინააღმდეგოდ? "},
	{21, "21 გაილაშქრებენ წმიდანის სულზე და წმიდა სისხლს ბრალში გახვევენ. "},
	{22, "22 იყო უფალი ჩემი თავშესაფარი და ღმერთი ჩემი - ბურჯი ჩემი ციხე-სიმაგრისა. "},
	{23, "23 მიაგებს მათ თავიანთ უსამართლობას და თავიანთი სიავით მოსპობს მათ, მოსპობს მათ უფალი, ღმერთი ჩვენი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view94() {
struct ka94 poems[] = {
	{1, "1 მოდით, ვუგალობოთ უფალს, შევღაღადოთ ჩვენი ხსნის ბურჯს. "},
	{2, "2 სამადლობელით წარვდგეთ მის პირისპირ და სიმღერებით შევღაღადოთ მას. "},
	{3, "3 რადგან უფალი არის დიდი ღმერთი და მეფე - ყველა ღვთაებაზე აღმატებული. "},
	{4, "4 რადგან მის ხელთაა სიღრმენი მიწისა და მთების ძლიერება მისია. "},
	{5, "5 რადგან მისია ზღვა - მან შეჰქმნა იგი და ხმელეთი მის ხელთა ქმნილებაა. "},
	{6, "6 მოდით, თაყვანი ვცეთ და მოვიხაროთ, მუხლი მოვიდრიკოთ ჩვენი შემქმნელი უფლის წინაშე. "},
	{7, "7 რადგან ის ჩვენი ღმერთია, ჩვენ კი ხალხი მისი სამწყოსი და ცხვარი მისი ხელქვეითი; ო, დღეს რომ მოგესმინათ მისი ხმა: "},
	{8, "8 ნუ გაისასტიკებთ თქვენს გულებს, ვითარცა მერიბაში, როგორც გამოცდის დღეს უდაბნოში; "},
	{9, "9 რომ გამომცადეს თქვენმა მამებმა, გამომცადეს და იხილეს ჩემი ნამოქმედარი. "},
	{10, "10 ორმოც წელიწადს მომაბეზრა თავი იმ თაობამ და ვთქვი: მცდარი გულის ხალხია ისინი და არ იციან მათ ჩემი გზები. "},
	{11, "11 ამიტომ დავიფიცე ჩემი მრისხანების ჟამს, რომ ვერ შევლენ ჩემს სავანეში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view95() {
struct ka95 poems[] = {
	{1, "1 უგალობეთ უფალს გალობა ახალი, უგალობე უფალს, მთელო ქვეყნიერებავ! "},
	{2, "2 უგალობეთ უფალს, ადიდეთ მისი სახელი, იმახარობლეთ დღითიდღე ხსნა მისმიერი. "},
	{3, "3 მოუთხრეთ ხალხებს მისი ღირსება, ყოველ ერს მისი სასწაულები. "},
	{4, "4 რადგან დიდია უფალი და ღირსსაქებარი მეტად, ყველა ღმერთებზე საშიშია ის. "},
	{5, "5 რადგან ხალხთა ყველა ღმერთი კერპებია, ხოლო უფალმა შეჰქმნა ცანი. "},
	{6, "6 მშვენება და ბრწყინვალებაა მის წინაშე, სიძლიერე და მომხიბლაობა - მის ტაძარში. "},
	{7, "7 შესწირეთ უფალს, ტომებო ხალხთა, შესწირეთ უფალს ქება და დიდება. "},
	{8, "8 შესწირეთ უფალს ქება მისი სახელისა, წაუღეთ ძღვენი და მიდით მის ეზოებში. "},
	{9, "9 თაყვანი ეცით უფალს მოწიწებით; ათრთოლდი მის წინაშე, მთელო ქვეყნიერებავ! "},
	{10, "10 უთხარით ხალხებს: უფალი მეფობს! ამიტომ მტკიცეა სამყარო, არ შეირყევა. ის განიკითხავს ხალხებს სისწორით. "},
	{11, "11 გამხიარულდებიან ცანი და მოილხენს ქვეყანა, იხმაურებს ზღვა და სავსება მისი. "},
	{12, "12 გაიხარებს ველი და ყოველი, რაც მასზეა, მაშინ იზეიმებენ ყოველნი ხენი ტევრისანი. "},
	{13, "13 უფლის წინაშე, რადგანაც მოვა, ქვეყნიერების განსასჯელად; განსჯის სამყაროს სიმართლით და ხალხებს - თვისი ჭეშმარიტებით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view96() {
struct ka96 poems[] = {
	{1, "1 უფალი მეფობს, ილხინოს ქვეყნიერებამ; გაიხარონ უამრავმა კუნძულებმა. "},
	{2, "2 ღრუბელი და ნისლია მის ირგვლივ; სიმართლით და განსჯით არის წარმართული მისი ტახტი. "},
	{3, "3 ცეცხლი იარება მის წინაშე და ედება ირგვლივ მის მტრებს. "},
	{4, "4 გაანათებენ მისი ელვები სამყაროს, ნახავს და შეშინდება ქვეყანა. "},
	{5, "5 მთები ცვილივით დადნებიან უფლის პირისაგან, მთელი ქვეყნიერების უფლის პირისაგან. "},
	{6, "6 გამოაცხადეს ცებმა სიმართლე მისი და ყველა ხალხმა იხილა დიდება მისი. "},
	{7, "7 შერცხვება ყველა, ვინც ქანდაკებას ემსახურება, ვინც ტრაბახობს კერპებით; თაყვანი ეცით მას, ყოველნო ანგელოზნო. "},
	{8, "8 მოისმენს და გაიხარებს სიონი და ილხენენ იუდას ასულები შენთა სამართალთათვის, უფალო! "},
	{9, "9 რადგან შენ, უფალო, უმაღლესი ხარ მთელს ქვეყნიერებაზე, მეტისმეტად აღზევებული ყველა ღმერთებზე. "},
	{10, "10 უფლის მოყვარულნო, შეიძურიეთ ბოროტება; ის იცავს მის წმიდათა სულებს, ბოროტთა ხელიდან იხსნის მათ. "},
	{11, "11 შუქი იღვრება წმიდისათვის და გულმართალთათვის - მხიარულება. "},
	{12, "12 იმხიარულეთ, წმიდანებო, უფლის მიმართ და ადიდეთ მისი წმიდა ტაძრის სახსენებელი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view97() {
struct ka97 poems[] = {
	{1, "1 ფსალმუნი. უგალობეთ უფალს ახალი გალობა, რადგან სასწაულები მოიმოქმედა; იხსნა იგი მისმა მარჯვენამ და მისმა წმიდა მკლავმა. "},
	{2, "2 განაცხადა უფალმა ხსნა მისმიერი, ხალხთა თვალწინ გადაშალა მისი სიმართლე. "},
	{3, "3 გაუხსენა წყალობა და ჭეშმარიტება თვისი ისრაელის ხალხს; ნახა დედამიწის ყველა კუთხემ შველა ჩვენი ღმერთისა. "},
	{4, "4 შეჰღაღადეთ უფალს, მთელო ქვეყნიერებავ! შემოსძახეთ და აქეთ და უგალობეთ. "},
	{5, "5 უგალობეთ უფალს ქნარით, ქნარით და საგალობლის ხმით. "},
	{6, "6 რქით და ბუკის ხმით შეჰღაღადეთ უფალს მეფის წინაშე. "},
	{7, "7 ახმაურდეს ზღვა და მისი სავსება, მსოფლიო და მისი მკვიდრნი. "},
	{8, "8 მდინარეებმა ტაში დაუკრან, მთებმა ერთად იმხიარულონ. "},
	{9, "9 უფლის წინაშე, რადგანაც მოვა ქვეყნიერების განსასჯელად; განიკითხავს მსოფლიოს სიმართლით და ხალხებს სისწორით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view98() {
struct ka98 poems[] = {
	{1, "1 უფალი მეფობს - ათრთოლდნენ ხალხები; ქერუბიმებზე მჯდომო, შესძარ ქვეყანა. "},
	{2, "2 უფალი დიდია სიონში და მაღალი ყველა ხალხზე. "},
	{3, "3 განადიდებენ შენს სახელს, დიდსა და საშიშს, წმიდაა იგი. "},
	{4, "4 და სიძლიერეს მეფისას სამართალი უყვარს; შენ დაამკვიდრე სისწორე; სამართალი და სიმართლე შენ სრულჰყავი იაკობში. "},
	{5, "5 აღამაღლეთ უფალი ღმერთი ჩვენი და თაყვანი ეცით მის ფეხთა საყრდენს - წმიდაა იგი. "},
	{6, "6 მოსე და აარონი მის მღვდელთა შორის და სამუელი მისი სახელის მხმობელთა შორის - მოუხმობენ უფალს და ის უპასუხებს მათ. "},
	{7, "7 ღრუბლის სვეტიდან ელაპარაკა მათ; დაიცვეს მისი მითითებანი და წესდება, მათთვის მიცემული. "},
	{8, "8 უფალო, ღმერთო ჩვენო! შენ უპასუხებდი მათ; მიმცევებელი ღმერთი იყავი მათთვის და შურის მაძიებელი მათი ნამოქმედარისათვის. "},
	{9, "9 აღამაღლეთ უფალი, ღმერთი ჩვენი და თაყვანი ეცით მის წმიდა მთას, რადგან წმიდაა უფალი, ღმერთი ჩვენი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view99() {
struct ka99 poems[] = {
	{1, "1 ფსალმუნი სახოტბო. შეჰღაღადე უფალს, მთელო ქვეყნიერებავ! "},
	{2, "2 ემსახურეთ უფალს სიხარულით, მიდით მის წინაშე სიმღერით!"},
	{3, "3 უწყოდეთ, რომ უფალია ღმერთი, მან შეგვქმნა ჩვენ და მისთვის ვართ ჩვენ - ხალხი მისი და ცხვარი, სამწყსო მისი. "},
	{4, "4 შედით მის კარიბჭეებში ხოტბის შესხმით, მის ეზოებში - ქება-დიდებით; მადლობა შესწირეთ მას, ადიდეთ სახელი მისი. "},
	{5, "5 რადგან კარგია უფალი, საუკუნოა წყალობა მისი; და თაობიდან თაობამდე - ჭეშმარიტება მისი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view100() {
struct ka100 poems[] = {
	{1, "1 დავითის ფსალმუნი. წყალობასა და სამართალს ვიმღერებ; შენ გიგალობებ, უფალო. "},
	{2, "2 ვიფიქრებ გზაზე უბიწოთა: როდის მოხვალ ჩემთან? ვივლი ჩემი გულის უბიწოებით ჩემს სახლში. "},
	{3, "3 არ მივიტან ჩემს თვალთან უკეთურ საგანს; დანაშაულებრივი საქმე მოვიძულე, არ მომეკარება. "},
	{4, "4 გული მრუდე შორს იყოს ჩემგან, ბოროტს არ ვცნობდე. "},
	{5, "5 თვისი მოყვასის ფარულად მაბეზღარს ამოვწყვეტ, ამპარტავანს და გულგაუმაძღარს ვერ ავიტან. "},
	{6, "6 თვალს მივადევნებ მართლებს ქვეყნისას, რომ დასხდნენ ჩემთან; ვინც უბიწოების გზით იარება, ის მემსახურება მე. "},
	{7, "7 ვერ დამკვიდრდება ჩემს სახლში სიყალბის მქნელი; ტყუილების მოლაპარაკე ვერ დაეფუძნება ჩემს თვალწინ. "},
	{8, "8 დილდილობით ამოვწყვეტ ყველა ბოროტს ქვეყნისას, რომ გადაშენდეს უფლის ქალაქიდან ყოველი მოქმედი სიმრუდისა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view101() {
struct ka101 poems[] = {
	{1, "1 ლოცვა გლახაკისა, ოდეს იტანჯება და უფლის წინაშე გადმოღვრის თავის გულისნადებს.  "},
	{2, "2 უფალო, ისმინე ჩემი ლოცვა და ჩემი ღაღადისი შენთან მოვიდეს. "},
	{3, "3 ნუ დაფარავ შენს სახეს ჩემგან, ჩემი გაჭირვების ჟამს მომაპყარ ყური; რომელ დღესაც მოგიხმობ, მსწრაფლ მიპასუხე. "},
	{4, "4 რადგან გაქრნენ კვამლივით ჩემი დღეები და ჩემი ძვლები დაიბუგა, როგორც კოცონზე. "},
	{5, "5 დაჭკნა ბალახივით და გახმა ჩემი გული, რადგან დამავიწყდა ჩემი პურის ჭამა. "},
	{6, "6 ჩემი კვნესის ხმისაგან მიჰკვრია ჩემი ძვლები ჩემს ხორცს. "},
	{7, "7 ვემსგავსე ვარხვსა უდაბნოსას, გავხდი ვითარცა ბუკიოტი ნანაგრევებში. "},
	{8, "8 უძილო ვიქმენ და ვზივარ, ვითარცა ეული ჩიტი სახურავზე. "},
	{9, "9 ყოველდღე მლანძღავენ ჩემი მტრები, ჩემი განმქიქებელნი ჩემს სახელს საწყევრად აქცევენ. "},
	{10, "10 რადგან ნაცარი პურივით ვჭამე და ჩემი სასმელი ცრემლით შევაზავე; "},
	{11, "11 შენი რისხვისა და გულისწყრომის გამო, რომ ამიყვანე და დამანარცხე. "},
	{12, "12 ჩემი დღეები გადახრილი ჩრდილივითაა და მე ბალახივით ვხმები. "},
	{13, "13 შენ კი უფალო, საუკუნოდ იარსებებ და შენი სახსენებელი თაობიდან თაობამდე იქნება. "},
	{14, "14 შენ კი აღსდექ, შეიწყალე სიონი, რადგან ჟამია მისი შეწყალებისა, რადგან მოვიდა დრო. "},
	{15, "15 რადგან ისურვეს შენმა მორჩილებმა მისი ქვები და მისი მტვერი ენანებათ. "},
	{16, "16 შეეშინდებათ ხალხებს უფლის სახელისა და ყველა მეფეს ამქვეყნიერს - შენი დიდებისა. "},
	{17, "17 რადგან აღაშენებს უფალი სიონს, გამოცხადდება თვისი ღირსებით. "},
	{18, "18 მოხედავს ლოცვას გულმოდრეკილთა და არ დაამცირებს მათ ლოცვას. "},
	{19, "19 დაიწერება ეს მომავალი თაობისათვის და ხალხი, რომელიც გაჩნდება, ადიდებს უფალს. "},
	{20, "20 რადგან გადმოიხედა თავისი წმიდა სიმაღლიდან უფალმა, ციდან ქვეყანა მოიხილა. "},
	{21, "21 რომ მოესმინა კვნესა პატიმრისა, გაეთავისუფლებინა სიკვდილის ძენი. "},
	{22, "22 რათა აუწყონ სიონზე სახელი უფლისა და ქება მისი - იერუსალიმში. "},
	{23, "23 როცა შეგროვდებიან ხალხები ერთად და სამეფონი უფლის სამსახურებლად. "},
	{24, "24 გაასავათა გზაში ჩემი ძალა, შეამცირა დღენი ჩემნი. "},
	{25, "25 ვეტყვი: ღმერთო ჩემო! ნუ მომტაცებ დღეებს ნახევარგზაზე; თაობიდან თაობამდეა შენი წლები; "},
	{26, "26 უწინ დედამიწა დააფუძნე და შენთა ხელთა ნასაქმარია ზეცა. "},
	{27, "27 ისინი დაიღუპებიან, შენ კი იარსებებ; ყველანი ტანსაცმელივით დაძველდებიან; სამოსელივით გამოიცვლი მათ და შეიცვლებიან. "},
	{28, "28 შენ კი იგივე ხარ და შენი წლები არ დაილევიან. "},
	{29, "29 ძენი მორჩილთა შენთა დამკვიდრდებიან და შთამომავალი მათი შენს წინაშე წარიმართება. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view102() {
struct ka102 poems[] = {
	{1, "1 დავითისა. ადიდე, სულო ჩემო უფალი და მთელო შიგნეულობავ ჩემო - მისი წმიდა სახელი. "},
	{2, "2 ადიდე, სულო ჩემო, უფალი და ნუ დაივიწყებ მის ქველმოქმედებას. "},
	{3, "3 ის არის შემნდობი ყველა შენი ბრალისა, მკურნალი ყველა შენი სნეულებისა. "},
	{4, "4 საფლავიდან დამხსნელი შენი სიცოცხლისა, შენი გვირგვინდამდგმელი წყალობით და შებრალებით; "},
	{5, "5 სიკეთით ამვსები შენი გულისთქმისა, არწივის მსგავსად განმაახლებელი შენი სიჭაბუკისა. "},
	{6, "6 სიმართლეს იქმს უფალი და სამართალს ყველა ჩაგრულისათვის. "},
	{7, "7 აუწყა თავისი გზები მოსეს, ისრაელიანებს - თავისი საქმენი. "},
	{8, "8 შემბრალე და ლმობიერია უფალი, სულგრძელი და მრავალმოწყალე. "},
	{9, "9 არც სამუდამოდ იდავებს და არც საუკუნოდ გაწყრება. "},
	{10, "10 არც ჩვენი ცოდვების მიხედვით მოგვაგო და არც ჩვენი ბრალისამებრ გადაგვიხადა. "},
	{11, "11 რადგან, რაოდენ ცა მაღალია დედამიწაზე, მისი წყალობაც ძლიერია მის მოშიშთა მიმართ. "},
	{12, "12 როგორც დაცილებულია აღმოსავლეთი დასავლეთისგან, ისე გაგვაშორა მან დანაშაული ჩვენი. "},
	{13, "13 როგორც მამა შეიწყნარებს შვილებს, შეიწყნარა უფალმა მოშიშნი მისნი. "},
	{14, "14 რადგან უწყის აგებულება ჩვენი, ახსოვს, რომ მტვერი ვართ ჩვენ. "},
	{15, "15 ბალახივით არის დღენი კაცისა, ველის ყვავილივით აყვავდება. "},
	{16, "16 ქარი გადაუქროლებს და - აღარ არის და ვეღარავინ იცნობს მის ნაალაგევს. "},
	{17, "17 ხოლო წყალობა უფლისა უკუნისამდეა მის მოშიშთა მიმართ და მისი სიმართლე - შვილთაშვილებზე, "},
	{18, "18 ვინც იცავს მის აღთქმას და ვისაც ახსოვს მისი მცნებანი და ასრულებს კიდეც. "},
	{19, "19 უფალმა ცაში დაიდგა ტახტი თვისი და მეუფება მისი ფლობს ყოველივეს. "},
	{20, "20 ადიდეთ უფალი, ანგელოზნო მისნო; ძალით ძლიერნი, მისი სიტყვის შემსრულებელნი, ემორჩილებიან მის ნათქვამს. "},
	{21, "21 ადიდეთ უფალი, ყოველნო სპანო მისნო, მსახურნო მისნო, მისი ნების შემსრულებელნო. "},
	{22, "22 ადიდეთ უფალი, ყოველი მისი ნამოქმედარი, მისი მეუფების ყველა ადგილას. ადიდე, სულო ჩემო, უფალი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view103() {
struct ka103 poems[] = {
	{1, "1 აკურთხე, სულო ჩემო, უფალი; უფალო, ღმერთო ჩემო, დიდი ხარ ფრიად, სიმშვენიერით და ბრწყინვალებით ხარ შემოსილი. "},
	{2, "2 გაკრავს სინათლე სამოსელივით, განგიფენია ცა ფარდასავით. "},
	{3, "3 წყლებზე ააგო ზესართულები, მისი ღრუბლები გაიხადა ეტლად თავისთვის, მიმოდიოდა ქარის ფრთებზე. "},
	{4, "4 რომელმან შეჰქმნა ანგელოზნი თვისნი ქარებად, მსახურნი თვისნი - ალად ცეცხლისა. "},
	{5, "5 დააფუძნა დედამიწა თავის საძირკვლებზე, არ მოირყევა უკუნისამდე. "},
	{6, "6 უფსკრულით, როგორც სამოსელით, დაფარე იგი; მთებზე დგას წყლები. "},
	{7, "7 შენი შერისხვით მიიქცევიან, შენი ქუხილის ხმაზე ილტვიან. "},
	{8, "8 ადიან მთებზე, ჩადიან ველებზე, იმ ადგილას, სადაც დაუფუძნე. "},
	{9, "9 საზღვარი დადე - ვერ გადალახავენ, ვერც დაბრუდებიან დედამიწის დასაფარავად. "},
	{10, "10 გაუშვი წყაროები ხევებში, რომ მთებს შორის იდინონ. "},
	{11, "11 დალიოს ყოველმა მხეცმა ველისამ, მოიკლან კანჯრებმა წყურვილი. "},
	{12, "12 მათზე ცის ფრინველნი დამკვიდრებულან, რტოთა შიგნიდან გამოსცემენ ხმას. "},
	{13, "13 რწყავს მთებს თვისი ზესართულებიდან, შენთა საქმეთა ნაყოფით ძღება ქვეყანა. "},
	{14, "14 აღმოაცენებ ბალახს პირუტყვისათვის და მცენარეულობას - ადამიანის სამსახურებლად, რათა გამოიღოს პური მიწისაგან. "},
	{15, "15 და ღვინომ გაამხიარულოს გული კაცისა, გააბრწყინოს სახე საცხებელზე მეტად და პურმა შეამტკიცოს გული კაცისა. "},
	{16, "16 გაძღნენ ხენი უფლისა და კედრები ლიბანისა, მან რომ დანერგა. "},
	{17, "17 რომ იქ ჩიტებმა დაიდონ ბუდე: კვიპაროსები ყარყატის სახლია. "},
	{18, "18 მთანი მაღალნი - ქურციკთათვის, კლდენი - კურდღელთა თავშესაფარი. "},
	{19, "19 შეჰქმნა მთვარე ჟამთათვის, მზემ იცის თავისი დასავალი. "},
	{20, "20 განავრცობ ბნელს და იქნება ღამე, მაშინ ამოძრავდებიან ყოველნი ნადირნი ტყისა. "},
	{21, "21 ბოკვერნი ლომისა ბრდღვინავენ ნადავლისათვის და მოითხოვენ ღმერთისაგან თავიანთ საჭმელს. "},
	{22, "22 ამობრწყინდება მზე - შეგროვდებიან და თავიანთ ბუნაგებში დაწვებიან. "},
	{23, "23 გავა ადამიანი, რათა იშრომოს და იმუშაკოს მწუხრის ჟამამდე. "},
	{24, "24 რაოდენ მრავალია საქმენი შენი, უფალო! ყოველივე სიბრძნით შეგიქმნია, სავსეა დედამიწა შენი მონაგარით. "},
	{25, "25 ეს ზღვაა, დიდი და უკიდეგანო, იქ ქვეწარმავალია ურიცხვი, მხეცნი - მცირენი დიდებთან ერთად. "},
	{26, "26 იქ ხომალდები დადიან, ლევიათანი - ეს შენ შეჰქმენი მასში გასართობად. "},
	{27, "27 ყველა მათგანი შენგან მოელის საზრდოს მიცემას თავ-თავის დროზე. "},
	{28, "28 მისცემ მათ - აიღებენ, გახსნი შენს ხელს - გაძღებიან სიკეთით. "},
	{29, "29 დაფარავ შენს სახეს - შეძრწუნდებიან, სულს წაართმევ - დაიხოცებაან და თავიანთი მტვერს დაუბრუნდებიან. "},
	{30, "30 გაუშვებ შენს სულს - წარმოიქმნებიან და განაახლებ პირს მიწისას. "},
	{31, "31 იყოს დიდება უფლისა უკუნისამდე, იხარებდეს უფალი თავისი ნამოქმედარით. "},
	{32, "32 დახედავს დედამიწას და ის აცახცახდება, შეეხება მთებს და აკვამლდებიან. "},
	{33, "33 ვუგალობებ უფალს ჩემი სიცოცხლის მანძილზე, ვუგალობებ ჩემს ღმერთს, ვიდრე ვარსებობ. "},
	{34, "34 ეამოს მას ჩემი გალობა; მე გავიხარებ უფალში. "},
	{35, "35 გაქრებიან ცოდვილნი ქვეყნიერებიდან და ბოროტნი აღარ იქნებიან; აკურთხე, სულო ჩემო, უფალი! ადიდეთ უფალი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view104() {
struct ka104 poems[] = {
	{1, "1 ადიდეთ უფალი, მოუხმეთ მის სახელს, აუწყეთ ხალხებს საქმენი მისნი. "},
	{2, "2 აქეთ იგი, უგალობეთ მას, ილაპარაკეთ ყველა მის სასწაულზე. "},
	{3, "3 განდიდდით მისი წმიდა სახელით, გამხიარულდეს გული უფლის მაძიებელთა. "},
	{4, "4 ეძიეთ უფალი და ძლიერება მისი, ეძიეთ პირი მისი მარადის. "},
	{5, "5 გაიხსენეთ მისი ნამოქმედარი სასწაულები, საოცრებანი და სამართალნი მისთა ბაგეთა. "},
	{6, "6 შთამომავალო აბრაამისა, მისი მორჩილისა, ძენო იაკობისა, რჩეულნო მისნო. "},
	{7, "7 ის არის უფალი ღმერთი ჩვენი, მთელ ქვეყნიერებაზეა სამართალნი მისნი. "},
	{8, "8 ახსოვს მარადის აღთქმა თავისი, სიტყვა, რომ დაადგინა ათას თაობამდე, "},
	{9, "9 რომელიც დაუდო აბრაამს, და თავისი ფიცი ისაკთან. "},
	{10, "10 დაუდგინა იაკობს იგი წესად და ისრაელს - სამარადჟამო აღთქმად. "},
	{11, "11 უთხრა: შენ მოგცემ ქანაანის ქვეყანას წილად თქვენი მემკვიდრეობისა. "},
	{12, "12 როცა ისინი თითზე ჩამოსათვლელნი იყვნენ, ცოტანი შეხიზნულები იქ, "},
	{13, "13 იარებოდნენ ერთი ხალხიდან მეორესთან, სამეფოდან - სხვა ერთან. "},
	{14, "14 არავის ანებებდა მათს დაჩაგვრას და ამუნათებდა მათთვის მეფეებს: "},
	{15, "15 არ შეეხოთ ჩემს ცხებულებს და ჩემს წინასწარმეტყველებს არ უბოროტოთ. "},
	{16, "16 და მოუხმო შიმშილს დედამიწაზე და ყოველი სახსარი პურისა შემუსრა. "},
	{17, "17 გაგზავნა მათ წინ კაცი; მონად გაიყიდა იოსები. "},
	{18, "18 გატანჯეს ბორკილებით ფეხნი მისნი, რკინა მისწვდა მის სულს. "},
	{19, "19 ვიდრე ასრულდებოდა ნათქვამი მისი, უფლის სიტყვამ გამობრძმედა იგი. "},
	{20, "20 გაგზავნა მეფემ და გაათავისუფლა იგი - გამგებელი ხალხებისა - და გამოიხსნა იგი. "},
	{21, "21 დააყენა თავისი სახლის ბატონად და გამგებელად მთელი თავისი მონაგარისა. "},
	{22, "22 რათა მოქცეოდა მის თავადებს თავისი სურვილისამებრ და განებრძნო მოხუცებულნი მისნი. "},
	{23, "23 და მოვიდა ისრაელი ეგვიპტეში, და გადასახლდა იაკობი ქამის ქვეყანაში. "},
	{24, "24 და გაამრავლა ღმერთმა, მისი ხალხი ფრიად და გააძლიერა მის მტრებზე მეტად. "},
	{25, "25 შეცვალა მათი გული მისი ხალხის შესაძულებლად, მის მორჩილთა მიმართ სივერაგის განსაზრახველად. "},
	{26, "26 გაგზავნა მოსე, მსახური თვისი, აარონი, რომელიც ამოირჩია. "},
	{27, "27 დაამკვიდრეს მათში სიტყვები მისი სასწაულებისა, და საოცრებანი ქამის ქვეყანაში. "},
	{28, "28 მიავლინა წყვდიადი და დააბნელა, და არ გაურჩებულან მის სიტყვაზე, "},
	{29, "29 გადააქცია მათი წყლები სისხლად და დახოცა მათი თევზები. "},
	{30, "30 აავსო მათი ქვეყანა ბაყაყებით, მეფეთა პალატებიც კი. "},
	{31, "31 თქვა და მოვიდნენ მწერები, ტილი მთელ მათ საზღვრებში. "},
	{32, "32 წვიმის მაგიერ სეტყვა წარმოუგზავნა მათ, ალმოდებული ცეცხლი - მათ ქვეყანას. "},
	{33, "33 მოსრა ვაზი მათი და ლეღვი მათი და დალეწა ხეები მათ საზღვრებში. "},
	{34, "34 თქვა და მოვიდა კალია და მგრაგნელი აურაცხელი, "},
	{35, "35 და გადაჭიმეს მთელი ბალახი მათ ქვეყანაში, და გადაჭიმეს მთელი ნაყოფი მათი მიწისა. "},
	{36, "36 და მოსრა ყოველი პირმშო მათ ქვეყანაში, დასაბამი მთელი მათი ძალისა. "},
	{37, "37 და გამოიყვანა ისინი ვერცხლით და ოქროთი, და მათ ტომებში არავინ იყო უძლური. "},
	{38, "38 გაუხარდა ეგვიპტეს მათი გამოსვლა, რადგან თავს დაატყდათ მათ შიში. "},
	{39, "39 გადააფარა ღრუბელი საფრად და ცეცხლი - ღამის გასანათებლად. "},
	{40, "40 ითხოვეს და გაუგზავნა მწყერი და ზეციური პურით გააძღო ისინი. "},
	{41, "41 გაკვეთა კლდე და გადმოდინდა წყალი, წავიდა უდაბნოში მდინარედ. "},
	{42, "42 რადგან გაიხსენა თავისი წმიდა სიტყვა თავისი მორჩილის აბრაამის მიმართ. "},
	{43, "43 გამოიყვანა თავისი ხალხი სიხარულით, რჩეულნი თვისნი ზარ-ზეიმით. "},
	{44, "44 მისცა მათ წარმართთა ქვეყნები და ნაჯაფი ერებისა დაიმკვიდრეს მათ. "},
	{45, "45 რათა დაიცვან წესები მისი და მის კანონებს გაუფრთხილდნენ. ადიდეთ უფალი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view105() {
struct ka105 poems[] = {
	{1, "1 ადიდეთ უფალი. ქებით შემოსეთ უფალი, რადგან კეთილია, რადგან მარადიულია წყალობა მისი. "},
	{2, "2 ვის ძალუძს გამოთქვას უფლის სიძლიერე, სასმენელ-ქმნას მისი ქება-დიდება? "},
	{3, "3 ნეტარ არიან სამართლის დამცველნი და სიმართლის მოქმედნი ყოველ ჟამს. "},
	{4, "4 გამიხსენე, უფალო, შენი ხალხისადმი კეთილგანწყობილებისას, მომხედე შენმიერი შეწევნით. "},
	{5, "5 რათა ვიხილო სიკეთე შენთა რჩეულთა, გავიხარო შენი ხალხის სიხარულით, დავიქადო შენს სამკვიდროსთან ერთად. "},
	{6, "6 შევცოდეთ ჩვენს მამებთან ერთად, სიმრუდე და ბოროტება ჩავიდინეთ. "},
	{7, "7 ჩვენმა მამებმა ეგვიპტეში ვერ შეიგნეს შენი სასწაულები, არ გაიხსენეს შენი მრავალი წყალობა და გაგიურჩდნენ ზღვაზე, მეწამულ ზღვაზე. "},
	{8, "8 მაგრამ მან იხსნა თავისი სახელის გულისათვის, რათა გაეგოთ ძლიერება მისი. "},
	{9, "9 და შეუტია მეწამულ ზღვას და დაშრა, და წაიყვანა ისინი უფსკრულებში, როგორც უდაბნოში. "},
	{10, "10 და იხსნა მოძულის ხელიდან და გადაარჩინა მტრის ხელიდან. "},
	{11, "11 წყალმა დაფარა მათი მტრები, ერთი მათგანიც არ გადარჩენილა. "},
	{12, "12 და ირწმუნეს სიტყვანი მისნი, იმღერეს მისი ქება. "},
	{13, "13 აჩქარდნენ, დაივიწყეს საქმენი მისნი, არ დაელოდნენ მის რჩევას. "},
	{14, "14 და აჰყვნენ გულისთქმას უდაბნოში და გამოსცადეს ღმერთი უკაცრიელ ადგილას. "},
	{15, "15 და შეუსრულა თხოვნა მათი და მოუვლინა სიმჭლევე მათ სულებს. "},
	{16, "16 და შური აღეძრათ მოსეს მიმართ ბანაკში, უფლის წმიდანის აარონის მიმართ. "},
	{17, "17 გაიპო მიწა და ჩაყლაპა დათანი, და დაფარა ხროვა აბირამისა. "},
	{18, "18 და მოედო ცეცხლი მათ ხროვას, ალი მოეკიდა ბოროტებს. "},
	{19, "19 გააკეთეს ხბო ხორებთან და თაყვანი სცეს კერპებს. "},
	{20, "20 და გაცვალეს თავიანთი დიდება ბალახის მძოველ ხარის გამოსახულებაში. "},
	{21, "21 დაივიწყეს ღმერთი, თავიანთი მხსნელი, დიდთა მოქმედი ეგვიპტეში. "},
	{22, "22 საოცრებანი ხამის ქვეყანაში, საშინელებანი მეწამულ ზღვაზე. "},
	{23, "23 დათქმული ჰქონდა მათი მოსპობა, რომ მოსე, მისი რჩეული, არ დამდგარიყო ნაპრალთან მის წინაშე, რათა გაებრუნებინა რისხვა მისი, და აღარ მოესრა ისინი. "},
	{24, "24 მათ დაიწუნეს ქვეყანა სასურველი, აღარ ირწმუნეს ნათქვამი მისი. "},
	{25, "25 დრტვინავდნენ თავიანთ ბანაკებში, არ უსმენდნენ უფლის ხმას. "},
	{26, "26 მაშინ ზეაღმართა თავისი ხელი, რომ დაეხოცა ისინი უდაბნოში; "},
	{27, "27 და გაეფანტა მათი ნაშიერი ხალხებში და განებნია ისინი ქვეყნებში. "},
	{28, "28 დაუკავშირდნენ ბაყალ-ფეღორს და ჭამეს მკვდართა შესაწირავი. "},
	{29, "29 განარისხეს თავიანთი მოქმედებით და თავს დაატყდათ მომსრველი სენი. "},
	{30, "30 წამოდგა ფინხასი და ილოცა, და შეჩერდა მომსრველი სენი. "},
	{31, "31 ჩაეთვალა მას მოწყალებად თაობიდან თაობამდე, სამარადჟამოდ. "},
	{32, "32 გააჯავრეს მერიბის წყალზე და დაისაჯა მოსე მათ გამო. "},
	{33, "33 რადგანაც სული გაუმწარეს და გამოთქვა თავისი ბაგეებით. "},
	{34, "34 არ მოსპეს ხალხები, უფალმა რომ უთხრა მათ. "},
	{35, "35 აირივნენ ხალხებში და შეისწავლეს მათი საქმეები. "},
	{36, "36 ემსახურებოდნენ მათ კერპებს, რომლებიც მახედ გადიქცნენ მათთვის. "},
	{37, "37 შესწირეს თავიანთი ძენი და ასულნი ეშმაკებს. "},
	{38, "38 დაღვარეს სისხლი უცოდველი, თავიანთ ძეთა და ასულთა სისხლი, რომელიც შესწირეს ქანაანის კერპებს, და შეირყვნა ქვეყანა სისხლით. "},
	{39, "39 შეიბილწნენ თავიანთი საქმეებით და იმრუშეს თავიანთი მოქმედებით. "},
	{40, "40 მაშინ აღეგზნო რისხვა უფლისა თავის ხალხზე და შესძაგდა მას სამკვიდრო თვისი. "},
	{41, "41 და ხელში ჩაუგდო ისინი ხალხებს და გაბატონდნენ მათზე მოძულენი მათი. "},
	{42, "42 ავიწროებდნენ მათ მტრები და მოიდრიკნენ მათ ხელქვეით. "},
	{43, "43 მრავალგზის იხსნა ისინი, მაგრამ ისინი აბრაზებდნენ საკუთარი ზრახვებით და მდაბლდებოდნენ ბრალით. "},
	{44, "44 იხილა მათი გაჭირვება, როცა მოისმინა მათი ღაღადისი. "},
	{45, "45 გაუხსენა აღთქმა თავისი და ანუგეშა თავისი მრავალმოწყალეობით. "},
	{46, "46 აღვიძებდა მათდამი თანაგრძნობას ყველა მათი დამტყვევებლის წინაშე. "},
	{47, "47 გვიხსენი, უფალო, ღმერთო ჩვენო, და გამოგვკრიბე ხალხთაგან, რათა ვადიდოთ შენი წმიდა სახელი, ვიამაყოთ შენი ქება-დიდებით. "},
	{48, "48 კურთხეულ არს უფალი, ღმერთი ისრაელისა, ამიერიდან და უკუნისამდე! და თქვას მთელმა ხალხმა: ამინ! ადიდეთ უფალი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view106() {
struct ka106 poems[] = {
	{1, "1 ადიდეთ უფალი, რადგან კეთილია, რადგან უკუნისამდეა წყალობა მისი. "},
	{2, "2 იტყვიან დახსნილნი უფლის მიერ, რომელმაც იხსნა ისინი მტრის ხელიდან. "},
	{3, "3 და ქვეყნებიდან გამოკრიბა ისინი - აღმოსავლეთიდან და დასავლეთიდან, ჩრდილოეთიდან და ზღვიდან. "},
	{4, "4 აებნათ უკაცრიელ უდაბნოში გზა, დაბა ვერ ჰპოვეს სამკვიდრებელი. "},
	{5, "5 შიოდათ, სწყუროდათ კიდეც, მათი სული იბინდებოდა. "},
	{6, "6 შეჰღაღადეს უფალს თავიანთი მწუხარების ჟამს და გაჭირვებიდან იხსნა ისინი. "},
	{7, "7 და დააყენა ისინი სწორ გზაზე, რომ წასულიყვნენ სამკვიდრებელი ქალაქისაკენ. "},
	{8, "8 დაე, უქონ უფალს წყალობა მისი და საოცრებანი მისნი ადამის ძეთა მიმართ. "},
	{9, "9 რადგან გააძღო სული მწყურვალი და სული მშიერი აავსო სიკეთით. "},
	{10, "10 მსხდომარენი ბნელში და წყვდიადში, ტყვენი ტანჯვისა და ბორკილისა. "},
	{11, "11 რადგან ეურჩებოდნენ ღმერთის სიტყვებს და უზენაესის რჩევას უგულებელყოფდნენ. "},
	{12, "12 მოდრიკა ჯაფით მათი გული, ეცემოდნენ და შემწე არ ჰყავდათ. "},
	{13, "13 შეჰღაღადეს უფალს თავიანთი მწუხარების ჟამს და გაჭირვებიდან იხსნა ისინი. "},
	{14, "14 გამოიყვანა ბნელიდან და წყვდიადიდან, და მათი ბორკილები დაწყვიტა. "},
	{15, "15 დაე, უქონ უფალს წყალობა მისი და საოცრებანი მისნი ადამის ძეთა მიმართ. "},
	{16, "16 რადგან დაამსხვრია ბჭენი სპილენძისა და ურდულნი რკინისა დაფშვნა. "},
	{17, "17 ბრიყვები თავიანთი უკანონო გზებისა და ცოდვებისათვის იტანჯებოდნენ. "},
	{18, "18 ყოველგვარი საჭმელი შეიზიზღა მათმა სულმა და სიკვდილის ბჭეს მიუახლოვდნენ. "},
	{19, "19 შეჰღაღადეს უფალს თავიანთი მწუხარების ჟამს და გაჭირვებიდან იხსნა ისინი. "},
	{20, "20 მოუვლინა სიტყვა თვისი და განკურნა ისინი, და იხსნა მოსპობისაგან. "},
	{21, "21 დაე, უქონ უფალს წყალობა მისი და საოცრებანი მისნი ადამის ძეთა მიმართ. "},
	{22, "22 შესწირონ შესაწირავები ქებისა და ილაპარაკონ მის საქმეებზე გალობით. "},
	{23, "23 ზღვაში ხომალდებით გამგზავრებულებმა, დიდ წყლებზე საქმის მკეთებლებმა - "},
	{24, "24 მათ ნახეს საქმენი უფლისა და საოცრებანი სიღრმეებში. "},
	{25, "25 ის იტყვის და ამოვარდება ქარიშხალი და ზეაიმართებიან ზვირთები. "},
	{26, "26 ავლენ ცამდე, შთავლენ უფსკრულში, სული მათი განსაცდელში დადნება. "},
	{27, "27 წრიალებენ და ირყევიან, ვათარცა მთვრალი, და მთელი მათი სიბრძნე დაინთქა. "},
	{28, "28 და შეჰღაღადეს უფალს თავიანთი მწუხარების ჟამს და გაჭირვებიდან გამოიყვანა. "},
	{29, "29 გადააქცევს ზღვის ღელვას სიწყნარედ და დადუმდებიან მისი ტალღები. "},
	{30, "30 გამხიარულდებიან, რადგან მიწყნარდნენ და წაუძღვება ნანატრ ადგილას. "},
	{31, "31 დაე, უქონ უფალს წყალობა მისი და საოცრებანი მისნი ადამის ძეთა მიმართ. "},
	{32, "32 დაე, აღამაღლონ ხალხის კრებულში და მოხუცებულთა სადგომში ხოტბა შეასხან. "},
	{33, "33 გადააქცევს მდინარეებს უდაბნოდ, წყაროს წყლებს - ურწყულად. "},
	{34, "34 ნაყოფიერ მიწას - ბიცად მის მკვიდრთა უკეთურობის გამო. "},
	{35, "35 გადააქცევს უდაბნოს წყალუხვ ტბად და გამოფიტულ მიწას - წყაროს წყლად. "},
	{36, "36 დაასახლებს იქ მშიერთ და წამომართავს ქალაქს სცხოვრებლად. "},
	{37, "37 დათესავენ მინდვრებს და გააშენებენ ვენახს, და უხვ ნაყოფს მოიწევენ. "},
	{38, "38 აკურთხებს მათ და გამრავლდებიან ფრიად, და მათ პირუტყვს არ შეამცირებს. "},
	{39, "39 დაცოტავდებიან და დამცირდებიან ჩაგვრის, უბედურებისა და წუხილისაგან. "},
	{40, "40 სირცხვილს დაატეხს მთავრებს და ახეტიალებს უგზო-უკვლოდ. "},
	{41, "41 გამოიყვანს ღარიბს სიღატაკიდან და მოაშენებს ცხვრის ფარასავით მის შთამომავალს. "},
	{42, "42 ნახავენ წმიდანები და გაიხარებენ და ყოველგვარ სიმრუდეს პირი აეკვრება. "},
	{43, "43 ვინც ბრძენია, დაიცვას ისინი და გულისხმა-ჰყოს წყალობანი უფლისა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view107() {
struct ka107 poems[] = {
	{1, "1 გალობა. ფსალმუნი დავითისა.  "},
	{2, "2 მზად არის ჩემი გული, ღმერთო, გაქებ და გიგალობებ ჩემი ღირსებით. "},
	{3, "3 გამომაღვიძე, ჩანგო და ქნარო, გამოვაღვიძებ ცისკარს. "},
	{4, "4 გადიდებ შენ, უფალო, ხალხებს შორის და გიგალობებ ერებს შორის. "},
	{5, "5 რადგან ზეცაზე დიდია წყალობა შენი და ღრუბლებამდეა ჭეშმარიტება შენი. "},
	{6, "6 ამაღლდი ცათა ზემოთ, ღმერთო, და მთელ ქვეყნიერებას გასწვდეს დიდება შენი. "},
	{7, "7 რათა გადარჩნენ საყვარელნი შენნი; მიხსენი შენი მარჯვენით და მიპასუხე. "},
	{8, "8 ღმერთმა თქვა თავის წმიდაში; ვიზეიმებ, გავანაწილებ შექემს და სუქოთის დაბლობს გავზომავ. "},
	{9, "9 ჩემია გალაადი, ჩემია მენაშე და ეფრემი ჩაჩქანია ჩემი თავისა, იუდა - კანონმდებელი ჩემი. "},
	{10, "10 მოაბი ავზია, ჩემი განსაბანელი, ედომზე ფეხსაცმელს გავიშვერ, ფილისტიმელს დავკივლებ. "},
	{11, "11 ვინ შემიყვანს გამაგრებულ ქალაქში? ვინ წამიძღვება ედომისაკენ? "},
	{12, "12 ნუთუ შენ არა, ღმერთო, მიგვატოვე და აღარ გამოხვალ ჩვენს მხედრობასთან? "},
	{13, "13 მოგვეც შეწევნა გაჭირვებაში, რადგან ამაოა შველა კაცისმიერი. "},
	{14, "14 ღმერთით შევქმნით ლაშქარს და ის დათრგუნავს ჩვენს მტრებს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view108() {
struct ka108 poems[] = {
	{1, "1 გუნდის ლოტბარს, დავითის ფსალმუნი. ღმერთო ჩემი დიდებისა, ნუ დადუმდები. "},
	{2, "2 რადგან პირი ბოროტისა და პირი მზაკვრისა გაიხსნა ჩემს წინააღმდეგ. მელაპარაკებიან ცბიერი ენით. "},
	{3, "3 სიძულვილის სიტყვებით გარს შემომერტყნენ და უმიზეზოდ მეომებიან. "},
	{4, "4 ჩემი სიყვარულის წილ მომიძულეს, მე კი ვლოცულობ. "},
	{5, "5 მომაგეს ბოროტი კეთილის წილ და სიძულვილი - ჩემი სიყვარულის წილ. "},
	{6, "6 დააყენე მის მიმართ ბოროტი და ეშმაკი დადგეს მის მარჯვნივ. "},
	{7, "7 განკითხვის დროს გამოვიდეს მტყუანი და მისი ლოცვა ცოდვად შეირაცხოს. "},
	{8, "8 იყოს დღეები მისი მცირე და მისი ქონება წაიღოს სხვამ. "},
	{9, "9 დარჩნენ მისი შვილები ობლად. და მისი ცოლი ქვრივად. "},
	{10, "10 იწოწიალონ მისმა შვილებმა და იმათხოვრონ და ეძიონ თავიანთ ნანგრევებში. "},
	{11, "11 მიითვისოს მოვალემ ყოველივე, რაც გააჩნია მას, და წარიტაცონ უცხოებმა ნაჯაფი მისი. "},
	{12, "12 ნუ იქნება მისთვის თანამგრძნობელი და ნუ ეყოლებათ შემწყალე მის ობლებს. "},
	{13, "13 გახდეს მისი შთამომავალი მოსასრველი, შემდგომ თაობაში წაიშალოს მათი სახელი. "},
	{14, "14 გაუხსენდეს ბრალი მისი მამებისა უფლის წინაშე, და ცოდვა მისი დედისა ნუ წაიშლება. "},
	{15, "15 იყვნენ ღმერთის თვალწინ მუდამ, და მოსპობს ქვეყნიერებიდან მათ სახსენებელს. "},
	{16, "16 იმისათვის, რომ არ გაიხსენა წყალობის აღმოჩენა და დევნიდა ღარიბ-ღატაკს და გულდაჩაგრულს მოსაკლავად. "},
	{17, "17 და შეიყვარა წყევლა - მასვე მიუვა; არ ისურვა კურთხევა - განშორდება მას. "},
	{18, "18 და შეიმოსება წყევლით, როგორც სამოსელით, და შევა წყევლა, როგორც წყალი, მის შიგნეულობაში, და როგორც ზეთი - მის ძვლებში. "},
	{19, "19 იყოს მისთვის, ვითარცა სამოსელი ჩაცმული და სარტყელი, გამუდმებით შემორტყმული. "},
	{20, "20 ასეთია მისაგებელი უფლისა ჩემს მოძულეთა და ჩემს სულზე ავის მოლაპარაკეთა მიმართ. "},
	{21, "21 ხოლო შენ, უფალო, ღმერთო ჩემო, იმოქმედე ჩემს მიმართ შენი სახელის გულისათვის, რადგან კარგია წყალობა შენი; გადამარჩინე, "},
	{22, "22 რადგან ღარიბ-ღატაკი ვარ მე და ჩემი გული დაწყლულებულია ჩემს შიგნით. "},
	{23, "23 ვითარცა ჩრდილი გადახრის ჟამს, ვიარებოდი, ვეხეთქებოდი აქეთ-იქით კალიასავით. "},
	{24, "24 მუხლნი ჩემნი დაუძლურდნენ მარხვისაგან და სხეულს ჩემსას მოაკლდა სიმსუქნე. "},
	{25, "25 და გავხდი მე მათი სალანძღავი; დამინახავდნენ, თავს გაიქნევ-გამოიქნევდნენ. "},
	{26, "26 შემეწიე, უფალო, ღმერთო ჩემო, მიხსენი შენი წყალობისამებრ. "},
	{27, "27 დაე გაიგონ, რომ შენი ხელია ეს; შენ მოიმოქმედე, უფალო. "},
	{28, "28 ისინი დამწყევლიან და შენ მაკურთხებ; აღდგებიან და შერცხვებიან, და მორჩილი შენი გაიხარებს. "},
	{29, "29 შეიმოსონ ჩემი მოძულენი გაწბილებით და ქურქივით წამოისხან თავიანთი სირცხვილი. "},
	{30, "30 შევაქებ უფალს ფრიად ჩემი პირით, და მრავალთა შორის ვადიდებ მას. "},
	{31, "31 რადგან დაუდგება მარჯვნივ ღატაკს, რათა იხსნას მისი სული განმსჯელთაგან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view109() {
struct ka109 poems[] = {
	{1, "1 დავითის ფსალმუნი. უთხრა უფალმა მეუფეს ჩემსას: იჯექი ჩემს მარჯვნივ, ვიდრე დავანარცხებდე შენს მტრებს შენს ფეხთა ქვეშ. "},
	{2, "2 კვერთხს შენი ძალისას გამოგიგზავნის უფალი სიონიდან; იბატონე შენს მტერთა შორის. "},
	{3, "3 შენი ხალხი მოხალისედ წამოვა შენი გალაშქრების ჟამს წმიდა ბრწყინვალებით; განთიადის საშოდანვე შენთანაა ნამი შენი სიყრმისა. "},
	{4, "4 დაიფიცა უფალმა და არ მოინანიებს: შენ ხარ მღვდელი უკუნისამდე მელქიცედეკის წესით. "},
	{5, "5 უფალი შენს მარჯვნივაა, თავის რისხვის დღეს მოსპობს მეფეებს. "},
	{6, "6 განსჯის ხალხებს, აავსებს მძორებით, მრავალს გაუჭეჭყავს თავს მიწაზე. "},
	{7, "7 ნაკადულიდან დალევს გზაში, ამიტომ მაღლა ასწევს თავს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view110() {
struct ka110 poems[] = {
	{1, "1 ადიდეთ უფალი. ვადიდებ უფალს მთელი გულით წმიდანთა შეკრებილობასა და თემში. "},
	{2, "2 დიდია საქმენი უფლისა, სასურველია ყველა მოყვარულთათვის. "},
	{3, "3 სიმშვენიერე და ბრწყინვალებაა საქმე მისი, და სიმართლე მისი მარადიულია. "},
	{4, "4 სამახსოვროდ ქმნა საოცრებანი თვისნი, მოწყალე და შემბრალებელია უფალი. "},
	{5, "5 ნადავლი მისცა თავის მოშიშებს; ახსოვს მარადის აღთქმა თავისი. "},
	{6, "6 ძალა თავის საქმეთა გააგებინა თავის ხალხს, რომ მიეცა მათთვის მემკვიდრეობა წარმართთა. "},
	{7, "7 მის ხელთა საქმენი ჭეშმარიტება და სამართალია, სარწმუნოა ყველა მცნება მისი. "},
	{8, "8 იმედნეულნი არიან უკუნითი უკუნისამდე, დაფუძნებულნი ჭეშმარიტებასა და სისწორეზე. "},
	{9, "9 ხსნა მოუვლინა თავის ხალხს; მცნებად დაუდო საუკუნოდ აღთქმა თავისი; წმიდა და საშიშია სახელი მისი. "},
	{10, "10 სიბრძნის დასაბამია შიში უფლისა; აზრკეთილია ყველა, ვინც მათ ასრულებს. მისი დიდება მარადიულია. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view111() {
struct ka111 poems[] = {
	{1, "1 ადიდეთ უფალი. ნეტარ არს კაცი მოშიში უფლისა, მის მცნებათა ფრიად მოყვარული. "},
	{2, "2 ძლიერი იქნება ქვეყნიერებაზე შთამომავლობა მისი. მართალთა თაობა დაილოცება. "},
	{3, "3 სიუხვე და სიმდიდრეა მის სახლში და მისი სიმართლე მარადიულია. "},
	{4, "4 ამოაბრწყინებს სიბნელეში შუქს, გულწრფელთათვის მოწყალე, შემბრალე და მართალი. "},
	{5, "5 კარგია კაცი მოწყალე და გამსესხებელი - გამრთულად ილაპარაკებს სამართალში. "},
	{6, "6 რადგან უკუნისამდე არ წაბორძიკდება; საუკუნოდ გასახსენებლად იქნება მართალი. "},
	{7, "7 ცუდი ამბისა არ შეეშინდება; მტკიცეა მისი გული, მინდობილია უფალზე. "},
	{8, "8 იმედნეულია გული მისი; არ შეშინდება, ოდეს იხილავს თავის მტრებს. "},
	{9, "9 გაანიავა, მისცა ღატაკებს; მისი სიმართლე მარადიულია, მისი ღირსება ამაღლდება დიდებით. "},
	{10, "10 ბოროტი ნახავს და განრისხდება, კბილებს დააღრჭენს და დადნება; ბოროტეულთა საწადელი წარიხოცება. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view112() {
struct ka112 poems[] = {
	{1, "1 ადიდეთ უფალი! ადიდეთ, მორჩილნი უფლისა, ადიდეთ უფლის სახელი! "},
	{2, "2 იყოს სახელი უფლისა კურთხეული ამიერიდან უკუნისამდე. "},
	{3, "3 მზის აღსავლიდან დასავალამდე განდიდებულია სახელი უფლისა. "},
	{4, "4 მაღალია ყველა ხალხზე უფალი, ცათა მაღლაა მისი დიდება. "},
	{5, "5 ვინ არის, ვითარცა უფალი, ღმერთი ჩვენი, მაღლა დამკვიდრებული? "},
	{6, "6 დაბლა მჭვრეტელი, რომ ხედავდეს ცას და ქვეყანას, "},
	{7, "7 წამოაყენოს მტვრიდან საწყალი, სანაგვიდან აღამაღლოს ღატაკი. "},
	{8, "8 რათა დასვას დიდებულებთან, თავისი ხალხის დიდებულებთან. "},
	{9, "9 უშვილოს სახლში დაამკვიდროს დედად, რომელიც ხარობს თავის შვილებით. ადიდეთ უფალი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view113() {
struct ka113 poems[] = {
	{1, "1 როდესაც გამოვიდა ისრაელი ეგვიპტიდან, სახლი იაკობისა უცხოენოვან ხალხისაგან, "},
	{2, "2 გახდა იუდა მისი სიწმიდე, ისრაელი - მისი სამფლობელო. "},
	{3, "3 ზღვამ დაინახა და გაიქცა, იორდანე უკან გაბრუნდა. "},
	{4, "4 მთები აცეკვდნენ ერკემლებივით, ბორცვნი - კრავებივით. "},
	{5, "5 რა დაგემართა, ზღვაო, რომ გაიქეცი, და იორდანევ, უკან რომ გაბრუნდი? "},
	{6, "6 მთებო, რას ცეკვავთ ერკემლებივით და ბორცვებო, კრავებივით? "},
	{7, "7 უფლის წინაშე ძრწოდე, დედამიწავ, იაკობის ღმერთის წინაშე, "},
	{8, "8 რომელმაც გადააქცია კლდე წყალსატევად, კაჟი - წყაროს წყლად. "},
	{9, "9 ჩვენ არა, უფალო, ჩვენ არა, არამედ შენს სახელს მიაგე დიდება შენი წყალობით, შენი ჭეშმარიტეაით. "},
	{10, "10 რატომ თქვან წარმართებმა: სად არის ღმერთი მათი? "},
	{11, "11 ხოლო ჩვენი ღმერთი ზეცაშია; ყოველივე, რაც სურდა, მოიმოქმედა. "},
	{12, "12 მათი კერპები ვერცხლი და ოქროა, ადამიანთა ხელით შექმნილი. "},
	{13, "13 პირი აქვთ და ვერ ლაპარაკობენ, თვალები აქვთ და ვერ ხედავენ. "},
	{14, "14 ყურები აქვთ და არ ესმით, ცხვირი აქვთ და ვერ იყნოსავენ. "},
	{15, "15 ხელები აქვთ და ვერაფერს ეხებიან, ფეხები აქვთ და ვერ დადიან, ხმას ვერ გამოსცემენ თავიანთი ხორხიდან. "},
	{16, "16 მათ დაემსგავსებიან მათი გამკეთებლები, ყველა, ვინც მათზეა მინდობილი. "},
	{17, "17 ისრაელო, მიენდე უფალს - შემწე და ფარია ის. "},
	{18, "18 აარონის სახლო, მიენდე უფალს - შემწე და ფარია ის. "},
	{19, "19 მოშიშნო უფლისა, მიენდეთ უფალს - შემწე და ფარია ის. "},
	{20, "20 უფალს ვახსოვართ - გვაკურთხებს; აკურთხებს ისრაელის სახლს, აკურთხებს აარონის სახლს. "},
	{21, "21 აკურთხებს უფლის მოშიშებს - პატარებს დიდებთან ერთად. "},
	{22, "22 დაე, შეგმატოთ უფალმა თქვენ, თქვენ და თქვენს შვილებს. "},
	{23, "23 კურთხეული ხართ უფლის მიერ, ცისა და ქვეყნის შემოქმედის მიერ, "},
	{24, "24 ცა-ცად უფლისათვის, ხოლო ქვეყანა მისცა ადამის ძეთ. "},
	{25, "25 არათუ მკვდრები აქებენ უფალს და ან ყოველი ქვესკნელს შთასული, "},
	{26, "26 არამედ ჩვენ ვადიდებთ უფალს ამიერიდან უკუნისამდე. ადიდეთ უფალი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view114() {
struct ka114 poems[] = {
	{1, "1 მიყვარს, რომ ისმენს უფალი ჩემს ხმას, ჩემს ვედრებას. "},
	{2, "2 რომ მომაპყრო ყური და ჩემი დღენი მოვუხმობ მას. "},
	{3, "3 გარს შემომერტყნენ სასიკვდილო ტკივილები, ჯოჯოხეთის სატანჯველი მომადგა მე, გაჭირვება და მწუხარება ვპოვე. "},
	{4, "4 და სახელს მოვუხმობ უფლისას; გევედრები, უფალო, გადაარჩინე სული ჩემი. "},
	{5, "5 მოწყალეა უფალი და მართალი, და შემბრალეა ღმერთი ჩვენი. "},
	{6, "6 იცავს უფალი გულუბრყვილოებს; დავუძლურდი და მან მიშველა მე. "},
	{7, "7 დაბრუნდი, სულო ჩემო, შენს განსასვენებელში, რადგან უფალმა კეთილი მოგაგო შენ. "},
	{8, "8 რადგან შენ იხსენი სული ჩემი სიკვდილისაგან, თვალი ჩემი - ცრემლისაგან, ფეხი ჩემი - წაბორძიკებისაგან; "},
	{9, "9 ვივლი უფლის წინაშე ცოცხალთა ქვეყანაში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view115() {
struct ka115 poems[] = {
	{1, "1 მწამდა, როცა ვიტყოდი: გავიტანჯე ფრიად. "},
	{2, "2 ვთქვი ჩემი აჩქარებისას: ყოველი კაცი ცრუა. "},
	{3, "3 რით გადავუხადო უფალს ყოველივე, რაც მე მომიზღო? "},
	{4, "4 თასს შეწევნისას ავიღებ და უფლის სახელს წარმოვთქვამ. "},
	{5, "5 ჩემს აღთქმებს უფლისადმი შევასრულებ მთელი მისი ხალხის წინაშე. "},
	{6, "6 მძიმეა უფლის თვალში სიკვდილი მისი წმიდანებისა. "},
	{7, "7 გევედრები, უფალო, რადგან მე მორჩილი ვარ შენი; მორჩილი ვარ შენი, ძე შენი მხევლისა; გახსენი ჩემი ბორკილები. "},
	{8, "8 შენ შემოგწირავ ქების შესაწირავს და უფლის სახელს მოვუხმობ. "},
	{9, "9 ჩემს აღთქმებს უფლისადმი შევასრულებ მთელი მისი ხალხის წინაშე. "},
	{10, "10 უფლის სახლის ეზოში, შენს შუაგულში, იერუსალიმო! ადიდეთ უფალი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view116() {
struct ka116 poems[] = {
	{1, "1 აქეთ უფალი, ხალხნო ყოველნო, ადიდეთ იგი, ერნო ყოველნო! "},
	{2, "2 რადგან გაძლიერდა ჩვენს მიმართ წყალობა მისი, და ჭეშმარიტება უფლისა უკუნისამდეა. ადიდეთ უფალი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view117() {
struct ka117 poems[] = {
	{1, "1 ადიდეთ უფალი, რადგან კეთილია, რადგან უკუნისამდეა წყალობა მისი. "},
	{2, "2 იტყვის ახლა ისრაელი: მართლაც უკუნისამდეა წყალობა მისი. "},
	{3, "3 იტყვის ახლა სახლი აარონისა: მართლაც უკუნისამდეა წყალობა მისი. "},
	{4, "4 იტყვიან ახლა მოშიშნი უფლისა: მართლაც უკუნასამდეა წყალობა მისი. "},
	{5, "5 სივიწროვიდან ვუხმობდი უფალს, სიფართოვით მიპასუხა უფალმა. "},
	{6, "6 უფალი ჩემთან არის - არ მეშინია, რას მიზამს კაცი? "},
	{7, "7 უფალი ჩემთან არის შემწედ და მე ვიხილავ ჩემს მტრებს. "},
	{8, "8 უკეთესია დაყრდნობა უფალზე, ვიდრე დაიმედება ადამიანზე. "},
	{9, "9 უკეთესია დაყრდნობა უფალზე, ვიდრე დაიმედება მთავრებზე. "},
	{10, "10 ხალხნი ყოველნი გარს შემომერტყნენ - უფლის სახელით მართლაც ამოვწყვეტ მათ. "},
	{11, "11 გარს შემომერტყნენ და გარემომიცვეს - უფლის სახელით მართლაც ამოვწყვეტ მათ. "},
	{12, "12 გარს შემომერტყნენ ფუტკრებივით; ჩაქრნენ, ვითარცა ცეცხლი ძეძვისა - უფლის სახელით მართლაც ამოვწყვეტ მათ. "},
	{13, "13 დაძგერებით მკრეს ხელი ძირს დასაცემად და უფალი შემეწია მე. "},
	{14, "14 ჩემი ძალა და სიმღერაა უფალი და ის იქნება ჩემი მშველელი. "},
	{15, "15 ხმა სიმღერისა და შეწევნისა წმიდათა კარვებში: უფლის მარჯვენა მქმნელია ძალის. "},
	{16, "16 უფლის მარჯვენა მომაღლებულია, უფლის მარჯვენა მქმნელია ძალის. "},
	{17, "17 არ მოვკვდები, არამედ ვიცოცხლებ და ვილაპარაკებ უფლის საქმეებზე. "},
	{18, "18 დასჯით დამსაჯა უფალმა, სიკვდილს კი არ მიმცა. "},
	{19, "19 გამიღეთ ბჭენი სიმართლისა, შევალ მათ წიაღ, ვადიდებ უფალს, "},
	{20, "20 ეს არის კარიბჭე უფლისა, წმიდანები შევლენ შიგ. "},
	{21, "21 გადიდებ შენ, რადგან მიპასუხე და გახდი ჩემი მშველელი. "},
	{22, "22 ქვა, დაწუნებული მშენებლების მიერ, თავკიდური გხდა. "},
	{23, "23 უფლისაგან მოხდა ეს, საოცარია ის ჩვენს თვალში. "},
	{24, "24 ეს არის დღე, რომელიც ჰქმნა უფალმა, ვილხინოთ და ვიმხიარულოთ მასში. "},
	{25, "25 გევედრებით, უფალო, გვიშველე! გევედრებით, უფალო, გაგვიმარჯვე! "},
	{26, "26 კურთხეულია უფლის სახელით მომავალი; გაკურთხებთ უფლის ტაძრიდან. "},
	{27, "27 ღმერთია უფალი და გაგვინათებს ჩვენ; მიაბით მსხვერპლი საბელით სამსხვერპლოს რქებზე. "},
	{28, "28 ჩემი ღმერთი ხარ შენ და გადიდებ; ღმერთო ჩემო, ხოტბას შეგასხამ შენ. "},
	{29, "29 ადიდეთ უფალი, რადგან კეთილია, რადგან უკუნისამდეა წყალობა მისი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view118() {
struct ka118 poems[] = {
	{1, "1 ნეტარ არიან გზიანები, რომელნიც დადიან უფლის რჯულზე. "},
	{2, "2 ნეტარ არიან შემნახველნი მის მცნებათა, მთელი გულით რომ ეძიებენ მას. "},
	{3, "3 არც სიავკაცე ჩაუდენიათ, მისი გზით დადიან; "},
	{4, "4 შენ დაავალე შენს ბრძანებათა დაცვა. ზედმიწევნით. "},
	{5, "5 ნეტამც წარიმართოს ჩემი გზები შენი წესდების დასაცავად. "},
	{6, "6 მაშინ აღარ შემრცხვებოდა, როს შევხედავდი შენს ყოველ მცნებას. "},
	{7, "7 განგადიდებდი გულის სისწორით, რომ მასწავლიდი სამართალს შენი სიმართლისა. "},
	{8, "8 შენს წესებს დავიცავ, ნუ მიმატოვებ საბოლოოდ, "},
	{9, "9 რით შეინახოს ყმაწვილმა სიწმიდე თავისი გზისა? დაიცვას შენი სიტყვისამებრ. "},
	{10, "10 მთელი გულით გეძიებ შენ, ნუ გადამახვევინებ შენთა მცნებათაგან. "},
	{11, "11 გულში ჩავიმარხე შენი სიტყვები, რათა არ შევცოდო. "},
	{12, "12 კურთხეულ ხარ შენ, უფალო! მასწავლე წესები შენი. "},
	{13, "13 ჩემი ბაგეებით მოვუთხრობდი ყველა სამართალს შენი პირისას. "},
	{14, "14 შენთა მცნებათა გზაზე ვხარობდი, ვითარცა მთელ ქონებაზე. "},
	{15, "15 შენს მცნებებზე ვილაპარაკებ და დავუკვირდები შენს გზებს. "},
	{16, "16 შენი წესებით გავიხარებ, არ დავივიწყებ შენს სიტყვას. "},
	{17, "17 კეთილი უქმენ შენს მორჩილს; ვიცოცხლებ და დავიცავ შენს სიტყვას. "},
	{18, "18 აღმიხილე თვალნი და ვჭვრეტდე საოცრებებს შენი რჯულისას. "},
	{19, "19 მწირი ვარ ქვეყანაზე, ნუ დამიმალავ შენს მცნებებს. "},
	{20, "20 მოითენთა სული ჩემი შენი სამართლის წადილით ყოველჟამს. "},
	{21, "21 შერისხე ამპარტავანნი, წყეულნი, რომელთაც გადაუხვიეს შენი მცნებებიდან. "},
	{22, "22 ამაცილე სირცხვილი და შეურაცხყოფა, რადგან შენს მცნებებს ვიცავდი. "},
	{23, "23 დასხდებიან კიდეც თავადნი, ჩემს წინააღმდეგ ითათბირებენ; შენი მორჩილი კი ისაუბრებს შენს წესებზე. "},
	{24, "24 შენი მცნებებიც სიხარულია ჩემთვის, მრჩეველნი ჩემნი. "},
	{25, "25 მტვერს მიეკრა სული ჩემი; მაცოცხლე შენი სიტყვისამებრ. "},
	{26, "26 გზანი ჩემნი განგიცხადე და მიპასუხე; მასწავლე წესები შენი. "},
	{27, "27 გზა შენთა ბრძანებათა გამაგებინე და ვილაპარაკებ შენს საოცრებებზე. "},
	{28, "28 დადნა სული ჩემი ნაღვლიანობით; გამამაგრე შენი სიტყვისამებრ. "},
	{29, "29 გზა სიცრუისა განმაშორე და შენი რჯულით შემიწყალე. "},
	{30, "30 გზა ჭეშმარიტებისა ამოვირჩიე, შენი სამართალნი წინ დავიყენე. "},
	{31, "31 მიკრული ვარ შენს მცნებებზე; უფალო, ნუ გამაწბილებ. "},
	{32, "32 შენთა მცნებათა გზით ვრბოდე, რადგან განავრცობ ჩემს გულს. "},
	{33, "33 მიჩვენე, უფალო, გზა შენთა წესთა და დავიცავ ბოლომდე. "},
	{34, "34 გამაგებინე და დავიცავ შენს რჯულს და შევინახავ მთელი გულით. "},
	{35, "35 დამაყენე შენთა მცნებათა კვალზე, რადგანაც მწადია იგი. "},
	{36, "36 განუმტკიცე შენს მორჩილს შენი ნათქვამი შენი მოშიშების გამო. "},
	{37, "37 ააცილე თვალი ჩემი ამაოების ცქერას, შენი გზით მაცოცხლე. "},
	{38, "38 დაუყენე შენს მონას შენი ნათქვამი შენგან მოშიშების გამო. "},
	{39, "39 ამაცილე შერცხვენა, რომლისაც მეშინია, რადგან შენი სამართალნი კეთილია. "},
	{40, "40 აჰა, ვისურვე ფრიად შენი ბრძანებანი; შენი სიმართლით მაცოცხლე მე. "},
	{41, "41 მოვიდნენ ჩემთან წყალობანი შენნი, უფალო, ხსნა შენმიერი, შენი სიტყვისამებრ. "},
	{42, "42 და პასუხს გავცემ ჩემს მაგინებლებს, რადგან ვიმედოვნებ შენი სიტყვით. "},
	{43, "43 ნუ წაართმევ ჩემს პირს ჭეშმარიტების სიტყვას სრულიად, რადგან შენს სამართალს მოველი. "},
	{44, "44 დავიცავ შენს რჯულს მარადის, უკუნითი უკუნისამდე. "},
	{45, "45 ვივლი ხალვათად, რადგან შენს ბრძანებებს ვეძიებდი. "},
	{46, "46 ვილაპარაკებ შენს მცნებებზე მეფეთა წინ და არ შემრცხვება. "},
	{47, "47 გავიხარებ შენი მცნებებით, რომლებიც მიყვარს; "},
	{48, "48 ხელთ აღვაპყრობ შენთა მცნებათა მიმართ, რომლებიც მიყვარს, და ვისაუბრებ შენს წესებზე. "},
	{49, "49 გაუხსენე შენს მორჩილს სიტყვა, რომლითაც დამაიმედე მე. "},
	{50, "50 ეს არის ჩემი ნუგეში გაჭირვებაში, რადგან შენმა ნათქვამმა გამომაცოცხლა. "},
	{51, "51 ამპარტავანნი დამცინოდნენ მეტისმეტად; შენი რჯულიდან არ გადამიხვევია. "},
	{52, "52 ვიხსენიებდი შენს სამართალს ადრიდანვე, უფალო, და დარდს ვიქარვებდი. "},
	{53, "53 თავზარი მეცემოდა, ცოდვილნი რომ ტოვებდნენ შენს რჯულს. "},
	{54, "54 სიმღერებად იქცა ჩემთვის შენი წესები ჩემს საცხოვრებელ სახლში. "},
	{55, "55 ვიხსენებდი ღამით შენს სახელს, უფალო, და ვიცავდი შენს რჯულს. "},
	{56, "56 ეს იყო ჩემთვის, რადგან შენს ბრძანებას ვიცავდი. "},
	{57, "57 ჩემი ხვედრია, ვთქვი, უფალო, შენთა სიტყვათა დაცვა. "},
	{58, "58 გევედრებოდი მთელი გულით; შემიწყალე შენი სიტყვისამებრ. "},
	{59, "59 ვფიქრობდი ჩემს გზებზე და ვიბრუნებდი ფეხს შენი მცნებებისაკენ. "},
	{60, "60 ვჩქარობდი და არ ვაყოვნებდი შენთა მცნებათა დაცვას. "},
	{61, "61 ბოროტეულთა ბორკილები გარს შემომერტყნენ, შენი რჯული არ დავივიწყე. "},
	{62, "62 შუაღამისას გდგები შენს სადიდებლად, შენს მართალ სამართალთა გამო. "},
	{63, "63 თანაზიარი ვარ ყველასი, ვინც შენი მოშიშია და იცავს შენს მცნებებს. "},
	{64, "64 შენი წყალობით, უფალო, სავსეა ქვეყნიერება, მასწავლე შენი კანონმდებლობა. "},
	{65, "65 კეთილი ჰქმენი შენი მორჩილისთვის, უფალო, შენი სიტყვისამებრ. "},
	{66, "66 კეთილი აზრი და გაგება მასწავლე, რადგან ვირწმუნე შენი მცნებანი. "},
	{67, "67 ვიდრე დავიტანჯებოდი, შევცდი; ახლა კი შენს სიტყვას ვიცავ. "},
	{68, "68 კეთილი ხარ და კეთილმოქმედი; მასწავლე წესები შენი. "},
	{69, "69 ტყუილს ჩმახავენ ამპარტავანნი ჩემზე, მე მთელი გულით დავიცავ შენს ბრძანებებს. "},
	{70, "70 დამსუყდა ცხიმივით მათი გული, მე შენი რჯულით ვხარობდი. "},
	{71, "71 კარგია ჩემთვის, რომ ვეწამე, ვინძლო ვისწავლო წესები შენი. "},
	{72, "72 უმჯობესია ჩემთვის რჯული შენი ბაგისა, ვიდრე ათასი ოქრო და ვერცხლი. "},
	{73, "73 შენმა ხელებმა შემქმნა და წარმმართა; შთამაგონე და ვისწავლი შენს მცნებებს. "},
	{74, "74 მოშიშნი შენნი შემხედავენ და გაიხარებენ, რადგან შენს სიტყვებზე ვარ მინდობილი. "},
	{75, "75 ვიცოდი, უფალო, რომ მართალია შენი სამართალი, და სამართლიანად შემაჭირვე. "},
	{76, "76 დაე, იყოს შენი წყალობა შემს სანუგეშებლად, როგორც აღუთქვი შენს მორჩილს. "},
	{77, "77 მოვიდეს ჩემდამი წყალობა შენი და ვიცოცხლებ, რადგან შენი რჯული სიხარულია ჩემი. "},
	{78, "78 შერცხვეთ ამპარტავნებს, რადგან ტყუილად მჩაგრავდნენ; ვისაუბრებ შენს ბრძანებებზე. "},
	{79, "79 დაბრუნდნენ ჩემთან მოშიშნი შენნი და მცოდნენი შენი მცნებებისა. "},
	{80, "80 იყოს ჩემი გული უბიწო შენს წინაშე, რათა არ შევრცხვე. "},
	{81, "81 დადნა შენი შეწევნის მოლოდინში ჩემი სული, შენს სიტყვაზე ვარ დაიმედებული. "},
	{82, "82 დადნენ თვალნი ჩემნი შენი სიტყვის მოლოდინში, ვთქვი: როდის მანუგეშებ მე? "},
	{83, "83 ვიყავი, ვითარცა ტიკი ორთქლში, შენი წესები არ დავივიწყე. "},
	{84, "84 რაოდენია დღენი შენი მორჩილისა? როდის გაასამართლებ ჩემს მდევნელებს? "},
	{85, "85 გამითხარეს ამპარტავნებმა ორმო, ოღონდ არა შენი რჯულისამებრ. "},
	{86, "86 ყველა მცნება შენი ჭეშმარიტებაა; უმიზეზოდ მდევნიან, მიშველე. "},
	{87, "87 ლამის გამანადგურეს მიწაზე და მაინც არ მივაგოვე შენი ბრძანებანი. "},
	{88, "88 შენი წყალობით მაცოცხლე და დავიცავ მცნებებს შენი პირისას. "},
	{89, "89 უკუნისამდე, უფალო, შენი სიტყვა დაფუძნებულია ზეცაში. "},
	{90, "90 თაობიდან თაობამდეა ჭეშმარიტება შენი; დაამყარე ქვეყანა და დგას. "},
	{91, "91 შენი მსჯავრით დგანან დღესაც, რადგან ყოველნი გმსახურებენ. "},
	{92, "92 რჯული შენი რომ არ ყოფილიყო ჩემდა ნუგეშად, დავიღუპებოდი ჩემს ტანჯვაში. "},
	{93, "93 უკუნისამდე არ დავივიწყებ ბრძანებებს შენსას, რადგანაც მათით მასულდგმულებდი. "},
	{94, "94 შენი ვარ - მიხსენი, რადგან შენს ბრძანებებს ვეძიებდი. "},
	{95, "95 მიდარაჯდებიან ბოროტნი, რომ დამღუპონ; შენს მცნებებს ღრმად ვუკვირდები. "},
	{96, "96 ყოველნაირი სრულქმნილების მინახავს ბოლო; ვრცელია შენი მცნებანი ფრიად. "},
	{97, "97 რარიგად მიყვარს რჯული შენი, ის არის ჩემი საფიქრალი დღენიადაგ. "},
	{98, "98 ჩემს მტრებზე მეტად დამაბრძენე შენი მცნებით; რადგან მარადის ჩემია იგი. "},
	{99, "99 ყველა ჩემს მოძღვარზე გონიერი გავხდი, რადგან შენი მცნებანი სააზროვნიაა ჩემი. "},
	{100, "100 მოხუცებზე მეტად საზრიანი ვარ, რადგან შენს ბრძანებებს ვიცავ. "},
	{101, "101 ყოველგვარ ბოროტ გზას მოვარიდე ფეხი, რათა დავიცვა შენი სიტყვა. "},
	{102, "102 შენთა სამართალთაგან არ გადამიხვევია, რადგანაც შენ მასწავლიდი. "},
	{103, "103 რარიგ ატკბობს ჩემს სასას შენი სიტყვები, თაფლზე ტკბილია ჩემი პირისთვის. "},
	{104, "104 შენი ბრძანებით საზრიანი გავხდი, ამიტომ მოვიძულე ყთველი გზა სიცრუისა. "},
	{105, "105 ლამპარია ჩემი ფეხისთვის სიტყვა შენი და სინათლე - ჩემი ბილიკისათვის. "},
	{106, "106 დავიფიცავ და ავასრულებ, დავიცავ შენს მართალ სამართალს. "},
	{107, "107 დავიტანჯე მეტისმეტად; უფალო, მაცოცხლე შენი სიტყვისამებრ. "},
	{108, "108 აღთქმანი ჩემი პირისა ისურვე - გთხოვ, უფალო, და სამართალნი შენნი მასწავლე. "},
	{109, "109 სული ჩემი ხელისგულზეა მუდამ და შენს რჯულს არ ვივიწყებ. "},
	{110, "110 დამიგეს ბოროტებმა მახე, მაგრამ შენი ბრძანებებისთვის არ გადამიხვევია. "},
	{111, "111 დავიმკვიდრე მცნებანი შენი საუკუნოდ, რადგან ისინი ჩემი გულის სიხარულია. "},
	{112, "112 მოვდრიკე გული ჩემი წესთა შენთა შესასრულებლად. უკუნითი უკუნისამდე. "},
	{113, "113 ბოროტგანმზრახველნი შევიძულე და შენი რჯული შევიყვარე. "},
	{114, "114 თავშესაფარი და ფარი ხარ ჩემი, შენს სიტყვაზე ვარ დაიმედებული. "},
	{115, "115 შორს ჩემგან, ბოროტნო, და მე დავიცავ მცნებებს ჩემი ღმერთისას. "},
	{116, "116 შემეწიე შენი სიტყვისამებრ და ვიცოცხლო, და ნუ გამიწბილებ ჩემს იმედს. "},
	{117, "117 შემეწიე და გადავრჩე, და ჩავწვდვბი შენს წესდებებს ყოველთვის. "},
	{118, "118 მოსრე ყოველი, ვინც განუდგა შენს წესებს, რადგან სიცრუეა მათი ხრიკები. "},
	{119, "119 როგორც ნაყარ-ნუყარი, მოსპე ყოველი ბოროტი ქვეყანაზე, ამიტომ შევიყვარე, მცნებანი შენნი. "},
	{120, "120 თრთის შენი შიშით სხეული ჩემი და მეშინია შენი განკითხვების. "},
	{121, "121 ვქმენ სამართალი და სიმართლე. ნუ შემატოვებ მჩაგვრელებს ჩემსას. "},
	{122, "122 გამოესარჩლე შენს მორჩილს სასიკეთოდ, რომ დამჩაგრონ ამპარტავნებმა. "},
	{123, "123 დადნენ თვალნი ჩემნი შენი შეწევნისა და შენი სიმართლის სიტყვის მოლოდინში. "},
	{124, "124 მოიმოქმედე შენი მორჩილისთვის შენი წყალობისამებრ და წესები შენი მასწავლე. "},
	{125, "125 მორჩილი ვარ შენი; გონიერ-მყავ, რათა შევიმეცნო მცნებანი შენნი. "},
	{126, "126 ჟამია უფლის მოქმედებისა - მოშალეს რჯული შენი. "},
	{127, "127 ამიტომ მიყვარს მცნებანი შენნი ოქროზე და ბაჯაღლოზე მეტად. "},
	{128, "128 ამიტომ ყველა შენი ბრძანება უკლებლივ სწორად მიმაჩნია; მძულს ყოველი გზა სიცრუისა. "},
	{129, "129 საოცარია მცნებანი შენნი; ამიტომ ინახავს მათ სული ჩემი. "},
	{130, "130 საწყისი შენი სიტყვებისა ანათებს, შთააგონებს გულუბრყვილოებს. "},
	{131, "131 პირი გავხსენი და ამოვისუნთქე, რადგან მომენატრა მცნებანი შენნი. "},
	{132, "132 მომხედე და შემიწყალე, როგორც შეეფერება შენი სახელის მოყვარულთ. "},
	{133, "133 ჩემი ნაბიჯები წარმართე შენი სიტყვით და ნუ გააბატონებ ჩემზე ნურავითარ ბოროტს. "},
	{134, "134 გადამარჩინე ადამიანის ჩაგვრისაგან, და დავიცავ შენს ბრძანებებს. "},
	{135, "135 შენი სახე მოაშუქე შენს მორჩილს და მასწავლე წესები შენი. "},
	{136, "136 წყლის ნაკადები გადმომდის თვალთაგან, რადგან არ იცავენ შენს რჯულს. "},
	{137, "137 მართალი ხარ შენ, უფალო, და სწორია სამართალი შენი. "},
	{138, "138 ბრძანე სიმართლით მცნებანი შენნი და ჭეშმარიტია მეტად. "},
	{139, "139 დამღრღნა ეჭვმა, რადგან დაივიწყეს შენი სიტყვები ჩემმა მტრებმა. "},
	{140, "140 ხალასია შენი ნათქვამი ფრიად და შენს მორჩილს უყვარს იგი. "},
	{141, "141 მცირე ვარ და მოძულებული; შენს ბრძანებებს არ ვივიწყებ. "},
	{142, "142 სიმართლე შენი მარადიული სიმართლეა და შენი რჯული ჭეშმარიტია. "},
	{143, "143 განსაცდელი და გაჭირვება წამომეწია; შენი მცნებანი სიხარულია ჩემთვის. "},
	{144, "144 სიმართლეა შენი მცნებანი მარადის; შთამაგონე და ვიცოცხლებ. "},
	{145, "145 მოგიხმობ მთელი გულით; მიპასუხე, უფალო! შენს წესებს დავიცავ. "},
	{146, "146 შენ მოგიხმობ, გადამარჩინე, და დავიცავ შენს მცნებებს. "},
	{147, "147 ავდგები გარიჟრაჟამდე და ვიღაღადებ, შენს სიტყვაზე ვარ დაიმედებული. "},
	{148, "148 ჩემმა თვალებმა დაასწრეს განთიადს, რათა ვილაპარაკო შენს ნათქვამზე. "},
	{149, "149 ჩემა ხმა ისმინე შენი წყალობისამებრ; უფალო, შენი სამართლის მიხედვით მაცოცხლე. "},
	{150, "150 მომიახლოვდნენ მდევარნი გარყვნილებისა; შენს რჯულს დაშორდნენ. "},
	{151, "151 ახლოს ხარ, უფალო, და ყოველი მცნება შენი ჭეშმარიტებაა. "},
	{152, "152 ადრიდანვე შევიტყვე შენთა მცნებათა შესახებ, რომ სამარადჟამოდ დააფუძნე ისინი. "},
	{153, "153 იხილე ტანჯვა ჩემი და გადამარჩინე, რადგან შენი რჯული არ დავივიწყე. "},
	{154, "154 გამომესარჩლე და დამიხსენი, შენი ნათქვამისამებრ მაცოცხლე. "},
	{155, "155 შორს არის ბოროტთაგან შველა, რადგან შენს წესებს არ ეძიებენ. "},
	{156, "156 წყალობანი შენნი უხვია, უფალო, შენი სიმართლის მიხედვით მაცოცხლე. "},
	{157, "157 ბევრია ჩემი მდევარი და შემავიწროებელი; შენი მცნებებისათვის არ გადამიხვევია. "},
	{158, "158 ვიხილე ორგულნი და შევედავე, რადგან შენს ნათქვამს არ იცავენ. "},
	{159, "159 ნახე, რარიგ შევიყვარე შენი ბრძანებანი, უფალო; შენი წყალობისამებრ მაცოცხლე. "},
	{160, "160 საწყისი შენი სიტყვისა ჭეშმარიტებაა, და საუკუნოა ყოველი მართალი შენი სამართალი. "},
	{161, "161 მთავარნი მდევნიან უმიზეზოდ და შენი სიტყვებისაგან დაშინებულია გული ჩემი. "},
	{162, "162 ვხარობ შენი ნათქვამით, ვითარცა მპოვნელი უხვი ნადავლისა. "},
	{163, "163 სიცრუე მძულს და მძაგს; შენი რჯული მიყვარს. "},
	{164, "164 დღეში შვიდგზის გაქებ შენრ სიმართლის სამართალთათვის. "},
	{165, "165 დიდია მშვიდობა შენი რჯულის მოყვარულთა, და არ არსებობს მათთვის დაბრკოლება. "},
	{166, "166 იმედი მქონდა შენი შეწევნისა, უფალო, და შენს მცნებებს ვასრულებდი. "},
	{167, "167 იცავდა ჩემი სული შენს მცნებებს და მე ისინი მიყვარს ძალიან. "},
	{168, "168 ვიცავდი შენს ბრძანებებს და მცნებებს, რადგან ყველა ჩემი გზა შენს წინაშეა. "},
	{169, "169 მოახლოვდეს ჩემი ღაღადი შენს წინაშე, უფალო, და შენი სიტყვებისამებრ შთამაგონე. "},
	{170, "170 მოვიდეს ჩემი ვედრება შენს წინაშე, რადგან მასწავლე წესები შენი. "},
	{171, "171 წარმოთქვამენ ჩემი ბაგენი ქებას, რადგან მასწავლე წესები შენი. "},
	{172, "172 იტყვის ჩემი ენა შენს ნათქვამს, რადგან ყველა მენი მცნება სიმართლეა. "},
	{173, "173 იყოს შენი ხელი ჩემდა შემწედ, რადგან შენი ბრძანებანი ამოვირჩიე. "},
	{174, "174 ვნატრობდი შენს შველას, უფალო, და შენი რჯული სასიამოვნოა ჩემთვის. "},
	{175, "175 იცოცხლოს ჩემმა სულმა და გაქოს შენ, და შენი სამართალი შემეწიოს. "},
	{176, "176 დავიბენი, ვითარცა ცხვარი დაკარგული; მოძებნე შენი მორჩილი, რადგან მცნებანი შენნი არ დავივიწყე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view119() {
struct ka119 poems[] = {
	{1, "1 გალობა აღსავალთა. უფალს ჩემი გაჭირვების ჟამს მოვუხმე და მიპასუხა. "},
	{2, "2 უფალო, იხსენი ჩემი სული ცრუ ბაგეთაგან, მზაკვარი ენისაგან. "},
	{3, "3 რას მოგცემს შენ და რას შეგძენს შენ ენა მზაკვარი? "},
	{4, "4 მეომრის მომახულ ისარს, წნორნარის ნაკვერცხლებთან ერთად. "},
	{5, "5 ვაიმე, ხიზანი ვარ მეშექისა, ვბინადრობ კედარის კარვებთან. "},
	{6, "6 დიდხანს მკვიდრობდა ჩემი სული მშვიდობის მოძულეებთან. "},
	{7, "7 მე მშვიდობა მსურს და რომ დავილაპარაკებ, ისინი საომრად ემზადებიან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view120() {
struct ka120 poems[] = {
	{1, "1 გალობა აღსავალთა. მივაპყრობ თვალებს მთებს: საიდან მოვა ჩემი შეწევნა? "},
	{2, "2 ჩემი შეწევნა უფლისგანაა, რომელმაც შეჰქმნა ცა და ქვეყანა. "},
	{3, "3 არ წააბორძიკებს შენს ფეხს; არ წათვლემს დამცველი შენი. "},
	{4, "4 აჰა, არ წათვლემს და არ დაიძინებს მცველი ისრაელისა. "},
	{5, "5 უფალია შენი მცველი; უფალი, შენი მფარველი - შენი მარჯვენის გვერდით. "},
	{6, "6 დღისით მზე არ გავნებს და ღამით მთვარე. "},
	{7, "7 უფალი დაგიცავს ყოველგვარი ბოროტისაგან, დაიცავს შენს სულს; "},
	{8, "8 უფალი დაიცავს შენს წასვლას და მოსვლას ამიერიდან და უკუნისამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view121() {
struct ka121 poems[] = {
	{1, "1 გალობა აღსავალთა. დავითისათვის. გავიხარე, როცა მითხრეს: უფლის სახლში წავიდეთ. "},
	{2, "2 იდგნენ ფეხნი ჩვენნი შენს კარიბჭეებში, იერუსალიმო! "},
	{3, "3 იერუსალიმი ნაგებია, როგორც ქალაქი ერთად შერწყმული. "},
	{4, "4 რადგან იქ ავიდნენ ტომნი, ტომნი უფლისანი სამოწმებლად ისრაელისა, სადიდებლად უფლის სახელისა. "},
	{5, "5 რადგან იქ იდგა ტახტები სამართლისა, ტახტები დავითის სახლისა. "},
	{6, "6 ითხოვეთ მშვიდობა იერუსალიმისათვის; დამშვიდდნენ მოყვარულნი შენნი. "},
	{7, "7 იყოს მშვიდობა შენს ზღუდეებში, სიმშვიდე შენს სასახლეებში. "},
	{8, "8 ჩემთა ძმათა და მეგობართა გამო, ვამბობ: მშვიდობა შენ! "},
	{9, "9 ჩვენი უფალი ღმერთის სახლისთვის გისურვებ სიკეთეს შენ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view122() {
struct ka122 poems[] = {
	{1, "1 გალობა აღსავალთა. შენსკენ აღვაპყარ ჩემი თვალები, ზეცაში მყოფო. "},
	{2, "2 აჰა, ვითარცა მონათა თვალნი ბატონთა ხელისაკენ, ვითარცა თვალნი მხევლისა ქალბატონის ხელისაკენ, ისევე ჩვენი თვალები მიქცეულია ჩვენი უფალი ღმერთისაკენ, ვიდრე შეგვიწყალებდეს. "},
	{3, "3 შეგვიწყალე, უფალო, შეგვიწყალე, რადგან მეტისმეტად გავძეხით სიძულვილით. "},
	{4, "4 საკმაოდ გაძღა ჩვენი სული უზრუნველთა დაცინვით და ამპარტავანთა სიძულვილით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view123() {
struct ka123 poems[] = {
	{1, "1 გალობა აღსავალთა. დავითისათვის. უფალი რომ არ ყოფილიყო ჩვენთან, თქვას ისრაელმა, "},
	{2, "2 უფალი რომ არ ყოფილიყო ჩვენთან, როცა აღდგა ჩვენს წინააღმდეგ კაცი, "},
	{3, "3 მაშინ ცოცხლად ჩაგვყლაპავდნენ, რაჟამს განრისხდნენ ჩვენზე. "},
	{4, "4 მაშინ წყლები წაგვსილავდნენ, ნაკადი გადაუვლიდა ჩვენს სულს. "},
	{5, "5 ჩვენი შეწევნა უფლის სახელშია ცისა და ქვეყნის შემოქმედისა. "},
	{6, "6 კურთხეულ არს უფალი, რომ არ მიგვცა ულუფად მათთა კბილთათვის. "},
	{7, "7 ჩვენი სული გადარჩა, ვითარცა ჩიტი მონადირის მახისაგან; მახე დაიმსხვრა და ჩვენ გადავრჩით. "},
	{8, "8 ჩვენი შეწევნა უფლის სახელშია - ცისა და ქვეყნის შემოქმედისა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view124() {
struct ka124 poems[] = {
	{1, "1 გალობა აღსავალთა. უფალზე დანდობილი მსგავსია სიონის მთისა - არ შეირყევა, იდგომება უკუნისამდე. "},
	{2, "2 იერუსალიმს გარეშემო მთები არტყია, ხოლო უფალი თავისი ერის გარშემოა ამიერიდან უკუნისაადე. "},
	{3, "3 რადგან არ დარჩება კვერთხი ბოროტისა მართალთა წილზე, რათა არ გაიწოდონ მართლებმა ხელი სიმრუდეზე. "},
	{4, "4 სიკეთე უყავ, უფალო, კეთილებს და გულმართლებს. "},
	{5, "5 ხოლო გადამხრელებს წაიყვანს უფალი ბოროტმოქმედებთან ერთად; მშვიდობა ისრაელს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view125() {
struct ka125 poems[] = {
	{1, "1 გალობა აღსავალთა. როცა დააბრუნებს უფალი ტყვეს სიონისას, თავი სიზმარში გვეგონება. "},
	{2, "2 მაშინ აივსება სიცილით პირი ჩვენი და ენა ჩვენი - გალობით. მაშინ იტყვიან ხალხებს შორის: დიადი საქმე მოიმოქმედა უფალმა მათთან. "},
	{3, "3 დიადი საქმე მოიმოქმედა უფალმა ჩვენთან. გავმხიარულდით. "},
	{4, "4 დააბრუნე, უფალო, ჩვენი ტყვეები, ვით ნაკადები ურწყავ ადგილზე. "},
	{5, "5 ცრემლით მთესველნი სიმღერით მოიმკიან. "},
	{6, "6 მიდის და ტირის მთესველი თესლისა, მოდის და სიმღერით მოაქვს ძნები თავისი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view126() {
struct ka126 poems[] = {
	{1, "1 გალობა აღსავალთა. სოლომონისთვის. თუ უფალი არ ააშენებს სახლს, ამაოდ გაირჯებიან მისი მშენებლები; თუ უფალი არ დაიცავს ქალაქს, ამაოდ ფხიზლობს გუშაგი. "},
	{2, "2 ამაოდ დგებით ადრიან, აგვიანებთ დასხდომას, ჭამთ ჭმუნვით პურს; რადგან ძილს ანიჭებს თავის საყვარელს. "},
	{3, "3 აჰა, მემკვიდრეობა უფლისაგან - შვილები, გასამრჯელო - მუცლის ნაყოფი. "},
	{4, "4 როგორც ისრები მეომრის ხელში, ისეა ახალგაზრდა თაობა. "},
	{5, "5 ნეტარია მამაკაცი, რომელმაც გაივსო კაპარჭი მათით; არ შერცხვება, როცა ლაპარაკი მოუხდება მტრებთან კარიბჭეში. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view127() {
struct ka127 poems[] = {
	{1, "1 გალობა აღსავალთა. ნეტარია ყოველი, რომელსაც ეშინია უფლისა და იარება მისი გზებით. "},
	{2, "2 შენი ხელების ნაყოფს თუ ჭამ, ნეტარება შენ და სიკეთე შენ! "},
	{3, "3 ცოლი შენი, ვითარცა ვაზი მსხმოიარე შენი სახლის კიდეებში; შენი შვილები, ვითარცა ყლორტები ზეთისხილისა, შენი სუფრის გარშემო. "},
	{4, "4 აგერ, ასე რომ იკურთხება კაცი მოშიში უფლისა. "},
	{5, "5 გაკურთხოს შენ უფალმა სიონიდან, და იხილე სიკეთე იერუსალიმისა მთელი შენი სიცოცხლე. "},
	{6, "6 იხილე შვილნი შვილთა შენთა. მშვიდობა, ისრაელს! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view128() {
struct ka128 poems[] = {
	{1, "1 გალობა აღსავალთა. მრავალგზის მავიწროებდნენ ჩემი ყრმობიდან, თქვას ისრაელმა. "},
	{2, "2 მრავალგზის მავიწროებდნენ ჩემი ყრმობიდან, მაინც ვერ მძლიეს. "},
	{3, "3 ჩემს ზურგზე ხნავდნენ მხვნელები და გაჰყავდათ გრძელი კვლები. "},
	{4, "4 უფალი სამართლიანია: დაამსხვრია ხუნდები ბოროტთა. "},
	{5, "5 შერცხვებიან და უკუიქცევიან ყოველნი მოძულენი სიონისა. "},
	{6, "6 იქნებიან, როგორც ერდოს ბალახი, რომელიც მოწყვეტამდე გახმება. "},
	{7, "7 რომლითაც ვერ აივსებს პეშვს მომკელი და იღლიას - ძნის შემკვრელი. "},
	{8, "8 და არ ეტყვიან გამვლელნი: კურთხევა უფლისა თქვენ; გაკურთხებთ თქვენ უფლის სახელით. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view129() {
struct ka129 poems[] = {
	{1, "1 გალობა აღსავალთა. სიღრმეებიდან მოგიხმობ შენ, უფალო; "},
	{2, "2 უფალო, ისმინე ჩემი ხმა. მზად იყვნენ შენი ყურები ჩემი ვედრების ხმის მოსასმენად. "},
	{3, "3 თუ ცოდვებს შემოგვინახავ, უფალო, ვინ დაგიდგება? "},
	{4, "4 მაგრამ შენს მიერ არის შენდობა, რათა გეკრძალონ. "},
	{5, "5 მეიმედება უფალი, ესავს ჩემი სული და მის სიტყვას ველოდები. "},
	{6, "6 სული ჩემი ელოდება უფალს უფრო მეტად, ვიდრე გუშაგნი დილას, გუშაგნი დილას, "},
	{7, "7 ესავდეს ისრაელი უფალს, რადგან უფალთან არის წყალობა და უხვია დახსნა მისმიერი. "},
	{8, "8 და ის დაიხსნის ისრაელს ყველა ბრალისაგან. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view130() {
struct ka130 poems[] = {
	{1, "1 გალობა აღსავალთა. დავითისათვის. უფალო, არ გავდიდგულებულვარ და თვალნი მაღლა არ ამიწევია; და არც მივლია განდიდებისა და ჩემთვის მიუწვდომლისაკენ. "},
	{2, "2 არამედ ვაწყნარებდი და ვაყუჩებდი ჩემს სულს, ვით დედის ძუძუდან მოწყვეტილ ყრმას, ვითარცა ძუძუს მოწყვეტილი, ისეა ჩემში ჩემი სული. "},
	{3, "3 ესავდეს ისრაელი უფალს ამიერიდან უკუნისამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view131() {
struct ka131 poems[] = {
	{1, "1 გალობა აღსავალთა. "},
	{2, "2 გაუხსენე დავითს, უფალო, ყოველი ურვა მისი. "},
	{3, "3 როგორც შეჰფიცა უფალს, აღთქმა დაუდო იაკობის ძლიერს; თუ შევიდე ჩემი სახლის კარავში, თუ ავიდე ჩემს საწოლ-სარეცელზე. "},
	{4, "4 თუ მივცე ძალი ჩემს თვალებს და რული ჩემს წამწამებს, "},
	{5, "5 ვიდრე ვიპოვიდე ადგილს უფლისათვის, სადგომებს იაკობის ძლიერისთვის. "},
	{6, "6 აგერ მოვისმინეთ მის შესახებ, ეფრათში, ვიპოვეთ იგი ტყიან ველზე. "},
	{7, "7 მივიდეთ მის სადგომებში, თაყვანი ვცეთ მის ფეხთა საყრდენს. "},
	{8, "8 აღსდექ, უფალო, განსასვენებლად შენდა, შენა და კიდობანი შენი ძლიერებისა. "},
	{9, "9 შენი მღვდელნი შეიმოსონ სიმართლით და შენმა წმიდანებმა იმხიარულონ. "},
	{10, "10 შენი მორჩილის - დავითის გულისათვის ნუ უკუაგდებ შენი ცხებულის სახეს. "},
	{11, "11 შეჰფიცა უფალმა დავითს ჭეშმარიტად, არ გადაუხვევს მისგან: „ნაყოფისაგან შენი მუცლისა დავსვამ შენს ტახტზე. "},
	{12, "12 თუ დაიცავენ შენი ძენი ჩემს აღთქმას და ჩემს მცნებებს, რომელთაც ვასწავლი მათ, მათი შვილებიც უკუნისამდე დასხდებიან შენს ტახტზე“. "},
	{13, "13 რადგან ამოირჩია უფალმა სიონი, ისურვა სამკვიდრებლად თავისთვის. "},
	{14, "14 „ეს არის ჩემი განსასვენებელი უკუნისამდე, აქ დავსახლდები, რადგან ვისურვე იგი. "},
	{15, "15 საზრდოს მისას კურთხევით ვაკურთხებ, მის ღარიბებს გავაძღებ პურით. "},
	{16, "16 მის მღვდლებს შევმოსავ შეწევნით და წმიდანები მისნი სიხარულით გაიხარებენ. "},
	{17, "17 იქ აღმოვაცენებ დავითის ღირსებას, გავამზადებ, სინათლეს ჩემი ცხებულისათვის. "},
	{18, "18 მის მტრებს შევმოსავ სირცხვილით და მასზე იბრწყინებს გვირგვინი მისი“. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view132() {
struct ka132 poems[] = {
	{1, "1 გალობა აღსავალთა. დავითისათვის. აჰა, რა კარგია და რა საამურია, ერთად რომ ცხოვრობენ ძმები! "},
	{2, "2 როგორც ძვირფასი მირონი თავზე, წვერებზე ჩამოღვრილი, აარონის წვერებზე, მისი სამოსის კალთებზე ჩამოღვრილი. "},
	{3, "3 ვითარცა ცვარი ხერმონისა, სიონის მთებზე ამოღვრილი! რადგან იქ დაადგინა უფალმა კურთხევა - სიცოცხლე უკუნისამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view133() {
struct ka133 poems[] = {
	{1, "1 გალობა აღსავალთა. აჰა, ადიდეთ უფალი, ყოველნო მსახურნო უფლისა, რომელნიც უფლის სახლში დგახართ ღამღამობით. "},
	{2, "2 ზეაღაპყარით თქვენი ხელი სიწმიდისაკენ და აკურთხეთ უფალი. "},
	{3, "3 გაკურთხოს სიონიდან უფალმა, ცისა და ქვეყნის შემოქმედმა. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view134() {
struct ka134 poems[] = {
	{1, "1 ადიდეთ უფალი! ადიდეთ სახელი უფლისა, ადიდეთ, მორჩილნო უფლისა! "},
	{2, "2 რომელნიც დგახართ უფლის სახლში, ეზოებში ჩვენი ღმერთის სახლისა. "},
	{3, "3 ადიდეთ უფალი, რადგან კეთილია უფალი; უგალობეთ მის სახელს, რადგან სასურველია. "},
	{4, "4 რადგან იაკობი ამოირჩია თავისთვის უფალმა, ისრაელი - თავის წარჩინებულად. "},
	{5, "5 რადგან ვიცოდი, რომ დიდია უფალი და უფალი ჩვენი ყველა ღმერთზე დიდია. "},
	{6, "6 ყოველივე, რაც სურდა, მოიმოქმედა უფალმა, ცაში და ქვეყანაზე, ზღვებზე და ყოველ უფსკრულში. "},
	{7, "7 ამოჰყავს ღრუბლები ქვეყნის კიდეებიდან, ელვებს წვიმად აქცევს, გამოჰყავს ქარი თავისი საცავებიდან. "},
	{8, "8 რომელმაც მოსრა პირმშონი ეგვიპტისა - ადამიანიდან პირუტყვამდე. "},
	{9, "9 მოავლინა სასწაულები და საოცრებანი შენს შორის, ეგვიპტევ, ფარაონსა და მის მსახურებზე. "},
	{10, "10 რომელმაც მოსრა ხალხი მრავალი და დახოცა ძლიერი მეფენი -"},
	{11, "11 სიხონი, მეფე ამორეველთა, და ყოგი, მეფე ბაშანისა, და ყველა სამეფო ქანაანისა. "},
	{12, "12 და მისცა მათი მიწები სამკვიდროდ, სამკვიდროდ ისრაელს - თავის ხალხს. "},
	{13, "13 უფალო, შენი სახელი მარადიულია, უფალო, შენი სახსენებელი თაობიდან თაობამდეა. "},
	{14, "14 რადგან განიკითხავს უფალი თავის ხალხს და თავის მორჩილთ შეივრდომებს. "},
	{15, "15 ხალხთა კერპები ვერცხლი და ოქროა, ადამიანის ნახელავი. "},
	{16, "16 პირი აქვთ და ვერ ლაპარაკობენ, თვალები აქვთ და ვერ ხედავენ. "},
	{17, "17 ყურები აქვთ და ვერ ისმენენ, არც აქვთ სუნთქვა მათ პირებს. "},
	{18, "18 მათი მსგავსნი იქნებიან მათი გამკეთებლები, ყველა, ვინც მათზეა მინდობილი. "},
	{19, "19 ისრაელის სახლო, აკურთხეთ უფალი; აარონის სახლო, აკურთხეთ უფალი! "},
	{20, "20 ლევის სახლო, აკურთხეთ უფალი; უფლის მოშიშნო, აკურთხეთ უფალი! "},
	{21, "21 კურთხეულია უფალი სიონიდან, დამკვიდრებული იერუსალიმში. ადიდეთ უფალი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view135() {
struct ka135 poems[] = {
	{1, "1 ადიდეთ უფალი, რადგან კეთილია, რადგან უკუნისამდეა წყალობა მისი. "},
	{2, "2 ადიდეთ ღმერთი ღმერთებისა, რადგან უკუნისამდეა წყალობა მისი. "},
	{3, "3 ადიდეთ უფალი უფალთა, რადგან უკუნისამდეა წყალობა მისი. "},
	{4, "4 მარტოდმარტო მოქმედი დიდ საოცრებათა, რადგან უკუნისამდეა წყალობა მისი. "},
	{5, "5 ცათა შემქმნელი გონიერებით, რადგან უკუნისამდეა წყალობა მისი. "},
	{6, "6 დედამიწის განმვრცობი წყლებზე, რადგან უკუნისამდეა წყალობა მისი. "},
	{7, "7 შემქმნელი დიდი მნათობებისა, რადგან უკუნისამდეა წყალობა მისი. "},
	{8, "8 მზისა - სამართავად დღისით, რადგან უკუნისამდეა წყალობა მისი. "},
	{9, "9 მთვარის და ვარსკვლავებისა - ღამით სამართავად, რადგან უკუნისამდეა წყალობა მისი. "},
	{10, "10 რომელმაც განგმირა ეგვიპტე - პირმშოებითურთ, რადგან უკუნისამდეა წყალობა მისი. "},
	{11, "11 და გამოიყვანა ისრაელი მათი შუაგულიდან, რადგან უკუნისამდეა წყალობა მისი. "},
	{12, "12 ხელით ძლიერით და მკლავით შემართულით, რადგან უკუნისამდეა წყალობა მისი. "},
	{13, "13 რომელმაც გააპო მეწამული ზღვა ნაჭერ-ნაჭერ, რადგან უკუნისამდეა წყალობა მისი. "},
	{14, "14 და გაიყვანა ისრაელი მის შუაგულში, რადგან უკუნისამდეა წყალობა მისი. "},
	{15, "15 და ჩაღუპა ფარაონი და მისი ჯარი მეწამულ ზღვაში, რადგან უკუნისამდეა წყალობა მისი. "},
	{16, "16 რომელმაც წაიყვანა ხალხი თვისი უდაბნოში, რადგან უკუნისამდეა წყალობა მისი. "},
	{17, "17 რომელმაც განგმირა მეფენი დიდნი, რადგან უკუნისამდეა წყალობა მისი. "},
	{18, "18 და დახოცა მეფენი ძლიერნი, რადგან უკუნისამდეა წყალობა მისი. "},
	{19, "19 სიხონი, მეფე ამორეველთა, რადგან უკუნისამდეა წყალობა მისი; "},
	{20, "20 ოგი, მეფე ბაშანისა, რადგან უკუნისამდეა წყალობა მისი. "},
	{21, "21 და მისცა მათი ქვეყნები სამკვიდრებლად, რადგან უკუნისამდეა წყალობა მისი. "},
	{22, "22 სამკვიდრებლად ისრაელს, თავის მორჩილს, რადგან უკუნისამდეა წყალობა მისი. "},
	{23, "23 რომელმაც ჩვენი დამცირების ჟამს გაგვიხსენა, რადგან უკუნისამდეა წყალობა მისი. "},
	{24, "24 და გვიხსნა ჩვენი მტრებისაგან, რადგან უკუნისამდეა წყალობა მისი. "},
	{25, "25 რომელიც აძლევს პურს ყოველ ხორციელს, რადგან უკუნისამდეა წყალობა მისი. "},
	{26, "26 ადიდეთ ცათა ღმერთი, რადგან უკუნისამდეა წყალობა მისი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view136() {
struct ka136 poems[] = {
	{1, "1 ბაბილონის მდინარეებთან ვისხედით და ვტიროდით, ოდეს გიგონებდით შენ, სიონო! "},
	{2, "2 ძეწნათა შორის ჩამოვკიდეთ ჩვენი ქნარები. "},
	{3, "3 რადგან იქ მოგვთხოვეს ჩვენმა დამტყვევებლებმა სიტყვანი სიმღერისა და ჩვენმა მჩაგვრელებმა სიმხიარულე: გვიმღერეთ ჩვენ სიმღერა სიონისა. "},
	{4, "4 როგორ ვიმღეროთ სიმღერა უფლისა უცხო მიწაზე? "},
	{5, "5 თუ დაგივიწყო შენ, იერუსალიმო, დამივიწყოს მარჯვენამ ჩემმა. "},
	{6, "6 მიეკრას ჩემი ენა ჩემს სასას, თუ არ გაგიხსენო, თუ არ დავაყენო იერუსალიმი ჩემი მხიარულების სათავეში. "},
	{7, "7 გაუხსენე, უფალო, ედომის შვილებს დღე იერუსალიმისა, როცა ამბობდნენ: დაანგრიეთ, დაანგრიეთ ძირისძირამდე. "},
	{8, "8 ასულო ბაბილონისა, გამპარტახებელო! ნეტარ არს, რომელმან მოგიზღოს, რაც მოგვიზღე ჩვენ. "},
	{9, "9 ნეტარია, რომელმანც შეიპყროს და მიახეთქოს ჩვილნი შენნი კლდეს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view137() {
struct ka137 poems[] = {
	{1, "1 დავითისა. გადიდებ მთელი ჩემი გულით, ღმერთების წინაშე გიგალობებ შენ. "},
	{2, "2 თაყვანს ვცემ შენს წმიდა ტაძარს და ვადიდებ შენს სახელს შენი წყალობისა და შენი ჭეშმარიტების გამო, რადგან განადიდე შენს ყოველ სახელზე მეტად ნათქვამი შენი. "},
	{3, "3 რომელ დღესაც მოგიხმე, მიპასუხე, მხნეობად მიეც ჩემს სულს სიძლიერე. "},
	{4, "4 განგადიდებენ, უფალო, ყოველნი მეფენი ქვეყნიერებისა, როცა მოისმენენ ნათქვამს შენი პირისა. "},
	{5, "5 და უგალობებენ უფლის გზასავალს, რადგან დიდია პატივი უფლისა. "},
	{6, "6 რადგან მაღალია უფალი და დამდაბლებულს ხედავს; ხოლო მედიდურს შორიდან შეიცნობს. "},
	{7, "7 თუ გავივლი ჭირსა შიგან, შენ მაცოცხლებ; ჩემი მტრების ჯიბრზე გამომიწოდებ შენს ხელს და დამიხსნის მარჯვენა შენი. "},
	{8, "8 უფალი აღასრულებს ჩემს მაგიერ; უფალო, შენი წყალობა მარადიულია; არ მიატოვო ხელთა შენთა ნამოქმედარი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view138() {
struct ka138 poems[] = {
	{1, "1 გუნდის ლოტბარისათვის. დავითის ფსალმუნი. უფალო, გამომცადე და შემიცანი. "},
	{2, "2 შენთვის ცნობილია, როდის ვჯდები და ვდგები; გაგებული გაქვს ჩემი ზრახვანი შორიდან. "},
	{3, "3 ჩემი სიარული და ჩემი წოლა განსაზღვრე შენ და ყველა ჩემი გზა გამოიკვლიე. "},
	{4, "4 თუნდაც ჯერ არ იყოს სიტყვა ჩემს ენაზე, შენ უკვე იცი, უფალო, სრულად. "},
	{5, "5 უკნიდან და წინიდან გარემომიცავი და დადე ჩემზე ხელი შენი. "},
	{6, "6 უჩვეულოა ჩემთვის გასაგებად; აღზევებულია, ვერ შევწვდები მას. "},
	{7, "7 საით, წავუვალ შენს სულს და შენს სახეს სად გავექცევი? "},
	{8, "8 ზეცაში რომ ავიდე, შენ იქა ხარ, ქვესკნელში ჩავიდე და - იქაც ხარ! "},
	{9, "9 ავწიო ფრთენი განთიადისა, დავსახლდე ზღვის კიდეზე, "},
	{10, "10 იქაც შენი ხელი წამიძღვება და შემივრდომებს მარჯვენა შენი. "},
	{11, "11 და ვიტყვი: იქნებ ბნელმა დამფაროს და ღამე იქმნას სინათლედ ჩემთვის. "},
	{12, "12 სიბნელეც ვერ დაბინდავს შენგან და ღამე დღესავით გაანათებს; რა სიბნელე და რა სინათლე. "},
	{13, "13 რადგან შენ გამართე თირკმელნი ჩემნი, გამომძერწე დედაჩემის საშოში. "},
	{14, "14 გადიდებ, რადგან საოცრებით ვარ შენივთული; საკვირველია საქმენი შენნი და ჩემმა სულმა იცის ეს სავსებით. "},
	{15, "15 არ დაფარულა ჩემი ძვლები შენგან, როცა ჩავისახე იდუმალებაში, შევნივთდი ქვესკნელში. "},
	{16, "16 ჩემი ჩანასახი იხილა შენმა თვალებმა და შენს წიგნში ჩაწერილია დღენი მომავალი ჩასახვისა, როცა ჯერ არ არის არც ერთი მათგანი. "},
	{17, "17 ხოლო ჩემთვის რაოდენ მრავლისმთქმელია ზრახვანი შენნი, ღმერთო, რაოდენ დიდია რიცხვი მათი. "},
	{18, "18 დავთვალო, ქვიშაზე უმრავლესია; გავიღვიძო და, ისევ შენთან ვარ. "},
	{19, "19 ნეტამც მოსრავდე, ღმერთო, ბოროტს, სისხლისმსმელნო, განვედით ჩემგან! "},
	{20, "20 რომ გელაპარაკებიან მზაკვრულად, ამაოდ იზრახვიან შენი მტრები. "},
	{21, "21 ნუთუ არ მოვიძულო, უფალო, შენი მოძულენი, და შენს მოწინააღმდეგეებს არ ვედაო? "},
	{22, "22 სრული სიძულვილით მოვიძულე ისინი, მტრებად შევრაცხე. "},
	{23, "23 გამომცადე, უფალო, და შეიცან გული ჩემი; შემამოწმე და შეიცან აზრები ჩემი. "},
	{24, "24 ნახე, სახიფათო გზაზე ხომ არ ვდგავარ, და წამიძეღი მარადიულ გზაზე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view139() {
struct ka139 poems[] = {
	{1, "1 გუნდის ლოტბარს, ფსალმუნი დავითისა.  "},
	{2, "2 მიხსენი, უფალო, ბოროტი ადამიანისაგან, მოძალადე კაცისაგან დამიფარე. "},
	{3, "3 რომელნიც ბოროტებას ფიქრობენ გულში, ყოველდღე ემზადებიან საომრად. "},
	{4, "4 მოილესეს ენები გველივით, ასპიტის შხამია მათ ბაგეებს ქვეშ. სელა. "},
	{5, "5 დამიცავი, უფალო, ბოროტთა ხელიდან; მოძალადე კაცისაგან დამიფარე, რომელნიც ფიქრობენ ჩემი ნაბიჯების დაბრკოლებას. "},
	{6, "6 გამიმზადეს ამპარტავნებმა მახე და საბელი, ბადე განართხეს გზაზე, ხაფანგი დამიგეს. სელა. "},
	{7, "7 ვუთხარი უფალს: ჩემი ღმერთი ხარ შენ; ისმინე, უფალო, ხმა ჩემი ვედრებისა. "},
	{8, "8 უფალო! უფალო, ძალო ჩემი ხსნისა! ფარი ხარ ჩემი თავისა ბრძოლის დღეს. "},
	{9, "9 ნუ აასრულებ, უფალო, ბოროტის გულისწადილს, მის ბოროტ ზრახვას ნუ მისცემ გზას, თორემ აღზევდება. სელა. "},
	{10, "10 თავი ჩემთა გარემომცველთა დაფაროს ტვირთმა მათთა ბაგეთა. "},
	{11, "11 დაეცეთ ზემოდან ნაკვერჩხლები, ცეცხლში ჩაცვივდნენ, ღრმა ორმოში - ვეღარ წამოდგნენ. "},
	{12, "12 ავსიტყვა კაცი ნუ დამკვიდრდება ქვეყანაზე, მოძალე კაცი ბოროტებამ მოინადიროს ძირს დასაცემად. "},
	{13, "13 ვიცი, რომ იქმს უფალი განკითხვას გლახაკისა და სამართალს უპოვართა. "},
	{14, "14 ხოლო მართალნი განადიდებენ შენს სახელს, დამკვიდრდებიან გულწრფელნი შენს პირისპირ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view140() {
struct ka140 poems[] = {
	{1, "1 ფსალმუნი დავითისა. უფალო, შენ მოგიხმობ, გამოეშურე ჩემსკენ, მოისმინე ჩემი ხმა, რაჟამს მოგიხმობ შენ. "},
	{2, "2 წარიმართოს ჩემი ლოცვა საკმევლად შენს წინაშე, ხელთა აღპყრობა - შესაწირავად მწუხრის ჟამისა. "},
	{3, "3 დაუყენე, უფალო, გუშაგი ჩემს პირს, დაცვა - ჩემს ბაგეებს. "},
	{4, "4 არ გადაახვევინო ჩემს გულს ავი სიტყვის მხარეს ბოროტ საქმეთა ჩასადენად უსჯულო კაცებთან ერთად, და ნუ ვიგემებ მათს ტკბილეულობას. "},
	{5, "5 დაე, დამსაჯოს მართალმა, წყალობაა და მამხილოს. ზეთი თავისა არ ავნებს ჩემს თავს, რადგან კვლავაც ჩემი ლოცვა მათი ბოროტების წინააღმდეგ არის მიმართული. "},
	{6, "6 დაიმსხვრნენ კლდის კიდეებზე მსაჯულნი მათნი და მოისმენენ ჩემს სიტყვას, რადგან სასურველია. "},
	{7, "7 ვითარცა დახნან და გააპონ მიწაა. დაიფანტება ძვლები ჩვენი ჯოჯოხეთის ყბაში. "},
	{8, "8 რადგან შენსკენაა, უფალო, ღმერთო ჩემო, თვალი ჩემი; შენ გესავ- ნუ დააქცევ ჩემს სულს. "},
	{9, "9 დამიცავი მახისაგან, რომელიც დამიგეს, და ურჯულოთა ხაფანგთაგან. "},
	{10, "10 გაებან თავიანთ ბადეებში ბოროტნი ერთიანად, ვიდრე მე გავივლიდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view141() {
struct ka141 poems[] = {
	{1, "1 მოძღვრება დავითისა, ლოცვა მისი მღვიმეში ყოფნის დროს.  "},
	{2, "2 ჩემი ხმით უფალს შევღაღადებ, ჩემი ხმით უფალს შევევედრები. "},
	{3, "3 გადმოვღვრი მის წინაშე ჩემს გულისნადებს, ჩემს გასაჭირს მის წინაშე ვილაპარაკებ. "},
	{4, "4 როცა ჩემს შიგნით შეწუხებულია სული ჩემი, შენ იცი ჩემი გზა-კვალი; გზაზე, რომლითაც დავდივარ, დამიგეს მახე. "},
	{5, "5 ვიმზირები მარჯვნივ და ვხედავ, რომ არავინ მცნობს მე; აღარ არსებობს ხსნა ჩემთვის, არავინ ზრუნავს ჩემს სულზე. "},
	{6, "6 მოგიხმე, შენ, უფალო, ვთქვი: შენ ხარ ჩემი თავშესაფარი, ჩემი ხვედრი ცოცხალთა ქვეყანაში. "},
	{7, "7 ყური მიუგდე ჩემს ღაღადისს, რადგან დავმდაბლდი ფრიად; მიხსენი ჩემთა მდევნელთაგან, ვინაიდან ჩემზე ძლიერნი გახდნენ. "},
	{8, "8 გამოიყვანე საპყრობილედან სული ჩემი, რათა ვადიდო სახელი შენი. გარს შემომეხვევიან მართალნი, რადგანაც კეთილს მომაგებ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view142() {
struct ka142 poems[] = {
	{1, "1 ფსალმუნი დავითისა. უფალო, ისმინე ლოცვა ჩემი, ყურად იღე ჩემი ვედრება შენი ჭეშმარიტებით, მიპასუხე შენი სიმართლით. "},
	{2, "2 და ნუ შეხვალ სამართალში შენს მორჩილთან, რადგან ვერ გამართლდება შენს წინაშე ვერც ერთი არსება. "},
	{3, "3 რადგან დევნა მტერმა ჩემი სული; მიწაზე დაანარცხა ჩემი სიცოცხლე, დამსვა ბნელეთში, დიდი ხნის მკვდრების მსგავსად. "},
	{4, "4 და შეწუხდა ჩემზე სული ჩემი, ჩემს შიგნით დანაღვლიანდა გული ჩემი. "},
	{5, "5 ვიხსენებ ადრინდელ დღეებს, ვფიქრობ ყოველ შენს ნამოქმედარზე, შენი ხელის ნასაქმარზე ვისაუბრებ. "},
	{6, "6 ვიწვდი ხელებს შენსკენ. ჩემს სულს, ვითარცა მიწას გამოფიტულს, მოსწყურდი შენ. სელა. "},
	{7, "7 სწრაფად მიპასუხე, უფალო, სული ჩემი გაილია. ნუ დაფარავ შენს სახეს ჩემგან, თორემ დავემგვანები საფლავში ჩასულებს. "},
	{8, "8 მომასმენინე დილდილობით შენი წყალობა, რადგანაც შენით ვიმედოვნებ. მაუწყე, რომელი გზით ვიარო, რაკიღა შენსკენ აღვაპყარ სული ჩემი. "},
	{9, "9 გადამარჩინე მტერთა ჩემთაგან, უფალო. შენთან ვაფარებ თავს. "},
	{10, "10 მასწავლე შესრულება შენი ნებისა, რადგან შენ ჩემი ღმერთი ხარ. შენი კეთილი სული წამიძღვეს სიმართლის ქვეყანაში. "},
	{11, "11 შენი სახელის გულისათვის მაცოცხლე, უფალო. შენი სიმართლით გამოიყვანე გაჭირვებიდან ჩემი სული. "},
	{12, "12 და შენი წყალობით მოსპე ჩემი მტრები, და დაღუპე ყოველი მჩაგვრელი ჩემი სულისა, რადგან მე მორჩილი ვარ შენი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view143() {
struct ka143 poems[] = {
	{1, "1 დავითისა. კურთხეული არს უფალი, ბურჯი ჩემი, რომელმაც ასწავლა ჩემს ხელებს ბრძოლა, ჩემს თითებს - ომი. "},
	{2, "2 მწყალობელო ჩემო და სიმაგრევ ჩემო, მცველო ჩემო და მხსნელო ჩემო; ჩემი ფარი ხარ და მასზე ვარ დანდობილი, ის ჩემს ხალხს გახდის მორჩილად ჩემდა. "},
	{3, "3 უფალო, რა არის კაცი, რომ იცნო ის, ძე ადამისა, რომ მიიჩნიო ის? "},
	{4, "4 ადამიანი ჰგავს ამაოებას, მისი დღეები - ვითარცა ჩრდილი გარდასული. "},
	{5, "5 უფალო, მოდრიკე ცანი შენნი და გადმოდი, შეეხე მთებს, რომ აკვამლდნენ. "},
	{6, "6 გამოაელვე ელვანი და გაფანტე ისინი, გამოუშვი ისარნი შენნი და თავზარი დაეცი მათ. "},
	{7, "7 გამოიწოდე შენი ხელი მაღლიდან; მიხსენი და გადამარჩინე მრავალ წყალთაგან, უცხო ტომთა ხელიდან. "},
	{8, "8 რომელთა ბაგენი ტყუილს ლაპარაკობენ და რომელთა მარჯვენა სიცრუის მარჯვენაა. "},
	{9, "9 ღმერთო, ახალ გალობას გიგალობებ შენ, ათსიმიან ჩანგზე გიგალობებ შენ. "},
	{10, "10 რომელიც უბოძებს ხსნას მეფეებს, იხსნის დავითს - თავის მორჩილს ბოროტი მახვილისაგან. "},
	{11, "11 მიხსენი და გადამარჩინე უცხოელთა ხელიდან, რომელთა ბაგენი ტყუილს ლაპარაკობენ და რომელთა მარჯვენა სიცრუის მარჯვენაა. "},
	{12, "12 რომ ჩვენი ვაჟები ნერგებივით იზრდებოდნენ მათს სიჭაბუკეში; ჩვენი ასულნი, ვითარცა ოსტატურად თლილი სვეტები სასახლისა. "},
	{13, "13 ჩვენი ბეღლები სავსე იყოს ნაირნაირი მოსავლით. ცხვარნი ჩვენნი ათასობდნენ, ათიათასობდნენ ჩვენს საძოვრებზე. "},
	{14, "14 ჩვენი ხარები დტვირთულნი იყვნენ. არც ზარალი და არც დანაკლისი, არც გოდება ჩვენს ქუჩებში. "},
	{15, "15 ნეტარ არს ხალხი, რომლისთვისაც ასეა. ნეტარ არს ხალხი, რომელსაც ჰყავს უფალი, თავისი ღმერთი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view144() {
struct ka144 poems[] = {
	{1, "1 ხოტბა დავითისა. აღგამაღლებ შენ, ღმერთო ჩემო, მეფეო, და ვაკურთხებ შენს სახელს უკუნითი უკუნისამდე. "},
	{2, "2 ყოველდღე გაკურთხებ შენ და ვადიდებ შენს სახელს უკუნითი უკუნისამდე. "},
	{3, "3 დიდია უფალი და ქებულია ფრიად და მისი სიდიადე მიუწვდომელია. "},
	{4, "4 თაობა თაობას უქებს შენს საქმეებს და შენს სიძლიერეზე მოუთხრობენ. "},
	{5, "5 შენს დიდმშვენიერებაზე, დიდებაზე, ბრწყინვალებაზე, შენს საოცარ საქმეებზე ვილაპარაკებ. "},
	{6, "6 შენთა საშიშროებათა სიძლიერეს იტყვიან, ხოლო მე შენს სიდიადეზე ვილაპარაკებ. "},
	{7, "7 ხსენებას შენი მრავალი სიკეთისას გამოთქვამენ და შენს სიმართლეს უმღერებენ. "},
	{8, "8 გულმოწყალე და შემბრალეა უფალი, სულგრძელი და დიდად მოწყალე. "},
	{9, "9 კარგია უფალი ყველას მიმართ და მისი წყალობაა ყველა მის ნამოქმედარზე. "},
	{10, "10 გადიდებს შენ, უფალო, ყველა შენი ნამოქმედარი და შენი წმიდანები გადიდებენ შენ. "},
	{11, "11 შენი მეფობის დიდებას იტყვიან და შენს სიძლიერეზე ილაპარაკებენ. "},
	{12, "12 რათა აცნობონ ადამის ძეთ შენი სიძლიერე, და ბრწყინვალე დიდება შენი მეფობისა. "},
	{13, "13 შენი მეფობა მეფობაა ყველა საუკუნისა და შენი ბატონობა თაობებში. "},
	{14, "14 უფალი შემწეა ყველა დაცემულისა და გამმართავი ყველა წელში მოხრილისა. "},
	{15, "15 ყველას თვალები შენ შემოგცქერიან და შენ აძლევ მათ საზრდოს თავის დროზე. "},
	{16, "16 აღაპყრობ შენს ხელს და დააკმაყოფილებ ყოველ სულდგმულს. "},
	{17, "17 მართალია უფალი ყველა თავის გზაზე და მოწყალეა ყველა თავის საქმეში. "},
	{18, "18 ახლოა უფალი ყველა მის მლოცველთან, ყოველთან, ვინც მას მოუხმობს ჭეშმარიტებით. "},
	{19, "19 მის მოშიშთა სურვილს შეასრულებს და მათს ღაღადისს მოისმენს და უშველის მათ. "},
	{20, "20 იცავს უფალი ყველა მის მოყვარულს და ყველა ბოროტს მოსპობს. "},
	{21, "21 ხოტბას უფლისას ილაპარაკებს პირი ჩემი და აქებს ყოველი ხორციელი მის წმიდა სახელს უკუნითი უკუნისამდე. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view145() {
struct ka145 poems[] = {
	{1, "1 ადიდეთ უფალი. ადიდე, სულო ჩემო, უფალი. "},
	{2, "2 ვადიდებ უფალს მთელი სიცოცხლე, ვუგალობებ ჩემს ღმერთს, ვიდრე ვარსებობ. "},
	{3, "3 იმედს ნუ დაამყარებთ მთავრებზე, ადამს ძეზე, რომელსაც არ შეუძლია შველა. "},
	{4, "4 ამოუვა სული, დაუბრუნდება თავის მიწას; იმ დღეს გაქრება მისი ფიქრები. "},
	{5, "5 ნეტარ არს, ვისიც შემწეა ღმერთი იაკობისა, ვინც დაიმედებულია უფალ ღმერთზე. "},
	{6, "6 რომელმაც შეჰქმნა ცა და მიწა, ზღვა და ყოველივე, რაც მათშია; რომელიც იცავს ჭეშმარიდ;ერს უკუნისამდე; "},
	{7, "7 იქმს სამართალს ჩაგრულთათვის; აძლევს პურს დამშეულებს; უფალი ათავისუფლებს ბორკილგაყრილებს. "},
	{8, "8 უფალი თვალს უხელს ბრმებს, უფალი მართავს წელმოდრეკილებს, უფალს უყვარს მართალნი. "},
	{9, "9 უფალი იცავს შემოხიზნულებს, ობოლსა და ქვრივს გაამხნევებს და ბოროტთა გზას გაამრუდებს. "},
	{10, "10 იმეფებს უფალი უკუნისამდე, შენი ღმერთი, სიონო, თაობებში. ადიდეთ უფალი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view146() {
struct ka146 poems[] = {
	{1, "1 ადიდეთ უფალი! რადგან კარგია განდიდება ჩვენი უფლისა, რადგან სასურველია, შეშვენის ქება-დიდება. "},
	{2, "2 ააშენებს იერუსალიმს უფალი, განდევნილებს ისრაელისას შემოკრებს. "},
	{3, "3 განკურნავს გულგატეხილებს და ჭრილობებს შეუხვევს მათ. "},
	{4, "4 დაიანგარიშებს ვარსკვლავთა რიცხვს, ყველას თავის სახელს უწოდებს. "},
	{5, "5 დიდია უფალი და დიდძალოვანი, მისი გონიერება განუზომელია. "},
	{6, "6 გაამხნევებს მორჩილებს უფალი, ბოროტეულებს დაამდაბლებს მიწამდე. "},
	{7, "7 გაეხმიანეთ უფალს სამადლობელით, უგალობეთ ჩვენს ღმერთს ქნარით. "},
	{8, "8 რომელიც ფარავს ცას ღრუბლებით, ამზადებს დედამიწისათვის წვიმას, აღმოაცენებს მთებში ბალახს. "},
	{9, "9 აძლევს პირუტყვს თავის საზრდოს, ყორნის ბარგყებს, რომელნიც მოუხმობენ მას. "},
	{10, "10 არც ცხენის ძლიერებას ისურვებს, არც კაცის მუხლმაგრობას ინებებს. "},
	{11, "11 ისურვებს უფალი თავის მოშიშებს, მისი წყალობის მოიმედეებს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view147() {
struct ka147 poems[] = {
	{1, "1 აქე, იერუსალიმო, უფალი; ადიდე შენი ღმერთი, სიონო! "},
	{2, "2 რადგან გაამაგრა ურდულები შენი ჭიშკრების, აკურთხა ძენი შენნი შენთან. "},
	{3, "3 დაამკვიდრებს შენს საზღვრებზე მშვიდობას, ხორბლის ყუათით დაგამაძღრისებს. "},
	{4, "4 ვინც წარმოავლენს თავის სიტყვას დედამიწაზე, ანაზდეულად გაიქცევა ნათქვამი მისი. "},
	{5, "5 წარმოგზავნის თოვლს მატყლივით, თრთვილს ფერფლით მიმოფანტავს. "},
	{6, "6 გადმოუშვებს სეტყვას პურის ნატეხებივით, მის სუსხს ვინ დაუდგება წინ? "},
	{7, "7 მოავლენს თავის სიტყვას და დაადნობს მათ; დაუბერავს თავის ქარს და გადმოდინდება წყალი. "},
	{8, "8 ამცნო თავისი სიტყვა იაკობს, წესები და სამართალნი თვისნი - ისრაელს. "},
	{9, "9 არ უქნია ეს არცერთი სხვა ერისათვის და მისი სამართალნი არ იციან მათ. ადიდეთ უფალი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view148() {
struct ka148 poems[] = {
	{1, "1 ადიდეთ უფალი. ადიდეთ უფალი ზეციდან, ადიდეთ იგი სიმაღლეებში. "},
	{2, "2 ადიდეთ იგი, ყოველნო ანგელოზნო მისნო, ადიდეთ იგი, ყოველნო ძალნო მისნო. "},
	{3, "3 ადიდეთ იგი, მზეო და მთვარევ, ადიდეთ იგი, ყოველნო შუქურვარსკვლავნო. "},
	{4, "4 ადიდეთ იგი, ცანო ცათანო, და წყლებო, რომელნიც ცათა მაღლა ხართ. "},
	{5, "5 ადიდონ სახელი უფლისა, რადგან მან ბრძანა და შეიქმნენ. "},
	{6, "6 და დააყენა ისინი უკუნითი უკუნისამდე, კანონი მისცა და არავინ გადაუხვევს. "},
	{7, "7 ადიდეთ უფალი დედამიწიდან, ვეშაპნო და ყოველნო უფსკრულნო, "},
	{8, "8 ცეცხლო და სეტყვავ, თოვლო და კვამლო, ქარბუქო, მისი სიტყვის შემსრულებელო, "},
	{9, "9 მთანო და ყოველნო ბორცვნო, მსხმოიარე ხევ და ყოველნო კედარნო. "},
	{10, "10 მხეცნო და ყოველნო პირუტყვნო, ქვეწარმავალო და ფრინველო ფრთოსანო; "},
	{11, "11 მეფენო ქვეყნისა და ყოველნო ერნო, მთავარნო და ყოველნო მსაჯულნო ქვეყნისა. "},
	{12, "12 ჭაბუკნო და თქვენც, ქალწულნო, მოხუცნო, ყმაწვილებთან ერთად, "},
	{13, "13 ადიდეთ სახელი უფლისა, რადგან მხოლოდ მისი სახელია ამაღლებული, მისი სიდიდეა ქვეყნად და ცაში. "},
	{14, "14 და მოამაღლა ღირსება თავისი ხალხისა, დიდება ყოველი მისი წმიდანისა, ძეთა ისრაელისა, მასთან დაახლოებული ხალხისა. ადიდეთ უფალი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view149() {
struct ka149 poems[] = {
	{1, "1 ადიდეთ უფალი. უგალობეთ უფალს გალობა ახალი, მისი დიდება წმიდათა კრებულში. "},
	{2, "2 ახარებდეს ისრაელი თავისი შემოქმედით, ძენი სიონისა ზეიმობდნენ თავიანთი მეფით. "},
	{3, "3 განადიდონ მისი სახელი ცეკვით, დაფით და ქნარით უგალობონ მას. "},
	{4, "4 რადგან ისურვებს უფალი თავის ხალხს, დაამშვენებს მორჩილებს შეწევნით. "},
	{5, "5 იმხიარულონ წმიდანებმა ღირსებით, იღაღადონ თავიანთ სარეცლებზე. "},
	{6, "6 ღმერთის განდიდება მათ ხორხში და მახვილი ორლესული მათ ხელში. "},
	{7, "7 რათა შური იძიონ წარმართებზე, დასაჯონ ერები. "},
	{8, "8 შეკრან მეფენი ბორკილებით და დიდებულნი მათნი - რკინის ხუნდებით. "},
	{9, "9 განუმზადონ მათ სამართალი დაწერილი, დიდებაა ის ყველა მისი წმიდანისათვის. ადიდეთ უფალი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view150() {
struct ka150 poems[] = {
	{1, "1 ადიდეთ უფალი. ადიდეთ ღმერთი თავის წმიდაში, ადიდეთ იგი მისი ძლიერების მყარში. "},
	{2, "2 ადიდეთ იგი მისი ძლიერებით, ადიდეთ იგი მისი სიდიადის მრავალგვარობით. "},
	{3, "3 ადიდეთ იგი ბუკის ცემით, ადიდეთ იგი ჩანგით და ქნარით. "},
	{4, "4 ადიდეთ იგი დაფით და როკვით, ადიდეთ იგი ებანით და სტვირით. "},
	{5, "5 ადიდეთ იგი ტკბილხმოვანი წინწილებით, ადიდეთ იგი მაღალხმოვანი წინწილებით. "},
	{6, "6 ყოველმა სულდგმულმა ადიდოს უფალი. ადიდეთ უფალი! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view151() {
struct ka151 poems[] = {
	{1, "1 მე უმცროსი ვიყავ ჩემს ძმათა შორის, ჭაბუკი ვიყავ მამაჩემის სახლში. ვმწყემსავდი მამაჩემის ცხვარს. "},
	{2, "2 ჩემმა ხელებმა ორგანონი გამართეს, ჩემი თითები ქნარს აწყობდნენ. "},
	{3, "3 ვინ აუწყებდა ჩემს უფალს ჩემზე? თავად უფალმა, თავად მისმინა. "},
	{4, "4 თავად გამომიგზავნა თავისი მაცნე. წამომიყვანა მამაჩემის ცხვრიდან. და მცხო ზეთი თავისი ცხებისა. "},
	{5, "5 ჩემი ძმანი მშვენიერნი და ტანადნი იყვნენ, მაგრამ ისინი არ ინდომა უფალმა. "},
	{6, "6 მე გამოვედი უცხო თესლ-ტომთან საომრად და დამწყევლა მან თავისი კერპებით. "},
	{7, "7 მაგრამ მე ამოვართვი მას მახვილი, წავკვეთე თავი და სირცხვილს გადავარჩინე ისრაელიანნი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};