#include <map>
#include <string>
class Bible57
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 პავლე და ტიმოთე, იესო ქრისტეს მონები, - ყველა წმიდას ქრისტე იესოში, რომელნიც არიან ფილიპეში, ეპისკოპოსებითა და დიაკვნებითურთ: "},
	{2, "2 მადლი თქვენდა და მშვიდობა ჩვენი მამა ღმერთისა და უფალ იესო ქრისტესაგან. "},
	{3, "3 მადლობას ვწირავ ჩემს ღმერთს თქვენი ყოველი გახსენებისას. "},
	{4, "4 ყოველთვის, ჩემი ყოველი ლოცვისას, სიხარულით ვლოცულობ თქვენთვის, "},
	{5, "5 რადგანაც ჩემი თანამოზიარენი იყავით სახარებაში, პირველი დღიდან აქამდე. "},
	{6, "6 მწამს, რომ თქვენს შორის კეთილი საქმის დამწყები კიდევაც აღასრულებს მას იესო ქრისტეს დღემდე. "},
	{7, "7 რადგანაც გულში მყავხართ ყველანი, ჩემი ტყვეობისას თუ სახარების დაცვისას და განმარტებისას, როგორც ჩემი მადლის თანაზიარნი. "},
	{8, "8 ვინაიდან ღმერთი მყავს მოწმედ, როგორ მიყვარხართ ყველანი იესო ქრისტეს სიყვარულით; "},
	{9, "9 და ვლოცულობ, რომ თქვენი სიყვარული სულ უფრო იზრდებოდეს შემეცნებასა და ყოველგვარ შეგრძნებაში, "},
	{10, "10 რათა შეიცნოთ, რა არის უმჯობესი და, ამრიგად, წრფელნი და შეუმცთარნი იყოთ ქრისტეს დღეს, "},
	{11, "11 სიმართლის ნაყოფით აღვსილნი იესო ქრისტეს მიერ, ღვთის საქებრად და სადიდებლად. "},
	{12, "12 მინდა იცოდეთ, ძმანო, რომ ყოველივე იმან, რაც თავს გადამხდა, დიდად შეუწყო ხელი სახარების წარმატებას. "},
	{13, "13 ასე რომ, ჩემი ტყვეობა ქრისტეში ცხადი შეიქნა მთელი პრეტორიუმისა და ყველა დანარჩენისთვის, "},
	{14, "14 რის შედეგადაც, ძმათა უმრავლესობამ, ჩემი ბორკილებით განმტკიცებულმა უფალში, უფრო თამამად და გაბედულად დაიწყო ღვთის სიტყვის ქადაგება. "},
	{15, "15 თუმცა ზოგიერთნი შურით და ურთიერთჯიბრით, ზოგიერთნი კი კეთილგანწყობით ქადაგებენ ქრისტეს. "},
	{16, "16 ერთნი ჯიბრით ქადაგებენ ქრისტეს არაწმიდად, რათა ურვა მიუსართონ ჩემს ბორკილებს. "},
	{17, "17 მეორენი კი - სიყვარულით, რადგანაც იციან, რომ სახარების დამცველად ვდგავარ. "},
	{18, "18 მერედა, რა? როგორც უნდა იქადაგებოდეს ქრისტე, პირმოთნეობით თუ ჭეშმარიტებით, მე ვხარობ და კვლავაც ვიხარებ, "},
	{19, "19 რადგანაც ვიცი, რომ ეს წამადგება სახსნელად, თქვენი ლოცვებითა და იესო ქრისტეს სულის შეწევნით, "},
	{20, "20 თანახმად ჩემი მოლოდინისა და სასოებისა, რომ არაფერში შევრცხვები, არამედ მთელი სითამამით, როგორც ყოველთვის, ისე ახლაც იდიდება ქრისტე ჩემს სხეულში, სიცოცხლით იქნება თუ სიკვდილით. "},
	{21, "21 რადგანაც ჩემთვის სიცოცხლე ქრისტეა, სიკვდილი კი - მონაგები. "},
	{22, "22 მაგრამ თუ ხორციელად სიცოცხლე ნაყოფს შემატებს ჩემს საქმეს, არც კი ვიცი, რომელი ვირჩიო. "},
	{23, "23 ერთიც მიზიდავს და მეორეც: გული მითქვამს, რომ გასვლა და ქრისტესთან ყოფნა ათასწილ უმჯობესია. "},
	{24, "24 ხორციელად ყოფნა კი უფრო საჭიროა თქვენთვის. "},
	{25, "25 თუმცა დანამდვილებით ვიცი, რომ დავრჩები და ყველა თქვენგანთან ვიქნები თქვენი წარმატებისა და თქვენივე რწმენის სიხარულისთვის, "},
	{26, "26 რათა თქვენმა სიქადულმა ჩემი მეოხებით იმრავლოს ქრისტე იესოში, როცა ხელახლა გეწვევით. "},
	{27, "27 მაგრამ ისე კი იცხოვრეთ, როგორც შეჰფერის ქრისტეს სახარებას, რათა, მოვალ და გიხილავთ, თუ შორს ვიქნები, მხოლოდ ის მესმოდეს თქვენზე, რომ ერთსულოვნად დგახართ და ერთობლივად იღვწით სახარების რწმენისთვის. "},
	{28, "28 ნურაფერში შეუკრთებით თქვენს წინააღმდგომთ; მათთვის ეს წარწყმედის ნიშანია, თქვენთვის კი - ხსნისა, და ეს ღვთისაგან არის. "},
	{29, "29 რადგანაც ქრისტეს გულისთვის მარტო რწმენა კი არ მოგეცათ, არამედ ვნებაც მისთვის, "},
	{30, "30 იმავე ღვაწლით, რა ღვაწლიც ჩემში გიხილავთ და ახლაც გესმით, რომ ვიღვწი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 ამრიგად, თუ არის რაიმე ნუგეში ქრისტეში, თუ არის რაიმე სიამე სიყვარულისა, თუ არის რაიმე თანაზიარობა სულისა, თუ არის რაიმე თანალმობა ან წყალობა, "},
	{2, "2 აღავსეთ ჩემი სიხარული, რათა იყოთ თანამზრახველნი, ერთი და იმავე სიყვარულით გულშეძრულნი, ერთსულოვანნი და თანამოაზრენი. "},
	{3, "3 ნურას ჩაიდენთ ცილობით და ცუდმედიდობით, არამედ, ქედმოდრეკილნი, საკუთარ თავზე უმეტესად მიიჩნევდეთ ერთიმეორეს. "},
	{4, "4 მარტო თავის თავზე ნუკი ზრუნავს თვითეული თქვენგანი, არამედ სხვებზეც იზრუნოს. "},
	{5, "5 იგივე ზრახვები გქონდეთ, როგორიც ქრისტე იესოს, "},
	{6, "6 რომელსაც, თუმცა ღვთის ხატი იყო, ნაძარცვად არ შეურაცხავს ღვთის სწორად ყოფნა. "},
	{7, "7 მაგრამ თავი დაიმცრო, მონის ხატი შეიმოსა და გარეგნობით კაცის მსგავსებად იქცა. "},
	{8, "8 თავი დაიმდაბლა და მორჩილი გახდა თვით სიკვდილამდე, ჯვარცმით სიკვდილამდე. "},
	{9, "9 ამიტომაც აღამაღლა იგი ღმერთმა და ყველა სახელზე უზენაესი სახელი მისცა, "},
	{10, "10 რათა იესოს სახელის წინაშე მოიდრიკოს ყოველი მუხლი, ზეცისაც, ქვეყნისაც და ქვესკნელისაც, "},
	{11, "11 და ყველა ენამ აღიაროს, რომ იესო ქრისტე არის უფალი, სადიდებლად ღვთის და მამისა. "},
	{12, "12 ამრიგად, ჩემო საყვარელნო, როგორც ყოველთვის მორჩილნი იყავით, არა მარტო ჩემი მანდ ყოფნისას, არამედ, მით უმეტეს, ახლა, როცა შორსა ვართ თქვენგან, - შიშით და ძრწოლით აღასრულეთ თქვენი ხსნის საქმე. "},
	{13, "13 რადგან ღმერთია ის, ვინც ბადებს თქვენში ნდომასაც და ქმედებასაც თავისი კეთილნებელობით. "},
	{14, "14 ყველაფერი აღასრულეთ უდრტვინველად და უყოყმანოდ, "},
	{15, "15 რათა იყოთ უბიწონი და უმანკონი, ღვთის უმწიკვლო შვილნი უკუღმართ და გახრწნილ მოდგმაში, რომელშიც ნათობთ, როგორც მნათობნი სამყაროში, "},
	{16, "16 სიცოცხლის სიტყვის მფლობელნი, რათა ქრისტეს დღეს დავიქადო, რომ ამაოდ არ ვრბოდი და არც ამაოდ ვიღვწოდი. "},
	{17, "17 მაგრამ სისხლადაც რომ ვესხურო თქვენი რწმენის მსხვერპლს და მსახურებას, თქვენთან ერთად ვილხენ და ვხარობ. "},
	{18, "18 მაშ, თქვენც ილხენდეთ და ხარობდეთ ჩემთან ერთად. "},
	{19, "19 იმედი მაქვს, თუ უფალმა ჩვენმა ქრისტემ ინება, მალე გაახლოთ ტიმოთე, რათა შევიტყო თქვენი ამბავი და მეც გავმხნევდე სულით. "},
	{20, "20 რადგანაც სხვა არავინ მყავს ჩემი სულის თანაზიარი, მასავით წრფელად რომ ზრუნავდეს თქვენზე. "},
	{21, "21 ვინაიდან ყველა თავისას ეძებს და არა იესო ქრისტესას. "},
	{22, "22 მის გამოცდილებას კი იცნობთ, ვინაიდან, როგორც მამას - შვილი, ისე ემსახურა სახარებას ჩემთან ერთად. "},
	{23, "23 ასე რომ, იმედი მაქვს მალე გაახლოთ, როგორც კი გავიგებ, რა მელის. "},
	{24, "24 მჯერა უფლისა, რომ თვითონაც მალე გეწვევით. "},
	{25, "25 მაგრამ საჭიროდ მივიჩნიე გამომეგზავნა ეპაფროდიტოსი, ჩემი ძმა, ჩემი თანამოსაქმე და თანამებრძოლი, იგივე თქვენი მოციქული და ჩემი გაჭირვების მსახური. "},
	{26, "26 რადგანაც გულით უნდოდა ყველა თქვენგანის ნახვა და ძალზე შეწუნდა, როცა გაიგო, რომ თქვენამდეც მოუღწევია მისი ავადმყოფობის ამბავს. "},
	{27, "27 და მართლაც, ისე ავად იყო, რომ კინაღამ ხელიდან გამოგვეცალა, მაგრამ ღმერთმა შეიწყალა ის, და არა მარტო ის, არამედ მეც, რათა მწუხარება მწუხარებაზე არ დამრთვოდა. "},
	{28, "28 ამიტომ საჩქაროდ გამოვგზავნე, რომ გაგეხარათ მისი ხილვით და მეც მომკლებოდა სადარდელი. "},
	{29, "29 მთელი სიხარულით შეიწყნარეთ იგი უფალში და პატივი ეცით მისთანებს. "},
	{30, "30 ვინაიდან ქრისტეს სამსახურისათვის გადადო და სასიკვდილოდ გასწირა თავი, რათა ჩემდამი თქვენი სამსახურის დანაკლისი შეევსო. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 სხვა მხრივ კი, იხარეთ, ძმანო, უფალში. ამის მოწერა საძნელო როდია ჩემთვის, თქვენთვის კი სიმხნევეა. "},
	{2, "2 ერიდეთ ძაღლებს, ერიდეთ ბოროტის მოქმედთ, ერიდეთ წინადაცვეთას, "},
	{3, "3 რადგანაც წინადაცვეთილნი ჩვენა ვართ, სულით რომ ვემსახურებით ღმერთს, ქრისტე იესოთი ვიქადით და ხორცზე არ ვამყარებთ იმედს. "},
	{4, "4 თუმცა მე შეიძლება ხორცის იმედიც მქონდეს; თუკი სხვა ვინმე ფიქრობს, რომ ხორცის იმედი აქვს, მე - მით უმეტეს: "},
	{5, "5 მერვე დღეს წინადაცვეთილი, მოდგმით ისრაელიტი, ბენიამინის ტომიდან, ებრაელთაგან ებრაელი, სწავლით ფარისეველი, "},
	{6, "6 შურით ეკლესიის მდევნელი, რჯულის სიმართლით უმწიკვლო, "},
	{7, "7 მაგრამ რაც ჩემთვის სარგო იყო, ზარალად შევრაცხე ქრისტეს გულისთვის; "},
	{8, "8 და ყოველივე დანარჩენიც ზარალად შემირაცხავს იმ უზენაეს სიკეთესთან შედარებით, რასაც ჰქვია ჩემი უფლის - ქრისტეს შეცნობა, რისთვისაც ვიზარალე ყოველი, და ყველაფერი ნაგვად მიმაჩნია, რათა შევიძინო იესო ქრისტე, "},
	{9, "9 და ვიყო მასში, მაგრამ არა ჩემი სიმართლით, რომელიც არის რჯულისაგან, არამედ სიმართლით, ქრისტეს რწმენისა და ღვთისაგან რომ იღებს დასაბამს და რწმენაზევეა დაფუძნებული;"},
	{10, "10 რათა შევიცნო ისიც, მისი აღდგომის ძალაც და თანაზიარობაც მისი ვნებებისა, ვემსგავსო მის სიკვდილს "},
	{11, "11 და ამრიგად მივწვდე მკვდრეთით აღდგომას. "},
	{12, "12 იმიტომ კი არა, თითქოს უკვე ვეზიარე ან მივაღწიე სრულქმნილებას, არამედ ვესწრაფვი, იქნებ მივწვდე-მეთქი, როგორც მე მომწვდა ქრისტე იესო. "},
	{13, "13 არა მგონია, ძმანო, რომ უკვე მივწვდი ან მივაღწიე; მხოლოდ ეს კია: ვივიწყებ, რაც უკან დამრჩა, და რაც წინ მიძევს, იმას მიველტვი;"},
	{14, "14 დიახ, მიველტვი მიზანს, ღვთის უზენაესი ხმობის პატივს იესო ქრისტეში. "},
	{15, "15 ამრიგად, ვინც სრულქმნილია, სწორედ ასე უნდა ფიქრობდეს; მაგრამ სხვანაირადაც რომ ფიქრობდეთ, ღმერთი გამოგიცხადებთ ამასაც. "},
	{16, "16 ასე რომ, რასაც მივაღწიეთ, იმავე გზით უნდა ვიაროთ. "},
	{17, "17 მაშ, ასე, მე მომბაძეთ, ძმანო, და დაუკვირდით მათ, იმ ნიმუშის მიხედვით რომ იქცევიან, რაცა გაქვთ ჩვენში. "},
	{18, "18 რადგანაც ბევრნი, ვის შესახებაც ხშირად მითქვამს თქვენთვის, ახლა კი ტირილით გეუბნებით, ისე იქცევიან, როგორც ქრისტეს ჯვრის მტრები, "},
	{19, "19 რომელთა ბოლო წარწყმედაა, ღმერთი - მუცელი, დიდება კი - სირცხვილი, რადგანაც მიწიერზე ფიქრობენ. "},
	{20, "20 ხოლო ჩვენი მოქალაქეობა ცაშია, საიდანაც მოველით მხსნელსაც - უფალ იესო ქრისტეს, "},
	{21, "21 რომელიც ისე გარდაქმნის ჩვენს დამდაბლებულ სხეულს, რომ თავის დიდებულ სხეულს დაამსგავსებს იმ ძალისხმევით, რითაც თავის თავს უმორჩილებს ყოველს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 ამიტომ, ჩემო ძვირფასო და სასურველო ძმანო, სიხარულნო და გვირგვინნო ჩემნო, ასე იდექით უფალში, საყვარელნო. "},
	{2, "2 ვევედრები ევოდიას და სინტიქეს, თანამოაზრენი იყვნენ უფალში. "},
	{3, "3 შენც გევედრები, ერთგულო თანამდგომო, შეეწიე მათ, ჩემთან ერთად რომ იღვწოდნენ სახარებაში, კლემენტესა და ჩემს სხვა თანამშრომლებთან ერთად, რომელთა სახელებიც ჩაწერილია სიცოცხლის წიგნში. "},
	{4, "4 მარადჟამ იხარეთ უფალში, და კვლავაც ვიტყვი: იხარეთ. "},
	{5, "5 თვინიერება თქვენი, დაე, იცოდეს ყოველმა კაცმა. უკვე ახლოა უფალი. "},
	{6, "6 ნუ შეგაურვებთ ნურავითარი საზრუნავი, არამედ ლოცვა-ვედრებისას თქვენი სათხოვარი მადლიერებით გაუმჟღავნეთ ღმერთს. "},
	{7, "7 და მშვიდობა ღვთისა, რომელიც ყველა გონებაზე უზენაესია, დაიფარავს თქვენს გულებს და თქვენს ზრახვებსაც ქრისტე იესოში. "},
	{8, "8 და ბოლოს, ძმანო, რაც კი რამ ჭეშმარიტია და პატიოსანი, რაც მართალია და წმიდა, რაც საყვარელია და საქებარი, სათნო და ქებული, იმაზე იფიქრეთ. "},
	{9, "9 რაც გისწავლიათ და მიგიღიათ, რაც გსმენიათ და გიხილავთ ჩემში, ის აღასრულეთ და ღმერთი მშვიდობისა იქნება თქვენთან. "},
	{10, "10 დიდად გავიხარე უფალში, რომ კვლავ დაიწყეთ ჩემზე ზრუნვა; თუმცა უწინაც ზრუნავდით, მაგრამ ვითარებამ დაგაბრკოლათ. "},
	{11, "11 იმიტომ როდი ვამბობ, რომ მიჭირს, რადგანაც ვისწავლე კმაყოფილი ვიყო იმით, რაცა მაქვს. "},
	{12, "12 გაჭირვებაც ვიცი რა არის და დალხინებაც, ყველაფერი გამომიცდია: სიმაძღრეც და შიმშილიც, სიმწირეც და სიუხვეც."},
	{13, "13 ყველაფერი შემიძლია ჩემს განმამტკიცებელ ქრისტეში. "},
	{14, "14 მაგრამ კარგად მოიქეცით, რომ გაიზიარეთ ჩემი გასაჭირი. "},
	{15, "15 თქვენ ხომ იცით, ფილიპელნო, რომ ხარების დასაბამს, როცა მაკედონიიდან გამოვედი, თქვენს გარდა არცერთმა ეკლესიამ არაფერი გამიზიარა: არც რა მომცა და არც რა მიიღო ჩემგან. "},
	{16, "16 თქვენ კი ერთი-ორჯერ თესალონიკეშიც გამომიგზავნეთ, რაც მჭირდებოდა. "},
	{17, "17 იმიტომ კი არა, თითქოს მოსაკითხს ვეძებდე, არამედ ვეძებ ნაყოფს, რომელიც მრავლდება თქვენდა სარგებლად. "},
	{18, "18 ყველაფერი მივიღე და ბლომადაც მაქვს, სავსე ვარ იმით, რაც ეპაფროდიტოსის ხელით გამომიგზავნეთ: კეთილსურნელება, საამო შეწირულება, ესოდენ სასურველი ღვთისათვის. "},
	{19, "19 ხოლო თქვენ ჩემი ღმერთი შეგივსებთ ყოველგვარ ნაკლულებას თავისი სიუხვით და დიდებით, ქრისტე იესოში. "},
	{20, "20 ღმერთსა და მამას ჩვენსას დიდება უკუნითი უკუნისამდე. ამინ. "},
	{21, "21 მოიკითხეთ ყველა წმიდა ქრისტე იესოში. მოგიკითხავენ ჩემთან მყოფი ძმები. "},
	{22, "22 მოკითხვას გითვლიან ყველა წმიდანი, უმეტესად კეისრის სახლისანი. "},
	{23, "23 ჩვენი უფლის იესო ქრისტეს მადლი ყველა თქვენგანის სულს. ამინ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};