#include <map>
#include <string>
class Bible50
{
	struct ka1	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 უხუცესი - საყვარელ გაიუსს, რომელიც მიყვარს ჭეშმარიტებით. "},
	{2, "2 საყვარელო, ვლოცულობ, რომ კეთილად გევლოს და კარგად იყო, როგორც კეთილად ვალს შენი სული. "},
	{3, "3 რადგანაც დიდად გავიხარე, როცა მოვიდნენ ძმები და მიმოწმეს შენი ჭეშმარიტება, თუ როგორ დადიხარ ჭეშმარიტებით. "},
	{4, "4 რა უნდა იყოს ჩემთვის უფრო სასიხარულო, ვიდრე იმის გაგება, თუ როგორ დადიან ჭეშმარიტებით ჩემი შვილები. "},
	{5, "5 საყვარელო, ერთგულად აკეთებ ყველაფერს, რასაც აკეთებ ძმებისა და უცხოთათვის, "},
	{6, "6 ეკლესიის წინაშე რომ გვიმოწმეს შენი სიყვარული; კარგს იზამ, თუ ისე წარგზავნი მათ, როგორც შეშვენის შენს ღვთისმსახურებას. "},
	{7, "7 რადგანაც მისი სახელისათვის გამოემართნენ და არაფერი წამოუღიათ წარმართთაგან. "},
	{8, "8 ხოლო ჩვენ გვმართებს შევიწყნაროთ ამნაირნი, რათა შევეწიოთ ჭეშმარიტებას. "},
	{9, "9 ეს მივწერე ეკლესიებსაც, მაგრამ დიოტროფე, პირველობას რომ იჩემებს მათ შორის, არ გვიღებს ჩვენ. "},
	{10, "10 ამიტომ, თუ მივალ, შევახსენებ მის საქმეებს, უკეთური სიტყვით რომ გვიხსენიებს, და ამასაც არ სჯერდება: თვითონ ხომ არ ღებულობს ძმებს, მაგრამ მათი მიმღების მსურველთაც უკრძალავს ამას და ეკლესიიდან აძევებს მათ. "},
	{11, "11 საყვარელო, ნუ ჰბაძავ ბოროტს, არამედ კეთილს მიჰბაძე, ვინაიდან კეთილისმოქმედი ღვთისაგან არის, ბოროტმოქმედს კი არ უხილავს ღმერთი. "},
	{12, "12 დიმიტრის არა მარტო ყველა უმოწმებს, არამედ თვით ჭეშმარიტებაც; ჩვენც ვმოწმობთ და იცით, რომ ჩვენი მოწმობა ჭეშმარიტია. "},
	{13, "13 ბევრი რამ მქონდა შენთვის მოსაწერი, მაგრამ არ მინდა მელნითა და კალმით მოგწერო. "},
	{14, "14 რადგანაც იმედი მაქვს რომ მალე გნახავ და პირისპირ ვილაპარაკებთ. "},
	{15, "15 მშვიდობა შენდა. მოგიკითხავენ მეგობრები. სათითაოდ გადაეცი მოკითხვა ჩვენს მეგობრებს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};