#include <map>
#include <string>
class Bible47
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 სიმონ-პეტრე, იესო ქრისტეს მონა და მოციქული, - მათ, ვინც ჩვენსავით მიიღო იგივე ძვირფასი რწმენა, ჩვენი ღვთისა და მაცხოვრის იესო ქრისტეს სიმართლით, "},
	{2, "2 მადლი და მშვიდობა გიმრავლოთ ღვთისა და ჩვენი უფლის იესოს შემეცნების წყალობით. "},
	{3, "3 რაკიღა მისმა საღვთო ძალამ მოგვანიჭა ყველაფერი, რაც ცხოვრებისა და ღვთისმოსაობისთვის გვჭირდება, მისი შემეცნების მეოხებით, ვინც თავისი დიდებისა და სათნოებისაკენ გვიხმო, "},
	{4, "4 რომელთაგანაც გვებოძა დიადი და ფასდაუდებელი აღთქმანი, რათა ამ ქვეყნად გულისთქმის ხრწნილებისაგან განრიდებულნი საღმრთო ბუნების თანაზიარნი გახდეთ. "},
	{5, "5 ამიტომ თქვენც გულმოდგინედ ეცადეთ, რომ თქვენს რწმენას სათნოებაც ზედ მიუსართოთ, სათნოებას კი - შემეცნება, "},
	{6, "6 შემეცნებას - თავშეკავება, თავშეკავებას - მოთმინება, ხოლო მოთმინებას - ღვთისმოსაობა, "},
	{7, "7 ღვთისმოსაობას - ძმათმოყვარეობა, ძმათმოყვარეობას კი - სიყვარული. "},
	{8, "8 თუ ყოველივე ეს თქვენშია და მრავლდება, უქმად და უნაყოფოდ არ დარჩებით ჩვენი უფლის იესო ქრისტეს შემეცნებისას. "},
	{9, "9 ხოლო ვის სულშიც ეს არ არის, თვალდავსილია ან ბეცი, რადგანაც დაივიწყა, რომ უკვე განწმენდილია თავისი უწინდელი ცოდვებისაგან. "},
	{10, "10 ამიტომ, ძმანო, უფრო გულმოდგინედ ეცადეთ განამტკიცოთ თქვენი მოწოდება და რჩეულობა, რადგანაც თუ ასე მოიქცევით, არასოდეს წაიბორძიკებთ. "},
	{11, "11 ვინაიდან ასე უფრო ფართოდ გაიღება თქვენს წინაშე ჩვენი უფლისა და მაცხოვრის იესო ქრისტეს საუკუნო სასუფევლის კარი. "},
	{12, "12 ამიტომაც გამუდმებით შეგახსენებთ ამას, თუმცაღა იცით და მტკიცედაც ადგახართ აწინდელ ჭეშმარიტებას. "},
	{13, "13 მართებულად მიმაჩნია, ვიდრე ამ კარავში ვარ, შეხსენებით გამოგაფხიზლოთ. "},
	{14, "14 რადგანაც ვიცი, რომ მალე უნდა დავუტევო ჩემი კარავი, როგორც მაუწყა ჩვენმა უფალმა იესო ქრისტემ. "},
	{15, "15 ასე რომ, ვეცდები ჩემი წასვლის შემდეგაც ყოველთვის იხსენებდეთ ამას. "},
	{16, "16 ვინაიდან თავშესაქცევი იგავებით როდი გაუწყეთ ჩვენი უფლის იესო ქრისტეს მოსვლა და ძალმოსილება, არამედ მისი სიდიადე საკუთარი თვალით ვიხილეთ. "},
	{17, "17 რადგანაც მამა ღმერთისაგან მიიღო პატივი და დიდება, როდესაც მისწვდა ესოდენ დიდმშვენიერი დიდების ხმა: ეს არის ძე ჩემი საყვარელი, რომელშიაც კეთილად გამოვჩნდი მე. "},
	{18, "18 და ეს ხმა, ზეცით ჩამოსული, ჩვენც ჩაგვესმა, როცა მასთან ერთად ვიყავით წმიდა მთაზე. "},
	{19, "19 ეგეც არ იყოს, ხელთა გვაქვს უმტკიცესი წინასწარმეტყველური სიტყვა, და კარგად იქცევით, ისე რომ ესწრაფით მას, როგორც ბნელში მანათობელ ლამპარს, ვიდრე ირიჟრაჟებდეს და თქვენს გულებში ამობრწყინდებოდეს ცისკრის ვარსკვლავი. "},
	{20, "20 უწინარეს ყოვლისა, უნდა იცოდეთ, რომ წერილის არცერთი წინასწარმეტყველება თავისით არ განიმარტება. "},
	{21, "21 რადგანაც წინასწარმეტყველება არასოდეს კაცის ნებით არ წარმოთქმულა, არამედ სული წმიდის კარნახით წარმოსთქვამდნენ მას ღვთის წმიდა კაცნი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 იყვნენ ცრუ წინასწარმეტყველნიც ხალხში, ისევე, როგორც თქვენში იქნებიან ცრუმოძღვარნი, რომელნიც შემოიღებენ წარმწყმედ მწვალებლობას, უარყოფენ მათ გამომსყიდველ უფალს და მალე თვითონვე წარიწყმედენ თავს. "},
	{2, "2 ბევრი გაჰყვება მათ თავაშვებულებას და მათი წყალობით დაიგმობა ჭეშმარიტების გზა. "},
	{3, "3 ანგარებით აღძრულნი ცრუ სიტყვებით მოგისყიდიან, მაგრამ არ დაახანებს მათი სასჯელი და არ სძინავს წარწყმედას მათსას. "},
	{4, "4 რადგან თუ ღმერთმა არ დაინდო შემცოდე ანგელოზები, არამედ ბნელეთის ბორკილებით შეკრა და ჯოჯოხეთში ჩაყარა ისინი განკითხვის დღემდე დასამარხავად; "},
	{5, "5 თუ არც ძველი ქვეყანა დაინდო, არამედ იხსნა მხოლოდ სიმართლის ქადაგი - ნოე, რვა სულთან ერთად, როცა წარღვნა მოუვლინა უღმრთოთა ქვეყანას;"},
	{6, "6 თუ გასწირა სოდომისა და გომორის ქალაქები, ფერფლად აქცია და მომავალ უღმერთოთა ნიმუშად დადო ისინი, "},
	{7, "7 ხოლო მართალი ლოტი ურჯულოთა უგვანი ქცევით გაწამებული, იხსნა, "},
	{8, "8 (ვინაიდან მათ შორის მცხოვრები ეს ალალ-მართალი ყოველდღე იტანჯებოდა თავისი მართალი სულით, როცა ხედავდა და ისმენდა მათ ურჯულოებას), -"},
	{9, "9 მაშასადამე, იცის ღმერთმა, როგორ დაიხსნას ღვთისმოსავნი განსაცდლისაგან, უკეთურნი კი განკითხვის დღისათვის შემოინახოს განსასჯელად; "},
	{10, "10 უპირატესად კი ბილწ ხორციელ ვნებებს აყოლილნი, უფლებათა შეურაცხმყოფელნი, თავხედნი, კადნიერნი და დიდებათა ურიდად მგმობნი. "},
	{11, "11 მაშინ როდესაც თვით ანგელოზნი, მათზე უფრო ძლიერნი და ძალმოსილნი, მკრეხელურად არ განსჯიან მათ უფლის წინაშე. "},
	{12, "12 ისინი კი, როგორც უგონო პირუტყვნი, მათივე ბუნებით დასაჭერად და გასაწყვეტად გაჩენილნი, გმობენ იმას, რაც არ ესმით და თავიანთი ხრწნილებით გაიხრწნებიან. "},
	{13, "13 ასე მიიღებენ უსამართლობის საზღაურს, ნეტარებად რომ შეურაცხავთ ყოველდღიური განცხრომა; შესვრილნი და შებილწულნი თავიანთი სიცრუით ტკბებიან, როცა ილხენენ თქვენთან ერთად. "},
	{14, "14 მათი თვალები სავსეა სიმრუშით და უძღები ცოდვით; გულხარბნი და ანგარების მოყვარენი აცთუნებენ უმტკიცო სულებს; ესენი არიან ძენი წყევლისა. "},
	{15, "15 წრფელი გზა რომ დაუტევეს, შეცდნენ და შეუდგნენ ბალაამის, ბოსორის ძის, კვალს, რომელმაც შეიყვარა უსამართლობის საზღაური. "},
	{16, "16 მაგრამ თავისი ურჯულოების მამხილებლად ექცა უტყვი სახედარი, რომელიც კაცის ხმით ამეტყველდა და ალაგმა წინასწარმეტყველის სიშლეგე. "},
	{17, "17 ესენი არიან უწყლო წყარონი, ქარიშხლით დევნილი ღრუბლები, რომელთათვისაც გამზადებულია მარადიული უკუნი. "},
	{18, "18 ვინაიდან თავიანთი მაღალფარდოვანი ფუჭსიტყვაობით ხორციელ გულისთქმათა სიბილწეში იტყუებენ იმათ, რომელნიც ოდნავ ჩამორჩნენ საცთურში დანთქმულთ. "},
	{19, "19 თავისუფლებას აღუთქვამთ მათ, თვითონ მონები ხრწნილებისა. ვინაიდან ვინც რისაგან არის ძლეული, მისივე მონაა. "},
	{20, "20 რადგან თუ ჩვენი უფლისა და მაცხოვრის იესო ქრისტეს შემეცნების წყალობით ამქვეყნიური ბილწებისგან განრისხებულნი კვლავ იმავე ბილწებით ისვრებიან და დაიძლევიან, მათთვის ეს უკანასკნელი ყოფა უწინდელზეც უარესია. "},
	{21, "21 უჯობდათ საერთოდ არ შეეცნოთ გზა სიმართლისა, ვიდრე შეცნობის შემდეგ უკუქცეულიყვნენ მათთვის მიცემული წმიდა მცნებისგან. "},
	{22, "22 სწორედ მათზე თქმულა მართალი ანდაზა: ძაღლი მიუბრუნდა თავის ნარწყევს და ნაბანი ღორი კვლავ წუმპეში ჩაგორდა."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 ამას უკვე მეორე წერილსა გწერთ, საყვარელნო, და ორივეში შეხსენებით ვაღვიძებ თქვენს წმიდა აზრს, "},
	{2, "2 რათა გახსოვდეთ წმიდა წინასწარმეტყველთა მიერ იმთავითვე თქმული სიტყვები და უფლისა და მაცხოვრის მცნებანი გადმოცემულნი თქვენი მოციქულების მიერ. "},
	{3, "3 უპირველეს ყოვლისა, იცოდეთ, რომ უკანასკნელ დღეებში მოვლენ მგმობელნი, თავიანთი გულისთქმისამებრ მოარულნი, "},
	{4, "4 და იტყვიან: სად არის აღთქმა მისი მოსვლისა? ვინაიდან მას შემდეგ, რაც მამებმა მიიძინეს, ყველაფერი უცვლელად რჩება შექმნის დასაბამიდან. "},
	{5, "5 რადგანაც საკუთარი ნებასურვილით ივიწყებენ, რომ ცა და მიწა თავდაპირველად წყლისაგან და წყალთა შუა შეიქმნა ღვთის სიტყვით. "},
	{6, "6 ამიტომაც მაშინდელი სამყარო წყლით წაირღვნა და დაიღუპა. "},
	{7, "7 ახლანდელ ცასა და მიწას კი ცეცხლისათვის ინახავს იგივე სიტყვა, რათა განკითხვის დღეს მოსრას უღვთონი. "},
	{8, "8 ისიც იცოდეთ, საყვარელნო რომ ერთი დღე უფლისათვის როგორც ათასი წელი, და ათასი წელი, როგორც ერთი დღე. "},
	{9, "9 არ აყოვნებს უფალი აღთქმის აღსრულებას, როგორც ზოგიერთს ჰგონია, არამედ სულგრძელია თქვენს მიმართ, რადგანაც ვისიმე დაღუპვა კი არა სურს, არამედ ის, რომ ყველა მოიქცეს სინანულად. "},
	{10, "10 ხოლო უფლის დღე მოვა როგორც მპარავი, და მაშინ ზათქით გადავლენ ცანი, კავშირნი მხურვალებით დაიშლებიან და ცეცხლს მიეცემა მიწა და ყოველი საქმე მისი. "},
	{11, "11 მაგრამ თუ ყოველივე ეს დაიშლება, როგორი უნდა იყოს თქვენი ყოფა წმიდა ქცევითა და ღვთისმოსაობით, "},
	{12, "12 რაკიღა ნატრობთ და მოელით, როდის მოვა დღე უფლისა, როცა ცეცხლმოდებული ცანი დაიშლებიან და დადნებიან ალმოდებული სტიქიონები? "},
	{13, "13 ხოლო ჩვენ, აღთქმისამებრ, მოველით ახალ ცათა და ახალ მიწას, სადაც დამკვიდრდება სიმართლე. "},
	{14, "14 ამიტომ, საყვარელნო, რაკიღა ამას ელით, ეცადეთ მშვიდობით წარსდგეთ მის წინაშე, შეურყვნელნი და შეუბილწველნი. "},
	{15, "15 ჩვენი უფლის სულგრძელობა დასახეთ ხსნად, როგორც ჩვენმა საყვარელმა ძმამ - პავლემაც მოგწერათ მისთვის ბოძებული სიბრძნით. "},
	{16, "16 ამასვე გწერთ ყველა წერილში, სადაც ზოგი რამ ისე ძნელი გასაგებია, რომ უმეცარნი და უმტკიცონი სხვა წერილების მსგავსად ამახინჯებენ მათ, რათა წარიწყმიდონ თავიანთი თავი. "},
	{17, "17 ხოლო თქვენ, საყვარელნო, რაკიღა წინასწარ იცით ეს, ფრთხილად იყავით, რათა არ ჩაგითრიოთ უკეთურთა ცთომილებამ და არ გიღალატოთ თქვენმა სიმტკიცემ. "},
	{18, "18 არამედ იზარდეთ ჩვენი უფლისა და მაცხოვრის იესო ქრისტეს მადლითა და შემეცნებით. დიდება მას აწ და მარადის. ამინ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};