#include <map>
#include <string>
class Bible46
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
	struct ka4	{ int val; const char *msg; };
	struct ka5	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 პეტრე, მოციქული იესო ქრისტესი, პონტოსა და გალატიაში, კაპადოკიასა, ასიასა და ბითვინიაში განთესილ ხიზნებს, "},
	{2, "2 უფლის წინასწარცოდნითა და სულის სიწმიდით მორჩილებისა და იესო ქრისტეს სისხლის პკურებისათვის რჩეულთ, - მადლი და მშვიდობა გიმრავლოთ! "},
	{3, "3 კურთხეულია ღმერთი და ჩვენი უფლის - იესო ქრისტეს მამა, რომელმაც თავისი მრავალმოწყალებისამებრ ხელახლა გვშობა ცოცხალი სასოებისთვის, იმის წყალობით, რომ მკვდრეთით აღადგინა იესო ქრისტე. "},
	{4, "4 რათა დაიმკვიდროთ უხრწნელი, წმიდა და უჭკნობი სამკვიდრო, ცაში გამზადებული თქვენთვის, "},
	{5, "5 რომელნიც ღვთის ძალისა და რწმენის წყალობით დაცული ხართ ცხონებისათვის, რაც მზადაა გამოცხადდეს უკანასკნელ ჟამს "},
	{6, "6 და რასაც შეჰხარით, თუმცა ამჟამად, ცოტა არ იყოს, შეჭირვებულნი იქნებით სხვადასხვაგვარი განსაცდელით, "},
	{7, "7 რათა თქვენი რწმენის გამოცდა, გაცილებით უფრო ფასეული, ვიდრე გამოცდა ოქროსი, თავისი ხრწნადობის მიუხედავად ცეცხლში რომ გამოიცდება, - საქები, სადიდებელი და სასახელო აღმოჩნდეს თქვენთვის, როდესაც გამოგეცხადებათ იესო ქრისტე, "},
	{8, "8 რომელიც არ გინახავთ და გიყვართ, ვერც ახლა ხედავთ, მაგრამ გწამთ და ენით უთქმელი და დიდი სიხარულით ხარობთ, "},
	{9, "9 რადგანაც ამით აღწევთ თქვენი რწმენის საბოლოო მიზანს: სულების ხსნას. "},
	{10, "10 სწორედ ამ ხსნას იკვლევდნენ და იძიებდნენ წინასწარმეტყველნი, რომელნიც გიწინასწარმეტყველებდნენ თქვენთვის განკუთვნილ მადლს. "},
	{11, "11 და არკვევდნენ, რა დროს და რა ვითარებას მიანიშნებდა მათში დამკვიდრებული სული ქრისტესი, როცა წინასწარ უმოწმებდა მათ ქრისტეს ვნებას და ვნების შემდგომ დიდებას. "},
	{12, "12 მათთვის გამოცხადებულ იქნა, რომ თვითონ მათ კი არა, თქვენ გმსახურებდათ ის, რაც ამჟამად გეუწყათ მახარებელთაგან, ცით მოვლენილი სული წმიდის მიერ, და რისი წვდომაც სურთ ანგელოზებს. "},
	{13, "13 მაშ, მოისარტყლეთ თქვენი გონების წელი, იფხიზლეთ და სრული იმედი გქონდეთ მადლისა, რომელიც მოგენიჭებათ იესო ქრისტეს გამოცხადებით. "},
	{14, "14 როგორც შვილნი მორჩილებისა, ნუ მიეცემით თქვენს უწინდელ, უმეცრების დროინდელ ვნებებს. "},
	{15, "15 არამედ წმიდა იყოს თქვენი ყოველი ქცევა, როგორც წმიდაა თქვენი მხმობელი. "},
	{16, "16 ვინაიდან დაწერილია: „წმიდანი იყავით, რადგანაც მე წმიდა ვარ“. "},
	{17, "17 თუკი მამას უწოდებთ მას, ვინც პირუთვნელად განსჯის ყველას, თანახმად მისი საქმისა, მოშიშებით გალიეთ თქვენი ხიზნობის ყავლი. "},
	{18, "18 რაკიღა იცით, რომ ხრწნადი საფასით - ოქრო-ვერცხლით როდი ხართ გამოსყიდულნი მამათა მიერ მოცემული ამაო ცხოვრებისაგან, "},
	{19, "19 არამედ უმანკო და უბიწო ტარიგის - ქრისტეს ძვირფასი სისხლით, "},
	{20, "20 ქრისტესი, რომელიც ჯერ კიდევ ქვეყნის შექმნამდე იყო წინასწარ განჩინებული, მაგრამ მხოლოდ უკანასკნელ დროს გამოჩნდა თქვენთვის, "},
	{21, "21 რომელთაც მის მიერ იწამეთ ღმერთი, მკვდრეთით რომ აღადგინა იგი და მისცა დიდება, რათა ღვთის რწმენა და სასოება გქონდეთ. "},
	{22, "22 ჭეშმარიტებისადმი მორჩილებით განიწმიდეთ თქვენი სულები უპირფერო, ძმური სიყვარულისთვის და წმიდა გულით მხურვალედ გიყვარდეთ ერთმანეთი, "},
	{23, "23 როგორც ხრწნადი კი არა, არამედ უხრწნელი თესლის - ღვთის ცოცხალი და წარუვალი სიტყვის მიერ ხელახლა შობილთ. "},
	{24, "24 ვინაიდან ყოველი ხორცი ბალახსა ჰგავს და ყოველი დიდება კაცისა - მინდვრის ყვავილს; გახმა ბალახი და დასცვივდა მისი ყვავილიც. "},
	{25, "25 ღვთის სიტყვა კი წარუვალია. სწორედ ესაა სიტყვა, თქვენ რომ გეხარათ. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 მაშ, განიშორეთ ყოველგვარი უკეთურება, ყოველგვარი ზაკვა, პირფერობა, შური და ყოველგვარი ავსიტყვაობა. "},
	{2, "2 როგორც ახალშობილმა ყრმებმა შეიყვარეთ სუფთა სულიერი რძე, რათა მისი მეოხებით იზარდოთ ხსნისთვის. "},
	{3, "3 ვინაიდან იგემეთ, რომ ტკბილია უფალი, "},
	{4, "4 რომელსაც მიეახლეთ, როგორც ცოცხალ ლოდს, კაცთაგან უარყოფილს, ღვთის მიერ კი რჩეულსა და ფასდაუდებელს. "},
	{5, "5 როგორც ცოცხალი ქვები, თქვენც აშენდით სულიერ სახლად, წმიდა სამღვდელოებად და სულიერი მსხვერპლის მწირველად, იესო ქრისტეს მეშვეობით სასურველად რომ უჩანს ღმერთს. "},
	{6, "6 რადგანაც წერილი ამბობს: „აჰა, მე დავდებ სიონში ქვაკუთხედ ლოდს, რჩეულსა და უძვირფასესს, და არ შერცხვება მისი მორწმუნე“. "},
	{7, "7 ამრიგად, ის ფასდაუდებელია თქვენთვის, ანუ მორწმუნეთათვის, ურწმუნოთათვის კი „ქვა, რომელიც დაიწუნეს მშენებლებმა, მაგრამ კუთხის თავად დაიდვა: ქვა ფეხწამოსაკრავი და კლდე საცთური“ "},
	{8, "8 მათთვის, ვინც ეურჩება სიტყვას, და ვისთვისაც ეს ხვედრი იყო გამიზნული. "},
	{9, "9 ხოლო თქვენა ხართ რჩეული მოდგმა, სამეფო სამღვდელოება, წილხვედრი ხალხი, რათა ყველას აუწყოთ მისი სიქველე, ვინც სიბნელიდან გამოგიხმოთ, რომ გეხილათ მისი საოცარი ნათელი. "},
	{10, "10 ოდესღაც არა ხალხი, ხოლო აწ ღვთის ხალხი, ოდესღაც არა შეწყალებულნი, ხოლო აწ შეწყალებულნი. "},
	{11, "11 საყვარელნო, გევედრებით როგორც მწირთა და მსხემთ, თავი შეიკავეთ ხორციელ გულისთქმათაგან, რომელნიც აღიძვრიან სულის წინააღმდეგ. "},
	{12, "12 კეთილად მოიქეცით წარმართთა შორის, რათა, ნაცვლად იმისა, რომ ბოროტმოქმედებად გსახავდნენ და დრტვინავდნენ თქვენზე, თქვენი კეთილი საქმის შემყურეთ ადიდონ ღმერთი მოხილვის დღეს. "},
	{13, "13 ღვთის გულისათვის, დაემორჩილეთ კაცთა ყოველგვარ ხელმწიფებას, გინდა მეფეს, როგორც უზენაეს მბრძანებელს, "},
	{14, "14 გინდაც მთავრებს, როგორც მის მიერ წარმოგზავნილთ ბოროტმოქმედთა დასასჯელად და კეთილის მოქმედთა საქებად. "},
	{15, "15 ვინაიდან ღმერთმა ისე ინება, რომ კეთილი საქმით ვუკრავდეთ პირს უგუნურ კაცთა უმეცრებას. "},
	{16, "16 როგორც იქცევიან თავისუფალნი: ბოროტების დასაფარავად როდი იყენებენ თავისუფლებას, არამედ არიან, როგორც ღვთის მონები. "},
	{17, "17 პატივი ეცით ყველას, გიყვარდეთ საძმო, ღვთის შიში გქონდეთ და პატივი მიაგეთ მეფეს. "},
	{18, "18 მსახურნო, გულმოშიშებით დაემორჩილეთ ბატონებს, არა მარტო კეთილთა და ლმობიერთ არამედ მკაცრთაც. "},
	{19, "19 რადგანაც მადლი ის არის როცა ვინმე, უსამართლოდ ტანჯული, ღვთის წინაშე არ ღალატობს სინიდისს და უდრტვინველად იტანს გასაჭირს. "},
	{20, "20 მართლაცდა, თუკი შეცოდებისათვის გცემენ და ითმენთ, ვითომ რა საქები საქციელია? ხოლო თუ სიკეთის ქმნისათვის გაწამებენ და ითმენთ, ეს კი მადლია ღვთის წინაშე. "},
	{21, "21 ამისთვისა ხართ ხმობილნი, ვინაიდან ქრისტეც ჩვენთვის ევნო და დაგიტოვათ მაგალითი, რათა მისდიოთ მის კვალს. "},
	{22, "22 არც შეუცოდავს და არც დასჩენია ზაკვა მის ბაგეს, "},
	{23, "23 ვისაც ჰგმობდნენ და სანაცვლოდ არავის ჰგმობდა, აწამებდნენ და არ იმუქრებოდა, არამედ თავის თავს ანდობდა მართლად გამკითხეს; "},
	{24, "24 ვინც ჩვენი ცოდვები თავისი სხეულით აზიდა ძელზე, რათა ცოდვისგან თავდახსნილთ სიმართლით გეცხოვრათ; და ვისი წყლულებითაც განიკურნეთ. "},
	{25, "25 ვინაიდან გზადაბნეული ცხვრებივით იყავით, ახლა კა დაუბრუნდით მწყემსსა და თქვენი სულების ზედამხედველს. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 ასევე ცოლებიც დაემორჩილეთ ქმრებს, რათა თვით ისინიც კი, რომელნიც ეურჩებიან სიტყვას, შეძენილ იქნენ თავიანთი ცოლების ქცევით, სიტყვის გარეშე, "},
	{2, "2 როცა იხილავენ თქვენს უბიწო და ღვთისმოშიშ ქცევას. "},
	{3, "3 დაე, თქვენი სამშვენისი ნუ იქნება გარეგნული იერი: თმაწნულობა, ოქროს სამკაულები თუ მორთულ-მოკაზმული სამოსი, "},
	{4, "4 არამედ გულის ფარული სიწმიდე, უხრწნელი სამკაული მშვიდი და თვინიერი სულისა, რაც ესოდენ ძვირფასია ღვთის წინაშე. "},
	{5, "5 ასე იმკობდნენ თავს ოდესღაც ღვთისმოსავი წმიდა ქალები, რომლებიც ემორჩილებოდნენ თავიანთ ქმრებს. "},
	{6, "6 ასე დაემორჩილა სარაც და ბატონი უწოდა აბრაამს, ვისი შვილებიცა ხართ, როცა კეთილ საქმეს აკეთებთ და არაფრის შიში არ გაკრთობთ. "},
	{7, "7 და, თქვენც, ქმრებო, სათუთად მოეპყარით ცოლებს, როგორც უმყიფეს ჭურჭელს, და პატივი ეცით, როგორც სიცოცხლის მადლის თანამემკვიდრეთ, რათა ლოცვა არ დაგიბრკოლდეთ. "},
	{8, "8 და ბოლოს, ყველანი თანამოაზრენი, თანამლმობნი, ძმათმოყვარენი, შემწყნარეაელნი და თავმდაბალნი იყავით. "},
	{9, "9 ნუ მიაგებთ ბოროტს ბოროტის წილ, ნურც გინებას გინების წილ, არამედ აკურთხეთ წინააღმდგომნი, ვინაიდან იმისთვისა ხართ ხმობილნი, რომ კურთხევა დაიმკვიდროთ. "},
	{10, "10 რადგან ვისაც სურს უყვარდეს სიცოცხლე და იხილოს კეთილდღეობა, ნუ მისცემს ენას ბოროტის თქმის ნებას და ნურც მისი ბაგენი იტყვიან ზაკვას; "},
	{11, "11 ერიდოს ბოროტს, აკეთოს სიკეთე, ეძიოს მშვიდობა და ელტვოდეს მას. "},
	{12, "12 რადგანაც უფლის თვალი მიპყრობილია მართალთა მიმართ, მისი ყური კი - მათი ლოცვა-ვედრების მიმართ, ხოლო მისი სახე რისხვით დაჰყურებს ბოროტმოქმედთ. "},
	{13, "13 ვინ შეგამთხვევთ ბოროტს, თუ კეთილს ესწრაფით? "},
	{14, "14 მაგრამ, კიდევაც რომ ევნოთ სიმართლისათვის, ნეტარნი ხართ; მაშ, ნუ შიშობთ მათი შიშით და ნურცა ძრწით. "},
	{15, "15 არამედ უფალი ქრისტე წმიდა-ყავით თქვენს გულში და მარადჟამ მზად იყავით, რომ თვინიერად და მოწიწებით მიუგოთ ყველას, ვინცა გთხოვთ თქვენი სასოების ახსნას. "},
	{16, "16 წრფელი იყოს თქვენი სინიდისი, რათა თვით იქაც კი, სადაც ბოროტი სიტყვით გახსენებენ როგორც ბოროტმოქმედთ, შერცხვენილნი დარჩნენ ისინი, ვინც გმობენ თქვენს კეთილ ქცევას ქრისტეში. "},
	{17, "17 ვინაიდან, თუ ნებავს ღმერთს, უმჯობესია კეთილ საქმეთათვის ევნოთ, ვიდრე ბოროტთათვის. "},
	{18, "18 რადგან ერთხელ ქრისტეც ჩვენი ცოდვებისათვის ევნო, მართალი - არამართალთათვის, რათა მივეყვანეთ ღმერთთან; მოკვდა ხორცით და გაცოცხლდა სულით, "},
	{19, "19 რომლითაც მივიდა საპყრობილეში მყოფ სულებთან და უქადაგა მათაც, "},
	{20, "20 გაკერპებულნი რომ ურჩობდნენ ჯერ კიდევ მაშინ, როცა ნოეს დროს მოელოდნენ ღვთის სულგრძელობას, ვიდრე იგებოდა კიდობანი, რომლითაც ცოტა, ესე იგი, მხოლოდ რვა სული გადაურჩა წარღვნას. "},
	{21, "21 ეს იყო ხატება ნათლისღებისა, რაც ამჟამად გიხსნით (არა ჭუჭყის ჩამორეცხვა ხორციდან, არამედ წრფელი სინიდისის სწრაფვა ღვთის მიმართ) იესო ქრისტეს მკვდრეთით აღდგომის წყალობით, "},
	{22, "22 რომელიც ცად ამაღლების შემდეგ დაჯდა მამის მარჯვნივ და დაემორჩილნენ მას ანგელოზნი, ხელმწიფებანი და ძალნი. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ka4 poems[] = {
	{1, "1 ამრიგად, რაკი ქრისტე ჩვენთვის ევნო ხორციელად, თქვენც აღიჭურვეთ იმავე აზრით, ვინაიდან ხორციელად ვნებული აღარა სცოდავს. "},
	{2, "2 რათა კაცთა გულისთქმით კი არა, ღვთის ნებით გალიოთ სიცოცხლის დარჩენილი დღენი. "},
	{3, "3 რადგან თქვენთვის ისიცა კმარა, რომ წარსულში წარმართთა ნებისამებრ იქცეოდით, უწმინდურებას, ბილწ გულისთქმათ, მემთვრალეობას, ნაყროვანებას, განცხრომასა და უკეთურ კერპთმსახურებას თავმიცემულნი. "},
	{4, "4 ამიტომაც უკვირთ, რომ მათთან ერთად არ მონაწილეობთ იმავე გარყვნილებაში, და გგმობენ კიდეც. "},
	{5, "5 მალე აგებენ პასუხს მის წინაშე, ვინც განიკითხავს ცოცხლებსა და მკვდრებს. "},
	{6, "6 მკვდრებსაც ხომ იმიტომ ეხარათ, რომ ხორცით განკითხულიყვნენ, როგორც კაცნი, და სულით ეცოცხლათ, როგორც ღმერთს. "},
	{7, "7 თუმცა ახლოა ყოვლის აღსასრული; მაშ, იყავით გონიერნი და ლოცვებისთვის იფხიზლეთ. "},
	{8, "8 უწინარეს ყოვლისა კი, გულწრფელად გიყვარდეთ ერთმანეთი, რადგანაც სიყვარული ფარავს ცოდვათა სიმრავლეს. "},
	{9, "9 უდრტვინველად უმასპინძლეთ ერთურთს. "},
	{10, "10 თვითეული თქვენგანი იმ ნიჭით ემსახუროს დანარჩენთ, რაც მიუღია, როგორც შეშვენის ღვთის მრავალფეროვანი მადლის კეთილ მნეს. "},
	{11, "11 თუ ლაპარაკობს ვინმე, ღვთის სიტევისამებრ ილაპარაკოს; თუ მსახურებს ვინმე, ღვთის მიერ ბოძებული ძალით იმსახუროს, რათა სრულად იდიდებოდეს ღმერთი იესო ქრისტეს მიერ, ვისიცაა დიდება და ძალი უკუნითი უკუნისამდე. ამინ. "},
	{12, "12 საყვარელნო, ნუ იუცხოვებთ თქვენს გამოსაცდელად მოვლენილ ცეცხლოვან განსაცდელს, თითქოს რაღაც უჩვეულო რამ დაგმართოდეთ. "},
	{13, "13 არამედ ხარობდეთ, როგორც ქრისტეს ვნებათა თანაზიარნი, რათა მისი დიდების გამოცხადებითაც იხარებდეთ და ილხენდეთ. "},
	{14, "14 თუ ქრისტეს სახელისთვის გაგინებენ, ნეტარნი ხართ, რადგანაც თქვენზე ივანებს სული დიდებისა და სული ღვთისა, მათ მიერ რომ იგმობა, თქვენით კი იდიდება. "},
	{15, "15 მხოლოდ ნურცერთ თქვენგანს ნურა ევნება რა, როგორც მკვლელს ან მპარავს, ბოროტმოქმედს ან სხვის საქმეში ჩამრევს. "},
	{16, "16 ხოლო თუ ევნება, როგორც ქრისტიანი, ნუ დაირცხვენს, არამედ ადიდოს ღმერთი ამის გამო. "},
	{17, "17 რადგანაც დროა, ღვთის სახლიდან დაიწყოს განკითხვა, ხოლო თუ ჩვენით დაიწყება, რა აღსასრული ელით ღვთის სახარების ურჩთ? "},
	{18, "19 ამიტომ ღვთის ნებით ვნებულთაც მას, როგორც ჭეშმარიტად შემოქმედს, მიანდონ თავიანთი სული. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ka5 poems[] = {
	{1, "1 ხოლო თქვენს შორის ხუცესთა ვთხოვ, მე, თანახუცესი, ქრისტეს ვნებათა მოწმე და თანამოზიარე დიდებისა, რომელიც უნდა გაცხადდეს: "},
	{2, "2 მწყემსეთ თქვენთვის მონდობილი ღვთის სამწყსო, მაგრამ არა იძულებით, არამედ ნებსით, არა ბილწი ანგარებით, არამედ გულმოდგინებით. "},
	{3, "3 ნუ ეუფლებით ღვთის სამკვიდრებელს, არამედ მაგალითი მიეცით სამწყსოს. "},
	{4, "4 და როცა მოვა სარქალი, დიდების უჭკნობ გვირგვინს მიიღებთ. "},
	{5, "5 ასევე უმრწემესნიც დაემორჩილეთ უხუცესთ და ურთიერთმორჩილებით შეიმოსეთ სიმდაბლე, რადგან ქედმაღალთ ეწინააღმდეგება ღმერთი, თავმდაბალთ კი მადლს ანიჭებს. "},
	{6, "6 მაშ, დამდაბლდით ღვთის მტკიცე ხელქვეშ, რათა დროულად აგამაღლოთ თქვენ. "},
	{7, "7 მას მიანდეთ ყოველი თქვენი საზრუნავი, რადგანაც ის ზრუნავს თქვენზე. "},
	{8, "8 იფხიზლეთ და ფრთხილად იყავით, რადგანაც თქვენი მტერი ეშმაკი დაძრწის, როგორც მბრდღვინავი ლომი, და მსხვერპლს დაეძებს. "},
	{9, "9 წინ აღუდექით მას მტკიცე რწმენით; გახსოვდეთ, რომ იგივე ვნებები ემუქრება თქვენს საძმოს ამ წუთისოფლად. "},
	{10, "10 ხოლო ღმერთი ყოველი მადლისა, თავისდა სადიდებლად რომ გიხმოთ იესო ქრისტეს მიერ, თქვენი ხანმოკლე ტანჯვის შემდეგ თვითონვე სრულგყოფთ, დაგამკვიდრებთ, გაგაძლიერებთ და განგამტკიცებთ. "},
	{11, "11 დიდება მას და ძალმოსილება უკუნითი უკუნისამდე. ამინ. "},
	{12, "12 სილვანუსის, ჩემი აზრით, თქვენი სანდო ძმის ხელით მოკლედ მოგწერეთ, განუგეშეთ და გიმოწმეთ, რომ ეს მადლი ღვთისა, რომლითაც დგახართ, ჭეშმარიტია. "},
	{13, "13 მოგიკითხავთ თანარჩეული ეკლესია ბაბილონისა და მარკოზი, ჩემი ძე. "},
	{14, "14 სიყვარულის ამბორით მოიკითხეთ ერთმანეთი. მშვიდობა ყველას, ვინც იესო ქრისტეში ხართ. ამინ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};