#include <map>
#include <string>
class Bible35
{
	struct ka1	{ int val; const char *msg; };
	struct ka2	{ int val; const char *msg; };
	struct ka3	{ int val; const char *msg; };
public:
static void view1() {
struct ka1 poems[] = {
	{1, "1 განაჩენი, რომელიც იხილა აბაკუმ წინასწარმეტყველმა. "},
	{2, "2 როდემდის უნდა ვითხოვდე შველას, უფალო, და არ ისმენდე? შემოგჩიოდე ძალადობის გამო და არ მშველიდე? "},
	{3, "3 რისთვის მაყურებინებ სიცრუეს და მახილვინებ სიავეს? ძარცვა-გლეჯა და ძალადობაა ჩემს წინაშე, მტრობა და შუღლია ჩამოვარდნილი. "},
	{4, "4 ამიტომაც გაცუდდა რჯული და აღარ ჭრის სამართალი; რადგან უსამართლო ჯაბნის მართალს; ამიტომაც გამოდის უკუღმართი მსჯავრი. "},
	{5, "5 შეხედეთ ხალხებს, დააკვირდით და განცვიფრდით, რადგან ისეთ რასმე მოვიმოქმედებ თქვენს დროში, ამბად გაგონილსაც არ დაიჯერებთ. "},
	{6, "6 რადგან, აჰა, აღვძრავ ქალდეველებს, ხალხს სასტიკსა და ფიცხელს, და მოივლიან მთელს დედამიწას, რომ დაეპატრონონ საცხოვრებლებს, რომლებიც მათ არ ეკუთვნით. "},
	{7, "7 საშიშია და შემზარავი, მისგან გამოდის მსჯავრი და სასჯელი. "},
	{8, "8 ჯიქზე უსწრაფესია მისი ცხენები, ბინდის მგლებივით მზერამახვილნი; დაჯირითობენ მისი მხედრებ, მოგრიალდებიან მხედრები შორიდან, მოფრინდებიან მსხვერპლს დაღირებული არწივებივით. "},
	{9, "9 ერთიანად მოდის საალაფოდ, აღმოსავლეთისკენ პირმიქცეული, და ქვიშასავით მიხვეტავს ტყვეებს. "},
	{10, "10 ამასხრებს მეფეებს და მთავრებს საცინად იგდებს; დასცინის ყოველ ციხე-სიმაგრეს, მიწაყრილებს ახვავებს მათ ასაღებად. "},
	{11, "11 მაშინ მოიცემს გულს, საზღვარს გადავა და შესცოდვას. მისი ძალა კი მის ღმერთშია! "},
	{12, "12 შენ ხომ უკუნისიდან ხარ, უფალო, ჩემო ღმერთო, ჩემო წმიდავ! არ დავიხოცებით! უფალო, სამსჯავროდა გყავს დადგენილი იგი; საფარველო, სამხილებლად გყავს განწესებული! "},
	{13, "13 სუფთაა სახედველნი ბოროტების საყურებლად და არ ძალგიძს სიავის ჭვრეტა. რატომ უცქერ მუხანათებს და დუმხარ, როცა ბოროტეული ყლაპავს მართალს? "},
	{14, "14 ზღვის თევზებივით გაგიხდია ადამიანები, უპატრონო ქვეწარმავლებივით. "},
	{15, "15 ყველანი ანკესით ჰყავს ამოყვანილი, თავისი სათხევლით ამოთრეული და თავის ბადეში გამომწყვდეული. ამიტომ ხარობს და ზეიმობს. "},
	{16, "16 ამიტომ სწირავს მსხვერპლს თავის სათხეველს და უკმევს თავის ბადეს, რადგან მათგან აქვს მსუყე კერძი და ნოყიერი საჭმელი. "},
	{17, "17 ნუთუ ამისთვის უნდა ისროდეს თავის სათხეველს და უწყალოდ ხოცავდეს ხალხებს გამუდმებით? "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ka2 poems[] = {
	{1, "1 ჩემს სადარაჯოზე დავდგები და გავალ კოშკზე, დავაყურადებ, რომ ვნახო, რას მეტყვის და რა ვუპასუხო ჩემს მხილებაზე. "},
	{2, "2 მომიგო უფალმა და მითხრა: ჩაწერე ხილვა და ფიქალებზე ამოკვეთე, რომ სწრაფად წაიკითხოს მკითხველმა. "},
	{3, "3 რადგან უკვე დათქმული ჟამისთვის არის ხილვა და ბოლოს გაცხადდება, არ გამტყუნდება. თუ დააგვიანდეს, დაელოდე, რადგან უსათუოდ მოვა, არ დაბრკოლდება. "},
	{4, "4 აჰა, გაამაყდა, არ გასწორდა მასში სული, მართალი კი თავისი რწმენით იცოცხლებს. "},
	{5, "5 ამპარტავანი კაცი კი მატყუარა ღვინოსავითაა, არ მოისვენებს; ჯოჯოხეთივით აიბერება მისი სული და სიკვდილივით გაუმაძღარია: თავისკენ შემოიკრებს ყველა ხალხს და ყველა ერს თავისთან შემოხვეტავს. "},
	{6, "6 ხომ ყველანი საარაკოდ გახდიან მას და მასხრად აიგდებენ, იტყვიან: ვაი მას, ვინც სხვისას იგროვებს - როდემდისო? - და მონახვეჭით იმძიმებს თავს! "},
	{7, "7 ხომ უეცრად აღდგებიან შენი მკბენელნი და აღიძრებიან შენი დამაფრთხობელნი, რომ ათ კერძად იქცე? "},
	{8, "8 რაკი უამრავი ხალხი გყავს გაძარცული, შენც გაგძარცვავს ყველა დანარჩენი ერი დაღვრილი სისხლის წილ, ქვეყნის, ქალაქის და მის მკვიდრთა ჩაგვრის წილ. "},
	{9, "9 ვაი მას, ვინც უსამართლოდ იხვეჭს თავისი სახლისთვის და მაღალზე იბუდებს, რომ თავი დაიხსნას ბოროტის ხელიდან! "},
	{10, "10 სირცხვილი გადუწყვიტე შენს სახლს, რომ მოსპე უამრავი ხალხი, საკუთარ თავს შესცოდე. "},
	{11, "11 რადგან ქვები ღაღადებენ კედლებიდან და ხის კოჭები ეპასუხებიან. "},
	{12, "12 ვაი მას, ვინც სისხლზე აშენებს ქალაქს და უსამართლობაზე აფუძნებს დარბაზებს. "},
	{13, "13 განა ცაბაოთ უფლისგან არ არის, რომ ცეცხლისთვის იღვწიან ხალხები და არაფრისთვის დაშვრებიან ტომები? "},
	{14, "14 რომ უფლის დიდების ცოდნით აივსოს ქვეყანა, როგორც ზღვა არის წყლით დაფარული? "},
	{15, "15 ვაი მას, ვინც თავის თვისტომს ასმევს თავისი რისხვის თასს და ათრობს, რომ მათ სიშიშვლეს უყუროს! "},
	{16, "16 პატივის ნაცვლად დამცირებით გაძღები; შენც სვი და გაშიშვლდი; შენც შეგხვდება უფლის მარჯვენის თასი და შენი პატივის დამცირება. "},
	{17, "17 რადგან ლიბანის თრგუნვა შენს თავზე გადმოვა და პირუტყვთა აკლება შეგაშინებს, რადგან კაცის სისხლი გაქვს დაღვრილი და ქვეყანა, ქალაქი და მისი მცხოვრებნი დათრგუნული. "},
	{18, "18 რა სარგებლობა აქვს მოქანდაკის გამოკვეთილ კერპს, ტყუილის მოძღვარს, მაგრამ მოქანდაკე ესავს თავის ნაქანდაკევს, თუმცა მუნჯებია მისი შექმნილი ღმერთები. "},
	{19, "19 ვაი მას, ვინც ხეს ეუბნება: გაიღვიძეო, და მდუმარე ქვას: გამოფხიზლდიო. ეს არის მოძღვარი? აჰა, ოქრო-ვერცხლშია ჩასმული, სული კი არ უდგას. "},
	{20, "20 უფალი კი თავის წმიდა ტაძარშია; დადუმდეს მთელი ქვეყანა მის წინაშე! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ka3 poems[] = {
	{1, "1 აბაკუმ წინასწარმეტყველის ლოცვა საგალობლად. "},
	{2, "2 უფალო, გავიგონე შენგან გასაგონი და შემეშინდა. უფალო, იხსენ შენი ქმნილება სიცოცხლის შუა ძალზე; გააცხადე სიცოცხლის შუაძალზე, რომ რისხვის დროსაც კი მახსოვს შეწყალება. "},
	{3, "3 თემანიდან მოდის ღმერთი და წმიდა - ფარანის მთიდან; დაფარა ზეცა მისმა ბრწყინვალებამ და მისმა დიდებამ აავსო დედამიწა. "},
	{4, "4 დღესავით ბრწყინავს მისი ნათელი, შუქს ასხივებს მისი ხელი და აქ იმალება მისი ძლიერება. "},
	{5, "5 შავი ჭირი მიუძღვება წინ და ფეხდაფეხ მიჰყვება ჟამი. "},
	{6, "6 შედგა და გათელა მიწა; გაიხედა და შეაძრწუნა ხალხები; გაცამტვერდა საუკუნო მთები, ჩამოიქცა საუკუნო ბორცვები. საუკუნოა მისი გზასავალი. "},
	{7, "7 განსაცდელში ვხედავ ქუშანის კარვებს, ირხევიან მიდიანის ქვეყნის ფარდები. "},
	{8, "8 ნუთუ მდინარეებს დაატყდა შენი რისხვა, უფალო, ნუთუ მდინარეებს შენი მძვინვარება და ზღვას შენი გულისწყრომა, შენს ცხენებზე, შენს ძლევის ეტლებზე რომ ამხედრდი? "},
	{9, "9 შენ იშიშვლე მშვილდი, როგორც ხალხებისთვის გქონდა დაფიცებული, მდინარეებად დაღარე დედამიწა. "},
	{10, "10 დაგინახეს და შედრკნენ მთები; გადაიარა წყლის ნიაღვარმა, ხმა გაიღო წყლის უფსკრულმა, აღმართა ხელები. "},
	{11, "11 მზე და მთვარე დაყოვნდნენ თავიანთ სადგომებში; შენი ისრების შუქზე დადიან ისინი, შენი ელვარე შუბის შარავანდზე. "},
	{12, "12 რისხვით აბიჯებ დედამიწაზე და გულისწყრომიი თელავ ხალხებს. "},
	{13, "13 შენი ერის გამოსასხნელად გამოხვედი, შენი ცხებულის გამოსახსნელად; ჭერი ჩაუნგრიე ბოროტეულის სახლს, ძირიდან თხემამდე გააშიშვლე. "},
	{14, "14 თავი გაუგმირე მათივე კვერთხებით მის ბელადებს, როცა მოგრიალდნენ ჩემს გასაცამტვერებლად და ყიჟინებდნენ, ბედშავის იდუმალ ჩასაყლაპად. "},
	{15, "15 შენი ცხენებით ზღვა გაქვს გათელილი, ადიდებული წყლების ზვირთები. "},
	{16, "16 გავიგონე და შემეძრა შიგნეული, მის ხმაზე ამითრთოლდა ბაგეები, ტეხა დამიწყო ძვლებმა და ადგილზე დავბარბაცდი; მაგრამ მშვიდად დაველოდები გასაჭირის დღეს, როცა ჩემს ხალხს გასაძარცვავად დაესხმიან. "},
	{17, "17 თუნდაც აღარ აყვავდეს ლეღვი, აღარ გამოისხას ვაზმა მტევანი, გამტყუნდეს ზეთისხილის ნაყოფი, ყანებმა საზრდო არ მოიტანოს, მოწყდეს ფარეხიდან ცხვარი და აღარ დარჩეს ბოსლებში საქონელი. "},
	{18, "18 მე მაინც უფალში გავიხარებდი, ჩემი ხსნის ღმერთში ვნახავდი შვებას. "},
	{19, "19 უფალი ღმერთია ჩემი ძალა; ირმის ფეხებს შემაბამს და ჩემს გორაკებს მომატარებს (ლოტბარისთვის, ჩემს სიმებიან საკრავებზე). "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};