#include <map>
#include <string>
class Bible34
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Бұл — Жаратқан Иенің Ниневи жайындағы ауыр хабары, елқостық Нақұм көрген көріністер туралы жазба."},
	{2, "2 Жаратқан Ие — Өзінен басқа тәңірлеріңнің болуына еш төзбейтін әрі арам істің қарымтасын қайтаратын Құдай. Ол зұлымдықтарды жазалап, оларға ашуланады. Жаратқан Ие жауларына лайықты жазаларын тартқызып, дұшпандарының қылмыстарын есінен шығармайды."},
	{3, "3 Жаратқан Ие қаһарлануға асықпайды, Оның құдіреті ерен зор. Ол айыптыны жазасыз қалдырмайды. Тәңір Иенің жүрген жолы құйын мен дауылдан өтеді, бұлттар Оның аяғының басқан шаңына ұқсайды."},
	{4, "4 Жаратқан Ие теңізге тыйым салып, оны құрғатады, өзендерге бұйырғанда солардың барлығы кеуіп қалады, Башан мен Қармил тауларындағы жайылымдар күйіп кетеді, Ливанның қаулаған ормандары солып қурап қалады."},
	{5, "5 Таулар Оның алдында сілкініп, төбелер балқып кетеді. Жер беті, бүкіл әлем және онда тұратындардың барлығы Оның алдында дірілдейді."},
	{6, "6 Жаратқан Иенің ашуына кім шыдай алар екен? Оның лаулаған қаһарына кім төтеп бере алады? Оның ашу-ызасы от сияқты төгіліп, жартастар да Оның алдында талқандалып үгітіледі."},
	{7, "7 Жаратқан Ие ізгі, басыңа қиындық түскен кезде Ол паналайтын қорғаның болады. Өзіне сенім артқандарды Ол жақыннан танып біледі."},
	{8, "8 Бірақ жау қаласын Иеміз ғаламат топан сумен іргетасына дейін құртады, қара түнек Оның жауларын басады."},
	{9, "9 Сендер Жаратқан Иеге қарсы не ұйымдастырмақсыңдар? Ол соларыңды біржола құртады. Осы пәле екінші рет бастарыңа түспейді."},
	{10, "10 Оның жаулары тікенді бұтаға шырмалып, мас адамдай тәлтіректеп жүретін болады. Олар өртке жанған құрғақ сабандай мүлдем құрып кетеді."},
	{11, "11 Жаратқан Иеге қарсы жамандық ойлап, зұлым іс жоспарлайтын біреу сенен шығып аттанды (уа, Ниневи)."},
	{12, "12 Жаратқан Ие мынаны айтады: Олардың күші зор, саны өте көп болғанмен, ассурлықтар жойылып, құрып кетеді. Уа, халқым, Мен сені ауыр апатқа ұшыратқан едім, алайда қайтадан солай істемеймін."},
	{13, "13 Мен енді Ассурдың салған мойынтұрығын иығыңнан алып тастап, кісендеріңді үзіп босатамын."},
	{14, "14 Жаратқан Ие сен туралы мынадай бұйрық берді, уа, Ассур патшасы: Сенің соңыңнан ұрпақ қалмай, атың өшеді. Тәңірсымақтарыңның ғибадатханаларындағы қашалған бейнелер мен құйылған мүсіндерді қиратамын. Мен қабіріңді ойрандатқызамын, себебі сен жек көрініштісің."},
	{15, "15 Қараңдар, ізгі хабар жеткізуші біреу таудан асып келе жатыр! Ол тыныштықты жариялап: Уа, Яһуда елі, мейрамдарыңды тойлап, Құдайға берген уәделеріңді орында! Сол сұмырайлар енді саған баса-көктеп кірмейтін болады! Қайта, олардың өздері толығымен құрып кетеді! — деп паш етеді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Уа, Ниневи халқы, сені шашырататын басқыншы саған қарсы аттанып келе жатыр! Қамалыңды күзетіп, жолдарыңды қадағала! Беліңді бекем буып, бар күш-қайратыңды жинақта!"},
	{2, "2 Жаратқан Ие Яһуданың да, Солтүстік Исраилдің де салтанатын қайтадан қалпына келтіреді. Өйткені құртушы жаулары оларды талқандап, бау-бақшаларын да жермен-жексен қылған болатын."},
	{3, "3 (Ниневиді шабуылдаған) жасақшылардың қалқандары қан қызыл түсті, сол мықты жауынгерлер қырмызы шапан жамылған. Соғыс күймелері шайқасқа келе жатқанда темірлері оттай жалт-жұлт етеді. Сарбаздар қарағай найзаларын сілтелеп шайқасқа дайын тұр."},
	{4, "4 Соғыс күймелері қаланың көшелерімен құйындай жүйіткіп, алаңдармен зымырап, әрлі-берлі шапқылайды. Олар алаудай жалындап, найзағайдай жарқылдап зуылдайды."},
	{5, "5 Қолбасшы өзінің таңдаулы жасақшыларына бұйрық береді. Олар жол бойында сүрінгенмен қаланың қабырғасына қарай асығып, сонда дәу қорғаныш қалқандарын орнатып қояды."},
	{6, "6 Қыраттағы өзен қақпалары ашылып, топан су патша сарайын талқандайды."},
	{7, "7 Ниневи халқы айдауға кетуі керек деп шешіліп қойылған. Оның күң қыздары көгершіндей күңіреніп, қайғыдан көкіректерін соққылайды."},
	{8, "8 Ежелден Ниневи суға толы тоғанға ұқсайтын, бірақ қазір суы таусылып бара жатқандай, қала халқы қашып кетуде. Тоқта, тоқта! деген бұйрық берілсе де, ешкім артына бұрылмайды."},
	{9, "9 Жау: Күмісті олжалаңдар! Алтынды да әкетіңдер! — деп шақырады. Қала қазыналарындағы қымбат бұйымдар сансыз көп!"},
	{10, "10 Ниневи тоналып, қиратылып, қаңырап бос қалады. Адамдар жүрексініп, тізелері дірілдеп, денелері қалтылдап, барлығының бет-жүздері аппақ қудай болады."},
	{11, "11 Арыстанның апанындай болған қала енді қайда екен? Еркек, ұрғашы арыстандар іспетті балаларын азықтандырып, ештеңеден қаймықпай шарлап, жер бетін кезіп жүрген қатыгез халық қайда енді?"},
	{12, "12 Арыстан өзінің күшіктеріне жемтіктерін паршалап жеткілікті етіп әкеліп, ұрғашысын да қамтамасыз ететін. Ол апанын олжасы мен паршаланған жемтікке толтыратын."},
	{13, "13 Мен саған қарсымын, — деп ескертеді Әлемнің Иесі. — Мен сенің соғыс күймелеріңді өртеймін, семсер жас арыстандарыңды мерт қылады. Саған енді жер бетін олжалауға жол бермеймін. Сенің хабаршыларыңның паң дауыстары бұдан былай естілмейтін болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Қан төгуге, өтірікке толы, ұрлық пен тонау толастамайтын қала — Ниневи қасіретке қалады!"},
	{2, "2 Қамшының сартылы, дөңгелектің тарсылы, жылқының дүбірі, соғыс күймелерінің дүрсілі естіліп тұрады."},
	{3, "3 Атты әскер алға жүйіткіп, семсерлер жарқылдап, найзалар жалт-жұлт етеді. Көп адам қырылып, сансыз өліктер үйіліп, жұрт өліктерге сүрінетін болады."},
	{4, "4 Осының бәрі Ниневидің шексіз азғындығымен үшін басына түседі. Сұлу да тартымды болып, сиқыршылықты әбден меңгерген бұл қала арам іс-әрекетімен халықтарды баурап алды да, көп әулеттерді сиқыршылығымен құлдыққа сатты."},
	{5, "5 Мен саған қарсымын, — деп ескертеді Әлемнің Иесі. — Сенің етегіңді бетіңе дейін түргіземін! Халықтар мен патшалықтарға сенің жалаңаш тәніңді ашып, абыройыңды төгемін."},
	{6, "6 Сені кір-қоқыспен атқылап қорлаймын, кім екеніңді барша жұртқа паш етемін."},
	{7, "7 Көргендердің барлығы сенен қашып: Ниневи қирап қалды, енді кім оған көңіл айтпақ? дейді. Оны жұбататын ешкім де табылмайды."},
	{8, "8 Әлде сен Ніл өзенінің бойында орналасқан, айналасын су қоршаған Но-Аммон қаласынан артықсың ба? Өзен сол қаланың қорғанышы, қоршаған суы оның қамалы іспетті болған еді."},
	{9, "9 Құш пен Мысыр оның шексіз қуаты, Пұт пен Либия оның қолдаушыларының қатарында болатын."},
	{10, "10 Бірақ та оның халқы тұтқындалып, айдалып кетті; сәбилері әр көшенің қиылысында ұрылып өлтірілді. Жаулап алушылар абыройлы адамдарын жеребе тастап бөлісіп алып, барлық ұлықтарын кісендеп айдап әкетті."},
	{11, "11 Ал енді, Ниневи, сен де (Жаратқан Иенің қаһарынан) мас болғандай тәлтіректеп жүресің! Сен де тығылып, жаудан бас сауғалайтын орын іздейтін боласың."},
	{12, "12 Інжір ағашын ерте сілкігенде, піскен жемістері адамның аузына келіп түседі. Сенің барлық қамалдарың да дәл солай жау қолына түсетін болады."},
	{13, "13 Өз жасақшыларыңа көз тасташы: олардың барлығы да әйел сияқты әлсіз болады. Еліңнің қақпалары жауларыңа айқара ашылады, себебі олардың ысырмаларын от жалмап қояды."},
	{14, "14 Ниневи, қоршауға түсетін кезіңе дайындалып, су қорын жинап ал! Бекіністеріңді күшейт! Балшық илеп, әктас ерітіндісін дайындап, кірпіш қабырғаны жөнде!"},
	{15, "15 Алайда от сені жалмайды, семсер шауып түсіріп, шегіртке құртындай жоқ қылады. Шегірткедей көбейіп, соның құртындай молайып көр, бәрібір жау сені жоятын болады."},
	{16, "16 Сенің саудагерлерің аспандағы жұлдыздардан да көбейіп кеткен, бірақ олар шегіртке құртындай елді тып-типыл қылып, ұшып кетеді."},
	{17, "17 Нөкерлерің көк шегірткелер іспетті, лауазымды адамдарың шегіртке үйірлері сияқты. Салқын күндері олар шарбақтарға қонып отырады да, күн ысығанда ұшып кетеді. Қайда кеткендерін ешкім білмейді."},
	{18, "18 Уа, Ассур патшасы, сенің бақташыларың мүлгіп отыр: сол даңқты әміршілерің демалып жатыр! Ал халқың таулардың арасына шашырап кеткен, оларды жинап әкелетін ешкім жоқ."},
	{19, "19 Сенің күйреуің ешкім жаза алмайтын жара іспетті, өзің құлдыраған өлімші халдесің. Басыңа түскен апат туралы естіген әркім соны қол шапалақтап қабылдайды. Себебі сенің шегі жоқ қаталдығыңды өз басынан өткізбеген ешкім қалмады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};