#include <map>
#include <string>
class Bible66
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
	struct kk7	{ int val; const char *msg; };
	struct kk8	{ int val; const char *msg; };
	struct kk9	{ int val; const char *msg; };
	struct kk10	{ int val; const char *msg; };
	struct kk11	{ int val; const char *msg; };
	struct kk12	{ int val; const char *msg; };
	struct kk13	{ int val; const char *msg; };
	struct kk14	{ int val; const char *msg; };
	struct kk15	{ int val; const char *msg; };
	struct kk16	{ int val; const char *msg; };
	struct kk17	{ int val; const char *msg; };
	struct kk18	{ int val; const char *msg; };
	struct kk19	{ int val; const char *msg; };
	struct kk20	{ int val; const char *msg; };
	struct kk21	{ int val; const char *msg; };
	struct kk22	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Бұл — Иса Мәсіхтің көрініп, Құдайдың құпия жоспарын ашып, аян бергені туралы жазба. Құдай жақын арада болуға тиісті оқиғаларды өз қызметшілеріне көрсету үшін осы аянды Иса Мәсіхке тапсырды. Ол соларды қызметшісі Жоханға періштесін жіберіп білдірді."},
	{2, "2 Ал Жохан көргендерінің бәрін: Құдайдың хабарын және Иса Мәсіхтің аян еткендерін баяндап берді."},
	{3, "3 Осы пайғамбарлық хабардың сөздерін оқып беретіндер де, оларды тыңдап, жазылғандарды ұстанатындар да бақытты! Себебі бұлардың іске асатын уақыты таяп қалды."},
	{4, "4 Жоханнан Азия аймағындағы жеті қауымға дұғай сәлем: әрдайым бар, мәңгі болып келген және болашақта келетін (Құдай Ие), Оның тағының алдындағы жеті Рухы"},
	{5, "5 және шынайы хабарды адал жеткізген Иса Мәсіх сендерге рақымын жаудырып, тыныштық сыйлай көрсін! Иса Мәсіх — өлімнен қайта тірілгендердің ең Бастысы, әрі жер бетіндегі патшалықтардың Әміршісі. Мәсіх бізді сүйіп, Өзін құрбан етіп қанын төгуімен күнәларымыздан тазартып арылтты,"},
	{6, "6 һәм бізді өз Құдайы және Әкесіне бағышталған қызметкерлердің патшалығы қылды. Оның салтанатты ұлылығы мен құдіреті мәңгілік бола бермек! Аумин."},
	{7, "7 Біліп алыңдар, Мәсіх бұлттармен қайтып келеді! Әркім де, Оны түйрегендер де Мәсіхті көзімен көреді, Жер бетіндегі барлық рулар үрейленеді, Ол туралы қайғырып, жылап еңірейді. Иә, ол солай болады да! Аумин."},
	{8, "8 Бүкіл әлемнің Билеушісі — әрдайым бар, мәңгі болып келген және болашақта келетін Құдай Ие: Алғашқы да, Соңғы да Менмін! — дейді."},
	{9, "9 Мен, Жохан, сендердің бауырластарыңмын және Иса Мәсіхке бола азап шегіп, Оның Патшалығына қызмет етіп, қайта оралуын төзімділікпен күтудегі серіктестеріңмін. Құдайдың сөзін және Иса Мәсіхтің шынайы хабарын уағыздағаным үшін Патмос аралында тұрдым."},
	{10, "10 Иемізге бағышталған жексенбі күні мен Киелі Рухқа ерекше бөленіп, арт жағымнан керней үні сияқты қатты дауыс естідім."},
	{11, "11 Сол дауыс былай деді: Көргендеріңді шиыршық кітапқа жазып, мына жеті қаладағы сенушілер қауымдарына салып жібер: Ефес, Ізмір, Перғам, Тиятир, Сард, Філаделфи және Лаудіки."},
	{12, "12 Мен кімнің сөйлеп тұрғанын көру үшін жалт бұрылдым. Бұрылып қарағанда жеті алтын шам қойғышты көрдім."},
	{13, "13 Олардың арасында адам баласына ұқсас Біреу тұр екен. Ол етегі аяғына дейін жететін ұзын шапан киіп, кеудесіне алтын аспа бау таққан еді."},
	{14, "14 Оның басындағы шашы ақ мамықтай әрі қардай аппақ, ал көздері оттай жалындап жатты."},
	{15, "15 Аяқтары пеште балқыған қоладай жалтырап, даусы сарқырап аққан судың гүріліндей естілді."},
	{16, "16 Оның оң қолында ұстаған жеті жұлдызы бар екен. Аузынан екі жүзі де өткір семсер шығып, беті тал түстегі күндей нұрын төгіп тұрды."},
	{17, "17 Мен Оны көргенде өлі адамдай алдына құлап түстім. Сонда Ол оң қолын үстіме қойып, былай деді: Қорықпа! Мен Алғашқымын да Соңғымын"},
	{18, "18 әрі Мәңгі Тірімін. Мен өлген едім, ал енді мәңгілік өмір сүремін. Өлімнің де, о дүниенің де кілттері Менде."},
	{19, "19 Көргендеріңді, қазіргі барды және одан кейін болатындарды жазып қой!"},
	{20, "20 Сен Менің оң қолымнан көріп тұрған жеті жұлдыздың және жеті алтын шам қойғыштың құпия мағынасы мынау: жеті жұлдыз — жеті қауымның періштелерін, ал жеті шам қойғыш — жеті қауымды білдіреді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Ефестегі қауымның періштесіне былай деп жаз: Бұл — оң қолында жеті жұлдыз ұстап, жеті шам қойғыштың арасында жүретін Иеңнен хабар."},
	{2, "2 Мен сенің істеріңді білемін: сен еңбек етіп, шыдамды болып келесің. Арам адамдарға төзе алмай, өздеріне Құдайдың елшілері деген атақты таңатындарды сынап, өтірікшілер екенін анықтадың."},
	{3, "3 Менің атыма бола (еңбектеніп) көп ауыртпалықты басыңнан өткізгенде шыдамдылық көрсетіп, қажымадың."},
	{4, "4 Алайда саған айтар наразылығым мынау: сен алғашқы сенген кездегі сүйіспеншілігіңді жоғалтып алдың."},
	{5, "5 Өзіңнің қандай биіктіктен құлдырағаныңды ойлашы! Өкініп, теріс жолыңнан қайтып, алғашқыдағы игі істеріңді жасай бер! Әйтпесе саған жуырда келемін де, шам қойғышыңды (қауымдардың арасындағы) орнынан алып тастаймын. Егер өкініп, теріс жолыңнан қайтпасаң, осылай істеймін."},
	{6, "6 Бірақ сендегі бір жақсылық мынау: Мен жек көретін николаиттардың істерін сен де жек көресің."},
	{7, "7 Құлағы барлар Киелі Рухтың қауымдарға айтқандарын жақсылап тыңдап алсын! Жеңіп шыққан әркімге Мен Құдайдың пейіш бағында өсетін, мәңгілік өмірді сыйлайтын ағаштың жемісінен жегіземін."},
	{8, "8 Ізмірдегі қауымның періштесіне былай деп жаз: Бұл — бір кезде өлген, ал қазір тірі Алғашқы және Соңғыдан хабар."},
	{9, "9 Мен сенің (істерің мен) шеккен азаптарыңды әрі жұтаң күйіңді білемін — шынында рухани байсың! Яһудиміз (яғни Құдайдың халқымыз) дейтіндердің сен туралы айтқан ғайбат сөздерін де білемін. Шын мәнісінде олар — шайтанның мәжілісханасы."},
	{10, "10 Болашақта басыңнан кешетіндеріңнен қорықпа! Рас, шайтан кейбіреулеріңді түрмеге салып, сынамақ, ал көретін азаптарың он күнге ғана созылады. Өлімге дейін Маған адал бол, сонда саған мәңгілік өмір тәжін сыйлаймын."},
	{11, "11 Құлағы барлар Киелі Рухтың қауымдарға айтқандарын жақсылап тыңдап алсын! Жеңіп шыққан әркім екінші өлімнен зиян көрмейді."},
	{12, "12 Перғамдағы қауымның періштесіне былай деп жаз: Бұл — екі жүзі де өткір семсері Бардан хабар."},
	{13, "13 Мен сенің (істеріңді және) шайтанның тағы орналасқан жерде тұратыныңды білемін. Бірақ Менің атымды ұстанып келесің. Адал хабаршым Антипас сенің қасыңда, яғни әзәзіл шайтанның тұрағында, өлтіріліп шейіт болған кезде де Маған деген сеніміңнен бас тартпадың."},
	{14, "14 Алайда саған айтар біраз наразылығым мынау: араларыңда Балағамның ілімін ұстанушылар бар. Сол көріпкел ежелде Исраилге қарсы шыққан Балаққа халықты күнәға азғыруды үйреткен: оларға жалған тәңірлерге шалынған құрбандықтардың етін жегізді әрі азғындық жасатты."},
	{15, "15 Сондай-ақ, араларыңда николаиттардың (Мен жек көретін) ілімін ұстанушылар да бар."},
	{16, "16 Енді өкініп, теріс жолдан қайтыңдар! Әйтпесе саған жуырда келемін де, сол қате ілімді ұстанушылармен аузымдағы семсеріммен соғысамын."},
	{17, "17 Құлағы барлар Киелі Рухтың қауымдарға айтқандарын жақсылап тыңдап алсын! Жеңіп шыққан әркімді Мен жасырылған маннамен тамақтандырамын. Оған алған кісіден басқа ешкім де білмейтін жаңа есім ойып жазылған бір ақ тасты да сыйлаймын."},
	{18, "18 Тиятирдағы қауымның періштесіне былай деп жаз: Бұл — Құдайдың рухани Ұлынан хабар. Оның көздері оттай жалындап, аяқтары балқыған қоладай жалтырайды."},
	{19, "19 Мен сенің не істегеніңді — сүйіспеншілігің мен сеніміңді, қызметің мен төзіміңді білемін. Қазіргі игі істерің алғашқыдағыдан көбірек."},
	{20, "20 Алайда саған айтар наразылығым мынау: өзін пайғамбармын деп атайтын Езабел іспетті әйелге жол бересің. Ол Менің қызметшілерімді азғындық жасап, жалған тәңірлерге арналған құрбандықтардың етін жеуге үйретіп адастыруда."},
	{21, "21 Мен сол Езабелге өкініп, азғындық жолынан қайтуға уақыт бердім, алайда ол қайтқысы келмейді."},
	{22, "22 Біліп ал: Мен Езабелді ауруға шалдықтырып, төсек тартқызамын. Егер сол әйелмен бірге азғындық жасап келгендер оның жаман істерінен қайтпаса, оларға да қатты азап шеккіземін."},
	{23, "23 Оның соңынан ергендерді өлтіріп құртамын. Сонда Менің әркімнің жүрегінің түкпір-түкпірін тексеретін Біреу екеніме барлық қауымдардың көздері жететін болады. Мен әрқайсыңның істеріңе қарай еселеріңді қайтаратын боламын."},
	{24, "24 Ал Тиятирда Маған адал болып қалғандарға, яғни осы арам ілімді қабылдамай, шайтанның терең құпиялары деп аталғанды үйренбегендерге, былай деймін: сендерге тағы басқа ауыртпалық түсірмеймін;"},
	{25, "25 алайда Мен келгенше, өздеріңде бар рухани игіліктерді берік ұстаңдар!"},
	{26, "26 Істерімді аяғына дейін атқарып, жеңіп шыққандарға халықтардың үстінен билік жүргізу құқығын сыйлаймын."},
	{27, "27 Оларға қатаң билік жүргізеді. Қыш ыдыстарын лақтырып сындырғандай, қиқарлықтарын тас-талқан етеді. Мен де Әкемнен осындай билікті алғанмын."},
	{28, "28 Мен жеңіп шыққандарға таңғы жұлдызды да сыйлаймын."},
	{29, "29 Құлағы барлар Киелі Рухтың қауымдарға айтқандарын жақсылап тыңдап алсын!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Сардтағы қауымның періштесіне былай деп жаз: Бұл — Өзінде Құдайдың жеті Рухы әрі жеті жұлдызы Бардан хабар. Мен сенің істеріңді білемін; жұрт сені тірі деп санағанмен (рухани) өлісің."},
	{2, "2 Оян! Өзіңде әлі де бар, бірақ жуырда өлмекші игі қасиеттеріңді нығайт! Себебі сенің істеріңді Құдайымның көз алдында жеткіліксіз деп таптым."},
	{3, "3 Өзің тыңдап қабылдаған шынайы ілімді есіңе түсіріп, ұстанып, теріс жолдан қайт! Ал егер оянбасаң, саған ұры сияқты сап ете түсемін. Менің келетін уақытымды ешқашан біле алмайсың."},
	{4, "4 Дегенмен Сардтағы сендердің араларыңда арамданбаған бірқатарың бар. Олар аппақ киім киіп, Менімен бірге жүретін болады. Себебі олар соған лайық."},
	{5, "5 Жеңіп шыққан әркім солар сияқты аппақ киім киетін болады; Мен оның есімін Мәңгілік өмір кітабынан өшірмей, Әкемнің және Оның періштелерінің алдында ашық мойындаймын."},
	{6, "6 Құлағы барлар Киелі Рухтың қауымдарға айтқандарын жақсылап тыңдап алсын!"},
	{7, "7 Філаделфидегі қауымның хабаршысына былай деп жаз: Бұл — Киелі де Шынайыдан хабар. Өзімде Дәуіттің (патшалығының) кілті бар; Мен ашқанды ешкім жаба алмайды, Мен жапқанды ешкім аша да алмайды."},
	{8, "8 Сенің істеріңді білемін. Міне, Мен алдыңнан есікті ашып қойдым, ешкім де оны жаба алмайды. Өзіңдегі күш азырақ болғанымен, сен айтқандарымды сақтап, Менен танбадың."},
	{9, "9 Тыңда: өздерін яһудиміз (яғни Құдай халқымыз) десе де, олай емес, өтірікші әрі шайтанның мәжілісханасы болғандардың кейбіреулерін саған беремін; расында оларды аяғыңа бас ұрғызып, Өзімнің сені сүйетіндігіме көздерін жеткіздіремін."},
	{10, "10 Сен Менің азаптарда төзімділік таныту туралы бұйрығымды орындап келгендіктен, Мен сені осы дүниенің адамдарын тексеруге арналған, бүкіл жер бетінде болатын азапты сынақ кезінде қорғаймын."},
	{11, "11 Мен жуырда келемін. Жеңісіңнің тәжін сенен ешкім тартып алмау үшін, өзіңде бар рухани игіліктерді берік ұста!"},
	{12, "12 Жеңіп шыққан әркімді Мен Құдайымның киелі үйінің бағанасы қылып қадірлеймін; ол содан ешқашан шықпайтын болады. Оған Құдайымның атын, Соның қаласының атын, яғни көктен, Оның қасынан түсетін жаңа Иерусалимнің атын және Өзімнің жаңа атымды да жазамын."},
	{13, "13 Құлақтары барлар Киелі Рухтың қауымдарға айтқандарын жақсылап тыңдап алсын!"},
	{14, "14 Лаудікидегі қауымның періштесіне былай деп жаз: Бұл — Аумин деп те аталатын Мәсіхтен хабар. Ол — шындықты жариялап, шейіт болған адал да шынайы Куәгер әрі Құдайдың жаратылысының Билеушісі."},
	{15, "15 Мен сенің істеріңді білемін: сен салқын да емессің, ыссы да емессің. Не ыссы, не салқын болсаң ғой, шіркін!"},
	{16, "16 Алайда ыссы да емес, салқын да емес, жылымшы болғаның үшін сені аузымнан түкіріп тастамақпын!"},
	{17, "17 Мен баймын, ауқаттымын, еш нәрсеге мұқтаж емеспін, — дейсің. Ал өзіңнің шынында сорлы бейшара, рухани жарлы, жалаңаш әрі соқыр екеніңді білмейсің!"},
	{18, "18 Саған рухани баюың үшін отта балқытылып тазартылған саф алтынды Менен сатып алуға кеңес беремін. Масқара жалаңаштығың көрінбес үшін Менен аппақ киім де алып, киін. Сондай-ақ, көре алуың үшін көзге жағатын шипалы май да сатып ал!"},
	{19, "19 Мен сүйетіндерімді әшкерелеп, тәртіпке шақырамын. Енді ынталы болып, өкініп, теріс жолдан қайт!"},
	{20, "20 Міне, Мен есік алдына келіп, қағып тұрмын. Кімде-кім даусымды естіп, есік ашса, Мен оның жан дүниесіне еніп, онымен бірге дастарқандас боламын; ол да рухани нәр алып, Менімен тығыз байланыста болады."},
	{21, "21 Өзімнің жеңімпаз болып, Әкеммен бірге Оның тағында отырғанымдай, Мен жеңіп шыққан әркімді де қасыма, тағымның үстіне отырғызамын."},
	{22, "22 Құлақтары барлар Киелі Рухтың қауымдарға айтқандарын жақсылап тыңдап алсын!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Осыдан кейін қарап қалсам, көкте ашылған есікті көрдім! Мен бұдан бұрын да естіген, керней үніне ұқсайтын қатты дауыс маған: Мұнда көтеріл, саған осыдан кейін не болуға тиіс екенін көрсетемін, — деді."},
	{2, "2 Мен дереу Киелі Рухқа ерекше бөленіп аян көрдім: көкте бір тақ тұрды, үстінде Біреу отыр екен."},
	{3, "3 Отырғанның сырт көрінісі яспис, карнеол іспетті асыл тастардай сәуле шашып, ал тақтың айналасын зүбәржаттай жалтыраған кемпірқосақ қоршапты."},
	{4, "4 Тақты айналдыра жиырма төрт тақ тұр екен. Олардың үстінде ақ киімді, алтын тәж киген жиырма төрт ақсақал отырды."},
	{5, "5 Тақтың тұсынан найзағайдың жарқылы, гүрсілі және күркірі шықты. Ал тақтың алдында жеті шырағдан жалындап жанып тұрды. Олар — Құдайдың жеті Рухының белгісі."},
	{6, "6 Тақтың алды мөлдір кристалл іспетті шыны теңізге ұқсады. Тақты қоршай, оның ортаңғы баспалдағында төрт нөкер бар еді. Олардың денелерінің алды-артында көптеген көздері болды."},
	{7, "7 Алғашқысы арыстанға, екіншісі бұқаға, үшіншісінің беті адамның бетіне, ал төртіншісі ұшып бара жатқан бүркітке ұқсас екен."},
	{8, "8 Әрбіреуінің алты қанаты болатын, қанаттардың тұла бойлары да толған көздер еді. Олар күні-түні тоқтамастан: Бүкіл әлемнің Билеушісі — әрдайым болып келген, мәңгі бар және болашақта келетін Құдай Ие қасиетті, қастерлі, киелі! — деп сиынумен болды."},
	{9, "9 Төрт нөкер тақта отырған, мәңгілік өмір сүретін Құдайға даңқ пен құрмет көрсетіп, шүкірлік еткен сайын,"},
	{10, "10 жиырма төрт ақсақал Оның алдына бас ұра жығылып, мәңгі тірі Оған тағзым етеді. Олар тәждерін тақтың алдына ұсынып, былай дейді:"},
	{11, "11 Уа, Құдай Иеміз, Сен даңқ пен ұлылыққа, құрмет пен билікке лайықсың! Өйткені бүкіл әлемді жаратқан Өзіңсің; Сенің еркіңмен ол жаратылды және бола да береді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Содан кейін тақ үстінде Отырғанның оң қолынан бір шиыршық кітапты көрдім. Шиыршық кітаптың екі жағына да жазу жазылып, ол жеті мөрмен бекітілген болатын."},
	{2, "2 Сол кезде бір құдіретті періштені де көрдім. Ол қатты дауыспен: Кім мөрлерді бұзып, кітапты ашуға лайық? — деп жариялады."},
	{3, "3 Алайда көктен де, жерден де, жер астынан да кітапты ашып, оның ішіне қарау билігі бар ешкім табылмады."},
	{4, "4 Кітапты ашып, оның ішіне қарауға лайықты ешкімнің табылмағандығына қатты қайғырып жыладым."},
	{5, "5 Сонда ақсақалдардың біреуі маған: — Жылама, қара: Дәуіт патшаның әулетінен, Яһуда руынан шыққан Арыстан жеңіске жетті! Оның сол жеті мөрді сындырып, кітапты ашып, оқуға билігі бар, — деді."},
	{6, "6 Мен қарасам, тақтың ортасында, айнала тұрған төрт нөкер мен ақсақалдар қоршаған Тоқтыны көрдім. Ол құрбандыққа шалынғандай болып көрінді. Оның жеті мүйізі мен жеті көзі бар екен, бұлар бүкіл әлемге жіберілген Құдайдың жеті Рухын білдіреді."},
	{7, "7 Тоқты барып, тақта Отырғанның оң қолынан кітапты қабылдады."},
	{8, "8 Тоқты соны қолға алған кезде төрт нөкер мен жиырма төрт ақсақал Тоқтының алдына бас ұра жығылды. Әрқайсысының қолында домбыраға ұқсас алтын аспап және түтетілетін хош иісті заттарға толы алтын табалар болды. Осы хош иісті заттар Құдай халқының айтқан мінажаттарын білдіреді."},
	{9, "9 Нөкерлер мен ақсақалдар жаңа мадақтау жырын айтып былай деді: — Сен лайықсың кітапты қолыңа алуға Және мөрлерін бұзып, оны ашуға! Өйткені құрбан болып, қаныңды төктің, Сол арқылы әр ру, тіл, ұлт пен халықтан Шыққандардың төлемін өтеп босаттың, Һәм Құдайға оларды бағыштадың,"},
	{10, "10 Әрі Құдайымызға арнап соларды Жасадың діни қызметкерлер патшалығы; Олар жер бетін билейтін болады."},
	{11, "11 Мен тағы да қарап, тақты, төрт нөкерді және ақсақалдарды қоршап тұрған мыңдаған, миллиондаған періштелерді көріп, үндерін естідім."},
	{12, "12 Олар қатты дауыспен әндетіп былай деді: Құрбандыққа шалынған Тоқты Билік пен байлықты, Даналық пен құдіретті, Құрмет, ұлылық пен дәріпті Қабылдауға әбден лайықты!"},
	{13, "13 Көк пен жердегі, жер асты мен теңіздегі, яғни бүкіл әлемдегі, әрбір тіршілік иесінің былай деп ән салған даусын естідім: Тақта Отырған және Тоқты Дәріптелу мен құрметке, Ұлылық пен құдіретке Мәңгі бақи лайықты!"},
	{14, "14 Төрт нөкер: Аумин, — деп жауап берді. Ал жиырма төрт ақсақал жерге бас ұра жығылып, (мәңгі тірі Жаратқан Ие мен Тоқтыға) тағзым етті."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 Содан кейін мен Тоқтының жеті мөрдің біріншісін сындырып ашқанын көрдім. Сол кезде төрт нөкердің біреуінің күннің күркіріндей қатты дауыспен: Аттан! — деп шақырғанын естідім."},
	{2, "2 Қарап қалсам, алдымда ақ боз ат тұр екен. Ат үстіндегі қолына садақ ұстап, басына жеңімпаздың тәжін киіп алыпты. Ол өзінің өктемдігін орнату үшін елдерді жаулап алуға аттанды."},
	{3, "3 Тоқты екінші мөрді сындырып ашқанда, екінші нөкердің де: Аттан! — деп шақырғанын естідім."},
	{4, "4 Сонда оттай қызыл ат шықты. Оған мінгенге адамдар бірін-бірі қырулары үшін жер бетіндегі бейбітшілікті жою билігі беріліп, үлкен семсер табыс етілді."},
	{5, "5 Тоқты үшінші мөрді сындырып ашқанда, үшінші нөкердің де: Аттан! — деп шақырғанын естідім. Қарасам, алдымда қара ат тұр екен. Үстіндегі салт атты қолына таразы ұстапты."},
	{6, "6 Сонда мен нөкерлер жағынан шыққан: Бір күндік еңбекақыға тек бір қадақ бидай немесе үш қадақ арпа ғана берілмек, ал зәйтүн майы мен шарапты бүлдірме! — деген дауысты естідім."},
	{7, "7 Тоқты төртінші мөрді сындырып ашқанда, мен төртінші нөкердің де: Аттан! — деп шақырғанын естідім."},
	{8, "8 Қарасам, алдымда сұп-сұр қуқыл ат тұр екен. Оған мінгеннің есімі Өлім, ал соңынан О дүние делінгені еріпті. Осы екеуіне жердің төрттен бір бөлігіне өктемдік құрып, семсер, ашаршылық, індет және жыртқыш аңдар арқылы құрту билігі берілді."},
	{9, "9 Тоқты бесінші мөрді сындырып ашқанда, мен құрбандық үстелінің астыңғы жағынан Құдайдың хабарын жариялап, сенімдеріне адал қалғандары үшін шейіт болғандардың жандарын көрдім."},
	{10, "10 Олар қатты дауыспен: — Уа, киелі де шынайы Билеуші! Қашанғы Сен жер бетіндегі адамдарды соттамай, төккен қанымыздың құнын талап етпей жүресің? — деген сұрақ қойды."},
	{11, "11 Олардың әрбіреуіне (ақталу белгісі ретінде) ақ шапан жабылып: — Сендер сияқты шейіт болуға тиісті қызметтестерің мен бауырластарыңның саны толық болғанға дейін біраз уақыт тынышталып күте тұрыңдар, — деген жауап берілді."},
	{12, "12 Тоқты алтыншы мөрді сындырып ашқанда қарасам, жер қатты сілкініп, күн қалың қара жамылғымен жабылғандай түнекке, ал ай түгелдей қан қызыл түске айналыпты!"},
	{13, "13 Жұлдыздар қатты жел шайқағанда ағаш басынан құлап түсетін, әлі де піспеген інжір жемістеріне ұқсап жерге құлап түсті."},
	{14, "14 Аспан шиыршық кітап іспетті оралып ғайып болды, әрбір тау мен арал да өз орындарынан қозғала жөнелді."},
	{15, "15 Жердегі патшалар, ақсүйектер және байлар, қолбасылар мен күштілер және күллі құл-еріктілер үңгірлерге және таудағы құздардың арасына тығылып қалды."},
	{16, "16 Олар таулар мен құздарға жалбарынып: Үстімізге құлап түсіп, бізді тақта Отырғанның көзінен таса қылып, Тоқтының қаһарынан жасыра көріңдер!"},
	{17, "17 Олардың қаһарын шашатын күні жетті, енді кім соған төзе алады?! — деді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct kk7 poems[] = {
	{1, "1 Мұнан кейін мен дүниенің төрт бұрышында тұрып, жер бетіне, теңізге және ағаштарға ешқандай жел соға алмастай етіп жердің төрт желін тұсаулап ұстаған төрт періштені көрдім."},
	{2, "2 Сол кезде күншығыстан келе жатқан, қолында мәңгі тірі Құдайдың мөрі бар басқа бір періштені де көрдім. Ол Құдайдан жер мен теңізге зақым келтіру билігін алған төрт періштеге қатты дауыспен айқайлап:"},
	{3, "3 Біз Құдайымыздың қызметшілерінің маңдайына таңба салып болмайынша, жер бетіне, теңізге және ағаштарға ешбір зақым келтірмеңдер! — деп бұйырды."},
	{4, "4 Мен маңдайларына Құдайдың таңбасы салынғандардың саны жүз қырық төрт мың екенін естідім; олар Исраилдің барлық руларынан еді."},
	{5, "5 Әрбір рудан, яғни Яһуда, Рубен, Ғад, Ашир, Нафталим, Манаса, Шимон, Леуі, Исашар, Забулон, Жүсіп және Бунямин руларынан он екі мыңнан адамға таңба салынды."},
	{6, "9 Содан соң қарасам, сансыз көп адамдардың ғаламат жиынын көрдім. Олар әрбір ұлт, ру, халық және тілден шығып, тақ пен Тоқтының алдында ақ шапан киіп, қолдарына пальма бұтақшаларын ұстап тұр екен."},
	{7, "10 Жиналғандар қатты дауыспен былай деп мақтау айтты: — Құтқарылу тақта отырған Құдайымыз бен Тоқтының билігінде!"},
	{8, "11 Барлық періштелер де, ақсақалдар мен төрт нөкер де тақты айналдыра тұрды. Олар тақтың алдында жерге бас ұра жығылып Құдайды былай деп даңқтады:"},
	{9, "12 — Аумин. Дәріптеу, ұлылық және даналық, Шүкірлік, құрмет, құдірет пен билік Біздің Құдайға арналған мәңгілік! Аумин."},
	{10, "13 Мұнан кейін ақсақалдардың бірі маған: — Ақ шапан киген мына адамдар кімдер, олар қайдан келді? — деген сұрақ қойды."},
	{11, "14 — Мырзам, өзіңіз білесіз ғой, — деп жауап бердім. Ол маған былай деп түсіндірді: — Бұлар — зор қудалану кезеңінен өткендер. Олар шапандарын Тоқтының төгілген қанымен жуып аппақ қылды."},
	{12, "15 Сондықтан олар Құдайдың тағының алдында тұрып, Оған күні-түні киелі үйінде қызмет етеді. Тақта отырған Құдай олардың арасында бірге тұрып, баспана болады."},
	{13, "16 Енді ешқашан да соларды аштық пен шөл азабы қинамайды, күннің аптабы да күйдірмейді."},
	{14, "17 Себебі тақтың ортасындағы Тоқты олардың Бағушысы болып, тірі судың бұлақтарына жетелейді. Құдай солардың барлық көз жастарын сүртіп тастап жұбатады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct kk8 poems[] = {
	{1, "1 Тоқты жетінші мөрді бұзып ашқанда, көкте жарты сағат шамасында тыныштық орнады."},
	{2, "2 Бұдан кейін мен Құдай алдында тұрған жеті періштені көрдім, оларға жеті керней берілді."},
	{3, "3 Қолында хош иісті заттарды түтетуге арналған алтын табасы бар өзге бір періште келіп, түтету үстелінің жанына тұрды. Оған молынан хош иісті заттар берілді. Ол соларды Құдайдың бүкіл халқының айтқан мінажаттарымен бірге тақтың алдындағы алтын жалатқан түтету үстеліне Тәңір Иеге бағыштап қоюға тиіс еді."},
	{4, "4 Сонда хош иісті заттардың түтіні Құдай халқының мінажаттарымен бірге періштенің қолынан көтеріліп, Құдайдың алдына жетті."},
	{5, "5 Бұдан кейін періште хош иісті заттар салынған табаны алып, түтету үстелінен алынған шоққа толтырып, жерге лақтырып жіберді. Сонда күн күркіреп, жаңғырықты; найзағай жарқылдап, жер сілкінді."},
	{6, "6 Сол кезде қолдарында кернейлері бар жаңағы жеті періште соларын тартуға дайындалды."},
	{7, "7 Алғашқысы кернейлеткенде, қан аралас бұршақ пен от пайда болып, жерге жауды. Жер бетінің және ағаштардың үштен бір бөлігі мен көк шөптің бәрі де өртеніп, жанып кетті."},
	{8, "8 Екінші періште кернейлеткенде, жалындап жатқан зәулім таудай бір нәрсе теңізге лақтырылды. Теңіздің үштен бірі қанға айналып,"},
	{9, "9 ондағы тіршілік иелерінің үштен бірі өліп, кемелердің де үштен бірі қирады."},
	{10, "10 Үшінші періште де кернейін тартты. Сонда аспаннан шырақ сияқты лаулаған зәулім жұлдыз өзендердің үштен бір бөлігіне және су көздеріне құлап түсті."},
	{11, "11 Сол жұлдыздың аты — жусан. Судың үштен бір бөлігі жусандай ащы болып, одан ішкен көптеген адамдар өліп қалды."},
	{12, "12 Төртінші періште кернейін тартқанда, күннің, айдың, жұлдыздардың үштен бір бөлігі зақымдалып, олардың үштен бірін қараңғылық басып, күннің үштен бір бөлігі түн іспетті қара түнекке айналды."},
	{13, "13 Мұнан кейін қарасам, аспанда ұшып жүрген бір бүркітті көріп, оның қатты дауыспен: Қасірет, қасірет! Қалған үш періште кернейлерін тартқанда, күнәкар дүниеде өмір сүргендердің қасіреті қандай болмақ! — деп ескерткенін естідім."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct kk9 poems[] = {
	{1, "1 Бесінші періште кернейлеткенде, көктен жерге құлап түскен жұлдызды көрдім. Оған (жындар тұратын) терең тұңғиық көзінің кілті берілді."},
	{2, "2 Жұлдыз тұңғиықтың қақпасын ашқанда, одан үлкен пештен шыққандай қою түтін шығып, содан күн көзі де, ауа да қараңғыланып кетті."},
	{3, "3 Түтіннен шегірткелер шығып, жерге қонды. Оларға жердегі шаяндар іспетті (залал тигізу) күші беріліп,"},
	{4, "4 тек маңдайларында Құдайдың таңбасы жоқ адамдарды ғана жәбірлеу бұйырылды. Ал оларға көк шөпке, басқа да ешқандай өсімдіктер мен ағаштарға зақым келтіруге рұқсат берілмеді."},
	{5, "5 Сол шегірткелердің бұл адамдарды өлтірмей, тек бес ай бойы азаптау еркі ғана болды. Олардың шаққаны адамды улы шаянның шаққанындай азаптап қинайды."},
	{6, "6 Осы бес ай ішінде адамдар өлгілері келсе де, өле алмайды. Олар өлуді қаншама аңсағанмен, ажал олардан қашып кететін болады."},
	{7, "7 Шегірткелер ұрысқа дайын аттардай көрінді. Бастарына алтын тәж секілді бір нәрсе киіп, бет пішіндері адамға ұқсас болды."},
	{8, "8 Олардың шаштары әйелдердің шаштарындай, тістері арыстанның тістеріндей,"},
	{9, "9 ал кигендері темір сауытқа ұқсас екен. Қанаттарынан шыққан шуы ұрысқа шапқан ат жеккен сансыз күймелердің дөңгелектерінің дыбысындай еді."},
	{10, "10 Шегірткелердің шаяндікі сияқты құйрықтары мен улы тістері бар екен; оларға бес ай бойы адамдарды шағу еркі берілді."},
	{11, "11 Тұңғиықтың періштесі шегірткелердің үстерінен патшадай билік жүргізеді екен. Оның еврейше, грекше аттарының мағынасы — Құртушы."},
	{12, "12 Бір қасірет өтті, енді, міне, тағы екеуі төніп келеді!"},
	{13, "13 Алтыншы періште кернейлеткен кезде Құдай алдында тұрған, алтын жалатқан түтету үстелінің төрт бұрышындағы мүйіздерінен шыққан бір дауысты естідім."},
	{14, "14 Сол дауыс кернейі бар алтыншы періштеге: Ұлы Евфрат өзенінің жағасында байлаулы жатқан төрт хабаршыны босат! — деп бұйырды."},
	{15, "15 Сонда дәл осы сағат, осы күн, осы ай, осы жылда (күнәкар) адамдардың үштен бірін өлтіруге дайындалған төрт хабаршы босатылып жіберілді."},
	{16, "16 Олардың атты әскерінің санын естідім: екі жүз миллион шамасында еді."},
	{17, "17 Мен осы аянда көрген аттар мен салт аттылардың сырт көрінісі мынадай: үстерінде оттай қызыл, қара көк және күкірттей сары түсті қалқандары бар еді. Аттардың бастары арыстандікіне ұқсап, ал ауыздарынан от-жалын, түтін және күкірт шығып жатты."},
	{18, "18 Адамзаттың үштен бірі аттардың ауыздарынан шыққан осы үш пәледен: от-жалын, түтін және күкірттен қырылып қалды."},
	{19, "19 Аттардың күштері ауыздарында да, құйрықтарында да бар еді. Себебі құйрықтары адамды шағып зақымдайтын басы бар жыландарға ұқсайтын."},
	{20, "20 Алайда сол пәлелерден өлмей, аман қалған адамдар өз қылықтарына өкініп, бас тарта қоймады. Олар өздерінің жын-перілерге және алтын, күміс, мыс, тас немесе ағаштан жасалған мүсіндерге табынып келгендеріне опық жеп, тәубеге келмеді. Ал сол мүсіндер не көре, не ести, не жүре алмайды ғой."},
	{21, "21 Сонымен қатар адамдар өздерінің кісі өлтіріп, сиқыршылықпен айналысып, азғындыққа салынып, ұрлық жасап күнәға батқандарынан да қайтпады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct kk10 poems[] = {
	{1, "1 Мұнан кейін көктен түсіп келе жатқан басқа бір күшті періштені көрдім. Ол бұлтқа оранған еді, ал басының үстінде кемпірқосағы бар болатын. Беті күндей жарқырап, ал аяқтары от бағанасына ұқсады."},
	{2, "2 Періште қолына жазуы бар, ашылған кітапшаны ұстап тұрды. Содан ол оң аяғын теңіз бетіне, сол аяғын құрлық үстіне қойып,"},
	{3, "3 арыстанның ақырғанындай қатты айқайлады. Ол айқайлағанда, (Құдайдың тағындағы) жеті күн күркірі үн қатып сөйледі."},
	{4, "4 Олар сөйлеп жатқанда, мен айтқандарын жазып алмақшы болдым. Алайда көктен маған: Жеті күн күркірінің айтқандарын жазба. Оларды жауып тастап, мөр басып бекіткендей құпия сақта! — деген дауысты естідім."},
	{5, "5 Содан кейін мен бір аяғымен теңізде, бір аяғымен құрлықта тұрғанын көрген періште оң қолын көкке қарай көтерді."},
	{6, "6 Ол аспан мен жерді, теңізді және олардағы барлық нәрселерді жаратқан, мәңгі тірі Тәңір Иенің атымен ант беріп, былай деді: Енді еш кешеуілсіз,"},
	{7, "7 жетінші періште кернейін тартып, белгі берген кезде Құдайдың құпия жоспары жүзеге асады! Бұл Оның өз қызметшілері — пайғамбарларына алдын ала хабарлағанындай болмақ."},
	{8, "8 Мен бұрын көктен естіген дауыс маған қайтадан тіл қатып: Барып, теңіз бен құрлықта тұрған періштенің оң қолындағы ашылған кітапшаны ал, — деді."},
	{9, "9 Сонда мен періштеге барып, одан кітапшасын беруін өтіндім. Ол маған: Ал да, жеп қой. Ол қарныңа барғанда ащы, ал аузыңда балдай тәтті болады, — деді."},
	{10, "10 Мен періштенің қолынан кітапшаны алып, жеп қойдым. Аузымда ол маған балдай тәтті болса, жұтқаннан кейін ішімді қуырды."},
	{11, "11 Мұнан соң маған: Сен тағы да Құдайдың көптеген халықтар, ұлттар, тілдер және патшалар туралы хабарын жариялауға тиіссің, — деген тапсырма берілді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct kk11 poems[] = {
	{1, "1 Содан кейін біреу маған бір өлшеуіш қамыс таяқты беріп, былай деді: — Бар да, Құдайдың киелі үйін және ондағы түтету үстелін өлшеп, сол жердегі ғибадат етіп жатқандардың санын есепте!"},
	{2, "2 Алайда киелі үйдің сыртқы ауласын өлшеме, оны есептен шығарып таста! Себебі Құдай оны Өзіне мойынсұнбаған басқа ұлттарға уақытша табыс етті. Олар киелі қаланы қырық екі ай бойы табандарының астына таптайтын болады."},
	{3, "3 Бірақ Мен Өзімнің екі хабаршымды тағайындаймын. Олар азалы киім киіп қайғырып, сол бір мың екі жүз алпыс күн бойы Менің хабарымды жариялайтын болады."},
	{4, "4 Екі хабаршы — қос зәйтүн ағашы және әлемнің Иесінің алдында тұрған қос шам қойғыш."},
	{5, "5 Егер кейбіреу оларды жәбірлемек болса, онда ауыздарынан от-жалын шашып, жауларын жалмап қояды. Оларға зиянкестік жасағысы келгендер осылай құртылады."},
	{6, "6 Екеуі Құдайдың хабарын жариялаған кездерінде өз қалаулары бойынша жаңбыр жаумайтындай етіп аспанды жауып тастау, суды қанға айналдыру және жерді әр түрлі пәлелерге душар еткізу биліктері бар."},
	{7, "7 Екі хабаршы Мәсіхтің хабарын түгелдей жариялап болғаннан кейін, тұңғиықтан шыққан бір хайуан олармен соғысып, жеңіп шығып, өлтіреді."},
	{8, "8 Мұнан кейін олардың сүйектері үлкен қаланың көшесінде жатады. Екеуінің Иесі (Мәсіх) айқышқа шегеленіп, өлтірілген сол қаланы (яғни Иерусалимді) астарлап Содом және Мысыр деп те атайды."},
	{9, "9 Үш жарым күн бойы барлық халықтар, рулар, тілдер және ұлттардың адамдары екі хабаршының мәйіттеріне қарап, қабірге қоюға рұқсат бермейтін болады."},
	{10, "10 Олардың өліміне күнәкар дүниенің адамдары шаттанып, тойлап, бір-біріне сый-сыяпаттар жібереді. Себебі осы екі пайғамбар күнәкар адамзатқа азап әкелген болатын."},
	{11, "11 Бірақ үш жарым күн өткеннен кейін, Құдайдың өмір беретін демі олардың бойларына еніп, екеуі де орындарынан түрегелді. Оларды көргендердің бәрін зор үрей биледі."},
	{12, "12 Екі пайғамбар көктен өздеріне үн қатып: Мұнда көтеріліңдер! — деген дауысты естіді. Дұшпандары қарап тұрған кезде олар бұлтпен көкке көтеріліп кетті."},
	{13, "13 Дәл сол сәтте болған қатты жер сілкіністен қаланың оннан бір бөлігі талқандалып, жеті мың адам қырылды. Ал қалған халықты қатты қорқыныш билеп, олар көктің Иесі — Құдайдың даңқын мадақтады."},
	{14, "14 Екінші пәле аяқталды, енді үшіншісі жақындап келе жатты."},
	{15, "15 Жетінші періште кернейін тартқанда, көктен: Әлемді басқару билігі Жаратқан Иеміздікі және Оның тағайындаған Патшасы Мәсіхтікі! Ол мәңгілік билік жүргізетін болады! — деген қатты дауыстар шықты."},
	{16, "16 Құдай тағының алдында өз тақтарында отырған жиырма төрт ақсақал жерге бас ұра жығылып, Құдайға тағзым етіп былай деді:"},
	{17, "17 Уа, бүкіл әлемнің Билеушісі — әрдайым бар және мәңгі болып келген Құдай Ие! Сен ұлы құдіретіңді қолыңа алып, Патшалық құра бастадың, соған ризашылығымызды білдіреміз."},
	{18, "18 Саған мойынсұнбаған ұлттар ашу-ызаға кенелді. Алайда Сенің қаһарыңды шашып, о дүниеге аттанғандарды соттайтын уақытың келді. Енді Сен қызметшілеріңе: пайғамбарларың мен барлық халқыңа, Өзіңді құрметтейтін үлкен-кішінің бәріне де сыйыңды бересің. Ал жерді құртқандардың өздерін құртасың."},
	{19, "19 Сонда Құдайдың көктегі киелі үйі ашылып, ондағы Келісім сандығы көрінді. Найзағайлар жарқылдап, қатты дауыстар мен күн күркірі естіліп, жер сілкініп, бұршақ қатты жауды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct kk12 poems[] = {
	{1, "1 Мұнан кейін аспанда бір керемет зор көрініс пайда болды: күнді жамылған, аяғының астында айы бар, басына он екі жұлдыздан тәж киген бір әйел көрінді."},
	{2, "2 Ол босанбақ болып, толғақтың ауруы мен азабынан айғай салды."},
	{3, "3 Аспанда тағы басқа бір ғажап көрініс пайда болды: бұл жеті басты, он мүйізді, әр басында тәжі бар оттай қызыл алып айдаһар екен."},
	{4, "4 Ол құйрығымен аспандағы жұлдыздардың үштен бірін тартып алып, жерге қарай лақтырып жіберді. Айдаһар толғатып жатқан әйелдің алдында тосып тұрып, оның Баласын туысымен-ақ жалмап қоймақшы болды."},
	{5, "5 Осылай әйел Ұлын дүниеге келтірді; Ол болашақта күллі халықтарға қатаңдықпен билік жүргізетін болады. Нәресте тезірек Құдайға, Оның тағының алдына әкелінді."},
	{6, "6 Ал әйел Құдай алдын ала дайындап қойған айдаладағы бір жерге қашып құтылды. Сол жерде әйелге бір мың екі жүз алпыс күн бойы қамқорлық жасалатын болады."},
	{7, "7 Сонда көкте соғыс бұрқ ете түсті. Михайл мен оның қол астындағы періштелері айдаһарға қарсы аттанды. Айдаһар өз нөкерлерімен бірге оларға қарсы шайқасты,"},
	{8, "8 бірақ төтеп бере алмады. Бұдан былай соларға көктен орын берілмеді."},
	{9, "9 Осылайша алып айдаһар — бүкіл әлемді алдап келген әзәзіл әрі шайтан есімді, ежелден бері келе жатқан жылан көктен қуылып, бүкіл хабаршыларымен қоса жер бетіне лақтырылды."},
	{10, "10 Содан кейін мен көктен шыққан қатты дауысты естідім. Ол былай деді: Енді Құдай (Өзінің халқын) құтқарды! Ол құдіретін көрсетіп, патшалық етіп, билік жүргізеді. Оның тағайындаған Патшасы Мәсіх өктемдік етеді! Ал Құдай алдында күні-түні бауырластарымызға жала жауып келген шайтан көктен лақтырылып тасталды."},
	{11, "11 Бауырластарымыз Тоқтының өз жанын құрбан етіп Қанын төгуінің арқасында және өздерінің Ізгі хабарды қабылдап, ашық мойындауларымен жеңіске қол жеткізді. Олар өз жандарын тым қатты сүймей өлімге қиды."},
	{12, "12 Қуаныңдар, көк және оны мекендегендердің бәрі де! Алайда жер мен теңізде тұратындарға қасірет! Себебі әзәзіл шайтан төменге, сендердің қастарыңа түсті. Ол өз уақытының аз қалғанын білгендіктен қатты ашулы."},
	{13, "13 Айдаһар өзінің жерге лақтырылғанын білгенде, Ұлды туған әйелдің соңына түсіп, оны қудалай бастады."},
	{14, "14 Сонда әйелге айдалада өзіне дайындалған арнайы орынға ұшып бару үшін алып бүркіттің қос қанаты берілді. Айдалада әйел үш жарым кезең бойы сол улы жыланнан қауіпсіз тұрып, Құдайдың қамқорлығында болады."},
	{15, "15 Әйелді сумен ағызып әкетіп, құрту үшін алып жылан аузынан үлкен өзен іспетті су тасқынын лақ еткізіп төгіп жіберді."},
	{16, "16 Алайда жер әйелге көмектесіп, аузын кеңінен ашып, сол айдаһардың аранынан шыққан өзенді жұтып қойды."},
	{17, "17 Айдаһар әйелге долданып, оның өзге де ұрпақтарымен, яғни Құдайдың бұйрықтарына бағынып, Исаның шынайы хабарына адал болып жүргендерімен, шайқасуға аттанды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct kk13 poems[] = {
	{1, "1 Бұдан кейін айдаһар теңіз жағасында тұрды. Сонда мен теңізден шығып келе жатқан бір айуанды көрдім. Оның он мүйізі мен жеті басы бар еді. Әрбір мүйізінде бір тәжден болды. Ал бастарында Құдайды қорлайтын атаулары жазылыпты."},
	{2, "2 Осы айуан қабыланға ұқсас, аяқтары аюдікіндей, ал аузы арыстанның аранындай болатын. Айдаһар оған өз күшін, тағын және зор бедел мен билікті тапсырды."},
	{3, "3 Айуанның бір басының өлімге шалынып жарақаттанғандай болғанын көрдім. Алайда ол ажалды жарақатынан сауығыпты! Бүкіл әлем осы ғажапқа қайран қалып, айуанның соңынан ілесті. Олар айуанға бедел мен билік берген айдаһарға бас ұрып табынды; сондай-ақ: Айуанға тең келер кім бар? Онымен кім шайқаса алады? — деп айуанға да құлшылық етті."},
	{4, "5 Айуанға өз ұлылығын марапаттап, Құдайды қорлайтын ауыз, әрі қырық екі ай бойы өз бетімен әрекет ету билігі берілді."},
	{5, "6 Ол аранын ашып, Құдайды, Оның есімін, киелі үйін және көкте мекендейтіндерді балағаттап қорлай бастады."},
	{6, "7 Оған Құдайға бағышталған халқымен күресіп, жеңіп шығатын күш, сондай-ақ әрбір ру, халық, тіл және ұлттың үстінен билік берілді."},
	{7, "8 Жер бетінде тұратын (күнәкар) адамзат түгелдей, яғни құрбандыққа шалынған Тоқтының Мәңгілік өмір кітабына әлем жаратылмас бұрын есімдері жазылғандардан басқасының бәрі де, оған құлшылық ететін болады."},
	{8, "9 Құлағы барлар жақсылап тыңдасын:"},
	{9, "10 кімге тұтқындалу бұйырылса, сол тұтқындалады; кімге семсерден өлу бұйырылса, сол семсерден өлім табады. Мұнда Құдай халқының төзімділігі мен сенімділігі қажет болады."},
	{10, "11 Содан кейін мен жерден шығып жатқан басқа бір айуанды көрдім. Оның Тоқтынікі сияқты қос мүйізі бар екен, бірақ ол айдаһарша сөйледі,"},
	{11, "12 әрі алғашқы айуанға қызмет етіп, оның бүкіл билігін жүргізді. Екінші айуан күнәкар дүниені және онда өмір сүрушілердің бәрін ажалды жарақаты жазылған алғашқы айуанға құлшылық еткізіп,"},
	{12, "13 зор кереметтер көрсетуге билікті болды: ол тіпті адамдардың көз алдында көктен жерге от түсірді. Алғашқы айуанның алдында жасаған осы кереметтері арқылы ол күнәкар адамзатты түгел алдап, азғырып теріс жолға салды. Оларға семсерден жарақаттанғанмен аман қалған алғашқы айуанның құрметіне мүсін жасауды тапсырды."},
	{13, "15 Екінші айуанға осы мүсінге өз рухын енгізетін күш-қуат берілді. Осылайша мүсін тіпті сөйлеп, өзіне табынбайтындардың бәрін өлтірте алатын болды."},
	{14, "16 Айуан барлық адамдарды: үлкенді-кішілі, бай-кедей, құл-еріктіні не оң қолын, не маңдайын таңбалауға мәжбүр етті."},
	{15, "17 Осы таңбасы жоқтар еш нәрсені сатып ала да алмайды, сата да алмайды. Ол таңба — алғашқы айуанның есімі яки есімінің саны."},
	{16, "18 Бұл парасаттылықты талап етеді. Зерек адамдар айуан есімінің санын есептеп шығарсын. Себебі осы сан бір адамның атын білдіреді: ол сан — алты жүз алпыс алты."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct kk14 poems[] = {
	{1, "1 Мұнан кейін қарасам, (Иерусалимдегі) Сион төбесінде тұрған Тоқтыны және Оның қасында маңдайларында Тоқтының және Оның Әкесінің аттары жазылған жүз қырық төрт мың адамды көрдім."},
	{2, "2 Сонда мен сарылдап аққан көп судың даусындай, күннің қатты күркіріндей, көктен шыққан бір дыбысты естідім. Ол жетігенде ойнаған күйшілердің әсем сазындай еді."},
	{3, "3 Тақ алдында және төрт нөкер мен ақсақалдардың алдында жаңа ән айтылды. Оны күнәларының құны өтеліп, күнәкар дүниеден азат етілген жүз қырық төрт мың адам ғана үйрене алды."},
	{4, "4 Олар Иемізге деген адалдықтарын бұзбай, өздерін пәк ұстаған еді. Тоқты қайда бармасын, олар Оған еріп жүреді. Бұлар — Құдайға және Тоқтыға бағышталған алғашқы сый-тарту. Олар адамзат арасынан төлемдері өтеліп, азат етілгендер еді;"},
	{5, "5 ауыздарынан арам сөз шықпайтын, олар мінсіз."},
	{6, "6 Мұнан кейін мен аспанның биігінде ұшып бара жатқан ерекше бір періштені көрдім. Ол жер бетінде Құдайға мойынсұнбай тұратын әрбір халыққа, руға, тілге және ұлтқа қарсы Құдайдың мәңгілік жеңісі туралы Ізгі хабарды жариялады."},
	{7, "7 Сол ерекше періште қатты дауыспен: — Құдайды терең қастерлеп, даңқтаңдар, Оның ұлылығын дәріптеп мадақтаңдар! Себебі Оның адамзатты соттайтын уақыты туды. Көк пен жерді, теңіз бен су көздерін жаратқан Құдайға бас ұрып ғибадат етіңдер! — деп жар салды."},
	{8, "8 Екінші ерекше періште оған ілесіп мынаны хабарлады: — Ол құлады: Ұлы Бабыл қаласы құлады! Ол күллі халықтарға өзінің жынды қылатын азғындығының шарабынан ішкізіп келді! —"},
	{9, "9 Алдыңғы екеуіне тағы үшінші ерекше періште еріп, қатты дауыспен мынаны жариялады: — Айуанға және оның мүсініне құлшылық етіп, өздерінің маңдайына не қолына оның таңбасын қабылдаған"},
	{10, "10 бәрі де Құдайдың ашу-ызасының шарабынан ішуге тиісті болады! Осы шарап Құдайдың қаһарының тостағанына еш сумен араластырылмай таза күйінде құйылды. Сол адамдар Құдайдың қасиетті періштелері мен Тоқтының алдында сотталып, күкіртпен жанып тұрған отта азапталмақ."},
	{11, "11 Олардың азабының түтіні мәңгі шығып жатпақ. Айуанға және оның мүсініне табынып және айуанның есімінің таңбасын қабылдағандарға күні-түні тыным болмайды."},
	{12, "12 Мұнда Құдайдың халқы төзімділік көрсетсін! Олар Оның өсиеттерін орындап, Исаға деген сенімдерін берік ұстанулары керек."},
	{13, "13 Сол кезде мен көктен былай деген дауысты естідім: — Мынаны жаз: Бұдан былай Жаратқан Иемен тығыз байланыста болып қайтыс болғандар бақытты! — Киелі Рух соны бекітіп былай дейді: — Иә, олар өздерінің ауыр еңбегінен кейінгі демалыстың рақатын көрмек. Істеген игі істерінің жемісі олардан айырылмайды."},
	{14, "14 Содан соң қарасам, бір нұрлы бұлтты көрдім. Бұлттың үстінде адам баласына ұқсайтын Біреу отырды. Ол басына алтын тәж киіп, қолына өткір орақ ұстапты."},
	{15, "15 Мұнан кейін көктегі киелі үйден бір ерекше періште шығып, қатты дауыспен бұлттың үстінде отырған Билеушіге мынадай хабар жеткізді: Орағыңды қолданып, егінді орып ала гөр. Жер бетіндегі егістік пісіп тұр, енді өнімді жинайтын уақыт болды."},
	{16, "16 Сонда бұлт үстінде отырған Билеуші жерге қарай орағын сілтеп қалғанда, жердегі өнім орыла кетті."},
	{17, "17 Көктегі киелі үйден тағы бір ерекше періште шықты. Ол да қолына өткір қол орақ ұстапты."},
	{18, "18 Сонда отқа өктемдік жүргізетін ерекше бір періште құрбандық үстелінің жанынан шыға келді. Ол өткір қол орағы бар періштеге қатты дауыспен: Жердегі жүзім бұтасының шоқтарын өткір орағыңмен орып ал! Олар пісіп тұр, — деп айғайлады."},
	{19, "19 Періште қол орағын жерге сілтеп, жүзім бұтасының шоқтарын кесіп алып, жүзім шырынын сығып алатын үлкен шұңқырға салды. Бұл Құдайдың төгілетін зор қаһарын астарлап білдіреді."},
	{20, "20 Осылайша жүзім шоқтары қаланың сыртындағы сығу шұңқырында тапталды. Одан тереңдігі ат жалына жететін, ал ұзындығы үш жүз шақырымдай қан тасқыны ағып шықты."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct kk15 poems[] = {
	{1, "1 Аспаннан тағы басқа бір таңғаларлық үлкен әрі керемет көріністі көрдім: (Құдайға қарсы шыққандарды) ең соңғы жеті пәлеге ұшырататын жеті періште тұрды. Құдайдың қаһары осы пәлелермен толықтай жүзеге аспақ."},
	{2, "2 Мұнан кейін мен отпен араласқан, шыны теңіз іспетті жарқыраған алаңды көрдім. Оның жағалауында не айуанның мүсініне табынбаған, не оның есімінің санын бейнелейтін таңбаны қабылдамаған, осылайша айуанды жеңіп шыққан адамдар тұр екен. Бәрі қолдарына Құдайды мадақтайтын жетігендерін ұстапты."},
	{3, "3 Олар Құдайдың қызметшісі Мұсаның жырын және Тоқты жөніндегі жырды айтып тұрды: Уа, Құдай Ие, бүкіл әлемнің Билеушісі, Сенің істерің керемет те ұлы! О, халықтардың мәңгілік Патшасы, Сенің жолдарың әділ де шынайы!"},
	{4, "4 Уа, Жаратқан Ие, кім Сенен қорықпас, Есіміңнің ұлылығын кім даңқтамас? Сен ғана толықтай қасиеттісің! Бар ұлттар келмек алдыңа Өзіңнің, Бас ұрып мақтайды даңқыңды Сенің, Себебі ашылды әділ үкімдерің!"},
	{5, "5 Бұдан кейін қарасам, көктегі киелі үйдің, яғни Келісім шатырының, ашылып жатқанын көрдім."},
	{6, "6 Жарқыраған аппақ бәтестен киім киіп, кеуделеріне алтын аспа бау таққан жеті періште киелі үйден шықты. Жеті пәленің билігі соларда еді."},
	{7, "7 Құдай тағының қасындағы төрт нөкердің біреуі осы жеті періштеге жеті тостағанды берді. Тостағандар мәңгілік жасайтын Құдайдың қаһарына толы еді."},
	{8, "8 Содан киелі үй Құдайдың хош иісті түтіндей таралатын салтанатты ұлылығы мен құдіретіне кенелді. Жеті періште тостағандарынан төгетін жеті пәле аяқталғанша, ешкім де киелі үйге кіре алмады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct kk16 poems[] = {
	{1, "1 Сонда мен киелі үйден шыққан бір қатты дауыстың жеті періштеге: Барыңдар да, Құдайдың қаһарына толы жеті тостағанды жер бетіне төгіп жіберіңдер! — деп тапсырғанын естідім."},
	{2, "2 Біріншісі барып, тостағандағысын жерге төгіп жіберді. Сонда айуанның таңбасын қабылдап, оның мүсініне табынғандарда жиіркенішті де азапты, іріңді жаралар пайда болды."},
	{3, "3 Екінші періште тостағандағысын теңізге құйып жібергенде, оның суы өлген адамның қанындай қоюланды. Теңіздегі күллі тіршілік иелері өліп қалды."},
	{4, "4 Үшіншісі тостағандағысын өзендер мен су көздеріне төгіп жібергенде, олар қанға айналды."},
	{5, "5 Су атаулыға өктемдік жүргізетін періштенің былай дегенін естідім: Уа, әрдайым бар және мәңгі болып келген қасиетті Жаратқан Ие, Сен әділсің! Сенің шығарған осы үкімдерің де әділ!"},
	{6, "6 Сол адамдар Сенің халқыңның және пайғамбарларыңның қанын төккендіктен, оларға қан ішкіздің. Соларға осы лайық."},
	{7, "7 Сонда мен түтету үстелі жағынан былай деген дауысты естідім: Иә, Құдай Ие — бүкіл әлемнің Билеушісі, Сенің үкімдерің әділ де шынайы!"},
	{8, "8 Ал төртінші періште тостағандағысын күнге төккенде, күн отты қызуымен адамдарды күйдіретін болды."},
	{9, "9 Олар қатты аптапқа күйіп, осы пәлелерге билік жүргізетін Құдайдың атына тіл тигізді. Бірақ олар өкініп, теріс жолдарынан қайтпады, әрі Тәңір Иені даңқтап, Оған лайықты құрмет көрсетпеді."},
	{10, "10 Енді бесінші періште тостағандағысын айуанның тағына құйып жібергенде, оның патшалығын қараңғылық басты. Адамдар аурудан қатты қиналып, тілдерін тістеді."},
	{11, "11 Алайда олар өздерінің жаман қылықтарына өкініп, қайтпады; керісінше, аурулары мен іріңді жараларына бола көктегі Құдайға тіл тигізді."},
	{12, "12 Алтыншы періште тостағандағысын ұлы Евфрат өзеніне құйып жіберді. Сонда өзен кеуіп қалып, осылайша шығыстан келетін патшаларға жол дайындалды."},
	{13, "13 Мұнан соң құрбақаға ұқсаған үш жынды көрдім. Олар айдаһардың, айуанның және жалған пайғамбардың ауыздарынан шықты."},
	{14, "14 Үшеуі де — жындардың рухтары. Олар ғажап істер істеп, құдіреттерін көрсетеді. Олар бүкіл жер бетін аралап, күнәкар дүниенің күллі патшаларын Тәңір Иеге қарсы шайқасуға жинап әкеледі. Бұл шайқас Әлемнің Әміршісі — Құдайдың ұлы соты күні болады."},
	{15, "15 (Мәсіх былай дейді:) Тыңда, Мен ұрының қапыда түсетініндей күтпеген кезде келемін! Жалаңаш қалып, жұрт алдында ұятқа қалмау үшін сергек болып, (кіршіксіз пәк) киімдерін дайын сақтағандар бақытты!"},
	{16, "16 Әлгі үш жын патшалардың бәрін еврейше Һар-Магедон деп аталатын жерге алып келді."},
	{17, "17 Жетінші періште тостағандағысын ауаға төккенде, киелі үйдегі тақтан Орындалды! — деген қатты дауыс шықты."},
	{18, "18 Сонда найзағай жарқылдап, мықты гүріл естіліп, күн күркіреп, жер қатты сілкінді. Адамзат дүниеде өмір сүргелі ешқашан мұндай жер сілкінісі болып көрмеген еді: бұл барлығынан да қатты жер сілкінісі болды."},
	{19, "19 Содан ұлы қала үшке бөлініп, басқа халықтардың қалалары да қирап қалды. Осылай ұлы Бабыл Құдай алдында ескеріліп, қала Құдайдың тостағанынан — Оның қатты ашуы мен қаһарын білдіретін шарабынан ішуге мәжбүр етілді."},
	{20, "20 Барлық аралдар қашып, ғайып болып, таулар жермен-жексен болды."},
	{21, "21 Аспаннан адамдардың үстіне салмағы жүз қадақтай дәу тастар жауды. Сонда да адамдар сол ғаламат қорқынышты пәле, яғни тас бұршақ жаудырғаны, үшін Құдайды балағаттап, тілдеді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct kk17 poems[] = {
	{1, "1 Жеті тостағаны бар жеті періштенің бірі қасыма келіп, маған былай деді: — Жүр, мен саған көптеген сулардың үстінде отырған аты шулы опасыз әйелдің сотталып, жазалануын көрсетейін."},
	{2, "2 Жер бетіндегі патшалар онымен азғындыққа түсті. Күнәкар дүниенің тұрғындары опасыз әйелдің шарабынан мас болып, оның азғындығына мүлдем берілді."},
	{3, "3 Сонда мен киелі Рухқа ерекше бөленіп, періште мені айдалаға апарды. Сол жерде бір ал қызыл айуанның үстінде отырған әйелді көрдім. Айуанның жеті басы мен он мүйізі болды. Оның тұла бойында Құдайды қорлайтын атаулары жазылған екен."},
	{4, "4 Әйел алтынмен, қымбат тастар және інжу-маржанмен әшекейленген, қою күлгін және ал қызыл түсті киім киіпті. Ол қолына өзінің жексұрын, былғаныш қылықтарын бейнелейтін нәрселерге толы алтын тостаған ұстап отырды."},
	{5, "5 Ал маңдайында Құпия: ұлы Бабыл, әлемдегі барлық опасыздық пен жексұрындық жасайтындардың анасы деген атағы жазулы тұрды."},
	{6, "6 Мен әйелдің Құдай халқының қанынан мас болғанын көрдім. Ол Исаға адал болып қалғандықтан шейіт болғандардың төгілген қанын ішкен еді. Әйелді көргенде қатты таңғалдым."},
	{7, "7 Періште: — Сен неге таңғалдың? — деп сұрады. — Саған әйелдің және оны көтеріп жүрген жеті басты, он мүйізді айуанның құпия мәнін айтып берейін:"},
	{8, "8 сен көрген айуан бір рет өмір сүрді. Ол қазір өмір сүрмесе де, түпсіз тұңғиықтан шықпақшы. Ал кейін ол құртылып кетпек. Күнәкар дүниенің тұрғындары, яғни әлемнің жаратылған кезінен-ақ Мәңгілік өмір кітабына есімдері жазылмаған адамдар, айуанға қарайды. Олар оның бір рет өмір сүріп, қазір өмір сүрмей, ал кейін қайтадан пайда болатынына таңғалады."},
	{9, "9 Бұл дана ой-сананы қажет етеді. Жеті бас әйел отырған жеті төбені бейнелейді. Олар, сондай-ақ, жеті патшаны да астарлап білдіреді."},
	{10, "10 Солардың бесеуі тақтан құлаған, тағы біреуі қазір билік құрып отыр, ал соңғысы әлі келген жоқ. Ол келгенде азғана уақыт билік құратын болады."},
	{11, "11 Бір кезде өмір сүрген, ал қазір өмір сүрмейтін айуанның өзі — сегізінші патша. Ол да әлгі жетеудің сапында болып, құрып кетпек."},
	{12, "12 Сен көрген он мүйіз әлі билік құрмаған он патшаны білдіреді. Оларға айуанмен бірге қысқа уақытқа патшалық билік берілмек."},
	{13, "13 Осы онның мақсаты біреу-ақ: олар өздерінің күш-қуаты мен билігін айуанға аманаттап,"},
	{14, "14 Тоқтыға қарсы соғысқа шығады. Бірақ Тоқты оларды жеңіп шығады. Себебі Ол — иелердің Иесі, патшалардың Патшасы! Ал қасындағылар — Оның шақырылып, таңдалған, адал ізбасарлары."},
	{15, "15 Періште маған тағы да тіл қатып былай деді: — Сен опасыз әйел үстінде отырған суларды көрдің. Бұлар ұлттар мен халықтарды, тайпалар мен тілдерді белгілейді."},
	{16, "16 Сен көрген он мүйіз де, айуан да опасыз әйелді жек көреді. Сондықтан олар оны елсіз-күйсіз, тыр жалаңаш қалдырып, талан-таражға салады, оның тәнін жалмап, қалдықтарын өртеп тып-типыл етпек."},
	{17, "17 Себебі Құдай олардың жүректеріне әсер етіп, өз мақсатын орындатады: оларға өзара келісіп, Құдайдың айтқандары іске асқанға дейін өз биліктерін айуанға аманаттау тілегін дарытты."},
	{18, "18 Сен көрген әйел күнәкар дүниедегі патшаларға үстемдік жүргізетін ұлы Бабыл қаласын бейнелейді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct kk18 poems[] = {
	{1, "1 Бұлардан кейін көктен төмен түсіп келе жатқан бір ерекше періштені көрдім. Оның зор билігі бар еді, салтанатының нұры бүкіл жерді жарқыратты."},
	{2, "2 Періште қатты дауыспен былай деп жариялады: Ол құлады! Ұлы Бабыл құлады! Ол жындардың ордасы, әр алуан арам рухтардың ұясы болды. Бұдан былай арам, жексұрын құстардың барлық түрі оған қоныстанбақ."},
	{3, "3 Күллі ұлттар да оның жынды қылатын азғындығының шарабынан ішіп келді. Дүниенің патшалары онымен азғындыққа түсетін. Әлемнің саудагерлері оның сән-салтанат пен асқан молшылыққа деген құмарлығынан байыды."},
	{4, "4 Көктен былай деген басқа бір дауысты да естідім: Одан шық, халқым Менің, одан шық! Әйтпесе оның күнәларына араласып, басына түсетін пәлелерін де бөлісесің."},
	{5, "5 Себебі оның күнәлары көкке жетерліктей көп. Енді Құдай оның әділетсіздіктерін ескеріп, соттамақ."},
	{6, "6 Өзгелерге көрсеткен зорлық-зомбылықтарын өзіне көрсетіңдер, жаман қылықтарына сай екі есе қылып қайтарыңдар! Оның басқаларға арнап араластырған өз тостағанындағы шарабына азғындықты екі есе қылып қосып өзіне дайындап беріңдер!"},
	{7, "7 Ол қаншама сән-салтанат пен молшылыққа кенелген болса, оған соншама көп азап пен қайғы-қасірет тартқызыңдар! Мен тақта отырған ханыммын; жесір емеспін, қайғы-қасірет те шекпеймін! дейді ол."},
	{8, "8 Сол себепті бір-ақ күннің ішінде мына пәлелерге: індет, қайғы-қасірет және аштыққа ұшырап, отқа өртенбек. Себебі оны соттаушы Құдай — Жаратқан Ие құдіретті."},
	{9, "9 Бабылдың азғындығы мен сән-салтанатты өмір салтына араласқан жер бетінің патшалары оны құртып жатқан өрттің түтінін көргенде жоқтау айтып, еңіреп жылайтын болады."},
	{10, "10 Олар Бабылдың көрген азабынан зәрелері ұша қорқып, қашықта тұрып былай деп жоқтамақ: Ой, бауырым, басыңа қаралы күн туды! Ұлы, күшті Бабыл қаласы! Бір-ақ сағат ішінде үкімің кесіліп, іске асты!"},
	{11, "11 Жер бетіндегі саудагерлер де жылап, оған жоқтау айтады. Себебі енді қайтып олардың тауарларын ешкім сатып алмайтын болады."},
	{12, "12 Олар алтын-күмістерін, асыл тастары мен інжу-маржандарын, қымбат ақ бәтес, жібек, қою күлгін, ал қызыл маталарын, жұпар иісті ағаштардың барлық түрлерін, піл сүйегі, қымбат ағаш, қола, темір және мәрмәрдан жасалған алуан түрлі бұйымдарын,"},
	{13, "13 дәм қабығы мен өзге де дәмдеуіштерін, түтетілуге арналған мүр, ладан және басқа да хош иісті заттарын; сондай-ақ шарабы мен майын, ұны мен бидайын, ірілі-ұсақты малдарын, аттары мен арбаларын, әрі құлдарын — иә, адам өмірінің өзін! — саудаға салып келген болатын."},
	{14, "14 Сен сондай қатты ұнатқан жемістерден ада қалдың, барлық байлығың мен сәулелі салтанатың да бітті! Енді қайтып оларды таба алмайсың! — дейді олар."},
	{15, "15 Бабылда осының бәрімен сауда-саттық жасап, байып алғандар қаланың көрген азабынан зәрелері ұшып, қашықта тұратын болады. Олар еңіреп жылап, жоқтау айтып былай дейді:"},
	{16, "16 Қайран қала, басыңа қаралы күн туды! Ұлы қала! Қымбат ақ бәтес, қою күлгін, ал қызыл киімдер киетінсің; алтын әшекейлер, асыл тастар, інжу-маржандарын тағынып, безеніп, жалт-жұлт ететінсің!"},
	{17, "17 Соншама зор байлық бір-ақ сағат ішінде құрып кетті-ау! Барлық кеме басшылары мен жолаушылары, теңізшілер мен теңізбен күн көретін өзгелер де алыста тұрып,"},
	{18, "18 оны құртып жатқан өрттің түтінін көргенде: Бұрын-соңды осы ұлы қаладай басқа қала болған емес! — деп айқайлайды."},
	{19, "19 Олар бастарына күл шашып, өкіріп жылап, былай деп жоқтау айтты: Қайран қала, Ұлы қалаға қаралы күн туды! Теңіз кемелері барлардың бәрі Бұл қаланың дәулетімен байыған еді! Оның бір-ақ сағатта талқандалғаны-ай!"},
	{20, "20 Уа, көктегілер, Құдайдың халқы, Елшілері мен пайғамбарлары, Бұған қуанып, шаттаныңдаршы! Құдай оны соттап жазалады, Ал қиналған сендерді ақтады!"},
	{21, "21 Сонда бір күшті періште үлкен диірмен тасындай дәу тасты алып, теңізге лақтырып жіберіп, былай деді: Міне, осындай қатты екпінмен ұлы Бабыл қаласы да лақтырылып, тұңғиыққа батып кетеді. Ол енді қайтып көрінбейтін болады!"},
	{22, "22 Бұдан былай сен ешқашан жетіген сазы мен адам даусын, сыбызғы мен керней тартқандарды естімейтін боласың. Ұсталар мен өнер шеберлері сенде болмайды, диірменнің дыбысы да естілмейді."},
	{23, "23 Енді қайтып шам жарығын көрмейсің, күйеу мен қалыңдықтың көңілді даусын да естімейсің! Себебі сенің саудагерлерің әлемнің мықтылары еді; сен сиқырлығыңмен күллі халықтарды алдап, азғындыққа салдың!"},
	{24, "24 Сондай-ақ пайғамбарлар мен Құдай халқының қаны, иә, жер бетіндегі барлық өлтірілгендердің қаны осы қаладан табылды!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct kk19 poems[] = {
	{1, "1 Бұлардан кейін мен жиналған көптеген халықтың айқайындай көктен шыққан зор дауыстарды естідім. Олар былай деді: Жаратқан Иені мадақтаңдар! Құтқару мен салтанатты ұлылық, құдірет пен билік Құдайымызда!"},
	{2, "2 Оның үкімдері шынайы да әділ. Ол азғындығымен жер бетін бүлдірген аты шулы опасыз әйелді соттап, үкімін шығарды. Құдай өз қызметшілерінің төгілген қанының құнын одан талап етті."},
	{3, "3 Сол дауыстар тағы да былай деп айқайлады: Жаратқан Иені мадақтаңдар! Өртенген қаланың түтіні мәңгі шығып жатпақ!"},
	{4, "4 Жиырма төрт ақсақал мен төрт нөкер Өзінің тағында отырған Құдайға бас ұра жығылып: Аумин! Лайым Жаратқан Ие мадақталсын! — деп ғибадат етті."},
	{5, "5 Мұнан кейін тақ жағынан бір дауыс шықты: Мадақтаңдар Құдайымызды, Күллі қызметшілері Оның! Дәріптей беріңдер, Тәңірімізді Қастерлейтін үлкен-кіші барлығың!"},
	{6, "6 Содан кейін мен жиналған көптеген халықтың зор дауыстарын тағы да естідім. Олар сарқырап аласұрған судың гүрілі мен қатты күн күркіріне ұқсап, былай деп айқайлады: Жаратқан Иені мадақтаңдар! Себебі біздің Құдайымыз — Жаратқан Ие, бүкіл әлемнің Билеушісі Патшалық құруда."},
	{7, "7 Шаттанып, қуанайық, Оның ұлылығын мадақтайық! Тоқтының үйленетін уақыты жетті. Оның қалыңдығы әзірленіп, дайын отыр."},
	{8, "8 Оған кіршіксіз таза, жылтыраған ақ бәтес киімдер берілді. — Сол ақ бәтес киімдер Құдай халқының әділ істерін білдіреді."},
	{9, "9 Содан кейін періште маған былай деді: Мынаны жазып қой: Тоқтының үйлену тойына шақырылғандар бақытты! — Ол тағы мынаны қосты: — Бұл — Құдайдың шынайы сөздері."},
	{10, "10 Мен (аң-таң болып) аяғына жығылып, бас ұрмақ едім. Бірақ ол маған: Олай жасама! Мен өзіңмен және Исаның шынайы хабарын ұстанатын бауырластарыңмен бірге қызмет етушімін. Қайта, Құдайға бас ұрып ғибадат ет! — деді. Себебі Исаның шынайы хабарын жеткізу — пайғамбарлық сөз айтудың нағыз мәнісі."},
	{11, "11 Мұнан соң қарағанымда, көктің ашылғанын және сонда тұрған ақ боз атты көрдім; оның үстінде Отырған Адал да Ақиқат деп аталады. Ол әділдікпен үкім кесіп, соғысқа шығады."},
	{12, "12 Атқа мінгеннің көздері оттай жалындап, басына киген әлденеше патшалық тәждері болды. Оның киімінде Өзінен басқа ешкім де мағынасын біле алмайтын бір Есім жазылған еді,"},
	{13, "13 ал жамылғысы қанға батқан екен. Оның бір атағы: Құдай Сөзі."},
	{14, "14 Ақ боз атқа мініп, кіршіксіз таза ақ бәтес жамылғы киген көктің әскерлері Оның соңынан еріп жүрді."},
	{15, "15 Аттылының аузынан шығып тұрған, халықтарды шауып тастайтын өткір семсері бар екен. Ол халықтарға қатаңдықпен билік жүргізетін болады. Жүзімді қысып таптағанда шырынының ағып шығатыны сияқты, Ол құдіреті шексіз Құдайдың қаһарлы ашуын Оған мойынсұнбағандардың үстеріне төккізеді."},
	{16, "16 Аттылының жамылғысының екі жанында: Патшалардың Патшасы, иелердің Иесі деген атағы да жазылған."},
	{17, "17 Содан кейін мен күннің бетінде тұрған періштені көрдім. Ол аспанның биігінде ұшып бара жатқан барлық жыртқыш құстарға зор дауыспен: Құдайдың үлкен кешкі асына жиналып келіңдер!"},
	{18, "18 Патшалардың, қолбасылар мен жауынгерлердің, аттар мен үстіндегілердің, құл-азат, үлкенді-кішілі күллі адамдардың өліктерінің етін жеңдер! — деп айқай салды."},
	{19, "19 Сонда мен айуанды, дүниенің патшаларын және олардың әскерлерін көрдім. Олар ақ боз ат үстінде Отырғанмен және Оның әскерімен шайқасуға жиналған екен."},
	{20, "20 Алайда айуан және оған қызмет етіп кереметтер көрсеткен жалған пайғамбар екеуі де кенеттен тұтқынға алынды. Сол бір таңғажайып кереметтер арқылы жалған пайғамбар айуанның таңбасын қабылдап, оның мүсініне құлшылық еткендерді еліктіріп, алдап жүрген болатын. Айуан мен жалған пайғамбар екеуі де күкірт жанып жатқан, мәңгі сөнбейтін отты көлге (яғни тозақ отына) тірідей лақтырылды."},
	{21, "21 Ал басқалары ат үстінде Отырғанның аузынан шығып тұрған семсерімен өлтіріліп, барлық жыртқыш құстар олардың өліктерінің етін жеп тойынды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct kk20 poems[] = {
	{1, "1 Бұдан кейін мен көктен түсіп келе жатқан, қолында түпсіз тұңғиықтың кілті мен ауыр шынжыр ұстаған бір періштені көрдім."},
	{2, "2 Ол айдаһарды ұстап алып, оны мың жылға шынжырлап тастады. Айдаһар — сол ежелгі жылан; ол ібіліс және әзәзіл шайтан деп те аталады."},
	{3, "3 Әзәзілдің бұдан былай, мың жыл өткенше, халықтарды алдай алмауы үшін, періште оны түпсіз тұңғиыққа лақтырып жіберіп, есігін кілттеп, мөрмен бекітті. Ал осы кезең өткеннен кейін әзәзіл шайтан біраз уақытқа босатылуға тиіс."},
	{4, "4 Енді мен бірнеше тақтарды көрдім. Олардың үстінде отырғандарға адамзатты соттап, үкім кесу билігі берілген еді. Сонда мен Исаға адал болып, Құдайдың Ізгі хабарын жариялағандары үшін шейіт болғандардың жандарын да көрдім. Бұлар не айуан мен оның мүсініне табынған да жоқ, не айуанның таңбасын маңдайлары мен қолдарына қабылдаған да жоқ. Олар қайта тіріліп, Мәсіхпен бірге мың жыл бойы патшалық құрды."},
	{5, "5 Бұл — алғашқы қайта тірілу. Ал өлгендердің қалғандары мың жыл өтіп кеткенше тірілген жоқ."},
	{6, "6 Алғашқы қайта тірілуге қатысқан әркім бақытты да қасиетті! Мұндайларға екінші өлім билігін жүргізбейді. Керісінше, олар Құдайдың және Мәсіхтің діни қызметкерлері болып, Мәсіхпен бірге мың жыл бойы патшалық құрмақ."},
	{7, "7 Ал мың жыл өткеннен кейін әзәзіл шайтан зынданынан босатылады. Ол дүниенің төрт бұрышындағы халықтарға — Гог пен Магогқа барып, оларды алдап, шайқасқа жинауға ұмтылады. Олар теңіз жағалауындағы құм қиыршықтарындай сансыз көп болады. Сонда дүние жүзінің түкпір-түкпірінен келген осы тобыр Құдай халқының ордасы — Оның сүйікті қаласын қоршап алады. Алайда көктен от-жалын түсіп, жауды жалмап қояды."},
	{8, "10 Бұларды еліктіріп алдаған әзәзіл шайтан күкіртпен жанып тұрған отты көлге (яғни тозақ отына) тасталады; бұрын сол жерге айуан мен жалған пайғамбар да лақтырылған еді. Олар сонда күні-түні мәңгілік азап шегетін болады."},
	{9, "11 Бұдан кейін мен бір үлкен ақ түсті тақты және оның үстінде Отырғанды көрдім. Оның қасынан жер мен көк қашып, оларға орын табылмады."},
	{10, "12 Үлкенді-кішілі өлген адамдардың тақ алдында тұрғандарын байқадым. Кітаптар ашылып, ерекше бір кітап — Мәңгілік өмірдің кітабы да ашылды. Өлгендер сол кітаптарда жазылған, өздері тірі кездерінде жасаған істеріне сай сотталып, үкімделді."},
	{11, "13 Теңізде қаза тапқандар да, жалпы, ажалға ұшырап, о дүниеге аттанғандардың бәрі де қайта тірілді. Олар өздерінің іс-әрекеттері бойынша сотталды."},
	{12, "14 Бұдан кейін ажал мен о дүние тозақ отына лақтырылды. Тозақ оты екінші өлім деп те аталады."},
	{13, "15 Кімнің есімі Мәңгілік өмір кітабында жазылмаған болса, сол да тозақ отына лақтырылды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct kk21 poems[] = {
	{1, "1 Содан соң жаңа көк пен жаңа жерді көрдім. Себебі бұрынғы көк пен жер құрып кетіп, бұдан былай теңіз де болмады."},
	{2, "2 Сонда мен көктен, Құдайдың қасынан түскен қасиетті қаланы: жаңа Иерусалимді байқадым. Ол күйеуінің алдынан шығуға безеніп киінген қалыңдықтай дайындалған еді."},
	{3, "3 Көктегі тақтан былай деген зор дауысты естідім: Қараңдар, Құдайдың адамдар арасындағы тұрағы! Ол солармен бірге тұрып, олар Оның халқы болмақ. Осылай Құдайдың Өзі солармен бірге мекендеп, олардың Құдайы болады!"},
	{4, "4 Ол барлық көз жастарын сүртіп тастап жұбатады. Енді қайтып өлім, жоқтау, зар еңіреу мен ауру болмайды. Себебі бұрынғы әлем құрып, жоқ болды."},
	{5, "5 Сонда тақта Отырған: — Енді бәрін де жаңадан жаратамын, — деді. Ал маған қарап: — Мұны жазып қой, бұл сөздер сенуге тұрарлық шынайы! — деп қосты."},
	{6, "6 Содан соң Ол былай деді: — Енді түгел орындалды! Алғашқы да Соңғы, Басы да Аяғы Менмін. Жаны сусаған әркімге шынайы өмірдің қайнар көзінен суды тегін ішкіземін."},
	{7, "7 Жеңіп шыққан әркім осы игіліктердің бәрін иемденеді. Мен оған Құдай, ол Маған рухани бала болады."},
	{8, "8 Алайда қорқақтар, сенімсіздер, зұлымдар, кісі өлтіргендер, азғындар, сиқыршылар, жалған тәңірге құлшылық етушілер және бүкіл өтірікшілердің алатын үлестері күкірт жанып тұрған отты көлде болмақ. Бұл — екінші өлім."},
	{9, "9 Соңғы жеті пәлеге толы жеті тостағанды әкелген жеті періштенің біреуі қасыма келіп: — Жүр, мен саған Қалыңдықты — Тоқтының үйленетін әйелін көрсетейін, — деді."},
	{10, "10 Сонда періште мені Киелі Рухтың әсерімен биік те ұлы таудың басына алып шығып, маған қасиетті Иерусалим қаласын көрсетті. Ол көктен, Құдайдың қасынан түсіп,"},
	{11, "11 Оның нұрлы салтанатына кенелді. Қала өте құнды асыл тас іспетті, мөлдір тастай айқын яспис сияқты жалт-жұлт етіп жарқырап жатты."},
	{12, "12 Оны өте биік қабырға қоршап, он екі қақпасында он екі періште тұрды. Қақпаларда Исраил халқының он екі руының аттары жазылған екен."},
	{13, "13 Әр жақта үш қақпадан болды: шығыс, оңтүстік, солтүстік және батыста үшеуден."},
	{14, "14 Қала қабырғасының он екі іргетасы да бар екен, оларға Тоқтының он екі елшісінің есімдері жазылыпты."},
	{15, "15 Маған тіл қатқан періште қолына бір өлшеуіш алтын таяқты ұстапты. Осы таяқпен ол қаланы, оның қақпалары мен қабырғаларын өлшеп шықпақ болды."},
	{16, "16 Қаланың ұзындығы мен ені бірдей төрт бұрышты болып салынған екен. Періште өлшеуіш таяғымен қаланы өлшегенде оның ұзындығы — он екі мың стади, ені мен биіктігі де дәл сондай болды."},
	{17, "17 Періште қаланы қоршаған қабырғаны да өлшеп шықты, ол жүз қырық төрт шынтақ екен. Періште әдеттегі адамдар өлшемін қолданды."},
	{18, "18 Қабырға яспистен, ал қаланың өзі мөлдір шыныға ұқсас саф алтыннан жасалыпты."},
	{19, "19 Қала қабырғасының іргетастары әр түрлі асыл тастармен әшекейленген еді. Бірінші іргетасы яспис, екіншісі сапфир, үшіншісі агат, төртіншісі алмас,"},
	{20, "20 бесіншісі оникс, алтыншысы карнелиан, жетіншісі сары кварц, сегізіншісі изумруд, тоғызыншысы топаз, оныншысы хрисопрас, он біріншісі жақұт, он екіншісі аметист еді."},
	{21, "21 Он екі қақпасы — он екі інжу-маржан: әр қақпа бір маржаннан жасалыпты. Қаланың даңғыл көшесі мөлдір шыныдай саф алтыннан салынған еді."},
	{22, "22 Қаладан киелі үйді көрмедім. Себебі оның киелі үйі — бүкіл әлемнің Билеушісі Құдай Ие және Тоқты."},
	{23, "23 Қалаға жарық түсіру үшін күн мен айдың да қажеті жоқ: Құдайдың нұрлы салтанаты оны жарқыратады, әрі Тоқты да — оның шам-шырағы іспетті."},
	{24, "24 (Құтқарылған) халықтар оның нұрымен жүріп, жер бетінің патшалары салтанатты тарту-таралғыларын қалаға әкеліп тұрады."},
	{25, "25 Қала қақпалары күн ұзағына жабылмайды, ешқашан түн де болмайды."},
	{26, "26 Халықтар қымбат салтанатты сый-тартуларын әкеліп, құрмет көрсетеді."},
	{27, "27 Ал арамдардың, жексұрын қылықтар жасап, жалған айтатындардың ешқайсысы да қалаға кірмейді. Тек Тоқтының Мәңгілік өмір кітабында есімдері жазылғандар ғана енетін болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct kk22 poems[] = {
	{1, "1 Періште маған Құдай мен Тоқтының тағынан бастау алған мөлдір тастай жылтылдаған өмір суының өзенін де көрсетті."},
	{2, "2 Ол қала көшесінің ортасымен төменге қарай ағады. Өзеннің әр жағасында өсіп тұрған мәңгілік өмірді сыйлайтын ағаш ай сайын, жылына он екі рет, жеміс береді. Ал жапырақтары халықтарды сауықтыруға арналған."},
	{3, "3 Қарғалған еш нәрсе де осы қаладан табылмайды. Құдай мен Тоқтының отырған тағы қаланың ішінде. Құдайдың қызметшілері Оған бас ұра қызмет етіп,"},
	{4, "4 Оның бет-жүзін көретін болады. Маңдайларында Оның есімі жазылып тұрмақ."},
	{5, "5 Енді ешқашан түн болмайды. Оларға шам-шырақ пен күн сәулесінің қажеті жоқ, себебі Құдай Иенің нұры түсіп тұрады. Олар мәңгі патшалық құрмақ."},
	{6, "6 Мұнан кейін періште маған: Бұл сөздер сенуге тұрарлық нағыз шындық. Пайғамбарларға өз Рухын дарытқан Құдай Ие қызметшілеріне жуырда болуға тиісті оқиғаларды алдын ала көрсету үшін періштесін жіберді, — деді."},
	{7, "7 (Мәсіх:) Міне, Мен жуырда келемін! Құдайдың осы кітаптағы хабарларын ұстанатындар бақытты! — деп ескертті."},
	{8, "8 Мен, Жохан, осыларды естіп, көрдім. Естіп, көріп жатқан кезде мен оларды көрсеткен періштенің аяғына бас ұрмақ болып жығылдым."},
	{9, "9 Алайда ол: Бұлай істеме! Мен өзіңмен, саған бауырлас пайғамбарлармен және осы кітаптағы сөздерге мойынсұнатындармен бірге қызмет етушімін. Құдайға бас ұрып ғибадат ет! — деді."},
	{10, "10 Ол маған тағы да: Құдайдың бұл кітаптағы хабарларын мөрлеп бекітіп, құпия ұстама! Себебі жүзеге асатын уақыты таяп қалды."},
	{11, "11 Әділетсіздер әділетсіз істерін әлі де жасап, арамдар арамдықтарын істей берсін, ал әділдер әділ істерін жалғастырып, қасиеттілер әлі де қасиетті бола берсін, — деді."},
	{12, "12 Иеміз Иса маған тіл қатып: — Тыңда, Мен жуырда келемін! Әркімге ісіне қарай беретін сыйымды Өзіммен бірге ала келемін."},
	{13, "13 Алғашқы да Соңғы, Бастапқы да Ақырғы, Басы да Аяғы Менмін."},
	{14, "14 Шапандарын таза жуып, осылайша мәңгілік өмір ағашының жемісін жеп, қақпалары арқылы қалаға ену құқығына ие болғандар бақытты!"},
	{15, "15 Алайда иттер — сиқыршылар, азғындар және кісі өлтіргендер, жалған тәңірлерге құлшылық етіп, жалғандықты ұнатып, соларын жасай беретіндер қала сыртында (яғни тозақта) қалады."},
	{16, "16 Мен, Иса, осы хабарларды қауымдардағы сендерге жеткізу үшін періштемді жібердім. Мен Дәуіт патшаның әулетінен шыққан, таңғы жарық Жұлдызбын, — деді."},
	{17, "17 Киелі Рух пен Қалыңдық: Келе гөр! — деп шақырады. Мұны естіген әркім де Келе гөр! десін. Жаны сусаған әркім сыйлық ретінде шынайы өмірдің суын қабылдасын!"},
	{18, "18 Құдайдың осы кітаптағы хабарларын еститіндерге мұқият ескертемін: кімде-кім оған бір нәрсе қосса, соның жазасына Құдай осы кітапта суреттелген пәлелерді қосып береді."},
	{19, "19 Ал кімде-кім Құдайдың хабары жазылған осы кітаптың сөздерінен бір нәрсені алып тастаса, Құдай оның осы кітапта бейнеленген мәңгілік өмір сыйлайтын ағаштан және қасиетті қаладан иемденетін үлесін де алып тастайды."},
	{20, "20 Осының бәрін Растаушы былай дейді: — Бұл шындық, Мен жуырда келемін! Аумин! — Иеміз Иса, келе гөр!"},
	{21, "21 Иеміз Исаның рақымы бәріңе де жауа берсін! Аумин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};