#include <map>
#include <string>
class Bible33
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
	struct kk7	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Яһуда еліне Жотам, Ахаз және Езекияның патшалық құрған замандарында Жаратқан Ие морешеттік Михаға сөзін арнады. Көрген аяндарында Михаға ашылған хабарлар Самария мен Иерусалим туралы болды."},
	{2, "2 Уа, күллі халықтар, тыңдаңдар! Уа, жер мен онда тұратындардың барлығы, құлақ түріңдер! Жаратушы Тәңір Ие сендерге қарсы куәлік келтіреді. Ол Өзінің (көктегі) киелі үйінен сендерді әшкерелеп, айыптайды."},
	{3, "3 Қараңдар! Жаратқан Ие Өзінің көктегі тұрағынан шығып, төмен түсіп келіп, жердің биіктеу орындарын басып таптайды."},
	{4, "4 Сонда таулар Оның табанының астында отқа еріген балауыздай балқып, аңғарлар қақ айырылады. Жартастар су іспетті тау баурайынан ылдилап ағып жатады."},
	{5, "5 Бұның барлығы Жақыптың ұрпақтарының бас көтерулеріне әрі Исраил халқының жасаған күнәларына бола осылай болып отыр. Ал Жақыптың ұрпақтарының бас көтеруі қай жерден басталды? Ол Самария қаласынан басталды емес пе?! Сондай-ақ, Яһуданың жалған тәңірлерге табынатын биіктеу орны дегеніміз не? Сол Иерусалим емес пе?!"},
	{6, "6 (Жаратқан Ие мынаны айтады:) Сондықтан Мен Самария қаласын даладағы қираған үйіндіге, жүзімдік отырғызатын қаңыраған бос жерге айналдырамын! Оның қамалының тастарын сайға қарай домалатып құлатамын, іргетастарын жалаңаштап ашып тастаймын."},
	{7, "7 Самарияның барлық тәңірлерінің мүсіндері қиратылып, соларға бағышталған сыйларының бәрі отқа өртеліп, ондағы алтын-күміс балқытылады. Осылай Мен оның бүкіл тәңірсымақтарын құртамын. Қала осы алтын-күмісін жезөкшеліктің ақысы ретінде жинағандықтан, олары (басқа жаққа әкетіліп) қайтадан жезөкшелік үшін төлем ретінде пайдаланылатын болады."},
	{8, "8 (Миха былай деді:) Сол себепті мен Самарияны жоқтап жылаймын, жалаң аяқ та жалаңаш жүретін боламын. Шибөрідей ұлып, жапалақтай қайғылы дыбыс шығарамын."},
	{9, "9 Өйткені Самарияның жарасы жазылмайтындай ауыр, ол Яһудаға да жетті. Осы пәле халқымның қақпасына, тіпті Иерусалим қаласына да жетіп қалды."},
	{10, "10 (Філістір еліндегі) Ғат қаласында мұны хабарламаңдар, еш жылап-сықтамаңдар! Бет-Офраның халқы, қайғырып топыраққа аунаңдар!"},
	{11, "11 Шафирдің тұрғындары, жалаңаштанып масқара болып, жер аударылып кетіңдер! (Яһудадағы) Сананда тұратындар қорқып далаға шықпайды. Бет-Еселдегілер: Оның қорғауы сендерден алынып қойылды-ау! — деп жоқтау айтады."},
	{12, "12 Мароттың тұрғындары құтқарылуды тағатсыздана тосуда. Ал Жаратқан Ие апат жіберіп, ол тіпті Иерусалимнің қақпаларына жетіп қалды."},
	{13, "13 Уа, Лахыштың тұрғындары, күймелеріңе аттарыңды жегіп, қашыңдар! Сион қаласының күнәға батуы сендердің кесірлеріңнен болды. Өйткені Солтүстік Исраилдің күнәсі (яғни жалған тәңірлерге табынушылығы) сендер арқылы тарады."},
	{14, "14 Ал енді Морешет-Ғат қалашығына соңғы сый-тартуларыңды беріңдер! Ахзиб қаласы да Исраилдің патшаларының үміттерін ақтамай, қиратылып жоқ болады."},
	{15, "15 Марешада тұратындар, мен тағы да сендерге қарсы жаулап алушыны жіберемін! Содан Исраилдің атақтылары Адулламға қашып барып, (ондағы үңгірлерде бас сауғалайды)."},
	{16, "16 Өздеріңе сондай сүйікті балаларыңды аза тұтып, шаштарыңды тақырлап алып тастаңдар! Бастарыңды тазқараның басындай қылып тақырлаңдар! Өйткені балаларың жер аударылып айдалып әкетіледі."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Зұлымдықты жоспарлап, төсек орындарында сұмдық істерді ойластырып жататындар қасіретке қалады! Таң ата олар соларын жүзеге асырады, өйткені бұған олардың құдіреті жетеді."},
	{2, "2 Сондайлар басқаның егістіктеріне сұқтанып, тартып алады, үйлеріне сұқтанып, оларды да иемденіп алады. Олар адамды үй-жайынан, тіпті мұралық жерінен айырады."},
	{3, "3 Сондықтан Жаратқан Ие мынаны айтады: Біліп қойыңдар, Мен бұл халыққа апат жібермекпін! Сендер содан еш құтыла алмайсыңдар! Енді қайтып маңғаздана кеуде керіп жүрмейсіңдер, өйткені бұл қиын-қыстау кезең болады."},
	{4, "4 Сол күні адамдар сендерді келемеждеп, бастарыңнан өткен ауыртпалық туралы мына қайғылы жырды айтатын болады: Ой, қасірет, біз құрыдық біржолата, Халқымның мұралық жері қолды болды! Құдай меншігімізді алып қойды да, Опасыз жаудың қолына бере салды!"},
	{5, "5 Сондықтан Жаратқан Иенің қауымында жерді қайтадан жеребемен бөлісіп үлестіргенде сендердің ешқайсыларың соған қатыспайсыңдар."},
	{6, "6 Олардың пайғамбарлары: Бізге бұл жайттар туралы пайғамбарлық сөз айтпаңдар! Олай істеуге болмайды! Бұндай масқара басымызға түсе қоймас! — дейді."},
	{7, "7 Уа, Жақыптың үрім-бұтағы: Жаратқан Иенің төзімділігі таусылмайды. Ол сондай істер істемейді, — деп айтуға бола ма?! (Ал Жаратқан Ие мынаны айтады:) Егер сендер түзу жолмен жүріп, істеген істерің әділ болса, Менің сөздерімді ізгі дер едіңдер."},
	{8, "8 Ал енді халқым дұшпандай бас көтеріп отыр. Сендер жандарыңнан алаңсыз өтіп бара жатқан адамның киім-кешегін үстінен сыпырып алып, оны шайқастан келе жатқан адамдай алба-жұлба қыласыңдар."},
	{9, "9 Сендер халқымның әйелдерін өздерінің жайлы үйлерінен қуып шығып, Мен оларға тапсырған меншікті жерін олардың балаларынан түпкілікті алып қоясыңдар."},
	{10, "10 Тұрыңдар! Кетіңдер! Бұл елде бұдан былай аман-есен тұра алмайсыңдар. Өйткені жер арамдалып, енді қайтып қалпына келмейтіндей құртылды."},
	{11, "11 Егер алдамшы пайғамбарсымақ келіп: Сендерге шарап пен сыраның мол болатыны жайлы жақсы хабар айтамын! десе, мына халыққа керегі — дәл сондай пайғамбар!"},
	{12, "12 Мен сендерді сөзсіз жинап аламын, уа, Жақыптың үрім-бұтағы! Исраилдің тірі қалғандарын міндетті түрде бірге жинаймын. Оларды қойды қораға жинағандай әрі жайлаудың малға толатынындай жинап алып келемін. Сонда елің халықтың көптігінен у-шудан жаңғыратын болады."},
	{13, "13 Олардың алдында көшбасшы жолды ашып жүріп отырады, осылай халық (өздерін тұтқында ұстап отырған жау қалаларының) қақпаларын бұзып шығады. Патшасы халқының алдарында жүріп, Жаратқан Ие оларды бастап алып шығады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Сонда мен былай дедім: Тыңдаңдар, Жақыптың үрім-бұтағының басшылары — Исраил елінің билеушілері! Ақты қарадан ажырата білу сендердің міндеттерің емес пе?!"},
	{2, "2 Бірақ сендер жақсыны жек көріп, жаманды ұнатасыңдар, Менің халқымның терісін сыпырып, етін сүйектерінен тірідей жұлып аласыңдар!"},
	{3, "3 Сендер халқымның етін жалмап, терісін сыпырып, сүйектерін майдалап сындырасыңдар, оларды қазанға салатын еттей қылып, пісіріп, жеп қоясыңдар!"},
	{4, "4 Кейін осы арамзалар Жаратқан Иеге жалбарына үн қататын болады, бірақ Ол жауап бермейді. Сол кезде Жаратқан Ие олардың істеген көптеген зұлымдықтарына бола солардан бет-жүзін жасырады."},
	{5, "5 Жаратқан Ие халқымды теріс жолға адастырған пайғамбарлар жайлы мынаны айтады: Егер біреу оларға тамақ беріп қарындарын тойдырса, олар соған амандық пен тыныштықты болжайды. Ал егер солай етпесе, онда сол пайғамбарсымақтар оларға қарсы соғыс ашылатынын болжайды."},
	{6, "6 Сол үшін сендерді еш көрініс көрмейтін түн, еш сәуегейлік айтылмайтын қара түнек басады. Пайғамбарлардың күні батып, оларды күндіз қараңғылық жабады."},
	{7, "7 Көріпкелдер ұятқа қалып, бал ашатын сәуегейлер масқара болады. Құдайдан еш жауап болмағандықтан, олардың барлығы ауыздарын жауып үндемейді."},
	{8, "8 Ал мен құдіретке, Жаратқан Иенің Рухына кенелдім. Жақыптың ұрпақтары — Исраил халқының Таурат заңын бұзып күнә жасағандарын әшкерелеу үшін әділдік пен күш-қуатқа бөлендім."},
	{9, "9 Тыңдаңдар мынаны, уа, Жақыптың үрім-бұтағының басшылары — Исраил халқының билеушілері! Сендер әділдікті менсінбей, оны мүлдем бұрмалайсыңдар!"},
	{10, "10 Сендер Сион тауындағы қаланы қантөгіспен тұрғызып, Иерусалимді зұлымдықпен салдыңдар! —"},
	{11, "11 Елдің басшылары пара алып үкім шығарады, оның діни қызметкерлері тәлім бергенде ақша талап етеді және пайғамбарлары айтқан хабарлары үшін ақы сұрайды. Бірақ сонда да олар: Жаратқан Ие біздің арамызда ғой, басымызға ешбір пәле түспейді! — деп Жаратқан Иеге арқа сүйейді екен!"},
	{12, "12 Сондықтан сендердің кесірлеріңнен Сион тауы егістіктей соқамен жыртылады! Иерусалим тас үйіндіге айналады! Қазір ғибадатхана тұрған қырат ну орманды төбеге айналады!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Кейінгі заманда Жаратқан Иенің Киелі үйі тұрған Сион тауы Бастысы болады бар тау-төбелердің, Бәрінен де оның атақ-даңқы Әлдеқайда жоғары болып қалады. Сонда халықтардың адамдары Соған қарай ағылатын болады."},
	{2, "2 Енді жүріңдер, Жаратқан Иенің, Жақыптың халқы сиынған Құдайдың, Сион тауындағы киелі үйіне Өрлеп барайық барлығымыз, кәне! Сол жерде Жасаған Иеміз бізге Ақ жолын нұсқайды, сонымен жүрейік, Оның әділ еркін орындай берейік! — Деп, көп ұлттар жолға шығады бірігіп. Сөзін таратады тәлімін үйретіп Жаратқан Ие Иерусалимнен, Сиондағы өз киелі үйінен."},
	{3, "3 Сонда Иеміз көп халықтар арасында Төрелік етіп, алыс та алып ұлттарға Шығаратын болады әділ үкімін. Енді олар төс үстінде қаруларын Қайта соғып, соқаға қылыштарын Айналдырады, ораққа найзаларын. Содан халықтар енді қайтып ешқашан Бір-біріне қарсы қару көтермейді, Олар соғысуды тіптен үйренбейді."},
	{4, "4 Әркім отырады өз жүзім бұтасының Түбінде әрі өз інжір ағашының, Ешкім оларды қорқытпайды енді! Осыны нық айтқан Әлемнің Иесі."},
	{5, "5 Барлық басқа ұлттар өздерінің Жалған тәңірлерінің жолын қуады, Ал біз өз Құдайымыз Жаратқан Иенің Жолымен жүретін боламыз ұдайы."},
	{6, "6 Жаратқан Ие былай деп нық айтады: Сол күні Мен ақсақтарды, жер аударылған және Өзімнен жапа шеккендерді жинап аламын."},
	{7, "7 Сонда ақсақтар тірі қалып, алысқа жер аударылғандармен бірге Менің мықты халқым болады. Мен, Жаратқан Ие, сол күннен бастап мәңгілікке Сион тауынан оларға патшалық құратын боламын."},
	{8, "8 Ал сен, Сион тауындағы қорған, отарымды қоритын мұнараға ұқсайсың. Бұрынғы билігің саған қайтарылып, Иерусалим қайтадан патшалықтың астанасы болады."},
	{9, "9 Енді неге айқайлайсың? Сенде патша жоқ па еді, кеңесшілерің опат болып па еді? Толғақ қысқан әйелдей азаптанып жатқаның сол себептен бе?"},
	{10, "10 Уа, Сионның халқы, толғатып жатқан әйелдей азаптан бұратылыңдар! Себебі сендер енді қаланы тастап, ашық далада түнеуге мәжбүр боласыңдар. Бабыл еліне кетесіңдер, бірақ сол жерде кейінірек құтқарыласыңдар. Сонда Жаратқан Ие сендерді жау қолынан азат етеді."},
	{11, "11 Ал қазір көптеген халықтар саған қарсы жиналып жатыр. Олар: Ол арамдана берсін! Сионның қирағанын өз көзімізбен көріп, соған мәз болайық! — деседі."},
	{12, "12 Алайда олар Жаратқан Иенің ой-ниетін білмейді. Ол соларды қырманға апарылатын бидай бауларындай жинап жатыр. Оның осы жоспарын олар түсінбейді."},
	{13, "13 Тұр да, бидайды бастыр, уа, Сион қаласы! Мен саған сол үшін темір мүйіз әрі қола тұяқ секілді құрал-сайман беріп отырмын. Сонда сен көптеген халықтарды быт-шыт қылып қиратасың. Олардың арамдықпен жинаған өнімдерін енді Жаратқан Иеге бағыштайсың. Иә, солардың байлықтарын бүкіл жер бетінің Иесіне ұсынасың."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Жасағыңды түзе, уа, соғысқа дайындалған қала, өйткені бізді жау қоршап алды. Олар Исраилдің билеушісінің бетін асатаяқпен соққылайтын болады."},
	{2, "2 Ал сен, Ефрата аймағындағы Бетлехем, Яһуданың әулеттерінің арасындағы маңызсызы болсаң да, сенен Менің халқым Исраилге басшылық ететін Көсем шығады. Оның шыққан тегі ежелгі заманнан, мәңгіліктен."},
	{3, "3 Сондықтан Оған жүкті әйел толғатып, босанғанға дейін Жаратқан Ие Исраил халқын (жау қолына) тапсырады. Сол кезде Оның аман қалған ағайындары жер аударылған жақтарынан қайта оралып, Исраилдің өзге адамдарымен бірігетін болады."},
	{4, "4 Сол Көсем тұрып, өз халқына Жаратқан Иенің берген қуатымен, әрі өз Құдайы Жаратқан Иенің есімінің салтанатымен билік жүргізетін болады. Оның даңқы жердің ең шалғай түкпірлеріне дейін жеткендіктен, олар қауіпсіздікте тұратын болады."},
	{5, "5 Ол халқы үшін амандық пен тыныштықтың қайнар көзі болады. Ассур әскері біздің елімізге басып кіріп, қамалдарымызды жайпап өтіп жатса, біз оларға қарсы жеті басқарушыны және сегіз әміршіні шығарамыз."},
	{6, "6 Олар Ассур елін семсермен басқарып, Нымрод ежелде негізін қалаған сол елге оның қала қақпаларының алаңдарында билік жүргізетін болады. Ассур әскері шекарамыздан өтіп, елімізге басып кіріп жатса, әміршілеріміз бізді жаудан құтқарады."},
	{7, "7 Сонда Жақыптың үрім-бұтағының тірі қалғандары көптеген халықтар арасында Жаратқан Иенің жерге түсірген шығына және шөпке жаудырған нөсеріне ұқсайды. Олар ешкімге бағынбай, адам баласынан тәуелсіз болады."},
	{8, "8 Жақыптың үрім-бұтағының тірі қалғандары халықтар арасында тұрып, орман аңдарының ішіндегі арыстандай, қойлардың ішіндегі жас арыстандай қуатты болады. Олар тарпа бас салып, айыра жыртқанда, ешкім араша бола алмайды."},
	{9, "9 Уа, Исраил халқы, жауларыңның үстінен жеңіске жет, дұшпандарыңның барлығы күйресін."},
	{10, "10 Сол күні Мен араларыңдағы жылқыларыңды құртып, соғыс күймелеріңді қиратамын, — деп жариялайды Жаратқан Ие. —"},
	{11, "11 Еліңдегі қалаларды талқандап, қорғандарыңның барлығын қиратамын."},
	{12, "12 Өзіңнің сиқырлық істеріңді құртамын, бұдан былай бал ашатын сәуегейлерің болмайды."},
	{13, "13 Мен араларыңдағы ағаштан ойылған тәңір мүсіндері мен тас бағаналарды қиратып тастаймын. Бұдан былай сендер өз қолдарыңмен жасаған тәңірсымақтарға табынбайтын боласыңдар."},
	{14, "14 Мен араларыңнан Ашераның бағаналарын алып тастап, (арамданған) қалаларыңды қиратамын."},
	{15, "15 Өзіме мойынсұнбаған ұлттарға қарсы ашу-ызаға кенеліп, оларға лайықты жазаларын тартқызамын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 Уа, Исраил халқы, Жаратқан Иенің не айтқанын тыңдаңдар: Орындарыңнан тұрып, істеріңді алдыма жайып салыңдар! Тау-төбелер соны тыңдап куә болсын."},
	{2, "2 Сондай-ақ, уа, таулар, Жаратқан Иенің Исраилге тағатын айыбына да құлақ түріңдер! Уа, жердің берік негіздері, Оған құлақ салыңдар! Өйткені Жаратқан Ие өз халқына кінә тағады. Ол Исраилді айыптамақшы."},
	{3, "3 Уа, халқым, Мен сендерге не істедім? Сендерді немен қалжыраттым? Маған жауап беріңдер!"},
	{4, "4 Мен сендерді Мысыр елінен алып шығып, құлдықтың құрсауынан құтқарып азат еттім. Сендерді жетелеуге Мұсаны, Һарон мен Мәриямды жібердім."},
	{5, "5 Уа, халқым, есіңе түсірші: Моаб патшасы Балақ қандай жоспар құрып, Беғор ұлы Балағам оған не деп жауап берген еді? Шиттимнен Ғылғалға көшкендеріңде жолшыбай не болды? Сол оқиғаларды естеріңе алыңдар, сонда Мен — Жаратқан Ие істеген әділ істерімді ұғатын боласыңдар."},
	{6, "6 — Мен Жаратқан Иенің алдына қандай сый-тартумен келейін? Көктегі Құдайға нені ұсынып, бас иіп тағзым ете аламын? Оның алдына келгенде құрбандыққа шалынып, өртелетін тайыншалар ұсынсам бола ма?"},
	{7, "7 Жаратқан Иеге сан мыңдаған қошқар әрі он мыңдаған бұлақ болып аққан зәйтүн майын әкеліп Оны риза қылуға бола ма? Бас көтеріп теріс іс істегенім үшін тұңғышымды, жасаған күнәм үшін өз перзентімді құрбандыққа шалайын ба? (— Әрине, олай емес.)"},
	{8, "8 — Уа, адам, Жаратқан Ие саған ненің игілікті екенін білдірген еді. Ол сенен нені талап етеді? Әділ істер істеп, мейірімділікті ұнатуыңды, әрі сиынатын Құдайыңмен тығыз байланыста болып кішіпейіл жүруіңді талап етеді емес пе?!"},
	{9, "9 Жаратқан Иенің даусын тыңдаңдар! Егер шын дана болсаңдар, Жаратқан Иені терең қастерлейтін болыңдар! Ол Иерусалим қаласына мына үндеуді тастайды: Таяқ іспетті жау әскеріне әрі оны тағайындап, осында жіберген Жаратқан Иеге назар аударыңдар!"},
	{10, "10 Уа, зұлым әулет, сендердің арамдықпен жиып-тергендерің әлі бар емес пе? Сендердің әдейі азайтылған өлшеуіштеріңді жек көремін!"},
	{11, "11 Таразысы алдамшы, әрі дорбасын жалған өлшеуіш тастарға толтырып алған кісіні Мен қалайша ақтаймын?"},
	{12, "12 Қаланың байлары зорлықшыл, тұрғындары өтірікші, ауыздарынан шығатыны алдап-арбау."},
	{13, "13 Сол себепті Мен сендерді жарақаттап құртамын, күнәларың үшін күйретемін."},
	{14, "14 Сендер тамақ жейсіңдер, бірақ тоя алмайсыңдар, қарындарың бәрібір аш болады. Былай қойып сақтайсыңдар, бірақ ештеңе жинай алмайсыңдар. Тіпті сақтап қойғандарыңның өзін Мен семсермен еліңе басып кірген жауға табыстаймын."},
	{15, "15 Сендер тұқым себесіңдер, бірақ өнім алмайсыңдар, зәйтүн жемісін сығасыңдар, бірақ соның майын қолданбайсыңдар. Жүзім шырынын сығып аласыңдар, бірақ одан дәм татып ішпейсіңдер."},
	{16, "16 Сендер Омридың зұлым ережелерін, Ахабтың әулетінің барлық арам дәстүрлерін ұстанып, олардың көрсеткен жаман үлгілеріне еліктедіңдер. Сол себепті Мен қаланы күйретуге тастап, оның тұрғындарын масқаралап, басқаларға күлкі қыламын. Сонда сендер халықтардың табасына қаласыңдар."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct kk7 poems[] = {
	{1, "1 Сорлы басым-ау! Бау-бақшаның өнімі түгелдей жиналып болғаннан кейін одан жеміс тапқысы келген кісідеймін. Онда тәбетімді басатын не жүзім шоғы, не ерте піскен інжір жемісінің бірде-біреуі қалмаған!"},
	{2, "2 Дәл сол сияқты, елде Құдайға адал ешкім қалмаған! Адамдардың арасында бірде-бір әділ адам қалған жоқ! Барлығы біреудің қанын төгуді аңдып жатады, әркім ағайынына тұзақ құрып қойған."},
	{3, "3 Екі қолы да жамандықты істеуге шебер-ақ, әмірші сый-тарту дәметеді, төреші де жемқор, ал ұлық өз қалағанын иемденеді. Бәрі осылайша сөз байласып істі бұрмалайды."},
	{4, "4 Олардың ең жақсысы тікенді бұтадай, ең әділдеуі қаулап өскен тікенекті қоршаудай. Бірақ олардың күзетшілері — пайғамбарлары алдын ала айтып кеткен сот күні таяп қалды. Сонда олар абыржып, не істерін білмейді."},
	{5, "5 Бұдан былай көршіңе де сенбе, досыңа да сенім артпа! Тіпті қойныңдағы өз әйеліңе де айтатын сөздеріңе сақ бол!"},
	{6, "6 Өйткені өз ұлы әкесін масқаралап, қызы шешесіне, келіні енесіне қарсы шығады. Адамның дұшпаны өз үй іші болады."},
	{7, "7 Ал мен Жаратқан Иеге үмітпен қараймын. Өзімді құтқаратын Құдайдың көмек көрсетуін күтемін. Айтқан дұғаларым Құдайымның құлағына жетеді."},
	{8, "8 Мені табалама, дұшпаным! Құласам да, қайта тұрамын! Қазір түнекте отырсам да, Жаратқан Ие жарық нұрым болады! — дейді Иерусалим. —"},
	{9, "9 Мен Жаратқан Иеге қарсы күнә жасағандықтан Оның қаһарына ұшыраймын. Бірақ кейін Ол мүддемді қорғап, мені ақтайды. Сонда Ол мені нұрға алып шығады, Оның әділ істерін көремін!"},
	{10, "10 Сонда дұшпандарым да мұны көреді. Мені: Құдайың Жаратқан Ие енді қайда? деп табалаған олар масқараға батады. Жаулардың құлдырағанын өз көзіммен көремін, олар көшелерде батпақ сияқты тапталатын болады."},
	{11, "11 Сенің қабырғаларыңды қайтадан тұрғызатын, шекараларыңды кеңейтетін күн де туады!"},
	{12, "12 Сол кезде жұрт саған Ассурдан және Мысырдың қалаларынан, иә, Мысыр мен Евфрат өзенінің аралығынан, батыс пен шығыстағы теңіздердің және таулардың араларынан келетін болады."},
	{13, "13 Алайда жер өз тұрғындарының теріс істерінің кесірінен қаңырап бос қалады."},
	{14, "14 Халқыңды, өз үлесіңе тиген отарыңды, асатаяғыңмен бақ, уа, Ием. Олар ну орманда әрі құнарлы егістіктерде тұрады. Өткен замандағыдай, олар Башан мен Ғилақадтың жайлауларында оттасын."},
	{15, "15 (Жаратқан Ие мынаны уәде етеді:) Сенің Мысырдан көшіп шыққан кезіңдегідей, Мен саған Өзімнің кереметтерімді көрсетемін."},
	{16, "16 Басқа халықтар соны көріп, өздерінің шектеулі күш-қуатына ұялатын болады. Олар қолдарымен ауыздарын жауып үнсіз қалады, құлақтары керең болып мелшиіп тұрады."},
	{17, "17 Сол дұшпандар жыландай, жерде бауырымен жорғалайтын мақұлықтай шаң-тозаң жалап, өз бекіністерінен діріл қағып шығатын болады. Уа, Құдайымыз Жаратқан Ие, олар Саған қорқынышпен бет бұрып, алдыңда үрейленіп, Сені терең қастерлейтін болады."},
	{18, "18 Өз меншікті халқын кінәсінен арылтатын әрі оның тірі қалғандарының теріс істерін кешіретін Сен сияқты қай Құдай бар? Сен мәңгілікке қаһарланбайсың, қайта, берік мейірім көрсетуден рақат табасың."},
	{19, "19 Сен бізге қайтадан рақымыңды көрсетесің. Әділетсіз істерімізді аяғыңмен таптап, күнәларымыздың бәрін де теңіздің тұңғиығына тастайсың!"},
	{20, "20 Ежелгі заманда ата-бабаларымызға уәде еткеніңдей, Сен Жақыптың үрім-бұтағына адалдық танытып, Ыбырайымның ұрпақтарына берік мейіріміңді көрсетесің."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};