#include <map>
#include <string>
class Bible59
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Құдайдың және Иеміз Иса Мәсіхтің басыбайлы қызметшісі Жақыптан дүние жүзіне тарап кеткен Исраилдің он екі руына дұғай сәлем!"},
	{2, "2 Бауырластарым менің, сендер алуан түрлі қиын сынақтарға ұшырағанда, бұл жайтты зор қуанышпен қабылдаңдар."},
	{3, "3 Себебі сенімдеріңнің сыналып, берік те шынайы екендігінің дәлелденуі төзімділік тудыратынын білесіңдер."},
	{4, "4 Тек төзімділіктерің іс жүзінде соңына дейін жетуге тиіс, сонда сендер рухани жағынан жетіліп те кемелденіп, ешбір кемшіліктерің қалмайды."},
	{5, "5 Ал егер кейбіреулерің даналыққа мұқтаж болсаңдар, Құдайдан сұраңдар, Ол береді. Тәңір Иеміз еш жазғырмай-ақ бәріне жомарттықпен бере салады."},
	{6, "6 Тек шүбәланбай, сеніммен Құдайдан сұрауларың керек. Себебі күмәнданған адам жел айдап, соқтығысқан теңіз толқынына ұқсас."},
	{7, "7 Мұндай кісі Жаратқан Иеден бір нәрсе аламын деп күтпесін:"},
	{8, "8 ол — екіойлы, барлық іс-әрекетінде тұрақсыз адам."},
	{9, "9 Қарапайым бауырластарың Құдай алдындағы жоғары дәрежесімен,"},
	{10, "10 ал бай адам қарапайым дәрежесімен мақтансын. Өйткені пенде шөп арасындағы жабайы гүл іспетті бірден құрып кетпек."},
	{11, "11 Күн шығып, аптап ыстық басқанда шөп қурап, гүл де солып, бар сұлулығынан айырылады. Дәл солай, бай адам да бұ дүниедегі іс-әрекетімен шұғылданып жүргенде-ақ қалжырап, құрып кетпек."},
	{12, "12 Қиын сынақты төзімділікпен басынан өткізіп жатқан әркім бақытты! Содан өтіп, сенімді екендігі дәлелденгеннен кейін, ол бәйге жүлдесіндей шынайы өмірдің тәжін иемденбек. Мұны Жаратқан Ие Өзін сүйгендерге сыйлауға уәде етті."},
	{13, "13 Күнәға еліккен ешқайсың да: Құдай мені еліктіреді деп айтпаңдар! Құдай күнәға еш елікпейді де, ешкімді еліктірмейді де."},
	{14, "14 Қайта, адамды өзінің құмарлықтары еліктіріп, ол солардың жетегінде кеткенде сынақтан өтеді."},
	{15, "15 Сонда құмарлыққа берілсе, сол күнәні тудырады, ал күнә жасау рухани өлімге ұшыратады."},
	{16, "16 Сүйікті бауырластарым, алданып қалмаңдар:"},
	{17, "17 көктегі Әкеміз берген қай нәрсе де игі. Нұр шашқан аспан денелерін жаратқан Ол бізге Өзінің мүлтіксіз жарылқауын жаудырады. Аспан денелерінің көлеңкелері қозғала бергенмен, Құдайда ешқандай тұрақсыздық жоқ."},
	{18, "18 Ол шынайы хабары арқылы бізге мәңгілік өмір сыйлап, Өзінің жаңа жаратылысындағы тұңғыш рухани балалары болуымызды қалады."},
	{19, "19 Ал енді, сүйікті бауырластарым, мынаны ескеріңдер: Әркім тыңдауға жүйрік, ал сөйлеуге шабан, ашулануға баяу болсын."},
	{20, "20 Ашу-ызаның жетегіндегі адам Құдайға ұнайтын әділ істерді жасай алмайды."},
	{21, "21 Ендеше, өздеріңде қалған барлық арамдық пен жамандық атаулыны тастаңдар, жүректеріңе себіліп жатқан Ізгі хабарды кішіпейілділікпен қабылдаңдар! Ол сендерді күнәнің құлдығынан құтқара алады."},
	{22, "22 Құдайдың айтқандарын құр естуші ғана болмай, оларды іске асырушы болыңдар! Әйтпесе өздеріңді-өздерің алдайсыңдар."},
	{23, "23 Өйткені Тәңір Иенің хабарын естігенмен, оны іске асырмайтын адам айнаға қарап, бет әлпетін көрген біреуге ұқсайды:"},
	{24, "24 ол өзіне байыппен қарайды, бірақ былай шыға бере-ақ өз түрін ұмытып қалады."},
	{25, "25 Ал кім кемелді тәлімге, яғни күнәнің құрсауынан азат ететін Ізгі хабарға, ұқыпты ден қойып, онысын ұдайы жалғастыра берсе, сол ұмытшақ тыңдаушы емес. Қайта, ол естігендерін жүзеге асырушы болып, іс-әрекетінде жарылқанбақ."},
	{26, "26 Өзін діншілмін деп санағанмен, тіліне ие бола алмайтын әркім өзін-өзі алдап жүр. Оның діншілдігі еш пайдасыз."},
	{27, "27 Құдай Әкеміздің алдындағы таза да мінсіз діншілдік мынау: мұқтаждық көрген жетім-жесірлердің қамын ойлау және өзін осы дүниелік арамдықтардан кіршіксіз пәк ұстау."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Бауырластарым менің, сендер салтанатты ұлылыққа бөленген Иеміз Иса Мәсіхке сенгендіктен, адамдарды сыртына қарап алаламаңдар!"},
	{2, "2 Айталық, қауым жиналыстарыңа алтын жүзік тағып, жалтыраған сәнді киім киген кісі, сондай-ақ, жұпыны киінген кедей де келді дейік."},
	{3, "3 Сонда сендер жүзік таққан байға: Төрге шығып, жайғасыңыз деп, ерекше назар аударасыңдар. Ал мүсәпірге: Ана жерге тұр немесе Мұнда, аяқ жағыма отыр дейсіңдер."},
	{4, "4 Осылайша адамдарды алалап, жаман пиғылды төрешілерге айналасыңдар, солай емес пе?"},
	{5, "5 Сүйікті бауырластарым, ден қойып тыңдаңдаршы! Құдай осы дүниелік тұрғыдан кедейлерді сенімдері арқылы рухани бай болуға, әрі өз Патшалығына кіріп, үлес алуға таңдаған жоқ па еді? Осы Патшалығын Ол Өзін сүйетіндерге аманаттауға уәде етті ғой."},
	{6, "6 Ал сендер кедейлерді кемсітіп келесіңдер! Өздеріңді жәбірлеп, сотқа тартатындар сол байлар емес пе?!"},
	{7, "7 Сендерге берілген ізгі есімді масқаралайтын да солар ғой."},
	{8, "8 Киелі жазбада берілген асыл заң мынау: Өзіңді қалай сүйсең, маңайыңдағы кісіні де солай сүй! Осыны іс жүзінде орындасаңдар, дұрыс істегендерің."},
	{9, "9 Егер адамдарды сыртына қарап алаласаңдар, күнә жасап Құдайдың заңын бұзушы болып әшкереленесіңдер."},
	{10, "10 Тіпті бүкіл Таурат заңын орындай тұра, бір жерінде сүрінген адам оны түгел бұзғандай айыпты."},
	{11, "11 Тауратта Неке адалдығын бұзба! деп бұйырған Тәңір Иеміз Кісі өлтірме! деп те айтты. Егерде неке адалдығын бұзбай, кісі өлтірсең, бәрібір Құдайдың заңын бұзушы болып табыласың."},
	{12, "12 Мәсіх сендерге рухани азаттық әкелген өз тәлімі бойынша төрелік ететін болады. Сөздерің мен іс-әрекеттерің соған сай болсын!"},
	{13, "13 Мейірім көрсетпеген адамға сот та мейірімсіз болмақ. Мейірім соттаудан үстем!"},
	{14, "14 Бауырластарым менің, біреу сенемін дей тұра, игі істер жасамаса, онысынан не пайда?! Сондай сенімі оны Тәңір Иенің қаһарынан құтқара ала ма?"},
	{15, "15 Айталық, сендердің сенуші бауырластарың, не еркек, не әйел заты болсын, киер киім мен ішер тамаққа зәру жүр дейік."},
	{16, "16 Араларыңдағы біреуің оларға: Аман-сау болыңдар! Тоңбай, қарындарың ашпай өмір сүріңдер деп тілек білдіріп, солардың тәндік қажеттерін қамтамасыз етпесе, оның тілегінен не пайда?!"},
	{17, "17 Ендеше, сенім игі іс-әрекет тудырмаса, ол — өлі сенім."},
	{18, "18 Мүмкін кейбіреу: Сенің сенімің бар, ал мен игі істер жасаймын дер. Игі істер тудырмайтын сеніміңнің шынайылығына көзімді жеткізші, ал мен жасаған игі істерім арқылы сенімімді дәлелдеймін."},
	{19, "19 Сен жалғыз Құдай бар деп сенесің. Мұның дұрыс, алайда жындар да соған сеніп, Оның қаһарынан қорқып дірілдейді."},
	{20, "20 Қандай ақымақтық! Ей, пенде, игі іс-әрекетсіз сенімнің пайдасыз екенін ұқпайсың ба?"},
	{21, "21 Түп атамыз Ыбырайым баласы Ысқақты құрбандыққа ұсынғанда сол ісі арқылы Құдай алдында ақталды емес пе?"},
	{22, "22 Байқайсың ба: Ыбырайым Құдайға сенді, сондай-ақ Оның айтқаны бойынша әрекет етті де. Осылайша сол істегендері арқылы Ыбырайымның сенімі кемеліне жетті."},
	{23, "23 Сонда Киелі жазбадағы мына сөздер жүзеге асты: Ыбырайым Құдайға сенді, сондықтан Оның алдында ақталды. Содан Ыбырайым тіпті Құдайдың досы деген атаққа да ие болды."},
	{24, "24 Өздерің көріп отырғандай, Тәңір Иенің алдында адамды тек оның сенімі ғана емес, істегендері де ақтайды."},
	{25, "25 Сол секілді, бұрын жеңіл жүрісті әйел болған Рахаб та (Құдайға сеніп) барлаушыларды үйіне түсіріп, басқа жолмен қашып құтылуларына жағдай жасады. Рахаб осы ісі арқылы ақталды емес пе?"},
	{26, "26 Демек, жансыз тәннің өлі екеніндей, әрекетсіз сенім де өлі."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Бауырластарым менің, бәрің бірдей тәлім беруші болуға ұмтылмаңдар! Иеміздің бізге, тәлім беретіндерге, басқалардан гөрі қатаңырақ төрелік айтатынын білесіңдер."},
	{2, "2 Бәріміз де көп қате жібереміз. Ал кім сөзінде қате жібермесе, сол — денесін тұтастай меңгере алатын жетілген адам."},
	{3, "3 Мініс атын өз еркімізге көндіру үшін жай ғана ауыздық салып, бүкіл денесін бағындырып, бағыттаймыз."},
	{4, "4 Немесе мысалға теңіз кемесін алайық. Ол қаншама үлкен болса да, күшті желмен ыққанда өте кішкентай тұтқасымен басқарылып, оны ұстап тұрған кісінің қалаған бағытына жүреді."},
	{5, "5 Сол сияқты, тіл де дененің кішігірім мүшесі бола тұра, ғаламат нәрселермен мақтанады. От ұшқыны қаншама майда болса да, қалың орманды өртеп жібере алады!"},
	{6, "6 Тіл де от іспетті, әділетсіздік тудырғыш. Дене мүшелерінің арасында орналасқан ол бүкіл денемізді арамдап, өзі тозақ отынан тұтанып, бар өмірімізді де өртеп, құрта алады."},
	{7, "7 Әртүрлі аңдар мен құстарды, бауырымен жорғалаушылар мен теңіз жануарларын адам өз еркіне бағындырып келді және бағындыруда."},
	{8, "8 Алайда адамдардың ешқайсысы да өз тілін бағындыра алмайды! Тіл — бағынуға көнбейтін жаман нәрсе, кісі өлтіретін уға толы."},
	{9, "9 Біз тілімізбен Жаратқан Ие — Құдай Әкеге алғыс айтып, Оны дәріптейміз. Алайда Құдай рухани жағынан Өзіне ұқсас етіп жаратқан адамдарды сол тілімізбен қарғаймыз да!"},
	{10, "10 Осылайша алғыс та, қарғыс та бір ауыздан шығады. Бауырластарым менің, бұлай болмасын!"},
	{11, "11 Бұлақ көзінен бір мезгілде тұщы да, ащы да судың шығуы мүмкін бе?"},
	{12, "12 Бауырластарым, ойлаңдаршы: өрік ағашы зәйтүн жемісін немесе жүзім бұтасы өрік жемісін бере ала ма? Әрине, бермейді. Дәл сол сияқты, ащы су шыққан бұлақтан тұщы су да шықпайды."},
	{13, "13 Араларыңдағы қайсың парасатты да саналысың? Сондай адам онысын үлгілі мінез-құлқымен, парасатты инабаттылығымен көрсетсін."},
	{14, "14 Ал егер жүректерің удай қызғанышқа толып, қара бастарыңның абыройын ойласаңдар, онда даналықтарыңа мақтанбаңдар, әйтпесе шындықты бұрмалайсыңдар."},
	{15, "15 Мұндай жалған даналық көктен келмейді. Керісінше, ол осы күнәкар дүниеге, өз бетімен жүрген ескі болмысымызға және жын-перілерге тән."},
	{16, "16 Қай жерде қызғаныш пен қара бастың абыройын ойлау болса, тәртіпсіздік пен зұлымдық атаулы да сол жерде."},
	{17, "17 Көктен келген даналық адамды ең алдымен пәк таза қылады, содан кейін оны ынтымақшыл, төзімді, ымырашыл, қайырым мен игі істер жасағыш, ешкімді алаламайтын әділ қылып, екіжүзділіктен арылтады."},
	{18, "18 Татуластырушылар тыныштық тұқымын себушілер іспетті. Бұл тұқымның жемісі болып әділ мінез-құлық орнығады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Ендеше, араларыңдағы қастастық пен дау-жанжал қайдан шығады? Бойларыңдағы соғысып жатқан арам құмарлықтарыңнан туады емес пе?"},
	{2, "2 Сендер бір нәрсені аңсап, иемдене алмайсыңдар; сонда кісі өлтіретіндей жек көріп, қызғанасыңдар, алайда аңсаған нәрселеріңе қол жеткізе алмайсыңдар. Жанжалдасып, төбелесесіңдер, бәрібір иемденбейсіңдер, өйткені оны Құдайдан сұрамайсыңдар."},
	{3, "3 Сұрасаңдар да, ие бола алмайсыңдар, себебі ізгі ниетпен емес, арам құмарлықтарыңды қанағаттандыру үшін сұрайсыңдар."},
	{4, "4 Әй, опасыздар! Осы күнәкар дүниемен достасу Құдайға қастық екенін білмейтін бе едіңдер? Осы дүниемен дос болғысы келген әркім Құдайдың жауына айналады."},
	{5, "5 Киелі жазбадағы мынадай сөздер бекер айтылды деп санайсыңдар ма: Өмірімізден орын алған Құдайдың Рухы жалғыз Құдайды ғана сүйіп, Оған түгелдей бағышталуымызды аңсайды."},
	{6, "6 Ал Тәңір Ие бізге (арам құмарлықтарға қарсы тұруға) рақымын молынан сыйлайды. Сол себептен де Киелі жазбаларда мынадай сөздер бар: Құдай тәкаппарларға қарсылық жасайды, ал езілген кішіпейілдерге рақымын сыйлайды."},
	{7, "7 Сонымен, Құдайға мойынсұныңдар! Әзәзіл шайтанға қарсы тұрыңдар, сонда ол сендерден қашып кетеді."},
	{8, "8 Құдайға жақындаңдар, сонда Ол да сендерге жақындайды. Ей, күнәкарлар, қолдарыңды жамандық атаулыдан жуып тазартыңдар! Ей, екіойлы табансыздар, жүректеріңді орнықтырыңдар!"},
	{9, "9 Өкініп, зар еңіреп жылаңдар, күлкілерің қайғыға, қуаныштарың қасіретке айналсын!"},
	{10, "10 Жаратқан Иенің алдында бой ұсыныңдар, сонда Ол сендерді жоғарылатпақ."},
	{11, "11 Қымбатты бауырластар, бір-біріңді жамандап қорлауды доғарыңдар! Бауырластарыңды жамандағандарың не үкімдегендерің — (Иеміздің сүйіспеншілік туралы) өсиетін қорлап үкімдегендерің. Ал өсиетті үкімдегенде оны орындаушы емес, соттаушы болып шығасыңдар."},
	{12, "12 Өсиеттерді шығарушы да, соттаушы да — Біреу-ақ. Ол құтқара да, құрта да алады. Маңайыңдағыларды үкімдейтін соншама сен кімсің?"},
	{13, "13 Біз бүгін-ертең пәлен қалаға барып, сонда бір жыл тұрып, сауда жасап, олжаға батамыз дейтіндерің құлақ түріңдер:"},
	{14, "14 сендер тіпті күні ертең не болатынын білмейсіңдер! Өмірлерің неге ұқсас? Ол әншейін аз уақытқа көрініп, кейін ғайып болатын бу іспетті емес пе?"},
	{15, "15 Оның орнына Иеміз бұйыртса, аман болсақ, біз мынаны істейміз, не ананы істейміз дегендерің дұрыс."},
	{16, "16 Ал сендер паңданып мақтанасыңдар. Мұндай даңққұмарлық атаулы жаман."},
	{17, "17 Кім жасауға тиісті жақсылықты біле тұра жасамаса, сол күнәлі."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Сонымен, байлар, құлақ түріп тыңдаңдар! Бастарыңа төніп тұрған қасіреттеріңе бола зар еңіреп жылаңдар!"},
	{2, "2 Дүние-мүліктерің шіріп, киімдерің күйеге жем болды,"},
	{3, "3 алтын мен күмістеріңді тот басты. Солардың тоты сендерге қарсы айғақ болып, тәндеріңді оттай жалмайды. Осы заманның ақыры жақын болса да, өздеріңе қазына жинап келесіңдер!"},
	{4, "4 Міне, сендер егіндеріңді жинаған жұмысшыларға төлемеген тиесілі жалақылар өздеріңе қарсы айғақ болып шағынып тұр! Орақшылардың айқайлаған дауыстары Әлемнің Иесінің құлағына жетті."},
	{5, "5 Сендер бұ дүниеде молшылыққа белшеден батып, рақат кешіп келесіңдер. Құритын күндерің жетсе де, бордақыланған малдай семірудесіңдер."},
	{6, "6 Тіпті өздеріңе қарсы шықпаған әділдерді соттап, өлтірдіңдер!"},
	{7, "7 Ендеше, бауырластарым, Иеміз қайтып келетін кезге дейін шыдаңдар. Диқанға қараңдаршы: ол егіндік жерінен алатын құнды өнімін тосып, оны күзгі және көктемгі жаңбырдың суғаруын төзімділікпен күтеді."},
	{8, "8 Сендер де сабырмен күтіп, жүректерің мызғымас табанды болсын. Өйткені Иеміз жуырда қайтып келмек."},
	{9, "9 Сотталмауларың үшін, бауырластарым, бір-біріңнің үстеріңнен шағым айтпаңдар. Үкім шығаратын Иеміздің жуырда қайта оралатынын білесіңдер ғой. Ол есік алдына келіп қалғандай жақын."},
	{10, "10 Бауырластарым менің, азап шегіп, төзе білуде Жаратқан Иенің атынан сөйлеген пайғамбарлардан үлгі алыңдар."},
	{11, "11 Сол төзімді адамдарды бақытты деп санаймыз. Әйүп пайғамбардың шыдамдылығы туралы естігенсіңдер, Жаратқан Иенің ақыр аяғында оны қалай жарылқағанын да білесіңдер. Иеміздің жанашырлығы мен қайырымдылығы қандай зор!"},
	{12, "12 Ең бастысы, бауырластарым, ант етуші болмаңдар! Көк пен жердің немесе басқа да нәрселердің атымен ант етпеңдер. Қайта, сендер иә дегенде шынымен иә, жоқ дегенде шынымен жоқ болуға тиісті. Әйтпесе Тәңір Ие сендерді жауапқа тартпақ."},
	{13, "13 Кейбіреулерің азап шеккенде, Құдайға сиынсын, көңілді болғанда, мадақтау жырлары мен әндерін айтсын."},
	{14, "14 Қайсыбіреуің ауырып қалса, қауым жетекшілерін шақыртсын. Олар соның маңдайына Жаратқан Иенің атынан май жағып, оның үстіне қолдарын жайып сиынсын."},
	{15, "15 Сеніммен сиынғандарыңа бола Иеміз науқастың денсаулығын қайтадан қалпына келтіріп, сауықтырмақ. Егер ол күнә жасаған болса, кешірілмек."},
	{16, "16 Сондықтан сауығып кету үшін, жасаған күнәларыңды бір-біріңе айтып мойындап, бір-бірің үшін сиыныңдар! Әділ адамдардың Құдайға сиынуларының күші орасан зор."},
	{17, "17 Ілияс пайғамбар да біз сияқты пенде болатын. Алайда ол жаңбыр жаумасын деп шын жүректен сиынғанда, үш жарым жыл бойы жерге жаңбыр тамбады."},
	{18, "18 Ол қайтадан жауын болсын деп сиынғанда, аспаннан жаңбыр құйылып, жер тағы да өнімін берді."},
	{19, "19 Бауырластарым, қайсыбіреуің ақиқат жолынан тайса, басқа біреуің оны кері қайтарсын!"},
	{20, "20 Естеріңде болсын: кім күнәкарды теріс жолдан қайтарса, сол оның жанын рухани өлімнен құтқарып, көптеген күнәларының кешірілуіне себепші болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};