#include <map>
#include <string>
class Bible19
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
	struct kk7	{ int val; const char *msg; };
	struct kk8	{ int val; const char *msg; };
	struct kk9	{ int val; const char *msg; };
	struct kk10	{ int val; const char *msg; };
	struct kk11	{ int val; const char *msg; };
	struct kk12	{ int val; const char *msg; };
	struct kk13	{ int val; const char *msg; };
	struct kk14	{ int val; const char *msg; };
	struct kk15	{ int val; const char *msg; };
	struct kk16	{ int val; const char *msg; };
	struct kk17	{ int val; const char *msg; };
	struct kk18	{ int val; const char *msg; };
	struct kk19	{ int val; const char *msg; };
	struct kk20	{ int val; const char *msg; };
	struct kk21	{ int val; const char *msg; };
	struct kk22	{ int val; const char *msg; };
	struct kk23	{ int val; const char *msg; };
	struct kk24	{ int val; const char *msg; };
	struct kk25	{ int val; const char *msg; };
	struct kk26	{ int val; const char *msg; };
	struct kk27	{ int val; const char *msg; };
	struct kk28	{ int val; const char *msg; };
	struct kk29	{ int val; const char *msg; };
	struct kk30	{ int val; const char *msg; };
	struct kk31	{ int val; const char *msg; };
	struct kk32	{ int val; const char *msg; };
	struct kk33	{ int val; const char *msg; };
	struct kk34	{ int val; const char *msg; };
	struct kk35	{ int val; const char *msg; };
	struct kk36	{ int val; const char *msg; };
	struct kk37	{ int val; const char *msg; };
	struct kk38	{ int val; const char *msg; };
	struct kk39	{ int val; const char *msg; };
	struct kk40	{ int val; const char *msg; };
	struct kk41	{ int val; const char *msg; };
	struct kk42	{ int val; const char *msg; };
	struct kk43	{ int val; const char *msg; };
	struct kk44	{ int val; const char *msg; };
	struct kk45	{ int val; const char *msg; };
	struct kk46	{ int val; const char *msg; };
	struct kk47	{ int val; const char *msg; };
	struct kk48	{ int val; const char *msg; };
	struct kk49	{ int val; const char *msg; };
	struct kk50	{ int val; const char *msg; };
	struct kk51	{ int val; const char *msg; };
	struct kk52	{ int val; const char *msg; };
	struct kk53	{ int val; const char *msg; };
	struct kk54	{ int val; const char *msg; };
	struct kk55	{ int val; const char *msg; };
	struct kk56	{ int val; const char *msg; };
	struct kk57	{ int val; const char *msg; };
	struct kk58	{ int val; const char *msg; };
	struct kk59	{ int val; const char *msg; };
	struct kk60	{ int val; const char *msg; };
	struct kk61	{ int val; const char *msg; };
	struct kk62	{ int val; const char *msg; };
	struct kk63	{ int val; const char *msg; };
	struct kk64	{ int val; const char *msg; };
	struct kk65	{ int val; const char *msg; };
	struct kk66	{ int val; const char *msg; };
	struct kk67	{ int val; const char *msg; };
	struct kk68	{ int val; const char *msg; };
	struct kk69	{ int val; const char *msg; };
	struct kk70	{ int val; const char *msg; };
	struct kk71	{ int val; const char *msg; };
	struct kk72	{ int val; const char *msg; };
	struct kk73	{ int val; const char *msg; };
	struct kk74	{ int val; const char *msg; };
	struct kk75	{ int val; const char *msg; };
	struct kk76	{ int val; const char *msg; };
	struct kk77	{ int val; const char *msg; };
	struct kk78	{ int val; const char *msg; };
	struct kk79	{ int val; const char *msg; };
	struct kk80	{ int val; const char *msg; };
	struct kk81	{ int val; const char *msg; };
	struct kk82	{ int val; const char *msg; };
	struct kk83	{ int val; const char *msg; };
	struct kk84	{ int val; const char *msg; };
	struct kk85	{ int val; const char *msg; };
	struct kk86	{ int val; const char *msg; };
	struct kk87	{ int val; const char *msg; };
	struct kk88	{ int val; const char *msg; };
	struct kk89	{ int val; const char *msg; };
	struct kk90	{ int val; const char *msg; };
	struct kk91	{ int val; const char *msg; };
	struct kk92	{ int val; const char *msg; };
	struct kk93	{ int val; const char *msg; };
	struct kk94	{ int val; const char *msg; };
	struct kk95	{ int val; const char *msg; };
	struct kk96	{ int val; const char *msg; };
	struct kk97	{ int val; const char *msg; };
	struct kk98	{ int val; const char *msg; };
	struct kk99	{ int val; const char *msg; };
	struct kk100	{ int val; const char *msg; };
	struct kk101	{ int val; const char *msg; };
	struct kk102	{ int val; const char *msg; };
	struct kk103	{ int val; const char *msg; };
	struct kk104	{ int val; const char *msg; };
	struct kk105	{ int val; const char *msg; };
	struct kk106	{ int val; const char *msg; };
	struct kk107	{ int val; const char *msg; };
	struct kk108	{ int val; const char *msg; };
	struct kk109	{ int val; const char *msg; };
	struct kk110	{ int val; const char *msg; };
	struct kk111	{ int val; const char *msg; };
	struct kk112	{ int val; const char *msg; };
	struct kk113	{ int val; const char *msg; };
	struct kk114	{ int val; const char *msg; };
	struct kk115	{ int val; const char *msg; };
	struct kk116	{ int val; const char *msg; };
	struct kk117	{ int val; const char *msg; };
	struct kk118	{ int val; const char *msg; };
	struct kk119	{ int val; const char *msg; };
	struct kk120	{ int val; const char *msg; };
	struct kk121	{ int val; const char *msg; };
	struct kk122	{ int val; const char *msg; };
	struct kk123	{ int val; const char *msg; };
	struct kk124	{ int val; const char *msg; };
	struct kk125	{ int val; const char *msg; };
	struct kk126	{ int val; const char *msg; };
	struct kk127	{ int val; const char *msg; };
	struct kk128	{ int val; const char *msg; };
	struct kk129	{ int val; const char *msg; };
	struct kk130	{ int val; const char *msg; };
	struct kk131	{ int val; const char *msg; };
	struct kk132	{ int val; const char *msg; };
	struct kk133	{ int val; const char *msg; };
	struct kk134	{ int val; const char *msg; };
	struct kk135	{ int val; const char *msg; };
	struct kk136	{ int val; const char *msg; };
	struct kk137	{ int val; const char *msg; };
	struct kk138	{ int val; const char *msg; };
	struct kk139	{ int val; const char *msg; };
	struct kk140	{ int val; const char *msg; };
	struct kk141	{ int val; const char *msg; };
	struct kk142	{ int val; const char *msg; };
	struct kk143	{ int val; const char *msg; };
	struct kk144	{ int val; const char *msg; };
	struct kk145	{ int val; const char *msg; };
	struct kk146	{ int val; const char *msg; };
	struct kk147	{ int val; const char *msg; };
	struct kk148	{ int val; const char *msg; };
	struct kk149	{ int val; const char *msg; };
	struct kk150	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Мынадай адам шынымен бақытты: Ол құдайсыздар кеңесіне бармайды, Күнәкарлар жолымен де жүрмейді, Мазақтаушылармен бірге отырмайды."},
	{2, "2 Қайта, ол Жаратқанның тәліміне қуанады, Күні-түні сол туралы ойланады."},
	{3, "3 Ол су жағасындағы ағашқа ұқсайды: Сол мерзімінде жемісін береді, Жапырақтары кеуіп те сембейді, Не істесе де, ол табысқа жетеді."},
	{4, "4 Ал құдайсыздарда солай болмайды, Олар жел ұшырған қабыққа ұқсайды,"},
	{5, "5 Құдай сотында ақтала алмайды, Әділдер қауымында орны болмайды."},
	{6, "6 Әділдің қамын Жаратқан ойлайды, Ал құдайсыздың ізі де қалмайды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Неге халықтар жатыр бас көтеріп, Ұлттар іске аспайтын жоспарлар құрып?"},
	{2, "2 Жаратқан мен Оның қойған патшасына Әлемнің патшалары қарсы тұрып, Әкімдер кеңесіп жатыр бірігіп:"},
	{3, "3 Бізге салған шынжырларын сындырып, Бұғауларынан құтылайық лақтырып!"},
	{4, "4 Көктегі тағында отырған Құдай күледі, Солардың ойларын Жаратқан келекелейді,"},
	{5, "5 Содан ашулана зекіп, тіл қатады, Қаһар шашып, зәрелерін ұшырады:"},
	{6, "6 Киелі тауым Сионда Мен Өзім Осы патшамды тағайындаған едім!"},
	{7, "7 Паш етейін Жаратқанның жарлығын: Рухани ұлымсың, — деді Ол маған. — (Өзіңді патшалыққа тағайындап) Мен бүгінгі күні Әке болдым саған."},
	{8, "8 Менен сұра, сонда иелігіңе сенің Халықтарды мәңгілікке беремін, Шартарапты қол астыңа өткіземін."},
	{9, "9 Сен жауларды темір таяқпен ұрасың. Лақтырып сындырғандай қыш ыдыстарын, Талқандап құртасың өз қиқарлықтарын."},
	{10, "10 Енді, патшалар, ақылға келіңдер, Әлемнің билері, шындықты түсініңдер!"},
	{11, "11 Жаратқан Иені терең қастерлеңдер, Қуана бой ұрып қызмет етіңдер! Һәм дірілдеп күнәдан шошыныңдар,"},
	{12, "12 Ұлының аяғын сүйіп бағыныңдар! Әйтпесе Ол кәрленіп, көздеріңді құртпақ, Ашуы лезде жалындай лауламақ. Ал Оған сенгендер бақытты болмақ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 (Дәуіттің жыры. Ол Дәуіттің өз ұлы Абессаломнан қашып жүрген кезіне арналған.)"},
	{2, "2 Уа, Ием, жауларым сонша көбейді, Көп адам маған қарсы көтерілді."},
	{3, "3 Жұрт: Құдай құтқармайды сол кісіні Деп қатты күйзелтеді жан дүниемді."},
	{4, "4 Ал, Ием, алдымдағы қалқаным Сенсің, Даңққа бөлеп, беделімді көтересің."},
	{5, "5 Жаратқанға дауыстап жалынам, Ол жауап береді киелі тауынан."},
	{6, "6 Орныма жатып, ұйықтаймын бейқам, Содан оянып, тұрамын қайтадан, Себебі мені қорғайды Жаратқан."},
	{7, "7 Мен қорықпаймын өзіме жан-жақтан Қарсы шыққан мыңдаған жауларымнан."},
	{8, "8 Уа, Ием, көтеріліп қарсы тұрсаңшы, О, Құдайым, мені құтқарсаңшы! Сен жағынан ұрып күллі жауларымды, Күшінен айырасың сол зұлымдарды."},
	{9, "9 Уа, Жаратқан, Құтқарушымыз Сенсің, Батаңды төге гөр халқыңа Өзіңнің."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, ішекті аспаптардың сүйемелдеуімен айтылатын Дәуіттің жыры.)"},
	{2, "2 Уа, Құдай, мені ақтаушы Өзіңсің, Сиынғанымда Сен құлақ сала гөр. Мені қысымшылықтан азат еттің, Қазір де рақыммен құлақ түре гөр."},
	{3, "3 Әй, пенделер, сендер абыройымды Қашанғы қорлап төге бермексіңдер? Жақсы көріп құр сөз бен бос істерді, Қашанғы өтірікке ермексіңдер?"},
	{4, "4 Біліңдер: Жаратқан әділді таңдады, Жалбарынсам, Ием құлақ асады."},
	{5, "5 Ашуланғанда күнә жасамаңдар, Төсекте жатқанда ойланып-толғаныңдар, Жүрек түкпірін тексеріп, тынығыңдар!"},
	{6, "6 Жаратқанға лайықты тарту арнаңдар, Оған сенім артып, мойынсұныңдар!"},
	{7, "7 Кім бізге жақсылық жасар? деп сұрап, Күдік келтіреді көптеген кісілер. Уа, Жаратқан, жылы шыраймен қарап, Бет-жүзіңнің нұрын бізге төге гөр."},
	{8, "8 Молайса нан менен жүзім шырыны, Саған сенбейтіндер масаттанады. Менің жүрегімді Өзің шаттандырдың, Соншама зор қуанышқа толтырдың."},
	{9, "9 Уа, Жаратқан, мен төсегіме жатып Ұйықтаймын енді қаннен-қаперсіз, Өйткені Өзің маған бердің сыйлап Тыныш өмірді қауіп-қатерсіз."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, сыбызғылардың сүйемелдеуімен айтылатын Дәуіттің жыры.)"},
	{2, "2 Уа, Жаратқан Ием, сөзіме құлақ түре гөр, Қасіретті ойларыма көңіл бөле гөр,"},
	{3, "3 Құлақ салсаңшы дауысыма зар жылаған, О, Патшам, Құдайым менің, сиынамын Саған."},
	{4, "4 Уа, Ием, ертеңгісін ести гөр дауысымды, Таң ата алдыңа келіп, күтемін жауабыңды."},
	{5, "5 Себебі Сен, Құдайым, зұлымдықты құптамайсың, Жамандық атаулыны қасыңа жолатпайсың."},
	{6, "6 Мақтаншақтар тұра алмас көз алдыңда Сенің, Заңсыздық істейтіндердің бәрін жек көресің."},
	{7, "7 Өтірік айтқандардың көзін құртып жібересің, Уа, Ием, Сен қанішер, опасыздан жиренесің."},
	{8, "8 Ал мен мол рақымыңның арқасында Өзіңнің киелі үйіңе кіремін, Қасиетті ғибадатханаңның алдында Өзіңді терең қастерлеп бас иемін."},
	{9, "9 О, Ием, мені Өзіңнің тура жолыңмен Жауларыма бола бастап алып жүрші, Жолыңды Өзің маған белгілеген Алдымнан анықтап, тегістеп берші."},
	{10, "10 Себебі жауларымның сөздерінде жоқ шындық, Жүректерінде ағыл-тегіл мол зұлымдық, Арандары олардың көрдей ашық, Майда тілдерімен айтады жалғандық."},
	{11, "11 Уа, Құдайым, үкімдерін шығаршы, Құрған тұзақтарына өздерін құлатшы, Мол күнәлары үшін қуып шықшы, Өйткені олар Саған қарсы шықты."},
	{12, "12 Өзіңе үміт артқандар шаттансын, Лайым қуана мадақтап ән салсын. Өзіңді сүйгендер Сені айтып мақтансын, Олардың бәрін Сен қолдап-қорғайсың."},
	{13, "13 Уа, Ием, Сен әділдерді жарылқайсың, Рақымыңмен қалқан іспетті қоршайсың."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, сегіз ішекті жетігеннің сүйемелдеуімен айтылатын Дәуіттің жыры.)"},
	{2, "2 Уа, Ием, маған ызаланып сөге көрме, Қаһарланып мені жазалай көрме."},
	{3, "3 Әлсізбін, о, Ием, рақымды бола гөр, Дірілдеген денемді сауықтыра гөр."},
	{4, "4 Жан дүнием қатты арпалысады, Жол бересің, уа, Ием, бұған қашанғы?"},
	{5, "5 Я, Ием, қайтып, жанымды құтқара гөр, Берік рақымыңмен аман сақтай гөр."},
	{6, "6 Өлгендер Сені естеріне алмас, Көрдегілер Сені мадақтамас."},
	{7, "7 Күрсіне ыңқылдап қатты шаршаймын, Түні бойы зар еңіреп жылаймын, Төсегімді көз жасыммен дымқылдаймын."},
	{8, "8 Осы қайғымнан көзім солып қалды, Көп жауыма бола көруден қалды."},
	{9, "9 Аулақ менен, бар зұлымдық жасайтындар! Ием құлақ түрді жылаған даусыма,"},
	{10, "10 Жаратқан естіді жалынышымды, Иә, Ием қабылдайды мінажатымды."},
	{11, "11 Бар жауым үрейленіп масқаралансын, Кенеттен кері қайтып, қарабет болсын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct kk7 poems[] = {
	{1, "1 (Бунямин руынан шыққан Құштың қылығы туралы Дәуіттің Жаратқан Иеге айтқан әні. Екпінді әуенмен айтылады.)"},
	{2, "2 Уа, Құдай Ием, Сенен пана табам, Арашалай гөр мені қуғыншыларымнан."},
	{3, "3 Құтқарушым жоқ, жау мені быт-шыт қылады, Арыстандай паршалап, дал-дұлымды шығарады."},
	{4, "4 Уа, Құдай Ием, егер күнә істеген болсам, Яки қолыммен қылмыс жасаған болсам,"},
	{5, "5 Бейбіт жолдасыма сатқындық жасаған Не дұшпанымды болсам себепсіз тонаған,"},
	{6, "6 Онда жаулар мені қуып, ұстап алсын, Жанымды аяғымен жерге таптасын, Абыройымды топыраққа былғасын."},
	{7, "7 Уа, Жаратқан, қаһарлана көтеріле гөр, Жауларымның долдануына қарсы шыға гөр, Өзің бұйырғандай әділдік орната гөр, Мен үшін ендеше әрекеттене гөр."},
	{8, "8 Жиналып тұрсын халықтар айналаңа, Биіктен билік құршы қайтадан оларға."},
	{9, "9 Уа, Жаратқан, Сен халықтарды соттайсың, Мені ақтай гөр, Ием, әділ де адалмын."},
	{10, "10 Әділ Құдайым, жан дүниемізді сынайсың, Енді доғартсаңшы зұлымдардың сұмдығын, Әрі нығайтсаңшы әділдердің қорғанышын."},
	{11, "11 Алла Тағала мені қалқандай қорғайды, Шын жүректен адалды Ол аман сақтайды,"},
	{12, "12 Құдай мәңгі әділ соттаушы болады, Тәңір күнде зұлымдарға ашуланады."},
	{13, "13 Егер адам бас тартпаса күнәсінен, Онда Құдай қайрайды өткір семсерін, Керіп, кезеніп дайындайды садағын,"},
	{14, "14 Отқа қыздырады үшкір жебелерін, Сөйтіп даярлайды өлтіргіш қаруларын."},
	{15, "15 Міне, арамза адам зұлымдық ойлайды, Жан дүниесінде ол пәлені сақтайды, Содан өтіріктері оның туындайды."},
	{16, "16 Ол ор қазып, соны тереңдетіп дайындайды, Алайда сол тұзағына өзі кейін құлайды."},
	{17, "17 Осылай зұлымдығы өз басына келеді, Жауыздығы өзінің төбесіне түседі."},
	{18, "18 Жаратқанның әділдігін мадақтаймын, Алла Тағаланың есімін жырлаймын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct kk8 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, ғаттық жетігеннің сүйемелдеуімен айтылатын Дәуіттің жыры.)"},
	{2, "2 Уа, Жаратқан Тәңір, Иеміз біздің, Бүкіл дүниеде әйгілі Өзіңнің Сондай айбынды да даңқты есімің! Көктен биік мерейіңді өсірдің."},
	{3, "3 Балалардың, кішкене бөбектердің Аузымен Өзіңді дәріптетесің. Дұшпандарыңа бола солай істейсің, Қас жауыңды, кекшілді үндетпейсің."},
	{4, "4 Сенің қолыңнан шыққан аспаныңа, Өзің орнатқан ай мен жұлдыздарға Назар аударған әрбір уақытымда Мынадай сұрақтар туады ойымда:"},
	{5, "5 Өзің ескеретіндей адам сонша кім, Сен қамқорлайтындай адам баласы кім?"},
	{6, "6 Оны көктегілерден сәл төмен қойдың, Құрмет, салтанатты оған тәждей сыйладың."},
	{7, "7 Сен адам баласын билеуші еттің Қолыңнан шыққан бар жаратылысқа. Бәрін де оған бағындырып бердің:"},
	{8, "8 Бүкіл ірілі-ұсақты малдарды да, Даладағы жабайы аңдарды да,"},
	{9, "9 Самсаған құс пен судағы балықты, Теңіз ағыстарымен жүзгендерді Табыстадың Сен оның қол астына."},
	{10, "10 Уа, Жаратқан Тәңір, Иеміз біздің, Бүкіл дүниеде әйгілі Өзіңнің Сондай айбынды да даңқты есімің!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct kk9 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, Ұлдың қазасы әуенімен айтылатын Дәуіттің жыры.)"},
	{2, "2 Уа, Жаратқан, шын жүректен Сені мадақтаймын, Жасаған кереметтеріңнің бәрін жариялаймын."},
	{3, "3 Ұдайы Саған қуанып шаттық ән шырқаймын, Уа, Хақ Тағала, есіміңді Сенің жырлаймын."},
	{4, "4 Жауларым шегініп, кері қарай бұрылады, Алдыңда сүрініп құлап, ойран да болады."},
	{5, "5 Себебі дауымда Сен мүддемді қорғадың, Тағыңда отырып әділ шешім шығардың."},
	{6, "6 Халықтарды сөгіп, зұлымдарды жоқ қылдың, Есімдерін мәңгілікке өшіріп тастадың."},
	{7, "7 Жау қару-жарағынан ада қалып, жойылды, Сен қиратқан қалалары із-түзсіз жоғалды."},
	{8, "8 Рас, Жаратқан Ие мәңгі билік жүргізеді, Ол өз тағын орнатып, төрелік етеді."},
	{9, "9 Иеміз адамзатқа әділ үкім айтады, Халықтарға ақиқат шешім шығарады."},
	{10, "10 Қаналғандарға Жаратқан пана болады, Қиын жағдайда зәулім қорған боп тұрады,"},
	{11, "11 Сені шын білетіндер Саған сенім артады, Ием, тастап кетпейсің Өзіңе сиынғанды."},
	{12, "12 Сионда тұратын Жаратқанға ән шырқаңдар, Оның ғажап істерін бар ұлттарға айтыңдар!"},
	{13, "13 Төгілген қанды ұмытпайтын Ол ескереді, Жәбір шеккеннің айқайына құлағын түреді."},
	{14, "14 Уа, Жаратқан Ие, маған рақым таныта гөр, Жек көрген жаулардан қиналғанымды байқай гөр, Ажалдың аранынан мені арашалай гөр."},
	{15, "15 Сонда қақпаларында Сион шаһарының Өз ұлылығыңды ұдайы марапаттаймын, Мені құтқарғаныңа қуана ән шырқаймын."},
	{16, "16 Басқа ұлттар қазған өз орларына құлады, Құрған қақпандарына өздері ұсталды."},
	{17, "17 Ием әділ үкім айтып, Өзін ашық танытты, Зұлымдар айлалы істерінің кесірін тартты. //"},
	{18, "18 Жамандық жасаушылар ажалға душар болады, Құдайды менсінбеген ұлттар соған тап болады."},
	{19, "19 Ал мұқтаж жан біржола ұмытылып кетпейді, Бейшараның үміті мүлдем зая кетпейді."},
	{20, "20 Уа, Ием, көтерілші, пенде жеңіп шықпасын, Халықтарға көз алдыңда үкім шығарылсын!"},
	{21, "21 Жай пенде екендерін халықтар ұғып алсын, Оларды дірілдетіп қорқытсаң, о, Жаратқан! //"},
	{22, "22 Уа, Жаратқан Ие, неге менен алыстасың? Басыма күн туғанда неге жасырынасың?"},
	{23, "23 Жарлыларды паңдана қудалайды зұлымдар, Өз айлалы істерінен ұсталсын сондайлар!"},
	{24, "24 Арсыз жан құмарлығын тіпті мақтан етеді, Ашкөз де дандайсып Жаратқанды менсінбейді,"},
	{25, "25 Зұлым тәкаппарланып, Тәңірге бет бұрмайды, Күллі ой-пікірінде Құдай жоқ! деп санайды."},
	{26, "26 Ұдайы іс-әрекеттері табыс келтіреді, Сенің сотың тым биікте, алыс боп көрінеді. Зұлым барлық дұшпанын келекелей береді."},
	{27, "27 Шайқалта алмас мені еш нәрсе, — деп ойлайды, — Күллі ұрпақтарыма да пәле жоламайды."},
	{28, "28 Аузынан шыққандар: қарғыс, өтірік, жалғандық, Айтқандары түгелдей зорлық пен зұлымдық."},
	{29, "29 Аула артында тасада аңдып отырады, Бас салып тұтқиылдан, жазықсызды құртады. Қорғансыз жанға көз сүзіп, отырады қарап,"},
	{30, "30 Тасадағы арыстандай тосады тығылып, Бейшара жарлыны ұстауға жатады аңдып, Байғұсқа бас салып, түсіреді торына тартып."},
	{31, "31 Шарасыз бейбақ жеңіліп, жерге құлап түседі, Жауының мықты тырнақтарына ілігеді."},
	{32, "32 Зұлым жан: Құдай ұмытып кетті, — деп ойлайды, — Ол көзін жұмып, ешқашан назар аудармайды."},
	{33, "33 Уа, Жаратқан Ие, орныңнан көтеріле гөр, Құдайым, қол созып, қаналғанды ескере гөр!"},
	{34, "34 Зұлымдар неліктен Құдайды қорлай алады?! Жауапқа тартпайды деп неге ойлай алады?!"},
	{35, "35 Ал көрсеткен жәбірлерін Сен байқап келесің, Зорлықтарын бақылап, жазаларын бересің. Кедей Саған сенеді, жетімге де тірексің."},
	{36, "36 Сол сұрқия зұлымдардың қолдарын сындыршы, Сұмдық істерін тексеріп, із-түзсіз жоқ қылшы!"},
	{37, "37 Жаратқан Ие мәңгі бақи Патша болады, Бой ұрмайтын ұлттар Оның елінен жоғалады."},
	{38, "38 Назар аударасың күшсіздердің аңсауына, Уа, Ием, құлақ салып, жігер бересің оларға,"},
	{39, "39 Жетім мен қиналған жанның мүддесін қорғауға, Сұм пенденің оларды қайтып қорқытпауына!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct kk10 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің жыры.) Ұдайы паналаймын Жаратқан Иені, Қалайша қорқытпақсыңдар былай деп мені: Кәне, кетші ұшып тауыңа құс секілді!"},
	{2, "2 Сол зұлымдар садақ иіп, жебе тартуда, Тасадан дайын тұр адалдарды атуға."},
	{3, "3 Әділ жан не істейді, заңды негіз қираса?"},
	{4, "4 Ал Жаратқан отырады көктегі тағында, Өзінің киелі ғибадатханасында, Иеміз бақылайды барлығын да, Сын көзбен қарайды адам баласына."},
	{5, "5 Жаратқан Ие әділдерді тексереді, Зұлым да зорлықшыл жандарды Ол жек көреді,"},
	{6, "6 Залымдарға жаудырады жанған көмірді Әрі жазалау үшін лаулаған күкіртті, Қоса жібереді күйдіріп өртейтін желді."},
	{7, "7 Иеміз әділ, Ол әділдікті сүйеді, Шыншыл жандар Оның бет-жүзін көреді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct kk11 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, сегіз ішекті жетігеннің сүйемелдеуімен айтылатын Дәуіттің жыры.)"},
	{2, "2 Уа, Жаратқан, құтқара гөр, әділдер қалмады, Адамзат арасынан адал атаулы жоғалды!"},
	{3, "3 Әрбір жан жақындарына жалғандық айтады, Мүләйім жүзбен сөйлесіп, жағымпазданады."},
	{4, "4 Ием тілдерін олардың бөсіп мақтанатын Тоқтата көрсін әрі жағымпаз ауыздарын."},
	{5, "5 Тілімізбен жеңеміз, аузымыз өзіміздікі! Кім билік жүргізбек бізге? деп олар көпіреді."},
	{6, "6 Жарлылар жапа шегіп, кедейлер де күрсінеді, Енді орнымнан тұрамын! — дейді Жаратқан Ие, — Қауіптен қорғаймын Мен жәбір көргендерді."},
	{7, "7 Жаратқанның сөздері таза да сенімді, Жеті рет балқытылып тазарған күміс секілді."},
	{8, "8 Жаратқан Ие, қаналғандарды Сен қорғайсың, Сол арсыз ұрпақтан оларды мәңгі сақтайсың."},
	{9, "9 Ал зұлымдар әлі де емін-еркін жүреді, Адамдар арасында арсыздық дәріптеледі."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct kk12 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің жыры.)"},
	{2, "2 Уа, Жаратқан, қашанғы Сен мені ұмытпақсың? Мәңгілік пе бет-жүзіңді менен жасырмағың?"},
	{3, "3 Қашанғы көңілім уайымға тола бермек, Жүрегім күн сайын қасіретке кенелмек? Дұшпаным қашанғы маған үстемдік жүргізбек?"},
	{4, "4 Уа, Құдай Ием, назар аударып, құлақ сала гөр, Өлмейін, көзімді қайтадан жарқырата гөр."},
	{5, "5 Мен сенімімнен жалтарып, жауым шаттанбасын, Дұшпандарым Жеңдік! деп лепіре мақтанбасын."},
	{6, "6 Ал мен берік рақымыңа сенімімді артамын, Сенің құтқаруыңа шын жүректен қуанамын, Игілік жасаған Иеме әнімді айтамын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct kk13 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің жыры.) Ақылсыз адамдар Құдай жоқ! деп ойлайды, Әбден бұзылған олар жексұрындық жасайды, Әрі ешқайсысы да жақсылық жасамайды."},
	{2, "2 Жаратқан Ие көктен көз салады адамзатқа: Ақылды біреу бар ма бет бұратын Құдайға? Деп байқайды Ол."},
	{3, "3 Жоқ, бәрі тайып кетті теріс жолға, Әбден бұзылды бірігіп барлығы да. Жақсылық жасаушы ешкім жоқ, тіпті бір жан да."},
	{4, "4 Сұмдық жасайтындар ақылға келмес пе екен? Халқымды олар нан жегендей жалмап кеткен, Жаратқанға сиыну ойларына еш түспеген."},
	{5, "5 Ал оларды қорқыныш құрсаулайтын болады, Өйткені Құдай әділ ұрпаққа жар болады."},
	{6, "6 Әй, зұлымдар, күлесіңдер жарлының ниетіне, Бірақ қолдап-қорғайды оны Жаратқан Ие!"},
	{7, "7 Құтқару Сионнан келсе екен Исраилге! Жаратқан өз халқын тұтқыннан азат еткенде, Жақыптың үрім-бұтағы қатты қуанады, Иә, Исраил халқы шат-шадыман болады!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct kk14 poems[] = {
	{1, "1 (Дәуіттің жыры.) Уа, Жаратқан, Сенің тұрағыңда кім тұра алады, Киелі тауыңда кімнің тұруына болады?"},
	{2, "2 Сондай адам мінсіз жүріп әділдік істейді, Шын жүректен ақиқатты ғана сөйлейді,"},
	{3, "3 Ешкімді уытты тілмен өсектемейді, Жолдасына ешбір зұлымдық істемейді, Жақынының арына дақ түсірмейді."},
	{4, "4 Арамза адамдарды ол еш жақтырмайды, Ал Иемізді қастерлейтінді ардақтайды, Өзіне қиын болса да, сөзін орындайды,"},
	{5, "5 Мұқтажға қарыз бергенде өсімін алмайды, Пара алып жазықсыз жанды қараламайды. Мұны істеуші нық тұрып мәңгі шайқалмайды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct kk15 poems[] = {
	{1, "1 (Дәуіттің насихат мінажаты.) Уа, Құдайым, сақтай гөр Өзің мені, Баспана етемін жалғыз Сені!"},
	{2, "2 Жаратқанға былай деймін: Сен Иемсің, Сенен бөлек жоқ ешбір игілігім!"},
	{3, "3 Ұлы жандар — Саған бағышталғандар, Маған өте ұнайды елде олар."},
	{4, "4 Ал бөтен тәңірлердің жолын қуғандар: Қасіретке молынан ұшырамақ олар. Тәңірсымақтарға құрбандық шалмаймын, Олардың аттарын аузыма еш алмаймын."},
	{5, "5 Уа, Ием, маған жар болып келесің, Жарылқап мені амандық бересің, Тағдырым қауіпсіз қолыңда Сенің."},
	{6, "6 Тамаша — маған тиген үлесім, Қатты ұнайды ғажайып мұрам."},
	{7, "7 Даңқтаймын ақыл-кеңес берген Иемді, Ұжданым түнде де мені ескертеді."},
	{8, "8 Ықылас-ниетім әрдайым Иемде, Оң жағымда Ол маған жар боп келеді: Жағдайым шайқалмайды ешбір кезде."},
	{9, "9 Содан жүрегім шаттыққа толады, Мәз-мейрам болып тілімнен бал тамады, Саған сенгенімнен тәнім тыншиды."},
	{10, "10 Сен жанымды о дүниеге қимайсың, Қасиетті адамыңның тәнін шірітпейсің."},
	{11, "11 Шын өмір жолын маған көрсетесің, Көз алдыңда қуанышқа бөлейсің, Оң жағыңда мәңгі игілік бересің."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct kk16 poems[] = {
	{1, "1 (Дәуіттің мінажаты.) Уа, Ием, әділ өтінішімді ести гөр, Жалынған дауысыма көңіл бөле гөр, Шынайы мінажатыма құлақ түрші,"},
	{2, "2 Сен Өзің мені тексеріп, ақтай көрші, Ісімнің әділдігіне көз сала көрші."},
	{3, "3 Жүрегімді зерттеп, түнде де мені сынадың, Тәптіштеп тексерсең де, еш нәрсе таппадың. Жалғандық айтудан ойланып сақтанам,"},
	{4, "4 Іс-әрекетімде сөздеріңе бағынам, Аулақ жүріп келем зорлықшының жолынан."},
	{5, "5 Ізіңмен Сенің берік жүрді қадамдарым, Ақ жолыңнан тайып кетпеді аяқтарым."},
	{6, "6 Уа, Құдайым, Саған дұға етемін, Себебі Сен маған жауап бересің, Қазір де құлақ түрші сөзіме менің,"},
	{7, "7 Көрсетші сондай керемет рақымыңды, Жауларынан Өзіңді паналаған жандарды Құтқарасың ғой қолданып қуатыңды."},
	{8, "8 Көз қарашығыңдай мені сақтай көрші, Қанатыңның астында тасалай көрші."},
	{9, "9 Бас салған зұлымдардан мені қорғай гөр, Қоршаған жан алғыштардан сақтай гөр."},
	{10, "10 Жүректерінде жоқ мейірімділік, Ауыздарынан шыққандары — менмендік."},
	{11, "11 Соңымнан қуып олар қоршап алады, Жерге ұрып-соғу үшін қарайды қырағы,"},
	{12, "12 Олжасын паршалауды аңсаған арыстандай, Тасада аңдып тұрған мықты арыстандай."},
	{13, "13 Уа, Жаратқан Ие, енді көтеріле гөр, Қарсы шығып, бұл жауларды құлата гөр, Зұлымнан мені семсеріңмен құтқара гөр!"},
	{14, "14 О, Ием, күшті қолыңмен аман сақтай гөр, Жау тек осы дүниелік пайданы іздеп жүр. Жоғары бағалаған жандарыңды тоқ қыласың, Олардың балаларын да тойындырасың, Ұрпақтарына да жетер артып сыйлағаның."},
	{15, "15 Мен адал жүріп, бет-жүзіңді көремін, Оянып, көрінісіңе қарап сүйсінемін."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct kk17 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған. Жаратқан Иенің қызметшісі Дәуіттің жыры. Ол Жаратқан Иенің оны барлық жауларынан және Саулдың қолынан құтқарғанына арналған. Сонда Дәуіт былай деді:)"},
	{2, "2 Уа, Жаратқан Ие, Сені сүйемін, Сен күш-қуатымның қайнар көзісің."},
	{3, "3 Жаратқан — жартастай берік қорғаным, Мені қауіп-қатерден құтқарушым, Құдайым — сенім артқан шың құзым, Қалқандай қорғаушым, мықты құтқарушым, Әрі биік таудағыдай баспанам!"},
	{4, "4 Мадаққа лайық Жаратқанға сиынам, Ол мені арашалайды жауларымнан."},
	{5, "5 Өлім толқындары жан-жақтан құрсады, Заңсыздық тасқыны көміп тастады,"},
	{6, "6 Ажалдың шынжыры мені матады, Өлімнің торы бұғаулап шырмады."},
	{7, "7 Қатты қиналып Жаратқанға сиындым, Жәрдем сұрап Құдайыма жалындым. Киелі орнынан Ол құлақ салды, Жалынышым Оның алдына барды."},
	{8, "8 Сол заматта жер дірілдеп сілкінді, Таулардың негізі шайқалып дірілдеді, Өйткені Құдай қаһарына мінген еді."},
	{9, "9 Қаһарынан Оның түтін шықты, От лаулап, аузынан жалын атты, Ыстық шоқ ішінен атқылады."},
	{10, "10 Аспанды ашып Ол төмен түсті, Қара бұлттар болды аяғының асты,"},
	{11, "11 Мықты періштелерге мініп алды, Желдің қанаттарында зулап ұшты,"},
	{12, "12 Түнекті айналдыра перде қылды, Жаңбырдың қалың бұлттарын жамылды,"},
	{13, "13 Қасындағы нұрын бұлттар жасырды, Бұршақ жауып, найзағай жарқылдады."},
	{14, "14 Жаратқан Ие аспаннан күркіреп шақырды, Алла Тағаланың дауысы жаңғырықты."},
	{15, "15 Жебелер атқылап жауларын шашыратты, Найзағай жарқылдап оларды абдыратты."},
	{16, "16 Көрінді сонда теңіздің арналары, Әрі дүниенің негіздері ашылды, Уа, Жаратқан Ие, қатаң сөгісіңнен, Қаһарлы да құдіретті лебіңнен."},
	{17, "17 Көктен қолын созып, Ол мені ұстап алды, Терең судан Ием мені шығарып алды,"},
	{18, "18 Құтқарды мені мықты дұшпанымнан, Өзімнен қуатты қас жауларымнан."},
	{19, "19 Мүшкіл кезімде олар маған бас салды, Жаратқан Ие бірақ тірегім болды,"},
	{20, "20 Кең-байтақ жерге Ол мені шығарды, Маған риза болып аман құтқарды."},
	{21, "21 Адал жүрген мені Ием қолдады, Пәк істерім үшін игілік сыйлады."},
	{22, "22 Өйткені Жаратқанның жолымен жүрдім, Арсыз болып Құдайымнан безбедім."},
	{23, "23 Қайта, күллі шешімдері көз алдымда, Оның ережелерінен бас тартпаймын да."},
	{24, "24 Құдайдың алдында мінсіз болып келемін, Күнә жасаудан сақтанып жүремін."},
	{25, "25 Жаратқан маған берді әділдігіме қарай, Оның көз алдындағы пәк ісіме сай."},
	{26, "26 Ием, рақымды жанға рақым танытасың, Адал жанға адалдықпен қарайсың,"},
	{27, "27 Таза жүрген жанмен Өзің де тазасың. Арамзаға айламен жауап қайырасың."},
	{28, "28 Жәбір көрген жандарды құтқарасың, Бірақ менменді байқап, құлатасың."},
	{29, "29 Уа, Ием, маған шырақтай нұр шашасың, Уа, Құдайым, түнегімді жарық қыласың."},
	{30, "30 Сенің күшіңмен жау тобын жеңе аламын, Құдайыммен қамалдың үстіне шығамын."},
	{31, "31 Күмән жоқ, Құдайдың жолы мінсіз, Жаратқанның сөзі де еш мүлтіксіз. Құдайға сенім артқан бар жандарға Ол — қалқандай қорған әрі берік баспана."},
	{32, "32 Жаратқан Иеден басқа кім Құдай екен? Құдайымыздан басқа кім қорғайтын құз екен?"},
	{33, "33 Құдай мені күш-қуатқа бөлейді, Мінсіз өмір жолымен жетелейді,"},
	{34, "34 Аяғымды бұғыдай жүйрік қылады, Биік жерлерімде аман тұрғызады."},
	{35, "35 Ол қолдарымды дайындайды шайқасқа, Майыстырам тіпті қола садақты да."},
	{36, "36 Сен құтқаруыңды қалқандай сыйладың, Мені қолдайды құдіретті қолың, Жоғарылатады мені шапағатың."},
	{37, "37 Жолда қадамдарымды ұлғайтасың, Аяқтарымды таюдан сақтап қаласың."},
	{38, "38 Жауларымның артынан қуып жеттім, Бәрін құртпайынша кері келмедім."},
	{39, "39 Олар жеңіліп, қайта тұра алмады, Аяғымның астына менің құлады."},
	{40, "40 Шайқасуға маған күш-қуат сыйладың, Қарсыластарды алдыма бас ұрғыздың,"},
	{41, "41 Қалған жауларды қашуға мәжбүр қылдың. Мені жек көргендердің көздерін құрттым,"},
	{42, "42 Көмекке шақырды олар, ешкім құтқармады, Жаратқанға жалынды, Ол құлақ салмады."},
	{43, "43 Жауларды желмен ұшқан шаңдай ұнтақтадым, Далаға батпақтай лақтырып тастадым."},
	{44, "44 Сен мені халықтың бүлігінен құтқардың, Әрі басшысы етіп қойдың өзге ұлттардың. Бөтен халық енді маған қызмет етеді,"},
	{45, "45 Олар да айтқанымды екі етпейді, Бөгде ұлттар алдымда құлдық ұрады,"},
	{46, "46 Жат жұрттықтар қатты қорқып бозарады, Дірілдеп өз қамалдарынан шығады."},
	{47, "47 Жаратқан тірі! Құздай Қорғаушым мақталсын, Құтқарушы Құдайым лайым даңқталсын!"},
	{48, "48 Құдайым мүддемді қорғаған, Әрі халықтарды маған бағындырған,"},
	{49, "49 Жауымнан өзімді аман сақтап қалған. Жоғары қойдың мені қарсыластардан, Сен құтқарып алдың зорлықшылдардан."},
	{50, "50 Басқа халықтар арасында сондықтан, Уа, Жаратқан Ием, Сені мадақтаймын, Сенің атыңа ән-жырымды арнаймын."},
	{51, "51 Сен Өзіңнің тағайындаған патшаңа: Дәуітке және оның ұрпақтарына Ұдайы ұлы жеңістер сыйлайсың, Тұрақты мейіріміңді бағыштайсың."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct kk18 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің жыры.)"},
	{2, "2 Құдайдың салтанатты ұлылығын Аспан әлемі ашық паш етеді, Оның қолының керемет істерін Әуе кеңістігі де көрсетеді,"},
	{3, "3 Осыларды олар жариялайды күнде, Бұл білімді мәлімдейді әр түнде."},
	{4, "4 Сол үндерін естімеген бір тіл де, Ешқандай ұлт та қалмайтын болады."},
	{5, "5 Үндері жайылады бар жер бетіне, Сөздері жердің шетіне таралады. Құдай күнді аспанда орналастырған."},
	{6, "6 Күйеу жігіттей бөлмесінен шыққан Күннің жүзі де қуана нұрланады, Ол жүйріктей жарысуға құлшынады."},
	{7, "7 Көкжиектің бір шетінен күн шығады, Келесі шетіне өтіп айналады, Ештеңе де қызуынан тыс қалмайды."},
	{8, "8 Кемелді — Жаратқанның тағылымдары, Жан дүниені олар жаңартады. Ақиқат — Иеміздің жарлықтары, Олар наданды да дана қылады."},
	{9, "9 Әрі әділ — Жаратқанның бұйрықтары, Олар жүрекке қуаныш құяды. Жаратқанның өсиеттері сондай нұрлы, Көздерді ашып, жарқыратады."},
	{10, "10 Мойынсұна қастерлеу Жаратқанды: Осы таза ниет мәңгі қалады. Жаратқанның шешімдері шынайы, Барлығы мүлтіксіз де әділетті,"},
	{11, "11 Тіл үйірген таза балдан да тәтті, Алтыннан, саф алтыннан да бағалы."},
	{12, "12 Бұлардан пендең ескерту алады, Бәрін ұстанғанды зор сый тосады."},
	{13, "13 Кім байқайды өз теріс қылықтарын? Тазарта гөр, Ием, құпия күнәмнан,"},
	{14, "14 Сақтай гөр әдейі күнә жасаудан, Жамандық жүргізбесін билік маған! Сонда көз алдыңда мінсіз боламын, Ауыр күнәлардан да аулақ тұрамын."},
	{15, "15 Лайым менің аузымдағы сөздерім Әрі жан дүниемдегі ой-ниеттерім Ұнамды болсын Саған, о, Жаратқаным. Өзіңсің жартастай мықты Қорғаным Һәм Құтқарушым, уа, Жаратқан Ием."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct kk19 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің жыры.)"},
	{2, "2 Қиын-қыстау кезде Ием саған құлақ салсын, Жақыптың Құдайы бар пәледен сақтасын,"},
	{3, "3 Ол киелі үйінен саған көмек жіберсін, Сиондағы тұрағынан нығайта көрсін,"},
	{4, "4 Бар сый-тартуларыңды ескере көрсін, Өртелген құрбандығыңа да риза болсын. //"},
	{5, "5 Жүрегіңнің қалауын Құдай берсін, Бар ой-ниетіңді орындай көрсін."},
	{6, "6 Сонда жеңісіңе қуана әндетеміз, Құдайымыздың атынан ту көтереміз, Тілектеріңді қабыл алсын Иеміз."},
	{7, "7 Жаратқан Өзі тағайындаған Патшасын Аман сақтайтынын енді білемін, Жауап береді оған киелі көгінен, Құтқарады оны құдіретті қолымен."},
	{8, "8 Кейбір ұлт мақтанады күймелерімен, Басқалар мақтанады тұлпарларымен, Ал біз мақтанамыз Құдай Иемізбен."},
	{9, "9 Сол халықтар құлайды жығылып, Ал біз нық боламыз берік тұрып."},
	{10, "10 Уа, Жаратқан, патшамызға жеңіс сыйлай гөр, Сиынған кезімізде құлақ сала гөр."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct kk20 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің жыры.)"},
	{2, "2 Уа, Ием, құдіретіңе патша қуанады, Құтқарғаныңа шексіз шаттанады."},
	{3, "3 Оған жүрегінің қалауын сыйладың, Сұраған тілектерінен бас тартпадың. //"},
	{4, "4 Игіліктер сыйлап оны қарсы алдың, Саф алтыннан басына тәж кигіздің."},
	{5, "5 Өмірін сақтауды сұрағанда Өзіңнен Тіпті мәңгілік өмір сыйладың Сен."},
	{6, "6 Жеңіс беріп оны даңққа бөледің, Абырой мен салтанатқа кенелттің."},
	{7, "7 Сен патшаны мәңгілік жарылқадың, Қасыңда болу қуанышын сыйладың."},
	{8, "8 Себебі патша Жаратқанға сенім артады, Хақ Тағаланың рақымымен нық тұрады."},
	{9, "9 Өзіңді жек көргенді іздеп табасың, Бар жауыңды күшпен ұстап аласың,"},
	{10, "10 Келгеніңде отты пешке тастайсың, Уа, Ием, қаһарыңмен талқандайсың, Оттың жалынымен түгел жалмайсың."},
	{11, "11 Жау ұрпақтарын жер бетінен құртасың, Адамзат арасынан жоқ қыласың."},
	{12, "12 Олар саған қарсы қастандық ойлайды, Алайда соны орындай алмайды."},
	{13, "13 Жебе тартып беттерін нысана етсең, Оларды кері қайтуға мәжбүрлейсің."},
	{14, "14 Уа, Ием, көтеріле гөр құдіретіңмен, Күш-қуатыңды даңқтаймыз ән-күйменен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct kk21 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, Таң атқандағы жәрдем әуенімен айтылатын Дәуіттің жыры.)"},
	{2, "2 О, Құдайым, Құдайым менің! Неліктен мені жалғыз қалдырдың? Айқайлаған даусыма құлақ салмайсың, Мені құтқарудан неге алшақсың?"},
	{3, "3 Құдайым, күндіз шақырсам, жауап қатпайсың, Түнде де айқайлап, тыным таппаймын."},
	{4, "4 Бірақ Сен киелісің, Исраил халқың Сені мадақтайтын тағыңда отырасың."},
	{5, "5 Ата-бабамыз Өзіңе иланып жүрді, Сөзіңе сенді, Сен де азат еттің."},
	{6, "6 Саған сиынып, олар құтқарылды, Өзіңе сеніп ұятқа қалмады."},
	{7, "7 Ал мен адам емес, құрт іспетті қуатсызбын, Жұрт ұрсып, елемейді мені халқым,"},
	{8, "8 Көргендердің бәрі келекелейді, Басын шайқап, балағаттап былай дейді:"},
	{9, "9 Ол Жаратқанға үмітін артқан екен, Сол оны аман қалдырсын пәледен! Жаратқан Ие разы болса оған, Құтқарып алсын оны қиындықтан!"},
	{10, "10 Ал мені ана құрсағынан Сен шығардың, Жас кезімнен Өзіңе иландырдың,"},
	{11, "11 Туғаннан-ақ қолдауыңа мұқтажбын, Өмір бойы Сенсің Құдайым менің,"},
	{12, "12 Енді алыстай көрме менен Өзің. Себебі азап-бейнет қалды таяп, Қол ұшын берерім жоқ мені аяп."},
	{13, "13 Сүзеген бұқадай жау алды қоршап, Башандық бұқадай жан-жақтан қыспақтап,"},
	{14, "14 Ақырған арыстандай жемге құмартып, Аранын ашады, маған қарсы шығып."},
	{15, "15 Күшім судай төгіліп, таусылды құрғап, Сүйектерім буынынан қалды босап. Кеудемде жүрегім балауыз құсап Әбден балқып, елжіреп кетті босап."},
	{16, "16 Қыш құмыраның сынығына ұқсап Күшімнен айырылып қалдым қурап, Тілім қалды таңдайыма жабысып, Өлім топырағына бердің мені қиып!"},
	{17, "17 Төбеттердей жан-жақтан қыспақтады Сол жауыздар, лек-легімен қоршап алды, Аяқ-қолымды түйреп жаралады!"},
	{18, "18 Сүйектерімді шыға алам санап, Ал халық тұр маған қадала қарап."},
	{19, "19 Жау жамылғымды бөлісіп алады, Киімім үшін жеребе салады."},
	{20, "20 Уа, Ием, Сен менен алшақтай көрме, Күшім менің, тез келе гөр көмекке,"},
	{21, "21 Өмірімді аман сақтап семсерден, Құтқара гөр төбеттердің күшінен!"},
	{22, "22 Құлақ сап, құтқара гөр арыстанның Араны мен мүйізінен бұқаның."},
	{23, "23 Атыңды бауырларыма білдіремін, Қауым жиынында Сені дәріптеймін:"},
	{24, "24 Ей, Жаратқанды терең қастерлейтіндер, Оны әрдайым мадақтай беріңдер! Ей, Жақыптың бүкіл үрім-бұтағы, Жаратқанды ұдайы дәріптеңдер, Иә, Исраилдің бар ұрпақтары, Иемізді құрметтей беріңдер!"},
	{25, "25 Жарлының азабынан Ол жиренген жоқ, Құдай бет-жүзін одан жасырған жоқ, Қайта, құлақ салды шақырған даусына."},
	{26, "26 Сені мадақтаймын үлкен жиында, Уәдемді орындап халқыңның алдында,"},
	{27, "27 Жарлылар мейрамдап, тойынады да. Құдайға сиынғандар мақтау айтсын — Лайым жандарың аман-есен болсын!"},
	{28, "28 Жер шетіндегілер де мұны ескереді, Жаратқан Иеге бет бұрып дұға етеді, Бар ұлттардың әулеттері бас иеді,"},
	{29, "29 Себебі билік Жаратқанның қолында, Ұлттардың Иесі Сол болып қалады да!"},
	{30, "30 Жердің бар байлары тойына қатыспақ, Жаратқанның аяғына жығылып сиынбақ, О дүниеге аттанатын жандар — Өмірі өткінші бүкіл адамдар Оның алдында тізерлеп иілмек."},
	{31, "31 Келер ұрпақтар Оған қызмет етпек, Барлығы Иеміз туралы естімек,"},
	{32, "32 Содан Оның әділдігін дәріптеп, Жаңа туған халыққа да паш етпек. Себебі Құдай мұны бітірді Өзі істеп."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct kk22 poems[] = {
	{1, "1 (Дәуіттің жыры.) Жаратқан Ием — менің Бағушым, Мен еш нәрседен де тарықпаймын."},
	{2, "2 Ол мені жасыл жайлауға жаяды, Тұнық суға жетелеп апарады."},
	{3, "3 Ием жаныма күш дарытады. Есімі Қасиетті деп аталады, Содан артамын Оған сенімімді: Ол мені тура жолмен жетелейді."},
	{4, "4 Қап-қараңғы шатқалда жүрсем де мен, Қорықпаймын ешбір қауіп-қатерден, Себебі Өзің менің қасымдасың, Жігер береді сойылың мен таяғың."},
	{5, "5 Сен маған дастарқан жаясың Көз алдында дұшпандарымның, Мені құрметпен қарсы аласың, Тостағанды толтыра құясың."},
	{6, "6 Жақсылық пен мейірімділік Үлесім болады өмірлік, Жаратқан Иенің үйінде Мен қала беремін мәңгілік."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view23() {
struct kk23 poems[] = {
	{1, "1 (Дәуіттің жыры.) Жер жүзі мен ондағының бәрі Жаратқандікі, Бұл дүние мен онда тұрғандар түгел Онікі,"},
	{2, "2 Жердің негізін Ол теңіздің түбіне орнатты, Ағындардың үстінен берік етіп нығайтты."},
	{3, "3 Жаратқанның тауына кімнің шығуына болады, Оның киелі орнында кімнің тұруына болады?"},
	{4, "4 Бұл тек қолы мен жүрегі таза жанға болады, Жат тәңірге табынбай, жалған айтпайтынға болады."},
	{5, "5 Осындай жанды Жаратқан Ие жарылқайды, Құтқарушы Құдай оны рақыммен ақтайды."},
	{6, "6 Уа, Құдай, тек бұлар Сенің алдыңа барады, Жақып сиынған Құдай, олар Саған бет бұрады."},
	{7, "7 Ей, көне қақпалар, айқара ашылыңдар, Ежелгі есіктер, кеңінен ашылыңдар, Кіре алсын даңққа бөленген Патша!"},
	{8, "8 Кім екен осы даңққа бөленген Патша? Ол — құдіреті күшті Жаратқан Ие, Шайқаста құдіретті Жаратқан Ие!"},
	{9, "9 Ей, көне қақпалар, айқара ашылыңдар, Ежелгі есіктер, кеңінен ашылыңдар!"},
	{10, "10 Кім екен осы даңққа бөленген Патша? Әлемнің Иесі, Сол — даңқталған Патша! //"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view24() {
struct kk24 poems[] = {
	{1, "1 (Дәуіттің жыры.) Уа, Ием, жанымды Саған бағыштаймын,"},
	{2, "2 Я, Құдайым, Саған сенім артамын. Қалдыра көрме мені масқараға, Әрі жол берме жаудың табасына."},
	{3, "3 Саған сүйенген ешкім қалмайды ұятқа, Ал бекер сатып кеткендер болады масқара."},
	{4, "4 Уа, Ием, ақ жолыңды көрсете гөр, Еркіңе сәйкес жүруге үйрете гөр,"},
	{5, "5 Шындығыңа сай бағыттап, нұсқай гөр. Себебі Құтқарушы Құдайымсың Сен, Күні бойы Саған үміт артамын мен."},
	{6, "6 Уа, Жаратқан Ием, есіңе алшы Өзің көрсетіп келген ежелден бері Сарқылмас мейірімің мен рақымыңды."},
	{7, "7 Есіңе алмашы жас күнгі күнәмді, Кешіре гөр теріс қылықтарымды, Ескере гөр мейіріміңе сай мені, Уа, Ием, Сен рақымдысың өйткені."},
	{8, "8 Жаратқан Ие ізгі де әділетті, Сондықтан күнәкарға ақ жолды сілтейді,"},
	{9, "9 Кішіпейілді әділдікке бағыттайды, Әрі тура жолын оған нұсқайды."},
	{10, "10 Келісімнің ережелерін ұстанған жанды Жаратқан рақым әрі шындықпен бастайды."},
	{11, "11 Өз есіміңе сай, уа, Жаратқан Ие, Кешіре гөр сондай ауыр күнәмді."},
	{12, "12 Кім Жаратқан Иені терең қастерлейді? Таңдайтын жолын Ол соған көрсетеді."},
	{13, "13 Сондай адам игілікке кенеледі, Үрім-бұтағы жерін мұра етеді."},
	{14, "14 Иеміз Өзін қастерлейтіндерге сырын Ашады және білдіреді Келісімін."},
	{15, "15 Әрдайым Иеме тігемін көзімді, Жаудың торынан Ол босатады өзімді."},
	{16, "16 Рақыммен салсаңшы маған назарыңды, Жападан-жалғызбын, рухым жабырқаңқы."},
	{17, "17 Жүрегімнің қайғысы молайып келеді, Қиыншылықтан азат етсеңші мені."},
	{18, "18 Азап пен бейнетіме көңіл бөле гөр, Бүкіл күнәларымды кешіре гөр."},
	{19, "19 Жауларым қандай көп, назар сала көрші, Жауыздықпен олар мені жек көреді."},
	{20, "20 Құтқара гөр жанымды аман сақтап, Ұятқа қалмайын Сені паналап,"},
	{21, "21 Адалдық пен әділдік қорғасын мені, Өзіңе үміт артамын мен өйткені."},
	{22, "22 Уа, Құдайымыз, Өзің Исраилді Бар қиыншылықтан құтқара көрші."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view25() {
struct kk25 poems[] = {
	{1, "1 (Дәуіттің жыры.) Төрелік айтып мені ақташы Өзің, Уа, Жаратқан Ием, адал жүріп келемін, Саған сенім артып еш күдіктенбеймін."},
	{2, "2 Тексер мені, уа, Жаратқан, байқап көр, Жүрегім мен ой-санамды сынап көр."},
	{3, "3 Өйткені көз алдымда мейірімің, Сенің Ақиқат жолыңмен жүріп келемін,"},
	{4, "4 Өтірікшілермен бірге отырмаймын, Зымияндармен де бірге жүрмеймін."},
	{5, "5 Арамзалар жиынын еш жаратпаймын, Зұлымдармен ешқашан отырмаймын."},
	{6, "6 Қол жуып адалдығымды білдіремін, Құрбандық үстеліңді айналып жүремін,"},
	{7, "7 Уа, Ием, мадақтап Сені әндетемін, Керемет істеріңді паш етемін."},
	{8, "8 Сен тұратын қасиетті үйіңді, Ұлылығың мекендейтін орынды Сондай сүйемін, уа, Жаратқан Ие."},
	{9, "9 Күнәкарлармен бірге жанымды алма, Қанішерлермен бірге өмірімді құртпа."},
	{10, "10 Арам қылықтары қолдарын былғайды, Пара алып, беруден олар бас тартпайды."},
	{11, "11 Бірақ мен кінәратсыз таза жүремін, Құтқаршы мені рақымыңмен Өзіңнің."},
	{12, "12 Тегіс жерде табан басып нық тұрамын, Жиындарда Жаратқанға мақтау айтамын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view26() {
struct kk26 poems[] = {
	{1, "1 (Дәуіттің жыры.) Жаратқан — нұрым менің, құтқарушым да, Кімнен мен қорқамын солай болғанда? Жаратқан — өмірімнің берік қорғаны да, Кімнен үрейленемін солай болғанда?"},
	{2, "2 Мені жалмауға зұлымдар таяп қалса, Қарсылас, жауларым маған бас салса, Өздері-ақ сүрініп, жығылады да."},
	{3, "3 Мен қорықпаймын, әскер қоршап алса да, Үмітім үзілмес, ол маған лап қойса да."},
	{4, "4 Иемнен бір-ақ нәрсені сұрадым, Тек мынау ғана менің аңсағаным: Өмір бойы Оның үйінде болсам, Жаратқан Иенің көркіне қарасам, Ғибадатханасында ойланып-толғансам."},
	{5, "5 Өйткені менің басыма күн туғанда Ол тасалайды мені тұрағында, Жасырады өз құпия орнында, Аман сақтайды биік тау құзында."},
	{6, "6 Сонда қоршаған жауымнан биік тұрамын, Иемнің киелі үйінде шаттанамын, Қуана Оған сый-тартулар бағыштаймын, Ән-жырымды Жаратқан Иеге арнаймын."},
	{7, "7 Өзіңе сиынған даусыма құлақ түрші, Уа, Ием, рақыммен жауап бере көрші."},
	{8, "8 Сен Алдыма келіп, сиыныңдар дедің, Саған шын жүректен жауап беремін: Уа, Ием, сиынып алдыңа келемін."},
	{9, "9 Бет-жүзіңді жасыра көрме менен, Ашумен бас тартпа мендей пендеңнен. Қорғап-қолдаушым болып келесің Сен, Жалғыз қалдырып безіп кетпе менен, Уа, Құдайым, Құтқарушымсың Сен."},
	{10, "10 Бас тартса менен тіпті әке-шешем, Қабылдайды мені Жаратқан Ием."},
	{11, "11 Уа, Ием, жолдарыңды маған нұсқай гөр, Жауларыма бола ақ жолыңмен бастай гөр,"},
	{12, "12 Жаудың еркіне қалдыра көрме мені, Жалған куәлар өзіме қарсы көтеріледі, Ашумен маған қоқан-лоқы көрсетеді."},
	{13, "13 Алайда мен мынаған нық сенемін: Әлі де бұ дүниеде тірі жүремін, Жаратқан Иенің мейірімін көремін."},
	{14, "14 Әрдайым Жаратқанға арт сеніміңді, Батыл болып, нығайта түс жүрегіңді! Әрқашан Жаратқанға арт сеніміңді!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view27() {
struct kk27 poems[] = {
	{1, "1 (Дәуіттің жыры.) Саған сиынамын, уа, Жаратқан Ием, Жартастай берік қорғанымсың Сен, Бас тарта көрме маған жауап беруден. Егер де тіл қатып жауап бермесең, Қабірге түскендерге ұқсаймын мен."},
	{2, "2 Киелі үйіңе қарай қол көтеріп Жалбарынсам Сенен қолдау тілеп, Менің даусыма құлақ түре көрші."},
	{3, "3 Қылмыс жасайтын зұлымдармен бірге Маған өлімді бұйыра көрмеші. Басқалармен солар жылы сөйлескенмен, Олардың жүректері арамза әбден."},
	{4, "4 Соларға жасаған қылмыстарына сай, Істеген зұлым істеріне қарай Тиісті жазаларын тартқыза гөр, Лайықты қарымтасын қайтара гөр."},
	{5, "5 Иеміздің істерін олар елемейді, Оның жаратқандарын құрметтемейді, Сондықтан Ол соларды талқандайды, Енді қайтып оларды көтермейді."},
	{6, "6 Жаратқан Ие мақталсын әрқашан! Құлақ асты Ол даусыма жалынған."},
	{7, "7 Ием — күш-қуатым, қалқандай қорғаным, Шын жүректен Оған сенім артамын. Ол мені қолдады, қатты қуанады жүрегім, Иеме ән салып Оны дәріптеймін."},
	{8, "8 Жаратқан Ие — күш-қуаты өз халқының, Әрі Өзі тағайындаған патшасының Берік қорғаны аман-есен сақтайтын."},
	{9, "9 Уа, Жаратқан, халқыңды құтқара гөр, Меншікті қауымыңды жарылқай гөр, Бағушысы болып мәңгі көтере бер."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view28() {
struct kk28 poems[] = {
	{1, "1 (Дәуіттің жыры.) Ей, мықтылар, Жаратқанды дәріптеңдер, Иеміздің құдіретін құрметтеңдер,"},
	{2, "2 Жаратқанның есімін даңқтап қадірлеңдер, Қасиетті салтанатпен Оған бас иіңдер!"},
	{3, "3 Жаратқанның дауысы сулардың үстінде, Ұлылық Иесі — Құдай күркіреуде, Жаратқан гүрілдейді зор сулардың үстінде."},
	{4, "4 Жаратқанның даусы тым құдіретті, Жаратқанның даусы асқан айбатты."},
	{5, "5 Оның даусы самырсынды сындырады, Ливанның самырсындарын құлатады,"},
	{6, "6 Ливанның тауларын бұзаудай секіртеді, Хермон тауын жас бұқадай сілкінтеді."},
	{7, "7 Жаратқанның дауысы от-жалын шашады,"},
	{8, "8 Оның дауысы иен даланы шайқалтады, Қадештегі айдаланы да сілкінтеді."},
	{9, "9 Жаратқанның дауысы емендерді сілкілейді, Орман ағаштарының жапырақтарын түсіреді. Киелі үйінде бәрі Ұлылық! деп айтады."},
	{10, "10 Жаратқан топан су үстінде тақта отырады, Жаратқан патша болып мәңгі тақта отырады."},
	{11, "11 Жаратқан Ие өз халқына күш дарытады, Тыныштық сыйлап ақ батасын қондырады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view29() {
struct kk29 poems[] = {
	{1, "1 (Ғибадатхананы Құдайға бағыштау кезінде айтылатын Дәуіттің әні әрі жыры.)"},
	{2, "2 Уа, Жаратқан, даңқыңды асырамын, Сен мені шыңыраудан алып шықтың, Жауларыма мені табалатпадың."},
	{3, "3 О, Құдай Ием, мен Саған сиындым Қолдау сұрап, сонда мені сауықтырдың."},
	{4, "4 Уа, Ием, мені көрден алып қалдың, Ажалдан жанымды арашаладың."},
	{5, "5 Ей, Жаратқан Иеге бағышталғандар, Оған арнап ұдайы ән шырқаңдар, Оның киелі атын мадақтаңдар!"},
	{6, "6 Өйткені Ол бір-ақ сәт ашуланады, Ал рақымы өмір бойы ұласады. Кешке жылап-сықтау басым болады, Ал таң ата қуаныш тосып тұрады."},
	{7, "7 Аман-сау болғанда мақтанған едім: Мен ешқашан да толқымаймын! дедім."},
	{8, "8 Ал мені таудай нығайтқан Сенің рақымың. Кейін бет-жүзіңді менен жасырдың, Сонда мен қорқып уайымға салындым."},
	{9, "9 Уа, Жаратқан Ием, Саған сиындым, Қолдау сұрап Өзіңе жалбарындым:"},
	{10, "10 Өліп, көрге түсуімнен не пайда, Топырақ сонда Сені мадақтар ма, Адалдығыңды Сенің жариялар ма?!"},
	{11, "11 Құлақ түрші, уа, Ием, рақым ете гөр, О, Жаратқан Ие, қолдаушым бола гөр."},
	{12, "12 Қайғымды шаттық биімен алмастырдың, Азалы киімімді шешіп тастадың, Ерен қуанышқа мені бөледің."},
	{13, "13 Енді үздіксіз Саған ән саламын, Уа, Құдай Ием, мәңгі мақтау айтамын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view30() {
struct kk30 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің жыры.)"},
	{2, "2 Өзіңді паналаймын, уа, Жаратқан, Ұятқа қалдырмашы мені ешқашан, Сен әділсің, мені алып қалшы аман."},
	{3, "3 Құлақ түріп маған, тез құтқара көрші, Бас сауғалар құз бен қорғаным бола көрші."},
	{4, "4 Өйткені жартасым, берік қамалымсың, Жетелеп бастай гөр ізгілігің үшін,"},
	{5, "5 Шығаршы мені жау құпия құрған тордан, Себебі Сен берік қорғансың маған."},
	{6, "6 Сенің қолыңа рухымды тапсырамын. Уа, Ием, шынайы Құдай, Сен мені құтқардың."},
	{7, "7 Жек көрем түк пайдасыз тәңірсымақтарды Әрі оларға табынған адамдарды, Ал Жаратқан Иеге нық сенемін,"},
	{8, "8 Қуанып, шаттанамын рақымыңа Сенің, Сен байқадың мүшкіл халімді менің, Жанымның азабына көңіліңді бөлдің."},
	{9, "9 Сен мені қалдырмадың жаудың қолына, Қайта, мені тұрғыздың ашық орынға."},
	{10, "10 Рақым ете гөр, қиналып тұрмын, Уа, Ием, күйіктен солды жанарым, Зор қасіреттен әлсіреді жан-тәнім."},
	{11, "11 Ғұмыр жасым қайғыдан қысқаруда, Күңіреніп өмірім таусылуда, Күнәма бола күш-қуатым қайтуда, Сүйектерімнің күші кетіп қуаруда."},
	{12, "12 Көршілеріме жек көрініштімін, Таныстарыма да қорқыныштымын, Мені көре қалса қашады далада, Осындай болдым жауларыма бола."},
	{13, "13 Өлгендей-ақ олар мені ұмытқан, Ұқсаймын қыш ыдысқа сынып қалған."},
	{14, "14 Көп естимін өзім жайлы өсек-аяң, Қауіп төніп тұр басыма жан-жақтан, Жауларым маған қарсы сөз байласуда, Жанымды алуға жоспар құруда."},
	{15, "15 Ал мен Өзіңе сенемін, уа, Жаратқан, Сен менің Құдайымсың деймін Саған."},
	{16, "16 Өмірім Сенің қолыңда, я, Жаратқан, Құтқара гөр қуғындаған жауларымнан."},
	{17, "17 Бет-жүзіңнің нұрын маған түсіре гөр, Мейіріміңе сай мені құтқара гөр."},
	{18, "18 Мені ұятқа қалдырма, уа, Жаратқан, Себебі жалбарынып жүрмін Саған. Зымияндар масқараланатын болсын, Үндері өшіп, олар қабірге қойылсын,"},
	{19, "19 Қарысып қалсын ауыздары жалған, Менмен паңдықпен әділді жамандаған."},
	{20, "20 Уа, Ием, қандай мол Сенің ізгілігің: Өзіңді қастерлеп, паналайтындар үшін Соны сақтап, жұрт алдында сыйлайсың."},
	{21, "21 Сен пана болып әділді қорғайсың, Өз саяңда аман-есен сақтайсың Адамдардың астыртын әрекетінен Әрі ұрсып айыптайтын тілдерінен."},
	{22, "22 Маған мейірімін көрсеткені үшін, Қоршалған қалада қорғағаны үшін Жаратқан Ие әрдайым мадақталсын!"},
	{23, "23 Қорқыныштан былай деп уайымдадым: Сірә, Сенің назарыңнан тыс қалдым! Бірақ Сен жалынған даусыма құлақ түрдің, Сиынған мінажатыма жауап бердің."},
	{24, "24 Жаратқанды сүйіңдер, бар әділдері, Иеміз аман сақтайды адал пенделерді, Ал молынан жазалайды менмендерді."},
	{25, "25 Жаратқанға сенім артқандардың бәрі, Қайратқа кенеліп, батыл болыңдар енді!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view31() {
struct kk31 poems[] = {
	{1, "1 (Дәуіттің насихат жыры.) Әділетсіз істері кешірілген, Барлық күнәларынан ақталған Қандай бақытты әрбір жан!"},
	{2, "2 Иеміз мойнына кінә артпайтын, Жан дүниесінде жалғандық болмайтын Қандай бақытты әрбір жан!"},
	{3, "3 Күнәмді айтқым келмеп еді, Сонда аяқ-қолым сырқырай берді, Ыңқылдап жүрдім күні бойы."},
	{4, "4 Себебі күні-түні Сенің қолың Зілдей боп үстімде жатты менің. Сол кезде жаздың аптабы семдірген Көк шөпке ұқсап солып қалдым мен. //"},
	{5, "5 Сонда алдыңда күнәмді мойындадым, Әділетсіздігімді енді жасырмадым. Жаратқанға кінәмді ашық айтам дедім, Сен сонда барлық күнәмді кешірдің."},
	{6, "6 Сондықтан Өзіңе адал жүрген жан Пәлеге тап болғанда, сиынсын Саған. Тіпті топан судай апат келгенмен, Ажалдан құтылады ол аман-есен."},
	{7, "7 Сен баспанамсың пәледен сақтайтын, Құтқарылғаныма қуана ән шырқаймын. //"},
	{8, "8 Мен саған ақыл-кеңес беремін, Жүретін жолыңды көрсетемін. Сені таса қылмай көзімнен, Әрдайым жетелеп жүремін Мен."},
	{9, "9 Ақылсыз ат пен есектей қасарма, Ауыздық, жүген саласың оларға, Әйтпесе бағынбай жүрер олар да."},
	{10, "10 Құдайсыз жан көп қасірет шегеді, Ал Жаратқанға сенімін артқан пендені Оның берік рақымы қоршай береді."},
	{11, "11 Иемізге қуаныңдар, әділдер, шаттаныңдар! Шын жүректен адалдар, қуана ән салыңдар!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view32() {
struct kk32 poems[] = {
	{1, "1 Әділдер, қуана мақтаңдар Жаратқанды, Адал жандардың мақтауы жарасымды."},
	{2, "2 Жаратқанды домбырамен мадақтаңдар, Он ішекті жетігенмен күй тартыңдар,"},
	{3, "3 Оған бағыштап жаңа ән айтыңдар, Мәнерлеп ойнап, шаттана айқайлаңдар!"},
	{4, "4 Өйткені Жаратқанның сөзі шынайы, Ол бар істерін адалдықпен жасайды,"},
	{5, "5 Иеміз әділет пен әділдікті қалайды, Оның рақымына толы жердің барлығы."},
	{6, "6 Жаратқанның сөзімен аспан жаралды, Аузының лебімен жұлдыздар да жасалды."},
	{7, "7 Теңіздің суларын Ол жинап, шек қойды, Түпсіз мұхитты қоймаларына құйды."},
	{8, "8 Күллі жер Жаратқан Иені қастерлесін, Әлемнің бар халқы Оны құрметтесін,"},
	{9, "9 Өйткені Ол сөз айтқанда орындалды, Бұйрық бергенде бар болып, берік тұрды."},
	{10, "10 Иеміз бағынбайтын ұлттардың ойларын Шайқалтып, жояды арамза жоспарларын."},
	{11, "11 Жаратқанның жоспары мәңгі берік тұрады, Бар ұрпақтарға ниеті нық сақталады."},
	{12, "12 Құдайы — Жаратқанға сиынған ұлт бақытты, Ол меншігіне таңдаған халық жарылқаулы!"},
	{13, "13 Жаратқан Ие көктен жерге қарар, Сонда күллі адамзатты көзімен шолар,"},
	{14, "14 Өз тағынан жер тұрғындарын байқар."},
	{15, "15 Ол бәрінің жүректерін жаратты, Бүкіл істерін толық ұғынады."},
	{16, "16 Патшаны қалың жасағы құтқармайды, Жауынгер зор күшімен қорғана алмайды,"},
	{17, "17 Тұлпар да құтқаруға жарамайды, Ерен күшімен де құтылта алмайды."},
	{18, "18 Бірақ Өзін терең қастерлейтіндерге, Рақымына үмітін жүктегендерге Назарын салады Жаратқан Ие"},
	{19, "19 Оларды ажалдан құтқару үшін, Ашаршылықта аман сақтау үшін."},
	{20, "20 Жаратқанға шын көңілден сенім артамыз, Ол — қолдаушымыз, қалқандай қорғаушымыз."},
	{21, "21 Жүрегіміз шаттанады Иемізге, Кәміл сенеміз киелі есіміне!"},
	{22, "22 Үмітіміз Өзіңде, уа, Жаратқан Ие, Берік мейіріміңмен жар бола гөр бізге."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view33() {
struct kk33 poems[] = {
	{1, "1 (Дәуіттің жыры. Ол Дәуіттің Әбимәлік алдында есуас болғансып, соның қасынан қуылып, құтылып кеткен оқиғасына арналған.)"},
	{2, "2 Жаратқан Иені мадақтаймын әр уақытта, Оны мақтаған жыр ұдайы жүрсін аузымда."},
	{3, "3 Тәңір Иені шын жүректен тұтамын мақтан, Байғұс бейшаралар естіп, қуансын соған."},
	{4, "4 Келіңдер, бірге Жаратқанды мадақтайықшы, Бірігіп Оның есімін марапаттайықшы!"},
	{5, "5 Жаратқанға сиындым, Ол жауап берді маған, Әрі азат етті мені бар қорқынышымнан."},
	{6, "6 Жаратқанға сиынып көз тіккендер жайнайды, Олар шаттанып, еш масқара болмайды."},
	{7, "7 Жарлы болған мен жалбарындым Жаратқанға, Ол естіп, бар пәлемнен құтқарды сонда."},
	{8, "8 Иені қастерлейтіндерді қоршап тұрады Оның періштесі, ол соларды құтқарады."},
	{9, "9 Жаратқанның ізгілігіне көз жеткізіңдер, Қандай бақытты Оған сенімін жүктегендер!"},
	{10, "10 Қастерлеңдер Иені, Оның қасиеттілері! Жоқшылық қинамайды Оны қастерлейтіндерді."},
	{11, "11 Арыстандар азыққа зәру жүре алады, Ал Иеге сенгендер бар игілікке тояды."},
	{12, "12 Келіңдер, балалар, тыңдаңдар сөзімді, Үйретемін сендерге Иемізді қастерлеуді."},
	{13, "13 Сендердің қайсыларың өмірді ұнатасыңдар, Жақсы күндерді көптеп көруді қалайсыңдар?"},
	{14, "14 Онда жаман сөз ауыздарыңнан шығармаңдар, Өтірік айтудан да әрқашан сақтаныңдар!"},
	{15, "15 Жамандықтан бас тартып, жақсылықты жасаңдар, Татулыққа ұмтылып, сол үшін күш салыңдар!"},
	{16, "16 Жаратқан Ие әділдерге назар аударады, Өзіне жалынған оларға құлақ салады."},
	{17, "17 Ал сұмдық жасайтындарға Жаратқан қарсы шығады, Есімдерін із-түзсіз жер бетінен жоқ қылады."},
	{18, "18 Әділдер жалынса, Иеміз құлақ салады, Күллі қиындықтан оларды құтқарып алады."},
	{19, "19 Жүрегі жаралыға Жаратқан жақын тұрады, Жаны күйреп, күнәсіне өкінгенді құтқарады."},
	{20, "20 Әділ жан қиындықты көп көреді, Ал Иеміз оны бәрінен азат етеді,"},
	{21, "21 Оның барлық сүйектерін аман сақтайды, Тіпті бірде-біреуі сындырылмайды."},
	{22, "22 Сұрқияның зұлымдығы түбіне жетер, Әділді жек көрген жан зардабын шегер."},
	{23, "23 Жаратқан Ие құтқарады өз құлдарын, Ол соттамайды Өзін паналағандарын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view34() {
struct kk34 poems[] = {
	{1, "1 (Дәуіттің жыры.) Менімен ерегісіп келгендермен Сен Өзің ерегісе гөр, уа, Ием. Маған қарсы күресіп келгендермен Сен Өзің күресе гөр, уа, Ием."},
	{2, "2 Сауыт киіп, қалқаныңды қолыңа алшы, Мені қолдап айқасуға дайындалшы."},
	{3, "3 Семсер суырып, қуғыншыларды бөгеші, Мен Құтқарушыңмын! деп жаныма жігер берші."},
	{4, "4 Жанымды алмақ жаулар ұятқа қалсын, Мені құртуға әрекет еткендер жасырын Енді кері қайтып, әбден масқаралансын!"},
	{5, "5 Олар жел өтіндегі қауыздай шашырасын, Жаратқанның періштесі айдап шықсын,"},
	{6, "6 Жолдары қараңғы да тайғақ болсын, Иә, Жаратқанның періштесі қуғындасын!"},
	{7, "7 Өйткені олар жазықсыз маған тор құрды, Еш айыпсыз маған арнап ор қазды."},
	{8, "8 Сондықтан оларға кенет ажал жетсін, Маған құрған торына өздері түссін, Осылайша өз бастары құрып кетсін."},
	{9, "9 Сонда мен Жаратқанға шаттанамын, Мені құтқарған Иеме қуанамын,"},
	{10, "10 Жан-тәніммен Оны былай деп мақтаймын: Күшсіз жанды күштіден қорғайтын, Бейшара кедейді тонаушыдан сақтайтын Саған кім тең келер, уа, Жаратқаным?"},
	{11, "11 Ал мені айыптайды жалған куәлар, Мен білмейтін жайттарды тергеп сұрар."},
	{12, "12 Жақсылығыма жамандықпен қайтарар, Жан дүниемді қаңыратып бос қалдырар."},
	{13, "13 Ал олар ауырған кезде мен де қайғырдым, Ораза ұстап жанымды қалжыраттым, Жаратқанға олар үшін жалбарындым. Жауапсыз қайтқанда сол мінажатым,"},
	{14, "14 Олар үшін дос-жарандай қамықтым, Анамды жоқтағандай бас иіп қайғырдым."},
	{15, "15 Алайда мен сүрінгенде олар қуанды, Айыптауға маған қарсы жиналды, Бейхабар мені үздіксіз даттады,"},
	{16, "16 Арсыз мазақтаушылармен бас қосты, Маған қарсы тістерін қайрап бақты."},
	{17, "17 Уа, Жаратқан, бұған төзесің қашанғы? Сол кәрлі арыстандардан жалғыз жанымды Құтқаршы, һәм зұлымдықтарынан ғұмырымды."},
	{18, "18 Мен үлкен жиында Сені даңқтаймын, Көп халықтың алдында Сені мақтаймын."},
	{19, "19 Себепсіз жауым болған жандар қуанбасын, Кінәсіз мені жек көргендер табаламасын!"},
	{20, "20 Татулық сөзін олар еш қозғамайды, Елдегі бейбіт жұртқа сұмдық жоспарлайды."},
	{21, "21 Арандарын кең ашып маған мін тағады: Рас, біз сенің жамандық жасағаныңды Өз көзімізбен көрдік деп айыптайды."},
	{22, "22 Уа, Жаратқан, мұны көрдің, үнсіз қалма, О, Ием, Сен менен еш қашықтама,"},
	{23, "23 Тұрып, мені қорғауға ұмтыла гөр, Уа, Ием, Құдайым, мүддемді қорғай гөр,"},
	{24, "24 Әділдігіңе сай мені ақтай гөр, Уа, Құдай Ием, табаламасын олар!"},
	{25, "25 Жақсы екен бұл, дәл көңілдегідей, Енді оны жеп құртамыз тірідей! Деп ойлай алмасын сол зұлым жандар."},
	{26, "26 Менің мүшкіл халіме қуанғандар Бәрі ұятқа қалып, масқаралансын, Өздерін менен тым жоғары қойғандар Қара бет болып, ұятқа орансын."},
	{27, "27 Ал қалағандар ақталуымды менің Шаттана дауыстап қуанышқа кенелсін. Қызметшісіне амандығын сүйсіне сыйлаған Жаратқан Иеміз мадақталсын әрқашан! Деп дәріптей берсін олар тоқтамастан."},
	{28, "28 Күн сайын мен де Сені мақтап дәріптеймін, Әділдігіңді бар халыққа паш етемін."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view35() {
struct kk35 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, Жаратқан Иенің қызметшісі Дәуіттің жыры.)"},
	{2, "2 Зұлымның заңсыздығы жайлы жүрегімнің Түкпірінен шыққан ойды былай деймін: Оның ниеті жоқ Құдайды қастерлейтін."},
	{3, "3 Күнәсін ұғып, жек көргеннен гөрі Жағымпазданады ол өзіне-өзі."},
	{4, "4 Зұлымдық пен өтірік — айтқан сөздері, Жақсылық жасауды ойлағысы келмейді,"},
	{5, "5 Төсекте жатып та сұмдық жоспарлайды, Теріс жолмен жүріп, күнәдан бас тартпайды."},
	{6, "6 Ал, Ием, көктей шексіз Сенің рақымың, Бұлттардай заңғар Сенің адалдығың!"},
	{7, "7 Таулардай айбынды Сенің әділдігің, Тұңғиықтай терең Сенің шешімдерің. Сен адам мен хайуанның екеуін де Қамқорлап келесің, я, Жаратқан Ие."},
	{8, "8 Уа, Құдай, Сенің рақымың қандай қымбат, Қанатыңның астын паналайды адамзат,"},
	{9, "9 Әлеміңнің игілігіне тойдырасың, Өзеніңнің рақатына қандырасың."},
	{10, "10 Өйткені өмірдің қайнары Өзіңсің, Жарықты көреміз нұрыңда Өзіңнің."},
	{11, "11 Сені білетіндерге рақымыңды төкші, Адал жандарға шындығыңды көрсетші."},
	{12, "12 Менмендерге мені таптата көрмеші, Зұлымдарға да қудалата көрмеші."},
	{13, "13 Әне, қылмыскерлер орындарынан құлады, Қайтып тұрмастай төменге лақтырылды!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view36() {
struct kk36 poems[] = {
	{1, "1 (Дәуіттің жыры.) Арамзаларға ренжіп ашуланба, Жамандық жасайтындарға қызықпа,"},
	{2, "2 Олар шөп сияқты жылдам солады, Көк шөптей тез қурап, өліп қалады."},
	{3, "3 Жаратушыға сеніп жақсылық жаса, Еліңде тұрып адалдықты сақта,"},
	{4, "4 Жаратқан Иеңнен тап рақатыңды, Ол сыйлайды ізгі жүрек қалауыңды."},
	{5, "5 Өмір жолыңды тапсыр Тәңір Иеге, Оған сүйеніп сеніміңді жүкте, Ол сен үшін әрекет етеді де:"},
	{6, "6 Жайнатады әділдігіңді таңғы нұрдай, Ісіңнің ақтығын тал түскі күндей."},
	{7, "7 Шыдамды бол Жаратқанның алдында, Шешімін күт сабырмен, еш асықпа! Арам жоспарын іске асырған жанға, Табысқа жеткен зұлымға ашуланба!"},
	{8, "8 Ашу-ызаңнан қайт, бас қаһарыңды, Сұмдыққа өршітпесін олар жаныңды."},
	{9, "9 Зұлымдық жасаушылар жойылып кетер, Иемізге сенушілер елді иемденер."},
	{10, "10 Көп ұзамай зұлым адам ғайып болар, Іздесең таппайсың, орны босап қалар."},
	{11, "11 Ал кішіпейіл жандар елді иеленер, Бейбіт өмірдің рақатына мол сүйсінер."},
	{12, "12 Арсыз жан әділге жамандық ниеттенер, Менсінбей оны, тіс қайрап жек көрер."},
	{13, "13 Бірақ Иеміз онысына тек күледі, Сот күнінің таяп қалғанын біледі."},
	{14, "14 Семсерін суырып, садағын тартты сұмдар, Жарлыны құлатып, адалды құртпақ олар,"},
	{15, "15 Ал семсерлері өз жүректеріне қадалар, Садақтары сындырылып, талқандар."},
	{16, "16 Әділдің қолындағы аздың өзі Көп зұлымның қолындағы молдан ізгі."},
	{17, "17 Себебі зұлымның күші жойылады, Бірақ әділді Жаратқан нығайтады."},
	{18, "18 Мінсіздерге Жаратқан күнде көз салады, Мұралық меншіктері мәңгі сақталады,"},
	{19, "19 Ауыр күнде мінсіздер масқара болмайды, Тіпті аштық кезінде тамағын тоя жейді."},
	{20, "20 Жаратқанның жаулары жойылады, Зұлымдар даланың көркіндей солады, Жайылған түтіндей тез ғайып болады."},
	{21, "21 Арсыз жан қарыз алып, қайтармайды, Әділ жан мүсіркеп, қамқорлайды."},
	{22, "22 Иеміз жарылқағандар жерді мұралайды, Ал Оның қарғағандары қырғынға ұшырайды."},
	{23, "23 Әділдің қадамын Жаратқан нығайтады, Жүрген өмір жолын Ол ұнатады,"},
	{24, "24 Сүрінсе әділ жан, біржола құламайды, Жаратқан оны қолынан демеп қолдайды."},
	{25, "25 Жас та болдым, енді міне, қартайдым, Көрмедім әділ жанның бейшара болғанын, Ұрпағының қайыршы боп нан сұрағанын."},
	{26, "26 Қайта, күнде жаны ашып қарыз береді, Ұрпағы да елге игілік әкеледі."},
	{27, "27 Жамандықтан без, ұдайы жақсылық істе, Сонда өмір бойы тұрасың еліңде."},
	{28, "28 Себебі Жаратушы әділдікті қалайды, Өзіне бағышталған жаннан бас тартпайды. Сондайды Ол мәңгі аман-есен сақтайды, Ал сұмның ұрпағы қырғынға ұшырайды."},
	{29, "29 Әділдер осылай елді иеленеді, Өмір бақи оны мекен етеді."},
	{30, "30 Әділ жанның аузынан даналық шығады, Тілімен ол әрдайым әділдік айтады,"},
	{31, "31 Жүрегінде Құдайының заңы қалады, Әділдік жолында аяғы нық болады."},
	{32, "32 Арамза адам әділді торып аңдиды, Оның көзін құртудың амалын іздейді,"},
	{33, "33 Ал Иеміз әділді арамзаға қалдырмайды, Оған әділге қарсы үкім шығартпайды."},
	{34, "34 Жаратқанға сүйеніп, Оның жолымен жүр, Ол сені көтеріп елді иелентер, Зұлымдардың құрығанын саған көрсетер."},
	{35, "35 Бұтағын жайып, тереңге тамырлаған Зор ағаштай сұм да қатал жанды байқағам,"},
	{36, "36 Енді міне, ол уақыты өтіп жоқ болған, Іздесем де, оны мүлдем таба алман."},
	{37, "37 Мінсізді бақыла, әділге қара: Зор болашақ бар бейбіт адамда,"},
	{38, "38 Бірақ заңсыздар түгел құртылады, Сұмдардың болашағы қырғын болады."},
	{39, "39 Әділдерді Жаратқан құтқарып алады, Пәлеге тап болса, оларға пана болады,"},
	{40, "40 Жаратушы оларды қолдап құтқарады, Зұлымдардың қолынан босатып алады, Өйткені әділдер Оған үміт артады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view37() {
struct kk37 poems[] = {
	{1, "1 (Басына түскен жағдайын Құдайдың есіне салған Дәуіттің жыры.)"},
	{2, "2 Уа, Жаратқан, қаһарланып сөге көрме, Ашуланып мені жазалай көрме."},
	{3, "3 Өзің атқан жебелерің денеме кірді, Қолың зілдей басты менің үстімді."},
	{4, "4 Қаһарыңнан денемде сау жерім жоқ, Күнәмнан жан-тәнімде тыныштық жоқ."},
	{5, "5 Істеген күнәларым басымнан асты, Ауыр жүктей денемді жерге жанышты."},
	{6, "6 Ақымақ істерімнің кесірінен Жараларым іріңдеп, иістенген,"},
	{7, "7 Иіліп кеттім тұла бойым бүгіліп, Күні бойы жүремін қайғы шегіп."},
	{8, "8 Белім менің ісіп кетіп қабынған, Денемде сау жерім жоқ ауырмаған."},
	{9, "9 Әбден әлсіреп, шалдығып-шаршаймын, Жан азабынан қатты ыңқылдаймын."},
	{10, "10 Уа, Ием, Саған аян барлық қалауым, Құпия емес Саған ыңқылдауым,"},
	{11, "11 Жүрегім аласұрып, құрыды қуатым, Көз жанарым суалып, қашты нұрым."},
	{12, "12 Дос-жарандарым жарамнан қашқақтап, Жақын туыстарым да тұр алшақтап."},
	{13, "13 Жанымды алмақ жаулар тұзақ құрады, Дұшпандар ажалым туралы айтады, Күн сайын қастық жайлы ақылдасады."},
	{14, "14 Ал мен саңыраудай құлақ аспаймын, Мылқау сияқты жағымды ашпаймын,"},
	{15, "15 Осылай құлағы естімес адамдаймын, Аузынан жауап шықпас мылқаудаймын."},
	{16, "16 Өйткені, Жаратқан Ие, Өзіңе сенем, Сен жауап бересің, уа, Құдай Ием."},
	{17, "17 Сонда мен былай деп ойлаған едім: Дұшпандарым мені табаламасын, Сүрініп құласам, олар паңданбасын."},
	{18, "18 Себебі жақын қалдым мен құлауға, Азабым әрдайым көз алдымда."},
	{19, "19 Әділетсіз ісімді мойындаймын, Жасаған күнәма қайғырудамын."},
	{20, "20 Ал көп жауларым сергек жүріп күшеюде, Себепсіз мені жек көретіндер көбеюде,"},
	{21, "21 Жақсылығыма олар жамандық қайырады, Ізгі жолмен жүргеніме қарсы шығады."},
	{22, "22 Уа, Ием, мені жалғыз тастай көрме, О, Құдайым, менен алыстай көрме."},
	{23, "23 Асыға гөр маған көмек беруге, Құтқарушым менің, уа, Жаратқан Ие."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view38() {
struct kk38 poems[] = {
	{1, "1 (Ән-күйдің жетекшісі Едутунге арналған Дәуіттің жыры.)"},
	{2, "2 Өзіме былай дедім: Мен сақ жүрейін, Тіліммен күнә жасаудан безейін, Әділетсіз жан қасымда тұрғанда Тіліме берік бұғау салайын да."},
	{3, "3 Осылай аузымды ашпай үндемедім, Тіпті жақсылық жайлы да сөйлемедім, Содан күшейе түсті қасіретім."},
	{4, "4 Жүрек жалындап, ойымда от тұтанды, Тілімнен отты сөздер ағытылды:"},
	{5, "5 Көрсете гөр, Ием, ғұмырымның соңын, Көрер күндерімнің бүкіл санын, Өмірімнің өткіншілігін ұғайын."},
	{6, "6 Бір қарыстан ұзақ емес өмірім, Қас қағым сәт — ғұмыр жасым Сен үшін. Рас, алған деміндей әлсіз — пенде өмірі! //"},
	{7, "7 Адамдар өмірден елестей өтеді, Мал-мүлік мол жинап бекер күйбеңдейді, Себебі соның кімге тиерін білмейді."},
	{8, "8 Ал қазір, уа, Ием, нені тосамын? Тек Өзіңе үмітімді артамын."},
	{9, "9 Заңсыз істерімнен мені арылта гөр, Зердесіздің қорлауынан сақтай гөр."},
	{10, "10 Мен ауызымды ашып, еш үндемеймін, Өйткені осыны жасаған Сен Өзіңсің."},
	{11, "11 Бұйырған азапты ала гөр менен, Қолыңның соққысынан әлсіредім мен."},
	{12, "12 Күнәсі үшін жазаласаң пендені, Күйе жеп қойғандай таусылар көрігі, Рас, алған деміндей әлсіз — пенде өмірі! //"},
	{13, "13 Мінажатыма, уа, Ием, құлақ түрші, Көмекке шақырған даусымды естіші, Менің көз жасымды елемей жүрмеші, Себебі барлық ата-бабама ұқсаймын, Жат жерлік кірме болып Өзіңмен тұрамын."},
	{14, "14 Маған қарап тұрмашы ашуменен, Қайтадан көңілді болайын мен, Ғайып болмас бұрын кетіп бұл өмірден."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view39() {
struct kk39 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің жыры.)"},
	{2, "2 Нық сүйеніп келемін Жаратқан Иеме, Бұрылып, құлақ түрді Ол өтінішіме."},
	{3, "3 Жаратқан Ием қорқынышты шұңқырдан Мені тартып шығарды әрі батпақтан; Дәу тастың үстіне тұрғызды аяғымды, Нық, қауіпсіз қылды қадамдарымды."},
	{4, "4 Ол жаңа ән-жырды маған айтқызды, Мадақтаймын әрдайым Құдайымызды. Мұны көрген көпшілік Жаратқанды Қастерлеп, Оған сенімін артады."},
	{5, "5 Менмендердің қолдауын сұрамайтын, Жалғанға сүйенгендерге бет бұрмайтын, Қайта, тек Жаратқанға сенімін артқан Әркім — өмір бақи қандай бақытты жан!"},
	{6, "6 Уа, Құдай Ием, көп керемет жасадың, Біздің игілігімізді Сен ойлап тұрсың. Игі істеріңді айтуға тырыссам, Көптігі сонша, санауға жетпейді сан: Саған тең келе алмас бірде-бір жан!"},
	{7, "7 Құрбандықтар мен сый-тартуларды қаламадың, Бірақ маған Өзіңе құлақ салғыздың. Шалып, өртелетін не күнәнің құнын Өтейтін құрбандықтарды талап қылмадың."},
	{8, "8 Сонда мен былай дедім: Міне, келе жатырмын, Шиыршық кітапта мен туралы жазылған:"},
	{9, "9 Сенің еркіңді орындауға құштармын, Уа, Құдайым, жүрегімде Сенің тағылымың."},
	{10, "10 Үлкен жиында әділдікті уағыздадым, Ием, Сен білесің, мен үнсіз қалмадым,"},
	{11, "11 Іште жасырмадым әділ хабарыңды: Сенімділігің мен құтқаруыңды, Рақымың мен ақиқатыңды Өзіңнің Үлкен жиналыста айтпай кетпедім."},
	{12, "12 Мені мейіріміңнен айырмашы, о, Ием, Рақым мен шындығың мені қорғасын лайым."},
	{13, "13 Сансыз пәлелер маған жан-жақтан лап берді, Жасаған күнәларым мені қуып жетті, Соларға бола жолымды көре алмаймын. Басымдағы шашымнан көп саны олардың, Содан үмітім үзіліп, жүрексіз болдым."},
	{14, "14 Уа, Ием, рақым етіп мені құтқара гөр, Маған көмекке тездетіп келе гөр."},
	{15, "15 Жанымды алмақ болған бар жауларым Таңдана абыржып, ұятқа қалсын, Маған пәле тілеген бар дұшпандарым Масқараланып кері қайтарылсын!"},
	{16, "16 Өзіңе де сол керек! деп табалаған Олар қатты ұялып, таңғалсын соған."},
	{17, "17 Бірақ бет бұрып сиынғандар Саған Өзіңе қуана берсін шат-шадыман, Лайым құтқаруыңды ұнатқан әркім: Иеміз даңқты! деп Сені дәріптесін!"},
	{18, "18 Ал мен жарлымын, мұқтаждықта жүрмін, Уа, Ием, Сен жағдайымды ойлайсың. Қолдаушым да құтқарушым Өзіңсің, Кешіге көрмеші, о, Құдайым менің."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view40() {
struct kk40 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің жыры.)"},
	{2, "2 Жарлының қамын ойлайтын жан бақытты! Ауыр күнде Иеміз оны құтқарады,"},
	{3, "3 Әрі қорғап, өмірін аман сақтайды, Жаратқан оны елде жарылқайды, Жауларының еркіне беріп қоймайды."},
	{4, "4 Ауырса ол, Иеміз оған күш береді, Төсектегі оның халін түзетеді."},
	{5, "5 Иеме былай деп мінажат еттім: Рақымды бола гөр, уа, Жаратқан Ием, Саған қарсы күнә жасаған едім, Сауықтыра гөр жан дүниемді менің!"},
	{6, "6 Дұшпандарым жамандап былай дейді: Қашан анау өліп, аты өшеді?"},
	{7, "7 Біреуі маған кіріп-шықса, жалған сөйлейді, Шынымен ол тек өсек-аяң жинайды, Барған жерлерінде сонысын жаяды."},
	{8, "8 Мені жек көргендердің барлығы Өзара маған қарсы сыбырласады, Былай деп жамандық ойластырады:"},
	{9, "9 Қатерлі ауру жабысыпты оған, Ол мәңгі тұрмайды жатқан орнынан!"},
	{10, "10 Тіпті дастарқандас боп нанымды жеген Сырлас досым, өзім толықтай сенген, Енді мені теуіп жіберу үшін Маған қарсы көтерді өз өкшесін."},
	{11, "11 Ал Сен, уа, Ием, рақымды бола гөр, Сауықтырып орнымнан тұрғыза гөр, Оларға лайықтысын қайтарайын."},
	{12, "12 Жауымның мені жеңіп шықпағанынан Ұғамын Сенің риза екеніңді маған."},
	{13, "13 Адал жүрген мені аман сақтайсың, Көз алдыңа мәңгі орнатқызасың."},
	{14, "14 Исраил сиынатын Құдай Ие Мадақтала берсін мәңгілікке! Аумин, иә, аумин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view41() {
struct kk41 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Қорах ұрпақтарының насихат жыры.)"},
	{2, "2 Марал қалай аңсаса мөлдір суды, О, Құдай, жаным солай Сені аңсайды."},
	{3, "3 Жаным шын Құдайды іздеп шөліркейді, Қашан мен Құдайыма бара аламын, Қашан Оның алдында бола аламын?"},
	{4, "4 Көз жасымды көл қыламын күндіз-түні, Себебі адамдар менен күні бойы: Құдайың қайда? деп сұрай береді."},
	{5, "5 Сырымды Саған ақтарған кезімде Мынау бірден түседі менің есіме: Мен көпшілікті жетелеген едім, Құдайдың үйіне қарай өрледім, Мейрамдаған халықпен бірге жүрдім, Шат-шадыман болып шүкірлік еттім."},
	{6, "6 Жан дүнием, неге сен мұңаясың, Бойымда алаңдап, неге мазасызсың? Жалғыз Құдайдан үмітіңді үзбе! Өйткені Құтқарушымды — өзімнің Құдайымды мадақтаймын әлі де."},
	{7, "7 Мұңаяды ішімдегі жан дүние. Мен Иордан жағасындағы елде, Хермон, Мизар тауларының жерінде Аңсап ойлайтын боламын Сені."},
	{8, "8 Сарқыраған суларың долданғанда Ұласа береді тасқын тасқынға, Сенің бар суларың, толқындарың да Мені басып, асып кетіп жатты да."},
	{9, "9 Жаратқан күндіз рақым жасап маған, Мен Оны түнде мақтап, жырлап шығам, Һәм мінажаттарымды бағыштаймын Құдайыма Өзіме өмір сыйлаған."},
	{10, "10 Маған жар болып келген Құдайдан: Неліктен Сен мені есіңнен шығардың? Неліктен мен қысым көріп жауымнан, Сонша қайғырып жүрмін? деп сұраймын."},
	{11, "11 Дұшпандарымның табалаған мазағы Жаныма менің қатты батады, Себебі олар менен күні бойы: Құдайың қайда сенің? деп сұрайды."},
	{12, "12 Жан дүнием, неге сен мұңаясың, Бойымда алаңдап, неге мазасызсың? Жалғыз Құдайдан үмітіңді үзбе! Өйткені Құтқарушымды — өзімнің Құдайымды мадақтаймын әлі де."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view42() {
struct kk42 poems[] = {
	{1, "1 Уа, Құдай, үкім шығарып мені ақташы, Бұл мейірімсіз халықтан мені қорғашы, Әділетсіз өтірікшілерден құтқаршы!"},
	{2, "2 Өйткені Сен бас сауғалайтын қорғанымсың, Неден менен бас тартып, жалғыз қалдырдың? Неге жаудан қиналып жүруге тиіспін, Не үшін қайғы-қасірет шегуге мәжбүрмін?"},
	{3, "3 Нұрың мен шындығыңды жіберші, уа, Ием, Олар киелі тауыңа маған жол көрсетсін, Мені Өзің мекендейтін орынға жетелесін,"},
	{4, "4 Сонда Саған арналған құрбандық үстеліне, Әрі шаттығым мен рақатымның көзіне — Уа, Құдайым, Өзіңнің алдыңа барамын, Жетігенмен Саған, Құдайым, мақтау айтамын."},
	{5, "5 Жан дүнием, неге сен мұңаясың, Бойымда алаңдап неге мазасызсың? Жалғыз Құдайдан үмітіңді үзбе! Өйткені Құтқарушымды — өзімнің Құдайымды мадақтаймын әлі де."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view43() {
struct kk43 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Қорах ұрпақтарының насихат жыры.)"},
	{2, "2 Уа, Құдай, Өзіңнің зор құдіретіңмен Ежелде бабалардың заманында істеген Керемет істерің жайлы құлағымызбен Көп естігенбіз әкелерімізден."},
	{3, "3 Қыңыр ұлттарды Сен елден қуып шықтың, Ал бабаларымызды орнықтырдың. Сол тайпаларды Сен езіп тастадың, Ал бабаларымызды азат қылдың."},
	{4, "4 Бабалар елді семсерімен басып алған жоқ, Әрі білек күштерімен жеңіп шықкан жоқ, Мұны істеген — Сенің ұлы құдіретің, Һәм бет-жүзіңнің нұры: Сен рақым көрсеттің."},
	{5, "5 Сен менің Патшам әрі Құдайымсың, Жақыптың халқына құтқарылу сыйлайсың,"},
	{6, "6 Сенімен жауларымызды соққылаймыз, Сенің атыңнан дұшпанды таптаймыз."},
	{7, "7 Садағыма артпаймын мен сенімімді, Құтқара да алмайды семсерім мені,"},
	{8, "8 Жауларымыздан Сен бізді құтқарасың, Бізді жек көргендерді масқара қыласың."},
	{9, "9 Күн сайын Құдайды айтып мақтанамыз, Атыңды мәңгілік мадақтайтын боламыз. //"},
	{10, "10 Ал қазір бізді тастап, ұятқа қалдырдың, Сен жасағымызбен бірге аттанбадың,"},
	{11, "11 Жауымыздан қашуға мәжбүр қылдың, Дұшпандарға бізді тонатып қойдың,"},
	{12, "12 Сойылатын қой іспетті бізді тапсырдың, Халықтар арасына шашыраттың,"},
	{13, "13 Өз халқыңды арзанға сатып жібердің, Біздің құнымызды әбден түсірдің."},
	{14, "14 Көршілерімізге бізді қорлаттың, Маңымыздағыларға мазақтаттың,"},
	{15, "15 Қыңыр ұлттардың қорлауына қалдырдың, Оларға бізді елетпей бас шайқаттың."},
	{16, "16 Масқарамыз күнде алдымыздан шығады, Халқымыз ұяттан қара бет болады,"},
	{17, "17 Жалақордың ұрысын естіп тұрамыз, Кек алмақ жаудың бетін көріп тұрамыз."},
	{18, "18 Осының барлығына ұшырадық, Алайда біздер Сені ұмытпадық, Сенің Келісіміңді де бұзбадық."},
	{19, "19 Жүрегіміз Сенен бас тартқан да жоқ, Аяғымыз жолыңнан тайған да жоқ."},
	{20, "20 Сонда да Сен бізді талқандап қираттың, Елімізді шибөрінің тұрағы еттің, Ажал қаупін бастарымызға төндірдің."},
	{21, "21 Егер Құдайымыздың атын ұмытсақ, Бөтен тәңірге қол жайып сиынсақ,"},
	{22, "22 Құдай мұны әлде білмес пе еді? Ол жүректің құпияларын да біледі!"},
	{23, "23 Ал Сен үшін жау бізді күнде жоюда, Сойылатын қой деп бізге қарауда."},
	{24, "24 Уа, Жаратқан, неге жатырсың ұйқыда? Серпіліп, бас көтере гөр бізді қорғауға, Бізден бас тарта көрмеші біржолата!"},
	{25, "25 Неге бізден бет-жүзіңді жасырасың, Қайғы мен жәбірімізді ұмытасың?"},
	{26, "26 Өйткені ажал аузында жандарымыз, Әрі жерге жабысуда тәндеріміз."},
	{27, "27 Тұрып орныңнан, бізді қолдай гөр, Рақымыңа бола бізді құтқара гөр."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view44() {
struct kk44 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, қызғалдақтар әуенімен айтылатын Қорах ұрпақтарының насихат жыры әрі махаббат әні.)"},
	{2, "2 Патшаға арнап әнімді айтқанда Жүрегімнен ізгі сөз құйылуда, Тілім ұқсас хатшының жүйрік қаламына."},
	{3, "3 Сен әсемсің күллі адам баласынан, Мейірімді сөз ағылады аузыңнан, Құдай Сені мәңгілікке жарылқаған."},
	{4, "4 Уа, батыр, семсеріңді асынып ал, Зор даңқ пен ұлылыққа бөленіп ал."},
	{5, "5 Осы салтанатыңмен жеңіске аттан Ақиқат, кішіпейілдік, әділдік үшін, Мықты оң қолың ғажап істер істесін."},
	{6, "6 Жебелерің үшкір, олар патшаның Жауларының жүрегіне дәл қадалсын, Барлық ұлттар да аяғыңа жығылсын."},
	{7, "7 Сенің тағың, о, Құдай, сақталады мәңгілік, Патшалығыңа жүргізесің әділ билік,"},
	{8, "8 Заңсыздықты жек көріп, әділдікті сүйесің, Сондықтан да Құдай, өз Құдайың сенің, Өзіңді тағайындап, сыйлады саған Серіктеріңнен гөрі шаттықты молынан."},
	{9, "9 Хош иісті сенің күллі киімдерің Мүр, алоэ, дәмқабық гүлінің жұпарымен, Көңіліңді көтереді сазды әуен Сарайларыңда піл сүйегімен безенген."},
	{10, "10 Сенің құрмет тұтатын жұбайларың Арасында бар қыздары патшалардың. Оң жағыңда отыр опырлық саф алтын Әшекейлер тағып алған патшайымың."},
	{11, "11 Тыңда, қызым, ұғып ал, тос құлағыңды: Ұмыт шыққан әулетің мен халқыңды,"},
	{12, "12 Патша аңсап қалайды сұлулығыңды, Ол тақсыр иең сенің, ардақта оны!"},
	{13, "13 Тир қаласы сыйлығын алып келеді, Елдің байлары ықыласыңды іздейді."},
	{14, "14 Қалыңдық ханшаң отыр өз бөлмесінде Алтын кестелі көйлегі бар үстінде,"},
	{15, "15 Түрлі түсті киімімен әкелінеді, Құрбы қыздары соңынан ілеседі, Барлығы да Сенің алдыңа келеді,"},
	{16, "16 Зор қуаныш, шаттықпен бастап әкелінеді, Патшалық сарайыңа салтанатпен енеді."},
	{17, "17 Ұлдарың орнын баспақ аталарыңның, Бүкіл елге оларды әкім етіп қоясың."},
	{18, "18 Бар ұрпақтарға сыйлатамын есіміңді, Халықтар дәріптейді мәңгі Өзіңді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view45() {
struct kk45 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған. Сопрано дауыспен айтылатын Қорах ұрпақтарының жыры.)"},
	{2, "2 Құдай — біздің панамыз да күшіміз, Қиын кезде сенімді көмекшіміз."},
	{3, "3 Сол себептен біз уайымдап қорықпаймыз, Тіпті дүниенің астан-кестені шықса да, Таулар теңіздің тұңғиығына құласа да,"},
	{4, "4 Теңіз долдана ақ көбік атқыласа да, Оның толқынынан тау сілкініп жатса да. (Әлемнің Иесі біздің жанымызда, Жақып сиынған Құдай — биік қорғанымыз да!) //"},
	{5, "5 Құдайдың таңдап алған қаласына, Алла Тағаланың киелі тұрағына Оның рақымы бұлақтың суындай Әрқашан да нәр беріп қуантуда."},
	{6, "6 Құдай осы қаланың ортасында, Ешқашан қозғалмайды да сол қала, Құдай көмегін береді таң ата."},
	{7, "7 Халықтар абыржи толқып, Патшалардың тақтары шайқалады, Алла Тағаланың үні естіліп, Бүкіл жер беті балқып жоқ болады."},
	{8, "8 Әлемнің Иесі біздің жанымызда, Жақып сиынған Құдай — биік қорғанымыз да! //"},
	{9, "9 Келіп көріңдер Иенің істерін, Ол ойрандатты жаулардың жерлерін,"},
	{10, "10 Дүниедегі соғыстарды тоқтатып, Садақ, найза атаулыны сындырып, Күймелерді қиратты отқа жағып."},
	{11, "11 Тынышталыңдар барлығың енді, Біліңдер Менің Құдай екенімді! Басқа халықтар Мені құрметтейді, Дүние жүзінде Мені қастерлейді."},
	{12, "12 Әлемнің Иесі біздің жанымызда, Жақып сиынған Құдай — биік қорғанымыз да! //"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view46() {
struct kk46 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Қорах ұрпақтарының жыры.)"},
	{2, "2 Күллі ұлттар, Құдайға қол соғыңдар, Шаттық үнмен дауыстап Оны мақтаңдар!"},
	{3, "3 Себебі Жаратқан — Хақ Тағала айбатты, Ол — бүкіл жер бетінің ұлы Патшасы"},
	{4, "4 Бізге халықтарды бағындырады, Жау ұлттарды табанымызға салады."},
	{5, "5 Үлесімізге таңдады Ол біз үшін Өзі сүйген Жақыптың мақтаулы елін. //"},
	{6, "6 Құдай Ие халқының шаттық айқайымен Тұрағына көтерілді, һәм керней үнімен."},
	{7, "7 Әндетіңдер, Құдайға ән-жыр шырқаңдар, Күй тартып та Патшамызды мадақтаңдар!"},
	{8, "8 Құдай — Патшасы күллі жер бетінің, Лайым Оған айтыңдар мадақтау жырын!"},
	{9, "9 Құдай халықтарға билігін орнатты, Киелі тағына Ол отырып алды."},
	{10, "10 Басқа ұлттардың басшылары жиналар, Ыбырайым сиынған Құдайдың халқына қосылар, Өйткені Құдайдікі жер бетінің патшалары, Оның дәрежесі бәрінікінен де жоғары!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view47() {
struct kk47 poems[] = {
	{1, "1 (Қорах ұрпақтарының әні әрі жыры.)"},
	{2, "2 Құдайдың таңдап алған қаласында, Оның қасиетті Сион тауында Жаратқан Иеміз теңдессіз ұлы, Ол мадақталуға әбден лайықты!"},
	{3, "3 Әсем де биік Сион тауы — Күллі әлемнің қуанышы, Таудың солтүстік жағындағы Ұлы Патшаның астанасы."},
	{4, "4 Бекіністі сарайларында Құдай Белгілі қорғаушы, баспанадай."},
	{5, "5 Патшалар күштерін жинаған еді, Шайқасқа бірігіп аттанған еді."},
	{6, "6 Олар қаланы көріп, аң-таң болды, Үрейленіп, түгел қаша жөнелді,"},
	{7, "7 Бойларын қорқыныш кернеді, Толғатқан әйелдей қиналды."},
	{8, "8 Теңіз кемелерін шығыстың дауылы Қиратқандай, құрттың Сен оларды."},
	{9, "9 Құлағымызбен мынаны естіген едік, Әлем Иесінің қаласынан соны көрдік, Иә, Құдайымыздың осы шаһарынан: Өз қаласын нығайтады Ол әрқашан."},
	{10, "10 Уа, Құдай, ғибадатханаңда Ойландық мейірімің жайында,"},
	{11, "11 Уа, Құдайым, Сенің атың да, Саған арналған мадақтау да Жердің төрт бұрышына жайылады, Құдіретті қолың әділдік орнатады."},
	{12, "12 Сенің әділ билігіңе бола Шаттанады Сион тауы да, Қуанады Яһуда қалалары да."},
	{13, "13 Сионға жақындап барыңдар, Шаһарды айналып шығыңдар, Барлық мұнараларын санаңдар,"},
	{14, "14 Қамалдарына назар аударыңдар, Сарайларын да қарап шығыңдар. Келер ұрпаққа мынаны айтыңдар:"},
	{15, "15 Бұл Құдай — мәңгілік Құдайымыз, Деміміз біткенше Ол — жетекшіміз!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view48() {
struct kk48 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Қорах ұрпақтарының жыры.)"},
	{2, "2 Күллі халықтар, мынаны тыңдаңдар, Әлемнің тұрғындары, құлақ асыңдар,"},
	{3, "3 Қатардағылар және атақтылар, Байлар мен бейшаралар, ден қойыңдар!"},
	{4, "4 Даналық сөздер шығады аузымнан, Жүрек толғанысым түсінікке толған,"},
	{5, "5 Нақыл сөзге құлағымды саламын, Домбыра тартып жұмбағымды ашамын."},
	{6, "6 Қиын-қыстау кезде қорықпаймын, Қоршаса да мені алдамшылардың Зұлымдығы: әл-ауқаттарына олар Сүйеніп, зор байлығымен мақтанар."},
	{7, "8 Ал адам жанын пенде ажалдан босатпас, Оның төлемін Құдайға бере алмас."},
	{8, "9 Адамның мәңгі өмір сүруі үшін, Қабірге түсіп, шірімеуі үшін Төлем төлеп босатудың бағасы Тым қымбат, істей алмас оны адам баласы."},
	{9, "11 Данышпанның да өлгенін жұрт көреді, Дәл солай ақымақ пен ессіз де өледі, Мал-мүлкін басқаға қалдырғанын біледі."},
	{10, "12 Ессіздердің ойынша мәңгі өз үйлері, Ұрпақтан ұрпаққа сақталар мекендері Әрі өз аттарымен аталған жерлері."},
	{11, "13 Ал қадірлі адам да мәңгі қалмайды, Өліп құритын хайуанға ұқсайды."},
	{12, "14 Міне, бұл — ақымақтың жүрер жолдары, Сөздерін қолдайды ізбасарлары. //"},
	{13, "15 Олар қойлардай өлімге ұшырар, Ажал олардың бағушысы болар, Тәндері құрып, қабірді мекендер, Ал таңертең әділдер үстемдік етер."},
	{14, "16 Бірақ Құдай жанымды о дүниеден құтқарады, Ол мені Өзіне қабылдайтын болады. //"},
	{15, "17 Уайымдама, біреу баи қалғанда, Үйінің салтанаты тым молайғанда,"},
	{16, "18 Өлгенде ол өзімен еш нәрсе алмайды, Салтанаты оған еріп бармайды."},
	{17, "19 Тірі кезде ол бақытты сезінетін, Өркендегенде жұрт оны дәріптейтін."},
	{18, "20 Бірақ ол да бабаларына аттанады, Өмірдің нұрынан енді ада болады."},
	{19, "21 Байлығына мастанған ақылсыз жан Іспетті — кейін өліп құритын хайуан."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view49() {
struct kk49 poems[] = {
	{1, "1 (Асафтың жыры.) Құдіреті шексіз Құдай — Жаратқан Үн қатып, батысқа дейін күншығыстан Әлемдегі адамзатты шақырған."},
	{2, "2 Мүлтіксіз көрікті Сион тауынан Құдайдың салтанаты көрініс тапқан."},
	{3, "3 Құдайымыз келеді, Ол үнсіз қалмайды, Оның алдынан от жалындап жалмайды, Алапат дауыл айналасында соғады."},
	{4, "4 Құдай көк пен жерді куәлікке шақырады, Өзі таңдаған халқын соттауға барады:"},
	{5, "5 Қасыма жинаңдар Менің сенімді халқымды, Құрбандық шалып Өзіммен Келісім жасағандарды!"},
	{6, "6 Көк сонда Оның әділдігін паш етеді, Себебі соттайтын — Құдайдың Өзі."},
	{7, "7 Тыңда Мені, Исраил халқым, былай деймін: Саған қарсы куәлік келтіремін, Мен Құдаймын, иә, сенің Құдайыңмын!"},
	{8, "8 Шалған малдарың үшін шағым айтпаймын, Өртеп ұсынған құрбандықтарыңа қараймын."},
	{9, "9 Ал қаламаймын бұқаларды қораларыңнан Яки текелерді шарбақтарыңнан,"},
	{10, "10 Өйткені орманның әр аңы Менікі, Әрі малдар да мыңдаған төбедегі,"},
	{11, "11 Барлық құсты білемін таулардағы, Хайуандар да Менікі даладағы."},
	{12, "12 Ашықсам Мен саған айтпас та едім, Бар әлем мен ондағылар — өз меншігім."},
	{13, "13 Шалынған бұқаның етін жеймін бе, Не текелердің қанын ішемін бе?"},
	{14, "14 Жоқ, тарту қылып мақтау ұсын Құдайға, Берген сертіңді орында Алла Тағалаға."},
	{15, "15 Қиындық көргеніңде шақыр Мені, Сонда құтқарып аламын сені, Ал өзің мадақтайтын боласың Мені."},
	{16, "16 Бірақ Құдай былай дейді арамзаға: Қандай қақың бар жарлықтарымды айтуға Және Келісімімді аузыңа алуға?"},
	{17, "17 Алайда сен ескертуімді жек көресің, Айтқан сөздерімді менсінбей жүресің."},
	{18, "18 Ұрыны көрсең оған қосыласың, Нәпсіқұмарлармен де араласасың."},
	{19, "19 Сенің аузыңнан жамандық шығады, Тілің өтірікті торлап тұрады."},
	{20, "20 Отырып алып бауырыңды ғайбаттайсың, Өз анаңның ұлын нақақ жамандайсың."},
	{21, "21 Сен солай істегенде Мен үндемедім, Сонда Мені өзіңдей есептедің. Ал қазір Мен сені сақтандырамын, Күнәларыңды көз алдыңа қоямын."},
	{22, "22 Құдайын ұмытқандар, ұғыңдар бұл жайды: Жазалап, паршаласам, ешкім құтқармайды."},
	{23, "23 Мені мақтайтын жан құрмет көрсетеді Маған, Сақтанып жүргенге құтқаруымды ашам."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view50() {
struct kk50 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің жыры,"},
	{2, "2 Барсабиямен жақындасып күнәға батқан Дәуітке Натан пайғамбар келген оқиғаға байланысты мінажат.)"},
	{3, "3 Шексіз сүйіспеншілігіңе бола, О, Құдай, маған рақым ете гөр, Мейіріміңнің молдығына бола Қылмыстарымды өшіріп тастай гөр."},
	{4, "4 Мені әділетсіздігімнен арылтып, Күнәларымнан түгел тазарта гөр."},
	{5, "5 Қылмыстарымды жақсы білемін де, Күнәларым әрдайым тұр есімде."},
	{6, "6 Мен Өзіңе қарсы күнә жасадым, Сенің көз алдыңда зұлымдық істедім. Осылай әділ Сенің айтқандарың, Мүлтіксіз де маған жүргізген сотың."},
	{7, "7 Мен күнәкар болып дүниеге келдім, Құрсақта жатқанда-ақ күнәкар едім."},
	{8, "8 Сен жүректің таза болуын қалайсың, Жан дүниеме даналық та құясың."},
	{9, "9 Құрбандық қанын бүркіп, күнәмді кеше гөр, Сонда көз алдыңда пәк таза боламын, Күллі күнәмнан мені жуып-шая гөр, Сонда қардан да аппақ тазарамын."},
	{10, "10 Шаттық үнін маған қайтадан естірте гөр, Сен әлсіреткен денемді қуанта гөр,"},
	{11, "11 Күнәларыма енді назар аудармай, Бар қылмыстарымды өшіріп тастай гөр."},
	{12, "12 Уа, Құдайым, жүрегімді тазарта гөр, Рухымды берік қылып, жаңарта гөр."},
	{13, "13 Қасыңнан мені қуып шыға көрме, Киелі Рухыңды менен ала көрме,"},
	{14, "14 Мені құтқарғаныңа қуантып тағы, Сыйлай гөр азғырылмайтын берік рухты."},
	{15, "15 Қылмыскерлерге ақ жолыңды үйретейін, Күнәкарлар сонда Саған бұрмақ беттерін."},
	{16, "16 Қан төккен мені арылтсаңшы кінәмнан, Сенсің ғой жалғыз Құтқарушы Құдайым. Тіліммен әділдігіңді мадақтаймын."},
	{17, "17 Аузыма ерік бере гөр, Жаратқан Ием, Сені емін-еркін мадақтап, дәріптейін."},
	{18, "18 Құрбандық шалуымды қаламай тұрсың, Өртеу құрбандығын да ұнатпай тұрсың, Әйтпесе оларды ұсынар да едім."},
	{19, "19 Ал Құдайға ұнамды сый, құрбандық — Күнәсіне шынымен өкінген рух. Шын опық жеп, бағынған жүрекке Сен Теріс қарамайсың, уа, Құдай Ием."},
	{20, "20 Игі еркіңмен Сионды өркендете гөр, Қамалын оның қайта тұрғыза гөр."},
	{21, "21 Сонда Саған ұнамды пәк тартулар Шалынбақ һәм өртелетін құрбандықтар, Үстеліңе торпақтар да ұсынылмақ, Сенің жолыңа солар бағышталмақ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view51() {
struct kk51 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің насихат жыры."},
	{2, "2 Ол едомдық Доиқтың Саулға барып, Дәуіттің Ахимәліктің үйіне кіріп-шыққаны жайлы хабар жеткізген кезіне арналған.)"},
	{3, "3 Ей, мықты жан, қылмысыңа неге мақтанасың, Әйтсе де Құдай маған төгеді рақымын. Ұзақты күн сен құрту жайлы ойланасың."},
	{4, "4 Өткір ұстарадай тіледі сенің тілің, Өтірікті айтуға шеберсің өзің,"},
	{5, "5 Зұлымдықты артық көресің жақсылықтан, Алдауды да ақиқатты айтудан. //"},
	{6, "6 Ей, алдамшы тіл, сен өзгенің жанын Жаралайтын сөзді айтуды ұнатасың!"},
	{7, "7 Содан да Құдай сені мәңгі құртады, Үйіңнен күшпен қуып шығарады, Тірілер арасынан аластатады. //"},
	{8, "8 Әділдер мұны көріп қайран қалады, Былай деп келекелейді сол арамды:"},
	{9, "9 Міне, Құдайды паналамаған жан, Қайта, мол байлығын арқа тұтқан, Зұлымдықпен одан бетер нығайған."},
	{10, "10 Ал мен Құдайдың киелі үйінің Ішінде жасыл зәйтүндей өсіп-өнемін, Құдайдың рақымына мәңгі сенемін."},
	{11, "11 Уа, Ием, Сені игі істерің үшін Халқыңның алдында дәріптеймін, Ізгі мейіріміңе сүйенемін."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view52() {
struct kk52 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, Ауыртпалық шегу әуенімен айтылатын Дәуіттің насихат жыры.)"},
	{2, "2 Ақылсыз адамдар Құдай жоқ! деп ойлайды, Әбден бұзылған олар жексұрындық жасайды, Әрі ешқайсысы да жақсылық жасамайды."},
	{3, "3 Құдай көктен көз салады адамзатқа: Ақылды біреу бар ма бет бұратын Құдайға? Деп байқайды Ол."},
	{4, "4 Жоқ, бәрі тайып кетті теріс жолға, Әбден бұзылды бірігіп барлығы да. Жақсылық жасаушы ешкім жоқ, тіпті бір жан да."},
	{5, "5 Сұмдық жасайтындар ақылға келмес пе екен? Халқымды олар нан жегендей жалмап кеткен, Құдайға сиыну ойларына еш түспеген."},
	{6, "6 Ал оларды қорқыныш құрсаулайтын болады, Қауіп-қатер жоқ жерде үрейлері ұшады. Тап берген жауыңның сүйектерін Құдай шашады, Сен масқаралайсың Құдай бас тартқан оларды."},
	{7, "7 Құтқару Сионнан келсе екен Исраилге! Құдай өз халқын тұтқыннан азат еткенде Жақыптың үрім-бұтағы қатты қуанады, Иә, Исраил халқы шат-шадыман болады!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view53() {
struct kk53 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, ішекті аспаптардың сүйемелдеуімен айтылатын Дәуіттің насихат жыры."},
	{2, "2 Зифтің бірнеше тұрғынының Саулға барып: Дәуіт біздің жақта тығылып жүрген сияқты! деп хабар жеткізген кезіне арналған.)"},
	{3, "3 Уа, Құдай, ұлы атың үшін құтқара гөр, Зор құдіретіңмен мүддемді қорғай гөр!"},
	{4, "4 О, Құдайым, дұғама құлақ сала гөр, Аузымнан шыққан сөздерге көңіл бөле гөр!"},
	{5, "5 Бөгде адамдар маған қарсы шықты, Зорлықшыл сұмдар жанымды алмақшы, Олар еш ойламайды Құдай туралы. //"},
	{6, "6 Алайда Құдай маған жар болады, Жаратқан Ие жан дүниемді нығайтады,"},
	{7, "7 Сұмдығының есесін жауыма қайтарады. Ием, адалдығыңа сай оларды талқандашы."},
	{8, "8 Өз еркіммен Саған құрбандық шаламын, Уа, Ием, ізгі атыңа мақтау айтамын."},
	{9, "9 Сен құтқарып алдың мені бар пәледен, Жауларымның жеңілгенін көрдім көзіммен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view54() {
struct kk54 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, ішекті аспаптардың сүйемелдеуімен айтылатын Дәуіттің насихат жыры.)"},
	{2, "2 Уа, Құдай, мінажатыма құлақ түрші, Өтінішімді елемей жүрмеші."},
	{3, "3 Назар аударып, жауап берші маған, Аһ ұрып, абыржып жүрмін қайғыдан,"},
	{4, "4 Дұшпандарымның қатты дауысынан Әрі әділетсіздердің қыспағынан. Олар басыма азап жаудырады, Ашулана жала да жабады."},
	{5, "5 Жүрегім қинала дірілдейді, Өлімнің қорқынышы тап береді."},
	{6, "6 Үрей мен қалтырау басып алады, Қорқыныш билейді тұла бойымды."},
	{7, "7 Сонда мен тілек тілеп былай дедім: Кептердің қанаттарын маған берер кім, Бұл жерден ұшып кетіп, тыншыр едім,"},
	{8, "8 Алысқа ұшып, айдалада қалар едім,"},
	{9, "9 Қастықтың дауылынан тез құтылар едім."},
	{10, "10 Уа, Ием, зұлымдарды абыржытып, Берекесін алшы тілдерін шатастырып, Қаладан зорлық-зомбылық тұрмын көріп."},
	{11, "11 Күні-түні олар қамалда аңдып жүреді, Сұмдық пен пәлеге толы қала іші,"},
	{12, "12 Тонаушылық пен өлім мол шаһарда, Жалғандық пен зорлық бітпес базарда."},
	{13, "13 Жауым қараласа соған төзер едім, Дұшпаным бас көтерсе одан тығылар едім."},
	{14, "14 Алайда мұны істеген қатарласым Сенсің, о, жаныма жақын сырлас досым!"},
	{15, "15 Қандай ғажап еді қарым-қатынасымыз, Құдайдың үйіне бірге барғанымыз."},
	{16, "16 Кенеттен жетсін ажал жауларыма, Тірідей түссін олар тұңғиыққа, Зұлымдық мекендейді ғой араларында."},
	{17, "17 Ал мен Құдайды көмекке шақырамын, Сонда мені құтқарады Жаратқаным."},
	{18, "18 Ертеңгісін, тал түсте және кешқұрым Құдайыма дауыстап жалбарынамын, Оның құлағына шалынады дауысым."},
	{19, "19 Маған қарсы шығып, шайқасқан көп жаудан Құдай жанымды сақтап алады аман."},
	{20, "20 Ежелден Құдай тағында отырып келеді, Мені естіп, жауды Өзіне бас игізеді. // Олар іс-әрекеттерін өзгертпей келді, Құдайдан қорқып, Оны қастерлемей жүрді."},
	{21, "21 Дұшпаным жасасқан келісімінен бас тартты, Өзімен тату тұрғандарға қарсы шықты,"},
	{22, "22 Сарымайдан да жұмсақ айтқан сөздері, Бірақ қастандыққа толы оның жүрегі, Иісмайдан да жағымды айтқандары, Шынымен жалаң семсердей астарлары."},
	{23, "23 Жаратқан Иеге арт бар уайымыңды, Ол сені қолдап, ойлайды қамыңды, Мәңгілік құлатпайды әділ жанды."},
	{24, "24 Алайда, уа, Құдайым, сол сұмдарды Тастайсың Сен тұңғиық шыңырауға, Қанішер жауыздардың жандары Құриды жетпей-ақ жасының жартысына. Ал мен болсам сенемін Жаратушыма."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view55() {
struct kk55 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, Алыстағы үнсіз көгершін әуенімен айтылатын Дәуіттің мінажаты. Ол філістірлердің Дәуітті Ғат қаласында ұстап алған кезіне арналған.)"},
	{2, "2 Уа, Құдай, бола гөр маған мейірімді, Адамдар ұмтылады таптауға мені, Күні бойы қыспақтап, тап береді."},
	{3, "3 Жауларым күнде қудалап өкшелейді, Менмендер маған қарсы бас көтереді."},
	{4, "4 Қорыққанда Саған артам сенімімді."},
	{5, "5 Құдайға сеніп енді қорықпаймын, Берген сөзі үшін Оны мадақтаймын, Сонда пенде не жасай алады маған?"},
	{6, "6 Күнде жаулар сөздерімді бұрмалайды, Әрдайым маған қарсы қастық ойлайды,"},
	{7, "7 Жасырынып бір жерге жиналады, Бар қадамдарымды бақылап тұрады, Аңдып жанымды алуға ұмтылады."},
	{8, "8 Уа, Құдай, сұм істерімен құтылтпашы, Сол қыңыр ұлттарды қаһарыңмен құлдыратшы."},
	{9, "9 Шарасыздығымды ұмытпай ескересің, Құтыңа жинап қой көз жасымның бәрін, Жазылған жоқ па олар кітабыңда Сенің?"},
	{10, "10 Сиынып сұрасам қолдауыңды Сенің, Кері шегінеді жауларым менің, Құдайдың маған жар екенін білемін."},
	{11, "11 Берген сөзі үшін Құдайды мадақтаймын, Берген уәдесі үшін Иемді даңқтаймын."},
	{12, "12 Құдайға сеніп енді қорықпаймын, Сонда пенде не жасай алады маған?"},
	{13, "13 Уа, Құдайым, мен Өзіңе бағыштаймын Берген уәдеме сай шүкірлік тартуларын."},
	{14, "14 Өйткені аяғымды сүрінуден сақтадың, Жанымды ажалдың аранынан құтқардың. Осылай Сен мені Өзіңнің алдыңда Аман жүрсін дедің өмірдің нұрында."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view56() {
struct kk56 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, Құрта көрме әуенімен айтылатын Дәуіттің мінажаты. Ол Дәуіттің Саулдан қашып, таудағы үңгірді паналағанына арналған.)"},
	{2, "2 Мейірленіп, Құдай, рақым етші маған, Өйткені үмітімді артамын Саған, Пәле-жала өткенше бас сауғалайын, Қанатыңның аясын паналайын."},
	{3, "3 Сиынып тұрамын Алла Тағалаға, Маған игілік жасаушы Құдайға."},
	{4, "4 Ол көктен көмек жолдап аман сақтайды, Мені өкшелеп қудалағанды қорлайды. // Иә, Құдай рақымы мен шындығын сыйлайды."},
	{5, "5 Айналам толы жыртқыш арыстандай, Сол сұмдардың тілдері өткір қылыштай, Тістері де үшкір жебе мен найзадай."},
	{6, "6 Уа, Құдай, көктен жоғары атың шықсын, Күллі әлемде Сенің даңқың артсын!"},
	{7, "7 Дұшпандарым маған арнап тор құрды, Сондықтан еңсем түсіп, көңілім қалды. Жолыма олар тұзақ құрып, ор қазды, Алайда сол орға өздері құлады. //"},
	{8, "8 Уа, Құдай, жүрегім Саған сенімді, Өзіңе арнаймын мен ән-күйімді."},
	{9, "9 Жан дүнием, ояншы, сергек болайын, Жетіген мен домбыра, болыңдар дайын, Ән-жырыммен атар таңды оятайын."},
	{10, "10 Уа, Ием, жұрт алдында Сені мадақтаймын, Ұлттар арасында мақтап жырлаймын."},
	{11, "11 Себебі берік рақымың заңғар аспандай, Әрі сенімділігің асқар бұлттардай."},
	{12, "12 Уа, Құдай, көктен жоғары атың шықсын, Күллі әлемде Сенің даңқың артсын!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view57() {
struct kk57 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, Құрта көрме әуенімен айтылатын Дәуіттің мінажаты.)"},
	{2, "2 Уа, билер, шындықты айтасыңдар ма, Жұртқа әділ үкім шығарасыңдар ма?"},
	{3, "3 Жоқ, іштей әділетсіздік жоспарлайсыңдар, Елге билік айтқанда зорлық жасайсыңдар!"},
	{4, "4 Зұлымдар туғаннан-ақ жолдан адасады, Құрсақтан-ақ жаңылып, жалған айтады."},
	{5, "5 Айтқан сөздері зәрлі жыланның уындай, Олар шебер арбаушының да даусын тыңдамай Құлағы бітелген улы сұр жыландай."},
	{6, "7 Уа, Құдай, олардың тістерін қиратшы, Ием, арыстандай жақтарын күйретші,"},
	{7, "8 Ағып кеткен судай олар жоғалсын, Тартқанда жебелері сынып қалсын,"},
	{8, "9 Жорғалап жоқ болар ұлудай құрысын, Тасталған түсіктей күн көзін көрмесін!"},
	{9, "10 Тікенді бұтақ жанған от үстіндегі Қазанның тез қайнайтыны секілді, Құдайдың қаһары сол тірілерді Құйындай көтеріп алып кетеді."},
	{10, "11 Тәңірдің жазалауын әділдер көріп қуанады, Зұлымның құрып кеткеніне риза болады."},
	{11, "12 Жұрт былай дер: Рас, әділ жан сыйын алады, Жерде шынымен Құдай үкім шығарады!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view58() {
struct kk58 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, Құрта көрме әуенімен айтылатын Дәуіттің мінажаты. Ол Саул патшаның Дәуітті өлтіру үшін оның үйін күзеттірген кезіне арналған.)"},
	{2, "2 Уа, Құдайым, құтқара гөр жауларымнан, Мені сақтай гөр қарсыластарымнан,"},
	{3, "3 Арашалашы әділетсіздерден, Аман сақташы қанішерлерден."},
	{4, "4 Уа, Жаратқан Ие, олар мені аңдуда, Маған қарсы мықтылар жиналуда. Ал не қылмысым, не күнәм болмай тұр,"},
	{5, "5 Еш кінәм жоқ, бірақ олар асығып жүр, Маған қарсы аттануға дайын тұр. Мені қорғап-қолдауға орныңнан тұршы, Мүшкіл жағдайыма көз сала көрші."},
	{6, "6 Уа, Жаратушы Құдай, Әлемнің Иесі, Исраил халқының сиынатын Тәңірі, Енді көктегі тағыңнан көтерілші, Өзіңе бағынбайтын ұлттарға тап берші, Зұлым опасыздарға рақым көрсетпеші. //"},
	{7, "7 Дұшпандарым кешқұрым кері қайтады, Қаланы аралап иттерше ұлысады."},
	{8, "8 Ауыздарынан жамандық бұрқырайды, Тілдері семсердей жарақаттайды, Олар Кім естір екен? деп ойлайды."},
	{9, "9 Ал Сен, Жаратқан Ие, оларға күлесің, Барлық қыңыр ұлттарды келекелейсің."},
	{10, "10 Сен менің күш-қуатымның қайнарысың, Назарымды Өзіңе аударамын, Себебі, уа, Құдай, Сен қорғанымсың,"},
	{11, "11 Маған мейірім танытатын Құдайымсың, О, Құдай, алдымнан жүріп күш бересің, Жауларымның жеңілісін көрсетесің."},
	{12, "12 Оларды құртпашы, халқым ұмытпасын, Күшпен таратшы, Өзіңе бой ұрсын, Уа, Иеміз, қалқандай Қорғаушымызсың!"},
	{13, "13 Күнә — айтқандарының барлығы да, Ауыздарынан шыққан — қарғыс пен жала, Менмендіктерімен құласын тұзаққа!"},
	{14, "14 Қаһарыңмен оларды құртып таста, Жоқ қыла гөр оларды біржолата, Сонда Жақыпқа Құдай билік жүргізеді Деп жер түкпіріндегілер де біледі. //"},
	{15, "15 Дұшпандарым кешқұрым кері қайтады, Қаланы аралап иттерше ұлысады,"},
	{16, "16 Жейтін олжа іздеп айнала шарлайды, Егер тоймаса түнде ырылдайды."},
	{17, "17 Ал Сен пәлеге ұшырағанымда Маған болдың қорған және баспана, Сондықтан әнге салып құдіретіңді, Таңертеңнен паш етем мейіріміңді."},
	{18, "18 Сен менің күш-қуатымның қайнарысың, Өзіңе мадақтау жырымды арнаймын. Себебі, уа, Құдай, Сен қорғанымсың, Мейірімін төгетін Құдайымсың."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view59() {
struct kk59 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, Келісім қызғалдағы әуенімен айтылатын Дәуіттің насихат мінажаты."},
	{2, "2 Ол Дәуіттің Батыс Месопотамияның әрі Собаның арамалықтарымен шайқасып жүрген кезінде Жоғаб қайта оралып, он екі мың едомдықты Тұзды аңғарда күйреткен оқиғаға арналған.)"},
	{3, "3 О, Құдай, Сен бізден бас тарттың, Қаһарланып бізді талқандадың, Бізге бұра гөр бетіңді қайтадан."},
	{4, "4 Сен жерді сілкілеп, қиратқан едің, Ол шайқалып тұр, жазшы жарылған жерлерін."},
	{5, "5 Өз халқыңның басына пәле түсірдің, Теңселтетін шараптан оған ішкіздің."},
	{6, "6 Сен Өзіңді қастерлейтіндерге ту бердің, Олар соны көтерсін деп шындық үшін. //"},
	{7, "7 Сүйіктілерің лайым аман сақталсын Деп ден қойып, құдіретіңмен құтқарғын!"},
	{8, "8 Құдай былай деді киелі мекенінен: Мен шаттанып Сихемнің жерін бөліп беремін, Соқот аңғарын да халқыма үлестіремін."},
	{9, "9 Ғилақад пен Манаса да — Менің иелігім, Ефрем руы болады басты қорғаным, Яһуда руынан шығады патшаларым."},
	{10, "10 Моаб Маған шылапшындай пайдалы болады, Едом жері де меншігіме айналады, Філістір елі де бой ұрып Маған қуанады."},
	{11, "11 Кім мені қамалды қалаға кіргізеді? Кім Едом елінің ішіне енгізеді?"},
	{12, "12 Сол Сен емес пе, Құдай, бізден бас тартқан, Әскерімізбен бірге шабуылға шықпаған?"},
	{13, "13 Жаулардың қыспағына қарсы қолдашы, Еш жарамсыз — пенделердің қолдағаны."},
	{14, "14 Зор істер істейміз Құдай жар болғанда, Жауларымызды таптайды Ол аяғына."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view60() {
struct kk60 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, ішекті аспаптардың сүйемелдеуімен айтылатын Дәуіттің жыры.)"},
	{2, "2 Уа, Құдай, айқайыма құлақ сала гөр, Мінажатыма менің ден қоя гөр."},
	{3, "3 Сары уайымға салынды жан дүнием, Өзіңе сиынамын жердің шетінен, Шыға алмас шыңға мені шығаршы Сен."},
	{4, "4 Себебі бас сауғалар панам болып келесің, Жаудан қорғайтын берік бекінісім Өзіңсің."},
	{5, "5 Уа, Құдай, мекеніңде мәңгі тұрайыншы, Қанатыңның астынан тыным табайыншы,"},
	{6, "6 Өйткені берген анттарымды Сен естідің, Өзіңді қастерлейтіндермен бірге үлес бердің."},
	{7, "7 Патшаның ғұмыр жасын ұзарта гөр, Ұрпақтан ұрпаққа жалғастыра гөр,"},
	{8, "8 Уа, Құдай, алдыңда ол мәңгі билік құрсын, Лайым рақым мен шындығың оны қорғасын."},
	{9, "9 Сенің атыңды әрдайым мадақтаймын, Берген анттарымды күнде орындаймын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view61() {
struct kk61 poems[] = {
	{1, "1 (Ән-күйдің жетекшісі Едутунге арналған Дәуіттің жыры.)"},
	{2, "2 Жаным тыным табады жалғыз Құдайдан, Құтқарылуым келеді тек қана Одан,"},
	{3, "3 Ол ғана — паналайтын жартасым, Құтқарушым әрі заңғар қорғаным, Енді қайтып қатты шайқалмаймын."},
	{4, "4 Қашанғы бас саласыңдар бір адамға? Теңселген дуал, қисайған қабырға Сияқтанған мені құлатпақсыңдар ма?"},
	{5, "5 Биіктен құлатуға жаулар жоспарлайды, Сол үшін өтіріктен де бас тартпайды, Ауыздарымен бата бергенсиді, Ал жүректерінде жамандық тілейді."},
	{6, "6 Жан дүнием, тыным тап жалғыз Құдайдан, Үміт келеді маған тек қана Одан,"},
	{7, "7 Ол ғана — паналайтын жартасым, Құтқарушым әрі заңғар қорғаным. Енді қайтып ешқашан шайқалмаймын."},
	{8, "8 Құтқарылуым, абыройым Құдайдан, Ол — мықты қорғаным әрі баспанам."},
	{9, "9 Халайық, лайым Оған сенім артыңдар, Ойларыңды Оған толық ашыңдар, Құдай — біздің панамыз, мұны ұмытпаңдар! //"},
	{10, "10 Адамзат атаулы шығарған деміңдей, Атақты, атақсыз бәрібір бекердей, Таразыға бәрін салып көргенде, Жеңіл олар шығарған деміңнен де."},
	{11, "11 Зорлықпен алып қоюға үміт артпа, Дүние-мүлік ұрлаймын деп те мақтанба, Дәулетің молайса, соған сенім артпа!"},
	{12, "12 Бірде Құдай маған былай деп айтты, Талай рет мен естігенмін мынаны: Құдіретті күш, о, Құдай, Сенікі."},
	{13, "13 Уа, Ием, тұрақты — Сенің рақымың, Әркімге лайықтысын ісіне сай қайтарасың."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view62() {
struct kk62 poems[] = {
	{1, "1 (Дәуіттің жыры. Оның Яһуда еліндегі иен далада жүрген кезі туралы.)"},
	{2, "2 Уа, Ием, Сен сиынатын Құдайымсың, Таң сәріден мен Саған бет бұрамын, Сусыз жердемін кеуіп, құлазыған, Жан-тәніммен Сені аңсап сағынам."},
	{3, "3 Киелі тұрағыңда аяныңды көрдім, Құдірет пен ұлылығыңды байқадым."},
	{4, "4 Өмірден де артық берік — мейірімің, Ауызым Өзіңді мадақтай берсін,"},
	{5, "5 Өмір бойы бір Сені мадақтаймын, Атыңды атап қолымды жаямын."},
	{6, "6 Өйткені жіліктің майлы басынан Гөрі Өзіңнен мол ләззат табамын, Шаттық үнмен Саған мақтау айтамын."},
	{7, "7 Төсекке жатып Сені еске аламын, Түні бойы Сен жайлы ойланамын."},
	{8, "8 Өйткені Өзің менің қолдаушымсың, Қанатыңның аясында шаттанамын."},
	{9, "9 Жаным тығыз байланыста Сенімен, Мені демейсің құдіретті қолыңмен."},
	{10, "10 Ал көзімді құртпақшы арамзалар Тозақтың түбіне түсетін болар,"},
	{11, "11 Семсердің күшімен олар қырылар, Өліктері шибөріге жем болар."},
	{12, "12 Уа, Құдай, патша Өзіңе шаттанады, Саған бағышталғандар мақтау айтады, Ал өтірікші ауыздар жабылады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view63() {
struct kk63 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің жыры.)"},
	{2, "2 Уа, Құдай, арызыма құлақ сала гөр, Жаудың сесінен жанымды сақтай гөр,"},
	{3, "3 Зұлымның астыртын әрекетінен Қорғап әрі залымның бүлігінен."},
	{4, "4 Тілдерін олар семсердей өткірлеген, Көздеп тұр жебедей өткір сөздерімен."},
	{5, "5 Айыпсыз жанды атады тосқауылдан, Кенеттен тап береді қорықпастан."},
	{6, "6 Зұлым ойларында бір-бірін қолдайды, Құпия тор құруды жоспарлайды, Мұны кім көрер? деп өздерін мақтайды."},
	{7, "7 Қаскүнемдік ойластырып, құрайды, Мүлтіксіз жоспар құрдық деп ойлайды. Адамның жан дүниесі — түпсіз тұңғиық, Жүрек түкпірлері пендеге жабық."},
	{8, "8 Ал Құдай соларды жебемен атады, Кенеттен олар жарақаттанады,"},
	{9, "9 Өз сөздеріне бола талқандалады, Мұны көргендер олардан бас тартады."},
	{10, "10 Күллі адамзат үрейленеді, Құдайдың істерін жария етеді, Оның керемет жасағанын түсінеді."},
	{11, "11 Жаратқанға әділдер шаттанады, Олар Иемізден пана табады. Ақжүрек жандар Оны мақтан тұтады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view64() {
struct kk64 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің әні әрі жыры.)"},
	{2, "2 Сионда Саған, Құдай, мақтау арналады, Өзіңе берілген анттар орындалады,"},
	{3, "3 Мінажаттар құлағыңа жетеді, Барлық адамдар алдыңа келеді."},
	{4, "4 Теріс істеріміз жаншып тұр бізді. Ал Сен кешіресің күнәларымызды."},
	{5, "5 Қандай бақытты — Өзің таңдағандар, Қасыңда, аулаларыңда тұрады олар, Сонда кенелеміз үйіңнің жақсылығына, Киелі ғибадатханаңның рақатына."},
	{6, "6 Құдай, құлақ саласың әділдікпен, Бізді құтқарасың керемет істермен. Саған үміт артады жер шетіндегілер Және алыс теңіздегі кемешілер."},
	{7, "7 Сен құдіретіңмен тауларды орнаттың, Күш-қуатқа бөленіп, беліңді будың."},
	{8, "8 Теңіз толқынының гүрілін тыншыттың, Халықтардың шуылын тыныштандырдың."},
	{9, "9 Кереметтеріңе таңғалар алыс елдер, Шығыс пен батысқа айтқызасың әндер."},
	{10, "10 Сен жерді баптап суарып, құнартасың, Уа, Құдай, халықты нанға тойдыру үшін Өзендеріңді суға толтырасың, Жерді Өзің солай дайындайсың."},
	{11, "11 Соқаның іздерін суға қандырасың, Топырақ кесектерін тегіс қыласың, Құйылған нөсермен оларды жұмсартасың, Өсіп шыққан өнімдерін жарылқайсың."},
	{12, "12 Солай жылды игілікке бөлейсің, Қайда жүрсең де молшылық бересің,"},
	{13, "13 Иен даланың жайылымдары суланған, Қыраттар құлпырып қуаныш жамылған,"},
	{14, "14 Жайылым қора-қора малға толып, Алқаптар егінменен жайқалып, Бәрі қуана айқайлайды ән салып."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view65() {
struct kk65 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған ән әрі жыр.) Бар әлем, Құдайға қуана дауыстаңдар,"},
	{2, "2 Оның есімін дәріптеп жырлаңдар, Зор ұлылығының даңқын шығарыңдар!"},
	{3, "3 Құдай алдында былай деп айтыңдар: Қандай керемет Сенің іс-әрекетің, Һәм қандай ұлы Сенің құдіретің, Жауларың Сенің алдыңда бойсұнады,"},
	{4, "4 Бүкіл жер Саған бас иіп сиынады, Саған арнап мақтау жырларын айтады, Есіміңді мадақтап ән салады. //"},
	{5, "5 Келіп, Құдайдың істерін көріңдер, Адамдар үшін Ол істейді кереметтер,"},
	{6, "6 Құдай теңізді айналдырды құрлыққа, Оның халқы жаяу өтті арғы жаққа."},
	{7, "7 Ол құдіретті күшімен мәңгі билейді, Халықтарды әрдайым бақылайды, Қыңырдың бас көтеруіне жол бермейді. //"},
	{8, "8 Халықтар, Құдайымызды мақтаңдар, Қатты дауыспен Оны мадақтаңдар!"},
	{9, "9 Ол жанымызды аман-есен қорғайды, Аяғымызды сүрінуден сақтайды."},
	{10, "10 Уа, Құдай, Сен сынақтан бізді өткіздің, Күмісті балқытқандай тазарта бердің,"},
	{11, "11 Тұзаққа түсіріп бізді құлаттың, Арқамызға құлдықтың жүгін арттың,"},
	{12, "12 Адамдарды басымызға шығардың, Оттан да, судан да бізді өткіздің, Ал ақыры молшылыққа жеткіздің."},
	{13, "13 Қасірет кезінде аузымнан шыққан, Қиындыққа тап болғанда тілім айтқан, Саған берген сертімді іске асырамын, Өртелмек құрбандықпен үйіңе барамын."},
	{14, "15 Саған арнап семіз малдарды шаламын, Қошқар майын өртеп, жұпарын шығарамын, Бұқалар мен ешкілерді де ұсынамын."},
	{15, "16 Ей, Құдайымызды қастерлейтіндер, Барлығың келіп, құлақ түріңдер. Оның маған істегенін сендерге айтамын."},
	{16, "17 Мен Құдайға дауыстап сиындым, Аузымменен Оның даңқын шығардым."},
	{17, "18 Жүректе бар күнәмнан бас тартпасам, Дұғама құлақ салмас еді Жаратқан."},
	{18, "19 Расында Құдай құлақ түрді маған, Сиынғанымда даусым жетті Оған."},
	{19, "20 Мінажатымнан менің бас тартпаған, Мейірімін менен алып қоймаған Құдайымыз мадақталсын әрқашан!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view66() {
struct kk66 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, ішекті аспаптардың сүйемелдеуімен айтылатын жыр әрі ән.)"},
	{2, "2 Я, Құдай, рақымды болып, жарылқай гөр, Бет-жүзіңнің нұрын бізге түсіре гөр. //"},
	{3, "3 Бүкіл жер бетінде Сенің жолың мәлім болсын, Барлық халықтарға құтқаруың аян болсын!"},
	{4, "4 Уа, Құдай, халықтар Сені мадақтай берсін, Күллі ұлттар Өзіңе мақтау айта берсін!"},
	{5, "5 Рулар қуана-қуана ән шырқай берсін, Себебі Сен ұлттарды әділдікпен билейсің, Жер бетіндегі руларға дұрыс бағыт сілтейсің. //"},
	{6, "6 Уа, Құдай, халықтар Сені мадақтай берсін, Күллі ұлттар Өзіңе мақтау айта берсін!"},
	{7, "7 Сонда жердің топырағы бізге өнімін сыйлар, Һәм Құдай, сиынған Құдайымыз, бізді жарылқар."},
	{8, "8 Лайым Құдай бізді жарылқай берсін, Бар жердегі адамдар Оны қастерлесін!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view67() {
struct kk67 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің әні әрі жыры.)"},
	{2, "2 Құдай көтеріліп, жауларын шашыратсын, Оны жек көретіндер алдынан қашсын."},
	{3, "3 Түтіннің желмен ыдырайтыны сияқты, Уа, Құдайым, жауларыңды ыдыратшы, Балауыздың отқа еритіні іспетті, Зұлымдарды алдыңнан құртып жіберші."},
	{4, "4 Бірақ әділдер болса, шаттана ән-салсын, Құдай алдында күліп мәз-мейрам болсын."},
	{5, "5 Біздің Құдайымызға ән айтыңдар, Оның есімін дәріптеп жырлаңдар, Бұлттармен жүретін Оны мадақтаңдар, Жаратқан Ие — Оның аты, біліп алыңдар, Көз алдында шат-шадыман болыңдар."},
	{6, "6 Құдай әке болады жетімдерге, Қорғаушы болады жесірлерге, Тағында отыр Ол киелі мекенінде,"},
	{7, "7 Жалғыз жандарға жанұя сыйлайды, Тұтқынды босатып, шаттыққа бөлейді, Ал қыңырды қапырық шөлге тастайды."},
	{8, "8 О, Құдай, халқыңды Мысырдан бастап шыққанда, Айдалада оны ертіп жүріп отырғаныңда, //"},
	{9, "9 Жер сілкініп, аспаннан жаңбыр қатты құйылды, Уа, Құдай, көз алдыңда Синай тауында, Исраил сиынған Өзіңнің алдыңда."},
	{10, "10 Уәделі еліңе, я, Құдай, нөсер жаудырдың, Кеуіп қалған жерді қайтадан жандандырдың,"},
	{11, "11 Рақыммен халқыңды елде қоныстандырдың, Уа, Тәңірім, сол кедейлерді Сен қамқорладың."},
	{12, "12 Жаратқан Ие мынаған бұйрық шығарды, Көптеген қыз-келіншек оны хабарлады:"},
	{13, "13 Жау әскері басшыларымен қашып кетеді, Ауылдағы әйел заты олжаны бөліседі,"},
	{14, "14 Мал бағып қораларында қонған солар Күміс оранып кептер қанатына ұқсар, Алтын әшекей тағып, мамықтай құлпырар."},
	{15, "15 Құдіретті Құдай патшаларды шашыратты, Салмон тауында соққан ақ боранға ұқсатты."},
	{16, "16 Құдай жаратқан керемет — Башан тауы, Шыңдары заңғар биік — Башан тауы."},
	{17, "17 Зәулім шыңдар, қызғанасыңдар не үшін Құдай тұруға таңдап алған Сион тауын, Жаратқан Иенің мәңгі мекендейтін тауын?"},
	{18, "18 Құдайдың күймелері сан мыңдаған, Араларында Иеміз шайқасқа аттанған, Киелі үйіне көшіп келді Синайдан."},
	{19, "19 Сен заңғар биікке көтерілдің, Көптеген тұтқындарды ертіп жүрдің, Адамдардан тартулар қабылдадың, Бас көтергендерден де сыйлықтар алдың, Құдай Иенің мұнда тұруы үшін."},
	{20, "20 Әрдайым Иеміз мадақталсын, Құтқарушы Құдайымыз даңқталсын: Жүгімізді көтеріп жүр Ол күн сайын, Құдайдың Өзі — бізді аман сақтайтын. //"},
	{21, "21 Құдайымыз бізді қорғап-қолдайды, Жаратушы Тәңір Ие ажалдан сақтайды."},
	{22, "22 Құдай жауларының басын талқандайды, Соғысқұмар, қыңыр қылмыстыларды жояды."},
	{23, "23 Сол жауыздар жайлы Иеміз былай деген: Оларды Башан тауынан да алып келем, Теңіздің ар жағынан да қайтарып әкелем."},
	{24, "24 Сонда аяқтарың жаудың қанын басады, Әрі иттерің қанды жалап тойынады."},
	{25, "25 Уа, Құдай, Сенің салтанатты шеруің, Киелі тұрағыңа Сенің кіруің Көрінеді бар жұртқа, о, Патшам, Құдайым."},
	{26, "26 Әншілер жүр алдында, аспапшылар соңында, Даңғыра ойнаған қыздар араларында:"},
	{27, "27 Жиындарда Құдайымызды мадақтаңдар, Исраилдің ұрпақтары, Иемізді даңқтаңдар!"},
	{28, "28 Кенже Бунямин руы бастап келеді, Яһуда басшыларының тобы ереді, Забулон, Нафталим басшылары да жүреді."},
	{29, "29 Уа, Құдай, күш-қуатыңды жинашы, Бұрын көрсеткен құдіретіңді танытшы,"},
	{30, "30 Иерусалимдегі ғибадатханаңа бола Патшалар Саған сый-тарту әкеледі сонда."},
	{31, "31 Жау халықтарды сөгіп жуасытшы: Перғауын — қамыстағы хайуан сияқты, Ал бұзаудай күшсіз ұлттар арасындағы Бұқалар табынындай — оның әміршілері, Олар күмістен салық талап етеді. Соғысқұмар ұлттарды тарқатып жіберші!"},
	{32, "32 Мысырдан жіберілген мырзалар келеді, Құш елі де қол созып Құдайға көнеді."},
	{33, "33 Жердегі патшалықтар, Құдайға ән салыңдар, Иемізді мадақтап ән-жыр айтыңдар, //"},
	{34, "34 Дәріптеп ежелден аспанда жүрген Иемізді, Тыңда, зор даусымен Ол күркірейді."},
	{35, "35 Хабарлаңдар Құдайдағы құдіретті! Исраилдің үстінде Оның салтанаты, Әрі бұлттардан жоғары күш-қуаты."},
	{36, "36 Құдай киелі үйінде үрей туғызады, Исраилдің Құдайы халқын нығайтады. Лайым Құдай мадақтала берсін!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view68() {
struct kk68 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, Қызғалдақтар әуенімен айтылатын Дәуіттің жыры.)"},
	{2, "2 Құтқара гөр, уа, Құдайым менің, Тасыған су жетті мойныма дейін,"},
	{3, "3 Батпаққа терең батып бара жатырмын, Аяқ басып тұрар жер таба алмаймын, Судың тереңіне батқан адамдаймын, Ағызып барады мені қатты ағын."},
	{4, "4 Жалбарына айқайлап қалжырадым, Құрғап, кеуіп қалды менің тамағым, Құдайымды күтіп талды қос жанарым."},
	{5, "5 Басымдағы шашымнан көп дұшпандарым, Себепсіз мені жек көреді жауларым, Сұмдықпен мені қудалап келеді, Алмаған нәрсемді талап етеді."},
	{6, "6 Уа, Құдай, Саған аян ақымақ қылығым, Сенен таса емес жасаған күнәларым."},
	{7, "7 Өзіңе сенімдерін артқан жандарды Маған бола ұятқа қалдырмашы, О, Әлемнің Иесі, Жаратушы, Саған бет бұрып дұға еткен жандарды Енді маған бола масқаралатпашы, Уа, Исраилдің сиынатын Құдайы!"},
	{8, "8 Сен үшін мазаққа төзіп келем, Масқарам көрініп тұр бет-жүзімнен."},
	{9, "9 Туған бауырларым да мені танымайды, Шешемнің ұлдары маған жат деп қарайды."},
	{10, "10 Киелі үйіңнің қамын жеп азапқа түсем, Сені қорлағандардың ғайбаты маған тиген."},
	{11, "11 Ораза ұстап, жылаған уақытымда Олар мені келекелеп қорлауда."},
	{12, "12 Қайғыланып азалы киім кигенімде Олар мені мазақтап келемеждеуде."},
	{13, "13 Алаңда ақсақалдар мені өсектейді, Сыра ішкендер сықақтап әндетеді."},
	{14, "14 Ал мен Саған, уа, Жаратқан, Өзіңнің мейірім Көрсететін кезіңде сиынып келем, Құлақ сала көрші маған, уа, Құдайым, Шынында құтқаршы зор рақымыңмен."},
	{15, "15 Батпақтан мені тартып шығара көрші, Тұңғиыққа батуыма жол бермеші, Жек көретін дұшпандардан құтқаршы, Терең сулардан Мені тартып шығаршы."},
	{16, "16 Жол берме тасқынның ағызып әкетуіне, Терең судың мені жұтып жіберуіне, Ажал шыңырауының жалмап қоюына."},
	{17, "17 Уа, Жаратқан Ие, дұғама құлақ түрші, Берік мейірімің Сенің сондай игі, Мол рақымыңа сай маған көңіл бөлші."},
	{18, "18 Мендей пендеңнен бетіңді жасырмашы, Қасірет шегудемін, тез жауап берші."},
	{19, "19 Жақындап келіп, жанымды құтқаршы, Жауларыма бола босата көрші."},
	{20, "20 Сен білесің қандай қорлық көргенімді, Ұятқа қалып, жапа шеккенімді, Көріп алдың бар дұшпандарымды."},
	{21, "21 Мазақтары жүрегімді күйретіп, әлсізбін, Бекерге жұрттан аяныш күттім, Ешбір жұбатушыны кездестірмедім."},
	{22, "22 Қайта, тамағыма олар өт қосып берді, Шөлдеп тұрғанымда сірке суын ішкізді."},
	{23, "23 Мол дастарқандары жауларыма тор болсын, Бейқам ішкен астары тұзаққа айналсын,"},
	{24, "24 Көздері көре алмастай тұмандансын, Белдері ұдайы бейнеттен бүкшиіп қалсын,"},
	{25, "25 Оларға төге гөр өз қаһарыңды, Һәм қуып жетсін ашуыңның жалыны,"},
	{26, "26 Тұрған мекені қаңырап бос қалсын, Шатырларында тұратын ешкім болмасын!"},
	{27, "27 Өйткені Сен соққанды олар қуғындайды, Сен жаралағанды тағы мазақтайды."},
	{28, "28 Мойындарына салшы бар қылмыстарын, Өзіңнің алдыңда ақтала алмасын."},
	{29, "29 Өмір кітабынан өшірші есімдерін, Әділдер тізіміне олар тіркелмесін."},
	{30, "30 Ал мен азап шегіп қиналудамын, Уа, Құдай, құтқаруың мені қолдасын,"},
	{31, "31 Сонда Құдайдың атын әнге қосамын, Шүкіршілік етіп мақтау айтамын."},
	{32, "32 Көбірек ұнатады мұны Жаратқан Құрбандық мүйізді ірі қарадан."},
	{33, "33 Соны көріп, мәз болады қаналғандар, Жігерленіңдер, Құдайға бет бұрғандар!"},
	{34, "34 Өйткені Жаратқан Ие мұқтажға құлақ түреді, Тұтқын пенделерін Ол менсінбей кетпейді."},
	{35, "35 Мадақтаңдар Иемізді, аспан мен жер, Теңіз бен ондағы күллі жәндіктер,"},
	{36, "36 Себебі Құдай Сионды құтқарады, Яһуданың қалаларын қайта тұрғызады, Құдай халқы орнығып, елге ие болады."},
	{37, "37 Пенделерінің ұрпағы елді иемденеді, Құдайдың есімін сүйгендер соны мекендейді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view69() {
struct kk69 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, басына түскен жағдайын Құдайдың есіне салған Дәуіттің жыры.)"},
	{2, "2 Уа, Құдай, мені құтқаруға асыға гөр, О, Жаратқан, тездетіп көмекке келе гөр!"},
	{3, "3 Жанымды алмақ болған күллі жауларым Таңдана абыржып, масқаралансын, Маған пәле тілеген бар дұшпандарым Ұятқа қалып, кері қайтарылсын!"},
	{4, "4 Өзіңе де сол керек! деп табалаған Олар қарабет боп безіп кетсін сондықтан."},
	{5, "5 Бірақ бет бұрып сиынғандар Саған Өзіңе қуана берсін шат-шадыман, Лайым құтқаруыңды ұнатқан әркім: Құдайым даңқты! деп Сені дәріптесін!"},
	{6, "6 Ал мен жарлымын, мұқтаждықта жүрмін, Я, Құдай, маған тездетіп келе гөр! Қолдаушым да құтқарушым Өзіңсің, О, Жаратқан Ием, кешікпей жете гөр!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view70() {
struct kk70 poems[] = {
	{1, "1 Өзіңді паналаймын, уа, Жаратқан, Ұятқа қалдырмашы мені ешқашан."},
	{2, "2 Сен әділсің, мені босата көрші, Құлақ түріп маған, құтқара көрші."},
	{3, "3 Бола гөр лайым бас сауғалар панам, Сөзіңе сай құтқаршы, құздай қорғаным!"},
	{4, "4 О, Құдайым, босатшы мені зұлымнан, Күнәкар қанаушының қыспағынан."},
	{5, "5 Жаратушы Тәңір Ием, үмітім Сенсің, Жастайымнан-ақ Өзіңе сеніп келемін,"},
	{6, "6 Құрсақтан-ақ Саған сүйеніп келемін, Туғаннан-ақ Сен қамқоршымсың менің. Еш таусылмас Сені мадақтайтын әнім."},
	{7, "7 Көп адамға ғажап белгі іспеттімін, Ал Сен күш-қуатым мен қорғаушымсың."},
	{8, "8 Өзіңді мадақтауды еш тоқтатпаймын, Сенің көркіңді күнде жырлаймын."},
	{9, "9 Қартайғанда маған теріс қарай көрме, Күшім қайтқанда мені тастап кетпе."},
	{10, "10 Жауларым маған қарсы сөз байласуда, Жанымды аңдығандар ақылдасуда:"},
	{11, "11 Жоқ құтқарушысы, Құдай тастап кетті, Қуып жетіп, ұстап алайық! деседі."},
	{12, "12 Уа, Құдай, менен алыстап кетпеші, Құдайым менің, көмекке тез жетші."},
	{13, "13 Маған мін таққандар ұялып, жоқ болсын, Қастық ойлаған олар ұятқа орансын!"},
	{14, "14 Ал мен әрдайым үмітпен күтудемін, Барған сайын молырақ дәріптеймін,"},
	{15, "15 Сенің әділдігің және құтқаруың Туралы мен күн ұзаққа айтудамын, Маған көрсетіп келген жақсылықтарың Сансыз, олардың бәрін біле алмаймын."},
	{16, "16 Жаратушы Тәңір Ием, құдіретіңді ойлаймын, Тек Сенің әділдігіңді жұртқа жариялаймын."},
	{17, "17 Уа, Құдай, жастайымнан мені үйретесің, Әлі де ғажаптарыңды паш етемін."},
	{18, "18 Қартайып басымды қырау шалғанда, О, Құдайым, мені жалғыз қалдырма, Қайта, құдіретіңді жаңа ұрпаққа, Керемет істеріңді келер буындарға Жол бере көрші маған уағыздауға."},
	{19, "19 Әділдігің Сенің заңғар аспандай, Ұлы істерді жасап келесің, о, Құдай, Саған тең келер кім бар еді, уа, Құдай?"},
	{20, "20 Көп ауыр азаптар жібердің маған, Қалпына келтіресің бірақ қайтадан Жанымды менің, шығарып тұңғиықтан."},
	{21, "21 Құрмет сыйлап жұбата гөр жаңадан."},
	{22, "22 Сонда Сені жетігенмен мадақтаймын, Сен уәдеңе беріксің, уа, Құдайым, Исраил сиынатын Киелі Тәңірім, Саған домбыра тартып әнімді арнаймын,"},
	{23, "23 Шаттанып Саған жырымды бағыштаймын, Өйткені Сен мені құтқардың апаттан."},
	{24, "24 Иә, күн сайын әділдігің жайлы айтам: Маған қастық ойлағандар ұятқа батқан!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view71() {
struct kk71 poems[] = {
	{1, "1 (Сүлейменнің жыры.) Уа, Құдай, патшаңа әділ шешімдер сыйлай гөр, Патшаның ұлына да әділдікті үйрете гөр,"},
	{2, "2 Ол халқыңа әділетпен билік құрсын, Жарлыларыңа әділ үкім шығарсын."},
	{3, "3 Қыраттар халқыңа молшылық берсін, Қырдан олар әділдіктің өнімін терсін."},
	{4, "4 Патша халықтың жарлыларын қорғасын, Мұқтаждың ұрпақтарын да аман сақтасын, Ал қанаушыларын басып жуасытсын."},
	{5, "5 Күн мен ай нұрын шашып болмайынша, Халқың Сені қастерлесін ұрпақтан ұрпаққа."},
	{6, "6 Игілікті болсын патшаның билігі: Қайта қаулата өсірген шабындықты Аспаннан жауған көктемгі жаңбырдай, Иә, топырақтың шөлін қандырған нөсердей."},
	{7, "7 Патша заманында әділдер өркендесін, Ай өшпейінше молшылық жайыла берсін."},
	{8, "8 Ол билік құрады теңізден теңізге дейін, Евфрат өзенінен жердің шетіне дейін,"},
	{9, "9 Құла түздің тұрғындары оған бас ұрады, Ал жаулары топырақты жалайтын болады."},
	{10, "10 Тарсис пен аралдардың патшалары Патшаңа алым-салық төлеп тұрады, Әрі Себа мен Сәбаның патшалары Сый-тартулар әкеліп отырады."},
	{11, "11 Күллі патшалар оған бас иеді, Күллі ұлттар оған қызмет етеді."},
	{12, "12 Патша құтқарады жалынған мұқтажды Және қолдаушысы жоқ қаналғанды,"},
	{13, "13 Ол әлсіз бен кедейді қамқорлайды, Оларды ажалдан аман сақтайды,"},
	{14, "14 Әрі зорлық-зомбылықтан қорғайды, Олардың қанын қымбат деп санайды."},
	{15, "15 Ғұмыры патшаның ұзақ болсын, Оған Сәбаның алтынынан сый тартылсын, Лайым жұрт патшасы үшін мінажат қылсын, Күн сайын жарылқануы үшін Тәңірге сиынсын!"},
	{16, "16 Жердің беті егінге тола берсін, Қырда дәнді сабақтары өсіп-өнсін, Олар Ливан орманындай сыңсып тұрсын, Қаланың тұрғындары да шөптей көбейсін."},
	{17, "17 Патшаның есімі мәңгілікке ұлассын, Күннің сәулесіндей ұзаққа созылсын, Ол арқылы барлық ұлттар жарылқансын, Есімі оның үздіксіз мақталатын болсын!"},
	{18, "18 Лайым мадақталсын Исраил сиынатын Құдай, Тек Жаратқан Ие — керемет жасайтын Құдай!"},
	{19, "19 Оның даңқты есімі мәңгі дәріптелсін, Күллі жер Оның салтанатына кенелсін. Аумин, иә, аумин."},
	{20, "20 (Есей ұлы Дәуіттің мінажаттары осымен аяқталады.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view72() {
struct kk72 poems[] = {
	{1, "1 (Асафтың жыры.) Құдай Исраил үшін қандай игі, Жүрегі пәктер үшін мейірімді!"},
	{2, "2 Ал мен тура жолдан тая жаздадым, Тірегімнен айырылуға шақ қалдым."},
	{3, "3 Күнәкарлардың өркендеуін көрдім, Менмендерге қызғана қарай бердім."},
	{4, "4 Өмірінде шекпейді олар азапты, Денсаулығы мықты әрі қуатты,"},
	{5, "5 Өзгелердей көрмейді ауыртпалықты, Басқалардай жемейді олар соққыны,"},
	{6, "6 Содан моншақтай тағып алып мақтанышты, Әрі киімдей жамылған зорлық-зомбылықты."},
	{7, "7 Тым семіздіктен көздерін май басқан, Арамдық пиғылдары да асып-тасқан."},
	{8, "8 Өзгелерді олар қорлап, жамандайды, Паңдана зәбір-жапа жоспарлайды."},
	{9, "9 Көкті ауызымен иеленгенсиді, Жерге де тілімен билік еткенсиді."},
	{10, "10 Сондықтан да халық оларға бет бұрып, Айтқандарын тыңдайды құштарланып:"},
	{11, "11 Құдай қайдан білсін? — деп сол зұлымдар Мақтана сұрайды: — Хақ Тағала ма хабардар?"},
	{12, "12 Бейқам болып осы арам пиғылдылар Молынан жинайды байлықтар."},
	{13, "13 Әлде бекерге жүрегімді пәк сақтап, Қолымды күнәдан таза ұстадым ба?!"},
	{14, "14 Сонда да күн ұзағына қиналып, Таң атысымен түсемін азабыма!"},
	{15, "15 Ал егер мен солай сөйлейін десем, Халқыңды алдап, опасыздық жасар едім."},
	{16, "16 Мұның бәрін ақылға салып көргенімде Көзім жетті аса қиын екеніне."},
	{17, "17 Соңында мен Құдайдың үйіне кірдім, Ақыры солармен не боларын білдім:"},
	{18, "18 Сен зұлымдарды тайғақ жолға түсіресің, Биіктен құлатып, жойып жібересің."},
	{19, "19 Олар күтпеген жерден талқандалады, Зәрелері ұшып, жойылып, жоғалады."},
	{20, "20 Я, Ием, көтерілсең, олар ғайып болар, Оянғанда жоқ болатын түске ұқсар."},
	{21, "21 Ал жүрегім менің қызғаныштан күйді, Жан дүнием шүбәдан налып ренжіді."},
	{22, "22 Сонда санасыз ақымақ болып қалдым, Көз алдыңда ақылсыз хайуанға ұқсадым."},
	{23, "23 Алайда қасыңда боламын әрқашан, Сен мені ұстап қолдайсың оң қолымнан,"},
	{24, "24 Ақыл-кеңесіңмен мені бастайсың, Ақыры салтанатыңа қабылдайсың."},
	{25, "25 Өзіңнен басқа кімім бар еді көкте? Өзге ештеңе аңсамаймын жерде де!"},
	{26, "26 Тәнім әлсіреп, жаным шаршағанмен, Уа, Құдай, мәңгілік жар боласың Сен, Жүрегімнің берік тірегі бола бересің."},
	{27, "27 Бірақ жойылады алшақтағандар Өзіңнен, Безіп кеткендердің бәрін жоясың Сен."},
	{28, "28 Құдайға жақын болғаным қандай игі! Паналап Жаратушы Тәңір Ием — Сені, Жариялап тұрмын күллі істеріңді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view73() {
struct kk73 poems[] = {
	{1, "1 (Асафтың насихат жыры.) Уа, Құдай, неге бізден біржола бас тарттың, Неліктен өрши түседі қаһарың Қойларыңа қарсы отарыңдағы Сенің?"},
	{2, "2 Өзің таңдап алған ежелгі заманда Халқың екенімізді есіңде сақташы: Сенің босатқан ұлтыңбыз, меншігің айрықша. Сиондағы тұрағыңды да ұмытпашы:"},
	{3, "3 Ежелде қираған қаланы аралашы, Жау түгел жойған мекеніңді қарашы."},
	{4, "4 Бізбен кездескен орныңда жауың шулады, Таңбасын тігіп киелі жерде паңданды."},
	{5, "5 Орманда ағаш кескендер сияқты Кіреберіс қақпаларды шапқылады,"},
	{6, "6 Айбалта, шоттарымен қиратып тастады Өрнектеліп ойылған тақтайшаларды."},
	{7, "7 Жау киелі үйіңді өртеп, талқандады, Сенің атыңдағы мекенді арамдады,"},
	{8, "8 Соларды біржола құртамыз! деп шешті, Елдегі Саған сиынатын жерлерді, Уа, Құдай, олар түгел өртеп жіберді."},
	{9, "9 Еш көрмейміз өзімізді құтқаруыңды Белгілейтін Сенің керемет істеріңді. Пайғамбар жоқ бізге хабарыңды жеткізуші, Әрі жоқ пәленің қашан бітетінін білуші."},
	{10, "10 Уа, Құдай, дұшпан мазақтай бермек қашанғы, Жау ұдайы қорлай бермек пе атыңды?"},
	{11, "11 Неге құдіретті қолыңды тұрсың тартып? Жұмсашы оны, оларды соғып та құртып!"},
	{12, "12 Уа, Құдай, ежелден-ақ Сен патшамсың, Жерде ғажап істермен құтқарасың:"},
	{13, "13 Өз құдіретіңмен теңізді қақ жардың, Дәу су мақұлықтарының бастарын жойдың,"},
	{14, "14 Алып хайуанның бастарын мыжыдың, Өлігін жыртқыш аңдарға жем қылдырдың,"},
	{15, "15 Көздер мен бұлақтарды ашып ағыздың, Ешқашан суалмас өзендерді суалттың."},
	{16, "16 Күндіз бен түнге Өзің билік құрасың, Күн мен басқа аспан шырақтарын жараттың,"},
	{17, "17 Жер бетінің бар шектерін Сен бекіттің, Жаз бен қыс мезгілдерін де белгіледің."},
	{18, "18 О, Жаратқан, есіңе алшы дұшпанның мазағын, Зердесіз ұлттың өз есіміңді қорлағанын."},
	{19, "19 Жыртқышқа көгершініңнің жанын қимашы, Бейшара халқыңды мәңгілік ұмытпашы."},
	{20, "20 Жеріміз қара түнек пен зорлыққа толы, Жасаған Келісіміңе енді ден қойшы,"},
	{21, "21 Қаналған жандар қорлана шегінбесін, Қайта, жарлы-жақыбайлар атыңды дәріптесін!"},
	{22, "22 Уа, Құдай, көтеріліп, ісіңді қорғай көрші, Күнде ессіздің Өзіңді қорлағанын ескерші:"},
	{23, "23 Жауларыңның айқайын ұмыта көрме, Саған қарсы шыққандардың шуы күшеюде."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view74() {
struct kk74 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, Құрта көрме! әуенімен айтылатын Асафтың әні әрі жыры.)"},
	{2, "2 Саған мақтау айтамыз, уа, Құдайым! Сені дәріптейміз, бізге жақынсың, Паш етіледі керемет істерің."},
	{3, "3 Сен былай дедің: Кезін Мен белгілеймін, Әділетті сотты Өзім жүргіземін."},
	{4, "4 Шайқалады жер күллі тұрғындарымен, Тіреулерін оның берік ұстаймын Мен. //"},
	{5, "5 Бөсуіңді тоқтат! — дедім мақтаншаққа, Жұдырығыңды көтерме! — дедім арамзаға, —"},
	{6, "6 Көкке қарсы да жұдырығыңды көтерме, Тоңмойын болып паңдана сөйлеме!"},
	{7, "7 Шығыс, батыс не айдаладан келген Ешкім басқаны жоғарылатпас шынымен,"},
	{8, "8 Себебі сотты Құдайдың Өзі жүргізеді, Ол біреуді түсіріп, басқаны көтереді."},
	{9, "9 Жаратқанның қолында қаһарлы тостаған, Іші дәмдеуіштермен араласқан Көпірген жаңа шарапқа толған. Оны құйып береді Жаратқан, Бар зұлымдар ішуге тиіс содан, Сарқып ішеді тіпті ашытқысынан."},
	{10, "10 Ал мен Иемнің істерін мәңгі паш етемін, Жақыптың сиынған Құдайын әндетемін,"},
	{11, "11 Өйткені Құдай Иеміз былай деген: Мен зұлымдарды күшінен айырамын, Ал әділдің күш-қуатын молайтамын!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view75() {
struct kk75 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, ішекті аспаптардың сүйемелдеуімен орындалатын Асафтың әні әрі жыры.)"},
	{2, "2 Құдай танымал Яһуда елінде, Оның аты қастерлі Исраилде,"},
	{3, "3 Тұрағы Оның Иерусалимде, Киелі үйі Сион төбесінде."},
	{4, "4 Сонда Ол қиратты жаудың отты жебелерін, Һәм соғыс қалқандары мен семсерлерін.//"},
	{5, "5 Уа, Құдай, аңға толы таулардан гөрі Сен салтанаттысың әрі құдіретті."},
	{6, "6 Тоналды батыл жүректі ер адамдар, Терең ұйқыға батты мықты сарбаздар, Қол көтере алмайды бізге қарсы олар."},
	{7, "7 Уа, Жақыптың сиынатын Құдайы, Қатты дауыспен сөктің сол жауларды, Сонда бәрі тып-тыныш тұра қалды: Соғыс күймелері және аттары."},
	{8, "8 Уа, Құдай, айбаттысың, қаһарланғаныңда Кім тұра алар еді Сенің алдыңда?"},
	{9, "9 Жердегі бейшара жандарды құтқаруға Сен сот жүргізіп орныңнан тұрғанда, Көктен үкім шығардың күнәкарларға, Жер қорқып үнсіз тұрды Сенің алдыңда.//"},
	{10, "11 Пенденің ашуымен де даңқталасың, Оның қалған ашуын Өзің басасың."},
	{11, "12 Ей, айбатты Құдайдың маңындағылар, Жаратқан Иелеріңе беріңдер анттар, Әрі соларыңды мұқият орындаңдар, Барлығың Оған тартулар ұсыныңдар!"},
	{12, "13 Ол әміршілердің батылдығын жояды, Жер патшаларының үрейін ұшырады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view76() {
struct kk76 poems[] = {
	{1, "1 (Ән-күйдің жетекшісі Едутунге арналған Асафтың жыры.)"},
	{2, "2 Мен Құдайға дауыстап жалбарынамын, Құлақ түре көрсін деп Оған жалынамын."},
	{3, "3 Қиын кезде де Иеме бет бұрамын, Түнде қол жайып, тоқтамай сиынамын, Жан дүнием бас тартады жұбаныштан."},
	{4, "4 Қатты күйзелемін Құдайды есіме алсам, Рухым әлсірейді, егер де ойға шомсам. //"},
	{5, "5 Уа, Ием, Сен мені ұйықтатпайсың, Қатты абыржып, сөйлей де алмаймын."},
	{6, "6 Ежелгі заман жайлы ойланамын, Өткен ғасырларға ой саламын,"},
	{7, "7 Түнде айтқан әндерімді еске аламын, Рухым жауап іздеп, жүрекпен толғанамын."},
	{8, "8 Әлде Иеміз біржола бас тартты ма? Енді қайтып ықылас танытпай ма?"},
	{9, "9 Берік мейірімі мүлдем үзілді ме? Берген сөзі мәңгілік күйреді ме?"},
	{10, "10 Мейірленуді Құдай ұмытқан ба? Қаһары рақымын басып тастаған ба? //"},
	{11, "11 Мен былай деймін: Құдай Тағаланың Құдіреті өзгеріпті, бұл — нағыз азабым."},
	{12, "12 Ием, Сенің істеріңді еске аламын, Ежелгі кереметтеріңді ойға аламын,"},
	{13, "13 Бар іс-әрекетің жайлы ойланамын, Ұлы істерің жөнінде толғанамын. //"},
	{14, "14 Жолдарың Сенің, уа, Құдай, қасиетті, Өзіңдей тәңір бар ма құдіретті?"},
	{15, "15 Сен кереметтер жасайтын Құдайсың, Халықтарға күш-қуатыңды таныттың,"},
	{16, "16 Құдіретіңмен халқыңды құтқардың: Жақып пен Жүсіптің осы ұрпақтарын. //"},
	{17, "17 Уа, Құдай, Қамысты теңіз Сені көрді, Суы Өзіңді байқап үрейленді, Теңіздің тұңғиығы дүр сілкінді."},
	{18, "18 Бұлттар сонда жерге нөсер жаудырды, Аспанда күн күркіреп жаңғырды, Найзағай жебедей ұшып жарқылдады."},
	{19, "19 Құйында Сенің даусың күркіреді, Жай оты әлемге жарығын түсірді, Һәм жер беті шайқалып дірілдеді."},
	{20, "20 Сонда Сен теңіз арқылы жол жүрдің, Ұлан-ғайыр су арқылы қадам бастың, Ал көзге көрінбеді іздерің Сенің."},
	{21, "21 Содан халқыңды отардай бастадың Жетекшілігімен Мұса мен Һаронның."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view77() {
struct kk77 poems[] = {
	{1, "1 (Асафтың насихат жыры.) Уа, халқым, тәліміме көңіл бөлші, Айтатын сөздеріме құлақ түрші,"},
	{2, "2 Астарлы әңгімелерді айтамын, Әуелден бар құпияларды ашамын."},
	{3, "3 Өзіміз естіп білген әңгімелерді, Аталарымыз айтқан нәрселерді"},
	{4, "4 Солардың ұрпақтарынан жасырмаймыз, Келер буынға оларды жариялаймыз: Жаратқан Иенің даңқты істерін, Оның құдіреті мен кереметтерін."},
	{5, "5 Өйткені Иеміз Жақыптың ұрпағына Ережесін орнатып, Исраил халқына Арнап Таурат заңын шығарып тапсырды, Ол ата-бабаларымызға соларды Балаларына үйретуге бұйырды."},
	{6, "6 Келер ұрпақ оларды жақсы танысын, Кейін туар перзенттері де ұғынсын, Олар да өз балаларына үйретсін."},
	{7, "7 Осылай бұлар Құдайға үміт артсын, Оның кереметтерін есте сақтасын, Әрі өсиеттерін нық орындасын."},
	{8, "8 Олар бабаларындай істеп жүрмесін: Бас көтергіш қыңыр ұрпақ бола көрмесін, Жүректерін Құдайға арнаудан безбесін, Ой-ниеттері Құдайға сенімсіз болмасын. //"},
	{9, "9 Ефремнің ұрпақтары садақпен қаруланған, Ал шайқасар күні кері бұрылып қашқан,"},
	{10, "10 Құдайдың Келісімін сақтамаған, Таурат заңын ұстанудан бас тартқан,"},
	{11, "11 Құдайдың ежелгі істерін ұмытқан: Ғажап кереметтерін Ол жасаған"},
	{12, "12 Мысыр елінде, Соған алқабында Ата-бабаларының көз алдында."},
	{13, "13 Сол кезде Құдай теңізді қақ бөлген, Арғы жағаға халықты жеткізген, Теңіз суын қабырғадай тұрғызған,"},
	{14, "14 Күндіз бұлтты, түнде отты бағанамен Өзі оларды жетелеп бастап жүрген."},
	{15, "15 Шөл далада жартасты қақ айырған, Терең тұңғиықтан су шығарған, Халқының шөлін молынан қандырған."},
	{16, "16 Жартастан Жаратқан бұлақтар ағызған, Өзендей төмен қарай сарқыратқан."},
	{17, "17 Алайда халық күнә жасай берген, Хақ Тағалаға қарсы түзде бас көтерген,"},
	{18, "18 Талғамдарына қарай тамақ талап еткен, Тәңірді іштей сынап еркінсіген,"},
	{19, "19 Былай деп қарсы сөйледі Құдайға: Айдалада Құдай тамақ бере ала ма?"},
	{20, "20 Рас, жартасты ұрғанда су тасқындап, Жылғамен аға жөнелді сарқырап, Алайда Ол нан да бере ала ма, Етпен де халқын қамти ала ма?!"},
	{21, "21 Мұны естіп Жаратқан Ие ашуланды, Жақыпқа зәрінің оты тұтанды, Иә, Исраилге қатты қаһарланды,"},
	{22, "22 Өйткені олар Құдайға сенбеді, Оның құтқаруына үміттенбеді."},
	{23, "23 Бірақ та Ол бұлттарға бұйрық берді, Аспанның қақпаларын ашып берді,"},
	{24, "24 Халыққа жейтін маннаны жаудырды, Сөйтіп оларға нанды аспаннан жіберді,"},
	{25, "25 Адамдар періштелер нанын жеді, Қарындары тойғанша Құдай мол берді."},
	{26, "26 Құдай аспанда шығыстан жел тұрғызды, Құдіретімен оңтүстіктен жел соқтырды,"},
	{27, "27 Ол аспаннан тозаңдай мол ет жаудырды: Теңіз жағалауындағы құм сықылды Сансыз көп боп ұшып келген құстарды"},
	{28, "28 Халық қоныстанған жердің ортасына Қондырды, шатырларының маңайына."},
	{29, "29 Осылайша халық тойына ет жеді, Құдай оларға аңсағандарын берді,"},
	{30, "30 Ал құмартқан тамақтарын жеп болмастан, Ауыздарындағы етті жұтпастан,"},
	{31, "31 Оның зәрі оларға қарсы көтерілді, Ол ең мықты адамдарын өлтірді, Сұлатып исраилдік жас жігіттерді."},
	{32, "32 Алайда халық күнә жасай берді, Ғажаптарын менсінбей Құдайға сенбеді."},
	{33, "33 Сонда Ол күндерін бекер қылып қысқартты, Оларды қорқытып, жылдарын доғартты."},
	{34, "34 Құдай кейбіреулерін құртқанда, Басқалары Оған бет бұрды соңында, Өкініп, қайтты теріс жолдарынан, Сиына берді Құдайға таң азаннан."},
	{35, "35 Естеріне түсті: Құдай — құздай панамыз, Иә, Алла Тағала — Құтқарушымыз."},
	{36, "36 Олар жағымпазданды бірақ ауыздарымен, Жаратқанға жалған айтты тілдерімен,"},
	{37, "37 Шын жүректен Оған адал болмады, Келісімін Оның берік ұстанбады."},
	{38, "38 Алайда Құдай сондай шапағатты, Күнәларын кешіріп, оларды құртпады. Әлденеше рет Ол ашуын басты, Жалынды қаһарын толық тұтатпады,"},
	{39, "39 Олардың тәндік екенін ұмытпады, Шыққан демдей қайтпайтынын ұғынды."},
	{40, "40 Қанша рет олар иен түзде бас көтерді, Айдалада Оны қапаландырды!"},
	{41, "41 Қайта-қайта еркінсіп сынап Құдайды, Исраилдің Киелі Құдайын қайғыртты,"},
	{42, "42 Олар ұмытты Оның шексіз құдіретін, Қанаған жауларынан құтқарған кездерін:"},
	{43, "43 Мысырда көрсеткен ғажап істерін, Соған алқабындағы кереметтерін,"},
	{44, "44 Мысыр өзендерін Ол қанға айналдырды, Ағынынан ешкім су іше алмады,"},
	{45, "45 Оларға шақсын деп көптеп масаларды, Зақымдасын деп жіберді бақаларды,"},
	{46, "46 Шегіртке құрттарына қиды егіндерін, Шегірткелерге еңбектерінің өнімдерін,"},
	{47, "47 Бұршақпен жойды Ол жүзім бақтарын, Аязбен қиратты тұт ағаштарын."},
	{48, "48 Жаудың малына да бұршақты жаудырды, Табындарын найзағай астында қалдырды."},
	{49, "49 Құдай қаһарының тізгінін ағытты, Ашу-ызасы мен қастығын танытты, Құртушы хабаршыларын жөнелтті,"},
	{50, "50 Лаулаған қаһарына Тәңір жол берді, Ажалдан жаудың жандарын сақтамады, Оларды обаның індетіне табыстады."},
	{51, "51 Мысырдың тұңғыштарының құртты көздерін, Хамның үйлеріндегі мықты өскіндерін."},
	{52, "52 Ал Құдай өз халқын алып шықты қойлардай, Иен далада бастап жүрді отардай,"},
	{53, "53 Оларды аман-есен жетеледі, Сонда халық ешқандай үрейленбеді, Бірақ жауларын теңіз жалмап жіберді."},
	{54, "54 Құдай халқын әкелді киелі еліне, Құдіретпен иемденген таулы өлкесіне,"},
	{55, "55 Алдарынан ұлттарды шығарды қуып, Олардың жерлерін мұраға берді бөліп, Үйлерін де Исраил руларына мекендетіп."},
	{56, "56 Бірақ олар әлі де Құдайды сынады, Бас көтеріп, Хақ Тағалаға бағынбады, Оның берген жарлықтарын сақтамады, Бабаларының қылықтарын қайталады,"},
	{57, "57 Құдайдан бас тартып опасыздық жасады, Кеуіп қалған садақтай сенімсіз болды."},
	{58, "58 Биіктеу жерлерде тәңірсымақтарға арнап Ғибадат ететін орындарын салып, Құдайдың ашу-ызасын туғызды, Жалған тәңір мүсіндерін тұрғызды, Құдайдың зор қызғанышын тудырды."},
	{59, "59 Мұны естіп Құдайдың қаһары тұтанды, Ол Исраилден жиреніп мүлдем бас тартты,"},
	{60, "60 Содан тастап кетті Шилодағы тұрағын, Адамдар арасындағы киелі шатырын."},
	{61, "61 Ол тіпті өз құдіретін паш еткен сандығын Халқының жауларының қолына түсірді, Иә, Өзінің ұлылығының осы белгісін Сол дұшпандарының қолдарына тапсырды!"},
	{62, "62 Құдай меншікті халқына қаһарланды, Семсер жүзіне оларды табыстады,"},
	{63, "63 Халықтың жас жігіттерін өрт жалмады, Қыздарына той әндері айтылмады,"},
	{64, "64 Діни қызметкерлері семсерден құрыды, Жесірлері жоқтау да айта алмады."},
	{65, "65 Соңында Иеміз тұрды ұйқыдан оянғандай, Ішіп алып қызбаланған балуандай,"},
	{66, "66 Жауларына соққы беріп, кері тойтарды, Оларды шексіз масқараға қалдырды."},
	{67, "67 Кейін Тәңір Жүсіптің әулетін таңдамады, Ол Ефрем руын басшылыққа қоймады,"},
	{68, "68 Орнына таңдап алды Яһуда руын, Әрі Өзі қатты ұнатқан Сион тауын,"},
	{69, "69 Киелі үйін зәулім аспандай орнатты, Жер іспетті оны мәңгілікке нығайтты."},
	{70, "70 Қызметшісі етіп Дәуітті таңдады, Қой отарынан Құдай оны шақырды,"},
	{71, "71 Саулық бағып жүрген жерінен алдырды, Жақыптың ұрпақтарын оған бақтырды, Меншікті Исраил халқын қамқорлатты."},
	{72, "72 Ол халқын бағып жүрді шын жүректен, Жетелеп алып жүрді епті қолымен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view78() {
struct kk78 poems[] = {
	{1, "1 (Асафтың жыры.) Уа, Құдай, Өзіңе бағынбаған ұлттар Сенің меншікті еліңді басып, олар Сенің киелі үйіңді арамдады, Иерусалимді қиратып, талқандады."},
	{2, "2 Жау Сенің қызметшілеріңнің мәйіттерін Құстарға жемтік етіп тастап кеткен, Олар адал адамдарыңның денелерін Жабайы аңдардың азығы еткен,"},
	{3, "3 Солардың қанын Иерусалимді Айналдыра ағызды су тәрізді, Сүйектерін жерлейтін қалдырмады ешкімді."},
	{4, "4 Көршілеріміз бізді келеке қылуда, Маңымыздағылар мазақтап қорлауда. //"},
	{5, "5 Қашанғы бізге ашуланасың ұдайы, Уа, Ием, қашанғы қаһарың оттай лаулайды?"},
	{6, "6 Ашуыңды төксеңші соның орнына Өзіңді мойындамайтын бөтен ұлттарға, Саған сиынбайтын патшалықтарға."},
	{7, "7 Олар Жақыптың ұрпақтарын жалмады, Мекен-тұрағын қиратып, бос қалдырды."},
	{8, "8 Бізге аталарымыздың күнәларын артпашы, Қайта, өз рақымыңды бізге тезірек жолдашы, Өйткені әлсіреп түңілдік аса қатты."},
	{9, "9 Құтқарушы Құдайымыз, бізді қолдай гөр, Атыңның даңқына бола азат ете гөр, Есіміңе бола бар күнәмізді кешіре гөр."},
	{10, "10 Бізді Өзіңе бағынбаған халықтардың Құдайы қайда екен бұлардың? Деген мазағына неге қалдырасың? Олар Сенің қызметшілеріңнің қанын төкті, Әділ жаза тартқандарын бізге көрсетші."},
	{11, "11 Тұтқындардың күңіренісіне құлақ салшы, Ұлы құдіретіңмен әрекет жасашы, Өлімге кесілгендерді аман сақташы."},
	{12, "12 Көршілерімізге, уа, Ием, өз атыңды Қорлағандарын жеті еселеп қайтаршы."},
	{13, "13 Бағып жүрген халқың әрі отарыңбыз, Сондықтан Өзіңді мәңгі мадақтаймыз, Күллі ұрпаққа ұлылығыңды даңқтаймыз."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view79() {
struct kk79 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, Келісім қызғалдағы әуенімен айтылатын Асафтың жыры.)"},
	{2, "2 Уа, Исраилдің Бағушысы, құлақ түрші, Бейне қой отарындай жетелейсің Жүсіпті. Уа, керубтер арасында тақта Отырушы, Өзіңнің нұрлы салтанатыңды жайнатшы."},
	{3, "3 Ефрем, Бунямин, Манаса руларының Көз алдында зор күшіңді көрсетші, Өзің келіп, бізді құтқарсаң етті!"},
	{4, "4 О, Құдай, бізді қайтаршы өз жолыңа, Бет нұрыңды төксең бізге тағы да, Құтқарылатын боламыз осылайша."},
	{5, "5 Уа, Жаратқан, Әлемнің Иесі — Құдайсың, Қашанғы өз халқыңа ашуланасың, Мінажаттарымыздан мүлдем бас тартасың?"},
	{6, "6 Сен халқыңды көз жасымен тойындырдың, Иә, көз жасымен шөлімізді әбден қандырдың,"},
	{7, "7 Сөйтіп мазақтаттың бізді көршілерімізге, Дұшпандарымыз табалап келекелеуде."},
	{8, "8 Уа, Әлемнің Иесі — Құдай Тағала, Бізді қайтара гөр өз тура жолыңа, Бет нұрыңды төксең бізге тағы да, Құтқарылатын боламыз осылайша."},
	{9, "9 Бізді Мысырдан жүзім бұтасындай әкелдің, Басқа ұлттарды елден қуып шығардың, Солардың орнына бізді отырғыздың."},
	{10, "10 Ол үшін тазартып, өңдедің жерді, Сол бұта тамыр жайып, толтырды елді,"},
	{11, "11 Оның көлеңкесі тауларды жапты, Сабақтары зор самырсындарды басты."},
	{12, "12 Бұтақтары созылды теңізге дейін, Өркендері — Евфрат өзеніне дейін."},
	{13, "13 Енді неге қоршаған дуалын қираттың? Қасынан өткеннің бәрі жұлды жемісін,"},
	{14, "14 Орман қабаны түбін қазып, қопаруда, Түз аңдары жайылып, бұтаңды жалмауда!"},
	{15, "15 Уа, Әлемнің Иесі, қайта оралсаңшы, О, Құдай, көктен жерге көз салсаңшы, Осы жүзім бұтасын қамқорлашы,"},
	{16, "16 Құдіретті қолыңмен оны отырғыздың, Сабақтарын Өзіңе арнап өсірдің."},
	{17, "17 Жүзім бұтаңды шауып, өртеді жаулар, Бетіңнің ызбарынан жойылады олар."},
	{18, "18 Қолдай гөр оң жағыңдағы халқыңды, Өзіңе арнап нығайтқан ұлтыңды."},
	{19, "19 Сенен енді қайтып безбейміз сонда, Сиынатын боламыз Сенің атыңа, Өмірімізді жаңарта гөр тағы да."},
	{20, "20 Уа, Әлемнің Иесі — Құдай Тағала, Бізді қайтара гөр өз тура жолыңа, Бет нұрыңды төксең бізге тағы да, Құтқарылатын боламыз осылайша."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view80() {
struct kk80 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, ғаттық күй аспабының сүйемелдеуімен айтылатын Асафтың жыры.)"},
	{2, "2 Күш-қуатымыз — Құдайға шаттана ән салыңдар, Жақып сиынған Құдайға қуана айқайлаңдар,"},
	{3, "3 Ән-жырлар айта бастап, даңғыраны соғыңдар, Домбыра, жетігенмен әсем әуен тартыңдар!"},
	{4, "4 Жаңа ай туғанда кернейде ойнаңдар, Ай толғанда да тойымызды жариялаңдар."},
	{5, "5 Өйткені бұл — Исраил халқының міндеті, Жақып сиынған Құдайдың берген ережесі."},
	{6, "6 Жаратқан Иеміз Мысырға қарсы шыққанда, Осыны бұйырды Жүсіптің ұрпағына, Біз бөтен тілді естіген уақытта."},
	{7, "7 (Жаратқан былай деп білдірді бұйрығын:) Иықтарыңнан ауыр жүкті алып тастадым, Қолдарыңды көтерген себеттен босаттым."},
	{8, "8 Қиын кезде айқайлап сиындыңдар Маған, Сонда сендерді азат етіп алдым аман. Күннің күркірінен сендерге құлақ салғам, Меріба сулары маңында сендерді сынағам. //"},
	{9, "9 Халқым, Мені тыңда, сендерге ескертемін, Игі болар, Исраил, Маған құлақ түргенің!"},
	{10, "10 Ешқандай да бөгде тәңірлерің болмасын, Құлшылық етпеңдер жат тәңірлерге ешқашан!"},
	{11, "11 Мен Жаратқан Ие — бірден-бір Тәңірлеріңмін, Мысыр елінен алып шыққан Иелеріңмін. Ал енді, ауыздарыңды ашыңдар айқара, Мен оларды толтырамын жақсылыққа."},
	{12, "12 Бірақ таңдаған халқым Мені тыңдамады, Исраилдің ұрпағы Маған бағынбады,"},
	{13, "13 Сондықтан Мен қасарысқан жүректеріне Жол бердім өз беттерімен жүрулеріне."},
	{14, "14 Халқым Менің сөзіме құлақ салса екен, Исраилдің ұрпағы жолыммен жүрсе екен!"},
	{15, "15 Онда Мен жауларын лезде жуасытар едім, Қинаған дұшпандарына қол жұмсар едім,"},
	{16, "16 Өзімді жек көргендер Маған бағынғансыр еді, Ал азапты уақыттары мәңгіге созылар еді."},
	{17, "17 Бірақ сендерді жақсы бидаймен тойдырар едім, Жартастағы балмен рақатқа қандырар едім."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view81() {
struct kk81 poems[] = {
	{1, "1 (Асафтың жыры.) Құдай үлкен мәжілісін басқарады, Сонда Ол билерге үкім шығарады:"},
	{2, "2 Қашанғы әділетсіз үкім айтпақсыңдар, Зұлымдарға оң қабақ танытпақсыңдар? //"},
	{3, "3 Жарлы мен жетімнің мүддесін қорғаңдар, Бейшара кедейге әділдік жасаңдар!"},
	{4, "4 Шарасыз бен мұқтажды құтқарыңдар, Зұлымның шеңгелінен оны босатыңдар!"},
	{5, "5 Ештеңе ұқпастан, ештеңе білместен, Қанаушылары түнекте жүріп келген, Содан елдің бар негізі дірілдеген!"},
	{6, "6 Былай деген едім: Сендер құдайсыңдар, Бәрің Хақ Тағаланың рухани ұлысыңдар,"},
	{7, "7 Дегенмен жай пендедей құрисыңдар, Әрі әміршідей қаза табасыңдар."},
	{8, "8 Уа, Құдай, көтеріліп, жерді сотташы, Сен иемденесің ғой бар халықтарды!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view82() {
struct kk82 poems[] = {
	{1, "1 (Асаф сөзін жазған ән әрі жыр.)"},
	{2, "2 Уа, Құдайым, үндемей қала берме, Тіл қатпастан тып-тыныш бола көрме,"},
	{3, "3 Себебі жауларың у-шу көтеруде, Сені жек көретіндер өркөкіректенуде."},
	{4, "4 Халқыңа қарсы олар сұмдық ойласуда, Өзіңе қымбат жандарға қарсы ақылдасуда:"},
	{5, "5 Кәне, құртайық оларды ұлттар арасынан, Исраил аталмасын енді қайтып ешқашан."},
	{6, "6 Бірауыздан олар сөз байласып Жатыр, Саған қарсы одақ құрып:"},
	{7, "7 Шатырларда тұрған едомдықтар, Ысмағұлдық, моабтық, ажарлықтар,"},
	{8, "8 Гебалдық, аммондық, амалектіктер, Тирдің тұрғындары мен філістірлер."},
	{9, "9 Ассурдың халқы да оларға қосылды, Луттың ұрпақтарына қолдаушы болды. //"},
	{10, "10 Сен ежелде Мадиян тайпасына, Сисара мен Ябинге Қишон аңғарында Істегеніңдей істеші жауларымызға!"},
	{11, "11 Сол байырғылар Ендорда талқандалды, Төгілген қи-қоқыстай жерге тапталды."},
	{12, "12 Істеші жаулардың әміршілеріне Ежелде істегеніңдей Ориб пен Зипке, Істеші олардың бар көсемдеріне, Өзің істегеніңдей Салман мен Зебейге, Өйткені жау былай деді біз жөнінде:"},
	{13, "13 Құдайдың мекендерін иемденейік, Жайылымдарын қолға түсірейік! //"},
	{14, "14 Зұлымдарды етші құйын соққан тозаңдай, О, Құдайым, жел ұшырған сабандай"},
	{15, "15 Әрі от жалмап қойған ормандай, Жалын күйреткен қырат басындай."},
	{16, "16 Дұшпанды қуып шықшы елден құйыныңмен, Дүрбелеңге түсірші Өзіңнің дауылыңмен,"},
	{17, "17 Уа, Жаратқан жауды қара бет қылып масқарала, Олар Саған бұрылып, сиынсын атыңа. //"},
	{18, "18 Ал қыңырлары лайым қысылып абыржысын, Олар қорланып, ақырында өлім құшсын,"},
	{19, "19 Жаратқан Ие деп аталған жалғыз Сенің Бүкіл жер бетіне билік жүргізетін Хақ Тағала екеніңді барлығы білсін!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view83() {
struct kk83 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған, ғаттық жетігеннің сүйемелдеуімен айтылатын Қорах ұрпақтарының жыры.)"},
	{2, "2 Өзіңнің тұрағың жер бетіндегі Қандай сүйкімді, уа, Әлемнің Иесі!"},
	{3, "3 Жан дүнием Жаратқанның киелі үйіндегі Аулаларына баруды аңсап, әлсірейді, Мәңгі тірі Құдайға жан-тәнім әндетеді."},
	{4, "4 Тіпті торғай да қонатын жерін тауып алды, Қарлығаш балапандарын басуға ұя салды: Маңайында Сенің құрбандық үстелдеріңнің, Уа, Әлемнің Иесі, Патшам, Құдайым менің!"},
	{5, "5 Киелі үйіңде тұратындар сондай бақытты, Әрқашан да олар Саған мақтау айтады!"},
	{6, "6 Сенің күшіңе кенеле берген, ой-ниеті Өзіңе бағытталған жандар қандай бақытты!"},
	{7, "7 Жылау аңғарымен жүріп су көздерін ашады, Содан күзгі жаңбыр жауғандай жер жарылқанады."},
	{8, "8 Олар жол жүргенде күш-қуаты өсе береді, Ақыры Сионда Құдайдың алдына келеді."},
	{9, "9 Уа, Жаратушы Құдай, Әлемнің Иесі, Өзіңе арнаған дұғамды ести көрші, Жақып сиынған Құдай, құлақ түре көрші."},
	{10, "10 Уа, Құдай, біздің қорғаушымыз, көңіл бөле гөр, Таңдап алған патшаңа көз қырыңды сала гөр."},
	{11, "11 Бір-ақ күн болғаным киелі үйіңнің ауласында Мың күннен жақсы өткізген өзге орында. Мен қақпасында тұруды Құдайымның үйінде Артық көрем жайлы өмірден сұмдардың үйінде."},
	{12, "12 Себебі Құдай Ие күн мен қалқанға ұқсайды, Жаратқан Ием рақым мен ұлылық сыйлайды, Ол тура жолменен жүретін адамдарды Сыйлайтын игіліктерінен құр қалдырмайды."},
	{13, "13 Уа, әлемнің құдіретті Иесі — Жаратқан, Қандай бақытты Өзіңе сенім артқан жан!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view84() {
struct kk84 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Қорахтың ұрпақтарының жыры.)"},
	{2, "2 Уа, Ием, Сен еліңе рақымды болдың, Жақыптың ұрпағын тұтқыннан қайтардың."},
	{3, "3 Халқыңның кінәсіне кешірім жасадың, Барлық күнәларын да жауып тастадың. //"},
	{4, "4 Сонда Сен ашу-ызаңды түгел бастың, Жалындаған қаһарыңнан бас тарттың."},
	{5, "5 Құтқарушымыз Құдай, қалпымызға келтірші, Бізге деген наразылығыңды бәсеңдетші."},
	{6, "6 Әлде мәңгі бізге қаһарлана бермекпісің, Ұрпақтан ұрпаққа ашуыңды төкпекпісің?"},
	{7, "7 Өз халқыңның Саған шаттануы үшін Өмірімізді қайтадан жаңартпаймысың?"},
	{8, "8 Бізге тұрақты рақымыңды таныта көрші, Уа, Жаратқан, пәледен құтқара көрші."},
	{9, "9 Құлақ түремін Құдай Иенің айтарына, Тыныштықты уәде етеді Ол өз халқына — Таңдап алған өз адал адамдарына, Халық тек қайтпаса ақымақтық жасауына!"},
	{10, "10 Сөз жоқ, Өзін қастерлейтін жандарды Құдай жақында құтқаратын болады, Осылайша Оның даңқты ұлылығы Елімізге орнығатын болады."},
	{11, "11 Сонда рақым мен шындық бірге кездеседі, Әділдік пен татулық бір-біріне сәйкес келеді."},
	{12, "12 Адалдық жер бетінен көктеп шығады, Әділдік көктен төмен қарап тұрады."},
	{13, "13 Шынымен Жаратқан Ие игілік сыйламақ, Содан жеріміз бізге өнімін ұсынбақ,"},
	{14, "14 Жаратқанның алдынан әділдік жүрмек, Оның жүретін жолдарын дайындап бермек."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view85() {
struct kk85 poems[] = {
	{1, "1 (Дәуіттің мінажаты.) Уа, Жаратқан, жарлымын, зәрумін көмегіңе, Құлақ тосып, жауап берші өтінішіме."},
	{2, "2 Құдайым, қорғай гөр жанымды Саған арналған, Құтқара гөр құлыңды Өзіңе сенім артқан."},
	{3, "3 Рақымыңды түсіре гөр, уа, Жаратқан Ием, Күнде Саған үздіксіз сиына берем."},
	{4, "4 О, Жаратқан, жадырата гөр пендеңнің жанын, Себебі бір Өзіңе сенімімді артамын."},
	{5, "5 Уа, Ием, Өзіңе сиынғанның барлығына Кешірімді де ізгісің, шексіз рақымды да."},
	{6, "6 О, Жаратқан, мінажатыма құлақ сала гөр, Жалбарынған дауысыма көңіліңді бөле гөр."},
	{7, "7 Тек Өзіңе сиынамын күн туғанда басыма, Өйткені жауап бересің Сен мінажатыма."},
	{8, "8 Уа, Ием, ұлттардың табынатын тәңірлері Арасында жоқ Сендей бірде-біреуі! Сенің жасаған кереметтерің іспетті Жоқ басқа ешкімнің де ғажайып істері."},
	{9, "9 Өзің жаратқан күллі ұлттар алдыңа келеді, Есіміңді ардақтап бастарын иеді."},
	{10, "10 Себебі Сен ұлысың, ғажап істер жасайсың, Уа, Жаратқан Ие, жалғыз Өзің Құдайсың!"},
	{11, "11 О, Жаратқан, ақ жолыңа бағыттай гөр мені, Өзіңнің шындығыңа сәйкес жүргім келеді, Тек Сені ардақтауға нығайтшы жүрегімді."},
	{12, "12 Уа, Құдай Ием, Өзіңді шын жүректен мақтаймын, Әрі Сенің есіміңді мәңгі бақи даңқтаймын."},
	{13, "13 Сондай зор Сенің маған түсірген шапағатың, О дүниенің тұңғиығынан аман сақтадың!"},
	{14, "14 Тәкаппар жандар маған қарсы бас көтереді, Қатыгездер тобы мені құртқысы келеді, Олар Саған мойынсұнып, менсінбейді."},
	{15, "15 Ал Сен рақымды да қайырымды Құдайсың, Уа, Ием, Сен тез қаһарланбайсың, Шексіз Сенің мейірімің мен адалдығың."},
	{16, "16 Маған көз қырыңды салып рақым ете көрші, Қызметшіңмін, нығайтып, аман сақтай көрші,"},
	{17, "17 Маған ізгілікпен қарайтыныңды көрсетші! Уа, Жаратқан, жауларым соны көріп, ұялсын, Өйткені Өзің маған демеу болып, жұбаттың."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view86() {
struct kk86 poems[] = {
	{1, "1 (Қорахтың ұрпақтарының әні әрі жыры.)"},
	{2, "2 Қала іргесін салды Құдай қасиетті тауда, Сионның қақпалары ұнамдырақ Жаратқанға Жақып ұрпағының барлық басқа тұрағынан да."},
	{3, "3 Уа, Құдайдың қаласы, сен жайында Керемет жақсы жайттар айтылуда. //"},
	{4, "4 Өзімді танып білетіндер арасынан Мысыр мен Бабыл елдерін атаймын, Сондай-ақ філістір, Тир, Құш тұрғындарын: Бұлар — Сионда туғандар деп санаймын."},
	{5, "5 Жұрт былай демек Сион қаласы жайында: Осындай да осындай ер туған мұнда, Қаланы Өзі бекіткен Құдай Тағала."},
	{6, "6 Жаратқан Ие тіркегенде халықтарды: Бұлар — Сионда туғандар деп жазады. //"},
	{7, "7 Жұрт былай дер ән айтып, күй ойнаған кезде: Өмірімнің қайнар көздері бір Өзіңде."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view87() {
struct kk87 poems[] = {
	{1, "1 (Қорахтың ұрпақтарының әні әрі жыры. Ән-күйдің жетекшісіне арналған, Ауыртпалық шегу әуенімен айтылатын езрахтық Хеманның насихат жыры.)"},
	{2, "2 Уа, Жаратқан Ием — Құтқарушы Құдайым, Күні-түні дауыстап Саған сиынамын."},
	{3, "3 Мінажатым Сенің алдыңа жетсінші, Дауыстаған айқайыма құлақ түрсеңші."},
	{4, "4 Өйткені жан дүнием қайғыға толды, Өмірім ажалға жақындап қалды,"},
	{5, "5 Көрге түсетіндер арасынан саналдым, Күші жоқ, әлсіз адамға ұқсас болдым."},
	{6, "6 Осылай өлілер қатарына қалдырылдым, Қаза тауып, қабірде жатқандардаймын, Сен оларды енді қайтып еске алмайсың, Аласталды олар қамқорлығыңнан Сенің."},
	{7, "7 Сен мені қап-қараңғы тұңғиыққа Салып қойғансың, ең терең шұңқырға."},
	{8, "8 Үстімді зілдей басады қаһарың, Мені жаншиды барлық толқындарың, //"},
	{9, "9 Жолдастарымнан мені алшақтаттың, Оларға мені жек көрінішті қылдың, Ешқайда шыға алмай құрсаудамын,"},
	{10, "10 Көп жылап бұлыңғырланды қос жанарым. Уа, Жаратқан, күнде дауыстап Саған сиынамын, Ием, қолдарымды Өзіңе қарай жаямын."},
	{11, "11 Әлде өлгендер үшін керемет жасайсың ба, Сүйектер қайта тұрып, Сені мадақтай ма? //"},
	{12, "12 Көрде Сенің рақымың уағыздала ма, Қабірде шындығың жариялана ма?"},
	{13, "13 Түнектегілер кереметтеріңді біле ме, Ұмыт болғандар әділдігіңді түсіне ме?"},
	{14, "14 Уа, Жаратқан, дауыстап Саған сиынамын, Таң ата алдыңа жетеді мінажатым."},
	{15, "15 О, Ием, неге менен бас тартасың? Бет-жүзіңді неліктен менен жасырасың? //"},
	{16, "16 Жасымнан әлсіз болдым, өлім жүрді жақын, Айбыныңнан қорқып әлсіреп шаршадым."},
	{17, "17 Қаһарыңның оты үстімнен басып өтті, Зор қорқынышың мені тас-талқан етті,"},
	{18, "18 Олар тасқын судай ұзақты күн қоршайды, Жан-жақтан қаһарың мені қыспақтайды."},
	{19, "19 Таныс-достарымды менен алшақтаттың, Тас түнек айналды серігіме ең жақын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view88() {
struct kk88 poems[] = {
	{1, "1 (Езрахтық Етанның насихат жыры.)"},
	{2, "2 Зор рақым-шапағатыңды, уа, Жаратқан, Әр уақытта мен ән-жырға қосамын, Сөзіңе беріктігіңді Өзіңнің Бар ұрпақтарға айтатын боламын."},
	{3, "3 Солай Сенің тұрақты рақымыңның Мәңгілік екенін жариялаймын. Өзіңнің шындығыңды көкте бекіттің, (Өйткені Сен мынаны айтқан едің:)"},
	{4, "4 Мен таңдаулыммен Келісім жасадым, Қызметшім Дәуітке былай деп ант бердім:"},
	{5, "5 Әулетіңді әрқашан да нығайтамын, Ұрпақтан ұрпаққа тағыңды орнатамын. //"},
	{6, "6 Уа, Жаратқан, көкте даңқталар кереметтерің, Қасиеттілер жиынында — өз беріктігің."},
	{7, "7 Көктегі кім Иемізбен теңесе алар, Күштілер арасында кім Жаратқанға ұқсар?"},
	{8, "8 Қасиетті періштелердің үлкен тобы Терең қастерлейді айбынды Құдайды, Биік тағын айналдыра Оны құрметтейді."},
	{9, "9 Уа, Жаратушы Құдай, Әлемнің Иесі, Саған ұқсас кім бар, сондай құдіретті? Адалдығың жан-жақтан қоршайды Сені."},
	{10, "10 Уа, Ием, буырқанған теңізге билік айтасың, Көтерілген толқындарын тыншытасың."},
	{11, "11 Паң мысырлықты Сен талқандап қираттың, Жауларыңды күшті қолыңмен шашыраттың."},
	{12, "12 Көк те — Сенікі, жер де — өз меншігің, Негізін салдың Сен күллі әлемнің, Әрі жараттың ондағылардың бәрін."},
	{13, "13 Сен жараттың солтүстік, оңтүстікті де, Табор, Хермон таулары қуанады есіміңе."},
	{14, "14 Қолың мен білегің ерен қуатты, Оң қолың барлығынан да жоғары."},
	{15, "15 Әділдік, әділет — тағыңның негізі, Рақым мен адалдық алдыңда жүреді."},
	{16, "16 Мадақтау жиналысына шақырған Қуанышты дауысты танып, қосылған Халық сондай бақытты, өйткені оған Жүзіңнің нұрында жүру бұйырылған,"},
	{17, "17 Күні бойы олар ұлы атыңа қуанады, Әділдігің оларды жоғарылатады."},
	{18, "18 Бұлардың күші мен ұлылығы Өзіңнен, Сенің рақымыңмен патшамыз күшейген."},
	{19, "19 Себебі қорғанышымыз — Жаратқан Иеден, Біздің патшамыз — Исраилдің киелі Тәңірінен."},
	{20, "20 Уа, Жаратқан, бірде Сен аян берген едің, Адал кісіңе мынадай сөз айтқан едің: Мен жауынгер адамға күш-қуат дарыттым, Халықтан оны таңдап ап, жоғарылаттым:"},
	{21, "21 Осы қызметшім Дәуітті тауып алдым, Арнайы майымды оған жақтырттым, Патша болуға оны тағайындаттым."},
	{22, "22 Ұдайы оны қорғап-қолдайтын боламын, Әрдайым күш-қуат сыйлайтын боламын."},
	{23, "23 Жау одан амалын асыра алмайды, Зұлымдар тықсырып, жеңе алмайды,"},
	{24, "24 Оның алдынан жауларын құртамын, Өзін жек көргендерді қиратамын."},
	{25, "25 Берік рақымыма Дәуіт ие болады, Өз атыма бола оның күші артады,"},
	{26, "26 Дәуіттің билігін Жерорта теңізіне Создырам, әрі шығыстың өзендеріне."},
	{27, "27 Ол былай деп атамақ атымды Менің: Сен Әкемсің, Құдайымсың өзімнің, Жартастай паналайтын Құтқарушымсың."},
	{28, "28 Мен оны Тұңғышым деп белгілеймін, Жер патшаларынан үстем етемін."},
	{29, "29 Мейірімімді оған мәңгі сақтаймын, Келісімімнен ешқашан бас тартпаймын."},
	{30, "30 Дәйім оның ұрпағын нығайтамын, Тағын да көк іспетті шексіз орнатамын. //"},
	{31, "31 Ал ұлдары тастаса Таурат заңымды, Әрі орындамаса бұйрықтарымды,"},
	{32, "32 Егер бұзып жатса ережелерімді, Сақтаудан бас тартса өсиеттерімді,"},
	{33, "33 Онда күнәлары үшін таяқпен ұрамын, Зұлым істері үшін қамшымен соғамын."},
	{34, "34 Ал Дәуіттен мейірімімді қайтып алмаймын, Өз адалдығымнан ешқашан таймаймын,"},
	{35, "35 Мен Келісімімді еш уақытта бұзбаймын, Аузымнан шыққан сөзді өзгертпеймін."},
	{36, "36 Мен Дәуітке ант еткенмін біржолата, Қасиеттімін, жалғандық айтпаймын да:"},
	{37, "37 Әулеті жалғасады шексіз уақытқа, Оның патшалық тағы Менің көз алдымда, Күн іспетті ол әрдайым бар болады да,"},
	{38, "38 Ай іспетті ол тұрақты болып орнайды, Аспандағы адал айғаққа ұқсайды. //"},
	{39, "39 Ал қазір Сен тағайындаған патшаңнан Сырт айналдың, жаратпай ашуландың оған,"},
	{40, "40 Қызметшіңмен жасаған Келісіміңнен тандың, Оның тәжін жерге лақтырып арамдадың."},
	{41, "41 Күллі қамалдарын жойып қираттың, Қорғандарын үйіндіге айналдырдың."},
	{42, "42 Жолшыбай өткендер оны тонайды, Көршілері келекелеп мазақтайды."},
	{43, "43 Оның жауларын күшейтіп, үстем еттің, Барлық дұшпандарын шаттыққа кенелттің."},
	{44, "44 Патшаның семсерінің жүзін мұқалттың, Шайқаста оны қорғап-қолдамадың."},
	{45, "45 Оның жарқын салтанатын тоқтаттың, Әрі патшалық тағын жерге құлаттың."},
	{46, "46 Сен патшаның жастық шағын қысқарттың, Масқараны оған шапандай жаптың. //"},
	{47, "47 Қашанғы, уа, Жаратқан, жасырынбақсың? Ием, мәңгі лаулай ма оттай қаһарың?"},
	{48, "48 Ескерші өмірімнің қысқалығын, Қандай бекершілікке адамзатты бұйырдың!"},
	{49, "49 Қай адам ғұмыр кешіп, өлімді көрмеді, Кім ажал тырнағынан өзін құтқарды? //"},
	{50, "50 Уа, Ием, қайда бұрынғы зор рақымың, Адалдығың мен Дәуітке берген антың?"},
	{51, "51 Ием, ескере гөр құлыңның мазақталғанын, Көп ұлттың мысқылының көңіліме батқанын,"},
	{52, "52 Уа, Жаратқан, жауларыңның балағаттағанын, Өзің бекіткен патшаңның істерін қорлағанын."},
	{53, "53 Жаратқан Ие мәңгілік мадақталсын! Аумин, иә, аумин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view89() {
struct kk89 poems[] = {
	{1, "1 (Құдайдың адамы Мұсаның мінажаты.)"},
	{2, "2 Уа, Ием, атам заманнан бері Өзің Баспанамыз біздің болып келесің."},
	{3, "3 Жаратылмай-ақ жер мен бүкіл әлем, Таулар жаратылмас бұрын бар боп келген, Мәңгі тірі болатын Құдайсың Сен!"},
	{4, "4 Қайт, адам баласы! деп қана айтсаң, Пендені топыраққа айналдырасың."},
	{5, "5 Ал бір мыңжылдық Сенің көз алдыңда Өте шыққан күн тәрізді қып-қысқа, Иә, түнгі күзеттей шектеулі ғана."},
	{6, "6 Сен лезде-ақ алып кетесің пендені, Ол бір көрініп, жоқ болар түс секілді, Яки далада өскен шөп тәрізді: Таң ата шықса да көгеріп, Кешке қарай қурап қалады семіп."},
	{7, "7 Осылай біз жоқ боламыз ашуыңнан, Зәреміз ұшады Сенің қаһарыңнан."},
	{8, "8 Сен күнәларымызды қойдың алдыңа, Нұрыңда айқын құпияларымыз да."},
	{9, "9 Өмір бойы бізге қаһарың төнеді, Жылдарымыз күрсінумен бітеді."},
	{10, "10 Ғұмырымыз жетпіс жасқа созылар, Күш-қуат жетсе, мүмкін, сексен болар, Жақсы кезде де шегеміз бейнет-азап, Ақыры ғайып боламыз, ғұмыр зырлап."},
	{11, "11 Қаһарыңның күшін кім түсінеді? Соған сай қастерлеу қажет Өзіңді."},
	{12, "12 Үйрете гөр ғұмырды есептеуді, Содан иемденейік дана жүректі."},
	{13, "13 Қашан райыңнан қайтасың, уа, Иеміз? Пенделеріңе шапағат тигізе гөр,"},
	{14, "14 Ертеңгісін бізді рақымыңа кенелте бер, Содан әндетіп шаттанайық күллі күндер."},
	{15, "15 Өткерген ауыр күндерімізге сәйкес, О, Тәңір, бізді шаттыққа кенелте гөр. Азап шеккен көп жылдарымызға сәйкес, Бұдан былай қуанышқа бөлей гөр."},
	{16, "16 Лайым пенделеріңе, уа, Иеміз, Керемет істеріңді көрсете гөр, Біздің ұрпақтарымызға да әр кез Шексіз ұлылығыңды паш ете гөр."},
	{17, "17 Құдай Иеміз бізге риза бола көрсін, Қолға алған ісімізді оңғара көрсін. Я, Құдай, ісімізді жарылқай гөр."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view90() {
struct kk90 poems[] = {
	{1, "1 Алла Тағаланың панасында тұрған адам Құдіреттінің саясынан табады тыным."},
	{2, "2 Мен Жаратқан Иеге былай дейтін болам: Бас сауғалайтын панам әрі қорғаным, Сенімімді Саған артам, уа, Құдайым!"},
	{3, "3 Хақ Тағала сені зұлымның тұзағынан Әрі жойқын обадан сақтайды аман."},
	{4, "4 Сені Өзінің қанатымен жауып алады, Қалқан мен қамалың — Оның адалдығы, Осылай өмірің қауіп-қатерсіз болады."},
	{5, "5 Түнде сен қара түнек қорқынышынан, Күндіз де қорықпайсың жау оғынан,"},
	{6, "6 Сескенбейсің түнгі індет-аурудан Һәм тал түсте басыңа төнген апаттан."},
	{7, "7 Қасыңда мыңдағандар қаза тапса, Оң жағыңда он мыңдап қырылғанда, Саған зақым жақындай алмайды да."},
	{8, "8 Тек болып жатқанды көріп тұрасың, Зұлымдардың жазаланғанын ұғасың."},
	{9, "9 Сен Жаратқанға сенім артып келесің, Алла Тағаланы панаң етесің,"},
	{10, "10 Басыңа енді жамандық түспейді, Үйіңе ешбір апат та төнбейді."},
	{11, "11 Періштелеріне Ол сен жайлы бұйрық береді: Қай жолмен жүрсең де, олар сені қорғап күзетеді,"},
	{12, "12 Сен аяғыңды тасқа соғып алмауың үшін Қолдарына көтеріп сені алып жүреді."},
	{13, "13 Жас арыстан мен оқжыланды аяқпен таптайсың, Үлкен арыстан мен абжыланды жаншып тастайсың."},
	{14, "14 Себебі Жаратқан Ие былай деп айтқан: Өзімді сүйгенді Мен құтқарып аламын, Өзімді мойындағанды қорғайтын боламын,"},
	{15, "15 Ол Маған сиынғанда құлақ саламын, Азап шеккен кезінде оған жар боламын, Аман-есен сақтап, құрметке бөлеймін."},
	{16, "16 Ғұмырын ұзақ қылып риза етемін, Құтқаруымды оған сыйлап беремін."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view91() {
struct kk91 poems[] = {
	{1, "1 (Демалыс күні айтылатын ән әрі жыр.)"},
	{2, "2 Қандай ғанибет — Жаратқан Иені мақтау, Уа, Хақ Тағала, есіміңе ән-жыр арнау,"},
	{3, "3 Таң ата жариялап рақымыңды, Кешке де Өзіңнің адалдығыңды,"},
	{4, "4 Он ішекті аспапта әсем күй тартып, Жетіген және домбырамен қосылып."},
	{5, "5 Уа, Ием, жаратқандарыңа шаттанамын, Ұлы істеріңе қуана ән саламын."},
	{6, "6 О, Ием, қандай керемет Сенің істерің, Түпсіз терең Сенің ой-ниеттерің!"},
	{7, "7 Ессіз адам ғана бұларды білмейді, Түйсіксіз жан мынаны түсінбейді:"},
	{8, "8 Зұлымдар қазір жерді шөптей қаптайды, Заңсыздық істейтіндер өркендейді, Ал кейін олар мәңгілікке құриды."},
	{9, "9 Бірақ Сен, уа, Ием, мәңгі үстемсің!"},
	{10, "10 О, Жаратқан, жауларың Сенің, Иә, бар жауларың да сөзсіз құриды, Сол зұлымдық жасайтындар шашырайды."},
	{11, "11 Маған жабайы бұқадай күш бердің, Басыма май жағып әлдендірдің,"},
	{12, "12 Жауларымның күйрегенін өзім көрдім, Маған қарсы бас көтерген зұлымдардың Жеңілісі туралы хабар алдым."},
	{13, "13 Әділ жан құрма ағашындай өркендейді, Ливандық самырсындай өсіп биіктейді,"},
	{14, "14 Жаратқанның үйінде ол тамыр жаяды, Құдайымыздың ауласында құлпырады,"},
	{15, "15 Жасы ұлғайса да, жемісін береді, Шырынды, ширақ болып қала береді,"},
	{16, "16 Жаратқан мінсіз, Ол — қорғанар жартасым дейді, Осылай Оның әділдігін паш етеді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view92() {
struct kk92 poems[] = {
	{1, "1 Жаратқан Ие — Патша, Ол билік жүргізуде, Ұлылыққа бөленіп, кенелген құдіретке. Орнынан қозғалмастай берік орнатылған әлем,"},
	{2, "2 Сенің құрметті тағың ежелден бекітілген, Уа, Ием, мәңгі бақи бар болып келесің Сен."},
	{3, "3 О, Жаратқан Ие, өзендер тасып күркірейді, Теңіз де толқындарын тұрғызып дүркірейді,"},
	{4, "4 Бірақ мол сулардың қатты шуылынан гөрі, Теңіз жағасына соққан толқындардан гөрі Көктегі Жаратқан Иенің құдіреті күшті!"},
	{5, "5 Уа, Ием, ережелерің шынымен сенімді, Сенің үйің мәңгілік киелі де қасиетті."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view93() {
struct kk93 poems[] = {
	{1, "1 Уа, Иеміз, зұлымды жазалайтын Құдай, Нұрыңды төкші, о, әділ соттаушы Құдай!"},
	{2, "2 Уа, әлемге Үкім Шығарушы, көтеріле гөр, Менменге тиісті жазасын тартқыза гөр!"},
	{3, "3 О, Жаратқан Ие, қашанғы осылай болмақ? Қашанғы әділетсіздер дауыстап қуанбақ?"},
	{4, "4 Ауыздарынан менмен сөздер үздіксіз шығады, Зұлымдық істейтіндердің бәрі мақтанады,"},
	{5, "5 Уа, Жаратқан Ием, аяққа таптап халқыңды, Олар қанайды таңдаған меншігіңді:"},
	{6, "6 Жесірлер мен жат жұрттықтарды жояды, Жетімдердің де көзін сол қаталдар құртады."},
	{7, "7 Олар былай дейді: Жаратқан мұны көрмейді, Жақып сиынған Құдай бұған мән бермейді."},
	{8, "8 Елдегі ақымақтар, ақылға келіңдер, Сендер парасатқа қашан кенелесіңдер?"},
	{9, "9 Құлақты жаратқан Тәңір әлде естімей ме, Көзді жаратқан Оның Өзі әлде көрмей ме?"},
	{10, "10 Халықтарға ескерткен Ол саған ескертпей ме? Адамға тағылым беретін Ол —"},
	{11, "11 Жаратқан Ие Пенденің ойларының бекерлігін біледі де!"},
	{12, "12 Уа, Жаратқан Ие, Өзің тәрбие берген жан Бақытты: Таурат заңыңнан үйретесің оған,"},
	{13, "13 Тыным бересің соған қиын-қыстау уақытта, Ал сұмдарға көр қазылады ақыр соңында."},
	{14, "14 Себебі Жаратқан Ие өз халқынан бас тартпайды, Таңдаған меншігін Ол жалғыз қалдырмайды."},
	{15, "15 Сөз жоқ, төрелік қайта әділдікке негізделмек, Бар ақжүрек жандар әділдік жолымен жүрмек."},
	{16, "16 Кім мені қорғау үшін қарсы шығар зұлымдарға, Кім мен үшін қарсы тұрар күнә жасайтындарға?"},
	{17, "17 Егер Жаратқан Ие маған жар болмағанда, О дүниеге аттанар едім жақын арада."},
	{18, "18 Аяғым таяды! дегенімде, уа, Жаратқан, Сенің мейірімің болды сүйеніш маған."},
	{19, "19 Уайым-қайғы кернегенде менің жүрегімді, Сенің жұбанышың жадыратты көңілімді."},
	{20, "20 Заңыңа қарсы зорлық-зомбылық ойлаған Арамзалардың тақтары жақын бола ма Саған?"},
	{21, "21 Топтасып олар әділге қарсы ұмтылады, Кінәратсыз адамды өлімге бұйырады."},
	{22, "22 Бірақ Жаратқан Ие — паналайтын қорғаным, Иә, Құдайым менің — бас сауғалар жартасым."},
	{23, "23 Сол зұлымдарға Ол қылықтарын қайтарады, Өз жауыздықтарымен өздерін құртады, Құдай Иеміз оларды мүлдем жояды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view94() {
struct kk94 poems[] = {
	{1, "1 Келіңдер, Жаратқан Иеге арнап Әндетейік қуана-қуана жырлап, Жартастай мықты Құтқарушымызға Сиына берейік қатты дауыстап!"},
	{2, "2 Бәріміз Иеміздің алдына барып, Ризашылығымызды білдірейік, Ән-күймен де Оған мақтау айтып, Даңқын Оның асыра берейік!"},
	{3, "3 Себебі Жаратқан Ие — ұлы Құдай дағы Һәм ұлы Патша — бар тәңір, пірден тым жоғары!"},
	{4, "4 Бәрі Оның қолында: жердің тұңғиықтары, Әрі меншігі Оның — зәулім тау шыңдары,"},
	{5, "5 Теңіз де Иеміздікі — Өзі соны жаратқан, Құрлықтың барлығы да Оның қолынан шыққан!"},
	{6, "6 Келіңдер, тағзым етейік Иемізге иіліп, Жаратушымыздың алдында тіземізді бүгіп!"},
	{7, "7 Себебі Өзі — біздің бірден-бір Құдайымыз, Ал біз Оның бағып жүрген меншікті халқымыз Әрі қамқорындағы отары сияқтымыз. Бүгін сендер Оның даусын естігенде,"},
	{8, "8 Мерібада істегендерің секілді Қасарыстырмаңдар жүректеріңді: Ежелде айдалада жүрген кезде Масадағы бас көтергендерің іспетті Қайтадан солай істемеңдер енді!"},
	{9, "9 Сендердің ата-бабаларың сол жерде Көріп жүрсе де керемет істерімді, Еркінсіп сынай берді төзімімді."},
	{10, "10 Бұл ұрпаққа қырық жыл ашуландым, Сонымен былай деп қорыттым: Жүрек қалаулары теріс бағыттағы Осы халық тағылымымды қабылдамады!"},
	{11, "11 Қаһарланып ант еттім Мен сондықтан: Тыныштық сыйлау үшін Мен дайындаған Елге кірмейді олар енді ешқашан!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view95() {
struct kk95 poems[] = {
	{1, "1 Шырқаңдар жаңа ән Жаратқан Иеге, Күллі әлем, ән-жыр айтыңдар Иемізге!"},
	{2, "2 Ән салып Оның есімін мадақтаңдар, Бізді құтқарғанын күн сайын хабарлаңдар,"},
	{3, "3 Халықтарға паш етіп Оның ұлылығын, Бар ұлттарға Иеміздің кереметтерін!"},
	{4, "4 Иеміз ұлы, мадақталуға әбден лайықты, Оны қастерлеу қажет бар тәңір, пірден гөрі."},
	{5, "5 Өзге ұлттар табынған тәңірлер жалған, Ал Жасаған Ие аспанды жаратқан!"},
	{6, "6 Сән-салтанат, ұлылық Оның алдында, Құдірет пен әсемдік киелі тұрағында."},
	{7, "7 Жаратқанның ұлылығы мен күш-қуатын Мойындаңдар, уа, рулары күллі ұлттардың,"},
	{8, "8 Жаратқанның есімін даңқтап қадірлеңдер, Оның аулаларына сый-тарту әкеліңдер,"},
	{9, "9 Қасиетті салтанатына бөленіңдер, Жаратқан Иеге бағынып бас иіңдер, Оның алдында дірілдеп дәріпте, бүкіл жер!"},
	{10, "10 Бар ұлттарға мынаны паш етіңдер: Жаратқан Иеміз патшалық жүргізер! Әлем берік орнатылды, орнынан қозғалмайды, Иеміз ұлттарды әділдікпен соттайды."},
	{11, "11 Заңғар көк шаттансын, жер де қатты қуансын, Теңіз бен ондағылар бәрі шуылдасын,"},
	{12, "12 Дала мен ондағылар жырлап шаттансын, Бар орман ағаштары қуана ән салсын,"},
	{13, "13 Келе жатқан Жаратқан Иенің алдынан шықсын! Себебі Ол келіп, жерге сот құрады, Әлемге әділдікпен үкім шығарады, Ұлттарға адалдығымен билік айтады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view96() {
struct kk96 poems[] = {
	{1, "1 Жаратқан Ие патшалық құрады, Қуанып шаттансын бүкіл жер шары, Көп аралдар әрі теңіз жағалары!"},
	{2, "2 Бұлт пен түнек — айналасы Оның, Шындық пен әділдік — негізі тағының."},
	{3, "3 Жаратқанның алдында от жүреді, Айналдыра ол жауларын құртып өртейді."},
	{4, "4 Найзағайы әлемді жарқыратады, Жер беті соны көріп, шайқалады."},
	{5, "5 Бүкіл әлемнің Иесінің алдында, Жаратқан Иенің бет-жүзінің алдында, Балауыз іспетті ериді таулар сонда."},
	{6, "6 Аспан Оның әділдігін паш етеді, Күллі ұлттар ұлылығын көреді."},
	{7, "7 Жалған тәңірлерімен мақтанғандар Ұялсын, сол мүсіндерге табынғандар. Жаратқанға бас иіңдер, барлық пұттар!"},
	{8, "8 Сион шаһары естіп, шаттанады, Яһуда қалалары да қуанады Сенің шешімдеріңе, о, Жаратушы!"},
	{9, "9 Жоғарысың бүкіл әлемнен, уа, Жаратқан, Үстемсің барлық тәңір, пір атаулыдан."},
	{10, "10 Ей, Жаратқан Иені сүйетіндер, Зұлымдық атаулыны жек көріңдер! Өзіне бағышталғандарды Ол қорғайды, Зұлымдардың қолынан арашалайды."},
	{11, "11 Әділ адамдарға нұр төгіледі, Ақжүрек жандар шаттыққа кенеледі."},
	{12, "12 Әділдер, Жаратқанға шаттаныңдар, Қасиетті есімін мадақтаңдар!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view97() {
struct kk97 poems[] = {
	{1, "1 Жаратқанға айтыңдар жаңа әнді, Өйткені Ол кереметтер істеді, Киелі құдіретімен жеңіп шықты."},
	{2, "2 Жаратқан Ие жеңісін аян етті, Әділдігін де халықтарға көрсетті,"},
	{3, "3 Ол Исраилге деген мейірімін де, Сенімділігін де сақтайды есінде. Құдайымыздың құтқаруын көрді Жер бетінің түкпірлеріндегілер де."},
	{4, "4 Бүкіл жер жүзі, шаттанып айқайлаңдар, Жаратқанға қуана ән-жыр айтыңдар,"},
	{5, "5 Домбыра шертіп, әдемі ән салыңдар, Жетігенмен де Иемізге күй тартыңдар,"},
	{6, "6 Сырнай, кернейдің үнімен дауыстаңдар, Патшамыз — Жаратқан алдында шаттаныңдар!"},
	{7, "7 Теңіз де өзін мекендейтіндерімен, Әлем де сонда тұратындарымен Шаттана шуласып Оны мадақтасын!"},
	{8, "8 Өзендер қуана қол шапалақтасын, Таулар да бірігіп шаттана ән салсын"},
	{9, "9 Жаратқан Иеміздің көз алдында! Ол жерге келеді үкім шығаруға, Әлемге әділ билік айтуға, Нағыз шындықпен күллі ұлттарға."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view98() {
struct kk98 poems[] = {
	{1, "1 Жаратқан Иеміз патшалық құрады, Керубтер арасындағы тағында отырады. Халықтар Оны қастерлеп қалшылдасын, Жер де Тәңір Иеден қорқып шайқалсын!"},
	{2, "2 Жаратушы Сионда салтанатпен тұрады, Оның даңқы бар халықтардан жоғары."},
	{3, "3 Уа, Ием, ұлы да айбарлы есіміңді Халықтар мадақтасын: ол киелі!"},
	{4, "4 Құдіретті патша, ұнатасың әділдікті, Сен жер бетіне орнаттың әділетті. Жақыптың үрім-бұтағына шындықты Бекіттің, уа, Ием, және адалдықты."},
	{5, "5 Мақтау айтыңдар Иеміз — Құдайға: Ол киелі! Табан тіренішінің алдында Бас иіп ғибадат етіңдер Құдайға!"},
	{6, "6 Оның діни қызметкерлерінің арасында Мұса мен Һарон болды ежелгі заманда. Атын атап Оған сиынғандар арасында Самуил пайғамбар да болды баяғыда, Жаратқан құлақ салды олар сиынғанда."},
	{7, "7 Бұлт бағанасынан Ол сөзін жолдады, Ережелер мен жарлығын жариялады, Ал халық соларды сақтап орындады."},
	{8, "8 Уа, Құдай Иеміз, оларға құлақ салдың Әрі кешірім беретін Құдайы болдың, Ал зұлым істерін жазалайтынсың."},
	{9, "9 Құдай Иемізді даңқтап дәріптеңдер, Қасиетті тауында Оған бас иіңдер, Құдай Иеміз киелі, соны біліңдер!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view99() {
struct kk99 poems[] = {
	{1, "1 (Халық Құдайға шүкірлік еткенде айтылатын жыр.) Бар әлем, жырлаңдар Жаратқанды дауыстап,"},
	{2, "2 Иемізге қызмет етіңдер шаттанып, Келіңдер алдына қуана әндетіп,"},
	{3, "3 Жаратқанды мойындаңдар Құдайымыз деп: Бізді жаратты Ол, меншікті халқымыз, Оның ізгі шопандай бағатын отарымыз."},
	{4, "4 Құдайдың ғибадатханасына барып, Алғыс жыр айтыңдар қақпасынан өтіп, Иемізді мақтаңдар аулаларына кіріп, Шүкірлік етіңдер есімін дәріптеп!"},
	{5, "5 Себебі Жаратқан Ие мейірімді, Ол мәңгілік шапағатын тигізеді. Ұрпақтан ұрпаққа Иеміз бізге Шексіз сенімділігін көрсете береді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view100() {
struct kk100 poems[] = {
	{1, "1 (Дәуіттің жыры.) Рақым мен әділдік жайлы ән шырқаймын, Уа, Жаратқан, әніммен Сені мадақтаймын."},
	{2, "2 Мінсіз жүру жайлы мұқият ойлаймын, Қашан маған келесің? деп сұраймын, Таза жүрекпен үйімді аралаймын."},
	{3, "3 Арам нәрселерге еш көз салмаймын, Опасыздардың істерін мүлдем ұнатпаймын, Өзіме жабысуларына мүмкіндік бермеймін."},
	{4, "4 Азғын жүректіні қасымнан қуамын, Зұлымдық атаулыдан аулақ боламын,"},
	{5, "5 Өзгені құпия жамандайтынды жоямын, Паң көзді, өркөкірекке төзе алмаймын."},
	{6, "6 Елдегі адалдарға назар аударамын, Олар аман-есен қасымда тұра алсын, Таза жүргендер ғана маған қызмет қылсын."},
	{7, "7 Ешбір алдамшы сарайымда тұрмайды, Жалған сөйлеуші көз алдымда қалмайды."},
	{8, "8 Таң атқаннан зұлымның бәрін басамын, Жаратқанның қаласынан сұмдарды құртамын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view101() {
struct kk101 poems[] = {
	{1, "1 (Ауыртпалық шегіп, әлсіреген жанның Иемізге мұңын шаққан мінажаты.)"},
	{2, "2 Уа, Жаратқан, мінажатымды естіші, Көмек сұраған даусым Саған жетсінші,"},
	{3, "3 Қиын кезде менен сырт айналмашы, Маған құлағыңды түре көрсеңші, Өзіңді шақырсам тез жауап берші."},
	{4, "4 Күндерім түтіндей лезде жоғалады, Сүйектерім от шоғындай маздап жанады."},
	{5, "5 Шабылған шөптей қурады жүрегім, Тамақ ішуді де ұмытып келемін,"},
	{6, "6 Қатты қиналып ыңқылдағанымнан Әбден жүдегенмін, құр сүлдерім қалған."},
	{7, "7 Құла түздегі бірқазанға ұқсаймын, Һәм қираған орындағы жапалақтаймын,"},
	{8, "8 Мен ұйықтай алмай ояу жатырмын, Үй төбесіндегі құстай тым жалғызбын."},
	{9, "9 Дұшпандарым күнде балағаттайды, Мені мазақтап, атымды қарғайды."},
	{10, "10 Нан орнына күлмен тамақтанамын, Көз жасымды сусыныма қосамын."},
	{11, "11 Мұның себебі — ашу-ызаң Сенің, Жоғары көтеріп, мені лақтырған едің."},
	{12, "12 Кешкі көлеңкедей өтеді күндерім, Қураған шөптей әбден әлсіредім."},
	{13, "13 Ал Сен, Жаратқан Ие, мәңгі боласың, Бар ұрпақтарға жайылар Сенің даңқың."},
	{14, "14 Орныңнан тұрып, Сионға рақым етші, Енді уақыт болды, мейірім көрсетші, Соған белгілеген мезгілің жетті."},
	{15, "15 Құлдарың Сионның тастарын ұнатады, Шаң-тозаңы аяныштарын оятады."},
	{16, "16 Бар ұлттар дірілдер Жаратқанның атынан, Әлемнің патшалары да Оның даңқынан:"},
	{17, "17 Жаратқан Ие Сионды қайта тұрғызбақ, Өз салтанатымен сонда пайда болмақ,"},
	{18, "18 Мұқтаждың мінажаттарын Ол тыңдайды, Жалыныштарын жауапсыз қалдырмайды."},
	{19, "19 Болашақ ұрпақтар үшін бұл жазылмақ, Келер буындар Жаратқанды даңқтамақ:"},
	{20, "20 Жаратқан Ие көктен жер бетіне қарады, Киелі үйінен Ол төмен көз тастады,"},
	{21, "21 Тұтқындардың ыңқылдауын есту үшін, Өлімге кесілгендерді азат ету үшін."},
	{22, "22 Содан Жаратқанның аты Сионда мақталмақ, Даңқы Оның Иерусалимде асырылмақ,"},
	{23, "23 Сонда бар халықтар бұл қалаға жиналар, Патшалықтар Жаратушыға ғибадат қылар."},
	{24, "24 Өмір жолымда Тәңір мені қалжыратты, Ғұмырымның күндерін Ол қысқартты."},
	{25, "25 Сонда мен былай дедім Жаратқанға: Уа, Құдайым менің, жарты жолда Өмірімді көрмеші қысқарта! Сен жасайсың ұрпақтан ұрпаққа,"},
	{26, "26 Жердің негізін салғансың әуел баста, Құдіретіңмен жараттың аспанды да."},
	{27, "27 Олар құриды, Сен боласың әр уақытта, Киімдей тозады олардың барлығы да, Көйлектей ауыстырасың Сен оларды, Содан олар лақтырылып тасталады."},
	{28, "28 Ал Өзің өзгермей қалатын боласың, Еш таусылмайды Сенің жасар жылдарың."},
	{29, "29 Құлдарыңның ұлдары тыныш тұрады, Ұрпақтары көз алдыңда нық болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view102() {
struct kk102 poems[] = {
	{1, "1 (Дәуіттің жыры.) Жан-тәніммен Жаратқан Иені мадақтаймын, Шын жүректен қасиетті атын ардақтаймын."},
	{2, "2 Жан-тәніммен Жаратқан Иені мадақтаймын, Маған көп жақсылық жасағанын ұмытпаймын."},
	{3, "3 Ол бар күнәларымды кешіріп, Дерттерімнің бәрін сауықтырады,"},
	{4, "4 Ажалдан жанымды аман қалдырып, Рақымы мен мейірімін сыйлайды,"},
	{5, "5 Тілегімді жақсылықпен қанағат қып, Қырандай мені қайта түлетеді."},
	{6, "6 Иеміз жәбір көргендердің барлығына Әділдік жеткізіп, мүддесін қорғайды да."},
	{7, "7 Ақиқат жолдарын танытты Ол Мұсаға, Кереметтер жасады Исраил халқына."},
	{8, "8 Жаратқан — мейірбанды да рақымды, Тез қаһарланбайтын, тым қайырымды."},
	{9, "9 Ол бізді ұдайы айыптамайды, Мәңгі бақи кек те сақтамайды,"},
	{10, "10 Бізді күнәмізге қарап жазаламайды, Жаман ісіміздің есесін қайтармайды."},
	{11, "11 Аспан жерден қанша жоғары болса, Жаратқанның Өзін терең сыйлағандарға Жаудыратын рақымы сонша мол да!"},
	{12, "12 Шығыс батыстан тым қашық болғаны сияқты, Ол заңсыз істерімізді бізден зор қашықтатты."},
	{13, "13 Әкенің сәбиіне жаны ашығаны іспетті, Жаратқан Иеміз де Өзін қастерлегендерге Дәл сондай мейірім мен жанашырлық көрсетеді."},
	{14, "14 Неден жаратылдық, соны түгел біледі, Топырақтан екеніміз Оның есінде."},
	{15, "15 Адамның өмірі көк шөп секілді, Ол гүлдейді дала гүлі тәрізді:"},
	{16, "16 Ыстық жел соғып өтсе, ғайып болар, Тұрған жеріне беймәлім боп жоғалар."},
	{17, "17 Ал Өзін терең қастерлеген жандарға Жаратқанның рақымы мәңгі жауады да."},
	{18, "18 Иемізбен жасасқан Келісімін бұзбайтын, Оның бұйрықтарын есінде сақтайтын, Әрі солар бойынша жүріп-тұратын Адамдардың келер ұрпақтарына дағы Құдайдың әділдігі жетіп тұрады."},
	{19, "19 Жаратқан Ие көкте орнатты өз тағын, Оның Патшалығы билейді барлығын."},
	{20, "20 Уа, Иеміздің сөзіне құлақ салатын, Оның айтқанын іске асыратын, Құдіреті күшті періштелері, Жаратқан Иеге мақтау айтыңдар!"},
	{21, "21 Уа, Иеміздің еркін орындайтын Көктегі топтары, қызметшілері, Жаратқан Иеге мақтау айтыңдар!"},
	{22, "22 Уа, Оның Патшалығының бар орындарында Жүретін күллі жаратқандары да, Жаратқан Иеге мақтау айтыңдар! Жан-тәніммен Жаратушыны мадақтаймын да."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view103() {
struct kk103 poems[] = {
	{1, "1 Жан-тәніммен Жаратушыны мадақтаймын. Уа, Құдай Ием, Сен керемет ұлысың, Құрмет пен салтанатқа бөленгенсің."},
	{2, "2 Жарық нұрды Сен шапандай киесің, Аспанды шатырдай жайып жібересің,"},
	{3, "3 Су үстінен сарайыңды бекітесің, Бұлттарды Өзің мінер күймең етесің, Желдің қанаттары үстінде жүресің."},
	{4, "4 Желді етесің періштелеріңдей, От жалынын да өз нөкерлеріңдей."},
	{5, "5 Сен жерді берік негізге орнаттың, Ол ешқашан қозғалмайды орнынан."},
	{6, "6 Терең сумен жерді киімдей жаптың, Тіпті тау бастарын да сумен бастың."},
	{7, "7 Берген бұйрығыңнан кейін сулар безді, Күркіреген үніңнен олар дереу шегінді,"},
	{8, "8 Таулардан асып, аңғарларға түсті, Белгілеген жеріңе қарай ағып кетті."},
	{9, "9 Сен суларға сонда берік шек қойдың, Су енді қайтып жерді жаппастай қылдың."},
	{10, "10 Сен сайларға ағызасың бұлақтарды, Өзендер тау арасымен құйылады,"},
	{11, "11 Дала аңдарын олар суға қандырады, Құландар да одан шөлін басады."},
	{12, "12 Құстар су жағасына ұя салады, Бұтақтар арасынан ән айтады."},
	{13, "13 Заңғар мекеніңнен тауды суғарасың, Ісіңнің жемісімен жерді толтырасың,"},
	{14, "14 Топырақтан мал азығына шөп өсіресің, Адамға ас болуға дақылдар еккізесің,"},
	{15, "15 Пенденің жүрегін қуантар шарапты да, Бетті жылтыратар зәйтүн майын да, Денеге күш-қуат берер нанды да."},
	{16, "16 Суға қанығады Жаратқанның ағаштары, Өзі өсірген Ливан самырсындары."},
	{17, "17 Құстар соларға ұяларын салады, Шыршалар ләйлектің мекені болады,"},
	{18, "18 Таутекенің тұрағы — зәулім шыңдар, Таутышқанның панасы да — құз, жартастар."},
	{19, "19 Мезгілді белгілеуге жараттың айды, Күн де біледі қай уақытта батуды."},
	{20, "20 Сен қараңғылық жайғанда түн болады, Орманның аңдары кезіп сандалады,"},
	{21, "21 Жас арыстандар ақырып олжа аңсайды, Құдайдан өздеріне азық сұрайды."},
	{22, "22 Күн шыға олар бұғып кері қайтады, Апандарына еніп, тынығып жатады."},
	{23, "23 Адамдар сол кезде жұмысқа шығады, Кеш түскенше еңбекпен айналысады."},
	{24, "24 Сенің істерің қандай көп, Жаратқан Ием! Сен жасадың барлығын да даналықпен, Жер толған Өзіңнің жаратқандарыңмен."},
	{25, "25 Міне, тағы ұлан-ғайыр теңіз де бар, Құжынар сансыз үлкен-кіші хайуандар,"},
	{26, "26 Теңізде жүзеді кемелер, қайықтар, Сен онда ойнауға жаратқан дәу балықтар."},
	{27, "27 Өзіңнен күткендері бәрінің де — Сенің тамақ беруің мезгілінде."},
	{28, "28 Азығын берсең олар жинап алар, Қолыңды ашсаң игілікке тойынар."},
	{29, "29 Ал бет-жүзіңді жасырсаң әбігерге қалар, Жанын алсаң өліп, топыраққа айналар."},
	{30, "30 Рухыңның лебін жіберіп, өмір жаратасың, Жер бетін қайтадан толтырып, жаңартасың."},
	{31, "31 Жаратқанның ұлылығы мәңгі мадақталсын, Иеміз өз істеріне әрдайым шаттансын."},
	{32, "32 Ол жер бетіне көз салса шайқалады, Тауларға қол тигізсе түтін шығады."},
	{33, "33 Өмір бойы Жаратқанға ән саламын, Дем біткенше Құдайыма жыр айтамын,"},
	{34, "34 Ой толғанысым Оған ұнамды болсын, Жаратқан Иеме ұдайы шаттанамын."},
	{35, "35 Күнәкарлар жер бетінен аласталсын, Әділетсіздер енді қайтып болмасын. Жан-тәніммен Жаратушыны мақтаймын. Жаратқан Иемізді мадақтаңдар әрдайым!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view104() {
struct kk104 poems[] = {
	{1, "1 Жаратқан Иеге мақтау айтыңдар, Оның есімін атап сиыныңдар, Ұлы істерін халықтарға хабарлаңдар!"},
	{2, "2 Иемізге ән салып, Оны мадақтаңдар, Барлық кереметтерін паш қылыңдар,"},
	{3, "3 Оның киелі атымен мақтаныңдар, Жаратқанға сиынатын сендер, шаттаныңдар!"},
	{4, "4 Иемізге әрі құдіретіне ден қойыңдар, Дәйім Оның еркін білуге ұмтылыңдар!"},
	{5, "5 Ұмытпаңдар Оның жасаған кереметтерін, Ғажап істері мен шығарған шешімдерін,"},
	{6, "6 Уа, Оның құлы Ыбырайымның ұрпақтары, Жақыптан тарағандар, таңдаулы адамдары!"},
	{7, "7 Ол — біздің Құдайымыз, Жаратқан Ие, Бүкіл әлемге Өзі билік жүргізуде."},
	{8, "8 Мәңгі есінде сақтайды Ол өз Келісімін, Келер мың буынға да бұйырған өсиеттерін —"},
	{9, "9 Ыбырайыммен жасаған Келісімін, Ысқаққа да антпен берген сол уәдесін,"},
	{10, "10 Жақыпқа оны ереже қылып бекітті, Исраил үшін тұрақты Келісім етті."},
	{11, "11 Мұралық үлесің етіп беремін саған Қанахан елін деді сонда Жаратқан."},
	{12, "12 Сол кезде бұл әулет әлі де аз болатын, Азғана кірме болып сонда тұратын."},
	{13, "13 Олар елден елге көшіп-қонатын, Патшалықтарды аралап орнығатын."},
	{14, "14 Ал Құдай ешкімге соларды жәбірлетпеді, Олар жайлы патшаларға қатаң ескертті:"},
	{15, "15 Тағайындағандарыма еш тиіспеңдер, Пайғамбарларыма зұлымдық істемеңдер!"},
	{16, "16 Тәңір Ие ашаршылық жіберді елге, Талқандап тамақ қорының бәрін де."},
	{17, "17 Алдарынан шығарды Ол бір жігітті, Мысырға құлдыққа сатылған Жүсіпті."},
	{18, "18 Тәңірдің сөзі оның мінезін сынап болғанша, Алдын ала айтқандары орындалғанша, Жүсіптің аяқтары қысылып бұғауланды, Мойнына оның темір құрсау салынды."},
	{19, "20 Патша сонда адам жұмсап, Жүсіпті босатты, Халықтардың билеушісі оны азат етті,"},
	{20, "21 Тіпті өз сарайының басқарушысы қылды, Жүсіпке бар иелігін басқартып қойды,"},
	{21, "22 Төрелерінің үстінен оның бұйрығын жүргізді, Жүсіпке басшыларын даналыққа үйреткізді."},
	{22, "23 Содан кейін Исраил Мысырға көшті, Жақып жат жерлік боп Хам елінен қоныс тапты,"},
	{23, "24 Жаратқан Ие сонда халқын өсімтал етті, Оның санын дұшпанынан басым етті,"},
	{24, "25 Ол Мысырға Исраил халқын жек көргізді, Өзінің құлдарына қарсы сұмдық жасатқызды."},
	{25, "26 Иеміз қызметшісі Мұсаны жолдады, Сондай-ақ Өзі таңдап алған Һаронды."},
	{26, "27 Бұлар Жаратқан Иенің ғажап істерін — Хам елі Мысырда Оның мына кереметтерін Халық арасында іске асырып көрсетті:"},
	{27, "28 Тәңір Ие қараңғы түсіріп түнек етті елді, Себебі Мысыр Оның сөзіне бағынбай келді."},
	{28, "29 Елдің суларын Ол қанға айналдырды, Ондағы балықтарды құртып жоқ қылды,"},
	{29, "30 Мысырдың жерін қаптап кетті құрбақалар, Патшаның бөлмесін де жайлап алды олар."},
	{30, "31 Иеміз айтқанда шыбын-шіркей құжынады, Әрі масалар да бүкіл елді қаптады."},
	{31, "32 Жаратқан жаңбырды бұршақпен ауыстырды, Найзағайдың отын жерге жаудырды."},
	{32, "33 Жүзім мен інжір ағаштарын құлатты, Елдегі бар ағаштарды қиратты."},
	{33, "34 Иеміз айтқанда шегірткелер қаптады, Сансыз көп шегіртке құрттары құжынады,"},
	{34, "35 Жердің жасыл шөбінен түк қалдырмады, Егіндіктегі бар астықты жалмады."},
	{35, "36 Ақыры Ол елдегі бар тұңғышты өлтірді, Мысырлықтардың мақтанышы солар еді."},
	{36, "37 Жаратқан Ие Мысырдан халықты Сыйға алған алтын-күміспен алып шықты, Руларындағы біреу де шаршап-шалдықпады."},
	{37, "38 Халық кеткенде мысырлықтар қуанды, Өйткені қорқыныш биледі оларды."},
	{38, "39 Жаратқан Исраилді бұлтпен жапты, Түнде от оларға сәулесін шашты."},
	{39, "40 Халық ет сұрағанда Ол бөденелер жіберді, Аспаннан түскен нанмен тойындырды,"},
	{40, "41 Жартасты жарып, содан су ағызды, Су шөлді жерлермен өзендей сарқырады."},
	{41, "42 Себебі Жаратқан киелі сертін ескерді, Қызметшісі Ыбырайымға соны берген еді."},
	{42, "43 Осылай Ол алып шықты халқын шаттықпен, Таңдап алған адамдарын зор қуанышпен,"},
	{43, "44 Өзге ұлттардың жерін оларға берді, Бөтен халықтың еңбегін де иемдендірді,"},
	{44, "45 Енді Оның халқы жарлықтарын орындасын, Заңдарын да ұдайы берік сақтасын. Лайым Жаратқан Ие мадақталсын!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view105() {
struct kk105 poems[] = {
	{1, "1 Мадақтаңдар Жаратқан Иені! Жаратқан Ие ізгі, мақтаңдар Оны, Мәңгі ұласады берік рақымы!"},
	{2, "2 Құдіретті істерін кім айта алар, Иемізді кім лайықты мадақтай алар?"},
	{3, "3 Әділдікті ұстанғандар жарылқанар, Ұдайы олар әділ істер жасар."},
	{4, "4 Халқыңа көрсеткенде мейіріміңді, Уа, Жаратқан Ие, мені де ескерші, Көмекке келіп, мені құтқара көрші."},
	{5, "5 Содан мен де таңдаған адамдарыңның Көретін игілігіне ортақ болайын, Халқыңның қуанышын да бөлісейін, Меншікті халқыңмен бірге Сені құрметтейін."},
	{6, "6 Біз ата-бабамыздай күнә жасадық, Заңсыздық істеп, зұлымдыққа баттық."},
	{7, "7 Ата-бабамыз Мысырда болған кезде Керемет істеріңнің мәнін түсінбеді, Істеген жақсылықтарыңды ұмытты, Қамысты теңізде Өзіңе қарсы шықты."},
	{8, "8 Бірақ құдіретті күшін таныту үшін Өз атына бола Құдай құтқарды халқын."},
	{9, "9 Қамысты теңізді құрғатты бұйрығымен, Жай бастап алып жүргендей айдаламен Алып шықты оларды теңіздің түбімен."},
	{10, "10 Құдай өз халқын дұшпандарынан құтқарды, Жау қолынан оларды босатып алды."},
	{11, "11 Қанаушыларының барлығын су басты, Жаулардың біреуі де аман құтылмады."},
	{12, "12 Сонда халық Оның сөздеріне иланды, Оған арнап мадақтау әндерін шырқады."},
	{13, "13 Бірақ олар тез ұмытты Тәңірдің істерін Әрі сұрап күтпеді Оның ақыл-кеңесін,"},
	{14, "14 Айдалада құмарлықтарына салынды, Құла түзде Құдайды еркінсіп сынады."},
	{15, "15 Құдай халыққа сұрағандарын берді, Бірақ әлсірететін індет те жіберді."},
	{16, "16 Қоныста олар күндеп қызғанды Мұсаны Әрі Жаратқанға бағышталған Һаронды."},
	{17, "17 Сонда жер жарылып, Датанды жұтып қойды, Абиронның тобын да көміп тастады."},
	{18, "18 Олардың жиынында жалын лаулады, От жалыны зұлымдарды жалмап қойды."},
	{19, "19 Хориб беткейінде халық жас бұқаны Құйып жасап, сол мүсінге табынды,"},
	{20, "20 Олар сиынып келген салтанатты Құдайын Алмастырды мүсінімен шөп жейтін бұқаның,"},
	{21, "21 Өздерін құтқарған Құдайды ескермеді, Ол Мысырда ұлы істер жасаған еді,"},
	{22, "22 Хамның елінде кереметтер істеген еді, Әрі үрейлі істер Қамысты теңізде."},
	{23, "23 Сонда Құдай халықты құртамын деді, Бірақ Өзі таңдаған Мұса пайғамбар өтінді, Құртамын деген ашуынан қайтуын тіледі."},
	{24, "24 Кейін халық аңсаған елін менсінбеді, Құдайдың уәдесіне сенім жүктемеді,"},
	{25, "25 Шатырларында Оған қарсы күңкілдеді, Жаратқанның даусына құлақ түрмеді."},
	{26, "26 Сонда Ол қол көтеріп оларға ант берді: Айдалада құритын боласыңдар! — деді,"},
	{27, "27 — Халықтар арасында ұрпақтарың өледі, Жат жерлерге олар шашырайды! — деп шешті."},
	{28, "28 Пеғорда халық Бағалға құлшылық етті, Өлі тәңірлердің құрбандықтарын жеді,"},
	{29, "29 Арам істерімен Құдайды ашуландырды, Сондықтан індет араларына жайылды."},
	{30, "30 Ал Пінехес тұрып, зұлымдыққа қарсы шықты, Індеттің апаты осылайша тиылды."},
	{31, "31 Сол үшін Пінехес Құдай алдында ақталды, Ұрпақтан ұрпаққа мәңгі бақи мақталды."},
	{32, "32 Халық Құдайды Меріба суының маңында да Ызаландырып, жапа шеккізді Мұсаға,"},
	{33, "33 Олар Мұсаны кейітіп өшіктірді, Сонда ол қызбаланып ағат сөйледі."},
	{34, "34 Халық Қанахандағы азғын ұлттарды Жаратқан Ие бұйырса да құртпады."},
	{35, "35 Қайта, олармен қоян-қолтық араласты, Солардың арам істеріне ортақтасты."},
	{36, "36 Жат ұлттардың пұттарына бірге табынды, Осылайша торға түсіп, арамданды,"},
	{37, "37 Өз ұл-қыздарын жын-перілерге арнады: Құрбандыққа шалып, ешбір аямады!"},
	{38, "38 Кінәсіз жандардың олар төкті қанын, Қанаханның пұттарына өз ұл-қыздарын Құрбандыққа шалып, олардың қанын ұсынды, Сол қанмен Қанахан елін арамдады."},
	{39, "39 Осындай істерімен халық өзін қорлады, Қасиетті Келісімге сатқындық жасады."},
	{40, "40 Содан халқына қарсы қаһарланды Жаратқан, Әбден жиренді Өзінің меншікті халқынан."},
	{41, "41 Оларды бөтен ұлттарға тапсырды, Үстерінен жек көрген жаулары билік құрды,"},
	{42, "42 Сол дұшпандары қыспақтап қанады, Халықты билеп-төстеп қорлады."},
	{43, "43 Жаратқан Ие көп рет халқын құтқарды, Ал олар бас көтерулерін жалғастырды, Күнәларының кесірінен құлдырады."},
	{44, "44 Дегенмен Құдай халықтың қиыншылығына Көзін салып, құлақ түрді жалыныштарына,"},
	{45, "45 Халқымен жасаған Келісімін ескерді, Зор рақымымен оларды есіркеді,"},
	{46, "46 Содан Ол халқын тұтқында ұстаған бар елдерді Оларды аяп мүсіркеуге мәжбүрледі."},
	{47, "47 О, Құдай Иеміз, құтқарып ала гөр бізді, Ұлттар арасынан жинап ала гөр кері, Сонда біз дәріптейміз киелі атыңды, Қуана мақтан тұтамыз ұлы даңқыңды."},
	{48, "48 Исраилдің Құдай Иесі мадақталсын, Мәңгіліктен мәңгілікке Ол даңқталсын, Барша халық мақұлдап Аумин! десін! Лайым Жаратқан Ие дәріптелсін!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view106() {
struct kk106 poems[] = {
	{1, "1 Жаратқан Ие ізгі, мадақтаңдар Оны, Мәңгілікке ұласады берік рақымы!"},
	{2, "2 Осылай десін Жаратқанның құтқарғандары, Оның жау қолынан босатып алғандары,"},
	{3, "3 Жаратқанның жат елдерден жинағандары, Шартараптан еліне қайтарғандары."},
	{4, "4 Біреулері құла түзде босып жүрді, Мекендейтін қала таппай дала кезді."},
	{5, "5 Аш болып, олар суға да зарықты, Жандары әлсіреп, өше жаздады."},
	{6, "6 Мүшкіл халдерінде Жаратқанды шақырды, Иеміз оларды қасіреттен құтқарды."},
	{7, "7 Мекендей алатын қалаға оларды Тура жолмен жетелеп бастап барды."},
	{8, "8 Олар Жаратқанды мақтасын мейірімі үшін, Адамдарға істеген кереметтері үшін!"},
	{9, "9 Сусаған адамның шөлін Ол қандырды, Қарны аш жанды нәрлі аспен тойдырды."},
	{10, "10 Біреулер түнекте, үмітсіз жағдайда Тұтқында қиналып жатты темір бұғауда,"},
	{11, "11 Олар сөзіне қарсы шығып Құдайдың, Кеңесін менсінбеп еді Хақ Тағаланың."},
	{12, "12 Сонда Ол халқын ауыр бейнетке салды, Олар сүрініп құлап, ешкім қолдамады."},
	{13, "13 Мүшкіл халдерінде Жаратқанды шақырды, Иеміз оларды қасіреттен құтқарды,"},
	{14, "14 Үмітсіз жағдай мен түнектен шығарды, Байланған құрсауларын сындырып лақтырды."},
	{15, "15 Олар Жаратқанды мақтасын мейірімі үшін, Адамдарға істеген кереметтері үшін!"},
	{16, "16 Қола қақпаларды Ол быт-шыт қылды, Темір ысырмаларын да сындырды."},
	{17, "17 Біреулер бас көтеріп ақымақ болды, Күнәларына бола індетке шалдықты,"},
	{18, "18 Барлық тамақтан жиренетін болды, Ажалдың қақпаларына таяп қалды."},
	{19, "19 Мүшкіл халдерінде Жаратқанды шақырды, Иеміз оларды қасіреттен құтқарды."},
	{20, "20 Ол сөзін арнап, оларды сауықтырды, Жандарын ажалдан аман алып қалды."},
	{21, "21 Олар Жаратқанды мақтасын мейірімі үшін, Адамдарға істеген кереметтері үшін,"},
	{22, "22 Шүкірлік тартуларын Иемізге ұсынсын, Шаттық әнмен Оның істерін паш қылсын!"},
	{23, "23 Кемелермен теңізге шығатындар, Мұхитты кезіп, сауда жасайтындар"},
	{24, "24 Көреді Жаратқан Иенің істерін, Терең теңіздегі кереметтерін."},
	{25, "25 Ол бұйрық беріп, қатты дауыл жіберді, Зәулім биік толқындарды көтерді."},
	{26, "26 Кеме аспанға көтеріліп, жоғары шықты, Тұңғиыққа құлағандай төмен түсті, Қауіптен адамдардың үрейлері ұшты,"},
	{27, "27 Маскүнемдей тәлтіректеп шайқалысты, Не істерін білмей сапырылысты."},
	{28, "28 Мүшкіл халдерінде Жаратқанды шақырды, Иеміз оларды қасіреттен құтқарды."},
	{29, "29 Ол дауылды басып, саябырсытты, Теңіздің толқындарын да тыншытты."},
	{30, "30 Дауыл басылғанда адамдар қуанды, Аңсаған кемежайына Ол бастап апарды."},
	{31, "31 Олар Жаратқанды мақтасын мейірімі үшін, Адамдарға істеген кереметтері үшін,"},
	{32, "32 Халықтар жиынында Оны дәріптесін, Ақсақалдар кеңесінде қастерлесін!"},
	{33, "33 Құдай өзендерді айналдырады шөлге, Ал бұлақтарды құрғатып құла түзге,"},
	{34, "34 Шұрайлы жерді — сортаң иен далаға, Тұрғындарының зұлымдықтарына бола."},
	{35, "35 Бірақ шөлейт жерді Ол айналдырады көлге, Кеуіп қалған даланы қайнар көзге,"},
	{36, "36 Аш жандарды сонда қоныстандырады, Олар мекендейтін қала тұрғызады,"},
	{37, "37 Егін егіп, жүзімдік отырғызады, Солардан ағыл-тегіл өнім алады."},
	{38, "38 Жаратқан Ие сол жандарды жарылқайды, Олар өсіп-өніп ғаламат молаяды, Мал басын да Иеміз азайтпайды."},
	{39, "39 (Халық тағы паңданса) саны қысқарады, Езгі, апат, қайғы оны жуасытады,"},
	{40, "40 Атақтыларын Иеміз қор қылады, Жолсыз құла түзді кездіріп қояды,"},
	{41, "41 Ал жарлыны мүшкіл халінен босатады, Отардағы қойдай ұрпағын молайтады."},
	{42, "42 Әділдер мұны көріп, шаттанады, Бар зұлымдар ауыздарын жабады."},
	{43, "43 Ақылды жан бұл жайттарға ден қояды, Жаратқанның берік рақымын ұғынады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view107() {
struct kk107 poems[] = {
	{1, "1 (Дәуіттің әні әрі жыры.)"},
	{2, "2 Уа, Құдай, жүрегім Саған сенімді, Өзіңе арнаймын мен ән-күйімді. Жан дүнием, ояншы, сергек болайын,"},
	{3, "3 Жетіген мен домбыра, болыңдар дайын! Атар таңды әніммен оятайын."},
	{4, "4 Уа, Жаратқан, жұрт алдында Сені даңқтаймын, Ұлттардың арасында мадақтап жырлаймын."},
	{5, "5 Себебі берік рақымың заңғар аспандай, Әрі сенімділігің асқар бұлттардай."},
	{6, "6 Уа, Құдай, көктен жоғары атың шықсын, Күллі әлемде Сенің даңқың артсын!"},
	{7, "7 Сүйіктілерің лайым аман сақталсын Деп ден қойып, құдіретіңмен құтқарғын."},
	{8, "8 Құдай былай деді киелі мекенінен: Мен шаттанып Сихемнің жерін бөлшектеймін, Соқот аңғарын да халқыма үлестіремін."},
	{9, "9 Ғилақад пен Манаса да — Менің иелігім, Ефрем руы болады басты қорғаным, Яһуда руынан шығады патшаларым."},
	{10, "10 Моаб Маған шылапшындай пайдалы болады, Едом жері де меншігіме айналады, Філістір елі де бойсұнып Мені қуантады."},
	{11, "11 Кім мені қамалды қалаға кіргізеді? Кім Едом елінің ішіне енгізеді?"},
	{12, "12 Сол Сен емес пе, Құдай, бізден бас тартқан, Әскерімізбен бірге шайқасқа шықпаған?"},
	{13, "13 Жаулардың қыспағына қарсы қолдашы, Еш жарамсыз — пенделердің қолдағаны,"},
	{14, "14 Зор істер істейміз Құдай жар болғанда, Жауларымызды таптайды Ол аяғына."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view108() {
struct kk108 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің жыры.) Уа, Құдай, мадақтап келемін Сені, Тіл қатпай, үнсіз қала көрме енді."},
	{2, "2 Себебі адамдар зұлым да алдамшы, Маған қарсы ауыздарын ашады, Жалған тілдерімен жала жабады,"},
	{3, "3 Қас сөздерімен жан-жақтан қыспақтайды, Еш себепсіз маған шабуыл жасайды,"},
	{4, "4 Достығыма жауап береді қастықпен, Алайда Саған сиынып келемін мен."},
	{5, "5 Жақсылығыма олар сұмдық қайтарады, Достығыма өшпенділік танытады."},
	{6, "6 (Қарсыластарым мені былай деп қарғады:) Оған бір зұлым жанды қарсы қойшы, Оң жағына айыптаушысын тұрғызшы,"},
	{7, "7 Сотталғанда ол кінәлі боп шықсын, Тіпті дұғасы да күнә боп табылсын,"},
	{8, "8 Көретін күндері оның аз болсын, Міндетін оның басқа біреу алсын!"},
	{9, "9 Балалары жетім, әйелі жесір қалсын,"},
	{10, "10 Ұрпақтары қаңғырған қайыршы болсын, Қираған үйлерінен аластатылсын,"},
	{11, "11 Қарыз берген оның барын тартып алсын, Еңбегінің жемісін бөтендер тонасын,"},
	{12, "12 Жаны ашитын адал досы болмасын, Жетімдерін мүсіркейтін де табылмасын,"},
	{13, "13 Перзенттері көп жасамай шетінесін, Есімдерін келесі ұрпақ білмесін."},
	{14, "14 Әділетсіз істері ата-бабасының Жаратқан Иенің есіне салынсын, Шешесінің күнәсі де кешірілмесін,"},
	{15, "15 Кінәлары Жаратқанның алдында қала берсін, Ол есімдерін жер бетінен із-түзсіз өшірсін."},
	{16, "16 Өйткені бұл жан жақсылық жасаудан безді, Кедейді, мүсәпір мен үмітсізді Өлтірмек болып қуғындап өкшеледі."},
	{17, "17 Ол қарғыс айтуды сондай ұнатты, Ендеше өзіне қонсын қарғысы, Оң бата дегенді ол менсінбейтін, Ендеше оң бата оған қонбай кетсін."},
	{18, "18 Бұл өзі қарғауын киімдей киетін, Тәніне сол су, май іспетті сіңетін,"},
	{19, "19 Енді қарғыс болсын киетін киіміндей, Ұдайы буынатын белбеуіндей."},
	{20, "20 Ол мені айыптап, қастық айта беретін. Жаратқан оған қайтарсын соның есесін! (Деп білдіреді олар теріс тілектерін.)"},
	{21, "21 Ал Сен, уа, Тәңір Ием — Жаратушы, Есіміңе бола маған жақсы қарашы, Берік рақымың игі, мені құтқаршы."},
	{22, "22 Өйткені мен бейшара, мүсәпірмін, Әрі жаралы — бойымдағы жүрегім."},
	{23, "23 Ғайып болар көлеңкедеймін кешкі, Шегірткедей жау қағып жібереді мені."},
	{24, "24 Оразадан әлсіреді тізелерім, Денем жүдеу, омсырайған бүкіл тәнім."},
	{25, "25 Мен келекеге айналдым жұрт үшін, Көрсе мені шайқайды олар бастарын."},
	{26, "26 Уа, Құдай Ием, маған көмектесші, Рақымыңа сай мені құтқара көрші."},
	{27, "27 О, Ием, мұны істеген Сен екенін, Өз қолыңның жасағанын олар білсін!"},
	{28, "28 Жауларым қарғайды, бірақ Сен жарылқайсың, Бас салса, өздері масқараға қалсын, Ал Сенің қызметшің шаттанатын болсын."},
	{29, "29 Айыптаушыларым ұятқа бөленсін, Олар масқараға жамылғыдай орансын."},
	{30, "30 Мен Жаратқан Иеге көп мақтау айтамын, Үлкен жиында Оның даңқын асырамын,"},
	{31, "31 Жаратқан бейшара жанды қолдап-қорғайды, Айыптаушылардан аман-есен сақтайды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view109() {
struct kk109 poems[] = {
	{1, "1 (Дәуіттің жыры.) Жаратқан Ие менің иеме былай деп айтқан: Мен жауларыңды табаныңның астына Салып бергенімше отыр оң жағымда."},
	{2, "2 Жаратқан Сионнан билігіңді құрғызады сенің, Енді жауларыңа да үстемдік жүргізесің,"},
	{3, "3 Сен патшалық құрған күні бағынады халқың. Туғаннан-ақ киелі салтанат жамыласың, Күн сайын таң ата жаңаратын шық сияқты, Сен де ұдайы жасара түсетін боласың."},
	{4, "4 Жаратқан былай деп ант берген еді, Онысын ешқашан да өзгертпейді: Сен Мәліксадықтай діни қызметкерсің, Мәңгі сондай болып қала да бересің!"},
	{5, "5 Жаратқан Ие сенің оң жағыңда тұрады, Қаһарланған күні Ол патшаларды ұрады,"},
	{6, "6 Халықтарды соттап, көп адамдарын жояды, Бүкіл жер бетінің билеушілерін соғады."},
	{7, "7 Патша жолшыбай бұлақтан сусындап алады, Еңсесін көтеріп, жеңімпаз болып шығады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view110() {
struct kk110 poems[] = {
	{1, "1 Мадақтаңдар Жаратқан Иені! Мақтау айтамын Жаратқан Иеге, Халық жиылып, әділдер кеңескенде."},
	{2, "2 Қандай ұлы — Жаратқанның істері, Оларды ұнатқандар терең зерттейді."},
	{3, "3 Оның істері ұлы да салтанатты, Әділдігі мәңгілікке ұласады."},
	{4, "4 Ол кереметтерін есте қаларлық қылды, Иеміз шапағатты да қайырымды,"},
	{5, "5 Өзін қастерлейтінді аспен қамтиды, Келісімін ұдайы есінде сақтайды."},
	{6, "6 Ол құдіретті істерін халқына көрсетті, Өзге ұлттардың жерін оған мұра етті."},
	{7, "7 Жаратқанның істері адал да әділетті, Оның бұйрықтары да түгел сенімді,"},
	{8, "8 Олар мәңгілікке берік негізделген, Әрі орындалады шындықпен, адалдықпен."},
	{9, "9 Жаратқан Ие өз халқын азат етті, Келісімін мәңгілікке бекітті, Есімі Оның киелі де қасиетті."},
	{10, "10 Даналықтың бастауы — терең қастерлеу Жаратқан Иені әрі Оған шын бағыну, Мұны ұстанған әркім парасатты болады. Иеміз мәңгі бақи мадақталады!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view111() {
struct kk111 poems[] = {
	{1, "1 Жаратқан Иені мадақтаңдар! Иеміздің өсиеттерінен ләззат тапқан, Оны қастерлейтін жан жарылқанған."},
	{2, "2 Әулеті оның елде күшті болады, Иә, әділдің ұрпақтары жарылқанады,"},
	{3, "3 Оның үйінде байлық-дәулет жиналады, Әрі әділдігі мәңгі есте қалады."},
	{4, "4 Турашыл жанға түнекте таң атады, Ол рақымды, мейірбан, әділ болады,"},
	{5, "5 Мұқтажға қайырыммен қарыз береді, Әрі істерін әділдікпен жүргізеді, Содан оның өзі де жақсылық көреді."},
	{6, "6 Шүбә жоқ, ол ешқашан шайқалмайды, Әділ жан жұрттың есінен шықпайды."},
	{7, "7 Сондай адам қауесеттен қорықпайды, Жаратқанға сеніп жүрегі қобалжымайды,"},
	{8, "8 Қайта, жүрегі нық, үрейленбейді, Соңында жаулардың жеңілісін көреді."},
	{9, "9 Ол мұқтаждарға мол көмек таратады, Оның әділдігі мәңгіге ұласады, Абыройы да жоғарылайтын болады."},
	{10, "10 Ал зұлым жан мұны көріп, абыржиды, Тісін қайрап, қалжырап қажиды, Зұлымдардың аңсағаны құриды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view112() {
struct kk112 poems[] = {
	{1, "1 Жаратқан Иені мадақтаңдар! Иеміздің қызметшілері, мақтау айтыңдар, Жаратқанның есімін мадақтаңдар!"},
	{2, "2 Қазіргі кезден мәңгілікке дейін Жаратқанның есімі дәріптеле берсін!"},
	{3, "3 Күннің шығысынан батысына дейін Жаратқанның есімі қастерлене берсін!"},
	{4, "4 Жаратқан бар ұлттардан да жоғары, Оның салтанаты аспаннан да жоғары."},
	{5, "5 Кім Құдайымызға тең бола алады? Жаратқан Ие зәулім тағында отырады,"},
	{6, "6 Ол төмен қарап аспан мен жерге көз салады."},
	{7, "7 Құдай тозаңнан кедейді жоғарылатар, Күл-қоқыстан мұқтажды көтеріп алар."},
	{8, "8 Оларды әміршілермен бірге отырғызар, Халқының көсемдерімен жайғастырар."},
	{9, "9 Бедеу әйелді отбасымен жарылқар, Перзент сыйлап, шат-шадыман қылар. Жаратқан Иені мадақтаңдар!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view113() {
struct kk113 poems[] = {
	{1, "1 Исраил көшіп шыққанда Мысырдан, Жақыптың әулеті сол бөтен тілді жұрттан,"},
	{2, "2 Яһуда елі Құдайдың киелі үйіне Айналды, Исраил де — Оның иелігіне."},
	{3, "3 Сонда теңіз көріп, қаша жөнелді, Иордан өзені кері бұрылды,"},
	{4, "4 Таулар қошқар іспетті секірді, Төбелер қозы іспетті секектеді."},
	{5, "5 Уа, теңіз, сен неге қаша жөнелдің? Уа, Иордан, сен неге кері бұрылдың?"},
	{6, "6 Таулар, қошқардай неге секірдіңдер? Төбелер, қозыдай неге секектедіңдер?"},
	{7, "7 Жер, дірілде Жаратқанның алдында, Жақып сиынған Құдайдың алдында."},
	{8, "8 Құдай жартасты айналдырды көлге, Дәу шақпақ тасты атқылаған су көзіне."},
	{9, "9 Біздің емес, уа, Жаратқан, тек Сенің атың Рақымың мен адалдығың үшін даңқталсын!"},
	{10, "10 Қайда екен сиынған Құдайы бұлардың? Деп басқа халықтар неге табаласын?"},
	{11, "11 Ал сиынған Құдайымыз заңғар көкте, Ол барлық қалауын асырады іске."},
	{12, "12 Өзге ұлттардың пұттары күміс, алтыннан, Адамдардың қолдарымен жасалған."},
	{13, "13 Пұттың аузы бар, бірақ сөйлей алмайды, Көздері бар, бірақ көре алмайды,"},
	{14, "14 Құлақтары бар, бірақ ести алмайды, Мұрны бар, бірақ иіс білмейді,"},
	{15, "15 Қолдары бар, бірақ сезе алмайды, Аяқтары бар, бірақ жүре алмайды, Көмейінен бір дыбыс та шықпайды."},
	{16, "16 Өлі пұтты жасаған пенде соған ұқсайды, Мүсінге сенген әркім де содан аумайды."},
	{17, "17 Уа, Исраилдің бүкіл әулеті, Сенім артыңдар Жаратқан Иемізге! Қалқандай қорғап, қолдайды Ол біздерді."},
	{18, "18 Уа, Һаронның бүкіл әулеті, Сенім артыңдар Жаратқан Иемізге! Қалқандай қорғап, қолдайды Ол біздерді."},
	{19, "19 Уа, қастерлейтіндер Иемізді, Сенім артыңдар Жаратқан Иемізге! Қалқандай қорғап, қолдайды Ол біздерді."},
	{20, "20 Жаратқан Ие бізді есінде ұстайды, Иә, Иеміз біздерді жарылқайды, Ол Исраилдің әулетін жарылқайды, Һәм Һаронның ұрпақтарын жарылқайды."},
	{21, "21 Жаратқан Өзін қастерлейтін жандарды — Үлкенді-кішілі бәрін де жарылқайды."},
	{22, "22 Өздерің мен ұрпақтарыңның сандарын Жаратқан Ие ұдайы ұлғайтсын."},
	{23, "23 Аспанды да, жерді де жаратқан Иеміз өздеріңді жарылқаған."},
	{24, "24 Заңғар көк — Жаратқанның иелігі, Ал жер бетін Ол адамзатқа берді."},
	{25, "25 Өлілер Жаратқанды дәріптемес, Қабірде жатқандар үндемес,"},
	{26, "26 Ал біз паш етеміз Иеміздің игілігін Қазіргі кезден мәңгілікке дейін. Жаратқан Ие дәріптеле берсін!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view114() {
struct kk114 poems[] = {
	{1, "1 Қатты сүйемін Жаратқан Иені, Жалынған даусымды Ол естіді,"},
	{2, "2 Иә, Ием құлақ түрді маған, Өмір бойы сиынбақпын Оған."},
	{3, "3 Өлімнің торы жан-жақтан шырмады, Ажалдың азабы мені қинады, Зор қайғы-қасірет тым меңдеп алды."},
	{4, "4 Жаратқанның атын атап сиындым: Уа, Ием, құтқаршы мені! — деп шақырдым."},
	{5, "5 Жаратқан Ие әділ де рақымды, Біздің Құдайымыз сондай қайырымды!"},
	{6, "6 Иеміз қорғайды ақпейіл жандарды, Мүшкіл халімнен Ол мені құтқарып алды."},
	{7, "7 Тыныштала гөр енді, уа, жан дүнием, Мол игілік жасады Жаратқан Ием."},
	{8, "8 О, Жаратқан, Сен жанымды өлімнен Құтқардың һәм көзімді жас төгуден, Аяғымды сақтадың сүрінуден."},
	{9, "9 Осылай мен тірілердің ғаламында Жүремін Жаратқанның көз алдында."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view115() {
struct kk115 poems[] = {
	{1, "1 Ием, мен Саған сенімімді жүктедім, Содан мынаны айттым: Қатты қиналып жүрмін!"},
	{2, "2 Үрейім ұшып, тым абыржыған едім, Күллі жандар өтірікші! деп түңілдім."},
	{3, "3 Жаратқанның көрсеткен жақсылықтарын Қалай ғана Өзіне қайтара аламын?"},
	{4, "4 Мені құтқарғаны үшін шүкірлік тостағанын Көтеріп, паш етемін Иеміздің атын,"},
	{5, "5 Жаратқанға берген анттарымның барлығын Бүкіл халқы алдында іске асырамын."},
	{6, "6 Иемізге бағышталған адамдарының Ажалына Жаратқан Ие аударады назарын."},
	{7, "7 Уа, Ием, шынымен Сенің қызметшіңмін, Мен, сондай-ақ, күңіңнің баласымын, Сен Өзің мені бұғаудан босаттың."},
	{8, "8 Шүкірлік құрбандығын ұсынамын Саған, Сенің атыңды паш етемін, уа, Жаратқан."},
	{9, "9 Жаратқанға берген анттарымның барлығын Бүкіл халқы алдында іске асырамын:"},
	{10, "10 Иемнің киелі үйінің ауласында, Уа, Иерусалим, сенің қақ ортаңда. Жаратқан Иені мақтаңдар әр уақытта!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view116() {
struct kk116 poems[] = {
	{1, "1 Иемізді даңқтаңдар, барлық ұлттар! Оны мадақтаңдар, күллі халықтар!"},
	{2, "2 Ол зор мейірімін танытады, Бізге мәңгілік адал болады. Мадақтаңдар Иеміз — Жаратқанды!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view117() {
struct kk117 poems[] = {
	{1, "1 Жаратқан Ие ізгі, мадақтаңдар Оны, Мәңгіге ұласады берік рақымы!"},
	{2, "2 Мәңгіге ұласады берік рақымы! Деп жарияласын Исраил халқы."},
	{3, "3 Мәңгіге ұласады берік рақымы! Деп мойындасын Һаронның ұрпақтары."},
	{4, "4 Мәңгіге ұласады берік рақымы! Десін Иемізді қастерлейтін барлығы."},
	{5, "5 Мүшкіл халімде шақырдым Жаратқанды, Ол жауап беріп, мені азат етіп алды."},
	{6, "6 Ием маған жар, қорықпаймын ешбір жайттан, Не істей алады адам баласы маған?"},
	{7, "7 Ием маған жар, Ол — Қолдаушым менің, Жаудың жеңілісін әлі де көремін."},
	{8, "8 Адам баласына сенім артқаннан гөрі Жаратқан Иені паналау сондай игі!"},
	{9, "9 Әмірші, әкімдерге сенім артқаннан гөрі Жаратқан Иені паналау сондай игі!"},
	{10, "10 Барлық ұлттар айнала қоршап алды, Жаратқанның атымен құрттым оларды."},
	{11, "11 Жан-жақтан олар мені қоршап алды, Жаратқанның атымен құрттым оларды."},
	{12, "12 Айналамда олар арадай құжынады, Бірақ жанған бұтадай тез өшіп қалды, Жаратқанның атымен құрттым оларды."},
	{13, "13 Құлатпақ болып сол жаулар қатты итерді, Ал Жаратқан Ие мені қолдап демеді."},
	{14, "14 Күш-қуатым әрі жырым — Жаратқаным, Ол болды, міне, менің Құтқарушым."},
	{15, "15 Құтқарылу мен жеңістің шаттық айқайы Әділдердің үйлерінде жаңғырады: Жаратқан Иенің құдіретті оң қолы Қандай ғажап кереметтер жасайды!"},
	{16, "16 Сонда көтерілді Иеміздің оң қолы: Жаратқан Иенің құдіретті оң қолы Қандай ғажап кереметтер жасайды!"},
	{17, "17 Енді өлмеймін, өмір сүре беремін, Жаратқанның істерін паш етемін."},
	{18, "18 Жаратқан мені қатты жазалады, Бірақ жанымды ажалға қимады."},
	{19, "19 Әділдік қақпаларын маған ашшы, Оған кіріп, мадақтайын Жаратқанды."},
	{20, "20 Мына қақпа — Жаратқанның қақпасы, Әділ жандар оған кіре алады."},
	{21, "21 Сені мадақтаймын, маған құлақ салдың, Уа, Ием, менің Құтқарушым Сен болдың."},
	{22, "22 Құрылысшылар менсінбеген тас енді Үйдің басты іргетасына айналды!"},
	{23, "23 Жаратқанның Өзі соны істеді, Көз алдымызда бұл керемет болды!"},
	{24, "24 Иеміз жаратты бізге бұл күнді, Шаттанып қуанайық осы күні."},
	{25, "25 Уа, Жаратқан, бізді құтқаршы, Уа, Иеміз, табыс сыйлашы!"},
	{26, "26 Жаратқанның атынан келе жатқан жарылқанған, Оның киелі үйінен бата береміз соған."},
	{27, "27 Жаратқан Ие — Құдай, Ол бізге нұрын шашқан. Мейрамның құрбандық малын апарыңдар, Үстелдің мүйіздеріне байлап қойыңдар."},
	{28, "28 Сен Құдайымсың, Саған мақтау айтамын, Сен Құдайымсың, даңқыңды асырамын."},
	{29, "29 Жаратқан Ие ізгі, мадақтаңдар Оны, Мәңгіге ұласады берік рақымы!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view118() {
struct kk118 poems[] = {
	{1, "1 Пәк таза да тура жолмен жүріп, Жаратқанның тәліміне бағынғандар бақытты!"},
	{2, "2 Иеміздің ережелерін ұстанып, Шын жүректен Оған бет бұрғандар бақытты!"},
	{3, "3 Олар әділетсіздік істемейді, Тек Жаратқанның жолымен ғана жүреді."},
	{4, "4 Ием, тұрақты орындауымыз үшін, Өз бұйрықтарыңды шығарған едің."},
	{5, "5 Сенің жарлықтарыңа бағынып мен Жүре берсем, шіркін, тура жолыңмен!"},
	{6, "6 Сонда ден қойып бар өсиеттеріңе, Ешқашан масқара болмас та едім."},
	{7, "7 Әділ шешімдеріңді үйренгенде Сені дәріптеймін таза жүрекпен."},
	{8, "8 Мен жарлықтарыңды ұстана берем, Жалғыз қалдыра көрме мені мүлдем."},
	{9, "9 Жастар қалай таза жолмен жүре алады? Сөзіңе бағынып соны істей алады."},
	{10, "10 Шын жүректен Саған бет бұрып келемін, Тайдыра көрме мені өсиеттеріңнен."},
	{11, "11 Күнә жасамауым үшін Саған қарсы, Жүрегіме сақтадым айтқандарыңды."},
	{12, "12 Даңқталуға лайықсың, уа, Жаратқан, Үйрете гөр жарлықтарыңды маған."},
	{13, "13 Мен дауыстап айтып та отырамын Бар шешімдеріңді Өзің шығарған."},
	{14, "14 Жұрт шаттана қуанғандай мол байлыққа, Мен ережелеріңмен жүремін шаттана."},
	{15, "15 Бұйрықтарың жайлы терең ойланамын, Сенің жолыңа мұқият ден қоямын."},
	{16, "16 Жарлықтарыңды қуана орындаймын, Сөздеріңді ешқашан ұмытпаймын."},
	{17, "17 Уа, Ием, мол мейірім көрсете гөр маған, Сонда аман болып, сөзіңді сақтай аламын."},
	{18, "18 Рухани көзімді аша гөр менің, Тәліміңнен кереметтер көрейін."},
	{19, "19 Бұ дүниеде жат жерлік кірмедеймін. Өсиеттеріңді жасыра көрме менен."},
	{20, "20 Шешімдеріңді үйренуді сағынып, Жаным әрдайым шөліркейді зарығып."},
	{21, "21 Сөгіп ескертесің тәкаппар адамдарды, Өсиеттеріңнен тайған сол қарғалғандарды."},
	{22, "22 Масқара, қорлықты алып тастай гөр менен, Ережелеріңді ұстанып келемін мен."},
	{23, "23 Әкімдер жиналып, мені өсектегенмен, Жарлықтарың жайлы толғанамын, уа, Ием."},
	{24, "24 Ережелеріңнен рақат табамын, Олар маған ақыл береді әрдайым."},
	{25, "25 Ажал аузында жанымның жатқаны-ай, Аман сақтай гөр берген уәдеңе сай!"},
	{26, "26 Жүрген жолдарымды айтып бергенімде Өзің құлақ салып, жауап бердің де, Жарлықтарыңды маған үйрете гөр енді."},
	{27, "27 Ұқтыра гөр бұйрықтарыңның мағынасын, Кереметтерің жайлы терең ойланамын."},
	{28, "28 Жаныма қайғы батып, шаршап-шалдыққам, Уәдеңе сәйкес күш сыйлай гөр маған."},
	{29, "29 Тәліміңді маған сыйлап рақымменен, Жалғандық жолын алшақтата гөр менен."},
	{30, "30 Шындық жолымен жүруді таңдап алдым да, Шешімдеріңді ұстаймын мен көз алдымда."},
	{31, "31 Берік ұстанамын Сенің ережелеріңді, Уа, Жаратқан, ұятқа қалдыра көрме мені."},
	{32, "32 Менің жүрегімді азат еттің Сен, Жүремін өсиеттеріңнің жолымен."},
	{33, "33 О, Ием, үйретсеңші жарлықтарыңның жолын, Оны соңына дейін берік ұстанбақпын."},
	{34, "34 Түсінік сыйлашы, тәліміңді сақтамақпын, Оған шын жүректен мойынсұнбақпын."},
	{35, "35 Жүргізе гөр мені өсиетіңнің жолымен, Содан зор қуаныш тауып келемін мен."},
	{36, "36 Жан дүнием пайдақорлыққа салынбасын, Оны ережелеріңе құштар етсең, шіркін!"},
	{37, "37 Бос нәрселерге түсірмей көзімді, Өз жолыңда жаңарта гөр өмірімді."},
	{38, "38 Ием, орындай гөр маған берген сөзіңді, Содан бәрі терең қастерлесін Өзіңді."},
	{39, "39 Менен алшақтата гөр үрейлі масқараны, Себебі шешімдерің сондай жақсы!"},
	{40, "40 Қалаймын бұйрықтарыңа бағынуды, Әділдігіңмен сергіте гөр жанымды."},
	{41, "41 Уа, Жаратқан, маған рақымыңды түсіре гөр, Берген сөзіңе сай мені құтқара гөр."},
	{42, "42 Сонда сөккенге жауап бере аламын, Сенің сөзіңе сенімімді артамын."},
	{43, "43 Шындық сөзін алып қойма аузымнан, Шешімдеріңе үмітімді артамын,"},
	{44, "44 Тәліміңді мен ұдайы ұстанамын, Әрдайым оны орындайтын боламын."},
	{45, "45 Содан жүрісім де болады емін-еркін, Себебі бұйрықтарыңа бет бұрып келемін."},
	{46, "46 Патшалар алдында ережеңді айтамын, Сонда ешқандай қаймықпайтын боламын."},
	{47, "47 Өсиеттеріңді қатты ұнатамын, Олардан жұбаныш пен рақат табамын."},
	{48, "48 Өсиеттеріңді сүйіп, қабылдаймын, Жарлықтарың жайлы үңіле ойлаймын."},
	{49, "49 Ескере гөр пендеңе берген уәдеңді, Өзің қалайсың соған үміттенуімді."},
	{50, "50 Сенің сөзің мені жандандырады, Бұл мені жапа шеккенде жұбатады."},
	{51, "51 Паң жандар мені мазақтай бергенмен, Тағылымыңнан тайып кетпедім мен."},
	{52, "52 Ежелгі шешімдеріңді еске аламын, Уа, Жаратқан, содан жұбаныш табамын."},
	{53, "53 Тағылымыңнан безген зұлымдарды Көргенімде ашу кернейді бойымды."},
	{54, "54 Жат жерлік болып тұрған жақтарда мен Жарлықтарыңды жырлап жүремін."},
	{55, "55 Уа, Жаратқан, түнде атыңды есіме саламын, Сенің тәліміңді ұдайы ұстанамын."},
	{56, "56 Бұл менің берік әдетіме айналды: Іске асырамын берген бұйрықтарыңды."},
	{57, "57 Уа, Жаратқан, Өзіңсің менің үлесім, Сөздеріңді сақтаймын деп уәде бердім."},
	{58, "58 Шын жүректен сиынып келемін Саған: Уәдеңе сай рақымды бола гөр маған."},
	{59, "59 Жүрген жолдарыма түңіле толғандым, Ережелеріңмен жүруге бел будым."},
	{60, "60 Мен өсиеттеріңді тез орындап, Кешеуілдеткен жоқпын жалтақтап."},
	{61, "61 Зұлымдар шырмап алды айналамды, Ал мен ұмытпадым тағылымыңды."},
	{62, "62 Сені әділ шешімдеріңе бола Дәріптеймін, тұрып түн ортасында."},
	{63, "63 Мен Сені терең қастерлеген жандардың Әрі бұйрықтарыңды ұстанғандардың Барлығымен де жақын жолдаспын."},
	{64, "64 Жер мейіріміңе толы, о, Жаратқан, Жарлықтарыңды үйрете гөр маған."},
	{65, "65 Берген сөзіңе сай, уа, Жаратқан, Көп жақсылық жасап келесің маған."},
	{66, "66 Мені үйретші дұрыс түсінік пен білімге, Себебі сенемін Сенің өсиеттеріңе."},
	{67, "67 Мен азап шекпес бұрын жолдан адасқан едім, Ал енді Сенің сөзіңді сақтап жүремін."},
	{68, "68 Ізгісің Сен, істейсің игі істеріңді, Үйрете көрші маған ережелеріңді."},
	{69, "69 Тәкаппарлар жапса да маған жалаларын, Мен шын жүректен бұйрықтарыңа бағынамын."},
	{70, "70 Олардың жүрегі сезімсіз боп қасарысқан, Ал мен рақат табамын тағылымыңнан."},
	{71, "71 Үйренуім үшін жарлықтарыңды, Азап шеккенім маған жақсы болды."},
	{72, "72 Мыңдаған алтын-күміс ақшалардан Аузыңнан шыққан тәлімің қымбат маған!"},
	{73, "73 Сенің қолың мені жаратып қалыптастырды, Енді түсінік сыйлап, үйрете гөр бұйрықтарыңды."},
	{74, "74 Сені қастерлейтіндер мені көргенде шаттансын, Себебі Сенің сөзіңе сенімімді артамын."},
	{75, "75 Сенің шешімдеріңнің әділдігін мойындаймын, Мені жазалағаның да әділ, уа, Жаратқаным."},
	{76, "76 Осы пендеңе берген уәдеңе сай мейірімің Маған ұдайы жұбаныш бола берсін."},
	{77, "77 Рақымың түсіп, мен аман болайын, Тағылымыңнан қуаныш табайын."},
	{78, "78 Мені себепсіз езген паңдар масқаралансын, Ал мен бұйрықтарың туралы толғанамын."},
	{79, "79 Қастерлеп Сені, ережелеріңді білетін Кісілер маған бет бұрып, қосылса, шіркін!"},
	{80, "80 Масқара болмауым үшін жүрегім менің Жарлықтарыңа түгел адал бола берсін!"},
	{81, "81 Құтқаруыңды аңсап шаршап келемін, Бірақ Сенің сөзіңе үміттенемін."},
	{82, "82 Мені қашан жұбатасың? деп зарығып, Көзім талды сөзіңнің іске асуын тосып."},
	{83, "83 Түтінге қақталған торсықтай мен Еш нәрсеге жарамсыз көрінгенмен, Шығармадым жарлықтарыңды есімнен."},
	{84, "84 О, Ием, мен тағы қанша уақыт тосайын, Мені қудалағандарды қашан соттайсың?"},
	{85, "85 Сол тәкаппарлар Сенің заңыңа қарсы Мені құлатпақ болып терең ор қазды."},
	{86, "86 Күллі өсиет атаулың адал да ақиқат, Жар бола гөр, жау артымнан қуады нақақ!"},
	{87, "87 Олар мені аластата жаздады жерден, Бірақ Сенің бұйрықтарыңнан безбедім мен."},
	{88, "88 Сақтауым үшін шығарған ережелеріңді, Рақымыңа сай нығайта гөр өмірімді."},
	{89, "89 Сенің айтқан сөздерің, Жаратқан Ием, Көкте тұр мәңгілікке бекітілген!"},
	{90, "90 Күллі келер ұрпаққа адал боласың, Жер бола береді, Сен оны орнаттың."},
	{91, "91 Шешімдеріңе сай бұған дейін бәрі тұрады, Бір Өзіңе барлығы да қызмет қылады."},
	{92, "92 Сенің тәлімің мені жұбатып қуантпағанда, Құрып кеткен болар едім мүшкіл жағдайымда."},
	{93, "93 Ешқашан ұмытпаймын ережелеріңді, Солармен аман сақтайсың өмірімді."},
	{94, "94 Құтқара гөр мені, себебі Сенікімін, Мен бұйрықтарыңа көңіл бөліп келемін."},
	{95, "95 Зұлымдар аңдып жүр мені құртуға, Мен болсам үңілемін жарлықтарыңа."},
	{96, "96 Әр кемелдіктің шегі бар екенін түсіндім, Ал аясы шексіз Сенің өсиеттеріңнің!"},
	{97, "97 Сенің тәліміңді сондай қатты сүйемін! Күні бойы сол жайлы ойланып та жүремін."},
	{98, "98 Өсиеттерің есімде мәңгі бақи қалады, Олар мені жауларымнан парасатты қылады."},
	{99, "99 Бар ұстазымнан терең ұға аламын, Себебі жарлықтарың туралы толғанамын."},
	{100, "100 Тіпті жасы үлкендерден де білімдірекпін, Себебі бұйрықтарыңды сақтап келемін."},
	{101, "101 Сенің сөздеріңді ұстанып келемін, Сол үшін теріс жолдан аулақ жүремін."},
	{102, "102 Сенің шешімдеріңнен тайып кетпеймін, Өйткені Өзің маған тәлім беріп келесің."},
	{103, "103 Қандай тамаша Сенің сөзіңнің дәмі, Ол тіпті тіл үйірген балдан да тәтті!"},
	{104, "104 Ақыл-кеңес табамын бұйрықтарыңнан, Бар жалған жолдар сондай жексұрын маған!"},
	{105, "105 Сенің сөздерің қадамдарымды жарқыратады, Өмір жолыма шам-шырақтай нұрын шашады."},
	{106, "106 Мен ант еттім әділ шешімдеріңді сақтауға, Сөзімде тұрып, сертімді орындаймын да."},
	{107, "107 Уа, Жаратқан Ие, қиналып жүрмін тым қатты, Берген сөзіңе сай өмірімді жаңартсаңшы!"},
	{108, "108 Аузымнан шыққан мадақтауымды, уа, Жаратқан, Ерікті сый-тарту деп менен қабылдасаң, Әрі өз шешімдеріңді үйретсеңші маған,"},
	{109, "109 Әрқашан жанымды қиюға дайынмын, Сенің тәліміңді есімнен шығармаймын!"},
	{110, "110 Зұлымдар маған тор салып, тұзақ құрған, Ал мен тайып кетпедім бұйрықтарыңнан."},
	{111, "111 Ережелеріңді қабылдадым мәңгі мұраға, Жүрегімді кенелтеді олар қуанышқа."},
	{112, "112 Жүрегімде нық шешім қабылдадым бағынуға Ақырына дейін Сенің жарлықтарыңа."},
	{113, "113 Жалтақтайтын жандарды еш жақтырмаймын, Сенің тәліміңді қатты ұнатамын!"},
	{114, "114 Сен қорғанымсың әрі қалқаным, Сенің сөзіңе сенімімді артамын."},
	{115, "115 Әй, әділетсіздер, аулақ кетіңдер қасымнан, Құдайымның өсиеттерін ұстанатын болам."},
	{116, "116 Тірі қалуым үшін мені қолдасаңшы, Берген уәдең бойынша нығайтсаңшы, Үмітім Өзіңде: ұятқа қалдырмасаңшы."},
	{117, "117 Мені қолдай гөр, сонда аман қаламын, Жарлықтарыңа ұдайы ден қоямын."},
	{118, "118 Жарлықтарыңнан безгендерді құлатасың, Құр бекер — айлалы қылықтары олардың."},
	{119, "119 Қоқыстай шығарасың жердің бар зұлымдарын, Ережелеріңді сондықтан қатты ұнатамын."},
	{120, "120 Тұла бойым дірілдеп Сенен қорқамын, Шешімдеріңді елемеуден шошынамын."},
	{121, "121 Қуғыншылардың қолына түсіре көрме мені, Жасап келемін ғой әділ де дұрыс істерді."},
	{122, "122 Осы пендеңді игілікке жеткізіп, қолдай гөр, Паң жандардың жәбірінен мені сақтай гөр!"},
	{123, "123 Әділ уәдеңнің іске асуын тосып, Көзім талды құтқаруыңды аңсай күтіп."},
	{124, "124 Осы пендеңе рақымшылықпен қарай гөр, Жарлықтарың жайлы тәлім бере гөр."},
	{125, "125 Пендеңмін, түсінік сыйлай гөр маған, Сонда ережелеріңді ұғына аламын."},
	{126, "126 Уа, Жаратқан, шара қолданатын уақытың жетті: Адамдар Таурат заңыңа бағынбай кетті!"},
	{127, "127 Ал мен Сенің өсиеттеріңді алтыннан Артық көремін, әрі саф алтыннан!"},
	{128, "128 Содан бар бұйрықтарыңды әділ деп санаймын, Бүкіл бұрыс жолдарды да жақтырмаймын."},
	{129, "129 Сондай керемет — Сенің ережелерің, Сондықтан оларға шын жүректен көнемін."},
	{130, "130 Мәнісі ашылғанда сөздерің нұрын шашады, Білімсіздердің де санасын оятып ашады."},
	{131, "131 Аузын ашып, ауаға зәру болған кісідей, Мен шексіз құштармын Сенің өсиеттеріңе."},
	{132, "132 Есіміңді сүйген өзгелерге істегеніңдей, Маған да бет бұрып, көрсете гөр мейіріміңді."},
	{133, "133 Қадамдарымды табанды ете гөр сөзіңмен, Еш жамандық жүргізбесін маған өктемдігін!"},
	{134, "134 Мені құтқара гөр адамдардың езгісінен, Сонда бұйрықтарыңды сақтай аламын мен."},
	{135, "135 Уа, Ием, маған нұрын төгіп бет-жүзіңнің, Үйрете гөр ережелеріңді Өзіңнің."},
	{136, "136 Көпшілік көнбегендіктен тағылымыңа, Көз жасым менің көл болып ағылуда."},
	{137, "137 Уа, Жаратқан Ие, Сен әділсің, Әрі әділетті күллі шешімдерің!"},
	{138, "138 Әділдікпен және шексіз адалдықпен Ережелеріңді белгілеп бердің Сен."},
	{139, "139 Сөздеріңді менсінбейді дұшпандарым, Соған қатты налып, шаршап-шалдығамын."},
	{140, "140 Уәделеріңнің шындығы іс жүзінде сыналған, Уа, Ием, оларды қатты ұнатамын сондықтан."},
	{141, "141 Жұрт менсінбей, кішік болғаныммен, Бас тартпаймын Сенің ережелеріңнен."},
	{142, "142 Сенің әділдігің — мәңгі бақи хақ, Әрі тағылымың — нағыз ақиқат."},
	{143, "143 Ауыртпалыққа ұшырап, қысылып қалдым, Ал өсиеттеріңнен жұбаныш пен рақат таптым."},
	{144, "144 Мәңгілік әділетті ережелерің Сенің, Түсінік сыйлай гөр шын өмір сүруім үшін."},
	{145, "145 Уа, Ием, шын жүректен Саған сиынамын: Құлақ сала гөр, жарлықтарыңа бағынамын."},
	{146, "146 Мені құтқара гөр деп Саған жалынамын, Ережелеріңді ұстанатын боламын."},
	{147, "147 Таң атпас бұрын Сені көмекке шақырамын, Сенің берген сөзіңе сенімімді артамын."},
	{148, "148 Сөзіңе терең үңілу мақсатында Ұйқыдан бас тартамын таң алдында."},
	{149, "149 Уа, Ием, рақыммен үніме құлақ сала гөр, Әділдігіңе сай өмірімді нығайта гөр!"},
	{150, "150 Сұм жоспар құрғандар таяп қалды маған, Олар алшақтап кетті тағылымыңнан."},
	{151, "151 Ал, Жаратқан Ие, Сен маған жақынсың, Нағыз шындық — күллі өсиет атаулың."},
	{152, "152 Баяғыда-ақ мен Сенің ережелеріңнен Оларды мәңгілік орнатқаныңды білгенмін."},
	{153, "153 Мүшкіл халіме көз салып құтқарсаңшы, Есімнен шығармадым тағылымыңды."},
	{154, "154 Сен мені жақтап, мүддемді қорғасаңшы, Уәдеңе сәйкес өмірімді сақтасаңшы."},
	{155, "155 Құтқарылу тым алыс зұлымдардан, Өйткені олар безеді жарлықтарыңнан."},
	{156, "156 Уа, Ием, ұлан-ғайыр — Сенің мейірімің, Шешіміңе сай нығайта гөр өмірімді менің."},
	{157, "157 Мені қудалауда жаулар сонша көптеген, Бірақ мен бас тартпаймын ережелеріңнен."},
	{158, "158 Опасыздарды көргенде жиренемін, Олар сақтамайды сөздеріңді Сенің."},
	{159, "159 Бұйрықтарыңды қалай сүйетініме қарасаңшы, О, Ием, рақымыңа сай өмірімді нығайтсаңшы."},
	{160, "160 Түп-тамырымен ақиқат Сенің сөздерің, Әділетті де мәңгілік әрбір шешімің."},
	{161, "161 Басшылар жазықсыз мені қудалайды, Ал жүрегім сөздеріңді қастерлеп қалтырайды."},
	{162, "162 Зор олжаға тап болған адам сияқты, Сенің сөздеріңе қуанамын сондай қатты!"},
	{163, "163 Жалғандықты жек көріп, одан жиренемін, Өзіңнің тағылымыңды қатты сүйемін!"},
	{164, "164 Өзіңді әділетті шешімдерің үшін Сені күніне жеті рет дәріптеудемін."},
	{165, "165 Тәліміңді сүйгендер тыныштыққа кенелер, Ештеңеге сүрінбей, аман-есен жүрер."},
	{166, "166 Уа, Ием, өсиеттеріңді іске асырамын, Мені құтқарасың деп үміттене тосамын."},
	{167, "167 Ережелеріңді жан дүниемде сақтап келемін, Өйткені мен оларды қатты сүйемін."},
	{168, "168 Мойынсұнамын ережелерің мен заңдарыңа, Барлық жүрген жолдарым Сенің көз алдыңда."},
	{169, "169 Жалбарынған үнім құлағыңа жетсе екен, Түсінік сыйлай гөр уәдеңе сай, уа, Ием."},
	{170, "170 Өтінішім Өзіңнің алдыңа жетсінші, Берген сөзіңе сай мені құтқара көрші."},
	{171, "171 Сен маған үйреткендіктен ережелеріңді, Лайым аузым мадақтай берсін Өзіңді."},
	{172, "172 Тілім сөздеріңді ән-жырға қоса берсін, Өйткені әділ күллі өсиеттерің Сенің."},
	{173, "173 Бұйрықтарыңды орындаймын деп шешкенмін, Құдіретті қолың маған көмектесе көрсін."},
	{174, "174 Уа, Жаратқан Ием, құтқаруыңды аңсап тосамын, Сенің тағылымыңнан зор қуаныш табамын."},
	{175, "175 Жаным аман қалып, Сені дәріптей берсін, Шешімдерің тірек болып мені қолдай көрсін."},
	{176, "176 Жоғалған қой іспетті адасып келемін, О, Ием, іздеп мені, қасыңа қайтарсаң екен, Өсиеттеріңді енді шығармаймын есімнен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view119() {
struct kk119 poems[] = {
	{1, "1 (Киелі үйге қарай өрлеп бара жатқанда айтылатын жыр.) Мүшкіл халімде Иеме жалбарындым, Ол мінажатыма түрді құлағын."},
	{2, "2 Құтқара көрші мені, уа, Жаратқан, Айлалы тіл мен өтірікші ауыздан."},
	{3, "3 Ісіңнің қарымтасын, ей, айлакер жан, Саған қанша қылып қайтарар Жаратқан:"},
	{4, "4 Тартар жазаң сарбаздың өткір оғындай, Әрі жанған ағаш көмірінің шоғындай."},
	{5, "5 Алыс Мешехте кірме болып тұрған, Қидар шөлінде шатыр маңында қонған Сияқты сорлы басымды қайғы басқан!"},
	{6, "6 Ынтымақты ұнатпайтындармен Ұзақ уақыт бірге тұрып келемін,"},
	{7, "7 Татулықты сүйетін жанмын мен, Ал олар таласпақшы, бұл жайлы сөйлесем."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view120() {
struct kk120 poems[] = {
	{1, "1 (Киелі үйге қарай өрлеп бара жатқанда айтылатын жыр.) Тауға көзді қадаймын Қайдан жәрдем келер деп."},
	{2, "2 Көк пен жерді жаратқан Құдай Ием маған жар."},
	{3, "3 Тайдырмайды Ол табаныңды, Ұйықтамайды Қорғаушың,"},
	{4, "4 Исраилді Қолдап-қорғаушы Қалғымайды да ұйықтамайды."},
	{5, "5 Қорғаушың — Жаратқан Ие, Қасыңда Ол саяң болып жүреді,"},
	{6, "6 Күндіз күннің, түнде айдың Тимесін деп сәулелері."},
	{7, "7 Жамандықтың барлығынан Жаратқан Ие сені сақтайды, Жаныңды Ол қорғап-қолдайды."},
	{8, "8 Бүгіннен бастап мәңгі бақи Иеміз қорғайтын болады Барып-келу сапарыңды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view121() {
struct kk121 poems[] = {
	{1, "1 (Киелі үйге қарай өрлеп бара жатқанда айтылатын Дәуіттің жыры.) Барайық киелі үйіне Жаратқанның! Дегенді естіп қатты қуандым."},
	{2, "2 Уа, Иерусалим, аяғымыз біздің Қақпаларыңның алдында тұр сенің."},
	{3, "3 Қабырғалары кірігіп бір тұтасқан Қала болып Иерусалим салынған."},
	{4, "4 Осында өрлеп келіп тұрады Жаратқанға сиынатын рулары, Исраилге Ол мынаны заң етіп тапсырды: Жаратқан Иенің есімін мұнда даңқтауды."},
	{5, "5 Қалада тұр билердің орындықтары, Дәуіттің әулетінің патшалық тақтары."},
	{6, "6 Амандық тілеңдер Иерусалим үшін: Қаланы сүйетіндер өркендесін,"},
	{7, "7 Қамалыңның ішінде амандық болсын, Сарайларыңда тыныштық орнасын!"},
	{8, "8 Тума-туыс, дос-жарандарым үшін Қалаға аман-есендік тілеймін."},
	{9, "9 Құдай Иеміздің киелі үйі үшін Иерусалимге зор игілік тілеймін."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view122() {
struct kk122 poems[] = {
	{1, "1 (Киелі үйге қарай өрлеп бара жатқанда айтылатын жыр.) Назарымды Өзіңе аударамын, Уа, көкті мекендеуші Құдайым!"},
	{2, "2 Құлдың көзі қожайынының қолынан, Күңінің көзі ханымының қолынан Таймайтындай, біз де Иеміз Құдайдан Көз алмаймыз рақым көргенше Одан."},
	{3, "3 Рақым ете гөр, уа, Жаратқан Ие, Мейіріміңді түсіре гөр біздерге, Тойындық жұрттың бізді жек көргеніне,"},
	{4, "4 Жанымыз тойды менменнің қорлауына, Паңдардың бізді балағаттауына."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view123() {
struct kk123 poems[] = {
	{1, "1 (Киелі үйге қарай өрлеп бара жатқанда айтылатын Дәуіттің жыры.) Егер де Жаратқан жар болмағанда, — Деп Исраил мойындасын әр уақытта, —"},
	{2, "2 Егер де Жаратқан жар болмағанда, Адамдар бізге шабуыл жасағанда,"},
	{3, "3 Бізге қарсы қаһары жалындағанда, Олар бізді тірідей жұтар еді,"},
	{4, "4 Су ағымындай басып тастар еді, Тасқын судай бізді тұншықтырар еді,"},
	{5, "5 Буырқанған судай басып өтер еді."},
	{6, "6 Олардың тістеріне бізді қимаған Жаратқан Ие мадақталсын әрқашан!"},
	{7, "7 Аңшының торынан құтылған құстаймыз: Тор жыртылды, енді міне, біз азатпыз!"},
	{8, "8 Біз қолдау күтетін бірден-бір есіміміз — Көк пен жерді жаратқан Тәңір Иеміз!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view124() {
struct kk124 poems[] = {
	{1, "1 (Киелі үйге қарай өрлеп бара жатқанда айтылатын жыр.) Жаратқан Иеге сенім артқандар Сион тауындай шайқалмай мәңгі тұрар."},
	{2, "2 Таулар Иерусалимді жан-жақтан қоршайды, Жаратқан Ие өз халқын солай қоршайды, Қазір де, мәңгі де аман сақтап қорғайды."},
	{3, "3 Әділдер жамандыққа ұмтылмау үшін, Зұлымдардың оларға билігі шектелген."},
	{4, "4 Мейірімділер мен ақпейілділерге Игілік ете гөр, уа, Жаратқан Ие!"},
	{5, "5 Ал жүріп жатқандарды теріс жолдармен Иеміз бірге аластатсын заңсыздармен. Исраилге тыныштық бұйырта көрсін!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view125() {
struct kk125 poems[] = {
	{1, "1 (Киелі үйге қарай өрлеп бара жатқанда айтылатын жыр.) Жаратқан Ие тұтқындарды Сионға Қайтарып алып келген уақытында Ұқсадық түс көріп жатқан адамға,"},
	{2, "2 Езуіміз жиылмады күлкіден, Аузымыздан үзілмеді шаттық ән. Басқа ұлт адамдары өзара былай десті: Бұларға Жаратқан жасады керемет істі!"},
	{3, "3 Жаратқан бізге керемет жасады шынында, Сондықтан да біз кенелдік зор қуанышқа!"},
	{4, "4 Шөлдегі кеуіп қалған өзендерді Лезде-ақ суға толтыратының секілді, Уа, Жаратқан Ие, игіліктерімізді Біздерге қайтадан сыйлай гөр енді."},
	{5, "5 Көз жасын төгіп жүріп еккендер егінін Қуана әндетіп жинамақ өнімін:"},
	{6, "6 Олар еңіреп жүріп тұқымдарын Сеуіп тастайды егістік жерлеріне, Кейін құшақтап алып астық бауларын Қуана қайтады мекендеріне."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view126() {
struct kk126 poems[] = {
	{1, "1 (Киелі үйге қарай өрлеп бара жатқанда айтылатын Сүлейменнің жыры.) Егер Жаратқан үйдің құрылысын жарылқамаса, Құрылысшылардың еңбегі түгелдей зая. Егер Жаратқан Ие қаланы күзетпесе, Қарауылшылар босқа тұрады күзетте."},
	{2, "2 Бекерге ерте тұрып, кеш жатасыңдар, Нандарыңды көп бейнетпен табасыңдар. Ал Жаратқан Ие сүйікті адамдарына Бейқам тыныштық сыйлайды жандарына."},
	{3, "3 Балалар — игілік Жаратқан Иеден келген, Перзенттер — Оның сыйы рақыммен берген."},
	{4, "4 Адамның жас кезінде туған балалары Жебелері іспетті жауынгердің қолындағы,"},
	{5, "5 Қорамсақтарын солармен толтырған Кісілер қандай бақытты болған, Қарсыластарымен биге барғанда Қалмайтын болады олар масқараға."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view127() {
struct kk127 poems[] = {
	{1, "1 (Киелі үйге қарай өрлеп бара жатқанда айтылатын жыр.) Жаратқан Иені қастерлейтін, Оның жолдарымен жүретін Әрбір адам қандай бақытты!"},
	{2, "2 Еткен еңбегіңнің өнімін жейсің, Құдай сені жарылқап, өркендейсің."},
	{3, "3 Әйелің сенің үйіңнің ішіндегі Жемісті жүзім бұтасы секілді, Ал ұл балаларың дастарқан басындағы Зәйтүн ағашының өркендері сияқты."},
	{4, "4 Жаратқан Ие осылай жарылқайды Өзін терең қастерлеген жандарды."},
	{5, "5 Сион тауындағы киелі үйінен Жаратқан Ие сені жарылқай берсін. Өмір бойы Иерусалимнің амандығын"},
	{6, "6 Көресің һәм немерелеріңнің қызығын. Исраилге тыныштық бұйырта көрсін!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view128() {
struct kk128 poems[] = {
	{1, "1 (Киелі үйге қарай өрлеп бара жатқанда айтылатын жыр.) Жастайынан көріп келген қыспағы Жайлы айтып берсін Исраил халқы:"},
	{2, "2 Жастайымнан мол көрдім қыспақты, Алайда мені мүлдем жеңе алмады,"},
	{3, "3 Жон арқамда айдағандай соқаны Ұзынынан созылған атызы қалды."},
	{4, "4 Бірақ Жаратқан Ие әділетті, Сұмдар салған кісеннен азат етті."},
	{5, "5 Сионды жек көрген дұшпандарының Бәрі ұятқа қалып кері қайтсын,"},
	{6, "6 Өспей жатып бірден қурап қалатын Үй төбесіндегі шөпке олар ұқсасын:"},
	{7, "7 Орақшының қолы соған талмайды, Бау байлаушының құшағы да толмайды."},
	{8, "8 Жаратқан Ие сендерді жарылқасын, Бата береміз Жаратқанның атымен Деп қастарынан өткендер тілемесін!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view129() {
struct kk129 poems[] = {
	{1, "1 (Киелі үйге өрлеп бара жатқанда айтылатын жыр.) Ауыр жағдайымның тұңғиығынан, Уа, Жаратқан Ием, дауыстаймын Саған."},
	{2, "2 О, Тәңір Ием, даусымды тыңдай гөр, Мінажатыма менің құлақ түре гөр!"},
	{3, "3 Ием, Сен күнәларды есіңнен шығармасаң, Кім алдыңда тірі қалар, уа, Жаратқан?"},
	{4, "4 Бірақ Сен кешірім беруге әзірсің, Содан бәрі Сені қастерлей берсін!"},
	{5, "5 Шын жүректен Иеме сенім артамын, Берген сөзіне үмітімді артамын."},
	{6, "6 Күзетші күткендей таңның атуын, Қарауыл аңсағандай күннің шығуын, Жан-тәніммен Иемді күтіп сағынамын."},
	{7, "7 Уа, Исраил халқы, сенім арт Жаратқанға, Рақым мен құтқаратын күш шексіз Онда."},
	{8, "8 Бар күнәсінің құнын төлеп, Исраилді Құтқарып Жаратқан Ие азат етеді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view130() {
struct kk130 poems[] = {
	{1, "1 (Киелі үйге қарай өрлеп бара жатқанда айтылатын Дәуіттің жыры.) Уа, Жаратқан Ие, өркөкірек емеспін, Паңдана қарамайды көздерім менің, Не тым ұлы істермен шұғылданбаймын, Не шамам келмейтіндермен айналыспаймын,"},
	{2, "2 Қайта, ризамын, жан дүнием тыныштықта. Бейқам жүр сәби анасының қасында, Сол нәресте сықылды өз жаным да Тыныш жатыр бейқам болып бойымда."},
	{3, "3 О, Исраил халқы, бұдан былай мәңгіге Шын жүректен сеніңдер Жаратқан Иеге!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view131() {
struct kk131 poems[] = {
	{1, "1 (Киелі үйге қарай өрлеп бара жатқанда айтылатын жыр.) Уа, Жаратқан Ие, есіңе түсірші Қиындық молынан көрген Дәуітті."},
	{2, "2 Ол Жаратқан Иеге уәде етті, Жақыптың сиынатын құдіретті Құдайына былай деп ант берді: Мен кірмеймін үйімнің ішіне, Әрі жатпаймын төсегіме, Ұйқы бермеймін көздеріме, Мүлгітпеймін кірпіктерімді, Жақыптың сиынатын құдіретті Құдайы — Жаратқан Иеге тұрақты Мекен салып бермейінше."},
	{3, "6 Сандықтың Ефратада екенін естідік, Иғарым даласынан оны таптық."},
	{4, "7 Жүріңдер, тұрағына Оның кірейік, Табан тіренішінде мінажат етейік."},
	{5, "8 Уа, Жаратқан Ие, көтерілші, Тынығар киелі тұрағыңа кірші, Сандығыңмен бірге — құдіретіңнің белгісі."},
	{6, "9 Діни қызметкерлерің әділдік жамылсын, Өзіңе адалдар шаттана ән-жыр айтсын."},
	{7, "10 Қызметшің Дәуітті есіңе алсаңшы, Тағайындаған патшаңнан бас тартпашы."},
	{8, "11 Дәуітке былай деп ант берді Жаратқан, Шынайы сертін бұзбайды Ол ешқашан: Бір ұрпағыңды өзіңнен тараған Мен сенің тағыңа отырғызамын."},
	{9, "12 Келісімім мен ережелерімді Ұрпақтарың Өзімнен үйренеді. Егер соларды ұстанатын болса, Олардың ұрпақтары сенің тағыңда Әрқашан отыратын болады да."},
	{10, "13 Өйткені Жаратқан Ие Сионды таңдады, Оның жердегі тұрағы болуын қалады:"},
	{11, "14 Бұл — Менің тынығар мәңгілік тұрағым, Мен мұнда орнығамын, сол — Менің қалауым."},
	{12, "15 Бұл қаланы өркендетіп, жарылқаймын, Мұқтаждарын тамақпен қарық қыламын."},
	{13, "16 Діни қызметкерлерге құтқаруды мол сыйлаймын, Өзіме адалдар шаттана ән-жыр айтсын."},
	{14, "17 Мұнда Дәуіттің күшті ұрпағын шығарамын, Бұл патшамның өмір шырағын жандырамын,"},
	{15, "18 Басындағы тәжін жарқыратамын, Ал оның жауларын ұятқа қалдырамын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view132() {
struct kk132 poems[] = {
	{1, "1 (Киелі үйге қарай өрлеп бара жатқанда айтылатын Дәуіттің жыры.) Бауырлардың ынтымақта тұрғандары Қандай тамаша да жарасымды!"},
	{2, "2 (Һарон Құдайдың қызметіне арналғанда) Басына құйылған жұпар май іспетті, Ынтымақтастық та аса ізгілікті! Сол иісмай Һаронның басынан сақалына, Киімінің етегіне дейін аққан еді."},
	{3, "3 Сондай-ақ, ынтымақ арамыздағы — Хермон тауына түсетін шық тәрізді. Бұл шық Сион тауына да түседі, Жердің бәрін құнартып, көгертеді. Сонда Иеміз өз жарылқауы — шын өмірді Мәңгі бақи сыйлауға ұйғарған еді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view133() {
struct kk133 poems[] = {
	{1, "1 (Киелі үйге қарай өрлеп бара жатқанда айтылатын жыр.) Уа, Жаратқанның бар қызметшілері, Иемізді дәріптей беріңдер! Сендер Құдайдың киелі үйінде Түн кезінде қызмет көрсетесіңдер:"},
	{2, "2 Киелі орнына қарай қол жайып Иемізді мадақтай беріңдер!"},
	{3, "3 Көк пен жерді жаратқан Тәңір Иеміз саған Лайым төксін батасын Сиондағы орнынан!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view134() {
struct kk134 poems[] = {
	{1, "1 Жаратқан Иені мадақтаңдар! Жаратқан Иенің атын дәріптеңдер, Өз қызметкерлері, Оны қастерлеңдер,"},
	{2, "2 Құдайымыздың ғибадатханасында, Оның киелі үйінің аулаларында!"},
	{3, "3 Жаратқан Ие ізгі, Оны мадақтаңдар, Бұл ұнамды, Оның атын әнмен даңқтаңдар!"},
	{4, "4 Өйткені Жаратқан Жақыптың әулетін таңдады, Исраилді Өзінің меншігіне тағайындады."},
	{5, "5 Мынаны ұқтым: Жаратқан ерен ұлы, Иеміз бар тәңір, пір атаулыдан жоғары!"},
	{6, "6 Жаратқан Өзіне ұнамдысын жасайды да Көк пен жерде, теңіз бен тұңғиықта."},
	{7, "7 Ол көкжиектен бұлттарды көтереді, Нөсер мен найзағайды жібереді, Қоймасынан желді айдап әкеледі."},
	{8, "8 Ол жойғызды Мысырдың тұңғыштарын, Адамның да, малдың да тұңғыштарын,"},
	{9, "9 Перғауын мен құлдарына қарсы Тәңір Ғажаптар көрсетті өз араңда, уа, Мысыр."},
	{10, "10 Кейін көп халықтарды жеңіп шықты, Күшті патшалардың көздерін құртты:"},
	{11, "11 Аморлықтардың патшасы Сиғонды, Сондай-ақ Башанның патшасы Оқты, Қанаханның бар патшасын да құртты."},
	{12, "12 Олардың жерлерін мұра секілді Өз халқы Исраилге меншікке берді."},
	{13, "13 Атың Сенің мәңгілік, уа, Жаратқан Ие, Сен боласың бар ұрпақтың есінде."},
	{14, "14 Жаратқан Ие өз халқын ақтайтын болады, Әрі қызметшілеріне рақым танытады."},
	{15, "15 Өзге ұлттардың пұттары күміс, алтыннан, Адамдардың қолдарымен жасалған."},
	{16, "16 Пұттың аузы бар, бірақ сөйлей алмайды, Көздері бар, бірақ көре алмайды,"},
	{17, "17 Құлақтары бар, бірақ ести алмайды Және ауызынан дем де шықпайды."},
	{18, "18 Өлі пұтты жасаған пенде соған ұқсайды, Мүсінге сенген әркім де содан аумайды."},
	{19, "19 Уа, Исраилдің үрім-бұтағы, Мадақтаңдар Иеміз — Жаратушыны, Уа, Һаронның үрім-бұтағы, Мадақтаңдар Иеміз — Жаратушыны,"},
	{20, "20 Уа, Леуінің үрім-бұтағы, Мадақтаңдар Иеміз — Жаратушыны, Уа, қастерлейтіндер Оны, Мадақтаңдар Иеміз — Жаратушыны,"},
	{21, "21 Сионнан мадақтаңдар Жаратқанды, Уа, Иерусалим, Оның жердегі тұрағы! Лайым мадақтаңдар Жаратқан Иені!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view135() {
struct kk135 poems[] = {
	{1, "1 Жаратқан Ие ізгі, Оны мадақтаңдар, Рақымы Оның мәңгіге ұласады,"},
	{2, "2 Тәңірлерден жоғары Құдайды мақтаңдар, Рақымы Оның мәңгіге ұласады,"},
	{3, "3 Иелердің Иесін мадақтаңдар, Рақымы Оның мәңгіге ұласады!"},
	{4, "4 Жалғыз Өзі ұлы кереметтер жасайды, Рақымы Оның мәңгіге ұласады,"},
	{5, "5 Ол көкті даналықпен жаратты, Рақымы Оның мәңгіге ұласады,"},
	{6, "6 Жер бетін теңіз суынан жоғары орнатты, Рақымы Оның мәңгіге ұласады,"},
	{7, "7 Аспанда үлкен шырақтар жаратты, Рақымы Оның мәңгіге ұласады,"},
	{8, "8 Күндізді билейтін күнді жаратты, Рақымы Оның мәңгіге ұласады,"},
	{9, "9 Түнді билейтін ай мен жұлдыздарды жаратты, Рақымы Оның мәңгіге ұласады!"},
	{10, "10 Ол Мысырды жазалап тұңғыштарын құртты, Рақымы Оның мәңгіге ұласады,"},
	{11, "11 Сол елден Исраилді бастап алып шықты, Рақымы Оның мәңгіге ұласады,"},
	{12, "12 Мұны зор құдіретімен жүзеге асырды, Рақымы Оның мәңгіге ұласады,"},
	{13, "13 Қамысты теңізді қақ айырды, Рақымы Оның мәңгіге ұласады,"},
	{14, "14 Ортасымен Исраил халқын алып шықты, Рақымы Оның мәңгіге ұласады,"},
	{15, "15 Перғауын мен әскерін теңізге батырды, Рақымы Оның мәңгіге ұласады!"},
	{16, "16 Ол өз халқын иен даламен бастап жүрді, Рақымы Оның мәңгіге ұласады,"},
	{17, "17 Ұлы патшаларға соққы берді, Рақымы Оның мәңгіге ұласады,"},
	{18, "18 Күшті патшалардың көзін құртты, Рақымы Оның мәңгіге ұласады,"},
	{19, "19 Аморлықтар патшасы Сихонды жойды, Рақымы Оның мәңгіге ұласады,"},
	{20, "20 Әрі Башан патшасы Огты да жеңді, Рақымы Оның мәңгіге ұласады,"},
	{21, "21 Олардың жерлерін иелікке тапсырды, Рақымы Оның мәңгіге ұласады,"},
	{22, "22 Құлы Исраилге мұралыққа табыстады, Рақымы Оның мәңгіге ұласады!"},
	{23, "23 Нашар халімізде бізді назарында ұстады, Рақымы Оның мәңгіге ұласады,"},
	{24, "24 Жауларымыздың қолынан құтқарды, Рақымы Оның мәңгіге ұласады,"},
	{25, "25 Ол барлық жан иелерін тамақтандырады, Рақымы Оның мәңгіге ұласады,"},
	{26, "26 Көктегі Құдай Иені мадақтаңдар, Рақымы Оның мәңгіге ұласады!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view136() {
struct kk136 poems[] = {
	{1, "1 Бабылдың өзен жағаларында отырдық, Сионды еске алып біз зар жыладық."},
	{2, "2 Жетігенімізді іліп қойдық сонда Жағада өсіп тұрған қызыл талдарға."},
	{3, "3 Тұтқындағандар жыр айтуымызды талап етті, Азаптағандар бізден шаттық әнін күтті: Сионның ән-жырларын айтыңдар! деді."},
	{4, "4 Бөтен елде жүргенде қалайша біз Иеміздің ән-жырларын айта аламыз?"},
	{5, "5 О, Иерусалим, егер ұмытсам сені, Оң қолым, сен де ұмытқайсың мені!"},
	{6, "6 Иерусалимді есімде сақтамасам, Оны шаттығымның шыңы деп санамасам, Онда тілім көмейіме жабысып қалсын!"},
	{7, "7 Уа, Жаратқан Ием, есіңе түсірші Иерусалим жау қолына түскен күні Едомдықтардың не істегендерін: Қиратыңдар қаланы түбіне дейін! Қиратыңдар оны! деп өршіткендерін."},
	{8, "8 Уа, Бабыл қаласы, ойран салғышсың, Саған бізге істеген қастығыңның Есесін қайтарған жан бақытты болмақ,"},
	{9, "9 Ұстап алып балаларыңды өзіңнің, Тасқа ұрған адам бақытты болмақ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view137() {
struct kk137 poems[] = {
	{1, "1 (Дәуіттің жыры.) Шын жүректен, уа, Ием, Сені дәріптеймін, Періштелер алдында әндетемін."},
	{2, "2 Киелі үйіңе қарай иілемін, Берік рақымың мен адалдығың үшін Сенің атыңа шүкіршілік етемін, Өйткені дүниеде бар нәрселерден Атың мен сөзіңді жоғары қойдың Сен."},
	{3, "3 Мінажат еткенімде жауап бердің, Жігер беріп, жанымды берік еттің."},
	{4, "4 Уа, Ием, естігенде аузыңнан шыққан сөзіңді Жердің бар патшалары мадақтасын Өзіңді,"},
	{5, "5 Олар әнге салсын Жаратқанның жолдарын, Өйткені шексіз зор — ұлылығы Оның!"},
	{6, "6 Жаратқан Ие бәрінен де жоғары, Ал кішіпейілге Ол назар аударады, Тәкаппар адамды да алыстан ұғады."},
	{7, "7 Жүрсем де қақ ортасында қиын жағдайдың, Уа, Ием, жанымды аман сақтайсың, Кәрлі жауларыма қарсы қол жұмсайсың, Мені құдіретіңмен қолдап-қорғайсың."},
	{8, "8 Осыны істейді мен үшін Жаратқан, Рақымың, уа, Ием, ұласады әрқашан, Бас тартпа бізден, өз жаратылысыңнан."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view138() {
struct kk138 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің жыры.) Уа, Жаратқан Ие, мені сынап тексердің, Сен мені толығынан танып білесің:"},
	{2, "2 Отырғаным, тұрғаным да Саған аян, Ойларымды біліп, ұғасың алыстан."},
	{3, "3 Жүрейін не демалайын, көз алдыңдамын, Жолдарымның барлығы да Саған айқын."},
	{4, "4 Сөз шықпай тұрып-ақ менің аузымнан Оны толық білесің, уа, Жаратқан!"},
	{5, "5 Алды-артымнан жүресің мені қоршап Құдіретті қолыңды үстімде ұстап."},
	{6, "6 Біліміңді ұға алмаймын ешқашан, Ол қол жеткізбес биік те ғажап маған!"},
	{7, "7 Сенің Рухыңнан мен қайда қашпақпын? Көз алдыңнан қайда жасырынбақпын?"},
	{8, "8 Көкке көтерілсем, сол орындасың, Тұңғиыққа түссем де, Сен сондасың."},
	{9, "9 Таң шапағына қалықтап ұшсам да, Не теңіздің ар жағына қонсам да,"},
	{10, "10 Сол жерде де мені қолың жетелеп, Құдіретті қолың ұстайды демеп."},
	{11, "11 Мен: Қараңғылық мені тасаласын, Айналамдағы жарық түнекке айналсын!"},
	{12, "12 Десем де, түнек жасырмайды Сенен, Саған күндей нұрлы — түннің өзі де, Жарықтай айқын — түнек те көзіңе!"},
	{13, "13 Сен іш құрылысымды қалыптастырдың, Ана құрсағында мені жараттың."},
	{14, "14 Тамаша жаралдым, Сені мадақтаймын, Керемет ғажап — жасаған істерің, Мұны мен шын жүректен мойындаймын."},
	{15, "15 Мен ана құрсағында қалыптастым, Құпия жерде жатқанда жаратылдым, Сенен таса болмады сонда сүйектерім,"},
	{16, "16 Ұрық күйімде мені көзіңмен көрдің. Сен маған бұйырған күндердің бірі Әлі де тумас бұрын, солардың бәрі Кітабыңда жазулы тұрған еді."},
	{17, "17 Сенің ойларың маған тым жоғары, Уа, Құдай, қанша көп олардың саны!"},
	{18, "18 Санап шықсам барлық ойларыңды, Құм қиыршықтарынан көп болады! Бірақ оянған кезде әрдайым мен Бірге боламын әлі де Өзіңмен."},
	{19, "19 Уа, Құдай, зұлымдарды жазалай гөр, Аулақ кетіңдер менен, қанішерлер!"},
	{20, "20 Олар Сен жайлы арамдық айтады, Дұшпандарың атыңды құр қолданады."},
	{21, "21 Сені жек көріп, қарсы шыққан жауларың Қалай маған жексұрын, жиренішті болмасын?"},
	{22, "22 Жан-тәніммен жақтырмаймын соларды, Олар нағыз дұшпандарыма айналды."},
	{23, "23 Уа, Құдай, жүрегімнің түкпірлерін тексере гөр, Мені мазалаған ойларымды біле гөр,"},
	{24, "24 Қауіпті жолдамын ба, сынай көрсеңші, Мәңгілік өмір жолымен мені жүргізсеңші!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view139() {
struct kk139 poems[] = {
	{1, "1 (Ән-күйдің жетекшісіне арналған Дәуіттің жыры.)"},
	{2, "2 Уа, Жаратқан, зұлым адамнан құтқаршы, Зорлықшыл жандардан мені қорғашы,"},
	{3, "3 Ойларында олар сұм жоспар құрады, Күн сайын ұрыс-керіс туғызады."},
	{4, "4 Өткір тілдері жыландай шағады, Сұр жыланның уы тілдерінен тамады."},
	{5, "5 Уа, Жаратқан, зұлымның қолынан сақташы, Зорлықшыл жандардан мені қорғашы, Аяғымнан шалып олар құлатпақшы."},
	{6, "6 Паңдар маған жасырын тұзақ құрды, Торларының жіптерін кеңінен жайды, Олар жүрген жолыма қақпандар құрды. //"},
	{7, "7 Сен Құдайымсың, — дедім Жаратқанға, — Уа, Ием, құлақ түрші жалынған даусыма."},
	{8, "8 Жаратушы Тәңір Ием, мықты құтқарушымсың, Шайқас күні басымды дулығадай қорғадың."},
	{9, "9 О, Ием, зұлымға қалауын бермеші, Оның сұм ойларын табысты етпеші, Дұшпандарға көкіректерін көтертпеші. //"},
	{10, "10 Жауларым мені қоршауға алды жан-жақтан, Ал зұлымдықтары ауыздарынан шыққан Өз бастарына түсе берсін әрқашан!"},
	{11, "11 Көмір шоғындай оларға жаудырылсын, Отқа не батпақты шұңқырға лақтырылсын, Енді қайтып солардан шыға алмасын,"},
	{12, "12 Жалақор адамдар елде орнықпасын, Зорлықшылдарды апат қуып ұстасын."},
	{13, "13 Жаратқан жайлы білемін мына жайтты: Бейшараның хұқығын Ол сақтайды, Мұқтаждың мүддесін қолдап-қорғайды,"},
	{14, "14 Иә, әділдер атыңды мадақтайды, Адал жандар көз алдыңда жасайды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view140() {
struct kk140 poems[] = {
	{1, "1 (Дәуіттің жыры.) Уа, Ием, Сені шақырамын, асыға гөр, Жалбарынған даусыма құлақ сала гөр,"},
	{2, "2 Дұғам алдыңа жетсін жұпар тартудай, Саған қол жайғаным кешкі құрбандықтай."},
	{3, "3 Уа, Жаратқан Ие, тіліме күзет қоя гөр, Аузымның ашылуын бақылай гөр."},
	{4, "4 Жүрегім жамандыққа құмартпасын, Зұлымдардың істеріне қатыспайын, Олардың ләззаттарынан дәм татпайын."},
	{5, "5 Жазаласын мені әділетті жан, Бұл нағыз мейірімділік болмақ маған, Сөгіс берсін маған ізгілікті жан, Бұл иісмайдай болмақ басыма жаққан, Мен еш бас тартпаймын да сол жазадан, Ал сұмдардың ісіне қарсы сиынамын Саған."},
	{6, "6 Құздан төмен лақтырылған соң басшылары, Қалған жұрт сөзімді ұнатып қабыл алады."},
	{7, "7 Егінші соқа айдап, жер жыртады, Топырақ кесектерін қопарады, Ажал жетіп, солай сүйегіміз шашылады! (Деп сол зұлымдар уайыммен айтады.)"},
	{8, "8 Тек Өзіңе қарай бағытталған көздерім, Жалғыз Өзіңнен ғана көмек күтемін, Уа, менің Жаратушы Тәңір Ием, Өзіңсің паналайтын берік қорғаным, Залымдардың қолында қалмасын жаным."},
	{9, "9 Олардың құрған торынан мені қорғай гөр, Зұлымдардың тұзағынан лайым сақтай гөр,"},
	{10, "10 Арсыздар өз торларына өздері түссе екен, Ал мен содан құтылып кетейін аман-есен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view141() {
struct kk141 poems[] = {
	{1, "1 (Дәуіттің насихат жыры. Оның үңгірде жасырынған кезіне арналған мінажаты.) Жаратқан Иені дауыстап шақырдым, Қатты дауыспен Иеме жалындым."},
	{2, "2 Оның алдында тілегімді ақтардым, Қасіретімді Оған түгел аштым."},
	{3, "3 Рухым қажығанда Сен білесің жолымды, Ал маған байқатпай жауларым торлар құрды."},
	{4, "4 Көмек күтіп оң жағыма қараймын, Мені ойлаған ешкім жоқ деп байқаймын. Жер қалмады енді маған пана болар, Ешкімім жоқ жанымның қамын ойлар."},
	{5, "5 Саған былай деп дауыстап сиынамын: Уа, Жаратқан Ие, Сен менің баспанамсың, Бұ дүниеде маған жар тек Өзіңсің."},
	{6, "6 Зар жылаған даусыма құлақ салшы, Өйткені мен әлсіредім тым қатты, Қуғындаған дұшпандардан құтқаршы, Менікінен тым басым күш-қуаттары."},
	{7, "7 Тас түнектен алып шықшы жанымды, Мадақтауым үшін Сенің атыңды. Әділдер сонда қасыма жиналады, Себебі Маған көрсеттің Сен рақымыңды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view142() {
struct kk142 poems[] = {
	{1, "1 (Дәуіттің жыры.) Уа, Жаратқан Ием, дұғама құлақ салшы, Сенімдісің Сен, өтінішімді тыңдашы, Әділдігіңе сай маған жауап қатшы."},
	{2, "2 Тергеп соттай көрме мені, қызметшіңмін, Мінсіз жан болмайды алдыңда Сенің."},
	{3, "3 Дұшпаным өкшелеп қуғындайды, Жерге жығып жанымды таптайды, Мені көрде жатқан сүйектей етті, Түнекте тұруға мәжбүрледі."},
	{4, "4 Көңілім жабырқаңқы, рухым түсті, Қорқыныштан менің үрейім ұшты."},
	{5, "5 Ежелгі кереметтеріңнің барлығын Еске алып, ойланып-толғанамын, Қолыңның істерін ақылға саламын,"},
	{6, "6 Өзіңе қарай қолдарымды жаямын: Кепкен топырақ жаңбырды тілейді, Жан дүнием де Сені аңсап шөліркейді. //"},
	{7, "7 Тез құлақ түре гөр, жаным күйреді, Ием, кері бұрмашы менен бетіңді, Әйтпесе боламын көрге түскен секілді."},
	{8, "8 Таң ата маған естіртші мейіріміңді, Өйткені Өзіңе артамын сенімімді, Көрсетші Маған қай жолмен жүретінімді, Себебі Саған бағыштаймын өмірімді."},
	{9, "9 Уа, Жаратқан, жауларымнан құтқара гөр, Сені паналаймын, мені қорғай гөр,"},
	{10, "10 Өз еркіңді орындауға үйрете гөр. Өйткені сенім артқан Құдайымсың, Сенің игілікті Киелі Рухың Түзу жолмен мені жетелей көрсін."},
	{11, "11 О, Ием, ұлы атың үшін жанымды сақтай гөр, Әділдігің үшін қиындықтан құтқара гөр,"},
	{12, "12 Рақымыңа бола бар жауларымды жоя гөр, Қызметшіңмін, қанаушыларымды құрта гөр."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view143() {
struct kk143 poems[] = {
	{1, "1 (Дәуіттің жыры.) Даңқталсын құздай нық қорғаным — Жаратқан! Қолдарымды соғысқа Ол жаттықтырған, Саусақтарымды шайқасқа дайындаған."},
	{2, "2 Ол — рақымның қайнары әрі қамалым, Мықты мұнарам әрі құтқарушым, Қалқандай қорғаушым әрі баспанам, Халқымды Ол билігіме тапсырған."},
	{3, "3 Уа, Ием, Сен ескеретіндей адам сонша кім, Өзің қамқорлайтындай адам баласы кім?"},
	{4, "4 Алған деміне ғана ұқсайды адам, Өткен көлеңкедей күндері қысқарған."},
	{5, "5 Көкті қақ жарып, уа, Ием, төменге түсші, Түтін шықсын деп тауларға қол тигізші,"},
	{6, "6 Найзағай жарқылдатып, жауды шашыратшы, Жебелер атқылап оларды қиратшы,"},
	{7, "7 Қолыңды көктен созып мені құтқаршы, Топан судай мол жат жұрттан азат қылшы,"},
	{8, "8 Өтірікке лық толған өз ауыздары, Алдамшы да олардың берген анттары."},
	{9, "9 Уа, Құдай, Өзіңе жаңа ән саламын, Он ішекті жетігенмен күй тартамын."},
	{10, "10 Патшаларға Сен жеңісті сыйлайсың, Қызметшің Дәуітті аман сақтайсың."},
	{11, "11 Ажалды семсерден мені құтқаршы, Жат жұрттың қолынан азат қылшы, Өтірікке лық толған өз ауыздары, Алдамшы да олардың берген анттары."},
	{12, "12 Жастық шақтан өсіре гөр ұлдарымызды Жақсы өңделген дала дақылдары сықылды, Қыздарымыз болсын безендірген сарайдағы Әсемдеп өрнектелген бағана сияқты."},
	{13, "13 Қоймамыз лайым толы бола берсін Алуан түрімен азық-түліктің, Малдарымыз мың-мыңдап көбейсін, Жайылымда оң мыңдап молайсын,"},
	{14, "14 Өгіздеріміз ауыр жүктен арылмасын, Қамалдарымыз ешқашан жарылмасын, Ешбір жау бізді тұтқынға айдамасын, Көшеде зар жылаған дауыс шықпасын!"},
	{15, "15 Осындай тілектері іске асқан Әрбір халық қандай жарылқанған! Құдайы — Жаратқан Иеге сиынған Әрбір халық қандай жарылқанған!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view144() {
struct kk144 poems[] = {
	{1, "1 (Дәуіттің мадақтау жыры.) Уа, Құдайым, Патшасың, даңқыңды асырамын, Атыңды мәңгілік жоғарылатамын."},
	{2, "2 Күн сайын Сені дәріптейтін боламын, Атыңды мәңгілік құрмет тұтамын."},
	{3, "3 Жаратқан Ие ұлы, мадаққа лайықты, Ұлылығын ешкім жете ұғынбайды."},
	{4, "4 Ұрпақтан ұрпаққа жұрт істеріңді мақтайды, Құдіретті әрекеттеріңді жариялайды,"},
	{5, "5 Сенің керемет ұлы салтанатың Әрі ғажап істерің жайлы толғанамын."},
	{6, "6 Жұрт айтады айбарлы құдіретіңді, Мен де паш етемін ұлылығыңды,"},
	{7, "7 Бәрі ескереді зор ізгілігіңді, Ән-жырмен дәріптейді әділдігіңді."},
	{8, "8 Жаратқан мейірбанды да қайырымды, Тез қаһарланбайтын, өте мейірімді!"},
	{9, "9 Жаратқан Ие барлығына ізгілікті, Бүкіл жаратылысына кең пейілді."},
	{10, "10 Уа, Ием, бар істерің даңқыңды шығарсын, Адал адамдарың да Сені мадақтасын!"},
	{11, "11 Патшалығыңның даңқын олар асырады, Құдіретті істерің туралы айтады,"},
	{12, "12 Осылай адамзатқа құдіретіңді ұқтырсын Әрі Патшалығыңның даңқты ұлылығын."},
	{13, "13 Патшалығың Сенің мәңгілік болмақ, Ұрпақтан ұрпаққа билігің ұласпақ. Жаратқан бар сөздерін іске асырады, Оның күллі істері де шапағатты."},
	{14, "14 Сүрініп жатқандарды Жаратқан сүйейді, Еңкейіп жүргендерді көтеріп демейді."},
	{15, "15 Барлығының көздері бір Өзіңде, Тамақтарын бересің мезгілінде,"},
	{16, "16 Әр тірі жанға қолыңды ашасың, Мархабатпен барлығын тойындырасың."},
	{17, "17 Жаратқанның бар жолдары әділетті, Иә, Оның күллі істері игілікті:"},
	{18, "18 Иеміз Өзіне сиынғандардың жанында, Ол шынайы шақырғандардың қасында,"},
	{19, "19 Өзін қастерлейтіннің тілегін орындайды, Жалынышын естіп, оны аман сақтайды."},
	{20, "20 Иеміз Өзін сүйетіндердің бәрін қорғайды, Ал барлық зұлымдарды Ол талқандайды."},
	{21, "21 Аузыммен Жаратқанның даңқын асырамын, Лайым әрбір жан мақтасын киелі атын!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view145() {
struct kk145 poems[] = {
	{1, "1 Жаратқан Иені мадақтаңдар әрдайым! Мен жан-тәніммен Иемді мадақтаймын,"},
	{2, "2 Тірі жүргенімде Жаратқанды даңқтаймын, Өмір бақи Құдайыма ән-жырымды арнаймын."},
	{3, "3 Әміршілерге үміттеріңді артпаңдар, Өткінші пендені сүйеніш қылмаңдар, Пәледен құтқара алмайды олар:"},
	{4, "4 Демі бітіп, жерге қайта оралады, Сол күні-ақ ой-ниеті ада болады."},
	{5, "5 Жақып сиынған Құдай жар болған Және Құдай Иесіне үміт артқан Қандай бақытты болады әрбір жан!"},
	{6, "6 Көк пен жерді, теңізді әрі олардағы Бардың бәрін де Иеміз жаратты, Ол мәңгі бақи сөзінде тұрады."},
	{7, "7 Қаналғандарды Ол әділдікке жеткізеді, Ашығып жүргендерге тамақ береді. Жаратқан Ие тұтқындарды босатады,"},
	{8, "8 Иеміз зағиптардың көзін ашады. Жаратқан бүкірлерді түзу етеді, Иеміз әділдерді жақсы көреді."},
	{9, "9 Жат жұрттықтың мүддесін Жаратқан қорғайды, Жетім-жесірлерді де қолдап-қоштайды, Ал зұлымдардың ой-ниетін талқандайды."},
	{10, "10 Жаратқан Ие мәңгі билік жүргізеді! Уа, Сион, сиынған Құдайың патшалық Құрады ұрпақтан ұрпаққа мәңгілік. Лайым мадақтаңдар Жаратқан Иені!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view146() {
struct kk146 poems[] = {
	{1, "1 Лайым мадақтаңдар Жаратқан Иені! Құдайымызды ән-жырмен мадақтау игі, Бұл қандай ұнамды да жарасымды!"},
	{2, "2 Иеміз Иерусалимді қайта салар, Исраилдің айдалғандарын қайтарар,"},
	{3, "3 Жаралы жүректерді сауықтырар, Қайғы-қасіреттерін Ол жұбатар."},
	{4, "4 Иеміз жұлдыздардың санын белгілеген, Ол барлығына да өз аттарын берген."},
	{5, "5 Жаратқан Ие ұлы әрі тым қуатты, Шексіз мол Оның ақыл-парасаты."},
	{6, "6 Иеміз қорланған жанды жоғарылатады, Ал зұлымдарды Ол жерге құлатады."},
	{7, "7 Жаратқан Иеге шүкірлік әнін айтыңдар, Құдайымызға жетігенмен күй тартыңдар!"},
	{8, "8 Жаратқан аспанды бұлттармен жабады, Жер бетіне жаңбырды жаудырады, Тау-төбені көк шөппен жамылдырады."},
	{9, "9 Осылай азық өсіреді мал мен аңдарға, Қарғаның шақырған балапандарына да."},
	{10, "10 Тұлпардың күшіне Жаратқан қарамайды, Жігіттің жүйріктігінен рақат таппайды,"},
	{11, "11 Қайта, риза болады Жаратқан Ие Өзін қастерлеп, рақымына үміт еткенге."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view147() {
struct kk147 poems[] = {
	{1, "1 Уа, Иерусалим, Жаратқанды мадақта, Уа, Сион, Құдайыңның даңқын асыра!"},
	{2, "2 Қақпа ысырмаларыңды Ол нығайтқан, Ішіңдегі халқыңды жарылқаған,"},
	{3, "3 Таңдаулы астықпен оны тойындырады, Шекараңа бейбітшілік орнатады."},
	{4, "4 Иеміз сөзін жер бетіне жолдайды, Оның айтқандары лезде тарайды."},
	{5, "5 Жаратқан қарды мамықтай жаяды, Қырауды да күлдей жерге шашады,"},
	{6, "6 Бұршақты жұмыр тастай жаудырады, Кім Оның аязына шыдай алады?"},
	{7, "7 Кейін Ол бұйрығымен ерітеді мұзды, Жылы жел соққызып, ағызады суды."},
	{8, "8 Иеміз Жақыпқа білдірді бұйрықтарын, Исраилге заңдары мен жарлықтарын,"},
	{9, "9 Басқа ешбір халыққа Ол мұны істемеді, Олар Оның шешімдерін білмей келеді. Лайым мадақтаңдар Жаратқан Иені!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view148() {
struct kk148 poems[] = {
	{1, "1 Лайым Жаратқан Иені мадақтаңдар! Жаратқан Иені көктен мақтаңдар, Заңғар аспанда Оны даңқтаңдар,"},
	{2, "2 Мадақтаңдар Оны, бар періштелер, Мадақтаңдар Оны бәрің, көктегілер, Оған бағышталған нөкерлері, сендер!"},
	{3, "3 Мадақтаңдар Иемізді, күн мен ай да, Барлық жарқылдаған жұлдыздар да,"},
	{4, "4 Мадақта Оны лайым, аспан заңғар, Мадақтаңдар Оны, бұлттан жоғары сулар!"},
	{5, "5 Жаратқанның атын дәріптесін барлығы, Ол бұйрық бергенде әлем жаратылды,"},
	{6, "6 Мәңгілікке берік орнатты Ол соларды, Әрдайым сақталады берген жарлықтары."},
	{7, "7 Мадақтаңдар Жаратқанды, жердегілер, Алып балықтар мен түпсіз теңіздер,"},
	{8, "8 Найзағай мен бұршақ, қар және тұман, Дауыл да Оның бұйрығына бағынған,"},
	{9, "9 Мақтаңдар Оны, бар төбелер мен таулар, Жеміс ағаштары мен күллі самырсындар,"},
	{10, "10 Алуан түрлі аңдар және малдар, Құстар әрі бауырымен жорғалаушылар!"},
	{11, "11 Әлемнің патшалары мен бүкіл халықтар, Жердегі әміршілер және барлық соттар,"},
	{12, "12 Мадақтаңдар Оны, жігіттер мен қыздар, Қарттармен қатар сендер де, балалар!"},
	{13, "13 Мадақтасын бәрі де Жаратқанның атын, Тек Ол ғана жоғары барлығынан, Даңқы Оның жер мен аспаннан асқан."},
	{14, "14 Ол Өзінің халқына күш-қуат дарытты, Бар адал жандарға мақтау әнін айтқызды, Исраил ұрпақтарының даңқын асырды, Осы халық Өзімен тығыз байланысты. Лайым мадақтаңдар Жаратқан Иені!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view149() {
struct kk149 poems[] = {
	{1, "1 Лайым Жаратқан Иені мадақтаңдар! Жаратқан Иеге жаңа ән-жыр салыңдар, Сенушілер қауымында Оны мадақтаңдар!"},
	{2, "2 Шаттан, Исраил, өзіңді Жаратқанға, Сион халқы қуансын Патшасына,"},
	{3, "3 Би билеп мадақтасын Оның атын, Дауылпаз, жетігенмен ән шырқасын!"},
	{4, "4 Жаратқан өз халқынан рақат табады, Кішіпейілдерді даңқтап, құтқарады."},
	{5, "5 Адал жандар бұл құрметке шаттансын, Төсекте жатып та қуана ән салсын,"},
	{6, "6 Аузында Құдайды мақтайтын ән болсын, Қолдарына екі жүзді семсер ұстасын,"},
	{7, "7 Бас көтерген ұлттарды соттау үшін, Қыңыр халықтарды жазалау үшін,"},
	{8, "8 Олардың патшаларын кісендеу үшін, Төрелерін темірмен шынжырлау үшін,"},
	{9, "9 Жазылған үкімдерін орындау үшін. Бұл — құрмет Оған бағышталғандар үшін. Жаратқан Иені мадақтаңдар әрдайым!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view150() {
struct kk150 poems[] = {
	{1, "1 Мадақтаңдар Құдайды киелі үйінде, Мадақтаңдар Құдіреттіні көкте де!"},
	{2, "2 Мадақтаңдар Оны керемет істері үшін, Мадақтаңдар Оны зор ұлылығымен!"},
	{3, "3 Мадақтаңдар Оны үніменен кернейдің, Мадақтаңдар Оны жетігенмен, домбырамен!"},
	{4, "4 Мадақтаңдар Оны даңғырамен, билеріңмен, Мадақтаңдар Оны қобызбен, сыбызғымен!"},
	{5, "5 Мадақтаңдар Оны сылдырмақтың сыңғырымен, Мадақтаңдар Оны дауылпаздың даңғырымен!"},
	{6, "6 Жаны барлар түгелдей мадақтасын Иемізді! Лайым мадақтаңдар Жаратқан Иені!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};