#include <map>
#include <string>
class Bible21
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
	struct kk7	{ int val; const char *msg; };
	struct kk8	{ int val; const char *msg; };
	struct kk9	{ int val; const char *msg; };
	struct kk10	{ int val; const char *msg; };
	struct kk11	{ int val; const char *msg; };
	struct kk12	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Мұнда Иерусалимде патша әрі даналықты уағыздаушы болған Дәуіт ұлының сөздері берілген."},
	{2, "2 Құр бекершілік! — деп үйрететін Даналықты уағыздаушы. — (Жеке өздігінен өмірдің) бәрі де құр бекер әрі мағынасыз!"},
	{3, "3 Пенденің осы өткінші дүниеде еткен бүкіл бейнетті еңбегінен көрер пайдасы қандай?"},
	{4, "4 Ұрпақтар бірінен соң бірі келіп-кетіп жатады, ал жер сол тұрған күйі тұра береді."},
	{5, "5 Күн шығады да батады, содан кейін ол шығатын жеріне қайтуға асығады."},
	{6, "6 Жел оңтүстікке қарай соғып, содан кері айналып, солтүстікке қарай соғады. Ол шыр айналып, бастапқы ізімен қайтып келе береді."},
	{7, "7 Бар өзендер теңізге құяды, бірақ теңіз содан толып кетпейді. Су өзендердің шыққан көздеріне қайта оралып, теңізге қарай аға береді."},
	{8, "8 Өмірде болатын жайттар адамды сөзбен айтып жеткізе алмастай қажытады. Көз көруден, құлақ естуден қанағат таппас."},
	{9, "9 Бұрын болған нәрсе кейін де болады, істелген іс тағы да істелінеді. Осы өткінші дүниеде түбегейлі жаңа еш нәрсе жоқ."},
	{10, "10 Жұрт бір нәрсе туралы: Анаған қара, мұндай бұрын-соңды болып көрмеген еді ғой! — десе де, шынында ол — бізден бұрынғы дәуірлерде болып кеткен жайт."},
	{11, "11 Ежелде өтіп кеткендер ескерілмес, болашақтағыларды солардан кейін дүниеге келетіндер де естерінде ұстамас."},
	{12, "12 Даналықты уағыздаушы, мен, Иерусалим қаласында Исраилге патшалық құрдым."},
	{13, "13 Мен өзімді шын жүректен осы дүниеде болып жатқан нәрселерді зерттеп ұғынып, ақыл-парасатпен сынап ашуға арнадым. Құдайдың адам баласына артқан жүгі қандай ауыр!"},
	{14, "14 Осы өткінші дүниеде істеліп жатқан істердің бәріне назар аудардым: олардың барлығы да жел соңынан қуғандай бекершілік екен!"},
	{15, "15 Бұрмаланғанды түзетуге болмайды, жоқ болып кеткенді бар деп те есептеуге болмайды."},
	{16, "16 Мен іштей: Өзімнен бұрын Иерусалимге билік жүргізгендерге қарағанда мен ұлырақ болып, даналықты молайттым. Ақыл-парасат пен білімді молынан үйреніп алдым, — деп ойлайтынмын."},
	{17, "17 Сондықтан мен даналық пен білім әрі топастық пен ақымақтық туралы мүмкіндігінше көбірек біліп алуға көңіл бөлдім. Бірақ бұның да жел соңынан қуғандай бекершілік екенін ұғындым."},
	{18, "18 Өйткені адам көбірек түсінген сайын түңіле түседі, көбірек білген сайын күйіне түседі."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Мен іштей: Ал енді, рақаттана шаттанып, жақсы нәрселерді тексеріп көрейінші! — деп ойладым. Бірақ бұл да бекершілік екен."},
	{2, "2 Себебі ойнап-күлуді ақылсыз іс деп таптым, әрі рақатқа берілу жайлы: Бұл не нәрсеге қол жеткізеді? — дедім."},
	{3, "3 Содан ойға шомдым да, шарап ішіп көңіл көтерейін деп шештім. Санам мені әлі де парасатпен жетелесе де, ақымақтыққа берілдім. Осылайша адамға осы өткінші дүниедегі қысқа ғұмырында ең тиімдісі не екенін біліп алуға тырыстым."},
	{4, "4 Мен үлкен істерге де кірістім: өзіме арнап сарайлар салып, жүзімдіктер отырғыздым."},
	{5, "5 Өзім үшін бау-бақшалар да дайындап, оларға түрлі жеміс ағаштарын ектім."},
	{6, "6 Тоғайларымда өсіп тұрған ағаштарымды суғару үшін тоғандар жасадым."},
	{7, "7 Сатып алған малайларымнан басқа, өз сарайымда туылған құл-күңдерім де болды. Ірілі-ұсақты малдарымның көп болғаны сонша, бұрын-соңды Иерусалимдегі патшалардың бірде-біреуінде соншама мал болып көрген емес."},
	{8, "8 Мен алтын-күміс жиып, патшалар мен аймақтардың қазыналарын молынан иемдендім. Қасыма әнші-күйшілер мен түрлі күй аспаптарын жинап алдым. Сөйтіп адам баласының рақатына бөлендім."},
	{9, "9 Осылай мен ұлылыққа ие болып, бұрынырақ Иерусалимде патшалық құрғандардың барлығынан асып түстім. Соның бәрінде де ақыл-парасатымнан айырылмадым."},
	{10, "10 Көзім түсіп, ұнатқанның ешқайсысынан бас тартқан жоқпын. Ешқандай көңіл көтеруден де шет қалған емеспін. Бірақ та жан дүниемнің басты қуанышы атқарған еңбегім болды. Ал еңбегімнің қызығы сол еңбектің өзі ғана еді."},
	{11, "11 Қолға алған жұмыстарыма әрі атқарған бейнетті еңбегіме назар аударғанда олардың да жел соңынан қуғандай бекершілік екенін, сондай-ақ, осы өткінші дүниеде шынайы табысқа жетуге болмайтынын байқадым."},
	{12, "12 Содан мен даналық жайында әрі топастық пен ақымақтық туралы ойлай бастадым. Өйткені келешек патшалар осы мәселе жөнінде бұрын істелгендерден басқа не істер екен?"},
	{13, "13 Жарық нұр қара түнектен қалай артық болса, даналықтың да ақымақтықтан солай артық екеніне көз жеткіздім."},
	{14, "14 Дананың көзі өз орнында, ал ақымақ қара түнекте сипаланып жүреді. Бірақ соңында екеуі де бірдей тағдырға ұшырайтын болады."},
	{15, "15 Мен іштей: Ақымақтың басына түсетіні маған да тиесілі болса, онда соншама дана болып не бар? — деп, бұны да бекершілік деп қорыттым."},
	{16, "16 Ақымақ сияқты, дана жан да жұрт есінде ұзаққа қалмайды. Болашақ күндерде бәрі де ұмытылады. Ақымақ сияқты, дана жан да өлуге тиіс."},
	{17, "17 Содан мен осы өткінші дүниеде болып жатқан істерге наразыланып, өмірді жек көріп кеттім. Себебі бәрі де жел соңынан қуғандай бекершілік екен."},
	{18, "18 Осы дүниеде атқарған ауыр еңбегімнің бар өнімін де жек көре бастадым, өйткені оны өзімнен кейінгі бір адамға қалдыруым қажет."},
	{19, "19 Ол дана бола ма, ақымақ бола ма, онысын кім біледі? Ол бәрібір менің ауыр еңбекпен әрі ақыл-парасатпен қол жеткізгендерімнің барлығына ие болады. Бұл да бекершілік!"},
	{20, "20 Сонымен осы өткінші дүниеде атқарған бүкіл бейнетті еңбегімнен көңілім қалып түңілдім."},
	{21, "21 Себебі бір адам ақыл-парасатпен, біліммен және шеберлікпен еңбек еткеннен кейін соның өнімін бұған еш еңбек сіңірмеген басқа біреуге қалдыруға тиіс болады. Бұл да бекершілік әрі жанға қатты бататын жайт."},
	{22, "22 Солай болғанда адам баласына осы өткінші дүниеде атқарған бейнетті еңбегінен және жан салған ұмтылысынан не пайда?"},
	{23, "23 Ол өмір бойы міндетін өтеп, азап пен мехнат шегіп жүреді, тіпті түнде де оның ақыл-санасы толықтай тынықпайды. Бұл да бекершілік."},
	{24, "24 Адам баласына ішіп-жеуден әрі атқарған еңбегінен рақат табудан артық ештеңе жоқ екен. Бұларды да Құдайдың бергеніне көзім жетті."},
	{25, "25 Себебі Құдай бермесе кім ішіп-жеп, қызық көре алады?"},
	{26, "26 Өзін риза ететін адамға Құдай даналық, білім және қуаныш сыйлайды. Ал теріс жолмен жүретін күнәкарға Ол байлық жинап, сақтап қою уайымын тапсырады. Бірақ күнәкар соларын Құдайды риза еткен адамға қалдырып кетуге мәжбүр болады. Мұндай өмір шынында жел соңынан қуғандай бекершілік."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Өз уақыты бар әр нәрсенің, Осы дүниеде істелінетін Әр істің мезгілі бар өзінің."},
	{2, "2 Өз уақыттары бар туудың әрі қайтыс болудың, Тұқым себудің әрі тамырымен жұлудың."},
	{3, "3 Өз мезгілдері бар өлтірудің әрі сауықтырудың, Бұзудың әрі қайта тұрғызудың."},
	{4, "4 Өз кезеңдері бар қайғырып жылаудың әрі күлудің, Жоқтау айтудың әрі би билеудің."},
	{5, "5 Өз мезгілдері бар тас лақтырудың әрі оларды жинаудың, Құшақтасудың әрі содан жалтарудың."},
	{6, "6 Өз кездері бар іздеп жүрудің әрі жоғалтудың, Сақтаудың әрі лақтырып тастаудың."},
	{7, "7 Өз уақыттары бар жыртудың әрі тігіп жөндеудің, Үндемеудің әрі сөйлеудің."},
	{8, "8 Өз кездері бар сүюдің әрі жек көрудің, Соғысудың әрі татуласудың."},
	{9, "9 Еңбек еткеннің өз бейнетінен көретін не пайдасы бар?"},
	{10, "10 Құдайдың адам баласына жүктеген міндеттеріне де назар аудардым."},
	{11, "11 Құдай әр нәрсені өз уақытына сай көрікті етіп жаратты. Ол адамның жан дүниесіне мәңгілікті сезетін түйсікті дарытты. Әйтсе де адамдар Құдайдың әуел бастан аяғына дейін не істегендерін түсіне алмайды."},
	{12, "12 Адам үшін шаттану мен жақсылық жасаудан артық ештеңенің жоқ екенін ұқтым."},
	{13, "13 Осылай әрбір адам ішіп-жеп, еткен еңбегінен қанағат тапсын. Бұл да Құдайдың берген сыйы."},
	{14, "14 Құдай не істесе, соның мәңгі болатынын, одан ештеңе алынып, оған ештеңе қосылмайтынын да ұқтым. Құдай бұны Өзін адамдар терең қастерлеу үшін солай етті."},
	{15, "15 Болып жатқан және болашақта болатын жайттар бұрын да болып кеткен. Ал Құдай өтіп кеткен солардың қайталануын қадағалайды."},
	{16, "16 Мен, сондай-ақ, осы өткінші дүниеде тағы мынаны да байқадым: Әділдік іске асуға тиіс орында — зұлымдық, әрі әділет орындалуға тиіс жерде сұмдық жүреді екен!"},
	{17, "17 Сонда мен іштей: Құдай әділді де, зұлымды да сотында тексеретін болады. Өйткені сол жайттардағы әрбір ой-ниеттің және әрбір істің сыналып тексерілетін уақыты бар, — дедім."},
	{18, "18 Мен тағы адам баласы туралы былай деп те ойладым: Құдай оның тәндік жағынан хайуан секілді екенін көрсету үшін оны сынақтан өткізеді."},
	{19, "19 Өйткені адам баласының да, хайуанның да ұшырайтын тағдыры бірдей: адамның өлетініндей, хайуан да өледі. Екеуінің де кеудесінде тіршілік лебі бар, осы жағынан адамның хайуаннан артықшылығы жоқ. Себебі олардың бәрі де өткінші."},
	{20, "20 Барлығының да барар жері біреу: бәрі де топырақтан жаратылған және қайтадан топыраққа айналады."},
	{21, "21 Адам баласының жанының көкке көтерілетінін, ал хайуанның жанының төменге, жер қойнына кететінін біледі?"},
	{22, "22 Сонымен еткен еңбегінен қанағат табу адам үшін ең жақсы нәрсе екеніне көзім жетті. Бұл оның үлесіне тиген. Өйткені кейінірек болатын жайттарды оған кім көрсете алады?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Мен қайтадан көз салып, осы өткінші дүниеде жасалған әр түрлі зорлық-зомбылықты көрдім. Жапа шеккен бейшаралар көз жастарын төгіп жыласа да, оларды жұбататын ешкім жоқ екен! Қанаушылары зор күш-қуатқа ие, ал қаналғандарға жаны ашып, қолдайтын ешкім де жоқ болды!"},
	{2, "2 Сондықтан мен өлгендердің жағдайы әлі де өмір сүріп жатқандарға қарағанда жақсырақ екен деп түйдім."},
	{3, "3 Ал мүлдем өмір сүрмегеннің жағдайы екеуінікінен де артық екен, өйткені ол осы дүниеде жасалып жатқан зұлым істерді еш көрген емес."},
	{4, "4 Сонымен қатар мен мына жайтқа көз жеткіздім: пенденің еңбек етіп жетістікке жетуінің барлығы да адамдар арасында көре алмаушылықты тудырады. Бұл да жел соңынан қуғандай бекершілік екен."},
	{5, "5 Ақымақ екі қолын қусырып, аштан өлер дейді."},
	{6, "6 Ал тыныштықпен алынған бір уыс дән жел соңынан қуғандай ауыр еңбекпен табылған екі уыстан артық."},
	{7, "7 Мен қайтадан көз салып, осы өткінші дүниедегі тағы мынадай бекершілікті байқадым:"},
	{8, "8 Кей адам жалғыз басты, не баласы, не ағайыны жоқ болса да, қолда барын қанағат етпей, байлығын молайту үшін тынбай ауыр еңбек ете береді. Ал кейін ол өзінен: Мен кім үшін ауыр еңбек етіп, өмірдің қызығынан ада қаламын? — деп сұрайды. Бұл да бекершілік әрі жанға бататын жайт."},
	{9, "9 Біреу болғаннан екеу болған жақсы. Себебі бірігіп жұмыс істессе, содан көретін пайдалары игі болады."},
	{10, "10 Біреуі құласа, жолдасы сүйеп, тұрғызады. Алайда құлағанда сүйеніш болатын ешкімі жоққа қандай қиын!"},
	{11, "11 Сондай-ақ, егер екеу болып жатса, түнде тоңбайды. Ал жалғыз адам қалай жылынады?"},
	{12, "12 Біреу жалғыз адамды жеңсе де, екі адам оған қарсы тұра алады. Үш қабат жіп оңай үзілмес."},
	{13, "13 Қарт болғанмен ақылсыз, әрі берген кеңесті тыңдамайтын патшадан гөрі, кедей де болса ақылды жас артық."},
	{14, "14 Оның тіпті түрмеден шығып, патшалық билікке ие болуы да, немесе сол патшалықта кедейлікте туған болуы да мүмкін."},
	{15, "15 Осы дүниенің барлық адамдарының патшаның орнын басайын деп жатқан жастың соңынан ілесіп жүргендерін көрдім."},
	{16, "16 Оның билік жүргізген халқы сансыз көп болды. Бірақ та кейінгі ұрпақ оған да риза болмады. Әрине, бұл да жел соңынан қуғандай бекершілік екен."},
	{17, "17 Құдайдың киелі үйіне барғанда абайлап жүр! Жақындап, Құдайдың айтқандарын құлақ түріп тыңдай бер! Бұл өздерінің жамандық істеп жүргендерін ұқпайтын ақымақтардың құрбандық шалғандарынан әлдеқайда жақсы."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Тілің сөйлеуге тез болмасын! Құдай алдында бір нәрсені айтуға тым асықпа! Құдай көкте, ал сен жердесің, сондықтан да сөзшең болма!"},
	{2, "2 Көп уайымдағанда адам түс көрер, Көп сөз айтылғанда ақымақ та сөз сөйлер."},
	{3, "3 Егер Құдайға уәде берген болсаң, оны орындауды кешеуілдетпе. Солай еткен ақымақтарға Ол риза болмайды. Нені уәде еткен болсаң, соны орында!"},
	{4, "4 Уәде беріп, оны орындамағаннан мүлдем уәде бермегенің жақсы."},
	{5, "5 Аузыңнан шыққан сөздерің сені күнәға батырмасын. Құдайдың хабаршысы — діни қызметкерге: Берген уәдем қате, — деп сылтауратпа! Неліктен сен Құдайдың ашуын шақырып, істеген істеріңді жойдырмақсың?"},
	{6, "6 Себебі көп түс көру де, көп сөз айту да құр бекершілік. Солардың орнына Құдайды терең қастерле!"},
	{7, "7 Егер бір аймақта кедейлердің езгіге ұшырап, әділдік пен құқықтан айырылып отырғанын көрсең, соған тым қатты таңданба. Өйткені бір әкімді одан да лауазымды басқа біреу қадағалап, солардан жоғары тағы басқалары да болады, (ал әділдік жиі ескерусіз қалады)."},
	{8, "8 Солардың бәрі жердің өнімінен тартып ала береді. Патшаның өзі де өңделген жердің пайдасын көреді."},
	{9, "9 Ақшақұмар ақшаға тоймас, байлыққұмар кірісіне қанағаттанбас. Бұл да бекершілік."},
	{10, "10 Адам байыған сайын, онысын жеп қоятындар да көбейер. Байлығының иесі онысына көз салудан басқа пайда көрмес."},
	{11, "11 Не аз, не көп жесін, өз еңбегімен күн көретіннің ұйқысы жайлы болар. Ал байдың мол байлығы өзін ұйқысынан айырар."},
	{12, "12 Мен осы өткінші дүниеде көрген, жанға бататын тағы бір жайт мынау: жинаған байлығы иесіне кейде тіпті зиян келтіреді."},
	{13, "13 Сол байлық бір апаттан құрып жоқ болар. Сонда ұлы дүниеге келгенде әкесінің оған қалдыратын ештеңесі болмайды."},
	{14, "14 Адам ана құрсағынан жалаңаш шығады, о дүниеге де дәл солай аттанады. Өзінің еңбек етіп тапқанынан ештеңені де қолымен ұстап алып кете алмайды."},
	{15, "15 Жанға қатты бататын тағы бір жайт мынау: адам дүниеге қалай келсе, дәл солай кетеді, ал еткен еңбегі желге ұшып кетті, енді оған не пайда?!"},
	{16, "16 Сондай пенде өмір бойы жабырқаңқы жүріп нанын жейді де, түңіліп, науқастанып, ашынып кетеді."},
	{17, "17 Адамға ең жақсысы мынау екеніне көзім жетті: оның ішіп-жеп, осы дүниеде өзіне Құдай сыйлаған бүкіл ғұмырында атқарған барша жұмыстарының игілігін көруі. Себебі оған тиісті үлес — осы."},
	{18, "18 Оның үстіне, Құдай бір адамға байлық-дәулет сыйласа және оған соның пайдасын көріп, өз үлесін алып, істеген жұмысынан рақат табуды бұйырса, бұл да Құдайдың берген сыйы."},
	{19, "19 Құдай сондай адамға күнделікті өмірінде қуаныш сыйлайды. Сөйтіп оның өтіп жатқан өмірі туралы ойланып, уайымдауға уақыты да қалмайды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 Осы өткінші дүниеде адамдардың арасында жиі кездесіп, жанға бататын тағы бір жайтты байқадым:"},
	{2, "2 Құдай біреуге байлық-дәулет, мал-мүлік, қадір-құрмет сыйлап, енді оның аңсайтын еш нәрсесі қалмайды. Алайда Құдай оған соның қызығын көруге мүмкіндік бермей, рақатын өзге біреу көреді. Бұл да ақылға сыймайтын әрі жанға қатты бататын жайт."},
	{3, "3 Егер бір адамның тіпті жүз баласы болып, өзі ұзақ ғұмыр кешсе, бірақ игілігінің қызығын көрмесе, тіпті дұрыстап жерленбесе, онда мен түсік одан гөрі бақытты дер едім."},
	{4, "4 Себебі түсік құрсақтан бекерге шығып, о дүниеге аттанды, ал оның есімін түнек жапқан."},
	{5, "5 Ол тіпті күн сәулесін ешқашан көрген де, білген де жоқ. Ал жаңағы бейшара адамға қарағанда түсіктің жағдайы жайлырақ."},
	{6, "6 Адам тіпті екі мың жыл жасап, өмірдің қызығын көре алмауы мүмкін. Әрі соңында бәрінің де баратын жері о дүние емес пе?"},
	{7, "7 Адамның еткен ауыр еңбегінің барлығы аузын тамаққа толтыруға арналған, бірақ оның жан дүниесі қанағаттанбайды."},
	{8, "8 Олай болса, дана жанның ақымақтан қандай артықшылығы бар? Басқа адамдардың алдында өзін дұрыс ұстауды білгенінен кішіпейіл адамға не пайда?"},
	{9, "9 Жаныңның өзіңде жоқ нәрсесін тентірей аңсағанынан гөрі көз алдыңда барыңмен қанағаттанған игі. Жай аңсай беру де жел соңынан қуғандай бекершілік."},
	{10, "10 Әлемде бар нәрсенің бәрі әлдеқашан-ақ шешілген. Адамның қандай болатыны да баяғыда-ақ белгіленіп қойылған. Пенде өзінен құдіретті Құдаймен (өз тағдыры туралы) таласа алмайды."},
	{11, "11 Көп сөз бекершілікті көбейтер. Бұдан адамға не пайда?"},
	{12, "12 Адам үшін өмірде ненің игі екенін кім біледі? Ол қысқа да мәнсіз күндерімен көлеңкедей сырғып өте шығады ғой. Өзінен кейін осы өткінші дүниеде не болатынын адамға кім білдіреді?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct kk7 poems[] = {
	{1, "1 Жақсы атақ қымбат иісмайдан артық, адамның өлген күні туған күнінен артық."},
	{2, "2 Жиын-тойға барғаннан азалы үйге барған артық. Өйткені өлім — барша адам баласын күтіп тұрған жайт. Тірілер мұны естерінде сақтап, соған лайықты өмір сүрсін!"},
	{3, "3 Қайғыру күлуден артық: жүзі мұңайғанның жан дүниесі жақсара түсер."},
	{4, "4 Дана жан азалы үйді ойлар, ақымақ шат-думанға салынар."},
	{5, "5 Ақымақтардың мақтау өлеңдерінен гөрі дананың сөгісін тыңдаған артық."},
	{6, "6 Өйткені ақымақтың қарқылдаған күлкісі қазан астында сытырлап жанған бұтақшалардай. Бұл да бекершілік."},
	{7, "7 Басқаға жәбір көрсетсе, дана адам ақымаққа айналар. Пара жүректі бүлдірер."},
	{8, "8 Істің соңы бастамасынан жақсы, сабырлы жан асқақтан жақсы."},
	{9, "9 Ашуға булығуға асықпа, ашу-ыза ақымақтың көкірегіне орнығар."},
	{10, "10 Неліктен өткен заман қазіргіден артық? деп шағымданба! Өйткені осындай сауал қойғаның даналық емес."},
	{11, "11 Даналық мұрадай игілікті, жарық дүниеде жүрген жанға сондай пайдалы."},
	{12, "12 Себебі ақшасы адамды қорғайтынындай, даналық та оны қорғар. Ал даналықтың бір артықшылығы: ол иесінің өмірін сақтап қалар."},
	{13, "13 Құдайдың ісіне назар аударшы: Ол бір нәрсені қисық қылып қойса, оны түзету кімнің қолынан келер?"},
	{14, "14 Аманшылық болған күндері соның қызығын көріп қуан! Ал қасіретке душар болғанда мынаны есіңе ал: сол екі жайтты да Құдай тағайындаған. Сондықтан адам кейін не болатынын алдын ала біле алмайды."},
	{15, "15 Мен бекершілікке толы өткен өмірімде мына жайттардың екеуін де көргенмін: кейде әділ адам жазықсыз бола тұра, ерте құрып кетеді, ал зұлымның әділетсіз өмірі ұзара түседі."},
	{16, "16 Сондықтан асыра қатаң болма, асыра дана да болғансыма! Өзіңді-өзің құртып нең бар?"},
	{17, "17 Зұлымдыққа да салынба, ақымақ та болма! Уақытың жетпей өліп нең бар?"},
	{18, "18 Алғашқы ескертуді ұстанып, екіншісінен мақұрым қалмағаның абзал. Өйткені Құдайды терең қастерлейтін адам бұл ескертулердің барлығын басшылыққа алады."},
	{19, "19 Өз даналығы данышпанды қаланың он басшысынан да күшті етер делінген."},
	{20, "20 Шындығында жер бетінде әрдайым жақсылық жасап, ешбір күнә жасамайтын әділ адам жоқ."},
	{21, "21 Сондықтан жұрттың айтатын сөздерінің бәріне бірдей көңіл бөле берме! Әйтпесе өз қызметшіңнің сені жамандағанын да естіп жүрерсің."},
	{22, "22 Ал өзіңнің де басқаларды көп рет жамандағаның есіңде ғой!"},
	{23, "23 Мен осының бәрін даналықпен сынап: Мұны ұғынып дана боламын! деп шешкен едім. Әйтсе де соған қол жеткізе алмадым."},
	{24, "24 Болмыстың шындығы тым алыс және өте терең екен! Кім оған жете алар?"},
	{25, "25 Мен даналықты және болмыстың себептерін біліп, зерттеп, терең ұғынуға шын жүректен бет бұрған едім. Зұлымдықтың нағыз ақылсыздық әрі топастықтың қандай ақымақтық екенін де жете білгім келді."},
	{26, "26 Сонымен қатар мен опасыз әйелдің өлімнен де ащы қасірет туғызатынын ұқтым. Оның жүрегі тұзақ пен тор, қолдары кісен іспетті. Құдайға ұнамды адам сондай әйелден сақ жүреді. Ал күнәкарлар оның торына түседі."},
	{27, "27 Біліп қойыңдар, — дейді Даналықты уағыздаушы, — мен әр түрлі нәрселерді басымнан өткізіп, түрлі жайттарды пайымдауға тырыстым."},
	{28, "28 Мен мына пікірді жан сала зерттесем де, (дұрыстығына) көз жеткізе алмадым: Мыңның арасынан бір ғана жібі түзу ер адамды таптым, ал бірде-бір әйелді тапқан жоқпын делінген."},
	{29, "29 Мен тек мынаған ғана көз жеткіздім: Құдай адам баласын әділ етіп жаратты, бірақ адамдар көптеген зұлым ой-ниеттеріне салынды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct kk8 poems[] = {
	{1, "1 Кім данышпан? Кім мәселелердің мән-мағынасын ұға білер еді? Даналық адамның өңін нұрландырар, оның сұсты жүзін жұмсартар делінген."},
	{2, "2 Менің тағы айтарым мынау: Құдай алдында берген антыңа бола патшаның айтқандарын сақтауың қажет."},
	{3, "3 Патшаның қасынан кетуге асықпа. Әділетсіз істі құптама! Өйткені патша қалағанының бәрін істей алар."},
	{4, "4 Патшаның сөзі күшті. Ендеше оған: Неге солай істейсіз?! деуге кімнің дәті барады?"},
	{5, "5 Құдайдың өсиетін сақтаған жан әділетсіз істі құптамас. Дана жан дұрыс уақыт пен тәртіпті білер."},
	{6, "6 Адамға өмірінің қиыншылықтары ауыр тисе де, әрбір істің өз уақыты мен тәртібі бар."},
	{7, "7 Ал пенде кейін не болатынын білмейді, әрі болашақтың қалай болатынын оған кім айта алар еді?"},
	{8, "8 Ешбір адамның желді ұстап тоқтата алмайтыны сияқты, ешкім де ажалға билік жүргізе алмайды. Соғыс кезінде әскерден босату дегеннің жоқ екеніндей, зұлымдық та өзіне бағынғандарды босата қоймайды."},
	{9, "9 Осы дүниеде болып жатқан әр түрлі істерді санаммен ұғынуға тырысқанда, мен адамдардың басқаларға билік жүргізіп, зор зиян келтіретін жайттарын көрдім."},
	{10, "10 Мұнан кейін мынаған көз салдым: Киелі орынға келіп-кетіп, қалада мақтау алып жүретін кейбір зұлымдар өлгенде құрметпен қабірге қойылды. Бұл да ақылға сыймайтын жайт."},
	{11, "11 Өйткені қылмыстың үкімі тез орындалмаса, адамның жан дүниесі зұлымдыққа батар."},
	{12, "12 Зұлым адам тіпті жүздеген қылмыс жасап, ұзақ өмір сүре берсе де, мен мынаны білемін: Құдайды терең қастерлеп, Оның көз алдында адал жүргендер игілікке кенелетін болады."},
	{13, "13 Ал зұлымның жағдайы жақсы бола бермес. Оның ғұмыры кешкі көлеңкедей ұзара бермей, қысқа болар. Себебі ол Құдайды терең қастерлеген жоқ."},
	{14, "14 Дүниеде тағы мынадай бір ақылға қонбайтын жайт та бар: зұлымдарға тиісті жазаны кейде әділ адамдар тартады, ал әділдерге тиісті сый-құрметке зұлымдар ие болады. Бұл шынымен ақылға сыймайды деймін."},
	{15, "15 Сондықтан мен адамға өмірдің қызығын көріп қалуға кеңес беремін, өйткені осы өткінші дүниеде пендеге ішіп-жеп, қуанышқа бөленуден артық ештеңе жоқ. Сөйтіп ол Құдайдың өзіне осы дүниеде өлшеп берген күндерінде ауыр еңбек еткенде қанағат табатын болады."},
	{16, "16 Осылай мен даналықты және адамның осы дүниеде атқаратын міндетін түсінуге жан салған едім, ал пенде күні-түні ұйқы көрмей әрекет етеді."},
	{17, "17 Сонда мен Құдайдың істерінің бәріне назар салып, мынадай қорытындыға келдім: Осы өткінші дүниеде болып жатқан жайттарды пенде толықтай ұғына алмас. Адам оны зерттеп білуге қаншама тырысса да, осы мақсатқа ешқашан жете алмайды. Кейбір ақылды адам мен оны түгелдей білемін деген пікір білдірсе де, шын мәнінде ол солай емес."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct kk9 poems[] = {
	{1, "1 Сонымен мен осының бәрі туралы ойланып-толғанып мына қорытындыға келдім: Әділдер мен даналар және олардың істері де Құдайдың қолында. Адам өзін алда не күтіп тұрғанын: сүйіспеншілік пе, әлде жек көрушілік пе, соны білмейді."},
	{2, "2 Бәрі де бірдей жайттарға тап болады екен: әділ мен зұлым, жақсы мен жаман, адал мен арам, құрбандық шалып ұсынатын әрі соны ұсынбайтын адамдар. Олар ізгі не күнәкар болсын, Құдайға уәде беретін не солай істеуден қорқатын болсын, барлығының тағдыры бірдей екен."},
	{3, "3 Ал барлығының да осы өткінші дүниеде бірдей тағдырға ұшырайтыны — жанға бататын жайт! Сондай-ақ, адам баласының жүрегі зұлымдыққа кенеліп, өмір жолында ақымақтық жасайды. Содан кейін ол о дүниеге аттанып, өлгендердің қатарына қосылады."},
	{4, "4 Өлі арыстаннан тірі ит артық дегендей, тірі жүргендер үшін әлі де үміт бар."},
	{5, "5 Тірілер өлерін біледі ғой, ал өлгендер ештеңе білмейді екен. Олар енді қайтып еңбектерінің сыйын көрмейді екен, оларды ешкім есіне де алмас."},
	{6, "6 Өлгендер кезінде сезінген сүйіспеншілік, жек көрушілік, қызғаныш баяғыда ғайып болған, олар бұ дүниеде болып жатқан істерге енді араласпайды."},
	{7, "7 Кәне, жүр, Құдай істеп жатқан істеріңді құптағандықтан наныңды қуана жеп, сусыныңды шаттана іш. Өйткені Құдай осы істеріңді құптайды."},
	{8, "8 Әрқашан ақшыл киім киіп, шашыңа иісмайды да аямай жақ!"},
	{9, "9 Құдай саған осы дүниеде берген қысқа ғұмырыңның барлық күндерінің қызығын сүйген жарыңмен бірге көр! Өйткені осы өткінші дүниеде сүрген өмірің мен еткен ауыр еңбегің үшін Құдайдың беретін рақаты осы болмақ."},
	{10, "10 Қандай істі қолға алсаң да, соны жан сала істе! Себебі о дүниеге аттанған соң, онда не жұмыс істеу, не ойлап жоспарлау, не білім мен ғылым деген атымен жоқ екен."},
	{11, "11 Мен осы өткінші дүниеге назар аударып, тағы мынаны көрдім: Жарыста жүйрік, шайқаста мықты жан әрдайым жеңе бермейді екен. Данада — тамақ, ақылдыда — байлық, шеберде — абырой әрқашан бола бермейді, солар барлық адамдардың үлесіне орайы келгенде кенеттен тиеді екен."},
	{12, "12 Әрине, басына қашан күн туатынын пенде білмейді ғой. Адам баласы ауға түскен балықтай, тұзаққа шырмалған құстай күтпеген жерден бақытсыздыққа ұшырайды."},
	{13, "13 Мен осы өткінші дүниеден даналықтың тағы мына мысалын да байқадым, ол маған маңызды болып көрінді:"},
	{14, "14 Бірде азғана тұрғыны бар бір қалашық болды. Соған қарсы бір ұлы патша аттанып келіп, оны қоршауға алып, зор бекіністер салды."},
	{15, "15 Ал сол қалада кедей де болса дана бір кісі тұрды. Әлгі адам қаланы өзінің даналығымен құтқарып қалды. Бірақ кейіннен ешкім де сол кедейді есіне алмады."},
	{16, "16 Сондықтан да мен: Даналық күш-қуаттан артық. Әйтсе де жұрт кедейдің даналығына көңіл бөліп, оның сөздеріне құлақ аса бермейді екен деген тұжырымға келдім."},
	{17, "17 Ақымақ әміршінің айқайынан гөрі, дананың байыппен айтқандарын тыңдаған тиімді."},
	{18, "18 Даналық соғыс қаруларынан қуатты болар, ал бір күнәкар көп игілікті құртар."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct kk10 poems[] = {
	{1, "1 Өлген шыбындар бір құты иісмайды сасытар, сол сияқты аз-кем ақымақтығы адамның даналығы мен абыройына зардап жасар."},
	{2, "2 Дананың жүрегі оң жолды, ақымақтың жүрегі теріс жолды таңдар."},
	{3, "3 Қай жолмен жүрмесін ақымаққа ақыл жетпес, ол өз топастығын әркімге аян етер."},
	{4, "4 Бастығыңның ашуы өзіңе қарсы лап етсе, орныңнан кетіп қалма! Кішіпейілділік зор қателерді жауып қояр."},
	{5, "5 Мен осы өткінші дүниеде ақылға сыймайтын тағы бір жайтты байқадым, билік иелері кейде мынадай қате жібереді:"},
	{6, "6 Олар ақымақтарды жоғары лауазымға көтереді, ал дәулеттілерді төменгі орындарға отырғызады."},
	{7, "7 Мен тіпті атқа мінген құлдарды, әрі құлдай жаяу жүрген билеушілерді көрдім."},
	{8, "8 Біреуге ор қазған қаскүнем соған өзі құлар, Егістік дуалын қиратқанды жылан шағар."},
	{9, "9 Адам тас қашап жатқанда, абайсызда жараланып қалар, Не ағаш жарып жатқанда өзін зақымдап алар."},
	{10, "10 Өтпейтін балтаны қайрамаса, ағаш жаруға күш көп кетер, Ал даналықтың пайдасы зор, ол түбінде табысқа жеткізер."},
	{11, "11 Жылан арбалмас бұрын шағып алса, Арбаушының қажеті не сонда?"},
	{12, "12 Дананың сөздері мейірім көрсетер, Ал ақымақ өз сөзінен зиян шегер,"},
	{13, "13 Оның айтқандарының басы топастық, әрі соңы болар жаман есуастық,"},
	{14, "14 Әйтсе де ол айтар сөздерін көбейтер. Ал болашақтағы жайттарды кім білер, Кейін не боларын адамға кім айтып берер?"},
	{15, "15 Ақылсыз жан жұмыс істесе, қажып қалар, Ол жолын да таппас қалаға апарар."},
	{16, "16 Уа, ел, патшаң бозбаладай тәжірибесіз болып, әміршілерің таң сәріден той тойласа, қасіретке қаласың-ау!"},
	{17, "17 Ал патшаң текті жерден шыққан, әміршілерің көңіл көтеру үшін емес, күш жинау үшін уақтылы тамақтанатын болса, уа, мұндай ел, бақыттысың!"},
	{18, "18 Жалқаудың үйінің төбесі опырылар, Еріншектің үйінен тамшы ағар."},
	{19, "19 Көңіл көтеруге қонақасы дайындар, Шарап адамның өмірін масайратар, Ақша осы екеуіне де жол ашар."},
	{20, "20 Патшаны іштей болса да жамандама, Байды төсекте жатып та балағаттама! Ұшқан құс даусыңды іліп әкетер, Айтқан сөзіңді қанатты жеткізер."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct kk11 poems[] = {
	{1, "1 Су бетіне тұқымыңды себе бер, Көп күннен кейін ол өзіңе қайтып келер."},
	{2, "2 Жеті не сегіз бөлікке бөл өзіңде барды, Білмейсің қандай пәлеге душар боларыңды."},
	{3, "3 Қою бұлттар қаптағанда жерге жаңбыр әкелер. Не күнгей, не теріскейге құлаған ағаш сол күйінде жата берер."},
	{4, "4 Желді уайымдаған тұқымын сеуіп тастамас, Бұлтты уайымдаған өнімін теріп жинамас."},
	{5, "5 Білмейсің не дауылдың қайдан соғарын, Не құрсақтағы баланың қалай қалыптасқанын, Сол сияқты ұқпайсың ғаламның барлығын Жаратқан Құдайдың жасаған ғажаптарын."},
	{6, "6 Таңертең тұқымыңды сеп, кешке де қол қусырып отырма! Өйткені қайсысының өнімді боларын, анаусы ма, мынаусы ма, әлде екеуі де бітік шыға ма, соны білмейсің."},
	{7, "7 Жарық ұнамды, күн сәулесін көре алу көз үшін сондай ғанибет!"},
	{8, "8 Адам көп жасаса, барлық күндеріне қуансын! Ал алдындағы түнекке толы күндерінің де көп болатынын есінен шығармасын. Келешектегінің бәрі де күңгірт."},
	{9, "9 Уа, жасөспірім, жас кезіңде көңіл көтер, сен нені қалап, өзіңе не ұнаса, соны істей бер. Әйтсе де бар істерің үшін Құдайға жауап беретініңді есіңнен шығарма!"},
	{10, "10 Сондықтан жан дүниеңнен ашу-ызаны, өміріңнен зұлымдықты аластат! Себебі балалық пен жастық шағың тез ғайып болмақ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct kk12 poems[] = {
	{1, "1 Жастық шағыңда Жаратушыңды есіңде берік ұста! Азапты күндерің жетіп, олардан рақат таппаймын дейтін жылдарың жақындамай тұрып, Жаратушыңды қастерлейтін бол!"},
	{2, "2 Сол кезде күн мен нұр, ай мен жұлдыздар көмескіленіп, жауыннан кейін де қою бұлттар сейілмей адамның көзі нашар көрер."},
	{3, "3 Сонда адамның үйді қорғайтын екі аяғы дірілдеп, мықты иықтары бүгілер. Оның тамақты диірмендей шайнайтын тістері аз болғандықтан жұмыстарын доғарар. Терезеден сыртқа қарайтын жанарлары буалдыр тартар."},
	{4, "4 Екі құлағы үйдің көшеге қараған есіктеріндей тас жабылып, астық тартып отырған қол диірменнің үнін құлағы әрең шалар. Адам таң сәріде шымшық шырылдағанда оянар, ал оның әндерін әзер естір."},
	{5, "5 Сол жаста адамдар құлап қалудан қорқып, жолдағы қауіп-қатерден жүрексінер. Шаштары гүлдеген бадам ағашындай әппақ болар. Салқын күндегі шегірткедей адам сүйретіліп зорға жүрер, әрі құштарлығы да қоздырылмас. Ақыр аяғында адам о дүниедегі мәңгілік мекеніне аттанар, ал көше оны жоқтаушыларға толар."},
	{6, "6 Сондықтан өмірдің күміс жібі әлі де үзілмей, алтын тостағаны сынбай, су құятын құмыра талқандалмай, құдықтағы су тартқыш қирап құлап түспей тұрғанда Жаратушыңды есіңде ұста!"},
	{7, "7 Себебі сол уақыт келгенде топырақтан жаратылған денеміз топыраққа қайта айналып, жанымыз өзін сыйлаған Құдайға кері қайтады."},
	{8, "8 Құр бекершілік! — деп үйрететін Даналықты уағыздаушы — (жеке өздігінен өмірдің) бәрі де бекершілік!"},
	{9, "9 Өзі кемеңгер болып қана қоймай, Даналықты уағыздаушы сонымен бірге халыққа тәлім беріп, көптеген нақыл сөздерді ой елегінен өткізіп бағалап, реттеп жазып қойып отырды."},
	{10, "10 Даналықты уағыздаушы бәрін де орынды сөздермен айтып жеткізуге ұмтылды және оның жазғандары шынайы әрі нағыз ақиқат."},
	{11, "11 Данышпандардың сөздері (мүйізді ірі қараны айдайтын) ұшты таяқ іспетті адамды іс-әрекетке жұмылдырады. Сол жиналған нақылдар қағылған шегедей дәл тиеді. Бұлардың бәрін берген — бір Бағушы."},
	{12, "12 Балам, мұның бәріне қоса тағы бір нәрседен де сақ бол: көптеген кітап жаза берудің шегі жоқ, әрі тым көп оқу денені шаршатады."},
	{13, "13 Ал енді, айтылғандардың барлығының қорытындысын тыңдайық: Құдайды терең қастерлеп, Оның өсиеттерін орында! Себебі бұл — әр адамның парызы."},
	{14, "14 Өйткені Құдай адамның әрбір ісіне, тіпті ешкімге білдірмей жасаған не жақсы, не жаман ісіне де Өзінің сотында әділ бағасын береді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};