#include <map>
#include <string>
class Bible14
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
	struct kk7	{ int val; const char *msg; };
	struct kk8	{ int val; const char *msg; };
	struct kk9	{ int val; const char *msg; };
	struct kk10	{ int val; const char *msg; };
	struct kk11	{ int val; const char *msg; };
	struct kk12	{ int val; const char *msg; };
	struct kk13	{ int val; const char *msg; };
	struct kk14	{ int val; const char *msg; };
	struct kk15	{ int val; const char *msg; };
	struct kk16	{ int val; const char *msg; };
	struct kk17	{ int val; const char *msg; };
	struct kk18	{ int val; const char *msg; };
	struct kk19	{ int val; const char *msg; };
	struct kk20	{ int val; const char *msg; };
	struct kk21	{ int val; const char *msg; };
	struct kk22	{ int val; const char *msg; };
	struct kk23	{ int val; const char *msg; };
	struct kk24	{ int val; const char *msg; };
	struct kk25	{ int val; const char *msg; };
	struct kk26	{ int val; const char *msg; };
	struct kk27	{ int val; const char *msg; };
	struct kk28	{ int val; const char *msg; };
	struct kk29	{ int val; const char *msg; };
	struct kk30	{ int val; const char *msg; };
	struct kk31	{ int val; const char *msg; };
	struct kk32	{ int val; const char *msg; };
	struct kk33	{ int val; const char *msg; };
	struct kk34	{ int val; const char *msg; };
	struct kk35	{ int val; const char *msg; };
	struct kk36	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Дәуіттің ұлы Сүлеймен өз патшалығында жағдайын берік орнатып алды. Құдай Иесі оған жар болып, мерейін айрықша жоғарылатты."},
	{2, "2 Бір күні Сүлеймен Исраилдің барлық мыңбасыларын, жүзбасыларын, төрешілерін және халықтың басқа да жетекшілері мен әулет басшыларының бәріне де жиналуға бұйрық берді."},
	{3, "3 Мұнан соң Сүлеймен бүкіл жамағатты ертіп Гибеон қаласының биіктеу жеріндегі ғибадат орнына қарай беттеді. Өйткені Жаратқан Иенің қызметшісі Мұса пайғамбардың иен далада жасатқан кездесу шатыры сол жерде тігілген болатын."},
	{4, "4 Дәуіт патша көзі тірісінде Иерусалимде бір киелі шатыр тұрғызып, дайындап қойып, осы орынға Кирият-Иғарымнан Құдайдың Келісім сандығын әкелген еді."},
	{5, "5 Ал Һұр немересі Ұри ұлы Беселиел қоладан жасаған құрбандық үстелі Жаратқан Иенің Гибеон қаласындағы кездесу шатырының алдында тұрды. Осы себепті Сүлеймен және жиналған жамағат Жаратқан Иенің еркін білу үшін сол жерге барды."},
	{6, "6 Сүлеймен кездесу шатырының алдындағы қоладан жасалған құрбандық үстелінің қасына көтеріліп, Жаратқан Иеге арнап мың бас малды құрбандыққа шалғызып, өртетті."},
	{7, "7 Сол түні Құдай Сүлейменге аян беріп: — Өзіңе не сыйлағанымды қаласаң, соны сұра, — деді."},
	{8, "8 Сүлеймен Құдайға былай деп жауап берді: — Сен әкем марқұмға зор рақымыңды көрсете отырып, маған оның орнын бастырып патшалық құрғыздың."},
	{9, "9 Уа, Құдай Ие, мені жер бетіндегі құм түйіршіктеріндей сансыз көп халықтың үстінен патша етіп қойдың. Енді әкеме берген уәдеңді орындап,"},
	{10, "10 маған осы халықтың лайықты басқарушысы болуға даналық пен білім сыйлай гөр. Онсыз Сенің осыншама көп халқыңа дұрыстап билік жүргізу ешкімнің де қолынан келмейтін іс. —"},
	{11, "11 Сонда Құдай Сүлейменге: — Жүрек қалауың осы болып, сен қазына-байлық пен атақ-даңқ және жауларыңның жеңіліп, құруы былай тұрсын, тіпті өзің үшін ұзақ өмір де сұраған жоқсың. Қайта, Мен сені патшасы етіп қойған халқыма билік жүргізуің үшін даналық пен білім сыйлауымды өтіндің."},
	{12, "12 Сол үшін Мен өзіңе даналық пен білім сыйлап отырмын. Соған қоса қазына-байлық пен атақ-даңқты да сыйлаймын. Сенде бар болатын мол қазына-байлық пен атақ-даңққа саған дейінгі ешбір патша ие болған емес, сенен кейін де ешбір патша ие болмайды, — деп уәде етті."},
	{13, "13 Сүлеймен кездесу шатыры орналасқан Гибеондағы биіктеу жерінен түсіп, Иерусалимге қайта оралғаннан кейін Исраилге патшалық құрды."},
	{14, "14 Сүлеймен соғыс күймелері мен аттарды жинап, жасақтады. Оның бір мың төрт жүз соғыс күймесі мен он екі мың жылқысы болды. Оларды соғыс күймелеріне дайындалған арнайы қалаларында және өзінің қасында астанасы Иерусалимде ұстады."},
	{15, "15 Патша Иерусалимде алтын мен күмісті тас сияқты үйреншікті нәрсе әрі шетелден әкелінетін қымбат самырсындарды өз елінің төменгі қыраттарында көптеп өсетін тұт ағаштары іспетті мол етті."},
	{16, "16 Сүлеймен жылқыларын Мысыр мен Қуадан алдыртты. Патшаның саудагерлері оларды белгілі бағаға Қуа елінен сатып алатын."},
	{17, "17 Саудагерлер әрбір күймені алты жүз мысқал, әрбір жылқыны жүз елу мысқал күміске Мысырдан сатып алып келетін. Олар сол тауарлардың бірқатарын күллі хеттік және арамалық патшаларға да жеткізіп, сатып отырды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Сол кезде Сүлеймен Жаратқан Иенің даңқын шығаруға арналған ғибадатхананы және өзі үшін патша сарайын салуға әмір етті."},
	{2, "2 Патша жетпіс мың адамды тас тасушы, тағы сексен мыңын тауда тас қашаушы, ал үш мың алты жүзін жұмысшылар үстінен қараушы болып жұмыс істеуге белгіледі."},
	{3, "3 Сүлеймен Тир патшасы Хирамға мынадай сәлем жолдады: Әкем марқұм өзіне сарай салған кезінде Сіз оған самырсын ағаштарының бөренелерін жіберген едіңіз."},
	{4, "4 Қазір мен Құдай Иемнің даңқын шығаратын ғибадатхана салып, Оған бағыштамақпын. Сол жерде Жаратқан Иеге арнап хош иісті заттар түтетіліп, Оның алдында әрдайым арнайы нан тартулары ұсынылуға тиіс. Күн сайын таңертең және кеште, демалыс күндері, айдың бірінші күні әрі Құдай Иеміздің басқа да мейрам кездерінде құрбандықтардың шалынып, өртеліп ұсынылулары керек. Бұл рәсімдер Исраил халқына тұрақты бекітілген."},
	{5, "5 Біз сиынатын Құдай барлық тәңір атаулыдан ұлы. Сондықтан да мен Оған арнап салатын ғимарат орасан зор болмақ."},
	{6, "6 Расында Құдайға лайықты үй салып беруге кімнің шамасы жетеді?! Тіпті ұлан-ғайыр көктің өзі Оны сыйғыза алмайды! Мен де Оған арнап киелі үй салатындай кіммін сонша? Тек Оның алдында арнайы сый-тартуларды өртеп ұсынатын орын дайындамақпын."},
	{7, "7 Сол себепті маған бір шеберіңізді жіберсеңіз екен. Ол алтын, күміс, қола және темірді өңдеп, күрең қызыл, қырмызы, қою күлгін түсті жүн жіптерден мата тоқып, түрлі бұйымдарды әшекейлеп ою оя алатын болсын, әрі Яһуда мен Исраилде әкем марқұм кезінде белгілеген шеберлеріммен бірге жұмыс істесін."},
	{8, "8 Сондай-ақ маған Ливан тауларынан самырсын, қарағай және арша ағаштарының бөренелерін де жіберсеңіз екен. Сол жердегі ағаштарды кесіп, құлату жағынан қызметшілеріңіздің ерекше тәжірибелі екенін білемін."},
	{9, "9 Қажетті бөренелерді молынан дайындауда өз қызметшілерім де көмектеспек. Себебі салайын деп отырған ғимаратым зәулім де керемет салтанатты болуға тиіс."},
	{10, "10 Ал мен ағаштарды кесіп, құлатуға жұмсаған адамдарыңызды тамақтандыру үшін жиырма мың қаптан бидай мен арпа және жиырма мың күбіден шарап пен зәйтүн майын жіберемін."},
	{11, "11 Тир патшасы Хирам Сүлеймен патшаға жауап берген хатында былай деп жазды: Жаратқан Ие өз халқын сүйгендіктен Сізді патша етіп тағайындады! —"},
	{12, "12 Хирам хатын одан әрі былай деп жалғастырды: — Исраилдің сиынатын Құдайы — аспан мен жерді жаратқан Тәңір Ие мадақталсын! Ол Дәуіт патша марқұмға дана, ақылды да зерек ұл сыйлапты! Ізін басқан бұл ұлы енді Жаратқан Иеге арнап ғибадатхана, өзіне патша сарайын салмақшы екен."},
	{13, "13 Сізге Хурам-Әби есімді ақылды да шебер адамымды жібергелі отырмын."},
	{14, "14 Шешесі Дан руынан, ал әкесі тирлік. Хурам-Әби алтын, күміс, қола, темір, тас және ағашпен, күрең қызыл, қою күлгін, қырмызы түсті жүн және жіңішке зығыр жіптермен жұмыс істей алады. Әр түрлі ою ойып, барлық жобаларды жүзеге асыру қолынан келеді. Бұл кісі өз шеберлеріңізбен және тақсыр ием — әкеңіз Дәуіт марқұмның шеберлерімен бірге істейтін болады."},
	{15, "15 Ал енді, тақсыр ием, өзіңіздің айтқаныңызға сай осы қызметшілеріңізге бидай, арпа, зәйтүн майы және шарабыңызды жібере көріңіз."},
	{16, "16 Сіз үшін Ливан тауларынан керекті ағаштарыңызды құлатып, бір-біріне байластырып сал жасап, теңіз арқылы Яффаға жеткізіп береміз. Әрі қарай Иерусалимге өзіңіз алып кетерсіз."},
	{17, "17 Әкесі Дәуіт көзі тірісінде істегендей, Сүлеймен де Исраилде тұратын басқа ұлттық ер адамдардың санағын өткізген еді. Олардың жалпы саны бір жүз елу үш мың алты жүз болды."},
	{18, "18 Бұлардың жетпіс мыңын жүк тасушы, сексен мыңын тауда тас қашаушы, ал үш мың алты жүзін жұмысшылардың үстінен қарап, жұмыстарды алға жұмылдырушы етіп белгілеп қойды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Сонымен Сүлеймен Иерусалимдегі Мория төбесінде Жаратқан Иенің киелі үйінің құрылысына кірісті. Бұрын ебустік Орнанның астық бастыратын қырманы болған сол жерде Дәуітке Жаратқан Ие аян берген еді. Содан Дәуіт бұл орынды ғибадатхана салуға дайындап қойған болатын."},
	{2, "2 Сүлеймен құрылысты Өзінің патшалық құрған төртінші жылының екінші айының екінші күні бастады."},
	{3, "3 Оның Құдай үйіне арнап салған іргетасының өлшемдері мыналар болды: ұзындығы алпыс, ені жиырма шынтақ. Мұнда шынтақтың көне өлшемі қолданылды."},
	{4, "4 Алдыңғы жағындағы бағаналы кіреберістің ені, жалпы ғимараттың еніндей, жиырма шынтақ, ал биіктігі жүз жиырма шынтақ болды. Сүлеймен киелі үйдің ішін саф алтынмен қаптатты."},
	{5, "5 Оның үлкен бөлмесінің қабырғаларын қарағай тақтайшалармен, солардың үстін саф алтынмен қаптатты. Алтынның бетіне құрма ағашы мен шынжырға ұқсаған нақыштар ойғызып,"},
	{6, "6 киелі үйді асыл тастармен де әшекейлетті. Қолданылған саф алтын Парваим жерінен әкелінген болатын."},
	{7, "7 Сүлеймен киелі үйдің ішін: төбесіндегі бөренелерді, босағаларын, қабырғалары мен есіктерін алтынмен қаптатып, қабырғалардың беттеріне керуб атты періштелердің бейнелерін ойып жасатты."},
	{8, "8 Сүлеймен киелі үйдің ең қасиетті бөлмесін де салғызды. Соның ұзындығы мен ені, киелі үйдің жалпы еніндей, жиырма шынтақтан болды. Патша бөлменің ішін салмағы алты жүз ат басындай саф алтынмен қаптатты."},
	{9, "9 Онда қолданылған алтын шегелердің салмағы елу мысқал болды. Киелі үйдің жоғарғы бөлмелерінің қабырғалары да алтынмен қапталды."},
	{10, "10 Патша киелі үйдің ең қасиетті бөлмесі үшін керуб делінген күзетші періштелердің екі мүсінін ойдырып жасатты да, алтынмен қаптатты."},
	{11, "11 Мүсіндердің жайған қанаттарының ұзындығы бес шынтақтан болып, олар екі жаққа қарай түгелімен жиырма шынтаққа созылды. Бірінші мүсіннің бір қанаты бөлменің бір қабырғасына, өзге қанаты екінші мүсіннің қанатына тиіп тұрды."},
	{12, "12 Сол сияқты, екінші мүсіннің де бір қанаты бөлменің қарама-қарсы қабырғасына, өзге қанаты бірінші мүсіннің қанатына тиіп тұрды."},
	{13, "13 Осылайша жайылған қанаттардың жалпы ұзындығы жиырма шынтақ болды. Екі мүсін тік тұрған күйі жасалып, беттері үлкен бөлмеге қарап орналастырылды."},
	{14, "14 Сүлеймен қою күлгін, күрең қызыл, қырмызы жүн және жіңішке зығыр жіптерден маталар тоқытып, олардың бетіне керубтердің бейнелерін кестелетіп, шымылдық дайындатты."},
	{15, "15 Патша екі бағана жасатып, киелі үйдің алдына тұрғызды. Олардың биіктігі отыз бес шынтақтан, ал үстіңгі иықтарының биіктігі бес шынтақтан болды."},
	{16, "16 Патша алқа іспетті оралып тұратын шынжырлар да жасатып, оларды бағаналардың жоғарғы жақтарына іліп қойғызды. Ол сонымен қатар анар жемісінің жүз мүсінін де дайындатып, оларды шынжырларға бекіттірді."},
	{17, "17 Патша осы екі бағананы киелі үйдің дәл алдына, біреуін кіреберістің оң жағына, екіншісін сол жағына тұрғызды. Оң жағындағысын Жахин (Берік Орнатушы), сол жағындағысын Боғоз (Құдірет Иесі) деп атады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Бұдан кейін Сүлеймен қоладан құрбандық үстелін жасатты. Оның ұзындығы мен ені жиырма шынтақтан, биіктігі он шынтақ болды."},
	{2, "2 Бір дәу қазанды да қоладан балқытып құйғызды. Соның сырт пішіні дөңгелек, әрі ернеуінің бір шетінен екінші шетіне дейінгі аралығы он шынтақ, биіктігі бес шынтақ болды. Дәу қазанды айналдыра өлшеп шығу үшін ұзындығы отыз шынтақ жіп қолданылды. Осы дәу қазан теңіз деп те аталатын."},
	{3, "3 Оның ернеуінен төменірек шағын өгіз мүсіндері бейнеленген еді. Олар әрбір шынтақ сайын он-оннан екі қатар болып қазанмен қоса құйылды."},
	{4, "4 Дәу қазан өгіз кейіптес он екі тұғырдың үстіне орнатылды. Сол өгіз мүсіндерінің бас жақтары тысқа: үш-үштен солтүстікке, батысқа, оңтүстікке және шығысқа, ал арт жақтары қазан ортасына қарай бағытталып орналасты."},
	{5, "5 Дәу қазанның қалыңдығы қолдың тұтамындай, ернеуі кесенің ернеуіндей, сырт кейпі лалагүл іспетті болды. Оның ішіне үш жүз күбі су сыятын."},
	{6, "6 Патша мұнан басқа тағы он қазан жасатып, оларды бес-бестен киелі үйдің оң және сол жақтарына орнатқызды. Шалынған құрбандықтардың өртелетін бөліктерінің бәрі алдымен солардағы сумен жуылып-шайылатын. Ал діни қызметкерлердің тазару рәсімі үшін дәу қазанның суы қолданылды."},
	{7, "7 Сүлеймен алтыннан он шам қойғыш жасатып, киелі үйдің ішіне, бес-бестен оң және сол жақтарына орнатқызды. Мұны (Мұса пайғамбарға) көрсетілген үлгіге сәйкес істеді."},
	{8, "8 Патша он үстел де жасатып, оларды киелі үйдің ішіне, бесеуін оң, бесеуін сол жағына қойды. Сонымен қатар су не қан бүркуге арналған жүз тостағанды да алтыннан дайындатты."},
	{9, "9 Сүлеймен діни қызметкерлерге арналған ауланы және үлкен аула мен оның қақпаларын жасатып, қақпаларды қоламен қаптатты."},
	{10, "10 Бұдан кейін дәу қазанды киелі үйдің оң жағына, оның оңтүстік-шығыс бұрышына жақын орнатқызды."},
	{11, "11 Соңында күлсалғыштар мен қалақтарды және тостағандарды жасатты. Сонымен Хурам-Әби Сүлеймен патша үшін Құдайдың киелі үйіндегі жұмыстарын тамамдады. Оның жасап дайындағандары мыналар:"},
	{12, "12 екі бағана мен олардың үстіңгі иығындағы екі үлкен тостаған кейпі және соларға ілінген шынжыр тәрізді әшекейлер,"},
	{13, "13 сол шынжырларға екі қатардан ілінген анар жемісінің төрт жүз мүсіні,"},
	{14, "14 он жылжымалы тұғыр мен олардың үстіндегі он қазан,"},
	{15, "15 дәу қазан және оның астындағы өгіз мүсінді он екі тұғыр,"},
	{16, "16 күлсалғыштар мен қалақтар, шанышқылар және тағы басқа қажетті бұйымдардың бәрі. Хурам-Әби осы айтылғандарды Сүлеймен патша үшін Құдайдың киелі үйіне арнап жылтыратылған қоладан жасады."},
	{17, "17 Патша оларды Иордан өзенінің бойындағы Соқот пен Сартан қалаларының арасындағы жазықта саздан дайындалған қалыптарға құйғызып жасатты."},
	{18, "18 Құйылған қоланың көп болғандығы сонша, оның салмағын ешкім анықтаған жоқ."},
	{19, "19 Сүлеймен сондай-ақ Құдайдың киелі үйіне арналған барлық жиһаздарды да жасатты. Олар: хош иісті заттар түтетілетін алтын жалатқан үстел, Құдай алдына ұсынылатын нанға арналған үстел,"},
	{20, "20 саф алтыннан жасалған шам қойғыштар мен олардың май шамдары — бұлар Мұса пайғамбарға ежелде берілген ереже бойынша ең қасиетті бөлменің алдында жанып тұруға тиіс болатын —"},
	{21, "21 гүл іспетті әшекейлер, шырақтар және білте түзеткіштер, осы соңғылар сом алтыннан жасалды."},
	{22, "22 Білте түзеткіштер, (су не қан бүркуге арналған) тостағандар, табақтар және ішіне шоқ салынатын табалар саф алтыннан жасалды. Киелі үйдің кіреберісі, қасиетті және ең қасиетті бөлмелерінің есіктері үшін де алтын қолданылды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Сонымен Сүлеймен Жаратқан Иенің киелі үйіне байланысты барлық жұмыстарды тамамдады. Мұнан кейін ол әкесі Дәуіттің Құдайға бағыштап дайындап кеткен нәрселерін де: күміс, алтын және түрлі бұйымдар мен жиһаздардың бәрін Құдайдың үйінің қазынасына апарып, сонда сақтап қойды."},
	{2, "2 Сүлеймен Жаратқан Иенің Келісім сандығын Сион төбесіндегі Дәуіттің шаһарынан киелі үйге көшіруге арналған салтанатқа қатысуға Исраил халқының ақсақалдарын, барлық рубасылары мен әулет басшыларын Иерусалимге шақырды."},
	{3, "3 Бүкіл Исраилдің адамдары жетінші айдағы Күркелер мейрамының кезінде патшаның қасына жиналды."},
	{4, "4 Елдің барлық ақсақалдары жиналғаннан кейін леуіліктер Келісім сандығын тұрған орнынан көтеріп алып кетті."},
	{5, "5 Олар Келісім сандығымен бірге киелі шатырды және соның ішіндегі барлық жиһаз-жабдықтарды да көтеріп алып, жаңа ғибадатханаға қарай өрлеп бара жатты. Бұларды діни қызметкерлер мен өзге леуіліктер алып жүрді."},
	{6, "6 Сүлеймен патша мен қасына жиналған күллі исраилдіктер Келісім сандығының алдында ешкім санап шыға алмайтындай көптеген қой-ешкі мен мүйізді ірі қара малдарды құрбандыққа шалып ұсынды."},
	{7, "7 Осылайша діни қызметкерлер Жаратқан Иенің Келісім сандығын киелі үйдің ең қасиетті бөлмесіндегі өз орнына — екі керуб мүсінінің қанаттарының астына алып барып, орналастырды."},
	{8, "8 Екі керуб мүсіні Келісім сандығы тұратын орынның үстінен қанаттарын жайып, Келісім сандығының өзін және оны көтеріп алып жүру үшін сандыққа бекітілген сырықтарын жауып тұрды."},
	{9, "9 Сырықтардың ұзын болғаны сонша, олардың ұштары ең қасиетті бөлменің алдынан көрініп тұратын еді. Алайда киелі үйдің сыртынан оларды ешкім көре алмайтын. Сырықтар әлі күнге дейін сонда."},
	{10, "10 Келісім сандығының ішінде Мұса пайғамбар Хориб тауында салған екі тас тақташа ғана болды. Жаратқан Ие сол жерде Мысырдан көшіп шыққан исраилдіктермен Келісім жасасқан еді."},
	{11, "11 Мұнан кейін діни қызметкерлер киелі үйден шықты. Барлық діни қызметкерлер топтарының кезегіне қарамай-ақ өздерін Құдайдың қызметіне арнап, тазару рәсімінен өтіп, дайындалып алған болатын."},
	{12, "12 Ақ бәтестен тігілген киім киіп алып, құрбандық үстелінің шығыс жағында тұрған барлық леуілік әнші-күйшілер: Асап, Хеман және Едутун өз ұлдары және бауырластарымен бірге даңғыра, жетіген мен шертерде ойнап, жүз жиырма діни қызметкер де кернейлерін тартып жатты."},
	{13, "13 Кернейшілер мен әнші-күйшілер бірігіп бір дауыспен Жаратқан Иені мадақтап, Оған шүкірлік айтты. Олар даңғыра, жетіген және шертердің сүйемелдеуімен ән-жыр айтып Жаратқан Иені былай деп дәріптеді: Жаратқан Иеміз сондай ізгі, Мәңгі ұласады Оның мейірімі! Сонда киелі үй Жаратқан Иенің бұлт іспетті нұрлы салтанатына кенелді."},
	{14, "14 Діни қызметкерлер енді сол жерде тұрып, міндеттерін орындай алмады, себебі Құдайдың киелі үйі Жаратқан Иенің нұрлы салтанатына кенелген болатын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 Сол кезде Сүлеймен былай деді: Жаратқан Ие Өзінің қалың бұлт ішін мекендейтінін айтқан болатын."},
	{2, "2 Уа, Ием, дәйім Сенің (жер бетіңдегі) тұрағың болсын деп Саған арнап осы зәулім сарайды салдым."},
	{3, "3 Патша кейін бұрылып, қарсы алдында жиналып тұрған исраилдіктердің бәріне батасын берді."},
	{4, "4 Содан кейін оларға былай деді: — Әкем марқұмға берген уәдесін іс жүзінде орындаған Жаратқан Ие — Исраилдің сиынатын Құдайы мадақталсын! Ол мынаны айтқан болатын:"},
	{5, "5 Мен халқымды Мысырдан құтқарып, бастап алып шыққан күннен бері өз құрметіме киелі үй салынсын деп Исраилдің ешбір руындағы бірде-бір қаланы таңдамадым. Сондай-ақ халқым Исраилдің басшысы болуға бірде-бір адамды да таңдаған жоқ едім."},
	{6, "6 Енді Мен Өзіме ғибадат ететін орын болуға Иерусалимді, ал халқымды басқаруға Дәуітті таңдап алдым."},
	{7, "7 Марқұм әкемнің жүрегінде Исраилдің Құдай Иесінің құрметіне киелі үй салу ниеті бар болатын."},
	{8, "8 Ал Жаратқан Ие оған: Менің құрметіме киелі үй салғың келгені өте дұрыс."},
	{9, "9 Алайда Маған арнап киелі үй салатын адам сен емессің, ол — өзіңнің ұлдарыңның бірі. Менің құрметіме киелі үйді салатын сол болады, — деген еді."},
	{10, "10 Жаратқан Ие осы айтқандарын жүзеге асырды да: Оның уәдесіне сай мен әкемнің орнын басып, Исраилдің патшалық тағына отырдым. Енді Исраилдің Құдай Иесінің құрметіне киелі үй салғыздым."},
	{11, "11 Жаратқан Иенің Исраилдің үрім-бұтағымен жасасқан Келісімінің куәліктері сақталған сандықты сонда орналастырдым."},
	{12, "12 Содан соң Сүлеймен Жаратқан Иеге арналған құрбандық үстелінің алдында тұрып, жиналған бүкіл Исраил қауымының алдында қолдарын жайып Тәңір Иеге сиынды."},
	{13, "13 Патша қола мінбе жасатып, ауланың ортасына орнатқызған еді. Мінбенің ұзындығы мен ені бес, биіктігі үш шынтақ болды. Соның үстінде тұрған патша күллі исраилдіктердің көз алдында тізесін бүгіп, қолдарын аспанға қарай жайып"},
	{14, "14 былай деді: Уа, Исраилдің Құдайы — Жаратқан Ие! Көк пен жерде Сен сияқты ешбір құдай жоқ! Жасаған Келісіміңе адалсың, шын жүректен тура жолыңмен жүрген қызметшілеріңе рақымың мол."},
	{15, "15 Сен әкем марқұмға уәде еткеніңдей, оған сенімді болып, рақымыңды көрсетіп келдің. Бұрын Өзің сөз беріп, уәде еткеніңді бүгін іс жүзінде орындап отырсың."},
	{16, "16 Ал енді, уа, Жаратқан Ие, Исраилдің Құдайы, Өзіңнің қызметшің Дәуітке: Егер ұрпақтарың сен сияқты Менің алдымда таза жүріп, тапсырған Таурат заңыма бағынатын болса, онда әрдайым сенің ұрпақтарыңның біреуі Исраилдің патшалық тағында отыратын болады! деп берген уәдеңді іске асыра гөр."},
	{17, "17 Сонымен, уа, Исраилдің Құдай Иесі, Өзіңе қызмет еткен әкем марқұмға айтқан сөздеріңді орындай гөр."},
	{18, "18 Алайда Құдай шынымен-ақ жер бетінде пенделер арасында тұратын бола ма?! Тіпті ұлан-ғайыр көктің өзі Сені сыйғыза алмағанда, мен салған мына үй қайдан сыйғызсын?!"},
	{19, "19 Солай болса да, уа, Құдайым Жаратқан Ие, Сенің алдыңда бой ұрып сиынып жасаған өтінішіме назар аударып, жалбарына еткен мінажатыма мейіріммен құлақ сала гөр!"},
	{20, "20 Сен Мына киелі үйді өз атыммен атаймын деп сөз бергендіктен, оған күні-түні қамқор бола гөр. Уа, Ием, алдыңдағы қызметшіңнің бұл жерге қарай Өзіңе бағыштаған мінажатына құлақ аса гөр."},
	{21, "21 Осы пендең және меншікті Исраил халқың бұл жерге қарай Саған сиынып дұға еткен кезде көктегі тұрағыңнан өтінішімізге құлақ салып, күнәларымызды кешіре гөр."},
	{22, "22 Егер болашақта бір кісі басқа біреуге жамандық жасапты деп айыпталып, осы киелі үйдегі құрбандық үстелінің алдында ант беруге мәжбүр етілсе,"},
	{23, "23 онда Сен көктен құлақ асып, пенделеріңе төрелік ете гөр. Сол кісі кінәлі болса, істеген қылмысын мойнына арта гөр, ал кінәсіз болса, әділдігін әшкерелеп, ақтай гөр."},
	{24, "24 Егер де халқың Исраил Сенің алдыңда күнәға батқандықтан, жауларынан жеңіліп қалса, ал кейін Саған қайтып, Құдайлық билігіңе мойынсұнса, әрі осы киелі үйіңе қарай сиынып, рақым көрсетуіңді сұрап жалынса,"},
	{25, "25 онда Сен көктен оларға құлақ сала гөр. Халқың Исраилдің күнәларын кешіріп, оларды өздеріне және ата-бабаларына сыйлаған осы елге қайтара гөр."},
	{26, "26 Егер олар көз алдыңда күнәлі болғанда Сен өздерін жазалап, аспанды жаңбыр жауғызбай жауып тастасаң, әрі олар Саған бұл жерге қарай сиынып, Құдайлық билігіңе мойынсұнып, күнәларынан бас тартса,"},
	{27, "27 онда Сен көктен олардың дұғаларына құлақ сала гөр. Қызметшілеріңнің және бүкіл халқың Исраилдің күнәларын кешіре гөр. Оларға тура жолмен қалай жүру керектігін үйретіп, Өзің халқыңа мұралық меншікке берген осы еліңе қайтадан жаңбыр жібере гөр."},
	{28, "28 Болашақта елді ашаршылық не індет жайлап, егінді өсімдік таты басып немесе көгеріп шірісе, құрт-шегіртке жалмап, не болмаса елге жау шауып, қалаларын талан-таражға салса, яки халықтың арасында қандай да бір апат болып не ауру-сырқау жайылса,"},
	{29, "29 онда олардың Өзіңе сиынып еткен мінажаттарына құлақ сала гөр. Азап шегіп, қайғырып жатқан жеке біреу болсын не бүкіл халқың Исраил болсын, егер осы киелі үйіңе қарай қолдарын жайып Саған сиынып жалбарынса,"},
	{30, "30 онда Сен көктегі тұрағыңнан құлақ сала гөр. Оларды кешіріп, әрқайсысына өзінің ой-ниеті мен істеріне қарай лайықтысын бере гөр. Адам жүрегінде не бар екенін Сен ғана жақсы білесің ғой."},
	{31, "31 Өзің осы елді ата-бабаларымызға берген едің. Ендеше меншікті халқың бұл жерде тұрған барлық уақытта Сені терең қастерлеп тура жолыңмен жүретін болсын."},
	{32, "32 Тіпті халқың Исраилге жатпайтын жат жерлік адам алыс елден ұлы есімің мен зор құдіретің туралы естігендіктен осында келіп, Саған бұл киелі үйге қарай сиынса,"},
	{33, "33 онда Сен көктегі тұрағыңнан құлақ салып, оның барлық өтініштерін орындай гөр. Осылайша жер жүзінің күллі халықтары Сенің Құдай екеніңді мойындасын. Халқың Исраил сияқты олар да Сені терең қастерлеп, мен салғызған осы ғибадатхананың Өзіңе бағышталып, есіміңмен аталғанын білсін."},
	{34, "34 Халқың Сен жіберген бір жаққа қарай жауларына қарсы соғысқа аттанғанда Өзіңнің таңдап алған бұл қалаңа және мен Сенің құрметіңе салғызған киелі үйге қарай Саған сиынып мінажат етсе,"},
	{35, "35 онда Сен көктен олардың мінажаттары мен жалбарыныштарына құлақ салып, оларды қолдап-қорғай гөр."},
	{36, "36 Егер олар Сенің алдыңда күнә жасаса, себебі күнә жасамайтын пенде жоқ, әрі Сен оларға қаһарланып, жау қолына бере салып, жау оларды не алыс, не жақын бір елге айдап әкетсе,"},
	{37, "37 ал олар тұтқында жүрген сол елде өкініп, теріс жолдарынан қайтып, Біз күнәға баттық, жасаған істеріміз бұрыс та жексұрын болды! деп Сенің алдыңда мойындаса,"},
	{38, "38 әрі жер аударылған елдерінде Саған шын жүректен бет бұрып қайтып келсе, Өзің ата-бабаларына сыйлаған еліңе, таңдап алған қалаңа және мен Сенің құрметіңе салғызған осы ғибадатханаңа қарай Саған сиынса,"},
	{39, "39 онда көктегі тұрағыңнан олардың мінажаты мен жалбарынышына құлақ аса гөр! Олардың Өзіңе қарсы шығып, күнәға батқандықтарын кешіріп, оларды қолдап-қорғай гөр!"},
	{40, "40 Ал енді, уа, Құдайым, осы жерде айтылатын мінажаттарға әрдайым назар аударып, құлақ сала гөр!"},
	{41, "41 О, Құдай Ие, енді өз құдіретіңнің белгісімен, яғни осы Келісім сандығымен, бірге көтеріліп, (жер бетіндегі) тұрағыңа кіріп, оны ұдайы мекендей гөр. Уа, Құдайым Жаратқан Ие, діни қызметкерлерің әрдайым Сенің құтқаруыңды молынан қабылдап, басқаларға да жеткізсін! Өзіңе адал адамдарың жақсылығыңа қуанып шаттана берсін!"},
	{42, "42 О, Құдай Жаратқан Ие, Өзің тағайындаған патшаңнан бас тарта көрме! Қызметшің Дәуітке уәде еткен берік рақымыңды есіңде сақтай гөр."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct kk7 poems[] = {
	{1, "1 Сүлеймен Құдайға сиынуын аяқтай бергенде, аспаннан от түсіп, өртелу үшін шалынған құрбандықтарды және басқа да сый-тартуларды өртеп, жалмап қойды. Жаратқан Иенің нұрлы салтанаты киелі үйді толтырып жіберді."},
	{2, "2 Киелі үйдің Жаратқан Иенің керемет салтанатына кенелгені сонша, діни қызметкерлер оған кіре алмай қалды."},
	{3, "3 Бүкіл Исраил халқы аспаннан от түсіп, Жаратқан Иенің нұрлы салтанатының киелі үйдің үстінде тұрғанын көрді. Олар тас төселген аулада жерге етпеттей жата кетті, әрі ғибадат етіп былай деп шүкірлік айтты: Жаратқан Ие сондай ізгі, Мәңгі ұласады Оның мейірімі!"},
	{4, "4 Мұнан кейін патша мен жиналып тұрған бүкіл халық Жаратқан Иеге арнап құрбандықтар шалды."},
	{5, "5 Сүлеймен патша жиырма екі мың мүйізді ірі қара мен жүз жиырма мың қой-ешкіні құрбандыққа ұсынды. Осылайша патша мен бүкіл халық киелі үйді Құдайға бағыштау рәсімін орындады."},
	{6, "6 Діни қызметкерлер міндеттеріне сәйкес өз орындарында тұрды. Леуілік әнші-күйшілер Жаратқан Иенің Дәуіт патша жасатып берген саз аспаптарын қолдарына алды. Дәуіт патша көзі тірісінде осы аспаптарды жасатып, оларды леуіліктерге Тәңір Иені мадақтап, Оған шүкірлік еткен кездерінде ойнататын. Өйткені Жаратқан Ие сондай ізгі, мәңгі ұласады Оның мейірімі! Енді леуіліктердің қарсы алдында тұрған діни қызметкерлер кернейлерін тартып, бүкіл Исраил халқы да сол жерде Жасаған Иені даңқтап тұрды."},
	{7, "7 Сүлейменнің қоладан жасатқан құрбандық үстелі шалынып, өртелетін құрбандықтарды, майлы бөліктер мен астықтан жасалатын сый-тартулардың барлығын сыйғыза алмай қалды. Сондықтан патша Жаратқан Иенің киелі үйінің алдындағы ауланың ортаңғы бөлігіне ерекше тазарту рәсімін жасатып, оны да сол мақсатқа бағыштады. Осылай бұл жерде де толығымен өртелетін құрбандықтар, астық тартуларды және майлы бөліктер өртеліп ұсынылды."},
	{8, "8 Осы кезде Сүлеймен жеті күн бойы мейрам тойын жасады. Тойға бүкіл Исраил халқы солтүстіктегі Лебо-Хаматтан Мысырмен шекарадағы өзенге дейінгі аралықтағы барлық жерден жиналған қалың қауым болып қатысты."},
	{9, "9 Сегізінші күні олар тағы да салтанатты жиналыс өткізді. Себебі жеті күн бойы құрбандық үстелін Жаратқан Иеге бағыштау рәсімдерін орындағаннан кейін халық және жеті күн бойы Күркелер мейрамын тойлады."},
	{10, "10 Жетінші айдың жиырма үшінші күні Сүлеймен халықты үйлеріне қайтарды. Бәрі Жаратқан Иенің Дәуіт пен Сүлейменге және халқы Исраилге жасаған игіліктеріне қуанғаннан жүректері лүпілдеп қатты риза болды."},
	{11, "11 Сонымен Сүлеймен Жаратқан Иеге арналған ғибадатхананың және өзінің патша сарайының құрылысын бітіріп, ойға алғандарының бәрін де жүзеге асырып болды."},
	{12, "12 Сол кезде Жаратқан Ие оған түнде аян беріп былай деді: — Сенің мінажатың құлағыма жетті. Мен осы жерді Өзіме құрбандықтар мен сый-тартулар ұсынылатын киелі үй болсын деп таңдап алдым."},
	{13, "13 Егер Мен болашақта не аспанды жаңбыр жауғызбай жауып тастасам, не шегірткелерге елдегі егістіктерді жалмауды бұйырсам, не халқымның арасына індет жіберсем,"},
	{14, "14 сонда Менің атыммен аталып жүрген халқым Маған бой ұсына сиынып, еркімді білгісі келсе және теріс жолдарынан қайтса, онда Мен оларға көктен құлақ саламын. Мен күнәларын кешіріп, олар тұрған елді сауықтырып, қайтадан амандық пен тыныштық сыйлаймын."},
	{15, "15 Бұдан былай осы жерде айтылатын мінажаттарға көзім ашық, құлағым түрулі болады."},
	{16, "16 Мен бұл орынды таңдап алып, есімім әрдайым орнықсын деп Өзіме бағыштадым. Оны ұдайы жүрегімде ұстап, көзімнен таса қылмаймын."},
	{17, "17 Егер сен әкең Дәуіт сияқты көз алдымда адал жүріп, өзіңе берген өсиеттерімді орындап, ережелерім мен шешімдеріме бағынатын болсаң,"},
	{18, "18 онда Мен сенің патшалық тағыңды берік етемін. Өйткені әкең Дәуітпен Келісім жасап, оған былай деп уәде еттім: Онда әрдайым сенің ұрпақтарыңның біреуі Исраилге билік құратын болады."},
	{19, "19 Алайда егер өзің және ұрпақтарың Менен теріс бұрылып, өздеріңе тапсырған ережелерім мен өсиеттерімді орындамай, басқа тәңірлерге құлшылық етіп, табынатын болсаңдар,"},
	{20, "20 онда Мен Исраилді Өзім табыстаған осы елден қуып шығамын, әрі өз есіміме бағыштаған бұл киелі үйді де қасымнан алып тастаймын. Осылайша Мен оны барлық басқа халықтар мысалға келтіріп, табалап мазақ ететіндей масқараға ұшыратамын."},
	{21, "21 Осы киелі үй қазір салтанатты болып тұрғанмен, қиратылып, үйінді болып қалады. Сонда оның қасынан өткен-кеткен әркім аңтарыла жаны түршігіп: Жаратқан Ие бұл ел мен мына киелі үйге неліктен осындай нәрсені істеді екен? деп сұрайтын болады."},
	{22, "22 Сонда жұрт: Себебі олар ата-бабалары сиынған, соларды Мысырдан бастап алып шыққан Құдайы — Жаратқан Иені елемей тастап кетіп, бөтен тәңірлерге бет бұрды да, соларға табынып, құлшылық ететін болды. Сондықтан Жаратқан Ие олардың бастарына осы бақытсыздықтың барлығын үйіп-төкті! деп мысалдайтын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct kk8 poems[] = {
	{1, "1 Сүлеймен Жаратқан Иеге арналған ғибадатхананы және өзінің патшалық сарайын жиырма жылда салып бітірді."},
	{2, "2 Ол сонымен қатар Тир патшасы Хирам өзіне табыстаған қалаларын да қайта салғызып, оларға исраилдіктерді орналастырды."},
	{3, "3 Сүлеймен Хамат-Соба патшалығына аттанып, оны да өзіне бағындырды."},
	{4, "4 Кейін ол елсіз даладағы Тадмор қаласын және Хамат еліндегі астық сақтауға арналған қойма қалаларының бәрін салғызды."},
	{5, "5 Сүлеймен жоғарғы және төменгі Бет-Хорон қалаларын қорған етіп қайта салғызып, қақпаларын мықты бөренелермен және ысырмалармен бекіткізді."},
	{6, "6 Патша, сондай-ақ, Бағалат қаласын және астық сақтау үшін қойма қалаларын әрі соғыс күймелері мен атты әскерінің жылқыларына арналған барлық қалаларды да салғызды. Жалпы, ол Иерусалимде, Ливан тауларында және өзінің билігіне бағынатын барлық жерде саламын дегендерінің бәрін де жүзеге асырды."},
	{7, "7 Елдің Исраил халқына жатпайтын байырғы тұрғындары, яғни хеттік, аморлық, перездік, хевтік және ебустік ұлттар да болды."},
	{8, "8 Солардың исраилдіктер елді иемденіп алғанда құртып жібермеген ұрпақтарының бәрін Сүлеймен жұмыс істеуге мәжбүрледі. Бұл жағдай әлі күнге дейін сақталып келеді."},
	{9, "9 Ал патша исраилдіктердің ешқайсысын малайлық жұмыстарына салмады. Бұларды өзінің жасақшылары, әскери бөлім басшылары, соғыс күймелері мен атты әскерінің жетекшілері етіп тағайындады."},
	{10, "10 Сүлеймен патшаның халықты басқарған екі жүз елу қызметкері де осылардың арасынан еді."},
	{11, "11 Сүлеймен өзінің жұбайы — Мысыр патшасы перғауынның қызына арнап сарай салғызып, оны Дәуіттің шаһарынан сол сарайға көшірді. Ол былай деді: Бұл әйелім Исраилдің патшасы Дәуіт марқұмның сарайын мекендемеуі керек, себебі кезінде Жаратқан Иенің Келісім сандығы тұрған жерлер Құдайға ерекше бағышталған."},
	{12, "12 Сүлеймен киелі үйдің кіреберісінің алдында Жаратқан Иеге арналған құрбандық үстелін жасатқан еді. Сол кездері ол оның үстінде Жаратқан Иеге шалынып, түгелдей өртелетін құрбандықтар ұсынатын."},
	{13, "13 Патша Мұса пайғамбар қалдырған ереже бойынша әр күннің қажетті құрбандықтары мен сый-тартуларын Тәңір Иеге бағыштайтын. Ол, сондай-ақ, демалыс күндері, әр айдың басында және жыл сайын өткізілетін басқа үш мейрамда, яғни Ашымаған нан, Жеті апта және Күркелер мейрамдарында, Құдайға арнайы құрбандықтар бағыштайтын."},
	{14, "14 Патша әкесі Дәуіт марқұмның нұсқауларына сәйкес діни қызметкерлерге топ кезектері бойынша міндеттерін жүктеді. Ол өзге леуіліктерге мадақтау қызметін жүргізуді және күнделікті мұқтаждық бойынша діни қызметкерлерге көмектесуді тапсырды және қақпашыларды өз топтарына сай ғибадатхананың әр қақпасына бекітіп қойды. Патша осының бәрін Құдайдың таңдаған адамы Дәуіттің қалдырған нұсқауларына сәйкес істеді."},
	{15, "15 Барлық мәселелерде, соның ішінде ғибадатхана қазынасы бойынша да, діни қызметкерлер мен леуіліктер патшаның берген бұйрықтарын бұлжытпай орындап жүрді."},
	{16, "16 Осылайша Сүлейменнің Жаратқан Иенің киелі үйінің негізін салған күнінен бастап, оны толығымен бітірген күніне дейінгі жасаған еңбегі жүзеге асып, аяқталды."},
	{17, "17 Сол кезде Сүлеймен Едом жерінің Қызыл теңіз жағалауында орналасқан Есион-Гәбер мен Елат қалаларына барды."},
	{18, "18 Хирам патша оған қызметшілері арқылы кемелерін жіберіп, соларды басқаратын тәжірибелі теңізшілерін де жолдады. Олар Сүлейменнің қызметшілерімен бірге кемемен (Қызыл теңіз арқылы) Опыр жеріне жүзіп барды. Сол жақтан олар төрт жүз елу ат басындай алтын алып келіп, Сүлеймен патшаның қолына тапсырды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct kk9 poems[] = {
	{1, "1 Сүлейменнің зор даңқы туралы Сәба елінің патшайымы естіген еді. Содан ол Сүлейменге қиын сауалдар қойып, даналығын сынамақшы болды. Патшайым көп нөкерін ертіп сапарға шығып, ұлан-ғайыр байлықпен Иерусалимге келді. Түйелеріне хош иісті заттар, мол алтын мен асыл тастар артылған болатын. Сүлеймен қонақты қарсы алып, сарайына кіргізді. Патшайым ойындағы бар мәселелер жайлы онымен сөйлесті."},
	{2, "2 Сүлеймен солардың бәріне жауап берді. Патша білмей, түсіндіре алмаған бірде-бір сауал болған жоқ."},
	{3, "3 Сәбаның патшайымы Сүлейменнің асқан даналығын және салғызған (зәулім) сарайын көріп, қайран қалды."},
	{4, "4 Ол патшаның дастарқанындағы тамақтарын, уәзірлерінің мәжілістерін, сәнді киінген нөкерлері мен шарапшыларының келісті қызметтерін әрі Сүлейменнің Жаратқан Иенің киелі үйіне көтеріліп барып, құрбандықтар шалғызып өртеткенін де бақылады. Патшайымның таңғалғаны сонша, демін ала алмай үнсіз қалды."},
	{5, "5 Содан ол патшаға тіл қатып былай деді: Сіздің іс-әрекеттеріңіз бен даналығыңыз туралы елімде жүріп естігендерімнің бәрі де шындық екен."},
	{6, "6 Алайда келіп, өз көзіммен көргенге дейін сол сөздерге сенбеген едім. Енді даналығыңыздың одан да зор екенін көріп отырмын. Расында оның тіпті жартысы туралы да естімеппін!"},
	{7, "7 Мына адамдарыңыз қандай бақытты! Әрқашан қасыңызда жүріп, даналығыңызды тыңдай алатын нөкерлеріңіз қандай бақытты!"},
	{8, "8 Сізге риза болып, уәкілі ретінде Өзінің патшалық тағына отырғызған Құдайыңыз Жаратқан Ие мадақталсын! Құдайыңыз Исраилді қатты сүйіп, оны осы елде тұрақты орналастыруды көздейді. Сол себепті халыққа сізді қара қылды қақ жарып әділдік пен адалдықты ұстанатын патша етіп қойды."},
	{9, "9 Сәба патшайымы осылай деп, патшаға жүз жиырма ат басындай алтын әрі орасан зор мөлшерде хош иісті заттар мен асыл тастарды тарту етті. Оның Сүлейменге сыйлағанындай жоғары сапалы хош иісті заттар бұрын болған емес."},
	{10, "10 Сол сияқты, Хирам мен Сүлейменнің қызметкерлері Опыр жерінен алтынмен бірге қызыл сандал ағашының бөренелері мен асыл тастарды да алып келетін."},
	{11, "11 Сүлеймен патша осы қызыл сандал ағашынан Жаратқан Иенің киелі үйі және өзінің сарайы үшін баспалдақтар және әнші-күйшілерге арнап жетіген мен шертер аспаптарын жасатты. Сапасы осындай жоғары бұйымдар Яһуда елінде бұрын ешқашан болмаған еді."},
	{12, "12 Сүлеймен патша Сәба патшайымына әкелгендерінен әлдеқайда көп мөлшерде сый-тартулар беріп, оның үстіне оны сұрағандарының бәрімен де қанағаттандырды. Мұнан соң патшайым нөкерлерін ертіп өз еліне қайтып кетті."},
	{13, "13 Сүлеймен жыл сайын қабылдайтын алтынның мөлшері алты жүз алпыс алты ат басындай болды."},
	{14, "14 Бұған қоса делдалдар мен саудагерлерден де кіріс түсіп жатты; арабтардың барлық патшалары және өз елінің әкімдері Сүлейменге алым-салық ретінде алтын мен күміс әкеліп отыратын."},
	{15, "15 Сүлеймен патша екі жүз үлкен қалқан жасатып, оларды балғамен соғылып тегістелген алтынмен қаптатқызды. Әр қалқанға кеткен алтынның мөлшері алты жүз мысқалдай болды."},
	{16, "16 Патша тағы үш жүз шағын қалқан жасатып, оларды да соғылған алтынмен қаптатқызды. Бұл қалқандардың әрқайсысы үшін үш жүз мысқалдай алтын жұмсалды. Патша қалқандардың барлығын Ливан орманы сарайына қойғызды."},
	{17, "17 Патша піл сүйегімен безендіріліп, саф алтынмен қапталған үлкен тақ жасатты;"},
	{18, "18 оның алты баспалдағы және таққа бекітілген алтын табан тіреніші бар еді. Тақтың патша отыратын орнының екі жағында бір қол тұтқадан, әр тұтқаның жанында бір-бірден арыстан мүсіндері тұрды."},
	{19, "19 Алты баспалдақтың үстінде әр жағында бір-бірден, барлығы он екі арыстанның мүсіні тұрды. Мұндай тақ ешбір патшалықта бұрын-соңды жасалып көрмеген еді."},
	{20, "20 Сүлеймен патшаның сусын ішетін ыдыстарының бәрі алтыннан, ал Ливан орманы сарайындағы ыдыстары саф алтыннан жасалды. Өйткені Сүлейменнің заманында күміс құнсыз зат деп саналатын."},
	{21, "21 Себебі патша өзінің үлкен сауда кемелерін (Тир патшасы) Хирамның теңізшілерінің басқаруымен үш жылда бір рет алыс сапарға жіберіп, олар алтын, күміс, піл сүйегі, маймылдар және тауыс құстарын алып келетін."},
	{22, "22 Осылайша Сүлеймен патша жер бетіндегі күллі патшалардан байлығымен де, даналығымен де асып түсті."},
	{23, "23 Жердің барлық патшалары Сүлейменмен жүздесіп, оның Құдай сыйлаған даналығын тыңдауға құштар болды."},
	{24, "24 Олардың бәрі оған жыл сайын сый-тартуларын: күміс пен алтын бұйымдарды, киім-кешек, қару-жарақ, хош иісті заттар, жылқы, қашырларды алып келіп отырды."},
	{25, "25 Патшаның аттары мен соғыс күймелеріне арналған төрт мың қорасы болды; жылқыларының жалпы саны он екі мың еді. Оларды соғыс күймелерінің арнайы қалаларында және өзінің қасында астанасы Иерусалимде ұстады."},
	{26, "26 Сүлеймен солтүстіктегі Евфрат өзенінен бастап, філістір еліне және Мысырдың шекарасына дейінгі барлық патшаларды өзіне қаратты."},
	{27, "27 Патша Иерусалимде күмісті тас сияқты үйреншікті нәрсе етті, әрі шетелден әкелінетін қымбат самырсындарды өз елінің төменгі қыраттарында көптеп өсетін тұт ағаштары іспетті мол етті."},
	{28, "28 Оның қызметкерлері Сүлейменге жылқыларды Мысырдан және басқа көптеген елдерден алып келді."},
	{29, "29 Сүлейменнің басқа да іс-әрекеттерінің барлығы басынан аяғына дейін Натан пайғамбардың тарихында, шилолық Ахияхтың пайғамбарлық хабарында және Иддо пайғамбардың Набат ұлы Еробоғам туралы көрген көріністері баяндалған кітабында жазылып қалдырылған."},
	{30, "30 Сүлеймен Иерусалимде бүкіл Исраилдің үстінен қырық жыл бойы патшалық құрған соң,"},
	{31, "31 көз жұмып, ата-бабаларының қасына жөнелді. Оның мәйіті әкесі Дәуіттің шаһарындағы қабірге қойылды. Сүлейменнің ұлы Рохабоғам орнын басып патша болды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct kk10 poems[] = {
	{1, "1 Содан Рохабоғам Сихем қаласына барды, себебі бүкіл Исраил халқы оны патша етіп бекіту үшін Сихемге жиналған еді."},
	{2, "2 Бұл туралы хабар алған Набат ұлы Еробоғам Сүлеймен патшадан қашып барған Мысыр елінен қайта оралды."},
	{3, "3 Өйткені біреулер адам жіберіп, оны шақыртқан еді. Сонда Еробоғам мен бүкіл Исраилдің өкілдері Рохабоғамның алдына келіп, оған тіл қатып былай деді:"},
	{4, "4 — Әкеңіз марқұмның бізге артқан жүгі тым ауыр! Оның мойнымызға салып қойған азапты қызметі мен зілдей жүгін жеңілдетсеңіз, сізге қызмет ететін боламыз! —"},
	{5, "5 Сонда патша: — Маған үш күннен кейін қайтып келіңдер! — деді. Халық тарап кетті."},
	{6, "6 Рохабоғам әкесі Сүлейменнің көзі тірі кезінде уәзірі болған ақсақалдардан ақыл сұрап: — Мына халыққа қандай жауап қайтару керек, не деп кеңес бересіздер? — деді."},
	{7, "7 Ақсақалдар: — Егер де бұл халыққа жылы шырай танытып, көңілін аулап, ымыраға келетін болсаңыз, онда олар әрдайым сіздің қызметшілеріңіз болмақ! — деген жауап қайырды."},
	{8, "8 Бірақ Рохабоғам ақсақалдардың берген ақылын менсінбей, өзіне қызмет көрсететін құрдас жігіттерімен кеңесіп:"},
	{9, "9 — Ақылдарыңды айтыңдаршы маған. Әкеңіз бізге артқан ауыр жүкті жеңілдете көріңіз! деген мына халыққа қандай жауап қайтарамыз? — деп сұрады. —"},
	{10, "10 Сонда құрдас жігіттері былай деді: — Сізге: Әкеңіздің мойнымызға салған ауыр жүгін жеңілдете көріңіз! деген халыққа мынадай жауап беріңіз: Менің шынашағымның өзі әкемнің белінен мықты!"},
	{11, "11 Әкем сендерге ауыр жүк артқан болса, мен соның үстіне тағы да қосамын! Әкем сендерді жай қамшымен ұстаған болса, мен дойыр қамшының астына аламын!"},
	{12, "12 Патшаның Маған үш күннен кейін қайтып келіңдер деп айтқанына сай, Еробоғам мен бүкіл халық үшінші күні Рохабоғам патшаның алдына жиналды."},
	{13, "13 Патша ақсақалдардың берген кеңесін елемей, жас жігіттердің айтқан ақылдарын тыңдап, халыққа дөрекі жауап берді:"},
	{14, "14 — Әкем сендерге ауыр жүк артқан болса, мен соның үстіне тағы да қосамын! Әкем сендерді жай қамшымен ұстаған болса, мен дойыр қамшының астына аламын!"},
	{15, "15 Осылайша патша халықтың өтінішіне құлақ салмады. Ал оқиғаның бұлай бет бұруы Құдайдың еркі бойынша еді. Сол арқылы Жаратқан Ие Өзінің шилолық Ахиях пайғамбар арқылы Набат ұлы Еробоғамға айтқан сөзін іске асырды."},
	{16, "16 Бүкіл Исраилдің өкілдері патшаның өздеріне құлақ түрмегенін көргенде, оған қарсы айқайлап былай деді: Дәуітке біздің қатысымыз жоқ, Есейдің ұлында еш үлесіміз жоқ! Мекендеріңе қайтыңдар, исраилдіктер! Дәуіт, өз үйіңе-ақ билік ете бер! Содан олар мекендеріне қайтып кетпек болды."},
	{17, "17 Осылай Рохабоғам тек Яһуда руының қалаларында тұратын исраилдіктерге ғана патша болып қалды."},
	{18, "18 Сонда ол (патшалықтың біртұтастығын қалпына келтіру мақсатымен) міндетті жұмыстарды басқарушы Адонирамды халыққа жіберді. Бірақ (Солтүстік) Исраилдің адамдары оны таспен атқылап өлтірді. Ал Рохабоғам патшаның өзі күймесіне секіріп мініп, Иерусалимге қашып құтылды."},
	{19, "19 (Солтүстік) Исраил күні бүгінге дейін Дәуіттің әулетінен шыққан патшаларға бағынбай келеді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct kk11 poems[] = {
	{1, "1 Рохабоғам Иерусалимге қайтып келген соң, (Солтүстік) Исраилге қарсы аттанып, бүкіл патшалықты өзіне қайтарып алмақ болды. Сол үшін Яһуда мен Бунямин халқынан бір жүз сексен мың таңдаулы сарбазын жинады."},
	{2, "2 Бірақ Құдай Ие Өзінің таңдаған адамы Шемаяхқа сөзін арнап былай деді:"},
	{3, "3 Яһуданың патшасы Сүлеймен ұлы Рохабоғамға және Яһуда мен Буняминнің жерлерінде тұратын исраилдіктерге тіл қатып былай де:"},
	{4, "4 Жаратқан Ие мынаны айтады: Жорыққа аттанып, өз ағайындарыңмен соғыспаңдар! Барлығың да үйлеріңе қайтыңдар! Себебі мұны істеп отырған Өзіммін! Сонда олар Жаратқан Иенің сөздеріне құлақ асып, Еробоғамға қарсы аттанған жорықтан кері қайтты."},
	{5, "5 Рохабоғам Иерусалимде тұрып, Яһуда елін қорғау үшін бірнеше қалаларда қамалдар салды."},
	{6, "6 Олар: Бетлехем, Етам, Теқоя,"},
	{7, "7 Бет-Сұр, Соқо, Адуллам,"},
	{8, "8 Ғат, Мареша, Зиф,"},
	{9, "9 Адораим, Лахыш, Әзека,"},
	{10, "10 Сора, Аялон, Хеброн. Осы қамалды қалалар Яһуда мен Бунямин руларының жерінде орналасқан."},
	{11, "11 Рохабоғам сол қалалардың бекіністерін күшейтіп, қолбасшыларын тағайындап, оларда азық-түлік, зәйтүн майы және шарап қорларын дайындады."},
	{12, "12 Сонымен қатар ол барлық қалаларды қалқан, найзалармен жабдықтап, мықтап бекітті. Осылай Яһуда мен Бунямин рулары Рохабоғамның билігінде қалды."},
	{13, "13 Исраилдің күллі аймақтарындағы діни қызметкерлер мен леуіліктер Рохабоғамды жақтады."},
	{14, "14 Солтүстік Исраилдің патшасы Еробоғам мен оның ұлдары оларды Жаратқан Иеге қызмет етуден аластатты. Сондықтан көптеген леуіліктер мұралық жайылымдарын, үй-жайларын тастап, Яһуда мен Иерусалимге көшіп келді."},
	{15, "15 Еробоғам жалған тәңірлердің ешкі және жас бұқа кейпіндегі мүсіндерін жасатып, солар үшін және биіктеу жерлердегі табыну орындары үшін өзінің діни қызметкерлерін тағайындады."},
	{16, "16 Алайда халықтың барлық руларында Исраилдің Құдайы Жаратқан Иеге шын жүректен бет бұрып, Оның еркін сұраған адамдар болды. Олар ата-бабаларының сиынған Құдайы Жаратқан Иеге арнап құрбандық шалу үшін Оған адал болып қалған леуіліктердің соңынан Иерусалимге барды."},
	{17, "17 Бұлар үш жыл бойы Яһуда патшалығын күшейтіп, Сүлеймен ұлы Рохабоғамды қолдады. Олар осы кезеңде Дәуіт пен Сүлеймен іспетті Құдай жолымен жүрді."},
	{18, "18 Рохабоғам Дәуіт ұлы Еримоттың қызы Махалатқа үйленді. Соның шешесі Есей ұлы Елиәбтің қызы Әбихаил еді."},
	{19, "19 Махалаттан Егуш, Шәмәриях, Заһам атты үш ұл дүниеге келді."},
	{20, "20 Бұдан кейін Рохабоғам Абессаломның (немере) қызы Махаға үйленіп, одан Абиях, Аттай, Зиза, Шеломит есімді төрт ұл сүйді."},
	{21, "21 Рохабоғам Маханы өзінің басқа әйелдері мен кәнизактарына қарағанда көбірек ұнатты. Рохабоғамның жалпы он сегіз әйелі, алпыс кәнизагы болды, солардан жиырма сегіз ұл, алпыс қыз көрді."},
	{22, "22 Патша Махадан туған ұлы Абияхты патшазадалардың басшысы етіп, оны өзінің орнын басатын патша болуға тағайындады."},
	{23, "23 Рохабоғам көрегендікпен әрекет етіп, өзге ұлдарын Яһуда мен Буняминнің күллі аймақтарына және барлық бекітілген қалаларға орналастырды. Оларды керек-жарағымен молынан қамтамасыз етіп, бірнеше әйел алуларына жағдай жасады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct kk12 poems[] = {
	{1, "1 Рохабоғамның билігі орнығып, күшейген кезде оның өзі және бүкіл халқы Жаратқан Иенің Таурат заңына бағынбай кетті."},
	{2, "2 Олар Жаратқан Иеден бас тартқандықтан, Мысыр патшасы Шұшақ Иерусалимге қарсы аттанды. Бұл Рохабоғамның патшалық құруының бесінші жылы болды."},
	{3, "3 Шұшақ Мысырдан бір мың екі жүз соғыс күймесін, алпыс мың салт атты сарбазды әрі либиялық, сұққилық және құштық жауынгерлерден тұратын орасан зор жаяу әскерін ертіп алып келді."},
	{4, "4 Перғауын Яһуда еліндегі бекіністі қалаларды басып алып, Иерусалимге жетті."},
	{5, "5 Сонда Шемаях пайғамбар Шұшақтан бас сауғалап Иерусалимге жиналған Рохабоғамға және Яһуданың әміршілеріне барып, оларға былай деді: — Жаратқан Ие мынаны айтады: Сендер Мені тастап кеттіңдер! Ендеше Мен де сендерді тастап, Шұшақтың қолына тапсырамын!"},
	{6, "6 Мұны естіген Исраилдің әміршілері мен патшасы: — Жаратқан Иенің ісі әділ! — деп, күнәларын мойындады."},
	{7, "7 Жаратқан Ие олардың күнәларына өкініп отырғанын көріп, Шемаяхқа сөзін арнап: Олар күнәларын мойындады. Мен енді оларды біржола құртпай, біршама қолдаймын. Иерусалимге деген қаһарымды Шұшақ арқылы төкпеймін."},
	{8, "8 Бірақ Маған қызмет ету мен бөтен елдердің патшалықтарына қызмет етудің айырмашылығына көздері жету үшін олар перғауынның құлдарына айналсын, — деді."},
	{9, "9 Сонымен Мысыр патшасы Шұшақ Иерусалимге өрлеп жеткен соң Жаратқан Иенің ғибадатханасының және патша сарайының қазыналарын қолына түсірді. Олардың бәрін де, Сүлеймен патша алтынмен қаптатқызып жасатқан қалқандарды да алып кетті."},
	{10, "10 Рохабоғам патша солардың орнына қоламен қапталған қалқандар жасатып, оларды патша сарайының есіктерін күзететін сақшылардың басшыларына табыстады."},
	{11, "11 Патша Жаратқан Иенің киелі үйіне барған сайын сақшылар қалқандарды көтеріп алып келіп, кейін қайтадан күзетшілер үйіне апарып қоятын."},
	{12, "12 Рохабоғам күнәсін мойындағанда Жаратқан Ие қаһарынан қайтып, патша біржола құрып кетуден аман қалды. Сол кезде Яһуда елінде әлі де Құдай жолымен жүретін адамдар болды."},
	{13, "13 Рохабоғам Иерусалимде билігін бекітіп, жалғастыра берді. Ол патша болған кезде қырық бір жаста еді. Рохабоғам он жеті жыл бойы Иерусалим қаласында билік жүргізді. Жаратқан Ие осы қаланы Исраилдің барлық руларынан Өзінің атына киелі үйін орнатуға таңдап алған болатын. Рохабоғамның шешесі аммондық Нағама еді."},
	{14, "14 Патша Жаратқан Иеге шын жүректен бет бұрмаған еді, содан оның істегендері жалпы әділетсіз болды."},
	{15, "15 Рохабоғамның іс-әрекеттері басынан аяғына дейін Шемаях пайғамбардың жазбаларында және Иддо пайғамбардың Шежіре туралы жазбаларында баяндалған. Рохабоғам мен Еробоғамның патшалық құрған бүкіл кездерінде екеуінің арасында соғыс болып тұрды."},
	{16, "16 Рохабоғам көз жұмып, ата-бабаларының қасына жөнелгенде, мәйіті Дәуіттің шаһарындағы қабірге қойылды. Оның ұлы Абиях орнын басып патша болды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct kk13 poems[] = {
	{1, "1 Еробоғам Солтүстік Исраилге патшалық құрған он сегізінші жылы Абиях Яһуда елінің патшасы болды."},
	{2, "2 Ол Иерусалимде үш жыл билік жүргізді. Оның шешесінің аты-жөні гибеялық Ұриелдің қызы Маха еді. Абиях пен Еробоғамның арасында соғыс жүріп жатты."},
	{3, "3 Абиях төрт жүз мың мықты да ержүрек сарбаздан құралған жасағын ертіп алып, соғысуға аттанды. Еробоғам да сегіз жүз мың мықты да ержүрек сарбазымен бірге сап түзеп дайын тұрды."},
	{4, "4 Абиях патша Ефрем руының қыратты жеріндегі Семараим тауының басына шықты. Сол жерде тұрып, Абиях қатты дауыспен былай деді: Уа, Еробоғам және бүкіл Исраил халқы, сөзіме құлақ салыңдар!"},
	{5, "5 Исраилдің сиынған Құдайы Жаратқан Иенің Дәуітпен ешқашан бұзылмайтын тұрақты Келісім жасағанын білмейтін бе едіңдер? Сол Келісім бойынша Жаратқан Ие Исраилге патшалық құруды Дәуітке және оның ұрпақтарына табыстады ғой!"},
	{6, "6 Бірақ та Дәуіт ұлы Сүлейменнің бір басыбайлы қызметшісі — Набат ұлы Еробоғам көтеріліп, өз иесіне қарсы бүлік шығарды."},
	{7, "7 Сонда ақымақ та азғын бірсыпыра адамдар Еробоғамның айналасына жиналып, Сүлеймен ұлы Рохабоғамға қарсы күштерін нығайтты. Рохабоғам сол кезде әлі де ысылмаған жас болғандықтан, оларға қарсы тұра алмады."},
	{8, "8 Міне, бүгін өздерің де Жаратқан Иенің Дәуіттің ұрпақтарына табыстаған патшалығына қарсы тұрамыз дейсіңдер. Сендер үлкен тобыр болып жиналыпсыңдар. Еробоғам сендердің тәңірлерің болуға жасатқан алтын бұқа мүсіндері қастарыңда бар екен."},
	{9, "9 Ал Жаратқан Иенің Һароннан тараған діни қызметкерлерін және леуіліктерді сендер өз араларыңнан қуып жібердіңдер ғой. Олардың орнына басқа халықтар сияқты діни қызметкерлеріңді өздерің тағайындап қойдыңдар. Кімде-кім бағышталу рәсіміне бір тана мен жеті қошқарды алып келсе, болды, әлгі адам сол жалған тәңірлеріңнің діни қызметкері болып шыға келеді."},
	{10, "10 Ал бізде Құдайымыз Жаратқан Ие бар, Одан бас тартқан жоқпыз. Һароннан тараған діни қызметкерлер ғана Жаратқан Иеге қызметтерін ежелдегідей атқарып жатыр, леуіліктер де өз міндеттерін орындап жүр."},
	{11, "11 Олар күн сайын таңертең және кешке Жаратқан Иеге шалынып, өртелетін құрбандықтарды да, хош иісті заттарды да түтетіп ұсынуда. Олар арнайы үстелдің үстіне ұдайы нан тартуларын қойып, алтын шам қойғыштың шамдарын кеш сайын жағып, нұрын түсіріп жарқыратады. Себебі біз Құдайымыз Жаратқан Иенің белгілеген қызметтерін орындап жүрміз, бірақ сендер Одан бас тартып, безіп кеттіңдер."},
	{12, "12 Өздерің көріп тұрсыңдар, Құдай бізге жар болып, бізді бастап жүр! Оның діни қызметкерлері де алдыңғы шепте, олар сендерге қарсы ұрандап кернейлерін тартатын болады. Уа, Исраилдің үрім-бұтағы, өз ата-бабаларыңның сиынған Құдайы Жаратқан Иеге қарсы соғыспаңдар! Бәрібір жеңіске жетпейсіңдер!"},
	{13, "13 Сол екі арада Еробоғам Яһуда жасағының артқы тылына бір топ жауынгерлерін жіберген болатын. Яһуда сарбаздарының алдарынан Солтүстік Исраил жасағы, арттарынан сол торуыл тобы тұрды."},
	{14, "14 Яһудалықтар бұрылып, өздерінің алды-артынан шабуылға тап болайын деп жатқанын көргенде, Жаратқан Иеге қатты дауыспен жалбарынды. Ал діни қызметкерлер кернейлерін тартып ұрандатты."},
	{15, "15 Сол сәтте яһудалықтар атой салды. Олар атойлағанда Құдай Еробоғамға және Солтүстік Исраилдің бүкіл жасағына Абиях пен Яһуданың алдында соққы берді."},
	{16, "16 Содан Солтүстік Исраилдің адамдары Яһуда жасағынан қаша жөнелді. Құдай оларды яһудалықтардың қолына түсірді."},
	{17, "17 Абиях пен оның жасағы оларды ойсырата жеңіп, Солтүстік Исраилдің бес жүз мың таңдаулы сарбазы қаза тапты."},
	{18, "18 Солтүстік Исраилдің қалған адамдары тізе бүкті. Осылайша яһудалықтар ата-бабалары сиынған Құдайы Жаратқан Иеге сенімдерін артқандықтан, күш-қуаты артып жеңіске жетті."},
	{19, "19 Абиях Еробоғамды қуып, одан бірнеше қаланы: Бетел, Ешана және Ефронды соларға қарасты елді мекендерімен бірге тартып алды."},
	{20, "20 Абияхтың заманында Еробоғам енді қайтып өзінің күш-қуатын қалпына келтіре алмады. Ақырында Жаратқан Ие Еробоғамды аурумен соғып, ол қайтыс болды."},
	{21, "21 Ал Абиях күшейе берді. Ол он төрт әйел алып, жиырма екі ұл, он алты қыз сүйді."},
	{22, "22 Абияхтың қалған іс-әрекеттері мен сөздері жайлы Иддо пайғамбардың түсіндірме кітабында баяндалған."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct kk14 poems[] = {
	{1, "1 Абиях көз жұмып, ата-бабаларының қасына жөнелгенде, мәйіті Дәуіттің шаһарындағы қабірге қойылды. Абияхтың ұлы Аса оның орнын басып патша болды. Асаның заманында елде он жылға тыныштық орнады."},
	{2, "2 Аса өзінің сиынатын Құдайы Жаратқан Иеге ұнамды ізгі де әділ істер істеді."},
	{3, "3 Ол бөгде тәңірлерге арналған құрбандық орындарын және биіктеу жерлердегі табыну орындарын қиратып құртты. Солардағы тас бағаналарды сындырып, Ашераға бағышталған ағаш бағаналарды да шауып тастады."},
	{4, "4 Патша, сондай-ақ, яһудалықтарға ата-бабаларының сиынған Құдайы — Жаратқан Иеге бет бұрып мойынсұну әрі Оның Таурат заңы мен өсиеттерін орындау жайлы да бұйырды."},
	{5, "5 Аса Яһуданың күллі қалаларынан биіктеу жерлердегі табыну орындарын және хош иісті заттар түтетілетін үстелдерді құртып, алып тастады. Оның тұсында патшалық бір тыныш кезеңді өткізді."},
	{6, "6 Осы бейбітшілік кезінде патша Яһуда елінде қамалды қалалар салды. Сол жылдары онымен ешкім соғысқан жоқ, себебі Жаратқан Ие оған тыныштық сыйлаған еді."},
	{7, "7 Аса Яһуда халқын осы іске жігерлендіріп былай деген болатын: Сол қалаларды салып, оларды қабырғалармен әрі мұнаралармен қоршайық. Мықты бөренелермен бекітілген қақпалар да тұрғызайық! Біз Құдайымыз Жаратқан Иеге бет бұрып сиынып келеміз, сол себепті ел әлі де біздікі. Иә, Жаратқан Иеге бет бұрып, Оның еркін біліп, орындауға ұмтылып келеміз. Содан Ол бізге барлық жағымыздан тыныштық сыйлады! Мұнан соң халық құрылысқа жаппай қатысып, табысқа жетті."},
	{8, "8 Асаның жасағы үлкен қалқан, найзамен қаруланған үш жүз мың яһудалықтан және қалқан, садақпен қаруланған екі жүз сексен мың буняминдіктен тұрды. Олардың барлығы мықты сарбаздар болатын."},
	{9, "9 Кейінірек Құштық Зарах сан мыңдаған жасақшылардан және үш жүз соғыс күймесінен тұратын әскер қолымен Яһуда еліне қарсы аттанып, (елдің батыс жағындағы) Мареша қаласына жетті."},
	{10, "10 Яһуда патшасы Аса оларға қарсы шығып, екі жақ Марешаның маңындағы Сефата аңғарында сап түзеп, шайқасқа дайындалды."},
	{11, "11 Аса Құдай Иесіне дауыстап сиынып былай деді: Уа, Жаратқан Ие, әлсізді мықтыдан қолдап-қорғайтын құдірет жалғыз Сенде ғана! О, Құдайымыз — Жаратқан Ие, бізді қолдай гөр! Біз Саған сенім артамыз, Сенің атыңмен осы қарақұрым тобырға қарсы аттанып шықтық. Уа, Жаратқан Ие, Сен біздің Құдайымызсың! Пенденің Өзіңнен басым болуына жол бере көрме!"},
	{12, "12 Сонда Жаратқан Ие Асаның және Яһуда жасағының көз алдында құштық Зарахтың жасақшыларына соққы берді. Содан олар қаша жөнелді."},
	{13, "13 Аса мен оның қасындағы жасағы жауларды (оңтүстіктегі) Герар қаласына дейін қуды. Құштықтардың қаза тапқандары соншама көп болып, олар қайтадан күш жинай алмады. Өйткені олар Жаратқан Иенің және Оның қолдаған жасағының алдында қырылып талқандалған еді. Ал яһудалықтар қолдарына ағыл-тегіл олжа түсіріп, алып кетті."},
	{14, "14 Кейін яһудалықтар Герардың айналасындағы қалаларға шабуыл жасады. Солардың бәрі де Жаратқан Иенің құдіретінен қорқып үрейленіп отырған еді. Содан яһудалықтар осы қалалардағы олжалауға тұрарлық көптеген заттарды иемденіп алды."},
	{15, "15 Мұнан кейін олар шатырларда тұрып, мал бағатын тайпаларға да шабуылдап, олардың көп қой-ешкі, түйелерін тартып алып, Иерусалимге қайта оралды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct kk15 poems[] = {
	{1, "1 Сол уақытта Одед ұлы Азарияхқа Құдайдың Рухы қонды."},
	{2, "2 Содан Азариях патшамен кездесу үшін жолға шықты да, оған тіл қатып былай деді: Уа, Аса және бүкіл Яһуда мен Бунямин халқы, құлақ асыңдар! Сендер Құдаймен бірге жүргендеріңде Ол да сендермен бірге жүріп жар болады. Егер де Оған бет бұрып сиынып Оны іздесеңдер, таба аласыңдар. Бірақ Одан бас тартсаңдар, Ол да сендерден бас тартады."},
	{3, "3 Ұзақ уақыт бойы Исраил халқы шынайы Құдайдан алыс жүрді. Олардың тәлім беретін діни қызметкері де, Таурат заңы да болған жоқ."},
	{4, "4 Ал олар қиыншылыққа ұшырап, Исраилдің Құдайы Жаратқан Иеге бет бұрып сиынғанда Оны тауып алды."},
	{5, "5 Сол кездері сапарға шыққандар аман-есен барып келе алмайтын. Елдердің күллі тұрғындарының бастарына зор пәле туатын."},
	{6, "6 Ұлт ұлтқа, қала қалаға қарсы шығып соғысатын, себебі Құдай оларды абыржытып, әр түрлі қиыншылықтарға ұшырататын."},
	{7, "7 Ал сендер қайратты болып, мойымаңдар! Еңбектеріңнің жемісін әлі де көресіңдер."},
	{8, "8 Аса патша Құдайдың пайғамбары Одед ұлы Азариях арқылы жеткізген осы хабарын естігенде батылданды. Содан патша Яһуда мен Бунямин руларының бүкіл жерлерінен және өзінің Ефремнің қыратты аймағынан иемденіп алған қалаларынан жексұрын тәңір мүсіндерін қиратып алып тастады. Сонымен қатар патша Жаратқан Иенің киелі үйінің кіреберісінің алдында орнатылған, Жаратқан Иеге бағышталған құрбандық үстелін қайтадан қалпына келтірді."},
	{9, "9 Мұнан кейін патша бүкіл Яһуда мен Буняминнің халқын да, Ефрем, Манаса, Шимон руларынан көшіп келіп, елде тұрып жатқандарды да Иерусалимде бас қосуға шақырды. Өйткені көптеген халық Құдайы Жаратқан Иенің Асаға жар болғанын көріп, Солтүстік Исраилді тастап, Яһудаға көшіп келген болатын."},
	{10, "10 Жамағат Иерусалимде Асаның патшалық құрған он бесінші жылының үшінші айында жиналды."},
	{11, "11 Сол күні олар соғыстан алып келген олжаларынан Жаратқан Иеге арнап жеті жүз мүйізді ірі қара мен жеті мың ұсақ мал басын құрбандыққа шалды."},
	{12, "12 Халық ата-бабаларының сиынған Құдайы Жаратқан Иеге шын жүректен, бар жан-тәндерімен бет бұрып, Оның еркін сұрап, орындау жайлы Келісім жасады."},
	{13, "13 Кімде-кім Исраилдің Құдайы Жаратқан Иеге бет бұрып бағынбай жүрсе, жас не ересек болсын, еркек не әйел болсын, соны өлтіруге сөз байласты."},
	{14, "14 Олар Жаратқан Иеге адал болу жайлы анттарын Оның алдында қатты дауыспен беріп, тартылған сырнай, керней үнімен бекітті."},
	{15, "15 Яһуда халқының бәрі осы антқа қуанды. Олар шын жүректен серт беріп, Құдайға адал ой-ниетпен бет бұрып, мойынсұнып жүрді. Содан Құдай оларға жауап беріп жар болды. Осылайша Жаратқан Ие елге жан-жақтан тыныштық сыйлады."},
	{16, "16 Аса патша тіпті әкесінің шешесі Маханы патшаның шешесі деген құрметті атағынан айырды. Себебі Маха жалған тәңір Ашераға арналған ағаш бағананы жасатып, орнатып қойған еді. Аса сол жексұрын бағананы шауып құлатып, қиратты да, оны Қидрон сайында өртеп жіберді."},
	{17, "17 Тек халықтың биіктеу жерлердегі Жаратқан Иеге ғибадат етіп келген орындары ғана Исраил елінен аластатылмады. Әйтсе де бүкіл өмір бойы Аса Жаратқан Иеге шын жүректен берілген адам болды."},
	{18, "18 Аса әкесінің және өзінің Құдайға бағыштаған заттарын: алтын-күміс пен басқа да құнды бұйымдарын Құдайдың киелі үйіне апарып қойды."},
	{19, "19 Сол кезден бастап Асаның патшалық құрған отыз бесінші жылына дейінгі аралықта елдің ішінде соғыс болған жоқ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct kk16 poems[] = {
	{1, "1 Ал Асаның патшалық құрған отыз алтыншы жылы Солтүстік Исраилдің патшасы Бағаса Яһуда еліне қарсы аттанып, өрлеп барды. Бағаса Аса патшаның жеріне ешкім кіріп-шыға алмау үшін екі елдің шекарасындағы Рамақ қаласын қамалмен бекітіп қойды."},
	{2, "2 Сонда Аса патша Жаратқан Иенің киелі үйінің және өз сарайының қазыналарынан алтын-күміс алып шықты. Оларды Арама елінің Дамаск қаласында тұратын патшасы Бен-Хададқа жіберді. Аса патша оған мынадай сәлемін жолдады:"},
	{3, "3 Екеуіміздің әкелеріміздің арасында келісім болғанындай, енді біз де сондай келісім жасасайық! Міне, мен сізге күміс пен алтын жіберіп отырмын. Өзіңіздің Солтүстік Исраилдің патшасы Бағасамен жасасқан келісіміңізден бас тарта көріңіз. Ол менің шекарамнан кері шегініп кетсін!"},
	{4, "4 Бен-Хадад Аса патшаның өтінішіне құлақ асып, өзінің қолбасшыларын Солтүстік Исраилдің қалаларына қарсы аттандырды. Олар Ион, Дан, Әбел-Маим қалаларын әрі Нафталим руының жеріндегі азық-түлік пен қару-жарақ қорлары сақталатын қалалардың барлығын басып алды."},
	{5, "5 Бағаса патша бұл туралы естігенде, Рамақ қаласын бекітуін тоқтатып, сол жұмысынан бас тартып, кері шегінді."},
	{6, "6 Сонда Аса патша Яһуда елінің барлық ер адамдарын ертіп алып, Рамаққа аттанды. Олар Бағаса салып жатқан қамалдың тастары мен бөренелерін тасып алып кетті. Аса патша солармен өзіне қарасты Геба және Миспа қалаларын бекітті."},
	{7, "7 Сол кезде Ханани пайғамбар Яһуда патшасы Асаға барып, оған былай деді: Сіз Құдайыңыз Жаратқан Иеге емес, Арама елінің патшасына сенім арттыңыз. Сондықтан Арама патшасының әскері сіздің қолыңыздан құтылып кетті, ал сіз оны өзіңізге бағындыру мүмкіндігінен айырылып қалдыңыз."},
	{8, "8 Есіңізге түсіріңіз, құштықтар мен либиялықтар көптеген соғыс күймелері мен салт атты сарбаздары бар үлкен қол жинап, аттанып келмеп пе еді?! Бірақ сіз Жаратқан Иеге сенім артқандықтан, Ол соларды қолыңызға түсірді ғой."},
	{9, "9 Себебі Жаратқан Ие Өзіне шын жүректен бағышталып, адал болып жүргендерді күш-қуат беріп қолдау үшін, бүкіл жер жүзін назарында ұстап отырады. Осы істегеніңіз үлкен ақылсыздық болды. Сол үшін де бұдан былай соғыстан көз ашпайтын боласыз!"},
	{10, "10 Осыны естігенде Аса патша пайғамбарға қатты ашуланды. Ашуының күшті болғаны сонша, пайғамбарды бұғаулатып, қамап қойғызды. Аса сол кездері халқының басқа да бірқатар адамдарына қысымшылық көрсетіп, жәбірледі."},
	{11, "11 Асаның іс-әрекеттері басынан аяғына дейін Яһуда мен Солтүстік Исраил патшаларының кітабында баяндалған."},
	{12, "12 Патшалық құруының отыз тоғызыншы жылы Аса аяқ ауруына шалдықты. Ауруы одан бетер асқына берсе де, Аса Жаратқан Иеге емес, тек дәрігерлерге ғана бет бұрып, сауықтыруын сұрады."},
	{13, "13 Содан ол патшалық құруының қырық бірінші жылы көз жұмып, ата-бабаларының қасына жөнелді."},
	{14, "14 Асаның мәйіті Дәуіттің шаһарындағы өзі жартастан үңгіп дайындатқан қабірге, ондағы түрлі хош иісті заттар мен иісмайларға толы жайылған төсекке қойылды. Патшаның құрметіне үлкен от жағылды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct kk17 poems[] = {
	{1, "1 Асаның ұлы Жосапат оның орнын басып Яһудаға патшалық құрды. Жосапат өзінің Солтүстік Исраилдің алдындағы жағдайын күшейту мақсатымен"},
	{2, "2 Яһуданың қамалды қалаларында әскери бөлімдерді орналастырды. Патша бүкіл Яһуда жерінде, сондай-ақ, әкесі Аса кезінде Ефрем руының жерінен басып алған қалаларда да өз қарауылдарын қойды."},
	{3, "3 Ежелде арғы атасы Дәуіт жүрген тура жолдан Жосапат та таймағандықтан, Жаратқан Ие оған жар болды. Жосапат Бағал есімді тәңірсымақтың мүсіндеріне емес,"},
	{4, "4 марқұм әкесінің сиынған Құдайына бет бұрып мойынсұнды. Осылай патша Жаратқан Иенің өсиеттерін орындап, Солтүстік Исраил халқының зұлым іс-әрекеттерін істеген жоқ."},
	{5, "5 Содан Жаратқан Ие Жосапаттың қолындағы патшалық билікті нығайтып, бүкіл Яһуда елі оған сыйлықтар алып келіп тұрды. Осылайша патша мол дәулет пен зор атақ-даңққа ие болды."},
	{6, "6 Патша шын жүректен Жаратқан Иеге бағышталған еді. Содан ол Яһуданың биіктеу жерлеріндегі жалған тәңірлерге табыну орындарын да, Ашераға арналған ағаш бағаналарды да қиратып алып тастады."},
	{7, "7 Патшалық құрған үшінші жылы Жосапат бірнеше лауазымды қызметкерлерін халыққа тәлім беру үшін Яһуда елінің қалаларына жіберді. Сол қызметкерлердің есімдері Бенхаил, Абадиях, Зәкәрия, Нетанел, Миқая еді."},
	{8, "8 Патша бұларға қоса Шемаях, Нетаниях, Забадиях, Асахил, Шемирамот, Ехонатан, Адониях, Тобиях, Тоб-Адониях есімді леуіліктерді де, Әлишама мен Жорам есімді діни қызметкерлерді де жолдады."},
	{9, "9 Жіберілгендер Жаратқан Иенің Таурат заңының кітабын алып, Яһуда елінде солардан тәлім бере бастады. Осылайша олар бүкіл Яһуда елін аралап, халыққа Таураттағы ережелерді үйретіп шықты."},
	{10, "10 Жаратқан Иенің Өзі Яһуданың айналасындағы елдердің бәріне үрей төндіргендіктен, Жосапатпен соғысуға олардың дәті бармады."},
	{11, "11 Қайта, бірсыпыра філістірлер Жосапат патшаға сыйлықтар және алым-салық ретінде күміс әкеліп, табыстап отырды. Көшпенді араб тайпалары да отарларынан жеті мың жеті жүз қошқар мен жеті мың жеті жүз серке айдап әкеліп беретін."},
	{12, "12 Күш-қуаты барған сайын өсе берген Жосапат Яһудада қорғандар және азық-түлік пен қару-жарақ қорлары сақталатын қалалар салғызды."},
	{13, "13 Осылайша ол Яһуданың қалаларына керек-жарақтың мол қорын жинап қойды. Оның мықты да ержүрек жасақшылары Иерусалимде тұрды."},
	{14, "14 Олардың әулеттері бойынша тізімі мынау: Мыңбасылардың қарамағында Яһуда руынан шыққан үш жүз мың мықты жауынгер болды. Оларды бастайтын қолбасшы Адна еді."},
	{15, "15 Одан кейінгі қолбасшы Жоханан екі жүз сексен мың сарбазды басқарды."},
	{16, "16 Содан кейінгі қолбасшы: өзін Жаратқан Иеге бағыштаған Зіхри ұлы Амасиях. Ол екі жүз мың мықты жауынгерге басшылық етті."},
	{17, "17 Күшті де батыл қолбасшы Әлияданың қарамағында Бунямин руынан шыққан, садақ, қалқанмен қаруланған екі жүз мың сарбаз болды."},
	{18, "18 Одан кейінгі қолбасшы Ехозабад соғысқа жабдықталған бір жүз сексен мың сарбазды бастады."},
	{19, "19 Осылар да, патшаның бүкіл Яһуда еліндегі бекіністі қалаларда орналастырған қарауылдары да оның қызметінде тұрды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct kk18 poems[] = {
	{1, "1 Осылай Яһуда патшасы Жосапат мол байлық пен зор атақ-даңқты иемденді. Алайда ол (соған қанағаттанбай, Солтүстік Исраилдің зұлым патшасы) Ахабпен одақтасып, құдандалы болды."},
	{2, "2 Біраз жыл өткен соң Жосапат сапарға шығып, Ахабтың астанасы Самарияға қонаққа барды. Ахаб Жосапат патшаның және оған еріп келген нөкерлерінің құрметіне көп қылып ұсақ және мүйізді ірі қара мал сойып, той жасады. Ахаб Жосапатты Ғилақад аймағындағы Рамот қаласына бірігіп аттанып, шабуыл жасауға еліктірмек болды."},
	{3, "3 Содан Ахаб Жосапатқа: — Менімен бірге Ғилақадтағы Рамот қаласына аттанасыз ба? — деген сауал қойды. Жосапат Ахабқа: — Өзім де, халқым да сіздің құзырыңыздамыз. Сізбен бірге соғысқа аттанамыз, — деп жауап берді."},
	{4, "4 Мұнан кейін ол: — Алдымен Жаратқан Иенің осыған айтатын сөзін біліп алсаңыз екен! — деп қосты."},
	{5, "5 Сонда Ахаб патша пайғамбарларды: шамамен төрт жүз адамды жинап алып, оларға мына сұрақты қойды: — Ғилақадтағы Рамот қаласы үшін шайқасуға аттануымыз қажет пе? Әлде содан бас тартайын ба? — Барлығы: — Өрлеп аттаныңыз! Құдай оны патшамыздың қолына тапсырып отыр, — деді."},
	{6, "6 Ал Жосапат: — Бұл жерде Жаратқан Иенің де пайғамбары жоқ па екен? Сол арқылы Жаратқан Иенің еркін сұрап біліп алайық, — деп қоймады"},
	{7, "7 Ахаб патша: — Елімізде Жаратқан Иенің еркін сұрап білуімізге болатын әлі де бір адам бар, Имелах ұлы Миқая. Бірақ оны жек көремін. Ол мен туралы әрдайым жақсы емес, тек жағымсыз пайғамбарлық сөздерді ғана айтады. — деп жауап қайырды. Ал Жосапат былай деп өтінді: — О, патша, солай дей көрмеңіз. (Оның да не айтарын тыңдап көрейікші.)"},
	{8, "8 Содан Солтүстік Исраилдің патшасы Ахаб бір нөкерін шақырып алып, оған: Имелах ұлы Миқаяны тез алып кел! — деп бұйырды."},
	{9, "9 Осы сәтте Солтүстік Исраилдің патшасы Ахаб және Яһуда елінің патшасы Жосапат патшалық киімдерін киіп, Самария қаласының қақпасының жанындағы ашық алаңда орналасқан екі тақта отырған еді. Әлгі пайғамбарлардың барлығы екеуінің алдында ерекше күйге түсіп, не болатыны туралы сәуегейлік айтып жатты."},
	{10, "10 Хенаған ұлы Седекиях өзіне темірден екі мүйіз жасап алып: — Жаратқан Ие мынаны айтады: Осы мүйіздер сияқты зор күшпен арамалықтарды сүзіп, біржола құртасың! — деп пайғамбарлық сөз айтқансыды."},
	{11, "11 Басқа пайғамбарлардың барлығы да дәл солай: — Ғилақадтағы Рамотқа өрлеп барып, жеңіске жетіңіз! Жаратқан Ие оны патшаның қолына тапсырып отыр, — деп пайғамбарлық сөз айтқансып жатты."},
	{12, "12 Миқаяны шақыруға барған нөкер оған былай деп бұйырды: — Тыңда, пайғамбарлардың бәрі бірауыздан патшаға жағымды сөз айтуда. Сенің сөзің де солардікіндей болсын! Сен де жағымды жайтты болжамдарсың! —"},
	{13, "13 Бірақ Миқая: — Мәңгі тірі Жаратқан Иенің алдында шын айтамын: Құдайым маған нені білдірсе, тек соны ғана айтып беремін! — деп ант етті."},
	{14, "14 Миқая пайғамбар патшаның алдына келгенде, патша оған: — Миқая, біздің Ғилақадтағы Рамот қаласы үшін шайқасуымыз қажет пе? Әлде содан бас тартайын ба? — деген сауал қойды. Миқая (сықақтап) былай деп жауап берді: — Өрлеп аттаныңыз, жеңіске жетесіз! Жаратқан Ие қаланы қолыңызға түсіреді! —"},
	{15, "15 Ал Ахаб патша оған: — Жаратқан Иенің атынан тек шындықты ғана айт деп саған қанша рет бұйыруға тиіспін? — деп ескертті."},
	{16, "16 Сонда Миқая былай деді: — Мен (бір бейнелі көріністе) бүкіл Исраилдің бағушысы жоқ қойлар сияқты қыраттарда бытырап жүргенін көрдім. Жаратқан Ие мынаны айтты: Бұлардың қожайыны жоқ екен. Дұрысы, барлығы да үйлеріне тыныштықпен қайтсын!"},
	{17, "17 Солтүстік Исраилдің патшасы Ахаб Жосапатқа: Ол мен туралы әрдайым жақсы емес, тек жағымсыз пайғамбарлық сөздерді ғана айтады демеп пе едім?! — деп налыды."},
	{18, "18 Ал Миқая сөзін жалғастырып былай деді: — Сондықтан Жаратқан Иенің сөзін тыңдаңыздар! Мен Өзінің тағында отырған Жаратқан Иенің аянын көрдім. Көктегілердің бүкіл тобы Оның оң және сол жақтарында тұрды."},
	{19, "19 Сонда Жаратқан Ие: Исраилдің патшасы Ахабты Ғилақадтағы Рамотқа өрлеп аттанып, сол жерде қаза табуға қайсың сендіресіңдер? деген сауал қойды. Біреуі ананы, біреуі мынаны айтты."},
	{20, "20 Ақыры бір рух ортаға шыға келді де, Жаратқан Иенің алдында тұра қалып: Оны мен сендіремін деп ұсынды. Жаратқан Ие одан: Соны қалай істемексің? деп сұрағанда,"},
	{21, "21 рух: Мен сол жерге барып, Ахабтың барлық пайғамбарларының аузындағы өтірік хабар айтқызатын рух боламын! деп жауап берді. Сонда Жаратқан Ие: Сен оны сендіріп, табысты боласың. Бар да солай істе! деп шешті."},
	{22, "22 Ал енді, міне, қараңыз: Жаратқан Ие мына барлық пайғамбарларыңыздың ауыздарына өтірік хабар айтқызатын рухты салып қойған. Себебі Жаратқан Ие сіздің басыңызға пәле түсетінін алдын ала кесіп қойды!"},
	{23, "23 Сол сәтте Хенаған ұлы Седекиях Миқаяның қасына барып, оны бетінен шапалақпен тартып жіберіп: — Жаратқан Иенің Рухы сен арқылы сөйлеу үшін менен қалай ғана шығып кетті екен, ә?! — деп сөкті."},
	{24, "24 Миқая оған: — Соны ішкі бөлмеге кіріп, тығылған күніңде білетін боласың! — деп жауап берді."},
	{25, "25 Ал Ахаб патша былай деп әмір етті: — Миқаяны ұстаңдар! Оны қала әкімі Амонға және патшазада Жоғасқа қайтарып алып барыңдар!"},
	{26, "26 Оларға былай деңдер: Патшаның бұйрығы мынау: Осы адамды түрмеге жабыңдар! Мен аман-есен қайтып келгенше, оған біразырақ нан мен су ғана беріңдер! —"},
	{27, "27 Сонда Миқая оны сақтандырып: — Егер де шынымен аман-есен қайтып келсеңіз, онда Жаратқан Иенің мен арқылы сөйлемегені! Айтқандарыма құлақ түріңдер, уа, барлық халықтар! — деді."},
	{28, "28 Сонда да Солтүстік Исраилдің патшасы Ахаб пен Яһуда елінің патшасы Жосапат әскерлерін ертіп Ғилақадтың таулы аймағындағы Рамот қаласына өрлеп аттанды."},
	{29, "29 Ахаб Жосапатқа: Мен шайқасқа патшалық киімдерімді кимей-ақ шығайын, ал сіз киіп шығыңызшы, — деп ұсынған еді. Содан Ахаб патша өзін ешкім танып қоймасын деп киімін өзгертіп, барлығы шайқасқа шықты."},
	{30, "30 Арама патшасы өзінің соғыс күймелерін басқаратын басшыларына: Не жасақшылардың біреуімен, не қайсыбір басшымен емес, тек Солтүстік Исраилдің патшасының өзімен ғана шайқасып, соның көзін құртыңдар! — деп бұйырып қойған болатын."},
	{31, "31 Сол себепті соғыс күймелерін жүргізетіндер (патшалық киімдерін киген) Жосапатты көргенде, Бұл әрине Солтүстік Исраилдің патшасы! — деп айқай салды. Содан олар оған қарай бұрылып, бас салды. Ал Жосапат (өз ұранын) айқайлап жіберді. Құдай Ие оған жар болып, бас салушыларды оның қасынан басқа жаққа бұрып алып кетті."},
	{32, "32 Өйткені күйме жүргізушілер оның Солтүстік Исраилдің патшасы емес екенін аңғарып, одан кері қайтып, жібере салды."},
	{33, "33 Ал бір жасақшы садағын кездейсоқ ата салғанда, жебесі Солтүстік Исраилдің патшасы Ахабқа дәл тиіп, оның сауытының қосылған жеріне қадалды. Сонда Ахаб өзінің соғыс күймесін жүргізушіге бұйырып: Күймені бұр да, мені шайқастан алып шық! Жараланып қалдым, — деді."},
	{34, "34 Күні бойы қатты ұрыс болып, Ахаб патша арамалықтарға қарама-қарсы өз күймесінің ішінде тік тұрғызылған қалпы кешке дейін қала берді. Қансыраған патша күн батқан кезде өлді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct kk19 poems[] = {
	{1, "1 Ал Яһуда елінің патшасы Жосапат Иерусалимдегі сарайына аман-есен қайта оралды."},
	{2, "2 Сонда Ханани ұлы Еху атты пайғамбар оның алдынан шығып, былай деді: Зұлым адамды қолдап, Жаратқан Иені жек көретіндерді жақсы көргеніңіз дұрыс па?! Осыны істегеніңіз арқылы өзіңізге қарсы Жаратқан Иенің қаһарын туғыздыңыз."},
	{3, "3 Алайда сізден біраз жақсылық та табылды. Сіз Ашераға бағышталған ағаш бағаналарды елден құртып жоқ қылдыңыз, әрі шын жүректен Құдайға бет бұрып сиынған едіңіз, — деді."},
	{4, "4 Мұнан кейін Жосапат патша астанасы Иерусалимде тұрып қалды. Дегенмен патша жолға шығып, оңтүстіктегі Бер-Шебадан солтүстіктегі Ефремнің қыратты жеріне дейін тұратын халқын аралап та отырды. Оларды ата-бабаларының Құдайы Жаратқан Иеге кері қайтып, Оған ғана бағышталуға шақырды."},
	{5, "5 Патша бүкіл елдегі бекіністі қалаларда төрешілер тағайындап,"},
	{6, "6 оларға былай деп бұйырды: Істейтін істеріңе мұқият көңіл бөліп жүріңдер! Себебі адамның емес, Жаратқан Иенің атынан төрелік етесіңдер. Сендер үкім шығарған кезде Жаратқан Ие қастарыңда болады."},
	{7, "7 Сондықтан Жаратқан Иені терең қастерлеп, зұлымдық атаулыдан шошыныңдар! Іс-әрекетеріңе мұқият назар аударыңдар! Біздің Құдайымыз Жаратқан Ие әділетсіз үкім, бет-жүзге қарау, пара алу дегеннің бірде-біреуіне төзбейді!"},
	{8, "8 Жосапат патша, сондай-ақ, Иерусалимде бірқатар леуіліктер мен діни қызметкерлерді және Исраилдің бірнеше әулет басшыларын да төреші етіп тағайындады. Олар Жаратқан Иенің Таурат заңына байланысты және өзге де даулар жайлы шешім қабылдауға міндетті болды. Олардың қызмет көрсететін жері Иерусалим қаласы еді."},
	{9, "9 Патша оларға нұсқау беріп былай деді: Әрдайым Жаратқан Иені терең қастерлеп, міндеттеріңді адалдықпен және шын жүректен атқарыңдар!"},
	{10, "10 Өз қалаларында тұратын яһудалықтар сендерге қандай да бір даумен келе қалса: не төгілген қан туралы болсын, не Жаратқан Иенің Таурат заңы, өсиеттері, ережелері және шешімдері туралы болсын, оларға: Жаратқан Иеге қарсы күнә жасамауларың керек! деп қатты ескертіңдер! Әйтпесе Оның қаһары сендерге және сол адамдарға төнеді. Ал осылай істейтін болыңдар, онда кінәлі болмайсыңдар."},
	{11, "11 Жаратқан Иенің Таурат заңына байланысты барлық мәселелерді шешуде сендерге бас діни қызметкер Амариях жетекші болады. Ал патшаға байланысты барлық мәселелерді шешуге Яһуданың рубасысы Ысмағұл ұлы Забадиях басшылық етеді. Леуіліктер сендерге басқару жағынан көмек көрсететін болсын. Батылдықпен әрекет етіңдер! Жаратқан Ие ізгілік істеушілерге жар болсын!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct kk20 poems[] = {
	{1, "1 Осылардан кейін моабтық пен аммондық әскерлері бірсыпыра меундіктермен қосылып, Жосапат патшаға қарсы соғысқа шықты."},
	{2, "2 Бірнеше адам Жосапаттың алдына келіп, мына хабарды жеткізді: Сізге қарсы Өлі теңіздің оңтүстік жағындағы Едом елінен үлкен қол келе жатыр! Қазірдің өзінде олар Хасасон-Тамарға жетіп қалды! Сол жер Ен-Геді деп те аталатын."},
	{3, "3 Жосапат қатты қауіптеніп Жаратқан Иеге бет бұрып, Оның еркін сұрап сиынды. Патша, сондай-ақ, бүкіл Яһуда елінде ораза тұту керек деген жарлық та шығарды."},
	{4, "4 Сонда Яһуда халқы Жаратқан Иеден көмек сұрау үшін елдің күллі қалаларынан ағылып келіп, Иерусалимге жиналды."},
	{5, "5 Жосапат Яһуда мен Иерусалим халқының жиналысында Жаратқан Иенің киелі үйінің жаңа ауласында тұрып, былай деп дұға етті:"},
	{6, "6 Уа, Жаратқан Ие, ата-бабаларымыздың сиынған Құдайы! Көктегі Құдай Сен емессің бе? Барлық халықтардың патшалықтарына Сен билік жүргізесің. Күш-қуат пен құдірет Сенің қолыңда, ешкім де Саған қарсы тұра алмайды."},
	{7, "7 Уа, Құдайымыз, осы елдің бұрынғы тұрғындарын өз халқың Исраилдің алдынан қуып шығып, елді өз досың Ыбырайымның ұрпақтарына мәңгілікке табыстаған Сен емессің бе?"},
	{8, "8 Содан халқың осы елге қоныстанып, Сенің есіміңе арнап мына киелі үйді салды да, Саған былай деп сиынды:"},
	{9, "9 Егер басымызға бір апат: соғыс, індет немесе аштық түсе қалса, осы киелі үйіңе келіп, Сенің алдыңда тұратын боламыз. Өйткені осы үй Сенің атыңмен аталған. Біз қиыншылық көріп, Саған жалбарынған кезімізде Сен бізді естіп, құтқаратын боласың."},
	{10, "10 Ал енді, Аммон мен Моаб елдерінен және Сейір тауынан аттанып келген сол жасақшылардың не істеп жатқандарына назар аудара көрші! Ежелде Исраил халқы Мысырдан көшіп шыққанда Сен халқыңа сол ұлттардың жерлеріне басып кіруге тыйым салғансың. Халқың сырт айналып өтіп, соларды құртып жібермеді."},
	{11, "11 Енді, міне, солардың ұрпақтары біздің жақсылығымызға жамандықпен жауап беріп отыр. Өзің бізге мұралық меншігіміз болуға табыстаған Сенің осы еліңнен олар бізді қуып шығу үшін аттанып келе жатыр!"},
	{12, "12 Уа, Құдайымыз, Сен оларға үкім шығара гөр! Бізге қарсы аттанып келе жатқан осы ғаламат зор тобырдың алдында әлсізбіз. Не істерімізді білмей, Саған қарап Өзіңе үміт артамыз."},
	{13, "13 Осы кезде Яһуданың күллі халқы кішкентай нәрестелері, әйелдері және балаларымен бірге Жаратқан Иенің алдында тұрды."},
	{14, "14 Сонда Жаратқан Иенің Рухы жамағаттың ортасында тұрған Яхазиелге қонды. Асафтың үрім-бұтағынан шыққан сол леуілік Маттанияхтың шөпшегі, Игиелдің шөбересі, Бенаяхтың немересі, Зәкәрияның ұлы еді."},
	{15, "15 Яхазиел жамағатқа тіл қатып былай деді: — Тыңдаңдар, бүкіл Яһуда мен Иерусалимнің тұрғындары! Жосапат патша, сіз де тыңдаңыз! Жаратқан Ие мынаны айтады: Сол қалың тобырдан үрейленіп қорықпаңдар! Бұл шайқасты сендер емес, Құдайдың Өзі жүргізеді!"},
	{16, "16 Ертең оларға қарсы шығыңдар! Олар Систегі өрлеу жолымен келе жатыр. Еруел даласына апаратын сайдың соңына таман оларды кездестіресіңдер."},
	{17, "17 Осы жолы шайқасатын сендер емессіңдер. Тек сол жерге барып, берік тұрыңдар! Сонда Жаратқан Иенің өздеріңді құтқаруын көресіңдер, уа, Яһуда мен Иерусалим халқы! Үрейленіп қорықпаңдар! Ертең оларға қарсы шығыңдар! Жаратқан Ие сендермен бірге жүріп жар болады."},
	{18, "18 Сонда Жосапат басын жерге дейін иді, жиналған Яһуда мен Иерусалим халқы да Жаратқан Иенің алдында етпетінен жерге жатып, Оны дәріптеді."},
	{19, "19 Қахат пен Қорахтан тараған леуіліктер біраздан кейін орындарынан тұрып, Исраилдің Құдай Иесін бар дауыстарымен мадақтай берді."},
	{20, "20 Яһуда жасағы келесі күні ерте тұрып, Текоя маңындағы елсіз далаға шықты. Шығып бара жатқан кезде Жосапат оларға тіл қатып былай деді: Уа, Яһуда мен Иерусалимнің тұрғындары, сөзіме құлақ салыңдар! Құдайларың Жаратқан Иеге сенім артыңдар! Сонда берік боласыңдар. Оның пайғамбарларына да сеніңдер! Сонда табысқа жетесіңдер! —"},
	{21, "21 Патша халықпен кеңесіп алып, әскердің алдында жүретін әншілерді тағайындаған еді. Арнайы салтанатты киім киіп алған олар Жаратқан Иеге ән-жырмен мақтау айтып жүрді: Мадақтаңдар Жаратқан Иемізді, мәңгіге ұласады Оның мейірімі!"},
	{22, "22 Олар қуанышты да лепті үнмен ән-жыр айтып, мадақтай бастаған сәтте Жаратқан Ие Яһуда еліне қарсы Аммон мен Моаб елдерінен және Сейір тауынан аттанып келген жауынгерлерге тұтқиылдан тап беріп, олардың өз араларында келіспеушілік туғызды. Содан олар талқандалды."},
	{23, "23 Себебі аммондық және моабтық жасақшылар Сейір тауын мекендейтін жасақшыларға жолда бас салып, оларды қырып тастады. Соларды құртып болған соң, олар өзара да шайқасып, бір-бірін құртып жоя бастады."},
	{24, "24 Яһудалықтар шөл даладағы бақылау мұнарасына жетіп, жау тобырына көз тастағанда, олардың бәрінің жерде сұлап жатқан денелерін көрді. Бірде-біреуі қашып құтылмапты."},
	{25, "25 Жосапат пен қасындағы әскері олардан қалғанды олжалауға келгенде, мол құрал-сайман, киім-кешек және өзге де құнды заттардың үстінен түсті. Олар бұларды көтеріп жүре алғандарынша әкетті. Олжаның көп болғаны сонша, оның бәрін жинап, тасып әкетуге үш күн қажет болды."},
	{26, "26 Төртінші күні халық Бераха аңғарында жиналды. Сол жерде олар Жаратқан Иені мадақтап, ризашылықтарын білдірді. Сондықтан осы аңғар күні бүгінге дейін Бераха (яки Мадақ, Береке) деп аталып келеді."},
	{27, "27 Содан соң Яһуда мен Иерусалимнің адамдары Жосапаттың соңынан еріп, зор қуанышпен Иерусалимге қайта оралды. Себебі Жаратқан Ие халқының жауларын жеңіп, оларды шаттыққа кенелткен еді."},
	{28, "28 Олар Иерусалим қаласына кіріп, Жаратқан Иенің киелі үйіне барғанда, леуіліктер шертерде, жетігенде ойнап, керней тартумен болды."},
	{29, "29 Күллі елдер мен патшалықтар Исраилдің жауларына қарсы Жаратқан Иенің Өзі соғысқанын естігенде қатты қорқып қалды."},
	{30, "30 Содан Жосапаттың патшалығындағы халық бейбіт өмір сүрді. Себебі Құдай оларды барлық жағынан қорғап, тыныштық сыйлады."},
	{31, "31 Жосапат Яһуда еліне осылайша билік жүргізді. Патша болған кезде ол отыз бес жаста еді. Жосапат Иерусалимде жиырма бес жыл билік жүргізді. Оның шешесінің аты-жөні Сілхи қызы Азуба болатын."},
	{32, "32 Жосапат әкесі Асаның жолымен жүріп, одан еш таймай, Жаратқан Иеге ұнамды әділ істер істеді."},
	{33, "33 Алайда оның заманында биіктеу жерлердегі табыну орындары қиратылмай қала берді. Халық ата-бабаларының сиынған Құдайына әлі де шын жүректен сенімдерін артпаған еді."},
	{34, "34 Жосапаттың қалған іс-әрекеттері басынан аяғына дейін Ханани ұлы Еху пайғамбардың жылнамаларында баяндалған. Олар Исраилдің патшаларының кітабына енгізілген."},
	{35, "35 Кейінірек Яһуда патшасы Жосапат Солтүстік Исраилдің көп зұлымдық жасаған патшасы Охозияхпен одақтасты."},
	{36, "36 Жосапат онымен келісіп, алысқа жүзіп бара алатын үлкен сауда кемелерін жасатты. Мұны (Қызыл теңіздің бір шығанағында орналасқан) кеме тоқтайтын Есион-Гәбер қаласында істетті."},
	{37, "37 Ал марешалық Додауа ұлы Елиезер Жосапатқа Құдайдың хабарын жеткізіп: Сіздің Охозияхпен одақтасқаныңызға бола Жаратқан Ие осы ісіңізді құртатын болады! — деді. Содан кемелер апатқа ұшырап, алыс сапарға шыға алмай қалды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct kk21 poems[] = {
	{1, "1 Жосапат көз жұмып, ата-бабаларының қасына жөнелгенде, мәйіті олардың жанына Дәуіттің шаһарындағы қабірге қойылды. Оның ұлы Жорам орнын басып патша болды."},
	{2, "2 Жорамның туған інілері Азариях, Ехиел, Зәкәрия, Азарияху, Михайл, Шафатиях еді; бұлардың бәрі Яһуда патшасы Жосапаттың ұлдары болатын."},
	{3, "3 Жосапат көзі тірісінде оларға мол алтын-күміс пен құнды дүние-мүлік сыйлап, оның үстіне Яһудадағы бірнеше бекіністі қалаларды да енші ретінде берген еді. Ал Жорам тұңғышы болғандықтан, әкесі патшалықты оған қалдырып кетті."},
	{4, "4 Бірақ Жорам әкесінің орнына патшалық құрып, жағдайын нығайтып алғаннан кейін, барлық інілерін және Исраилдің бірсыпыра әміршілерін семсермен өлтіріп тастады."},
	{5, "5 Жорам Яһуда елінің патшасы болған кезде жасы отыз екіде еді. Ол Иерусалимде сегіз жыл билік жүргізді."},
	{6, "6 Ахабтың әулеті сияқты, Жорам да Солтүстік Исраилдің патшаларының теріс жолымен жүрді, себебі оның әйелі Ахабтың қызы болатын. Содан Жорам Жаратқан Иеге жек көрінішті істер істеді."},
	{7, "7 Сонда да Жаратқан Ие Өзінің Дәуітпен жасаған Келісіміне бола Дәуіттің әулетін жоюды қаламады. Ол Дәуітке және оның келешек ұрпақтарына ұдайы (патшалық құрып) шам-шырақ іспетті нұр шашуға мүмкіндік беру жайлы уәде еткен болатын."},
	{8, "8 Жорамның заманында Едом халқы Яһуда патшалығының үстемдігіне қарсы бас көтеріп, өздеріне патша тағайындап алды."},
	{9, "9 Сонда Жорам өзінің қолбасшыларымен, барлық соғыс күймелерімен шекарадан өтіп оларға қарсы аттанды. Бірақ едомдықтар оның өзін және соғыс күймелерінің айдаушыларын қоршап алды. Олар түнде тұрып, едомдықтардың қоршауын бұзып шығып, құтылды."},
	{10, "10 Содан бері Едом халқы осы күнге дейін Яһуданың үстемдігіне қарсы бас көтеріп келеді. Сол кезде (філістір елінің шекарасындағы) Либна қаласы да Жорамның билігіне қарсы шықты. Жорам ата-бабаларының сиынған Құдайы Жаратқан Иеден бас тартқандықтан осы оқиғалар болды."},
	{11, "11 Жорам мұнымен ғана қоймай, Яһуданың таулы аймағындағы биіктеу жерлерде табыну орындарын тұрғызып, соларда Иерусалимнің тұрғындарын және Яһуданың халқын жалған тәңірлерге беріліп, азғындыққа жетеледі."},
	{12, "12 Жорамға Ілияс пайғамбардан хат келді. Онда былай деп жазылған болатын: Түп атаңыз Дәуіттің сиынған Құдайы Жаратқан Ие мынаны айтады: Сен әкең Жосапат және атаң — Яһуда патшасы Аса іспетті Менің жолыммен жүрген жоқсың."},
	{13, "13 Керісінше, Солтүстік Исраилдің патшаларының теріс жолымен жүріп келесің. Ахабтың әулеті Солтүстік Исраилдің халқын азғырғандай, сен де Яһуда мен Иерусалимнің халқын азғындыққа жетеледің. Оның үстіне өзіңнің бір әкеден туған, сенен ізгі болған інілеріңді өлтіріп тастадың."},
	{14, "14 Сондықтан Жаратқан Ие сенің халқыңа, балаларыңа, әйелдеріңе және барлық дүние-мүлкіңе зор апат жіберетін болады."},
	{15, "15 Өзің жаман ішек ауруына шалдығасың. Осы ауруың күн сайын асқынып, соңында ішектерің денеңнен шығып қалады!"},
	{16, "16 Мұнан кейін Жаратқан Ие Жорамға қарсы філістірлердің және құштықтармен шекараласқан арабтардың ашу-ызасын туғызды."},
	{17, "17 Олар Яһудаға шабуыл жасап, елге басып кірді де, патшаның сарайынан тапқан қымбат дүние-мүліктің бәрін де, оның балалары мен әйелдерін де алып кетті. Тек Жорамның Охозиях есімді кенже ұлы ғана өзінде қалды."},
	{18, "18 Осы күллі оқиғалардан соң Жаратқан Ие Жорамның ішектеріне жазылмайтын бір ауру жіберді."},
	{19, "19 Біраз уақыттан кейін, толық екі жыл өткенде, оның ішектері түгелімен денесінің сыртына шығып, ол қатты қиналып жан тапсырды. Оның ата-бабалары қабірге қойылған кезде олардың құрметіне от жағу рәсімі жасалатын. Бірақ Жорамның құрметіне сол рәсім жасалған жоқ."},
	{20, "20 Жорам патша болған кезде жасы отыз екіде еді. Ол Иерусалимде сегіз жыл билік жүргізді. Жорам дүниеден қайтқанда ешкім оны жоқтамады. Оның мәйіті Дәуіттің шаһарында жерленсе де, патшаларға арналған қабірлердің біріне қойылған жоқ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct kk22 poems[] = {
	{1, "1 Иерусалимнің тұрғындары Жорам патшаның кенже ұлы Охозияхты әкесінің орнына патша етіп қойды. Себебі бір тонаушылар тобы көшпенді тайпалармен бірігіп Яһуданың әскер қосына тап бергенде патшаның Охозияхтан үлкен ұлдарының барлығын да өлтіріп тастаған еді. Сондықтан Жорамның кенже ұлы Охозиях Яһуда елінің патшасы болды."},
	{2, "2 Сол кезде Охозияхтың жасы жиырма екіде еді. Ол Иерусалимде бір жыл билік жүргізді. Оның шешесі (Солтүстік Исраилдің бұрынғы патшасы) Омридың немере қызы Аталия еді."},
	{3, "3 Охозиях (өзінің нағашылары) Ахабтың әулетінің азғын жолымен жүрді, себебі оның шешесі Аталия осыған түрткі салып, отыратын."},
	{4, "4 Әкесі қайтыс болғаннан кейін Охозияхтың сорына қарай Ахабтың әулеті оған кеңесші болғандықтан, патша соларға ұқсап Жаратқан Иеге жек көрінішті істер істеді. Осының бәрі ақырында оның түбіне жетті."},
	{5, "5 Сонда ол тіпті нағашыларының кеңесіне құлақ асып, Солтүстік Исраилдің патшасы Ахаб ұлы Жорамға еріп Арама патшасы Хазаилмен соғысуға Ғилақадтағы Рамотқа аттанды. Арамалықтар шайқаста Жорамды жарақаттады."},
	{6, "6 Жорам жарақаттарынан емделіп жазылу үшін Ізрел қаласына қайта оралды. Сондықтан Яһуда патшасы Охозиях оның халін сұрап қайтпаққа Ізрелге ылдилап барды."},
	{7, "7 Ал Құдай Охозияхтың Жорамға келіп, сонда өлуі керек деп ұйғарып қойған еді. Охозиях Ізрелге жеткеннен кейін, Жорамға еріп соның қолбасшысы Німши ұлы Ехуді қарсы алуға шықты. Жаратқан Ие Ехуге Ахабтың әулетін құртуды тапсырып, оны соған тағайындап қойған болатын."},
	{8, "8 Еху Құдайдың Ахабтың әулетіне шығарған үкімін орындап жатқан осы кезде, ол Охозияхқа еріп келген Яһуданың бірнеше әміршісін және Охозияхтың бауырларының ұлдарын кездестіріп, олардың көздерін құртты."},
	{9, "9 Еху Охозияхтың өзіне де іздеу салды. Охозиях Самария қаласында тығылып отырған жерінен табылып, Ехуге әкелінді. Еху Охозияхты да өлімге кесті. Кейін халық: Ол — кезінде Жаратқан Иеге шын жүректен бет бұрып мойынсұнған Жосапаттың немересі ғой, — деп ескеріп, мәйітін құрметпен қабірге қойды. Осылайша Охозияхтың әулетінен патшалық құруға қабілетті ешкім де қалмады."},
	{10, "10 Шешесі Аталия өз ұлы Охозияхтың өлгені туралы білген соң, Яһуда елінің патша тұқымына жататын басқалардың бәрін де өлтіруге әрекеттенді."},
	{11, "11 Алайда Ехосабет Охозияхтың кенже ұлы Жоғасты өлімге бұйырылған патшазадалардың арасынан ұрлап алып кетіп, бөбекті оның бағушы әйелімен бірге ғибадатханадағы бір ұйықтайтын бөлмеге тығып қойды. Осы Ехосабет Жорам патшаның қызы, Охозиях марқұмның туған әпкесі және діни қызметкер Еходайдың әйелі болатын. Сондықтан ол немере інісі Жоғасты Аталиядан жасырып, өлімнен аман алып қалды."},
	{12, "12 Аталия Яһуда еліне билік жүргізген алты жыл бойы патшазада Жоғас Ехосабеттің отбасында Құдайдың ғибадатханасында жасырынып қала берді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view23() {
struct kk23 poems[] = {
	{1, "1 Ал жетінші жылы діни қызметкер Еходайдың ықпалы күшейіп, әрекет етуге шешім қабылдады. Содан ол мына жүзбасылармен кеңесіп, келісім жасады: Жорам ұлы Азариях, Жоханан ұлы Ысмағұл, Ғабит ұлы Азариях, Адаях ұлы Мағасиях, Зіхри ұлы Елішапат."},
	{2, "2 Осы жүзбасылар Яһуда елін құпия аралап шығып, барлық қалалардағы леуіліктерді және Исраилдің әулет басшыларын жиналуға шақырды. Бұлар Иерусалимге жеткен соң,"},
	{3, "3 бүкіл жамағат Құдайдың киелі үйінде жас патша Жоғаспен келісім жасады. Еходай оларға былай деп нұсқады: Мынау патшаның ұлы! Жаратқан Ие Дәуіттің ұрпақтары жайлы уәде еткендей, мұның патшалық құруы керек!"},
	{4, "4 Енді мынаны істеулерің қажет: Діни демалыс күні қызметке келетін леуіліктер мен діни қызметкерлер, сендердің үштен бірің қақпаларды күзетіңдер!"},
	{5, "5 Келесі үштен бірің патша сарайын күзетіңдер! Ал соңғы үштен бірің Түпнегіз қақпасында күзетте тұрыңдар! Бүкіл халық Жаратқан Иенің киелі үйінің аулаларында тұрсын."},
	{6, "6 Бірақ Жаратқан Иенің киелі үйіне сонда қызмет көрсететін діни қызметкерлер мен леуіліктерден басқа ешкімді кіргізбеңдер! Арнайы тазару рәсімінен өткен сол діни қызметкерлер мен леуіліктер кіре берсін. Қалған халық Жаратқан Иенің берген ережелерін сақтап киелі үйдің сыртында тұрсын!"},
	{7, "7 Леуіліктер қаруларын қолдарына ұстап алып патшаны айналдыра қоршап тұрсын! Кімде-кім киелі үйге рұқсатсыз кіріп келсе, соның көзін құртыңдар! Патша қайда бармасын, сендер де оның жанында болып бірге жүріңдер!"},
	{8, "8 Леуіліктер және Яһуданың барлық әулет басшылары діни қызметкер Еходайдың нұсқауларын түгелдей орындады. Олар діни демалыс күні қол астындағы адамдарының барлығын: қызметтерін сол күні бастайтындарын да, аяқтайтындарын да ертіп алып келді. Себебі діни қызметкер Еходай олардың ешбір тобын қызметтен босатпаған еді."},
	{9, "9 Еходай жүзбасыларға ежелде Дәуіт патшанікі болған, содан бері Құдайдың ғибадатханасында сақталып келе жатқан сүңгілерді және қалқандардың үлкен, кіші түрлерін үлестіріп берді."},
	{10, "10 Ол сонымен қатар патшаға жан-жағынан қорған болу үшін барлық ер адамдарды қолдарына қару ұстатып, киелі үйдің оң жағынан сол жағына және құрбандық үстеліне дейін айналдыра шеп құрғызып орналастырды."},
	{11, "11 Содан соң діни қызметкер Еходай мен оның ұлдары патшазада Жоғасты алып шығып, басына тәж кигізді де, қолына Келісімнің айғағын ұстатты. Олар Жоғасқа май жағу рәсімін орындап, оны патша етіп жариялады. Барлығы: Патша жасасын! — деп ұрандап айқай салды."},
	{12, "12 Халықтың жүгіріп келіп, патшаны мадақтаған дауыстарын Аталия да естіді. Содан ол бұның мән-жайын білу үшін халық жиналып тұрған Жаратқан Иенің ғибадатханасына қарай жөнелді."},
	{13, "13 Қараса, жас патшаның дәстүрге сай киелі үйдің кіреберісіндегі бағананың жанында тұр екен. Оның қасында басшылар мен кернейшілер тұрды. Бүкіл елден жиналған халық шаттана айқайлап, керней тартып жатты. Әнші-күйшілер саз аспаптарымен мадақтауды жетелеп жүрді. Аталия қатты ашуланып, көйлегінің өңірін айыра жыртып: Қастандық, қастандық! — деп айқайлап жіберді."},
	{14, "14 Діни қызметкер Еходай сақшылардың жүзбасыларын алға шығарып: Оны сақшылар қатарларының арасымен алып шығыңдар! Егер әлдебіреу оған еретін болса, соның көзін құртыңдар! — деп бұйырды. Сондай-ақ: — Оны Жаратқан Иенің киелі үйінде өлтірмеңдер! — деп те қосты."},
	{15, "15 Сақшылар Аталияны ұстап алып, патша сарайының ауласына аттарды кіргізетін қақпаға әкетіп, сол жерде көзін құртты."},
	{16, "16 Діни қызметкер Еходай халықпен және патшамен Біз Жаратқан Иенің халқы боламыз деген келісім жасасты."},
	{17, "17 Содан бүкіл халық Бағал атты жалған тәңірге арналған ғибадатханаға барып, оны қиратты. Олар ондағы құрбандық үстелдері мен тәңір мүсіндерін талқандап, сол құрбандық үстелдерінің алдында Бағалдың абызы Матанның көзін құртты."},
	{18, "18 Бұдан кейін діни қызметкер Еходай діни қызметкерлер мен леуіліктерге Жаратқан Иенің киелі үйін қарауды міндеттеді. Ежелде Дәуіт патша оларға Жаратқан Иенің киелі үйіндегі қызметтерді үлестіріп берген еді. Олар Мұса арқылы тапсырылған Таурат заңы бойынша шалынып, өртелетін құрбандықтарды ұсынуға да, Дәуіт патшаның қалдырып кеткен нұсқауына сай қуанышты ән-жыр айтуға да міндетті болды."},
	{19, "19 Сонымен қатар Еходай Жаратқан Иенің киелі үйінің қақпаларына күзетшілер қойды. Олар (Таураттың ережелері бойынша) қандай себеппен болмасын таза емес деп саналатын адамдарды кіргізбеуге тиісті еді."},
	{20, "20 Еходай өзімен бірге жүзбасыларын, ақсүйектерді, әкімдерді және бүкіл елдің халқын ілестіріп, патшаны Жаратқан Иенің киелі үйінен алып шығып, барлығы Жоғарғы қақпадан өтіп, патша сарайына кірді. Сол жерде патшаны өзінің патшалық тағына отырғызды."},
	{21, "21 Елдің күллі халқы бұған шат-шадыман болып қуанды. Аталия семсермен өлтірілгеннен кейін қала сабасына түсіп тыншыды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view24() {
struct kk24 poems[] = {
	{1, "1 Жоғас Яһуда елінің патшасы болған кезде жасы жетіде еді. Ол Иерусалимде қырық жыл билік жүргізді. Оның шешесінің аты-жөні бер-шебалық Сибия болатын."},
	{2, "2 Діни қызметкер Еходайдың тірі кезінде Жоғас Жаратқан Иеге ұнамды әділ істер істеді."},
	{3, "3 Еходай оған екі әйел таңдап алып берді. Жоғас олардан ұл-қыздар сүйді."},
	{4, "4 Біраз уақыт өткеннен кейін Жоғас Жаратқан Иенің киелі үйін жөндеуден өткізуді ұйғарды."},
	{5, "5 Патша леуіліктер мен діни қызметкерлерді жинап, оларға былай деп тапсырды: Жыл сайын Яһуда елінің қалаларына шығып, Құдайдың киелі үйін жөндеп жаңартуға қажетті күмісті бүкіл Исраил халқынан жинаңдар! Осы істі тездетіп істеп келіңдер! — деп тапсырды. Бірақ леуіліктер бұны дереу істеген жоқ."},
	{6, "6 Содан патша діни қызметкер Еходайды қасына шақырып, оған былай деді: Сендер жан басы салығын Яһуда мен Иерусалимнен жинауды леуіліктерден неге талап етпедіңдер? Жаратқан Иенің қызметшісі Мұса ежелде осы салықты Келісімнің куәлігі сақталған киелі шатырға арнап Исраил халқынан жинауды белгілеген еді ғой."},
	{7, "7 Зұлым Аталияның балалары Жаратқан Иенің киелі үйіне бұзып кіріп, одан тек Құдайға ғана бағышталған арнайы бұйымдарды алып кеткен еді. Оларды Бағал атты тәңірсымақтың мүсіндеріне табыну үшін қолданатын."},
	{8, "8 Содан патша бұйрық беріп, ұсталарға бір жәшікті жасатып, Жаратқан Иенің киелі үйіне кіретін қақпаның сырт жағына қойды."},
	{9, "9 Мұнан кейін бүкіл Яһуда елі мен Иерусалим қаласында мынадай жарлық шықты: Құдайдың қызметшісі Мұса Исраил халқына иен даланы кезіп жүрген заманда салған жан басы салығы Жаратқан Иеге арналып қайтадан әкелінсін!"},
	{10, "10 Сонда күллі басшылар мен халық ризашылықпен жан басы салықтарын әкеліп, жәшікке салып, оны толтырып тастады."},
	{11, "11 Жәшікте күміс көп жиналған сайын леуіліктер оны патша тағайындаған басқарушының кеңсесіне алып баратын. Сол жерге патшаның хатшысы және бас діни қызметкердің арнайы басқарушысы да келетін. Олар жәшікті бірге босатып, ғибадатханадағы өз орнына қайта апарып қоятын. Осыны күн сайын істеп, олар мол күміс жинады."},
	{12, "12 Патша мен діни қызметкер осы күмісті Жаратқан Иенің киелі үйіндегі жөндеу жұмыстарын басқарушыларға тапсыратын. Басқарушылар соған ғибадатхананы жөндейтін тас қалаушылар мен ағаш ұсталарын және темір, қоламен ғимаратты темір, қола тіректермен нығайтатын шеберлерді жалдап алды."},
	{13, "13 Жұмысшылар жан сала еңбек етіп, іс алға басты. Олар Құдайдың киелі үйін бекітіп бұрынғы қалпына келтірді."},
	{14, "14 Жұмыс аяқталғаннан кейін қалған күміс патша мен Еходайға әкелінді. Олар содан Жаратқан Иенің киелі үйіне қажетті құрал-жабдықтарды: қызмет өткізіп, құрбандықтарды шалып, өртеуге арналған бұйымдарды, алтын мен күмістен жасалған табақтар мен өзге де ыдыстарды жасатты. Еходайдың көзі тірі кезінің бәрінде Жаратқан Иенің киелі үйінде шалынып, түгелдей өртелетін құрбандықтар тоқтаусыз ұсынылып отырды."},
	{15, "15 Осылай Еходай көп жасап қартайып, қайтыс болды. Сол кезде оның жасы жүз отызда еді."},
	{16, "16 Еходайдың Исраилге, Құдайға және Оның киелі үйіне жасаған ізгі қызметі үшін халық оның мәйітін Дәуіттің шаһарындағы патшалар зиратындағы бір қабірге қойды."},
	{17, "17 Ал діни қызметкер Еходай қайтыс болғаннан кейін, Яһуда елінің басшылары Жоғас патшаның алдына келіп, бастарын иіп, патшаны өздерінің айтқандарына құлақ асуға көндірді."},
	{18, "18 Содан олар ата-бабаларының сиынған Құдайы Жаратқан Иенің киелі үйін ескерусіз қалдырып, Ашераға арналған бағаналарға және басқа да тәңірсымақтардың мүсіндеріне табынатын болды. Олардың осы кінәларының кесірінен Құдайдың қаһары Яһуда мен Иерусалимге төнді."},
	{19, "19 Сонда да Жаратқан Ие оларды Өзіне қайтару үшін пайғамбарларын жіберді. Солар қанша ескертсе де, халық құлақ аспады."},
	{20, "20 Құдайдың Рухы Еходай ұлы Зәкәрия атты діни қызметкерге де қонды. Зәкәрия бүкіл халықтың алдына шығып, былай деді: Құдай мынаны айтады: Сендер неге Жаратқан Иенің өсиеттерін бұза бересіңдер? Бұларыңмен табысқа жетпейсіңдер! Сендер Жаратқан Иеден бас тарттыңдар, енді Ол да сендерден бас тартатын болады!"},
	{21, "21 Бірақ басшылар Зәкәрияға қарсы сөз байласып, оны патшаның әмірімен Жаратқан Иенің киелі үйінің ауласында тас лақтырып өлтірді."},
	{22, "22 Осылайша Жоғас патша Зәкәрияның әкесі Еходайдың өзіне істеген жақсылығын ескермей, ұлын өлтіртті. Зәкәрия жан тапсырардың алдында: Жаратқан Ие осыны көріп, жауабын сендерден талап етсін! — деді."},
	{23, "23 Сол жылдың соңында Арама елінің әскері Жоғасқа қарсы аттанды. Олар Яһуда мен Иерусалимге басып кіріп, олардың халық арасындағы барлық басшыларын өлтірді. Жау әскері тонап алған олжаларының бәрін Дамаскідегі Арама патшасына жіберді."},
	{24, "24 Яһудалықтар ата-бабаларының сиынған Құдайы — Жаратқан Иеден бас тартып кеткен еді. Сол себепті Арама әскері азғана адаммен аттанып келсе де, Жаратқан Ие Яһуданың өте үлкен әскерін олардың қолына тапсырды. Осылай жау Жаратқан Иенің Жоғас патшаға шығарған үкімін орындап шықты."},
	{25, "25 Арамалықтар кетіп қалған кезде Жоғас патша қатты жаралы болып жатты. Оның діни қызметкер Еходайдың ұлы Зәкәрияның қанын төккені үшін, өз нөкерлері оған қарсы астыртын сөз байласып, төсекте жатқан жерінде өлтіріп тастады. Жоғастың мәйіті Дәуіттің шаһарындағы қабірге қойылды, бірақ патшалар зиратындағы қабірлердің біріне емес."},
	{26, "26 Патшаға қарсы сөз байласқан нөкерлер аммондық әйел Шимеяттің ұлы Забад және моабтық әйел Шимриттің ұлы Ехозабад болды."},
	{27, "27 Жоғастың ұлдары жайында, Жоғастың өзіне қарсы айтылған көптеген ауыр хабарлар жөнінде әрі оның Құдайдың киелі үйін нығайтып жөндегені туралы Патшалар кітабына берілген түсіндірмелерде жазулы тұр. Жоғастың ұлы Амасиях оның орнын басып, патша болды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view25() {
struct kk25 poems[] = {
	{1, "1 Амасиях патша болған кезде оның жасы жиырма бесте еді. Ол Иерусалимде жиырма тоғыз жыл билік жүргізді. Оның шешесінің аты-жөні иерусалимдік Ехоғадан еді."},
	{2, "2 Амасиях Жаратқан Иеге ұнамды әділ істер істесе де, онысын шын жүректен істеген жоқ."},
	{3, "3 Өзінің патшалық билігі берік орнатылғаннан кейін, Амасиях әкесін өлтірген нөкерлерді өлімге кесті."},
	{4, "4 Бірақ патша олардың балаларын өлтірткен жоқ. Амалиях мұны Жаратқан Иенің Мұса арқылы тапсырған Таурат заңы кітабында берген мына бұйрығына сай істеді: Не балаларының істері үшін әкелерін, не әкелерінің істері үшін балаларын өлімге кесуге болмайды. Әркім тек өз қылмысы үшін ғана өлімге кесіледі."},
	{5, "5 Кейін Амасиях Яһуда елінің ер адамдарын жинап алды. Оларды Яһуда мен Бунямин руларының күллі әулеттеріне сәйкес мыңбасылар мен жүзбасылардың қарамағына үлестіріп белгіледі. Жасы жиырмадан жоғарыларды санап шыққанда патша сүңгімен және қалқанмен соғыса алатын сарбаздардың санының үш жүз мың екенін анықтады."},
	{6, "6 Оның үстіне патша Солтүстік Исраилден жүз ат басындай күміске тағы жүз мың мықты да ержүрек жасақшыны жалдап алды."},
	{7, "7 Бірақ Құдай жіберген пайғамбар оған келіп, былай деді: — Уа, патша, өзіңізбен бірге Солтүстік Исраилдің жасақшыларын ертіп алмаңыз! Себебі Жаратқан Ие Солтүстік Исраилге әрі осы ефремдік адамдардың ешбіреуіне жар болмайды!"},
	{8, "8 Ал егер олармен бірге шайқасқа шықсаңыз, бар күшіңізбен соғысып көріңіз, Құдай сізді бәрібір жаудың алдында тізе бүктіретін етеді! Өйткені Құдайдың құдіреті сізді қолдауға да, құлатуға да жетеді. —"},
	{9, "9 Амасиях Құдай жіберген пайғамбардан: — Ал онда Исраилден жалдаған жасақшыларға төлеп қойған жүз ат басындай күмісімді не істеймін? — деп сұрады. Құдайдың пайғамбары жауап беріп: — Жаратқан Ие сізге одан да көпті бере алады! — деді."},
	{10, "10 Сонда Амасиях Ефремнен келген жасақшыларды таратып, жөндеріне жіберді. Осыған бола олар Яһудаға қатты ызаланып, үйлеріне қарай беттеді."},
	{11, "11 Амасиях батылданып, әскерін өзі бастап, Тұз аңғарына жетті. Сол жерде Сейір тауларын мекендеген халықтың он мың адамын қырып салды."},
	{12, "12 Яһудалықтар жаудың тағы он мыңын тірідей ұстап алып, бір жартастың басына жетелеп барды да, барлығын төмен қарай құлатып жіберді. Бәрі де құлап, мылжаланып қырылды."},
	{13, "13 Ал Амасиях шайқасқа қатыстырмай, қайтарып жіберген ефремдік жасақшылар сол екі арада Самария қаласынан Бет-Хоронға дейінгі аралықтағы Яһуданың қалаларына бұзып кіріп, үш мың адамын өлтіріп, көп олжаны тонап алып кеткен еді."},
	{14, "14 Амасиях патша болса, Едомның әскерін жеңіп, талқандап, қайта оралғаннан кейін, Сейір тауларын мекендеген сол халықтың жалған тәңірлерінің мүсіндерін ала келді. Патша сол мүсіндерді өзінің сиынатын тәңірлері болуға орнатып қойды. Олардың алдында бас иіп табынып, хош иісті заттарды түтетіп ұсынатын болды."},
	{15, "15 Содан Жаратқан Иенің қаһары Амасияхқа лаулап, оған пайғамбарын жіберді. Пайғамбар тіл қатып: — Сол халықтың тәңірсымақтарына неге бет бұрып сиынасыз? Олар өз халқын сіздің қолыңыздан құтқара алмады ғой! — дей бергенде,"},
	{16, "16 патша оның сөзін бөліп: — Біз сені патшаның кеңесшісі етіп қойған ба едік? Көзіңді құртпасын десең, өшір үніңді! — деп зекіп тастады. Пайғамбар тоқтап қалды, тек қана: — Осыларды істегеніңізден және кеңесімді тыңдамай қойғаныңыздан-ақ Құдайдың сізді құртуды ұйғарғанын енді біліп отырмын, — деп қосты."},
	{17, "17 Бұдан кейін Яһуда елінің патшасы Амасиях кеңесшілерімен ақылдасып, Солтүстік Исраилдің патшасы Жоғасқа елшілерін жіберді. Осы Жоғас Ехудің немересі, Жоғахаздың ұлы еді. Амасиях оған: — Кел, бетпе-бет соғысайық! — деген шақыруын жолдады."},
	{18, "18 Ал Солтүстік Исраилдің патшасы Амасияхқа мынадай (мысалды келтіріп) жауап қайтарды: — Бірде Ливан тауларында өсіп тұрған бір аласа тікенді бұта Ливандағы зәулім самырсын ағашына: Қызыңды менің ұлыма бер! деген екен. Бірақ сол тікенді бұтаның жанынан бір ливандық аң өтіп бара жатып, оны басып, жаншып тастапты."},
	{19, "19 Сен: Міне, мен Едомды жеңдім! деп, паңдана өркөкіректеніп кетіпсің. Алайда өз сарайыңда қалсаң игі болады. Басыңа пәле іздеп, не қыласың?! Әйтпесе Яһудаңмен қоса құрып кетесің!"},
	{20, "20 Бірақ Амасиях оның сақтандыруын тыңдамай қойды. Өйткені Яһуда халқы Амасияхтың бастауымен Едомның жалған тәңірлеріне бет бұрып табынып кеткендіктен, Құдай оларды Солтүстік Исраилдің қолына тапсыруды ұйғарған болатын."},
	{21, "21 Содан Солтүстік Исраилдің патшасы әскерін ертіп Амасияхқа қарсы аттанып барды. Екеуінің арасындағы шайқас Яһуда жеріндегі Бет-Шәміш қаласының маңында болды."},
	{22, "22 Яһуда әскері Солтүстік Исраилден жеңіліп, барлық жасақшылары үйлеріне қашып кетті."},
	{23, "23 Жоғас патша Бет-Шәміште Яһуда елінің патшасы Амасияхты қолға түсіріп, оның астанасы Иерусалимге алып барды. Жоғас Иерусалимді қоршаған қабырғаның Ефрем және Бұрыш қақпаларының арасындағы үлкен бөлігін құлатып тастады. Сол бөліктің ұзындығы шамамен төрт жүз шынтақ болды."},
	{24, "24 Жоғас, сондай-ақ, Құдайдың киелі үйінде Ғабит-Едомның қарамағында болған алтын-күмісті және арнайы құрал-жабдықтардың бәрін тонап, патша сарайындағы қымбат бұйымдарды да қолға түсірді, әрі кепілдікке адамдар алып, Самарияға қайтып кетті."},
	{25, "25 Солтүстік Исраилдің патшасы Жоғахаз ұлы Жоғас қайтыс болғаннан кейін, Яһуда патшасы Амасиях тағы он бес жыл өмір сүрді."},
	{26, "26 Амасияхтың қалған іс-әрекеттері басынан аяғына дейін Яһуда мен Солтүстік Исраилдің патшаларының кітабында баяндалған."},
	{27, "27 Амасиях Жаратқан Иеден бас тартқан кезден бастап дұшпандары оған қарсы астыртын сөз байласып жүрген еді. Содан патша Лахышқа қашып кетті. Бірақ олар артынан адам жіберіп, Амасияхты сол қалада өлтіртті."},
	{28, "28 Оның мәйіті атқа артылып Иерусалимге әкелініп, ата-бабаларының жанына Дәуіттің шаһарындағы қабірге қойылды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view26() {
struct kk26 poems[] = {
	{1, "1 Яһуданың бүкіл халқы он алты жасар патшазада Ұзияхты әкесі Амасияхтың орнына патша етіп тағайындады."},
	{2, "2 Кейін Ұзиях (Қызыл теңіздің шығанағындағы) Елат қаласын қайтадан Яһуда еліне қосып, салғызды. Бұл әкесі Амасиях патша көз жұмып, ата-бабаларының қасына жөнелген кезден кейін болды."},
	{3, "3 Ұзиях патша болған кезде жасы он алтыда еді. Ол Иерусалимде елу екі жыл бойы билік жүргізді. Оның шешесінің аты-жөні иерусалимдік Ехолия болатын."},
	{4, "4 Әкесі Амасиях (алғашқыда) істегендей, Ұзиях та Жаратқан Иеге ұнамды әділ істер істеді."},
	{5, "5 Құдайды қастерлеуге үйреткен ұстазы Зәкәрия болатын. Соның көзі тірісінде патша Жаратқан Иеге бет бұрып, Оның еркіне мойынсұнып жүрді. Содан Құдай оны жарылқап, зор табысқа жеткізді."},
	{6, "6 Ұзиях жорыққа аттанып, філістірлермен соғысып, Ғат, Ябнех, Ашдод қалаларының қамалдарын қиратып тастады. Кейін ол Ашдод аймағында және філістірлердің қалған жерлерінде өз қалаларын салғызды."},
	{7, "7 Патша філістірлерге, Ғұр-Бағалда тұрып жатқан арабтарға және меундіктерге қарсы күрескенде Құдай жар болып оны қолдады."},
	{8, "8 Аммондықтар да Ұзияхқа алым-салық төлеп тұрды. Оның күшейіп кеткені сонша, атақ-даңқы Мысыр еліне дейін жайылды."},
	{9, "9 Сонымен қатар Ұзиях Иерусалимнің Бұрыш, Аңғар қақпаларында және қала қамалының бұрылатын жерінде күзет мұнараларын тұрғызып, нығайтты."},
	{10, "10 Батыстағы төменгі қыраттар мен жазықта өзінің меншікті малы көптеп жайылып жүрді. Содан патша елсіз далада күзет мұнараларын салғызып, көптеген құдықтар қазғызды. Ол жер өңдеуді де ұнатып, жоғарғы қыраттар мен шұрайлы жерлерде егіншілері мен жүзім өсірушілеріне жұмыс істеткізетін."},
	{11, "11 Ұзияхтың тізімге тіркеліп, топ-топқа бөлініп, әрдайым шайқасқа дайын тұрған әскері де бар болатын. Оны тізімдеп, топтастыру жұмысын патшаның қолбасшысы Хананияхтың басшылығымен хатшы Еиел мен басқарушы Мағасиях атқарды."},
	{12, "12 Қуатты жауынгерлер арасындағы әулеттер басшыларының жалпы саны екі мың алты жүз еді."},
	{13, "13 Олардың қол астына үш жүз жеті мың бес жүз адамнан тұратын әскер бағынды. Бұл, патшаның әмірімен жауларына қарсы аттанатын орасан зор күш болды."},
	{14, "14 Ұзиях бүкіл әскер үшін қалқан, найза, дулыға, сауыт, садақ жасатып, сақпанмен атуға арналған тастарды да дайындатты."},
	{15, "15 Патша өзінің озат шеберлері ойлап тапқан жебелер мен дәу тастарды атқылай алатын соғыс құрылғыларын Иерусалимнің күзет мұнараларында және қамалының бұрыштарына орнатты. Құдайдың керемет қолдауының арқасында Ұзиях өте күшейіп, атақ-даңқы алысқа тарады."},
	{16, "16 Алайда патша күшейіп алғаннан кейін кеудесін көтеріп, менменсінуді шығарды. Ол Жаратқан Иенің киелі үйіне өз бетімен кіріп, жалғыз Оған ғана бағышталған хош иісті заттарды түтетіп, Құдай Иесіне қарсы күнә жасады."},
	{17, "17 Патшаның соңынан бас діни қызметкер Азариях Жаратқан Иенің басқа да батыл сексен діни қызметкерімен бірге кіріп,"},
	{18, "18 Ұзиях патшаға қарсы шықты. Олар: Уа, Ұзиях, Жаратқан Иеге құрбандық ұсына алатын сіз емес, тек Һаронның ұрпағынан шығып, осы міндетке бағышталған діни қызметкерлер ғана. Киелі орыннан шыға көріңіз. Мына істеп отырғаныңыз күнә. Құдай Ие оныңызды мақұлдамайды! — деп ескертті."},
	{19, "19 Қолына хош иісті заттар салынған табаны ұстап, Жаратқан Иенің киелі үйіндегі құрбандық үстелінің қасында тұрған Ұзиях мұны естігенде діни қызметкерлерге қатты ашуланды. Сол сәтте-ақ олардың көз алдарында Ұзияхтың маңдайында алапес ауруының дағы пайда болды."},
	{20, "20 Бас діни қызметкер Азариях пен өзге діни қызметкерлер патшаға қарағанда оның маңдайында алапес пайда болған еді! Мұны көре сала олар патшаны сыртқа қарай тықсырып шығара бастады. Оның өзі де Жаратқан Иенің жазасына ілігіп қалғанын түсініп, тысқа шығып кетуге асықты."},
	{21, "21 Ұзиях патша өле-өлгенше алапес күйі қала берді. Ауруы себепті ол Жаратқан Иенің ғибадатханасына кіре алмай, жеке бір үйде тұрды. Оның ұлы Жотам сарайдағы істерді басқарып, елдің халқына билік жүргізді."},
	{22, "22 Амос ұлы Ишая пайғамбар Ұзияхтың қалған іс-әрекеттерін басынан аяғына дейін баяндап жазған."},
	{23, "23 Ұзиях көз жұмып, ата-бабаларының қасына жөнелгенде, мәйіті олардың жанына патшалар қабірлері орналасқан алаңқайдағы мазарға қойылды, себебі ол алапес болған еді. Оның ұлы Жотам орнын басып патша болды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view27() {
struct kk27 poems[] = {
	{1, "1 Жотам патша болған кезде жасы жиырма бесте еді. Ол Иерусалимде он алты жыл билік жүргізді. Жотамның шешесінің аты-жөні Садық қызы Еруша болатын."},
	{2, "2 Әкесі Ұзиях (алғашқыда) істегендей, Жотам да Жаратқан Иеге ұнамды әділ істер істеді. Бірақ ол әкесі сияқты еркінсіп Жаратқан Иенің киелі үйіне кірген емес. Ал халық жексұрын қылықтарын бұрынғысынша жалғастыра берді."},
	{3, "3 Жотам Жаратқан Иенің ғибадатханасының Жоғарғы қақпасын қайта салғызып, қала қамалының Опел төбесіндегі бөлігін жөндеп, нығайтып, көп жұмыстар істеді."},
	{4, "4 Патша мұның үстіне Яһуда елінің таулы аймағында бірнеше қалалар салғызып, орманды жерлерінде қамалдар мен күзет мұнараларын тұрғызды."},
	{5, "5 Бірде Ұзиях Аммон патшасына қарсы соғысып, жеңіске жетті. Сол жылы аммондықтар оған алым-салық ретінде жүз ат басындай күміс, он мың қаптан бидай мен арпа төледі. Екінші, үшінші жылы да олар осылай істеді."},
	{6, "6 Жотам сиынған Құдайы Жаратқан Иеге адал болып, Оның жолымен жүргендіктен соншама күшті болды."},
	{7, "7 Жотамның қалған іс-әрекеттері мен соғыстарының бәрі Солтүстік Исраил мен Яһуда патшаларының кітабында баяндалған."},
	{8, "8 Жотам патша болған кезде жасы жиырма бесте еді. Ол Иерусалимде он алты жыл билік жүргізді."},
	{9, "9 Жотам көз жұмып, ата-бабаларының қасына жөнелгенде, мәйіті Дәуіттің шаһарындағы қабірге қойылды. Оның ұлы Ахаз орнын басып патша болды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view28() {
struct kk28 poems[] = {
	{1, "1 Ахаз патша болған кезде жасы жиырмада еді. Ол Иерусалимде он алты жыл билік жүргізді. Кезінде Жаратқан Иеге ұнамды әділ істер істеген түп атасы Дәуітке Ахаз еш ұқсамады."},
	{2, "2 Керісінше, ол Солтүстік Исраилдің патшаларының теріс жолдарымен жүріп, Бағал атты жалған тәңірдің қола мүсіндерін құйғызып жасатты."},
	{3, "3 Ахаз Бен-Хенном аңғарында жалған тәңірлерге арнап құрбандықтар шалып, өртеп, тіпті өз ұлдарын құрбандыққа өртеп жіберді. Осылайша ол Жаратқан Ие ежелде Исраил халқының алдынан елден қуып шыққан халықтардың жексұрын күнәларын қайталады."},
	{4, "4 Сонымен қатар Ахаз төбе бастары мен өзге де биіктеу жерлердегі табыну орындарында және әрбір саялы ағаштың түбінде жалған тәңірлерге құрбандық шалып, хош иісті заттар түтетіп ұсынып жүрді."},
	{5, "5 Сол себепті Ахаздың Құдайы Жаратқан Ие Арама патшасының оны ойсырата жеңуіне жол берді. Содан арамалықтар оның өте көп адамын тұтқындап, Дамаскіге алып кетті. Ахаз Солтүстік Исраилдің патшасы Ремалиях ұлы Пақахтан да күйрей жеңіліп, үлкен шығынға ұшырады."},
	{6, "6 Соның әскері бір күннің ішінде Яһуданың батыл да мықты жүз жиырма мың жауынгерін жойды. Себебі олар ата-бабаларының сиынған Құдайы Жаратқан Иеден бас тартқан еді."},
	{7, "7 (Солтүстік Исраилдің) Ефрем руынан шыққан мықты жауынгер Зікіри яһудалық ханзада Мағасияхты, сарай басқарушысы Азыриқамды және патшаның бас уәзірі Елқанахты өлтірді."},
	{8, "8 Солтүстік исраилдіктер өздерімен ұлттас яһудалықтардың екі жүз мың әйелдері мен ұл-қыздарын тұтқындап, көп олжалы болып, бәрін Самария қаласына алып кетті."},
	{9, "9 Алайда (жеңімпаз) әскер Самарияға қайта оралғанда, Жаратқан Иенің Одед есімді пайғамбары қалада болды. Ол жауынгерлердің алдынан шығып, былай деді: Ата-бабаларыңның сиынған Құдайы Жаратқан Ие Яһуда халқына қаһарлы болғандықтан ғана оны қолдарыңа түсірді. Бірақ оларды аса қатыгездікпен қырғандарың туралы хабар көктегі Құдайға жетті."},
	{10, "10 Енді сендер Яһуда мен Иерусалимнің халқын өздеріңе құл-күң еткілерің келіп отыр. Немене, Құдайларың Жаратқан Иеге қарсы өздерің күнә жасамап па едіңдер?!"},
	{11, "11 Сондықтан сөзіме құлақ салып, тұтқынға алған ағайындарыңды қайтарыңдар! Өйткені Жаратқан Иенің лаулаған қаһары бастарыңа төніп тұр!"},
	{12, "12 Сонда ефремдіктердің кейбір әкімдері: Жоханан ұлы Азариях, Мешілемот ұлы Барақиях, Шаллум ұлы Езекия және Хадылай ұлы Амаса соғыстан қайтып келе жатқандарға қарсы тұрып былай деді:"},
	{13, "13 Тұтқындарды мұнда алып келмеулерің керек, Жаратқан Иенің алдында айыпты боламыз. Немене, күнәларымыз бен қылмыстарымызды одан әрі көбейте түскілерің келе ме? Онсыз да айыбымыз зор, Жаратқан Иенің лаулаған қаһары халқымыз Исраилдің басына төніп тұр!"},
	{14, "14 Мұны естіген жауынгерлер тұтқындары мен олжаларын жаңағы әкімдер мен бүкіл халықтың жиналып тұрған жерінде қалдырып кетті."},
	{15, "15 Содан соң аталып өткен әкімдер орындарынан тұрып, тұтқындарға барып, іштеріндегі жалаңаш келгендеріне қолға түскен олжа киімдерден беріп, аяқтарына аяқкиім кигізді. Оларға тамақ пен сусын үлестіріп, жараларын маймен сылап емдеді. Әлсізденіп қалғандарын есекке отырғызып, бәрін пальма ағаштары өсетін Иерихон қаласындағы елдестеріне апарып тастап, өздері Самарияға қайта оралды."},
	{16, "16 Осы екі арада Ахаз патша Ассур патшасына елшілерін жіберіп, көмектесуін сұраған еді."},
	{17, "17 Едомдықтар Яһуда еліне қайтадан басып кіріп, көптеген адамдарын тұтқындап алып кеткен болатын."},
	{18, "18 Оның үстіне філістірлер Яһуданың төменгі қыраттары мен оңтүстік аймағының қалаларына шабуыл жасап, Бет-Шәміш, Аялон, Гедерот қалаларын және Сохо, Тимнах, Ғымзоны маңайларындағы қыстақтарымен қоса жаулап алып, сонда орнығып алған еді."},
	{19, "19 Жаратқан Ие Яһуда елін патшасы Ахаздың кесірінен соншалықты масқара болуға душар етті. Себебі Ахаз Яһуда халқын Құдайға бағынбай, зұлымдық істеуге еліктіріп, өзі де Жаратқан Иеге орасан зор опасыздық жасаған болатын."},
	{20, "20 Ассур патшасы Тығылат-Пеләсер Яһудаға аттанып, көмек орнына зорлық-зомбылық көрсетті."},
	{21, "21 Ахаз Жаратқан Иенің киелі үйінен, патшалық және әміршілердің сарайларынан құнды заттарды алып, алым-салық ретінде Ассур патшасына жіберген еді. Алайда онысынан түк шықпады."},
	{22, "22 Жағдайы тым ауырласа да, Ахаз патша Жаратқан Иеге бұрынғыдан бетер опасыздық жасай түсті."},
	{23, "23 Дамаскінің әскері оны күйрете жеңгендіктен, олардың сиынған тәңірлеріне арнап құрбандықтар шалды. Ахаз: Араманың патшаларына бұл тәңірлер көмектесіп келеді. Енді соларға арнап құрбандық шалсам, мені де қолдайтын шығар,— деп ойлады. Керісінше, олар оның өзінің де, бүкіл Исраилдің де күнәға батып, құрып кетулеріне түрткі болды."},
	{24, "24 Ахаз Құдайдың киелі үйіндегі ыдыс-аяқтарды жинап, алып кетті. Сонымен қатар Жаратқан Иеге бағышталған осы киелі үйдің есігін бекітіп те тастады. Патша Иерусалимнің әрбір көше бұрышында өз атынан құрбандық үстелдерін салғызып қойды."},
	{25, "25 Бұған қоса Ахаз Яһуданың басқа қалаларындағы биіктеу жерлерде де бөтен тәңірлерге арнап хош иісті заттар түтетілетін табыну орындарын салғызып, ата-бабаларының Құдайы Жаратқан Иенің қаһарын туғызды."},
	{26, "26 Ахаздың қалған іс-әрекеттерінің бәрі басынан аяғына дейін Яһуда мен Солтүстік Исраилдің патшаларының кітабында баяндалған."},
	{27, "27 Ахаз көз жұмып, ата-бабаларының қасына жөнелгенде, мәйіті Иерусалим қаласында Исраилдің патшаларының қабірлерінен бөлек мазарға қойылды. Оның ұлы Езекия орнын басып патша болды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view29() {
struct kk29 poems[] = {
	{1, "1 Езекия патша болған кезде жасы жиырма бесте еді. Ол Иерусалимде жиырма тоғыз жыл билік жүргізді. Оның шешесінің аты-жөні Зәкәрия қызы Әбия болатын."},
	{2, "2 Езекия түп атасы Дәуіт істегендей Жаратқан Иеге ұнамды әділ істер істеді."},
	{3, "3 Патшалық құруының бірінші жылының бірінші айында Езекия Жаратқан Иенің киелі үйінің есіктерін ашып, оларды жөндетті."},
	{4, "4 Содан ол діни қызметкерлер мен леуіліктерді шақыртып, киелі үйдің шығыс жағындағы алаңға жинап алып,"},
	{5, "5 оларға былай деп тіл қатты: — Уа, леуіліктер, сөзіме құлақ салыңдар! Ата-бабаларыңның сиынған Құдайы Жаратқан Иеге бағышталып тазару рәсімінен өтіңдер. Содан кейін Оның ғибадатханасын тазартыңдар. Осы киелі орынды арамдайтын нәрселердің бәрін де шығарып тастаңдар!"},
	{6, "6 Біздің аталарымыз опасыздық жасап, Құдайымыз Жаратқан Иеден бас тартып, Оған жек көрінішті істер істеді. Олар Жаратқан Иенің жер бетіндегі тұрағынан беттерін бұрып, безіп кетті."},
	{7, "7 Аталарымыз осы ғибадатхананың кіреберісінің есіктерін бекітіп тастап, іштегі шамдарды сөндіріп, Исраилдің Құдайының киелі орнында хош иісті заттарды түтетпей, шалынып, өртелетін құрбандықтарды да ұсынбай қойды."},
	{8, "8 Сол себепті Жаратқан Ие Яһуда мен Иерусалимге қаһарланды. Өз көздеріңмен көріп тұрғандай, Иеміз оларды қорқынышты көрініске айналдырып, басқа халықтардың ысқырып табалауына қалдырды."},
	{9, "9 Қараңдаршы, сол үшін қарияларымыз семсер жүзінен қаза тауып, ұл-қыздарымыз бен әйелдеріміз тұтқында жүр!"},
	{10, "10 Ал енді, Исраилдің сиынған Құдайы Жаратқан Ие бізге мейірімін көрсетіп, ашуын басуы үшін Онымен Келісім жасаспақ ниетім бар."},
	{11, "11 Уа, халайық, міндеттеріңе немқұрайды қарамаңдар! Жаратқан Ие сендерді Өзінің алдында тұрып құрбандықтар мен сый-тартулар ұсынатын қызметкерлер болуға таңдап алған еді."},
	{12, "12 Сонда мына леуіліктер алға шықты: Қохат ұрпақтарынан Амасай ұлы Махат, Азариях ұлы Жоел, Мерари ұрпақтарынан Ғабди ұлы Қиш, Ехәлелел ұлы Азариях; Герсон ұрпақтарынан Зиммах ұлы Жоғах, Жоғах ұлы Ғадан;"},
	{13, "13 Елісапан ұрпақтарынан Шимри мен Еиел; Асаф ұрпақтарынан Зәкәрия мен Маттаниях;"},
	{14, "14 Хеман ұрпақтарынан Ехиел мен Шимей, Едутун ұрпақтарынан Шемаях пен Ұзиел."},
	{15, "15 Олар бауырларын жинап алып, бәрі тазару рәсімінен өтті. Бұдан кейін патша әмір еткендей, Жаратқан Иенің еркіне сай Оның ғибадатханасын тазартуға кірісті."},
	{16, "16 Діни қызметкерлер Жаратқан Иенің киелі үйін тазарту үшін оның ішіне кірді. Олар ғибадатханадан тапқан арам нәрселердің барлығын оның ауласына шығарды. Леуіліктер соларды көтеріп алып, (қаланың сыртындағы) Қидрон сайына апарып тастады."},
	{17, "17 Олар тазарту жұмысын көктемде, бірінші айдың бірінші күні, бастап, сол айдың сегізінші күні Жаратқан Иенің киелі үйінің кіреберісіне енді. Діни қызметкерлер сегіз күн бойы қасиетті бөлмені тазартып, бірінші айдың он алтыншы күні жұмыстарын аяқтады."},
	{18, "18 Содан соң олар патшаға: — Біз Жаратқан Иенің киелі үйін, шалынған құрбандықтарды өртейтін үстелді және оған қажетті барлық құрал-саймандарын, нан тартулары қойылатын үстелді әрі оның барлық ыдыс-аяқтарын түгелдей тазартып шықтық."},
	{19, "19 Ахаз патша билік жүргізген кезінде Құдайға опасыздық жасап, менсінбей аяқасты еткен бұйымдарды қайтадан дайындап, тазарттық. Олар енді Жаратқан Иенің құрбандық үстелінің жанында тұр, — деп есеп берді."},
	{20, "20 Ертеңіне Езекия патша ерте тұрып, қаланың барлық әкімдерін Жаратқан Иенің үйіне ертіп алып келді."},
	{21, "21 Патшалық әулет пен Яһуда халқының күнәларын өтеп, киелі үйді күнәдан арылту үшін олар сол жерге жеті-жетіден жас бұқа, қошқар, тоқты, текелер ала келді. Патша Һароннан тараған діни қызметкерлерге оларды құрбандыққа шалып, Жаратқан Иеге бағышталған құрбандық үстелінде өртеп ұсынуға бұйырды."},
	{22, "22 Алдымен жас бұқалар құрбандыққа шалынды. Діни қызметкерлер солардың қанын құрбандық үстеліне бүркіп шашты. Мұнан соң қошқарлар, кейін тоқтылар шалынып, олардың да қаны құрбандық үстеліне себілді."},
	{23, "23 Осыны бітірген соң діни қызметкерлер күнәні өтеу құрбандығы етіп шалмас бұрын текелерді патша мен бүкіл жамағаттың алдына алып келді. Олар текелердің үстеріне қолдарын қойды."},
	{24, "24 Діни қызметкерлер текелерді шалып, қанын бүкіл Исраил халқын күнәларының арамдығынан тазарту үшін құрбандық үстеліне бүркіп шашты. Себебі шалынып, өртелетін және күнәнің құнын өтейтін құрбандықтар бүкіл Исраил елі үшін ұсынылсын деп патша алдын ала бұйырып қойған болатын."},
	{25, "25 Ол леуіліктерге даңғыра, шертер, жетіген аспаптарын беріп, оларды Жаратқан Иенің ғибадатханасына тұрғызып қойды. Езекияның бұл істегені Дәуіт патшаның берген нұсқауларына, әрі Дәуітке Құдайдың хабарын жеткізген Ғад пен Натан пайғамбарлардың Жаратқан Иеден алған нұсқауларына сай болды."},
	{26, "26 Осылайша леуіліктер Дәуіттің саз аспаптарын, ал діни қызметкерлер кернейлерін ұстап тұрды."},
	{27, "27 Мұнан кейін Езекия Тәңір Иеге арнап тағы басқа да құрбандықтар шалынып, өртелсін деп бұйырды. Олар құрбандық үстелінде өртеле бастаған кезде халық Жаратқан Иеге арналған мадақтау жырларын айта бастады. Исраил патшасы Дәуіттің жасатқан сазды аспаптары және кернейлер де тартылып жатты."},
	{28, "28 Құрбандықтар шалынып, өртеліп біткенше, жиналған бүкіл халық ғибадат етіп, әншілер мадақтау жырларын шырқап, кернейшілер кернейлерін тартып тұрды."},
	{29, "29 Құрбандықтар өртеліп ұсынылған соң патша мен қасындағы жамағаттың барлығы Жаратқан Иенің алдында иіліп, Оған ғибадат етті."},
	{30, "30 Езекия патша және оның әміршілері леуіліктерге: Дәуіт пен Асаф пайғамбар жазып қалдырған жырларымен Жаратқан Иені мадақтай беріңдер! — деп бұйырған еді. Олар Жаратқан Иеге шаттана мадақтау жырларын айтып, бастарын иіп ғибадат етті."},
	{31, "31 Содан соң Езекия халыққа қарап: Енді сендер Жаратқан Иеге бағышталдыңдар. Қазір Оның киелі үйіне жақындап, құрбандықтар шалып, шүкірлік білдіретін сый-тартуларыңды алып келіңдер! — деді. Мұны естіп, бүкіл жамағат құрбандықтар мен сый-тартулар алып келді. Бұларға қоса халайық өз жүрек қалауларына сай шалынып, өртелетін құрбандықтар да ұсынды."},
	{32, "32 Олардың Жаратқан Иеге арнап шалынып, өртелуге әкелген құрбандықтарының жалпы саны жетпіс сиыр, жүз қошқар, екі жүз тоқты болды."},
	{33, "33 Бұлардан басқа тағы да алты жүз бұқа мен үш мың қой-ешкі Құдайға бағышталды."},
	{34, "34 Ал діни қызметкерлер аз болып, олар шалынып, өртелетін құрбандықтардың терілерін сыдырып үлгіре алмады. Сондықтан басқа діни қызметкерлер тазару рәсімінен өтіп болғанға дейін, рулас бауырлары, леуілік қызметшілер, оларға жұмыстарын бітіргенше көмектесе тұрды. Бұлар тазару рәсімінен өтуге діни қызметкерлерден гөрі көбірек көңіл бөлетін еді."},
	{35, "35 Сонымен ағыл-тегіл мол құрбандықтар шалынып, үстеріне арнайы сұйық тартулар құйылып, өртелді. Ризашылық құрбандықтарының майлы бөліктері де өртеліп ұсынылды. Осылай Жаратқан Иенің киелі үйінің қызметі қайтадан қалпына келтірілді."},
	{36, "36 Құдайдың өз халқы үшін жасағандарына Езекия мен бүкіл жұрт қатты қуанды. Себебі бұлардың бәрі күтпеген жерден тез жүзеге асқан еді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view30() {
struct kk30 poems[] = {
	{1, "1 Кейінірек Езекия бүкіл Исраил мен Яһуда еліне хабар жіберіп, бәрін Исраилдің Құдай Иесінің өсиет еткен Құтқарылу мейрамын өткізу үшін Жаратқан Иенің Иерусалимдегі киелі үйіне шақырды. Патша солтүстік Исраилдің Ефрем, Манаса руларына да шақыру хаттарын жолдады."},
	{2, "2 Патша, оның уәзірлері және Иерусалимнің бүкіл мәжілісі мейрамды екінші айда өткізу жайлы ақылдасты."},
	{3, "3 Себебі діни қызметкерлердің тазару рәсімінен өткендерінің саны жеткіліксіз болды, оның үстіне халық та Иерусалимге жиналып үлгермеген еді."},
	{4, "4 Бұл ұсынысты патша мен бүкіл жамағат құптады."},
	{5, "5 Сонымен олар Исраилдің оңтүстіктегі Бер-Шеба мен солтүстіктегі Данның арасындағы бүкіл халқын Исраилдің Құдай Иесінің құрметіне Құтқарылу мейрамын өткізу үшін Иерусалимге шақыру керек деп шешті. Бұған дейін халықтың көпшілігі мейрамды атап өтпейтін."},
	{6, "6 Патшаның бұйрығы бойынша жаршылар бүкіл Исраил мен Яһуданы аралап, патша мен оның әміршілерінің мына сөздерін халыққа таратты: Уа, Исраил халқы, Ыбырайым, Ысқақ, Исраилдың сиынған Құдайы Жаратқан Иеге қайтадан бет бұрыңдар! Сонда Ол Ассур патшасының шеңгелінен аман қалған сендерге де қайтадан бетін бұрмақ."},
	{7, "7 Әкелерің мен ағайындарыңа ұқсамаңдар! Олар ата-бабаларының сиынған Құдайы Жаратқан Иеге опасыздық жасай берді. Сондықтан Ол соларды жазалап, қорқынышты көрініске айналдырды. Оны өздерің-ақ көріп тұрсыңдар."},
	{8, "8 Енді олар сияқты қиқарлыққа салынбаңдар! Жаратқан Иеге мойынсұныңдар! Оның мәңгілікке Өзіне бағыштаған киелі үйіне келіп, Оған қызмет етіңдер! Сонда Ол сендерге деген қаһарынан қайтпақ."},
	{9, "9 Егер сендер Жаратқан Иеге қайтадан бет бұрсаңдар, ағайындарың мен балаларыңды құл қылып ұстап отырғандар оларға мейірімділік көрсетіп, туған елдеріне қайтаратын болады. Сендердің Құдайларың Жаратқан Ие рақымды да мейірімді! Егер Оған қайта бет бұрсаңдар, Ол сендерден ешқашан бас тартпайды."},
	{10, "10 Жаршылар Ефрем мен Манаса руларының барлық қалаларын аралап шығып, тіпті Забулонға дейін барды. Бірақ кездескен халық оларды күлкі етіп, келекеледі."},
	{11, "11 Дегенмен Ашир, Манаса, Забулон руларының кейбір адамдары Жаратқан Иеге мойынсұнып, Иерусалимге беттеді."},
	{12, "12 Құдай Яһуда халқына да игі әсерін тигізіп, бәрінің жүректерін бір шешімге келтірді. Олар патша мен әміршілердің Жаратқан Иенің сөзіне сай берген бұйрығын жүзеге асыруға жаппай жұмылды."},
	{13, "13 Сонымен екінші айда Иерусалимде өте көп адам жиналып, Ашымаған нан мейрамын өткізуге үлкен жамағат дайын тұрды."},
	{14, "14 Олар алдымен Иерусалимдегі жалған тәңірлерге бағышталып шалынған құрбандықтар өртелетін және хош иісті заттар түтетілетін үстелдерді қиратып, қала сыртындағы Қидрон сайына апарып, лақтырып тастады."},
	{15, "15 Екінші айдың он төртінші күні олар Құтқарылу мейрамына арналған тоқтыларды сойды. Өткен жолы даяр болмағандарына ұялған діни қызметкерлер мен леуіліктер тазару рәсімінен өтіп, Жаратқан Иеге бағышталып, дайын тұрды. Олар Оның киелі үйіне арнайы шалынып, өртелетін құрбандықтарды алып келді."},
	{16, "16 Кейін олар Құдайдың пайғамбары Мұса табыстаған Таурат заңы бойынша белгілі орындарында тұрды. Діни қызметкерлер леуіліктерден құрбандықтардың қанын қабылдап, құрбандық үстеліне бүркіп септі."},
	{17, "17 Халықтың арасында әлі де тазарып, дайындалмағандар көп болды. Жаратқан Ие олардың да құрбандықтарын қабылдай көрсін деп леуіліктер солар үшін Құтқарылу мейрамына арналған тоқтыларды шалды."},
	{18, "18 Оның үстіне бірталай адам, көбі Ефрем, Манаса, Исашар, Забулон руларынан келгендер, тазару рәсімінен өтпестен Құтқарылу мейрамының асына қатысып, ережеге қайшы нәрсе жасады."},
	{19, "19 Сонда Езекия олар үшін былай деп мінажат етті: Уа, мейірімі мол Жаратқан Ие! Бұл адамдар осы киелі орынға сай тазару рәсімінен өтпесе де, ата-бабалары сиынған Құдай Иеге шын жүрегімен бағынғысы келген олардың әрқайсысын кешіре гөр!"},
	{20, "20 Жаратқан Ие Езекияның өтінішіне құлақ асып, халықты кешіріп, аман-сау қалдырды."},
	{21, "21 Иерусалимде жиналған исраилдіктер жеті күн бойы үлкен қуанышпен Ашымаған нан мейрамын тойлады. Күн сайын леуіліктер мен діни қызметкерлер Жаратқан Иеге бағышталған сазды аспаптарының сүйемелдеуімен Оны дауыстап мадақтап отырды."},
	{22, "22 Езекия леуіліктерді Жаратқан Иеге зердемен қызмет еткендері үшін мақтап, жігерлендірді. Халық жеті күн бойы мейрамның тамағын жеп, ризашылық құрбандықтарын ұсынып, ата-бабаларының сиынған Құдайы Жаратқан Иені мадақтап дәріптеді."},
	{23, "23 Жамағат мейрамды тағы жеті күнге созуға келісіп, оларды да шаттана мерекелеумен өткізді."},
	{24, "24 Яһуда патшасы Езекия жиналған халық үшін құрбандыққа шалуға мың өгіз бен жеті мың қой, ал әміршілер тағы да мың бұқа мен он мың қой-ешкі берген болатын. Бұл жолы діни қызметкерлер көптеп тазару рәсімінен өтіп қойған еді."},
	{25, "25 Осылай Яһуда халқының бүкіл қауымы, діни қызметкерлер мен леуіліктер, Солтүстік Исраилден мейрамға келгендердің қауымы және Солтүстік Исраил мен Яһудада тұрып жатқан жат жұрттықтардың арасынан келгендердің барлығы да қатты қуанды."},
	{26, "26 Исраил патшасы Дәуіт ұлы Сүлейменнің заманынан бері Иерусалимде мұндай мереке болып көрмегендіктен, қалада жиналғандардың қуаныштары зор болды."},
	{27, "27 Соңында Леуіден тараған діни қызметкерлер орындарынан тұрып, халыққа бата берді. Олардың дауыстарына Құдай құлақ асып, мінажаттары Оның көктегі киелі тұрағына жетіп жатты."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view31() {
struct kk31 poems[] = {
	{1, "1 Мейрам біткеннен кейін оған қатысқан исраилдіктердің барлығы Яһуданың қалаларына барып, олардағы жалған тәңірлерге бағышталған тас мүсіндерді қиратып, Ашераға арналған ағаш бағаналарды шауып тастап, биіктеу жерлердегі табыну орындарын және құрбандық үстелдерін талқандады. Олар Яһуда мен Бунямин руларының жерлерінің бәрінде әрі Ефрем мен Манаса руларының жерлерінде сол табыну орындарын түгелімен жойып тастады. Бұдан кейін исраилдіктер өз қалалары мен үй-жайларына қайтты."},
	{2, "2 Бұдан кейін Езекия діни қызметкерлер мен леуіліктердің атқаратын міндеттеріне сәйкес кезектерін белгіледі. Олар шалынып, түгелдей өртелетін құрбандықтар мен ризашылық құрбандықтарын ұсынып, Жаратқан Иенің жер бетіндегі тұрағының қақпаларының қасында қызмет етіп, шүкірлік айтып, мадақтау әндерін шырқауға тиіс болды."},
	{3, "3 Патша күн сайын азанда және кешке шалынып, өртелетін құрбандықтар үшін, сондай-ақ демалыс күндері, әр айдың алғашқы күніндегі мейрамда және Жаратқан Иенің Таурат заңында белгіленген басқа да мейрамдарда шалынып, өртелетін арнайы құрбандықтар үшін де өзінің отарлары мен табындарынан мал бөліп қойды."},
	{4, "4 Патша Иерусалимнің халқына сый-тартулардың діни қызметкерлер мен леуіліктерге тиісті бөліктерін әрдайым беріп тұруға жарлық шығарды. Осылай діни қызметкерлер мен леуіліктер бар ынтасын Жаратқан Иенің Таурат заңын үйретіп, орындауға арнайтын болды."},
	{5, "5 Осы жарлық шыға салысымен, исраилдіктер астықтың, жүзім шырыны мен зәйтүн майының және балдың, жалпы, жердің барлық өнімдерінің алғашқы бөліктерін жомарттықпен алып келе бастады. Сонымен қатар олар қолдарында бардың оннан бір бөлігін де ағыл-тегіл мол етіп ұсынды."},
	{6, "6 Яһудалықтар және Солтүстік Исраилден Яһуда еліне көшіп келіп, Яһуданың өзге қалаларында тұрып жатқандар мүйізді ірі қаралары мен ұсақ малдарының оннан бірін айдап әкелді, әрі өздерінің Құдайы Жаратқан Иеге арнап қойғандарының да оннан бір бөлігін ұсынып, үйіп-төгіп тастады."},
	{7, "7 Олар сый-тартуларын әкелуді мамыр айында бастап, қыркүйекте бір-ақ аяқтады."},
	{8, "8 Езекия патша мен оның әміршілері келіп, үйіліп-төгілген сый-тартуларды көргенде, Жаратқан Иеге шүкірлік етіп, Оның халқы Исраилге алғыс айтып, ақ бата берді."},
	{9, "9 Езекия діни қызметкерлер мен леуіліктерден осы мол тартулар туралы сұрастырғанда,"},
	{10, "10 Садықтан тараған бас діни қызметкер Азариях былай деп жауап берді: Халық Жаратқан Иенің киелі үйіне сый-тартуларын алып келе бастағалы біз жейтін тамақтан таршылық көрген жоқпыз, тіпті қор жинауға да жететін болды. Жаратқан Ие Өзінің халқын молынан жарылқағандықтан азық-түлік қоры ағыл-тегіл! — деді."},
	{11, "11 Сонда Езекия Жаратқан Иенің ғибадатханасында қойма бөлмелерін дайындауға бұйрық беріп, онысы дереу орындалды."},
	{12, "12 Осы қоймаларға сый-тартулар, өнімнің оннан бір бөлігі және Жаратқан Иеге бағышталған басқа да сый-тартулар түгелдей апарылып қойылды. Леуілік Қонаниях қойма меңгерушісі, ал інісі Шимей орынбасары болып тағайындалды."},
	{13, "13 Езекия патша мен Құдайдың киелі үйінің басқарушысы Азарияхтың тапсыруымен Қонаниях пен інісі Шимейдің қол астында Ехиел, Азазиях, Нахат, Асахил, Еримот, Жозабад, Елиел, Исмақиях, Махат және Бенаях бақылаушылар ретінде қызмет ете бастады."},
	{14, "14 Ғибадатхананың шығыс қақпасының күзетшісі, леуілік Ымна ұлы Қоре, Құдайға арналған ерікті сый-тартуларды басқарушы болды. Ол Жаратқан Иеге ұсынылған тартуларды және Оған бағышталған өзге де арнаулы сый-тартуларды үлестіруге жауапты еді."},
	{15, "15 Ғаден, Міниәмін, Ешуа, Шемаях, Әмариях пен Шеханиях оның қарауында болып, діни қызметкерлерге белгіленген қалалардағы леуіліктер мен діни қызметкерлерге тиесілі үлестерін топтары бойынша бөлуде Қореге адалдықпен көмектесіп жүрді. Оларды сол кісілердің жасына қарамай, үлкен-кішісіне тең етіп тарататын."},
	{16, "16 Сонымен қатар олар ата-тек шежірелерінде тіркелген үш жастан асқан еркек кіндікті леуіліктер: Жаратқан Иенің киелі үйіне кіріп, өздерінің міндеті мен тобына сай ондағы күнделікті жұмыстарды атқаруға тиістілердің барлығы да — үлестерін алатын болды."},
	{17, "17 Сондай-ақ, діни қызметкерлерге де олардың ата-тегі мен шежірелері бойынша, әрі жасы жиырмаға толған не одан асқан леуіліктерге де қызметтері мен топтарына сәйкес тиесілі бөліктері үлестірілді."},
	{18, "18 Аты-жөндері шежірелерде тіркелген барлық леуіліктердің нәрестелері, әйелдері мен ұл-қыздарына да үлес тиетін болды. Бұл, леуіліктердің өздерін киелі үйде Құдайға қызмет етуге әрдайым адалдықпен бағыштап, тазару рәсімінен өтулері үшін істелді."},
	{19, "19 Һароннан тараған діни қызметкерлердің бірқатары өздеріне белгіленген қалалардың айналасындағы ауылдық жерлерде және өзге қалаларда тұрып жатқан болатын. Үлестің тиісті бөлігін оларға тарату үшін кейбір адамдар есімдері аталып тағайындалды. Осылайша сол жерлердегі діни қызметкер отбасыларының барлық еркек кіндіктілері және аты-жөндері Леуі руының шежірелерінде тіркелгендердің бәрі өздеріне тиісті бөліктерді алып отырды."},
	{20, "20 Езекия патшаның Яһуда елінде жасаған істері, міне, осындай. Оның іс-әрекеті өзінің сиынатын Құдайы Жаратқан Иенің алдында игілікті, әділ де адал болды."},
	{21, "21 Құдайдың киелі үйіндегі қызмет болсын, Таурат заңы мен оның ережелеріне бағыну болсын, не істесе де, Езекия шын жүректен атқарып, Құдайға мойынсұнды. Осылайша ол табысқа кенелді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view32() {
struct kk32 poems[] = {
	{1, "1 Езекияның адалдықпен жасаған осындай күллі істерінен кейін, Ассур патшасы Сеннахирим Яһуда еліне қарсы аттанып, оның қамалды қалаларын қоршап, күшпен тартып алмақ болды."},
	{2, "2 Жаудың елге басып кіріп, астанасы Иерусалимге де қарсы соғыспақ болғанын көрген Езекия"},
	{3, "3 уәзірлерімен және қолбасшыларымен кеңесіп, қала сыртындағы су көздерін бітеп тастау туралы ақылдасты. Олар патшаны қолдады."},
	{4, "4 Көптеген адамдар жиналып, Ассурдың патшалары өз әскерлеріне су таба алмай қиналсын деп, барлық бұлақ көздерін және сол жермен ағып жатқан жылғаны бітеп тастады."},
	{5, "5 Езекия іске бар ынтасымен, жан сала кірісіп, қамалдың құлап қалған барлық қабырғаларын қайта тұрғызып, үстіне бірнеше күзет мұнарасын да салды. Оның сыртынан тағы бір қабырға тұрғызып, Иерусалимдегі Дәуіттің шаһары делінген көне қорғанның саты тәрізді беткейіне де бекіністер салғызды. Сонымен қатар патша көп етіп қару-жарақ пен қалқандар жасатып,"},
	{6, "6 халық үстінен әскери бастықтар тағайындады. Содан ол барлығын қала қақпасының жанындағы алаңға жинап, оларды былай деп жігерлендірді:"},
	{7, "7 Қайратты да батыл болыңдар! Ассур патшасынан және оның ертіп алып келе жатқан қалың тобырынан абыржып қорықпаңдар! Бәрінен де құдіретті күш оның емес, біздің жақта!"},
	{8, "8 Жаудағының бары — білек күші ғана, ал бізге Құдайымыз Жаратқан Ие жар болып, біз үшін шайқасатын болады! — Езекия патшаның бұл сөздерін естігенде халық жігерленді."},
	{9, "9 Осыдан кейін Ассур патшасы Сеннахирим бүкіл әскерімен бірге Яһуда елінің Лахыш қаласына шабуыл жасады. Сол кезде ол Иерусалимге нөкерлерін жіберіп, Езекия патшаға және сол қалаға бас сауғалаған Яһуда халқының бәріне мынадай хабар жолдады:"},
	{10, "10 — Ассур патшасы Сеннахирим мынаны айтады: Сендер не нәрсеге арқа сүйеп, Иерусалимде қамалып отырып, тойтарыс бермексіңдер?"},
	{11, "11 Езекия сендерді: Сиынатын Құдайымыз Жаратқан Ие бізді Ассур патшасының қолынан құтқарады! деп алдап, аштық пен шөлден қырғынға ұшыратпақ болып отыр емес пе?"},
	{12, "12 Жаратқан Иеге арналған биіктеу жерлердегі табыну орындары мен құрбандық үстелдерін қиратып, Яһуда мен Иерусалимнің халқына Жалғыз (Иерусалимдегі) құрбандық үстелінің алдында ғана ғибадат етіп, шалынған құрбандықтарыңды тек соның үстінде ғана өртеп ұсыныңдар! деп бұйырған осы Езекия емес пе еді?"},
	{13, "13 Расында менің әрі ата-бабамның басқа елдердің халықтарына не істегенімізді білмейсіңдер ме?! Сол халықтардың тәңірлері оларды менің қолымнан құтқара алды ма?"},
	{14, "14 Аталарым талқандаған елдердің барлық тәңірлерінің қайсысы өз халқын менің қолымнан құтқара алды?! Ендеше сендер сиынатын Құдай да өздеріңді менің қолымнан құтқара алмайды!"},
	{15, "15 Сондықтан Езекияның еліктіруіне алданбаңдар, осындай қулықпен көздеріңді байлауына жол бермеңдер! Оған тіпті сенбеңдер! Ешбір елдің не патшалықтың тәңірі өз халқын менің және ата-бабамның қолынан сақтай алмады. Сендер сиынатын Құдайдың өздеріңді менің қолымнан құтқаруы одан бетер мүмкін емес!"},
	{16, "16 Сеннахиримнің жіберген нөкерлері Құдай Иеге және Оның қызметшісі Езекияға қарсы тағы да бірталай сөздер айтты."},
	{17, "17 Мұның үстіне Сеннахирим Исраилдің Құдайы Жаратқан Иеге тіл тигізген сайқымазақ хаттарын жіберіп, онда: Басқа елдердің тәңірлері өздеріне сиынған халықтарын менен сақтап қала алмағанындай, Езекияның Тәңірі де халқын менен қорғай алмайды! деп жазды."},
	{18, "18 Сеннахиримнің нөкерлері қаланы айналдыра қоршап тұрған қамал үстінде жиналған Иерусалим тұрғындарына қатты дауыспен яһудилердің тілінде айқайлап, қоқан-лоқы көрсетіп қорқыта бастады. Оларды үрейлендіріп, қаланы тезірек басып алмақ болды."},
	{19, "19 Сол нөкерлер Иерусалимнің халқы сиынатын Құдайын жер бетіндегі басқа халықтардың адам қолынан шыққан тәңірсымақтарындай көріп, Оған тіл тигізді."},
	{20, "20 Алайда Езекия патша және Амос ұлы Ишая пайғамбар осыған бола көктегі Құдайға жалбарына сиынды."},
	{21, "21 Сонда Жаратқан Ие періштесін жіберді. Періште Ассур патшасының әскер қосындағы барлық батырларын, қолбасшылары мен әміршілерін қырып кетті. Осылай масқара болған Сеннахирим еліне қайта оралды. Сол жерде ол өзінің табынатын жалған тәңірінің ғибадатханасына кіргенде оны өз ұлдары семсермен шауып өлтірді."},
	{22, "22 Жаратқан Ие осылай Езекияны және Иерусалимнің тұрғындарын Ассур патшасы Сеннахиримнің әрі барлық басқа жауларының қолынан құтқарып қалды. Оларды жан-жағынан қорғап, тыныштық сыйлады."},
	{23, "23 Көптеген елшілер Жаратқан Иеге арнап сый-тартулар және Яһуда патшасы Езекияға бағалы сыйлықтар алып, Иерусалимге ағылып келді. Сонымен күллі халықтар алдында Езекия патшаның мәртебесі өсіп, жоғарылады."},
	{24, "24 Сол күндері Езекия қатты науқастанып, өлім аузында жатты. Ол мінажат еткенде Жаратқан Ие оған хабарын жіберіп, ғажап белгі берді, (әрі оны кереметпен сауықтырды)."},
	{25, "25 Бірақ Езекия өркөкіректеніп, осы көрген жақсылығына шүкірлік етпеді. Сонда Жаратқан Ие оған және Яһуда мен Иерусалимнің халқына қаһарланды."},
	{26, "26 Ал патшаның өзі де, Иерусалимнің тұрғындары да өркөкіректігіне өкінгенде, Жаратқан Ие оларға Езекияның көзі тірісінде қаһарын төккен жоқ."},
	{27, "27 Езекия кезінде орасан зор дәулет пен даңққа ие болған еді. Ол күмісі мен алтынын, асыл тастары мен хош иісті заттарын, қалқандары мен басқа да әр түрлі бағалы заттарын сақтайтын қазына үйлерін салғызды."},
	{28, "28 Сонымен қатар астық, шырын, май сақтайтын қоймалар және төрт түлік малға арнап қора-қопсылар жасатты."},
	{29, "29 Құдай оны соншама мол дүние-мүлікке кенелткендіктен, патша өзіне көптеп қыстақтар салғызып, қора-қора ірілі-ұсақты малға ие болды."},
	{30, "30 Гихон қайнар көзінің жоғарғы бұлағын бітеп тастап, суын (тауды үңгіп жасаған кәріз арқылы) батысқа, Дәуіттің шаһарының ішіне қарай бағыттап ағызған да патша Езекия еді. Ол не істесе де, табысқа жетіп жүрді."},
	{31, "31 Тек Бабыл патшалығының билеушілері Яһуда елінде болған ғажап керемет туралы сұрастыруға жіберген елшілері келгенде, Құдай Езекияның жүрегінің түкпір-түкпірінің бәрін білу үшін оны өз бетімен қалдырып, сынақтан өткізді."},
	{32, "32 Езекияның қалған өмір тарихы мен адал іс-әрекеті Амос ұлы Ишая пайғамбардың көрген аяндары мен көріністері баяндалған жазбада және Яһуда мен Солтүстік Исраил патшаларының кітабында жазылған."},
	{33, "33 Езекия көз жұмып ата-бабаларының қасына жөнелгенде, мәйіті Дәуіт патша әулетінің зиратының жоғарғы бөлігіндегі қабірге қойылды. Бүкіл Яһуда мен Иерусалим халқы оған зор сый-құрмет көрсетті. Оның ұлы Манаса орнын басып патша болды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view33() {
struct kk33 poems[] = {
	{1, "1 Манаса патша болған кезде жасы жиырмада еді. Ол Иерусалимде елу бес жыл билік жүргізді."},
	{2, "2 Манаса Жаратқан Иеге жек көрінішті істер істеді. Осылайша ол Жаратқан Ие ежелде Исраил халқының алдынан елден қуып шыққан халықтардың жексұрын дәстүрлеріне еліктеді."},
	{3, "3 Манаса әкесі Езекия кезінде қиратып тастаған биіктеу жерлердегі табыну орындарын қайта салғызып, Бағал атты жалған тәңірдің мүсіндеріне арналған құрбандық орындарын және Ашераға бағышталған ағаш бағаналарды қайтадан орнатты. Сонымен қатар ол аспан денелерінің бүкіл тобына иіліп, құлшылық етіп жүрді."},
	{4, "4 Жаратқан Ие Өзінің киелі үйі туралы: Иерусалимде Менің есімім әрдайым орнықсын! деген болса да, Манаса Жаратқан Иенің сол киелі үйінде жалған тәңірлерге арнап құрбандық үстелдерін тұрғызды,"},
	{5, "5 әрі оның екі ауласында күллі аспан денелеріне бағышталған құрбандық үстелдерін орнатты."},
	{6, "6 Манаса Бен-Хенном аңғарында тіпті өз ұлдарын жалған тәңірге арнап отқа өртеп құрбан етті. Патша бақсы-балгерлікпен және сиқыршылықпен айналысып, аруақ шақырушылар мен өзге де сәуегейлерден ақыл сұрайтын. Осылайша Манаса Жаратқан Иеге жек көрінішті көптеген істер істеп жүріп, Оның қаһарын өршітті."},
	{7, "7 Манаса өзі жасатып алған жалған тәңір мүсінін тіпті Құдайдың киелі үйіне апарып, сонда орнатып қойды. Ал осы киелі үй туралы Құдай Дәуітке және оның ұлы Сүлейменге былай деген болатын: Мен Исраилдің барлық руларының ішінен таңдап алған қалам Иерусалимдегі осы киелі үйде өз есімімді тұрақты орнатпақпын."},
	{8, "8 Егер Исраил халқы Менің өздеріне Мұса (пайғамбар) арқылы тапсырған Таурат заңымды толығымен ұстанып, бұйырған барлық ережелерім мен шешімдерімді орындап жүрсе, онда Мен ата-бабаларын қоныстандырған осы елден оларды ешқашан қуып шығармаймын."},
	{9, "9 Алайда Манаса Яһуда мен Иерусалимнің тұрғындарын теріс жолға тайдырып жіберді. Олардың арамза істері бұрын Исраил халқы елге көшіп келген кезде Жаратқан Ие олардың ата-бабаларының алдынан жойып жіберген халықтардың жасағандарынан бетер зұлым болды."},
	{10, "10 Жаратқан Ие Манаса мен оның халқына хабарын жіберіп сақтандырған еді, бірақ олар Онысына құлақ аспады."},
	{11, "11 Сол себепті Жаратқан Ие оларға қарсы Ассур патшасының әскер басшыларын жіберді. Бұлар Манасаны қолға түсіріп, мұрындықтап, қола шынжырлармен кісендеп, Бабыл қаласына айдап алып кетті."},
	{12, "12 Басына күн туғанда Манаса ата-бабаларының сиынған Құдайы Жаратқан Иеге жалбарынып, Оның алдында бас ұра күнәсін мойындап,"},
	{13, "13 мінажат етті. Жаратқан Ие жалбарынышына құлақ асып, оны Иерусалимге қайтарып, сонда қайтадан патша етіп қойды. Осыдан Жаратқан Иенің шынайы Құдай екеніне Манасаның көзі жетті."},
	{14, "14 Мұнан кейін Манаса Дәуіттің шаһарының сыртқы қамал қабырғасын бұрынғыдан биік қылып қайта салды. Осы қабырға Гихон қайнар көзінің батыс жағында, сайдың бойымен Опел төбесін айналдыра Балық қақпасына дейін созылды. Патша Яһуданың барлық қамалды қалаларына да қолбасшылар тағайындады."},
	{15, "15 Манаса бөтен тәңірлердің бейнелерін әрі Жаратқан Иенің киелі үйінде орнатылған жалған тәңірдің мүсінін де алып тастады. Сонымен қатар патша ғибадатхана салынған төбеде және бүкіл Иерусалим қаласында жалған тәңірлерге арнап тұрғызылған күллі құрбандық орындарын қиратып, қаладан шығарып тастады."},
	{16, "16 Бұдан кейін ол Жаратқан Иеге арналған құрбандық үстелін қайтадан тұрғызып, оның үстінде ризашылық пен шүкірлік құрбандықтарын ұсынды. Манаса, сондай-ақ, Яһуданың халқына да түп атасы Исраилдің сиынған Құдайы Жаратқан Иеге ғибадат етуге бұйырды."},
	{17, "17 Бірақ халық құрбандықтарын енді Құдай Иесіне бағыштағанмен, оларын бұрынғысынша биіктеу жерлердегі табыну орындарында да шалып, ұсына берді."},
	{18, "18 Манасаның қалған істері, оның Құдайына арнаған мінажаты, сондай-ақ, пайғамбарлардың Манасаға Исраилдің Құдайы Жаратқан Иенің атынан айтқан сөздері Исраил патшаларының тарихында жазылған."},
	{19, "19 Манасаның жалбарына мінажат еткені және онысына Құдайдың рақым етіп құлақ салғаны, әрі патшаның содан бұрын жасаған күнәлары мен опасыздығы туралы, жалған тәңірлерге арнап биіктеу жерлерде тұрғызған табыну орындары, Ашераға бағыштаған ағаш бағаналары және басқа да тәңірсымақтардың мүсіндері — осылардың барлығы жайлы пайғамбарлардың жазбаларында баяндалған."},
	{20, "20 Манаса көз жұмып, ата-бабаларының қасына жөнелгенде, мәйіті өзінің сарайының маңындағы қабірге қойылды. Оның ұлы Амон орнын басып патша болды."},
	{21, "21 Амон патша болған кезде жасы жиырма екіде еді. Ол Иерусалимде екі жыл билік жүргізді."},
	{22, "22 Әкесі Манаса істегендей, Амон да Жаратқан Иеге жеккөрінішті істер істеді. Амон әкесі жасатқан тәңірсымақ мүсіндерінің бәріне табынып, құрбандықтар шалып, құлшылық етті."},
	{23, "23 Ал әкесі Манаса кейін Жаратқан Иенің алдында бас ұра күнәсін мойындаса да, Амон солай істемеді. Керісінше, ол күнәға белшесінен бата түсті."},
	{24, "24 Ақырында нөкерлері Амонға қарсы сөз байласып, оны өз сарайында өлтіріп кетті."},
	{25, "25 Бірақ елдің халқы патшаға қастандық жасағандардың барлығын да өлтіріп, Амонның орнына оның ұлы Жосияны патша етіп қойды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view34() {
struct kk34 poems[] = {
	{1, "1 Жосия патша болған кезде оның жасы сегізде еді. Ол Иерусалимде отыз бір жыл билік жүргізді."},
	{2, "2 Жосия Жаратқан Иеге ұнамды әділ істер істеп, түп атасы Дәуіттің жолымен жүрді және мұнысынан не оңға, не солға таймады."},
	{3, "3 Жосия патшалық құрған сегізінші жылы, әлі де жасөспірім шағында түп атасы Дәуіт сиынған Құдайына бет бұрып, Оның еркін сұрай бастаған еді. Содан кейін ол билігінің он екінші жылы Яһуда мен Иерусалимді биіктеу жерлердегі табыну орындарынан, жалған тәңір Ашераға бағышталған бағаналардан және ағаштан ойылып не қоладан құйылып жасалған басқа да тәңірсымақ мүсіндерінен арылта бастады."},
	{4, "4 Жосияның қызметкерлері оның бақылауымен Бағалға арналған құрбандық үстелдерін қиратып, солардың үстерінде орналасқан хош иісті заттар түтетілетін тұғырларды да талқандады. Олар Ашераға арналған бағаналарды және ойылып не құйылып жасалған тәңірсымақ мүсіндерін күлпарша қылып қиратып, соларға арнап құрбандық ұсынғандардың қабірлерінің үстіне шашып тастады."},
	{5, "5 Патша жалған тәңірлерге құлшылық еткен діни қызметкерлердің сүйектерін сол құрбандық үстелдерінде өртеткізді, әрі Яһуда мен Иерусалимді сол күнәлардың арамдығынан тазартқызды."},
	{6, "6 Жосия кейінірек Солтүстік Исраилдегі Манаса, Ефрем, Шимон руларының қалаларына, тіпті Нафталим руының жеріне дейін барды. Солардың жау қиратып кеткен аймақтарында ол"},
	{7, "7 жалған тәңірлерге арналған құрбандық үстелдерін, бағаналар мен мүсіндерді құлатып, күлпаршасын шығарып, хош иісті заттар түтетіліп ұсынылатын үстелдерді де талқандады. Мұны бүкіл Исраил елінде істеп болған соң патша Иерусалимге қайта оралды."},
	{8, "8 Осылай Жосия патшалық құрған он сегізінші жылы елді және киелі үйді арамдықтан тазартумен айналысып жүрді. Сол кезде патша Асалиях ұлы Шафанды, қала әкімі Мағасияхты және жылнамашы Жоғахаз ұлы Жоғахты Құдай Иесінің киелі үйін жөндеуге жіберді."},
	{9, "9 Бұл үшеуі бас діни қызметкер Хелкияға барып, оған ғибадатхананың қақпаларын күзетіп тұрған леуіліктер жинаған күмісті оған тапсырды. Осы күмісті Манаса мен Ефрем руларының және Солтүстік Исраилдің елде қалған басқа адамдарының бәрі әрі бүкіл Яһуда, Бунямин және Иерусалимнің халқы Құдайдың киелі үйіне арнап әкелген болатын."},
	{10, "10 Сол қаржы ғибадатханадағы жұмыстарды басқаратындарға табысталды. Бұлар одан ғимараттарды жөндеп, жаңартып жатқан жұмысшылардың жалақыларын төледі."},
	{11, "11 Сондай-ақ, қаржының бір бөлігі ағаш ұсталары мен құрылысшыларға берілді. Олар соған қашалған тастар әрі үй төбесін керіп тұратын белағаштар жасауға бөренелер сатып алды. Бұл заттар Яһуданың бұрынғы патшалары күтусіз қалдырып кеткен ғибадатхана ғимараттарын қалпына келтіріп, төбелерін жабуға пайдаланылды."},
	{12, "12 Жұмысшылар міндеттерін ұқыпты атқарды. Оларға төрт леуілік: Мерари ұрпақтарынан Яхат пен Абадиях, Кохат ұрпақтарынан Зәкәрия мен Мешулам басшылық етуге тағайындалды. Саз аспаптарында шебер ойнайтын күллі леуіліктер"},
	{13, "13 жүк тасушылардың жұмысына ырғақ беріп, әрбір тапсырманың орындалуын бақылап жүрді. Басқа леуіліктер хатшылар, топ басшылары және қақпа күзетшілері ретінде қызмет көрсетті."},
	{14, "14 Леуіліктер Жаратқан Иенің киелі үйіне арналып ұсынылған күмісті қазына қоймасынан алып шыққан осы кезде бас діни қызметкер Хелкия Жаратқан Иенің Мұса арқылы тапсырған Таурат заңының кітабын тауып алды."},
	{15, "15 Хелкия Шафан хатшыға: Мен Жаратқан Иенің киелі үйінен Таурат заңының кітабын тауып алдым! — деп хабарлап, кітапты оған табыстады."},
	{16, "16 Шафан мұны патшаға алып барып: Тақсыр, сіздің қызметшілеріңіз тапсырмаларыңыздың барлығын орындап жүр."},
	{17, "17 Олар Жаратқан Иенің киелі үйінде сақталған күмісті шығарып, басқарушылар мен жұмысшыларға тапсырды, — деп баяндады."},
	{18, "18 Шафан сөзін жалғастырып: — Діни қызметкер Хелкия маған бір шиыршық кітапты табыстады, — деді. Содан ол кітаптың біраз жерін патша алдында дауыстап оқып берді."},
	{19, "19 Патша Таурат заңының сөздерін естігенде қатты қайғырып көйлегінің өңірін айыра жыртты."},
	{20, "20 Содан ол Хелкияға, Шафан ұлы Ахиқамға, Миқая ұлы Абыдонға, хатшысы Шафан және бас уәзірі Асаяхқа былай деп әмір етті:"},
	{21, "21 Менің атымнан және Солтүстік Исраил мен Яһуданың жер аударылудан аман қалғандарының атынан барып, табылған кітапта жазылған сөздер жөнінде Жаратқан Иенің еркін сұрап біліп келіңдер! Ата-бабаларымыз Оның сөздерін ұстанбады, осы кітапта тапсырылғанның бәрін істемеді. Сондықтан да Жаратқан Иенің бізге төгілген қаһары өте қатты!"},
	{22, "22 Хелкия мен патшаның жіберген нөкерлері Олдама пайғамбарға барды. Олдама киім қоймасының басқарушысы Шаллумның әйелі еді. Шаллум Хасраның немересі, Тоқаттың ұлы болатын. Пайғамбар Иерусалимнің екінші ауданында тұратын. Елшілер оған болған жайт туралы айтып берді."},
	{23, "23 Олдама оларға жауап беріп былай деді: — Исраилдің Құдай Иесінің хабары мынау, сіздерді маған жіберген адамға былай деңіздер:"},
	{24, "24 Жаратқан Ие мынаны айтады: Біліп қой, Мен осы жерге және оның тұрғындарына пәле жіберемін! Яһуда патшасының алдында оқылған жазбадағы қарғыстардың барлығын олардың бастарына түсіремін!"},
	{25, "25 Себебі олар Мені елемей тастап кетті, әрі бөгде тәңірлерге хош иісті заттар түтетіп, өз қолдарымен жасаған тәңір мүсіндеріне табынып, әдейі ашуымды туғызды. Мен осы жерге лаулаған қаһарымды төгемін, ол енді еш сөнбейді!"},
	{26, "26 Дегенмен сіздерді Жаратқан Иенің еркін сұрап білуге жіберген Яһуда патшасына тағы былай деңіздер: Исраилдің Құдайы Жаратқан Ие сіз жаңа естіген хабар туралы мынаны да айтады:"},
	{27, "27 Сен Менің осы жерге және оның тұрғындарына шығарған үкіміме құлақ асып, жүрегіңді қасарыстырмадың, керісінше, Маған мойынсұндың. Қатты қайғырып, көйлегінің өңірін айыра жыртып, Менің алдымда көз жасыңды төктің. Сондықтан Мен саған құлақ салдым. — Сонымен Құдай Ие былай деп шешті: —"},
	{28, "28 Біліп қой, уақыты келгенде Мен сені ата-бабаларыңның қасына аттандырып, мәйітіңнің қабірге құрметпен қойылуына жағдай жасамақпын. Осылай сен Менің осы жерге және оның тұрғындарын жіберетін күллі пәлелерді көрмейсің. Елшілер патшаға қайтып келіп, осы хабарды жеткізді."},
	{29, "29 Сонда патша шабармандарын жіберіп, бүкіл Яһуда мен Иерусалимнің рубасыларын шақыртып жинап алды."},
	{30, "30 Олар келген соң, патша Яһуда халқы мен Иерусалимнің тұрғындарын, діни қызметкерлер мен леуіліктерді, үлкенді-кішілі бүкіл халықты ертіп алып, Жаратқан Иенің киелі үйіне өрлеп барды. Сол жерде патша бәрінің алдында Жаратқан Иенің киелі үйінен табылған Келісім кітабының барлық сөздерін басынан аяғына дейін оқып берді."},
	{31, "31 Мұнан кейін патша бағана жанындағы арнайы орнында Жаратқан Иенің алдында тұрып, Онымен Келісім жасады. Сонда ол Жаратқан Иенің жолымен жүріп, Оның күллі өсиеттерін, бұйрықтары мен ережелерін шын жүректен, бүкіл жан дүниесімен орындап, осы кітапта жазылған Келісімнің шарттарын жүзеге асыруға ант берді."},
	{32, "32 Патша Иерусалим мен Буняминдегі барлық адамдарға да бұл Келісімге мойынсұнуды бұйырды. Содан Иерусалимнің тұрғындары ата-бабаларының сиынған Құдайы — (жалғыз шынайы) Құдайдың Келісіміне сәйкес іс-әрекет ете бастады."},
	{33, "33 Жосия исраилдіктерге қарасты бүкіл аймақтардан жалған тәңірлердің жексұрын мүсіндерін алып тастап, Исраилде тұратындардың барлығын өздерінің Құдайы Жаратқан Иеге сиынып қызмет етуге мәжбүр етті. Жосияның көзі тірі кезінде халық ата-бабалары сенген Құдай Иенің жолынан тайған жоқ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view35() {
struct kk35 poems[] = {
	{1, "1 Жосия Иерусалимде Жаратқан Иенің құрметіне Құтқарылу мейрамын да өткізді. Соған арналған тоқтылар бірінші айдың он төртінші күні құрбандыққа шалынды."},
	{2, "2 Патша діни қызметкерлерді міндеттеріне тағайындап, Жаратқан Иенің ғибадатханасындағы қызметтерін түгел атқаруға жігерлендірді."},
	{3, "3 Бүкіл Исраил халқына тәлім беріп келген, Жаратқан Иенің қызметіне бағышталып, тазару рәсімінен өткен леуіліктерге патша мына нұсқауларды берді: Киелі Келісім сандығын Исраилдің патшасы Дәуіт ұлы Сүлеймен салған киелі үйде қалдырып, оны (ежелдегідей) иықтарыңда көтеріп алып жүрмейсіңдер ғой. Сондықтан Құдайларың Жаратқан Иеге және Оның халқы Исраилге былайша қызмет ете беріңдер:"},
	{4, "4 топтарыңа бөлінген отбасыларың Дәуіт патша мен оның ұлы Сүлейменнің леуіліктерге қалдырып кеткен жазбаларына сай міндеттеріңді кезекпен атқаруға даяр болыңдар."},
	{5, "5 Ғибадатханада халықтың руларының әр әулеті үшін бір-бір леуілік топ қызмет етуге дайын тұрсын."},
	{6, "6 Қазір Құтқарылу мейрамына арналған тоқтыларды шалу керек. Сендер Жаратқан Иеге бағышталып тазару рәсімінен өтіп, Оның Мұса арқылы жіберген ережелеріне сәйкес құрбандық тоқтыларды елдестерің үшін дайындаңдар! — деді."},
	{7, "7 Жосия халыққа Құтқарылу мейрамына арнап отыз мың тоқты-текешік, сонымен қатар үш мың мүйізді ірі қара малды сыйлады. Мұның бәрі өзінің жеке малы болатын."},
	{8, "8 Патшаның әміршілері де өз еріктерімен халыққа, діни қызметкерлер мен леуіліктерге құрбандық малын атады. Құдайдың киелі үйінің басқарушылары Хелкия, Зәкәрия және Ехиел де діни қызметкерлерге екі мың алты жүз тоқты мен үш жүз мүйізді ірі қара мал берді."},
	{9, "9 Сол сияқты, леуіліктердің басшылары: Қонаниях және оның бауырлары Шемаях пен Нетанел, Хашабиях, Еиел, Жозабад та мейрамға арнап леуіліктерге бес мың тоқты мен бес жүз мүйізді ірі қара мал атады."},
	{10, "10 Мейрамдық ғибадатқа осындай дайындық жасалды. Патшаның нұсқауына сай діни қызметкерлер өз орындарында, леуіліктер де топтары бойынша әзір тұрды."},
	{11, "11 Тоқтылар құрбандыққа шалынды. Діни қызметкерлер қанын құрбандық үстеліне бүркіп, леуіліктер терілерін сыдырды."},
	{12, "12 Олар Мұса арқылы табысталған Таурат кітабында жазылған нұсқау бойынша Жаратқан Иеге арнап құрбандыққа шалынып, өртелетін малды рулардың әулеттеріне үлестірді. Мүйізді ірі қарамен де осылай істелінді."},
	{13, "13 Содан олар Құдайдың ережесіне сәйкес Құтқарылу мейрамының құрбандықтарын отқа қуырды, ал Жаратқан Иеге бағышталған құрбандықтардың етін үлкенді-кішілі қазандарда асып, тездетіп халыққа үлестіріп отырды."},
	{14, "14 Мұны бітіргеннен кейін леуіліктер өздері және діни қызметкерлер үшін мейрам асын дайындады. Себебі Һароннан тараған діни қызметкерлер түгелдей өртелетін құрбандықтарды және өзге құрбандықтардың майлы бөліктерін қас қарайғанға дейін өртеумен болды. Сондықтан да леуіліктер өздерімен қатар оларға да қамқорлық жасады."},
	{15, "15 Асафтан тараған леуілік әнші-күйшілер ежелде өздері үшін Дәуіт патша, Асаф, Хеман және патша жанындағы Едутун пайғамбар белгілеген орындарында тұрды. Ғибадатхананың барлық қақпаларындағы күзетшілерге қызметтерінен сұранып кетудің қажеті болмады. Леуілік бауырластары оларға да Құтқарылу мейрамының асын дайындап қойған еді."},
	{16, "16 Осылайша сол күні Жаратқан Иеге арналған ғибадат рәсімдері түгелдей орындалды. Жосия патшаның бұйрығына сәйкес, халық Құтқарылу мейрамын тойлады да, құрбандықтарын шалып, Жаратқан Иеге арналған құрбандық үстелінде өртеп ұсынды."},
	{17, "17 Сол жерде болған күллі исраилдіктер Құтқарылу мейрамын мерекелеп, оған жалғастыра жеті күн бойы Ашымаған нан мейрамын да өткізді."},
	{18, "18 Исраилдіктердің Құтқарылу мейрамын осылай тойлауы Самуил пайғамбардың заманынан бері болмаған еді. Оған Жосия патша, діни қызметкерлер, леуіліктер, бүкіл Яһуданың және сонда болған Солтүстік Исраилдің халқы әрі Иерусалимнің тұрғындарының барлығы бірігіп қатысты. Исраилдің ешбір патшасы бұрын-соңды Жосия патша іспетті Құтқарылу мейрамын бұлай тойлаған емес."},
	{19, "19 Осы Құтқарылу мейрамы Жосияның патшалық құруының он сегізінші жылы өтті."},
	{20, "20 Жосия ғибадатхананы осылай қалпына келтіргеннен кейін, Мысыр патшасы Нехо Евфрат өзенінің бойындағы Қаркеміш қаласына қарай (Бабыл әскерімен) соғысқа шықты. Жосия оған қарсы аттанып, жолын бөгемек болды."},
	{21, "21 Нехо Жосияға елшілерін жіберіп, мынадай хабарын жеткізді: Ей, Яһуда патшасы! Менде не жұмысың бар? Бүгін саған қарсы емес, өзіммен соғысып жүрген патша әулетіне қарсы аттандым. Құдай маған тездетуге бұйырды. Өзіме жар болып отырған Құдайға қарсы шығуыңды доғар! Егер тілін алмасаң, Ол көзіңді құртады!"},
	{22, "22 Бірақ Жосия алған бетінен қайтпай, перғауынмен соғысуға дайындалды. Ешкім танымасын деп, өзі қарапайым киініп алды. Осылай ол Құдайдың Нехо арқылы жеткізген бұйрығына құлақ аспай, Мегіддо қаласының маңындағы жазықта перғауынмен ұрысқа кірісті."},
	{23, "23 Сол жерде Жосияға садақшылардың оғы тиіп, ол нөкерлеріне: Мені шайқастан алып шығыңдар, қатты жараландым! — деп бұйырды."},
	{24, "24 Олар патшаны соғыс күймесінен дайын тұрған өзге күймесіне жатқызып, Иерусалимге алып барғанда, ол қайтыс болды. Оның мәйіті ата-бабаларының бір қабіріне қойылды. Бүкіл Яһуда мен Иерусалимнің халқы Жосияны жоқтап, аза тұтты."},
	{25, "25 Еремия пайғамбар Жосия туралы жоқтау жырын шығарды. Осы күнге дейін еркек, әйел әншілер Жосия марқұмға арналған жоқтау жырларын айтып келеді. Бұларды орындау Исраилде дәстүрге айналды. Олар Жоқтау жырларының жинағына енді."},
	{26, "26 Жосияның қалған өмір тарихы және оның Жаратқан Иенің Таурат заңына сәйкес жасаған адал істері"},
	{27, "27 басынан аяғына дейін Солтүстік Исраил мен Яһуда патшаларының кітабында баяндалған."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view36() {
struct kk36 poems[] = {
	{1, "1 Яһуда елінің халқы Жосияның ұлы Жоғахазды әкесінің орнына Иерусалимде патша етіп тағайындады."},
	{2, "2 Жоғахаз патша болған кезде жасы жиырма үште еді. Ол Иерусалимде үш ай билік жүргізді."},
	{3, "3 Мысыр патшасы перғауын оны патшалық биліктен айырып, Яһуда еліне жүз ат басындай күміс, бір ат басындай алтын мөлшерінде алым-салық салды."},
	{4, "4 Сонымен қатар перғауын Жоғахаздың орнына оның бір туған бауыры Елиәкімді патша етіп, атын Жохақым деп өзгертті. Ал Жоғахазды Нехо перғауын Мысырға алып кетті."},
	{5, "5 Жохақым патша болған кезде жасы жиырма бесте еді. Ол Иерусалимде он бір жыл билік жүргізді. Жохақым Құдай Иеге жек көрінішті істер істеді."},
	{6, "6 Бірде Бабыл патшасы Набуходоносор Жохақымға қарсы аттанып, оны қола шынжырлармен кісендеп, Бабылға айдап алып кетті."},
	{7, "7 Оның үстіне Набуходоносор Жаратқан Иенің киелі үйінен бірнеше арнайы бұйымдарды еліне алып кеті. Оларды өзінің ғибадатханасында сақтап қойды."},
	{8, "8 Жохақымның қалған істері, оның жексұрын күнәлары және ол туралы табылған куәліктер Солтүстік Исраил мен Яһуда патшаларының кітабында баяндалған. Оның ұлы Ехониях орнын басып патша болды."},
	{9, "9 Ехониях патша болған кезде жасы он сегізде еді. Ол Иерусалимде үш ай он күн билік жүргізді. Ехониях Жаратқан Иеге жек көрінішті істер істеді."},
	{10, "10 Жыл басы — көктемде Бабыл патшасы Набуходоносор жауынгерлерін жіберіп, Ехониях патшаны Бабылға алдыртты. Әскер Ехонияхпен бірге Жаратқан Иенің киелі үйіндегі бағалы бұйымдарды да ала кетті. Бабыл патшасы Ехонияхтың орнына немере ағасы Седекияхты Яһуда мен Иерусалимнің үстінен патша етіп қойды."},
	{11, "11 Седекиях патша болған кезде жасы жиырма бірде еді. Ол Иерусалимде он бір жыл билік жүргізді."},
	{12, "12 Седекиях Құдай Иесін жек көрінішті істер істеді. Патша тіпті Жаратқан Иенің оған Еремия пайғамбар арқылы жеткізген сөздеріне де бағынбады."},
	{13, "13 Седекиях Набуходоносор патшаға адал болуға Құдайдың атымен ант берген болса да, оған қарсы көтерілді. Тоңмойын қыңыр болып, жүрегін қасарыстырған Седекиях Исраилдің сиынған Құдайы Жаратқан Иеге бет бұрудан бас тартты."},
	{14, "14 Оның үстіне діни қызметкерлердің күллі басшылары мен халық та барған сайын Хақ Тағалаға опасыздық жасап, басқа ұлттардың барлық жексұрын дәстүрлеріне еліктеді. Олар тіпті Жаратқан Иенің Иерусалимдегі Өзіне бағыштаған киелі үйін арамдауға дейін барды!"},
	{15, "15 Ата-бабалары сиынған Құдайы Жаратқан Ие Өзінің таңдап алған халқына және жер бетіндегі тұрағына жаны ашып, қайта-қайта хабаршыларын жіберіп, оларға ескертіп келген еді."},
	{16, "16 Алайда олар Құдайдың хабаршыларын мазақ қылып, сөздеріне күліп, пайғамбарларын келекелей берді. Ақыр соңында Жаратқан Ие өз халқына әбден қаһарланды. Оларды енді аман қалдырудың ешбір шарасы қалмады."},
	{17, "17 Содан Құдай Өзінің таңдаған халқына қарсы Бабылдың халдей патшасын аттандырды. Сол патша семсерінің жүзімен елдің таңдаулыларын киелі үйдің өзінде өлтіріп, жас-кәрі демей, еркек болсын, әйел болсын, ешкімді аямай, халықтың көбін қырып тастады. Құдай олардың барлығын Бабыл патшасының қолына бере салған еді."},
	{18, "18 Шетелдік патша Құдайдың киелі үйіндегі үлкенді-кішілі жиһаздар мен бұйымдардың бәрін, әрі ондағы қазынаны, сонымен қатар патша мен әміршілерінің қазыналарын түгелдей Бабылға алып кетті."},
	{19, "19 Жауынгерлер Құдайдың киелі үйіне от қойып өртеп, Иерусалим қамалының қабырғаларын қиратып тастады. Олар қаладағы күллі сарайларды да өртеп, ондағы құнды нәрселердің барлығын құртты."},
	{20, "20 Шетелдік патша семсерінен аман қалғандарды Бабылға жер аударды. Олар парсы патшалығы күшейген кезге дейін Бабыл патшасы мен оның ұрпақтарының құлдығында жүрді."},
	{21, "21 Сол кезде елдің топырағы жетпіс жыл бойы тынығып жатты. Бұл, халықтың немқұрайды қарап, әр жетінші жылы өткізуге тиіс тынығу жылдарының орнын толтырды. Жаратқан Иенің Еремия пайғамбар арқылы алдын ала айтқаны осылайша орындалды."},
	{22, "22 Парсы патшасы Кирдің (Бабылға) билік құрған алғашқы жылы Жаратқан Ие оның жүрегіне түрткі салып, бүкіл патшалығы бойынша жарлық шығартып, хат та жазғызып жібертті. Бұл, Жаратқан Иенің Еремия арқылы алдын ала айтқан сөзінің жүзеге асуы үшін болды. Хатта былай деп жазылды:"},
	{23, "23 Парсы патшасы Кирдің бұйрығы мынау: Көктегі Құдай — Жаратқан Ие маған жер бетіндегі барлық патшалықтарды тапсырды. Ол мені Яһуда жеріндегі Иерусалим қаласында Өзіне арнап киелі үй салуға да тағайындады. Араларыңдағы Оның халқына жататын әр адам сол жаққа өрлеп барсын! Құдайы Жаратқан Ие оған жар бола көрсін!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};