#include <map>
#include <string>
class Bible35
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Мұнда Аббақұқ пайғамбардың Құдайдан алған аянындағы ауыр хабар берілген."},
	{2, "2 — Уа, Жаратқан Ие, қашанғы мен көмек сұрап, Сен құлақ салмай қала бересің? Барлық жерде зорлық! деп қанша шағымдансам да, Сен құтқармайсың."},
	{3, "3 Неге мені әділетсіздікке қарауға, зұлымдықты көруге мәжбүрлейсің? Күн сайын көретінім құрып-күйреу мен зорлық-зомбылық, айналам ұрыс-керіс пен дау-жанжал."},
	{4, "4 Сондықтан да Таурат заңы күшінен айырылған, әділ үкімдер еш орындалмайды. Зұлымдар адал жанды қоршап алып, қыспақтайды, осылай әділ сот бұрмаланады."},
	{5, "5 — Халықтарға көз тастап, назар аударыңдар! Таңғалып, таңдай қағыңдар! Себебі көздеріңнің тірісінде Мен бір істі жүзеге асырмақпын. Оны біреу алдын ала айтып берсе де, сендер сенбес едіңдер:"},
	{6, "6 Мен бабылдықтарды — сол бір қатыгез де қарқынды халықты қолдап, көтеремін. Олар жердің шалғайларына дейін аттанып, өзгелердің қоныстарын тартып алады."},
	{7, "7 Бабылдықтар — қорқынышты да айбынды халық, заңдары мен билігі өздерінен ғана туындайды."},
	{8, "8 Аттары қабыланнан жүйрік, кешқұрым жортып жүретін қасқырдан айбарлы. Атты әскері құйғыта шабады, салт аттылары алыстан зулап келіп, олжасына тап берген бүркітке ұқсайды."},
	{9, "9 Барлығы тонауға аттанып, шөл даладан соққан дауылдай алға басып, тұтқындарын құмдай жинайды."},
	{10, "10 Олар патшаларды мазақтап, әміршілерді күлкі етеді; қамалды қалаларды келекелеп, қабырғасына қарай үймек үйіп, қаланы басып алады."},
	{11, "11 Содан олар жел сияқты соғып өтеді. Бұлар кінәлі адамдар, олар өз күш-қуаттарына құдайдай табынады."},
	{12, "12 — Уа, Жаратқан Ие, Сен мәңгі тірі, киелі Құдайым емессің бе? Бізді өлімге қимағаның ғой? О, Ием, Сен бізді соттауға Бабыл халқын тағайындағансың, уа, жартастай Қорғанымыз, бізді жазалауға дәл соларды белгілеп қойғансың!"},
	{13, "13 Ал Сенің көздерің зұлымдыққа қарауға тым пәк, озбырлыққа қарап тұра алмайсың. Ендеше неге сол опасыздарға жол бересің? Осы зұлым жау өзінен әділдірек басқаларды жалмап жеп жатқанда, Сен неге үндемейсің?"},
	{14, "14 Осылайша адамдарды теңіздегі балық сияқты қыласың, әрі әміршісі жоқ, бауырымен жорғалаушы жәндіктер іспетті етесің!"},
	{15, "15 Содан Бабыл біздің бәрімізді қармағымен ұстап, ауына түсіреді, торымен жағаға тартып шығарып, соған қуанып мәз болады."},
	{16, "16 Сондықтан Бабыл ауына құрбандық шалып, торына табынып хош иісті зат түтетеді. Өйткені солар арқылы олжаға кенеліп, майлы тамаққа тойынады."},
	{17, "17 Сонда қалай, Бабыл өз торына тыным бермей халықтарды аяусыз құрта берсін бе?!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Мен күзетке тұрып, мұнараға шығамын, Жаратқан Иенің маған не айтатынын, шағымыма қандай жауап беретінін күтемін."},
	{2, "2 Сонда Жаратқан Ие маған былай деп жауап берді: — Сен аянда көрген хабарымды тақташаларға анық қылып жазып қой! Содан шабарман оны әр жерде оқып жарияласын!"},
	{3, "3 Өйткені бұл хабар белгілі бір уақытта іске асып, орындалатын кезіне меңзейді. Ол өтірік болып шықпайды. Орындалуы кейінірек болса да, оны күт! Ол шүбәсіз келіп, еш кешікпейді."},
	{4, "4 Паңданып кеткен жауға қарашы, оның ой-ниеті адал емес. Ал әділ адам сенімі арқылы шынайы өмір сүреді."},
	{5, "5 Сол өркөкірек патшалық көпірген шараптай тыным таппайды, аранын көрдей ашқан, ажал сияқты тойымсыз. Өзіне барлық халықтарды жинап, күллі ұлттарды қолына түсіреді."},
	{6, "6 Алайда бір күні бәрі Бабылды мысалға айналдырып, сықақ әндерімен мазақтап былай дейтін болады: Ұрлағандарын жинап, зорлықпен Басқалардан тартып алғандарымен Шексіз байыған ол қасіретке қалады! Ұзаққа созылар ма сол қылықтары?!"},
	{7, "7 (Біліп қой, Бабыл:) сенен борышыңды қайтаруды талап ететіндер аяқ астынан саған қарсы көтеріледі. Олар ұйқыдан оянып, сені талан-таражға салып тонап, өзің олардан дірілдеп қорқатын боласың."},
	{8, "8 Сен көп халықты тонағандықтан, қалған халықтар енді сенің өзіңді тонайды. Себебі сен адам қанын төгіп, елдер мен қалаларды тұрғындарымен бірге қираттың."},
	{9, "9 Арам жолмен үйіңді байлыққа кенелткен, қонысыңды биікке салып, пәледен аулақ боламын деп сенген сен қасіретке қаласың!"},
	{10, "10 Сен көп халықтарды қыруды ойластырып, үй ішіңді масқараға қалдырып, жаныңды тозаққа қидың!"},
	{11, "11 Үйлердің қабырға тастары саған қарсы айғақ болып айқай салады, арқалық бөренелері оларға қосылып, соны жаңғыртады."},
	{12, "12 Қан төгіп қала орнатқандар, қылмыспен қорған салғандар қасіретке қалады!"},
	{13, "13 Сол халықтардың еңбегі отқа отын болып, ұлттардың қинала істегендері зая кететінін Әлемнің Иесі бекіткен жоқ па?"},
	{14, "14 Себебі теңіздің суға толы болатынындай, жер де Жаратқан Иенің ұлылығын білетіндерге солай толы болады."},
	{15, "15 Шарапты толтыра құйып, басқаларды мас қылған да қасіретке қалады! Олардың ашылған ұятына қарап отыру үшін солай істейді. (Бабыл, сен басқа елдерді тонап, масқаралағанда осылай істедің.)"},
	{16, "16 Сен даңққа емес, масқараға бөленетін боласың! Ендігі кезек саған келіп, өзің де ішіп, ұятың ашылсын! Жаратқан Иенің құдіретті қолынан шыққан, Оның қаһарына толы тостағанынан іш! Сонда зор даңқың масқараға айналады."},
	{17, "17 Сенің Ливан ормандарына жасаған зорлығың өз басыңа келіп, аңдарды құртқаның өзіңді үрейлендіреді. Сен адам қанын да төгіп, елдер мен қалаларды тұрғындарымен бірге құрттың."},
	{18, "18 Сонда тәңір мүсінінің келтірер пайдасы не? Оны ойып жасаған жай пенде емес пе? Немесе құйылып жасалған, өтірікті үйрететін мүсіннің пайдасы қандай? Оны жасайтын адам баласы өзінің қолынан шыққан тәңірсымаққа сенеді, бірақ сол мүсін сөйлей алмайды, ол үнсіз мылқау."},
	{19, "19 Ағаш мүсінге: Тіріл!, мылқау тасқа: Оян! дейтін қасіретке қалады! Өлі мүсіндер сендерге дұрыс жолды үйрете ала ма? Алтын, күміспен қапталған болса да, оларда тіршілік жоқ."},
	{20, "20 Ал Жаратқан Ие Өзінің (көктегі) киелі үйінде. Бүкіл жер беті Оның алдында үндемей, Оны терең қастерлейтін болсын!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Аббақұқ пайғамбардың Құдайға еткен мінажаты; екпінді әуенмен айтылады."},
	{2, "2 Уа, Жаратқан, Сенің даңқың жайлы естігенмін, Ием, істеріңе қатты таңырқап келемін. Осы заманда да сондайларды жасай гөр, Тірі кезімізде оларды паш ете гөр, Қаһарыңда мейіріміңді ескере гөр."},
	{3, "3 Киелі Құдай Теманнан, Паран тауынан келді. Ұлы салтанаты Оның жапты күллі аспанды, Оны дәріптеген мадаққа жер беті кенелді."},
	{4, "4 Құдай нұры таң шапағындай жарқырады, Құдіретті қолынан сәулелер жалтырады."},
	{5, "5 Жаратқан Иенің алдында апат жүрді, Ал соңынан күйдіргіш індет те ерді."},
	{6, "6 Құдай тұра қалып, жерді сілкіндірді, Ол қарағанда халықтар дірілдеді. Ежелгі таулар опырылып құлады, Атам заманғы төбелер шөгіп қалды. Мәңгілік — Киелі Құдайдың жолдары!"},
	{7, "7 Көрдім Құшанның абыржыған шатырларын, Дірілдеп қорыққан Мадиянның қостарын."},
	{8, "8 Уа, Жаратқан, өзендерге ашуландың ба, Қаһарың ағымдарға бағытталған ба? Сен аттарыңа мініп, атойлағанда Теңізге қарсы қатты қаһарландың ба? Жоқ, күймелеріңді жібердің құтқаруға!"},
	{9, "9 Сен садағыңды қынабынан шығардың, Отты жебелерді уәдеңе сай дайындадың, Жер бетін сай-аңғармен бөліп тастадың."},
	{10, "10 Таулар Сені көргенде дүр сілкінді, Су тасқыны ағып өтіп лап берді, Түпсіз тұңғиық гүрілдеп күркіреді, Толқындары биікке көтерілді."},
	{11, "11 Ұшқан жебелеріңнің жарығында, Жалтыраған найзаңның жарқылында Тып-тыныш тұра қалды күн де, ай да."},
	{12, "12 Қаһарлана жер бетімен қадам бастың, Ашулана халықтарды таптадың."},
	{13, "13 Құтқаруға аттандың Сен халқыңды Және Өзің тағайындаған патшаңды. Зұлым елдің әміршісін күйреттің, Оны толықтай ұятқа қалдырдың."},
	{14, "14 Жау құйындай құйғытып бізді шашпақ болғанда, Тығылған байғұсты қуана жалмамақ болғанда, Қолбасшының басына өз найзасын сұғып алдың,"},
	{15, "15 Аттарыңның тұяғымен теңізді таптадың, Зәулім су иірімі арқылы жол салдың."},
	{16, "16 Естігенде жүрегім дүрсілдей соқты, Зор гүрілден еріндерім қалтырады, Сүйектерім әлсіреп, күштен айырылды, Аяқ астым қалш-қалш етіп шайқалды. Ал бізді тонап, талан-таражға салған Елдің өзі апатқа ұшырап жатқан Күнді шыдамдылықпен тосатын болам."},
	{17, "17 Інжір ағаштары гүлдемесе де, Бақтарда жүзім шоқтары піспесе де, Зәйтүн ағаштары өнім бермесе де, Егістіктерден астық жиналмаса да, Қорада қой, табында мал қалмаса да,"},
	{18, "18 Мен бәрібір Жаратқанға шаттанамын, Құтқарушы Құдайыма қуанамын."},
	{19, "19 Жаратушы Тәңір, күш-қуатым болады, Ием мені бұғыдай жүйрік қылады, Қырат жолмен жүруіме күш дарытады. (Ән-күйдің жетекшісіне арналған, ішекті аспаптардың сүйемелдеуімен орындалады.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};