#include <map>
#include <string>
class Bible49
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Құдайдың еркімен Иса Мәсіхтің елшісі болған Пауылдан Оның (Ефестегі) халқына, яғни Мәсіх Исаға адал сенетіндерге, дұғай сәлем."},
	{2, "2 Сендерге Құдай Әкеміз бен Иеміз Иса Мәсіх рақымын жаудырып, тыныштық сыйлай берсін!"},
	{3, "3 Иеміз Иса Мәсіхтің Әкесі — Құдай мадақталсын! Ол бізді Мәсіх арқылы жарылқап, көктегі әр қилы рухани игіліктерді сыйлады."},
	{4, "4 Құдай бізді Өзінің алдында қасиетті де мінсіз халқы болып жүрсін деп, әлемді жаратпастан бұрын Мәсіхтің құрбандығына бола сүйіспеншілікпен таңдаған еді."},
	{5, "5 Ол бізді Иса Мәсіхтің арқасында рухани балалары етуге алдын ала белгілеп қойды; Оның ізгі еркі осы болған."},
	{6, "6 Өзінің сүйікті рухани Ұлы арқылы бізге сыйлаған керемет рақымы үшін Құдай мадақтала берсін!"},
	{7, "7 Мәсіхтің құрбан болып, қаны төгілуімен төлеміміз өтеліп, біздер жамандықтың құлдығынан азат етіліп, күнәларымыз кешірілді. Осылайша Құдай Өзінің шексіз зор рақымын"},
	{8, "8 терең даналығымен және түсінігімен бізге молынан жаудырды."},
	{9, "9 Енді Ол бізге Өзінің құпия жоспарын — Мәсіхке байланысты алға қойған ізгі ниетін ашып берді."},
	{10, "10 Тәңір Ие мұны белгілі уақыты жеткенде іске асырып, бүкіл әлемді: көк пен жердегінің барлығын да біріктіріп, Бастығы ретінде Мәсіхтің билігіне тапсыратын болады."},
	{11, "11 Құдай ниет еткендерінің бәрін өз еркіне сай орындайды. Ол бізді Мәсіхпен байланысты өз халқы болуға алдын ала таңдап алған еді. Бұл Құдайдың әуел бастағы мақсатына сәйкес болды."},
	{12, "12 Мұнымен Ол Мәсіхке басқалардан бұрын үміт артқан біздің (яғни яһудилердің) Өзінің ұлылығын мадақтауымызды көздеді."},
	{13, "13 Басқа ұлттық сендер де шындық туралы сөзді: өздеріңді құтқарған Ізгі хабарды естіп, Мәсіхке сенім артқанда Онымен тығыз байланысқа түстіңдер. Уәде етілген Киелі Рух сол кезде бойларыңа кірді, Ол — сендердің Құдайдың меншігі екендіктеріңнің белгісі."},
	{14, "14 Киелі Рух, сондай-ақ, болашақта алатын игіліктеріміздің бастапқы бөлігі әрі кепілі де. Құдай Өзінің меншікті халқын жамандықтың әсерінен түгелдей құтқарғанда сол игіліктердің бәрін иемденетін боламыз. Осылай Тәңір Иенің керемет ұлылығы мадақталмақ."},
	{15, "15 Сол себепті мен сендердің Иеміз Исаға берік сеніп, Оның бүкіл халқын қатты сүйгендіктерің туралы естігендіктен,"},
	{16, "16 мінажат еткен сайын сендер үшін ұдайы шүкірлік етемін."},
	{17, "17 Иеміз Иса Мәсіхтің Құдайы — салтанатты ұлылыққа ие Әке сендерге Өзін жақынырақ танып білулерің үшін Өзінің Киелі Рухы арқылы даналық пен терең түсінік берсе екен деп Одан тілеймін."},
	{18, "18 Ол көкірек көздеріңді оятып, рухани нұрға кенелтіп, өздеріңді қандай үмітке шақырғанын, яғни өз халқына қандай керемет игіліктер сыйлайтынын, білсеңдер екен деп сиынамын."},
	{19, "19 Сендер Құдайдың шексіз құдіретінің Иемізге сенуші біздерге қаншалықты күшті әсер ететінін ұқсаңдар екен деп те Одан сұраймын. Құдай осы керемет құдіретін"},
	{20, "20 Мәсіхті өлімнен қайта тірілтіп, көкке көтеріп, Өзінің оң жағындағы орынға отырғызғанда да қолданды."},
	{21, "21 Осылай Мәсіх күллі билік пен өктемдіктен, күш-қуат пен әкімшіліктен, осы және келешек замандардағы бүкіл атақ пен дәрежелерден де әлдеқайда үстем."},
	{22, "22 Құдай бұлардың бәрін Мәсіхке бағындырып, Оны барлығынан да жоғары қойып, сенушілер қауымының Басы етті."},
	{23, "23 Ал қауым — Мәсіхтің рухани денесі. Мәсіх бүкіл әлемді Өзімен толтырғаны сияқты, қауымды да толтырады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Бұрын сендер Құдайдың бұйрығын бұзып, күнә жасай беріп, рухани өлі едіңдер."},
	{2, "2 Сол кезде сендер осы күнәкар дүниенің дәстүріне сай өмір сүріп, бізді ауа іспетті қоршап тұрған зұлым күштердің әміршісінің, яғни Құдайға бағынбайтын адамдарды билейтін рухтың жетегінде жүрдіңдер."},
	{3, "3 Біз де бұрын сондайлармен бірге болып, күнәлі болмысымыздың құмарлықтарына беріліп, ойымыз бен бойымыздағы тілектерімізді орындадық. Басқаларға сияқты бізге де Құдайдың қаһарының төгілетіні табиғатымыздан белгілі еді."},
	{4, "4 Алайда рақымы мол Құдай бізге зор сүйіспеншілігін көрсетті:"},
	{5, "5 Оның айтқанына көнбей, рухани өлі болған бізді Құдай Мәсіхпен бірге тірілтіп алды. Осылайша тек Оның рақымымен ғана құтқарылдыңдар."},
	{6, "6 Құдай Мәсіх Исамен тығыз байланыстағы бізді Онымен бірге тірілтіп, көкте Оның жанына отырғызды."},
	{7, "7 Осылайша Ол бізге Мәсіх Исаның арқасында мейіріммен қарап, болашақ дәуірлерде Өзінің ағыл-тегіл мол рақымын көрсетпек."},
	{8, "8 Себебі Құдайдың рақымымен, Мәсіхке деген сенімдерің арқылы құтқарылдыңдар. Бұл — өздеріңнің жетістіктерің емес, Құдайдан келген сый."},
	{9, "9 Сондықтан игі істерімнің арқасында құтқарылдым деп ешкім мақтанбасын."},
	{10, "10 Құдай бізді Иса Мәсіхпен тығыз байланыста болып, игі істер жасау үшін ерекше қылып жаратты. Соларды орындауымыз үшін Құдай бізге алдын ала жағдай туғызды да."},
	{11, "11 Сондықтан естеріңде болсын: сендер басқа ұлттық болып тудыңдар, тәнінен ет кесіліп сүндеттелген яһудилер өздеріңді сүндеттелмеген құдайсыздар деуші еді."},
	{12, "12 Ол кезде сендер Мәсіхтен мүлдем алшақ болып, Исраил халқынан тыс және Құдайдың Келісімдерінде берген уәделерінен шет қалдыңдар. Құдайды танымай, үмітсіз өмір кештіңдер."},
	{13, "13 Алайда Иса Мәсіхтің қанын төгіп, құрбан болғандығы арқылы бұрын алшақ жүрген сендер енді Құдайға жақындадыңдар."},
	{14, "14 Мәсіх — татулығымыздың Бастауы: Ол екі топқа бөліп тұрған қабырғадай өштестікті жойып, алып тастап, екі жағын біріктірді."},
	{15, "15 Мәсіх өз денесін біз үшін құрбан еткенде, Таураттың өсиеттері мен ережелерін (орындауды құтқарылу жолы ретінде) күшінен айырды. Осылай Ол яһуди және басқа ұлттық сенушілерді Өзімен байланысқан бір жаңа халық етіп қайта жасап, өзара татуластырды."},
	{16, "16 Мәсіх айқыштағы құрбандығымен екеуінің өштестігін жойып, бір рухани дене (біртұтас қауым) болып біріккен екеуін Құдаймен татуластырды."},
	{17, "17 Сөйтіп Ол келіп, Құдайдан алшақ жүрген сендерге және жақынырақ тұрған біздерге татулық туралы Ізгі хабарды жариялады:"},
	{18, "18 екі жағымызға да Мәсіх арқылы бір Киелі Рухтың арқасында Құдай Әкеге сиынуға жол ашылды."},
	{19, "19 Сонымен сендер енді не бөтен, не келімсек сияқты емес, Құдайдың халқы болып келген яһуди сенушілерімен бірдей, сол халықтың азаматысыңдар, тіпті Құдайдың отбасысының мүшелерісіңдер!"},
	{20, "20 Құдайдың рухани үйінің елшілер мен пайғамбарлар салған іргетасының үстіне сендер де тірі тас іспетті қаландыңдар. Осы үйдің ең негізгі және басты Тасы — Иса Мәсіхтің Өзі."},
	{21, "21 Ол арқылы бүкіл рухани құрылыс (сенушілердің бәрі) біріктіріліп, Жаратқан Иеге бағышталған киелі үй болу үшін өсіп жатыр."},
	{22, "22 Осылайша сендер Иса Мәсіхтің арқасында Құдайдың тұратын мекені ретінде бірге қаланасыңдар. Құдай оны Өзінің Киелі Рухы арқылы мекендейді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Сондықтан мен, Пауыл, басқа ұлттық сендерге Мәсіх Исадан жіберілдім, сол себептен тұтқындалдым да."},
	{2, "2 Құдайдың өздеріңе арналған осы міндетті атқаруды рақымдылықпен маған жүктегенін, әрине, естідіңдер."},
	{3, "3 Себебі Ол Өзінің құпия жоспарын маған ашып білдірді, бұны қысқаша баяндап жазып қойдым."},
	{4, "4 Соны мұқият оқысаңдар, Мәсіх іске асыратын құпия жоспарды түсінгенімді ұға аласыңдар."},
	{5, "5 Осы жоспар адамзаттың алдыңғы ұрпақтарына айтылмаған болатын, ал қазір Киелі Рух оны Құдайдың қасиетті елшілері мен пайғамбарларына ашып отыр."},
	{6, "6 Оның мазмұны мынау: басқа ұлттар Ізгі хабардың арқасында яһуди сенушілерімен бірге Құдайдың жарылқауын қабылдайды және олармен бірге Мәсіхтің рухани денесінің мүшелері болып, Тәңір Иеміздің берген уәдесінен өз үлестерін алмақ."},
	{7, "7 Құдай маған рақымын төгіп, Өзінің құдіретімен өмірімді өзгертіп, мені Ізгі хабарды уағыздайтын қызметшісі етіп қойды."},
	{8, "8 Оның адамдарының ең лайықсызы болсам да, Құдайдың рақымымен Мәсіхтің шексіз зор рухани байлығы туралы басқа халықтарға уағыздау үлесіме тиді:"},
	{9, "9 әлемді жаратқан Құдайдың әуел бастан Өзінде құпия сақтап келген жоспарының қалай іске асырғанын жұртқа ашып беру менің міндетім болды."},
	{10, "10 Құдайдың мұндағы ниеті — Өзінің жан-жақты даналығын көзге көрінбейтін дүниедегі билеушілер мен өктемдік иелеріне енді сенушілер қауымы арқылы ашып мәлім қылуы."},
	{11, "11 Бұл Құдайдың Иеміз Мәсіх Иса арқылы іске асырған мәңгілік мақсатына сәйкес еді."},
	{12, "12 Онымен байланысқан біз Оған деген сенімімізге бола көктегі Әкемізге еркін жақындап, сиынуға батылымыз жетеді."},
	{13, "13 Сондықтан да сендерден өздерің үшін көрген азаптарыма бола жігерлеріңді жасытпауларыңды өтінемін. Себебі олар арқылы Құдайдың ұлылығына кенелесіңдер."},
	{14, "14 Сол себептен мен сендер үшін Құдай Әкеміз алдында тізе бүгіп Оған сиынамын;"},
	{15, "15 көктегі және жердегі бүкіл әкелік бедел Оның атынан тарайды."},
	{16, "16 Былай деп мінажат етемін: Құдай өз ұлылығының байлығына сәйкес Киелі Рухының арқасында жан дүниелеріңді Өзінің құдіретімен нығайта көрсін."},
	{17, "17 Мәсіх сенімдерің арқылы жүректеріңе орныға көрсін,"},
	{18, "18 әрі рухани өмірлерің Оның сүйіспеншілігіне тамыр жайып, негізделсін. Осылай сендер Мәсіхтің сүйіспеншілігінің қаншалықты кең де көз жеткісіз терең және биік екенін Құдайдың бүкіл халқымен бірге түсіне алып,"},
	{19, "19 адам санасы жетпейтін осы сүйіспеншілікті танып білсеңдер екен. Сол арқылы Құдайдың рухани қасиеттері бойларыңа толықтай дари берсін!"},
	{20, "20 Ал Тәңір Иеміз бізге әсер ететін Өзінің құдіреті арқылы біз сұрағаннан немесе ойлағаннан әлдеқайда көп нәрселерді істей алады."},
	{21, "21 Оның даңқы қауымда Мәсіх Иса арқылы ұрпақтан ұрпаққа жетіп, мәңгілік арта берсін! Аумин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Сонымен Иемізге қызмет еткеніме бола түрмеде жатқан мен сендерге Құдайдың өздеріңді шақыруына лайық өмір сүріңдер деп ескертемін."},
	{2, "2 Барлық жағдайларда кішіпейіл, ілтипатты, бір-біріңе төзімді болып, сүйіспеншілік көрсетіңдер."},
	{3, "3 Құдай Рухымен иемденген бірліктеріңді өзара байланыстырған татулық арқылы сақтауға ұмтылыңдар!"},
	{4, "4 Бәріміз біртұтас рухани денеміз, Құдайдың Рухы да Біреу, сол сияқты Құдай сендерді шақырғанда бірдей үміт берді."},
	{5, "5 Иеміз бір, бір сенімдеміз, шомылдыру рәсіміміз де бірдей."},
	{6, "6 Барлығымыздың бір Құдай Әкеміз бар, Ол бәрімізден үстем және бәріміз арқылы әрекет етіп, бәріміздің жүрегімізден орын алды."},
	{7, "7 Ал әрқайсымызға Мәсіхтің рақым етіп үлестіріп берген ерекше рухани дарындарымыз бар."},
	{8, "8 Сондықтан (Забурда) мына тәрізді сөздер жазылған: Ол заңғар биікке көтерілді, көптеген тұтқындарды ертіп жүрді, әрі адамдарға тартулар сыйлады."},
	{9, "9 Ол заңғар биікке көтерілді деген сөздің мағынасы қандай? Мәсіх алдымен төменге, жер бетіне түскен еді дегенді білдіреді."},
	{10, "10 Соған түскен Мәсіх — аспаннан әлдеқайда жоғары орынға, көктің ең биігіне, көтеріліп кеткеннің дәл Өзі. Осылайша Мәсіх бүкіл әлемге өз билігін орнатпақ."},
	{11, "11 Ол рухани дарындар сыйлап, сенушілердің біреулерін елші, біреулерін пайғамбар, тағы басқаларын Ізгі хабарды таратушы, енді біреулерін қауымның рухани бағушысы немесе тәлімгері етіп тағайындады."},
	{12, "12 Олар Құдайдың халқын өз қызметтерін атқаруға дайындауға тиіс. Соның нәтижесінде Мәсіхтің рухани денесі өсіп, күшейе бермек."},
	{13, "13 Осылайша бәріміз бірге Құдайдың рухани Ұлына сеніп, Оны жақын білу арқылы Мәсіхтің кемелдігіне сай келетін біртұтас, жетілген қауым болмақпыз."},
	{14, "14 Онда біз бұдан былай әрбір ой толқынына тәлкек болған жас баладай кез келген ағымдағы ілімге ілесуден, әрі қу, айлакер адамдардың алдап-арбауына еріп азғындық жолға түсуден аулақ боламыз."},
	{15, "15 Қайта, бір-бірімізге шындықты сүйіспеншілікпен айтамыз және қауымның Басы — Иса Мәсіхпен тығыз байланысымызда жан-жақты өсіп жетілеміз."},
	{16, "16 Сонда мүшелері үйлесіп, бірігіп жұмыс істеп тұрған бұл біртұтас рухани дене түгелдей өзінің Басы — Мәсіхке бағынады. Әрбір мүшесі өз міндетін атқарса, бүкіл дене өсіп, сүйіспеншілік арқылы күшейе береді."},
	{17, "17 Иеміздің атынан сендерге мықтап айтып ескертемін: бұдан былай құдайсыз халықтардың түкке тұрғысыз ойларына сай өмір сүрмеңдер!"},
	{18, "18 Олардың санасын қараңғылық басып, жүректері шындықты білгілері келмей жақсылық атаулыға қарсы қасарысқан, сөйтіп Құдай беретін шынайы өмірден құр қалған."},
	{19, "19 Мұндайлар ұяттан әбден безіп, жүгенсіздікке салынып, тойымсыз нәпсіқұмарлықпен әр түрлі азғындық істей береді."},
	{20, "20 Бірақ сендердің Мәсіх туралы үйренгендерің мұндай емес еді ғой!"},
	{21, "21 Оның айтқандарын естіп, Онымен тығыз байланысып, шынайы тәлім алып келдіңдер. Себебі шындық Исада."},
	{22, "22 Алдамшы құмарлықтарымен өмірлеріңді құртып келген ескі күнәлі болмыстарың мен бұған дейінгі өмір салттарыңды енді тастаңдар!"},
	{23, "23 Рухтарың мен ақыл-ойларың түгелдей жаңарсын;"},
	{24, "24 осылай Құдайға рухани жағынан ұқсас жаратылған жаңа, шынымен әділ де қасиетті адам болып өмір сүріңдер!"},
	{25, "25 Сондықтан өтірікті тастап, әрқайсың басқаларға шындықты айтыңдар! Бәріміз біріккен бір рухани дененің мүшелеріміз ғой."},
	{26, "26 Ашуланғанда күнә жасамаңдар! деп (Забурда) жазылған. Күн батпай тұрып, ашуларыңды басыңдар,"},
	{27, "27 сөйтіп шайтанның жамандыққа түрткі салуына жол бермеңдер!"},
	{28, "28 Ұры болған енді ұрлық жасамасын, керісінше, адал еңбек етіп, тапқан табысынан мұқтаждарға үлестірсін."},
	{29, "29 Ауыздарыңнан жаман сөз емес, жақсы сөз ғана шығып, тыңдап тұрғандардың сенімдерін жетілдіріп, игілік сепсін."},
	{30, "30 Осылай Құдайдың Киелі Рухын ренжітуден аулақ болыңдар! Онымен таңбаландыңдар: өмірлеріңнен орын алған Киелі Рух — бір күні жамандық атаулыдан азат етілулеріңнің кепілі."},
	{31, "31 Әрқилы кекшілдік, ашу-ыза, айқай-шу, қаралау, тағы басқа барлық жаман нәрселерден арылыңдар!"},
	{32, "32 Қайта, бір-біріңе мейірімді де жанашыр болыңдар; Мәсіхтің арқасында өздеріңді Құдай кешіргендей, сендер де өзара кешірімді болыңдар!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Сонымен сүйікті рухани баласы ретінде Құдайдан үлгі алыңдар!"},
	{2, "2 Мәсіхтің бізді сүйіп, біз үшін Өзін құрбан еткеніндей, сендер де бір-біріңді сүйіп өмір сүріңдер! Оның өз жанын қиғаны Құдайға ұнамды, хош иісті құрбандық іспетті болды."},
	{3, "3 Араларыңда неке адалдығын бұзу, әр қилы азғындық пен ашкөздіктің тіпті аттары да аталмасын. Құдайға бағышталған адамдарға бұлардан аулақ жүру лайық."},
	{4, "4 Сендерге әдепсіздік жасау, ақымақ сөз бен тұрпайы қалжың айту емес, шүкірлік ету жарасымды."},
	{5, "5 Мынаны біліп қойыңдар: неке адалдығын бұзатындар, ұятсыздар және ашкөз адамдар — жалған тәңірлерге табынушылар. Мұндайлардың ешқайсысына да Мәсіхтің және Құдайдың Патшалығында орын жоқ."},
	{6, "6 Ешкім де сендерді өтірік сөздерімен алдамасын! Себебі Құдайға мойынсұнбайтындарға осы күнәлары үшін Оның қаһарлы соты төніп тұр."},
	{7, "7 Сондықтан олардың іс-әрекеттеріне сыбайлас болмаңдар!"},
	{8, "8 Бұрын сендер түнек болдыңдар, ал енді Иемізбен байланысып, нұрсыңдар: ендеше нұрдың адамдары болып әрекет етіңдер!"},
	{9, "9 Ал нұрдағы өмірдің өнімі — нағыз игілік, әділдік, шындық."},
	{10, "10 Құдай Иеге не ұнайтынын біліп алып,"},
	{11, "11 түнектегі адамдардың бекер істеріне араласпаңдар, қайта, оларды әшкерелеңдер!"},
	{12, "12 Мұндайлардың жасырын істейтіндерін айтудың өзі ұят."},
	{13, "13 Ал түнекке нұр шашылса, ондағының бәрі анық көрінеді. Бар нәрсені әшкерелейтін — нұр."},
	{14, "14 Сондықтан да былай деп айтылады: Оян, ей, ұйқышыл, Рухани өлімнен тіріл! Мәсіх саған төгеді нұр."},
	{15, "15 Сонымен парасатсыз емес, ақыл-парасатты өмір сүруге ерекше ден қойыңдар:"},
	{16, "16 жақсылық жасауға әр мүмкіндікті пайдаланыңдар, себебі қазіргі күндер зұлымдыққа толы."},
	{17, "17 Сондықтан ақымақ болмай, Құдай Иенің еркін біліп алыңдар."},
	{18, "18 Арақ-шарап ішіп, мас болмаңдар, бұл жүгенсіздікке апарады! Қайта, Киелі Рухқа кенеле беріңдер!"},
	{19, "19 Бір-біріңді Забур жырлары, мадақтау өлеңдері және Киелі Рух дарытқан әндер арқылы жігерлендіріп, Иемізді ән-күймен шын жүректен дәріптеңдер."},
	{20, "20 Иеміз Иса Мәсіхтің атымен Құдай Әкеге қай нәрсе үшін де ұдайы шүкірлік етіңдер!"},
	{21, "21 Сендер Мәсіхті қастерлейтіндіктен, бір-біріңе мойынсұныңдар!"},
	{22, "22 Әйелдер, Иемізге мойынсұнғандай, күйеулеріңе де мойынсұныңдар;"},
	{23, "23 өйткені Мәсіхтің сенушілер қауымының Басы болғаны сияқты, еркек — әйелдің басы. Мәсіх сенушілерді құтқарып алды, енді қауым — Оның рухани денесі."},
	{24, "24 Қауымның Мәсіхке мойынсұнғанындай, әйелдер де барлық істе күйеулеріне мойынсұнуға тиіс."},
	{25, "25 Күйеулер, Мәсіх қауымды қалай сүйсе, сендер де әйелдеріңді солай сүйіңдер: Мәсіх қауым үшін жанын қиды!"},
	{26, "26 Оны Құдай сөзімен тазартып, қайта туғызып, қасиетті қылды."},
	{27, "27 Сонымен қауым күйеуіне апарылған қалыңдықтай салтанатты да сұлу, ешбір дақсыз, ақаусыз, басқа да кемшіліксіз, қасиетті де пәк таза болсын."},
	{28, "28 Дәл осылай жұбайларын өз тәніндей жақсы көру — күйеулердің міндеті. Әйелін сүйген өзін де сүйеді."},
	{29, "29 Ешкім де өз тәнін жек көрмейді, қайта, оған нәр беріп, баптап күтеді, Иеміз де қауымды солай қамқорлайды."},
	{30, "30 Біздер Оның рухани денесінің мүшелеріміз."},
	{31, "31 Сондықтан еркек әке-шешесін тастап, әйеліне қосылады, сөйтіп екеуі біртұтас болады, — деп (Тауратта) жазылған."},
	{32, "32 Осында терең сыр бар, мен мұны Мәсіхке және қауымға байланысты айтамын."},
	{33, "33 Бірақ ол сендерге де қатысты: әрқайсың әйеліңді өзіңдей сүюге тиістісің, ал әр әйел күйеуін құрметтеуге міндетті."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 Балалар, Иеміздің еркіне мойынсұнып, әке-шешелеріңнің тілін алыңдар, өйткені осылай істегендерің дұрыс."},
	{2, "2 Ата-анаңды сыйла! Бұл, Құдайдың бір уәдемен байланыстырып берген алғашқы өсиеті:"},
	{3, "3 Сонда жерде игілікті де ұзақ өмір сүретін боласың."},
	{4, "4 Ал ата-аналар, балаларыңа шектен тыс ұрыспаңдар, керісінше, ақылмен жөн сілтеп, Иемізбен жүргендерге лайықты тәрбиелеңдер!"},
	{5, "5 Басыбайлы қызметшілер, Мәсіхке мойынсұнғандай, жер бетіндегі қожайындарыңа да шын жүректен мойынсұнып, жамандық жасаудан шошыныңдар!"},
	{6, "6 Айтқандарын тек көңілдерінен шығу үшін, олар сендерді бақылап тұрғанда ғана емес, ұдайы жан-тәндеріңмен орындай беріңдер! Осылай Құдайдың еркін Мәсіхтің қызметшісі ретінде іске асырыңдар!"},
	{7, "7 Сөйтіп қызметтеріңді адамға емес, Иемізге арнағандай ынтамен атқарыңдар."},
	{8, "8 Мейлі басыбайлы, мейлі ерікті болсын, әркімнің істеген игі істерінің лайықты сыйын Иемізден алатынын біліп қойыңдар."},
	{9, "9 Ал сендер, қожайындар, қызметшілеріңе осылай қарап, қатаңдықты жұмсартыңдар! Көкте олардың да, өздеріңнің де Қожайындарыңның бар екенін білесіңдер. Ол ешкімнің бет-жүзіне қарамайды."},
	{10, "10 Соңында айтарым мынау, бауырластарым: Иемізбен тығыз байланыста жүріп, Оның құдіретінен қуат алып, нығая беріңдер!"},
	{11, "11 Шайтанның қастық іс-әрекетіне тойтарыс бере алуларың үшін Құдай берген рухани қару-жарақпен түгел жабдықталыңдар!"},
	{12, "12 Біз адам баласына қарсы емес, қазіргі қара түнектің әкімдері мен күштілеріне әрі дүниені билеп-төстеушілеріне: көзге көрінбейтін дүниедегі зұлым рухтарға қарсы күресудеміз."},
	{13, "13 Сондықтан Құдай берген рухани қару-жарақтың бәрін асыныңдар! Сөйтіп зұлым күштер шабуыл жасаған күні қарсы тұрып, ақырына дейін күресіп, жеңіп шыға аласыңдар."},
	{14, "14 Сонымен, шындықпен белді бекем буып, әділдікті сауыт қылып киіп, табанды тұрыңдар!"},
	{15, "15 Аяқкиімдеріңді де киіп, татуласу туралы Ізгі хабарды таратуға дайын болыңдар!"},
	{16, "16 Бұларға қоса сенімдеріңді қалқан қылыңдар, онымен шайтанның барлық отты жебелерін өшіріп тастай аласыңдар;"},
	{17, "17 құтқарылғандықтарыңды дулыға етіп киіп қорғаныңдар; Құдай сөзін рухани семсер қылып ұстаңдар!"},
	{18, "18 Киелі Рух арқылы әрдайым Құдайға сиынып, барлық өтініштеріңді айтып, рухани сергек те шыдамды болыңдар: Құдайдың бүкіл халқы үшін мінажат ете беріңдер!"},
	{19, "19 Сөйлеген сайын Ізгі хабардың құпиясын қаймықпай жариялауыма қажетті сөз аузыма түссін деп, мен үшін де мінажат етіңдер!"},
	{20, "20 Бұл хабарды жеткізуге жіберілген елші ретінде осы жерде бұғаудамын. Сондықтан оны тиісті түрде батыл жариялай алуымды Құдайдан тілеңдер."},
	{21, "21 Сүйікті бауырымыз әрі Иеміздің адал қызметшісі Түхік менің жағдайым мен қызметім туралы білулерің үшін сендерге бәрін хабарламақ."},
	{22, "22 Түхікті сол мақсатпен жіберіп отырмын. Ол жағдайымызды білдіріп, жүректеріңді жігерлендірмек."},
	{23, "23 Лайым Құдай Әкеміз бен Иеміз Иса Мәсіх барлық бауырластарға тыныштық, сүйіспеншілік және сенім сыйлай көрсін!"},
	{24, "24 Иеміз Иса Мәсіхті шын беріле сүйгендердің бәріне Құдай жар болып, рақымын жаудыра берсін!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};