#include <map>
#include <string>
class Bible52
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Құдай Әкеге және Иеміз Иса Мәсіхке сенушілердің Салониқадағы қауымына Пауыл, Сыйлас және Тімотеден дұғай сәлем. Құдай сендерге рақымын жаудырып, тыныштығын сыйлай көрсін!"},
	{2, "2 Сендерді Құдайға сиынғанда еске алып, бәрің үшін әрдайым шүкірлік айтамыз."},
	{3, "3 Құдай Әкеміздің алдында сендердің Оған деген сеніммен игілікті іс істеп, сүйіспеншілікпен ауыр еңбек етіп және Иеміз Иса Мәсіхке табандылықпен үміт артып жүргендеріңді үнемі еске алып отырамыз."},
	{4, "4 Құдай сүйген қымбатты бауырластар, Оның сендерді таңдап алғанын білеміз."},
	{5, "5 Себебі біз сендерге Ізгі хабарды сөзбен ғана емес, құдіретпен, Киелі Рухпен және зор сеніммен де жеткіздік. Сендердің игіліктерің үшін араларыңда қалай әрекет еткенімізді өздерің білесіңдер."},
	{6, "6 Ал сендер бізге және Иемізге еліктеп көп азапқа ұшырасаңдар да, Ізгі хабарды Киелі Рух сыйлаған қуанышпен қабылдадыңдар."},
	{7, "7 Осылай Македония мен Ахая өлкелеріндегі сенушілердің барлығына үлгі болдыңдар."},
	{8, "8 Иеміздің хабары сендерден Македония мен Ахаяға ғана тараған жоқ, Құдайға деген сенімдерің барлық жерде белгілі болғандықтан, бізге бұл туралы айтудың қажеті де жоқ."},
	{9, "9 Себебі жұрт сендердің бізді қандай жылылықпен қабылдағандарың және жалған тәңірлерден бас тартып, Құдайға бет бұрғандарың туралы бір-біріне айнала әңгімелеп жатыр. Енді сендер тірі де шынайы Құдайға қызмет ете жүріп,"},
	{10, "10 Оның рухани Ұлы Исаның көктен түсуін күтудесіңдер. Құдай өлімнен қайта тірілткен Иса бізді келешектегі қаһарлы соттан құтқарып алады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Қымбатты бауырластар, сендерге барып, біраз уақытқа қалғанымыздың нәтижесіз болмағанын өздерің білесіңдер."},
	{2, "2 Алдында ғана Філіпіде азап шегіп, қорлық көргеніміз туралы да хабардарсыңдар. Сонда да Құдайға сене отырып, қатты қарсылыққа қарамастан сендерге Оның Ізгі хабарын жариялауға батылымыз барды."},
	{3, "3 Сендерге уағызды өзіміз шындықтан адасқандықтан немесе арам пиғылмен айтып жүрген жоқпыз және біреуді алдаудан да аулақпыз."},
	{4, "4 Қайта, Құдай лайықты деп тауып, Ізгі хабарды бізге сеніп тапсырды. Сондықтан біз адамға емес, жүректеріміздің түкпіріндегілерді бақылап отыратын Құдайға ұнау үшін уағыз айтып жүрміз."},
	{5, "5 Ешқашан да жағымпазданып сөйлеп көрген жоқпыз, оны өздерің білесіңдер. Пайда табайық деген ішкі есебіміз де болған емес, бұған Құдай куә."},
	{6, "6 Сондай-ақ адамдардан, сендерден не басқалардан да атақ іздеп жүрген жоқпыз."},
	{7, "7 Мәсіхтің елшілері ретінде біз талап қойсақ та болар еді, алайда сендерге балаларын қамқорлаған мейірімді анадай жылы жүзбен қарадық."},
	{8, "8 Осылай жақсы көріп, Құдайдың Ізгі хабарын ғана жеткізген жоқпыз, жүрегімізді де алдарыңа жайып салдық, өйткені сендер бізге сүйкімді болып кеттіңдер."},
	{9, "9 Бауырластар, біздің бар күшімізді салып, бейнет шеге еңбек еткеніміз естеріңде ғой. Сендерге масыл болмау үшін күні-түні жұмыс істедік, сөйте жүріп, Құдайдың Ізгі хабарын уағыздадық."},
	{10, "10 Құдайға сенетін сендердің алдарыңда өзімізді таза, әділ, мінсіз ұстадық, бұған сендер де, Құдай да куә."},
	{11, "11 Мынаны білесіңдер: әрқайсыңды туған баламыздай көріп,"},
	{12, "12 сендерге Құдай алдында ұялмайтындай болып жүріңдер деп ескертіп, соған көздеріңді жеткіздік, тіпті өздеріңе жалындық та. Өйткені Құдай сендерді өз Патшалығы мен салтанатты ұлылығына шақырады."},
	{13, "13 Сендердің бізден естіген Құдай сөзін адамның емес, Құдайдың хабары ретінде — шындығында да бұл солай! — қабылдағандарың үшін біз Оған үнемі ризашылығымызды білдіреміз. Қазір бұл хабар Оған сенетін сендерге күшті әсер етіп жатыр."},
	{14, "14 Себебі сендер, бауырластар, Құдайдың Иса Мәсіхке сенетін Яһудеядағы қауымдарына ұқсайсыңдар: олар яһуди діндарларынан қандай азап шексе, сендер де өз жерлестеріңнен сондай азап шектіңдер."},
	{15, "15 Яһуди діндарлар тіпті Иеміз Иса және пайғамбарларды өлтіріп, бізді де қуып шыққан еді. Олар Құдайға ұнамайды әрі барлық адамдарға қастық танытады."},
	{16, "16 Себебі олар біздің басқа ұлттарға Ізгі хабарды жариялап, құтқару әкелуімізге кедергі жасай береді. Осылай олар күнәларын күннен күнге көбейтіп келе жатыр. Содан Құдайдың қаһары төбелерінен төніп тұр."},
	{17, "17 Қымбатты бауырластар, аз уақыт сендерден ажырап, көңілдеріңнен емес, көздеріңнен таса болғанда сағыныштан жүздеріңді көруге қатты құштар болдық."},
	{18, "18 Иә, сендерге барғымыз келді; өзім — Пауыл бірнеше рет баруға тырыстым, бірақ бұған шайтан кедергі жасады."},
	{19, "19 Өйткені Иеміз Иса Мәсіх қайтып келген кезде біздің үмітіміз, қуанышымыз, басымызға киер мақтау тәжіміз сендер болмағанда, кім болмақ?"},
	{20, "20 Расында да біздің мақтанышымыз бен қуанышымыз сендерсіңдер."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Сондықтан біз одан әрі шыдай алмай, Афинада жалғыз өзім қалайын деп шештік те,"},
	{2, "2 Тімоте бауырымызды сендерге жібердік. Ол — Мәсіхтің Ізгі хабарын тарату жөніндегі Құдайдың қызметшісі. Осы азаптар ешқайсыңды шайқалтпасын деп, Тімоте сендерді жігерлендіріп, сенімдеріңді нығайтпақ."},
	{3, "3 Азап шегу маңдайымызға жазылғандығы өздеріңе мәлім."},
	{4, "4 Қастарыңда жүрген кезімізде Қуғынға ұшырайтын боламыз деп алдын ала айттық қой. Міне, сол айтқанымыз келді, оны өздерің білесіңдер."},
	{5, "5 Осыған бола мен одан әрі шыдай алмай Тімотені жіберіп, сенімдерің берік пе, әлде әзәзіл азғырып, бар еңбегіміз зая кетті ме, соны білгім келді."},
	{6, "6 Қазір Тімоте сендерден келіп, сенімдерің мен сүйіспеншіліктерің туралы жақсы хабар әкелді. Сендердің бізді ұдайы жақсылықпен еске алып, көрсек деп сағынып жүргендеріңді айтты; біз де сендерді көрсек дейміз."},
	{7, "7 Қымбатты бауырластар, сенімдеріңді берік ұстап жүр екенсіңдер. Бұл қиналып, қысылып отырған бізге жаңадан жігер берді."},
	{8, "8 Енді рухымыз көтеріліп қалмақ, себебі сендердің Құдаймен байланыстарың тұрақты екен."},
	{9, "9 Бізді өздеріңе қуантып қойған Құдайға қанша алғыс айтсақ та аздық қылады."},
	{10, "10 Күні-түні Одан қайтадан сендермен көрістіріп, сенімдеріңнің жетіспейтін жақтарын толықтыруға мүмкіндік бере гөр деп құлшына өтінеміз."},
	{11, "11 Осылай Құдай Әкеміздің Өзі және Иеміз Иса жолымызды сендерге бұра көрсін."},
	{12, "12 Бір-біріңе және барлық адамдарға деген сүйіспеншіліктеріңді Иеміз біздің өздеріңе деген сүйіспеншілігіміз сияқты өсіріп, арттыра берсін."},
	{13, "13 Осылай Ол көңілдеріңді орнықтыра көрсін. Содан сендер Иеміз Иса Мәсіх күллі қасиеттілерімен көктен түскенде, Құдай Әкеміздің алдында Оған толықтай бағышталған, мінсіз боласыңдар."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Тағы да, қымбатты бауырластар, Құдайға ұнау үшін қалай өмір сүру керек екенін бізден үйрендіңдер, солай өмір сүріп келе жатырсыңдар да. Осы жолмен алға баса беріңдер деп Иеміз Исаның атынан ескертіп, өтінеміз."},
	{2, "2 Сендерге Иеміз Исаның еркімен қандай нұсқаулар бергенімізді білесіңдер."},
	{3, "3 Құдай сендердің Өзіне бағышталып қасиетті өмір сүргендеріңді қалайды. Бұл азғындықтан аулақ жүрулеріңді де білдіреді:"},
	{4, "4 әркім өз денесін қасиеттілікпен әрі құрметпен күте білсін!"},
	{5, "5 Құдайды танымайтын ұлттарға ұқсап күнәлі құмарлықтарға салынбаңдар,"},
	{6, "6 ешқайсың да заңды аттап, пайдакүнемдікпен бауырластарыңды алдап кетпеңдер! Сендерге бұрынырақ ескерткеніміздей, Иеміз мұндай күнәлардың бәрінің жазасын береді!"},
	{7, "7 Құдай бізді азғын емес, Оған бағышталған қасиетті өмір сүруге шақырды."},
	{8, "8 Бұған бағынбайтын кісі адамға емес, Құдайға қарсы тұрады. Ол сендерге Өзінің Киелі Рухын берді ғой."},
	{9, "9 Бауырластарға деген сүйіспеншілік туралы мен жазбай-ақ қояйын, бір-біріңді сүюді Құдайдың Өзі үйретті ғой."},
	{10, "10 Оны бүкіл Македониядағы бауырластарыңа іс жүзінде көрсетіп жүрсіңдер. Бұдан былай да осы жөнінде алға баса берулеріңді тілейміз."},
	{11, "11 Бірқалыпты өмір сүруді құрметті іс деп біліңдер. Біз сендерге нұсқау бергендей, міндеттеріңді атқарып, өз қолдарыңмен еңбек етіп күндеріңді көріңдер."},
	{12, "12 Сөйтіп қауымнан тыс адамдардың алдында әдепті жүріп, еш нәрседен мұқтаж болмаңдар."},
	{13, "13 Қымбатты бауырластар, үміті үзілген басқалар сияқты қайғырмауларың үшін сендерді бұ дүниеден қайтқан сенушілердің жағдайы туралы хабарсыз қалдырмаймыз."},
	{14, "14 Исаның өліп, қайта тірілгендігіне кәміл сенеміз ғой. Сондықтан Оған сеніп бұ дүниеден кеткендердің Исамен бірге болулары үшін Құдайдың оларды қайта тірілтетініне де сенейік."},
	{15, "15 Себебі бұны Иеміздің өз сөзіне сүйеніп айтамыз: Иеміз Иса көктен қайтып келген кезде әлі тірі жүретін біздің өліп қалған бауырластарымыздан ешқандай артықшылығымыз болмайды."},
	{16, "16 Өйткені Иеміздің Өзі көктен түсіп, бұйрық береді, әрі бас періште шақырып, Құдайдың кернейі қатты дауыстайды. Сонда ең алдымен Мәсіхке сеніп бұ дүниеден кеткендер қайта тіріледі."},
	{17, "17 Тірі жүрген біз мұнан соң солармен бірге Иемізбен кездесу үшін бұлттың үстімен көкке көтерілеміз. Содан мәңгі бақи Иемізбен бірге боламыз."},
	{18, "18 Бір-біріңді осы сөзбен жұбатыңдар!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Қымбатты бауырластарымыз, болашақ уақыттар мен мезгілдер туралы сендерге жазудың қажеті жоқ."},
	{2, "2 Иеміздің қайта оралатын күні ұрының түнде түсетініндей кенеттен келетінін өздерің анық білесіңдер."},
	{3, "3 Жұрт Бәрі тыныш, қауіпсіз деп жүргенде, апат аяғы ауыр әйелдің толғағындай табан астынан болады. Сонда ешкім қашып құтыла алмайды."},
	{4, "4 Бірақ сендер, бауырластарымыз, түнекте тұрмай, сол күні ұры түскендей қапыда қалмайсыңдар,"},
	{5, "5 бәрің де жарықта және күнде жүресіңдер ғой. Біз түндікі және түнектікі болмағандықтан,"},
	{6, "6 басқаларға ұқсап ұйықтап қалмай, сергек те салауатты жүрейік!"},
	{7, "7 Себебі ұйықтайтындар түнде ұйықтайды, ішетіндер түнде ішеді."},
	{8, "8 Ал біз күндікі болғандықтан салауатты жүрейік, сеніміміз бен сүйіспеншілігімізді сауыт қылып, мәңгілік құтқарылуға деген үмітімізді дулыға етіп киейік!"},
	{9, "9 Өйткені Құдай бізді Өзінің қаһарына ұшырауға емес, қайта, Иеміз Иса Мәсіх арқылы құтқарылуға тағайындады."},
	{10, "10 Мәсіх қайтып келгенде тірі боламыз ба, әлде өлі боламыз ба, бәрібір, біздің Өзімен бірге тұруымыз үшін Ол жанын пида етті."},
	{11, "11 Сондықтан бір-біріңді жігерлендіріп, сенімдеріңді бұрынғыша өзара нығайта беріңдер!"},
	{12, "12 Қымбатты бауырластар, сендерден сұрайтынымыз мынау: Иеміздің ізгі ісінде өздеріңе жетекшілік еткендерді сыйлаңдар. Олар араларыңда еңбек етіп, сендерге дұрыс жолды сілтеп жүр."},
	{13, "13 Оларды айрықша құрметтеп, еңбектері үшін жақсы көріңдер. Өзара бейбіт, тату болыңдар!"},
	{14, "14 Бауырластар, сендерден тағы мынаны өтінеміз: жүгенсіз, бос жүргендерге ескерту жасаңдар, жасқаншақтарға жігер беріңдер, әлсіздерді қолдап, төзімділік танытыңдар!"},
	{15, "15 Ешкім жамандыққа жамандықпен қайтармасын, қайта, бір-біріңе де, басқаларға да жақсылық жасауға ұмтылыңдар!"},
	{16, "16 Әрдайым қуанып,"},
	{17, "17 Құдайға үздіксіз сиыныңдар,"},
	{18, "18 Оған барлық жағдайларда да алғыс айтыңдар! Иса Мәсіхтің жолымен жүруші сендерден Құдай осыны күтеді."},
	{19, "19 Құдай Рухының іс-әрекетін тежемеңдер!"},
	{20, "20 Оның пайғамбарлық нұсқауларын менсінбей жүрмеңдер,"},
	{21, "21 алайда бәрін де тексеріп сынаңдар! Жақсысын ғана қабылдап, берік ұстаныңдар!"},
	{22, "22 Жамандықтың қай түрінен де аулақ жүріңдер!"},
	{23, "23 Тыныштықты сыйлайтын Құдай сендерді Өзіне толықтай бағышталдырып, қасиетті өмір сүргізсін. Иеміз Иса Мәсіх қайтып келгенде мінсіз болуларың үшін рухтарың мен жан-тәндерің кіршіксіз пәк сақталсын."},
	{24, "24 Сендерді шақырған Құдай сенімді, Ол бұларды жүзеге асырады да."},
	{25, "25 Қымбатты бауырластар, біз үшін Құдайға сиыныңдар!"},
	{26, "26 Бауырластардың бәріне шын жүректен сүйіспеншіліктеріңді білдіріп, сәлемімізді жеткізіңдер!"},
	{27, "27 Осы хатты барлық бауырластарға да оқып беріңдер деп Иеміздің атынан тапсырамын."},
	{28, "28 Иеміз Иса Мәсіх сендерге рақымын жаудыра көрсін. (Аумин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};