#include <map>
#include <string>
class Bible28
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
	struct kk7	{ int val; const char *msg; };
	struct kk8	{ int val; const char *msg; };
	struct kk9	{ int val; const char *msg; };
	struct kk10	{ int val; const char *msg; };
	struct kk11	{ int val; const char *msg; };
	struct kk12	{ int val; const char *msg; };
	struct kk13	{ int val; const char *msg; };
	struct kk14	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Мұнда Яһуда еліне Ұзиях, Жотам, Ахаз және Езекия, әрі Солтүстік Исраилге Жоғас ұлы Еробоғам патшалық құрған кезеңдерде Жаратқан Иенің Бегери ұлы Ошияға арнаған сөздері берілген."},
	{2, "2 Жаратқан Ие хабарларын халыққа Ошия арқылы жеткізе бастағанда оған былай деді: Барып, жеңіл жүрісті бір әйелді алып, оның жезөкшеліктен туған балаларын бауырыңа бас! Өйткені осы ел Жаратқан Иеге опасыздық жасап, азғындыққа салынып кетті!"},
	{3, "3 Содан Ошия Диблаим қызы Гомерді әйелдікке алды. Ол жүкті болып, Ошияға бір ұл туып берді."},
	{4, "4 Сонда Жаратқан Ие Ошияға тіл қатып былай деді: Ұлыңның есімін Ізрел деп қой. Себебі тағы азғана уақыттан соң Мен Ехудің Ізрелде төккен қанына бола оның әулетіне назарымды аударып, оны жазалаймын және Солтүстік Исраилдің патшалығын құртып жоқ қыламын."},
	{5, "5 Сол кезде Ізрел аңғарында Солтүстік Исраилдің әскери күшін сындырылған садақ іспетті жоямын!"},
	{6, "6 Гомер қайтадан жүкті болып, қыз туды. Сонда Жаратқан Ие Ошияға тіл қатып былай деді: Оның есімін Рақым-көрмеген деп қой! Себебі бұдан былай Мен Солтүстік Исраилге рақым көрсетіп, оны кешіруімді доғарамын!"},
	{7, "7 Бірақ Яһуда еліне рақым көрсетіп, оны құтқарып қаламын. Алайда оларды құтқаратын шайқастағы садақ, семсер, атты әскер емес, Өзім — олардың Құдайлары Жаратқан Ие боламын."},
	{8, "8 Қызы Рақым-көрмеген емшектен шығарылғаннан кейін Гомер тағы бір ұл туды."},
	{9, "9 Сонда Жаратқан Ие Ошияға былай деді: Соның есімін Халқым-емес деп қой! Себебі енді сендер халқым емессіңдер, Мен де сендердің Құдайларың емеспін!"},
	{10, "10 Бірақ болашақта Исраил халқының саны теңіз жағалауындағы санаса сан жетпейтін құм түйіршіктеріндей қисапсыз көп болады. Оларға халқым емессіңдер делінген жердің өзінде олар енді Мәңгі тірі Құдайдың рухани балалары деп аталады."},
	{11, "11 Яһуданың және Исраилдің адамдары тағы да бірігіп, өздеріне бір басшыны тағайындап алады. Олар (жер аударылған) елден қайтып келеді. Себебі (халық өз елін қайтадан қоныстанатын) Ізрел күні ұлы күн болады!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Сол кезде аға-інілеріңді Өз-халқым, апа-қарындастарыңды Рақым-көрген деп атайсыңдар."},
	{2, "2 Шешелеріңнің кінәсін әшкерелеп, оған ескертіңдер! Себебі ол енді Менің әйелім емес, Мен де оның күйеуі емеспін. Ол жеңіл жүрістінің бояуын бетінен сүртіп тастап, кеуделерін ашық көрсететін киімдерін шешіп, әдепті киінсін."},
	{3, "3 Әйтпесе Мен оны анадан жаңа туғандай етіп шешіндіремін де, иен даладай, қураған жердей қылып, шөлден қаталатып өлтіремін."},
	{4, "4 Оның жеңіл жүрістен туған балаларына да рақым көрсетпеймін."},
	{5, "5 Өйткені оларды туған шешелері неке адалдығын бұзып өте ұят қылық жасады. Ол: Наным мен суымды, жүнім мен зығырымды, зәйтүн майым мен сусынымды беретін — өзімнің ашыналарым. Солардың соңынан жүрейінші! дейтін еді."},
	{6, "6 Сондықтан Мен оның жүретін соқпақтарын тікенді бұталармен жауып бөгеймін. Жүретін жол таба алмасын деп оған қарсы дуал да тұрғызамын."},
	{7, "7 Ол ашыналарының соңына түсіп қуса да, жете алмайды, оларды іздесе де, таба алмайды. Сонда ол: Мен бұрынғы Күйеуіме қайта оралайын. Сол кезде маған қазіргіден жақсы болған еді ғой! деп ұйғарады."},
	{8, "8 Ал оған бидай, жүзім шырыны мен зәйтүн майын беріп, мол саф алтын мен күмісті жаудырған Мен екенімді мойындамады. Қайта, өзі соларды жалған тәңір Бағалға сый-тарту етті."},
	{9, "9 Сол себепті Мен мерзімінде пісетін өнімім мен мезгілінде дайын болатын жүзім шырынымды, әрі оның жалаңаш тәнін жабатын жүнім мен зығырымды сол опасыздан алып қоямын."},
	{10, "10 Сонда оны ашыналарының дәл көз алдында жалаңаштап абыройын төгемін, Менің қолымнан оны ешкім құтқарып ала алмайды."},
	{11, "11 Осылайша халықтың сауық-сайрандарын, жылдық мейрамдарын, айдың бірінші күнгі мейрамдарын және демалыс күндерін, яғни оның жиналып бас қосатын барлық мерекелерін доғарамын."},
	{12, "12 Халықтың: Мынау менің ашыналарым берген сыйлықтар дейтін жүзім бұталары мен інжір ағаштарын құртып, қалың тоғайға айналдырамын. Сонда жабайы аңдар олардың жемістерін жеп қояды."},
	{13, "13 Оның Бағалдың мүсіндеріне арнап хош иісті зат түтеткен, сырғалары мен алқаларын тағып жасанып, ашыналарына ерген, ал Өзімді ұмытқан күндеріне бола енді осы халыққа назар аударып, оны жазалаймын. — Жаратқан Ие осыны нық айтады."},
	{14, "14 Ал енді Мен оны еліктіріп, айдалаға алып шығып, жүрегіне жылы сөз айтамын."},
	{15, "15 Мен оған жүзімдіктерін қайтарып беремін. Ахор (яғни Пәле) аңғары ол үшін Үмітке апаратын қақпа іспетті болады. Сол жерде ол жастық шағындағыдай, Мысырдан шыққан кезіндегідей, ән-жыр шырқайтын болады."},
	{16, "16 Жаратқан Ие тағы былай дейді: Сол күні сен Мені Бағалым менің деп емес, Күйеуім менің деп атайтын боласың."},
	{17, "17 Мен Бағал есімді жалған тәңірлердің аттарын халықтың аузынан алып тастап, олар соларды енді қайтып естеріне алмайтын болады."},
	{18, "18 Сол күні Мен даладағы жабайы аңдармен, әуедегі құстармен және жерде жорғалайтын хайуандармен халқыма нұқсан келтірмеулері жайлы келісім жасаймын. Мен соғыс, садақ, семсер атаулыны елден аластатып, жоқ қыламын. Сонда халқым ұйқыға алаңсыз жататын болады."},
	{19, "19 (Уа, халқым,) Мен сені Өзіме мәңгілікке атастырамын. Мен әділдік пен әділет, берік сүйіспеншілік пен рақымдылық танытып, сені Өзіме айттырамын."},
	{20, "20 Иә, сені Өзіме сенімділікпен әйелім етемін. Сонда сен Мені, Жаратқан Иені, мойындайтын боласың."},
	{21, "21 Сол күні Мен мінажаттарыңа жауап беремін, — деп уәде береді Жаратқан Ие. — Мен аспанға жауап беремін (де, бұлттар жіберемін), әрі аспан жерге жауап береді (де, жаңбыр жаудырады)."},
	{22, "22 Жер бидай, жүзім бұтасы және зәйтүн ағаштарына жауап береді де, шөлдерін қандырады, ал олар Ізрел! (Құдай сеуіп отырғызады) деп жауап береді."},
	{23, "23 Сол кезде Мен халықты Өзім үшін елге сеуіп отырғызып, Рақым-көрмегенге рақым көрсетіп, Халқым-еместі енді Өз-халқым деп атаймын. Ал халық Маған: Менің Құдайымсың! дейтін болады!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Бұдан кейін Жаратқан Ие маған тіл қатып былай деді: Бар, ашынасы бар, неке адалдығын бұзып келген әйеліңе қайтадан сүйіспеншілік көрсет. Дәл солай исраилдіктер бөтен тәңірлерге табынып, оларға мейіз бумаларын ұсынуды жақсы көрсе де, Мен, Жаратқан Ие, Исраил халқын әлі де сүйемін."},
	{2, "2 Сонда Мен он бес мысқал күміс пен бір жарым қап арпа төлеп, әйелімді Өзіме қайтарып алдым."},
	{3, "3 Оған былай дедім: Сен ұзақ уақыт тек менімен бірге тұрасың. Енді ешкіммен ашыналық жасап, ешбір еркекпен жақындаспайсың. Мен де сенімен жақындаспаймын."},
	{4, "4 Бұл мына жайтты білдіреді: исраилдіктер ұзақ уақыт бойы өз патшасы мен әміршісінен ада болып, құрбандықсыз, бөтен тәңірге бағышталған тас бағанасыз, діни қызметкер киетін жеңсіз сырт киімсіз және жалған тәңірлердің бейнелерінсіз тұратын болады."},
	{5, "5 Содан соң исраилдіктер қайта оралып, өз Құдайлары Жаратқан Иеге және өз патшалары — Дәуіттің ұрпағына бет бұрып мойынсұнатын болады. Олар сол кейінгі заманда Жаратқан Иені дірілдеп терең қастерлеп алдына келіп, Оның өздеріне сыйлайтын игіліктерін қабылдайтын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Жаратқан Иенің сөзін тыңдаңдар, уа, Исраил халқы! Ол осы елдің тұрғындарына қарсы дау көтермек: Елде адалдық пен мейірімділік әрі Құдайды жақыннан тануға деген ниет жоқ."},
	{2, "2 Сендер қарғанып ант бергенмен алдайсыңдар, әрі кісі өлтіріп, ұрлап неке адалдығын бұзасыңдар. Халық адамгершіліктің шегінен асып кеткен, қан төгу қан төгумен ұдайы ұласқан."},
	{3, "3 Сол себепті бүкіл елді қайғы басып, барлық тұрғындары әлсіреп қалды. Тіпті даладағы аң, құс, балық атаулы да қырылып жатыр."},
	{4, "4 Бірақ ешкім басқа біреуді айыптап, оған ұрыспасын, ей, діни қызметкерлер! Мен сендерге наразымын!"},
	{5, "5 Сендер күндіз құлайсыңдар, қастарыңдағы жалған пайғамбарлармен бірге түнде де құлайсыңдар. Сондықтан Мен шешелеріңді (Исраил халқын) құртпақпын."},
	{6, "6 Осылай Менің халқым Өзімді шынайы білмегендіктен құриды. Сендер осы білімді қажетсіз деп санағандықтан, Мен де енді сендерді діни қызметкерлерім болуға қажетсіз деп санаймын. Өздерің Құдайларыңның Таурат заңын естеріңнен шығарғандарың үшін Мен де енді сендердің балаларыңды жарылқауды есімнен шығарамын."},
	{7, "7 Діни қызметкерлер көбейген сайын олар Маған қарсы күнә жасауларын да көбейте түседі. Мен олардың салтанаттарын масқарамен алмастырамын."},
	{8, "8 Халқым күнәларының құнын өтеу үшін құрбандықтар шалып, Маған ұсынғанда діни қызметкерлер соларды жеп қояды. Олар тіпті халықтың зұлымдық жасағандарынан ләззат табады!"},
	{9, "9 Сонда халықпен қалай болса, діни қызметкерлермен де солай болады. Мен олардың екеуін де жүрген жолдарына бола жазалап, істеп келген істерінің есесін қайтарамын."},
	{10, "10 Халық тамақ жесе де, тоймайды, (жалған тәңірлердің табыну орындарында) азғындық жасаса да, балалы болмайды. Себебі олар Жаратқан Иеден бас тартты."},
	{11, "11 Енді азғындық, шарап пен басқа да ішімдіктер олардың ақыл-санасын құртады."},
	{12, "12 Менің халқым ағаш дөңбектен жасалған жалған тәңірге жүгінеді, сәуегейлікке қолданылатын сол ағаш оларға жауабын береді екен! Жүгенсіздіктің рухы оларды адастырып, олар өздерінің Құдайынан бас тартып, азғындыққа салынды."},
	{13, "13 Халқым тау-төбелердің бастарында малдарын құрбандыққа шалып, саясы ыңғайлы деп емен, терек, пісте ағаштарының түбінде жалған тәңірлерге арнап хош иісті заттарды түтетеді. Сол себепті қыздарың жезөкшелікке салынып, келіншектерің неке адалдығын бұзады!"},
	{14, "14 Ал Мен қыздарың мен келіншектеріңді сол үшін жазаламаймын. Өйткені еркектердің өздері жай жезөкшелерге де, жалған тәңірлерге бағышталған табыну орындарындағы жезөкшелерге де барады. Осылай жақсы мен жаманды айыра білгісі келмейтін халық құриды."},
	{15, "15 Уа, Солтүстік Исраил, сен өзің азғындыққа салынғанмен, Яһуда халқы да сондай күнә жасамасын! Не Ғылғалға, не Бет-Әбенге барып, жалған тәңірлерге табынбаңдар, Мәңгі тірі Жаратқан Иенің атымен ант та етпеңдер!"},
	{16, "16 Исраил иесіне көнбейтін қыңыр сиыр сияқты болып келеді. Жуырда Жаратқан Ие халықты тоқтылар іспетті кең-байтақ далада жайылуға еркіне жібере ме?"},
	{17, "17 Ефрем халқы жалған тәңірлерге үйір болып кетті, енді оны жайына қалдырыңдар!"},
	{18, "18 Ішімдіктері бітсе де, олар азғындықтарын жалғастыра береді. Елдің билеушілері осындай масқара істерді қатты сүйеді."},
	{19, "19 Оларды құйын көтеріп алып кетпек. Сонда олар жалған тәңірлерге құрбандық шалып, ұсынғандарына ұялатын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Мынаны тыңдаңдар, уа, діни қызметкерлер! Құлақ салыңдар, уа, Исраилдің билеушілері, мұқият тыңдаңдар, патшаның әулеті! Сендерге үкім шығарылады. Өйткені Миспа мен Табордағы табыну орындарында халықты тұзақ пен торға түсірдіңдер."},
	{2, "2 Бұл опасыздар азғындыққа әбден батты, енді Мен олардың бәріне тәлім беріп, жазаларын тартқызамын."},
	{3, "3 Ефрем руын білемін, бүкіл Исраил халқы да Менен жасырын емес. Себебі сен, Ефрем, азғындыққа салынып кеттің, содан Исраилдің бәрі арамданды."},
	{4, "4 Халықтың жасап жүрген зұлым істері өздерінің Құдайына қайтып келулеріне жол бермейді. Себебі оларды азғындықтың рухы билеп алды, әрі олар Жаратқан Иені мойындаған жоқ."},
	{5, "5 Исраилдің асқақтығы оның өзіне қарсы куәлік етеді. Исраилдіктер, соның ішінде Ефрем руы, өз зұлым істерінен сүрініп құлайды. Яһуда халқы да олармен бірге сүрініп құлайды."},
	{6, "6 Ұсақ және ірі қара малдарын айдап әкеліп, құрбандыққа шалып, Жаратқан Иеге қаншама дұға етсе де, Оны таба алмайды. Себебі Ол солардан алшақтап кетті."},
	{7, "7 Олар некесіз балалар туғызып, Жаратқан Иеге опасыздық жасады. Енді әр айдың алғашқы күні орындайтын діни рәсімдері олардың өздерін жер үлестерімен қоса жалмап жеп қояды."},
	{8, "8 Гибеяда керней тартып, Рамақта да дабыл қағыңдар! Бет-Әбенде: Уа, Бунямин руы, саған ереміз! деп атой салыңдар!"},
	{9, "9 Жазаланатын күні Ефремнің жері қаңырап бос қалады! Мен болашақта ешбір шүбәсіз болатын жайттарды Исраил руларының арасында жариялап отырмын."},
	{10, "10 Яһуда билеушілерінің іс-әрекеттері жер үлестерінің межелерін құпия өзгерту сияқты сұмдық болып кетті. Сондықтан оларға қаһарымды тасқын судай жаудырамын."},
	{11, "11 Ефремнің халқы түкке тұрмайтын тәңірсымақтың жолын қууды қалағандықтан сотталып, қатты қысым көріп күйзелуде."},
	{12, "12 Сол себепті Мен Ефрем елін күйе сияқты, Яһуда елін көгертіп шіріткен зең сияқты құртамын."},
	{13, "13 Ефрем өз ауруын, Яһуда да өз жарасын байқап қалғанда, Ефрем Ассур еліне бет бұрып, оның ұлы патшасына елшілерін жіберді. Бірақ ол сендерді сауықтырып, жараларыңды жаза алмайды."},
	{14, "14 Себебі Мен Ефрем халқы үшін арыстан іспетті, Яһуда халқы үшін жас арыстан сияқты мейірімсіз боламын. Мен Өзім оларды паршалап жарып тастаймын да, орындарынан алып кетемін. Сонда оларды құтқаратын ешкімі болмайды."},
	{15, "15 Олар ауыр кінәларын мойындап, алдыма келіп еркімді сұрамайынша, Мен көктегі орныма қайтып кетемін."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 Азапталған күйлерінде олар Маған бет бұрып, өзара былай десетін болады: Келіңдер, Жаратқан Иеге қайтадан мойынсұнайық! Ол бізді жарып, жарақаттап еді, енді жарамызды жазады. Ол бізді соққан еді, енді сол жерімізді таңады."},
	{2, "2 Екі күннен кейін Ол бізге жан бітіріп, үшінші күні қайта тұрғызады. Сонда біз Оның көз алдында өмір сүретін боламыз."},
	{3, "3 Ендеше Жаратқан Иені мойындап, Оны жақыннан танып білуге жан сала ұмтылайық! Ертеңгісін таң атпай қоймайтынындай, Жаратқан Иенің келуі де сондай шүбәсіз. Ол бізге игілікті нөсердей, жерді суға қандыратын көктемгі жаңбырдай сөзсіз келетін болады."},
	{4, "4 Уа, Ефрем халқы, саған не істесем екен? Ал саған ше, Яһуда елі? Сендердің сенімді болуларың әрі кеткенде таңғы бұлт іспетті. Я болмаса, таң ата салысымен буға айналып кететін шық сияқты."},
	{5, "5 Сондықтан өз пайғамбарларым арқылы сендерді кескіленуге бұйырып, аузымнан шыққан сөздеріммен өлтірілуге соттадым. Шығарған үкімім атқан таңдай айқын болады."},
	{6, "6 Мен өздеріңнен құрбандық шалғандарыңнан гөрі берік мейірімділік көрсеткендеріңді қалаймын, құрбандықтардың етін өртеп ұсынғандарыңнан гөрі Мені, Құдайды, жақыннан танып сүйгендеріңді ұнатамын."},
	{7, "7 Бірақ сендер Адам (ата) сияқты Келісімімді бұзып, сөйтіп Маған опасыздық жасадыңдар."},
	{8, "8 Ғилақад та зұлымдық жасаушылардың қанға боялған қаласы!"},
	{9, "9 Жолаушы адамды аңдып жататын қарақшылар сияқты, діни қызметкерлер бір тобыр болып Сихемге баратын жолда кісі өлтіріп, жексұрын қиянат жасады."},
	{10, "10 Исраил елінде жан түршіктіретін сұмдықты көрдім: Ефремнің халқы азғындыққа салынып, Исраил елі арамданып кеткен екен!"},
	{11, "11 Уа, Яһуда елі, Мен саған да орақ маусымы іспетті жазаланатын мезгіліңді белгілеп қойдым! Мен халқым Исраилді тұтқында жүрген жерінен қайтарып әкелгім келеді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct kk7 poems[] = {
	{1, "1 Бірақ оны осылай ауруынан сауықтырмақ болған кезімде Ефремнің күнәлары әшкереленеді, әрі Самарияның қылмыстары жария болады. Халықтың айналысатыны — алдамшылық, ұрылары үйлерге бұзып кіріп, қарақшылары көшеде адам тонайды."},
	{2, "2 Бірақ олардың істеген барлық зұлым іс-әрекеттерін есімде сақтайтынымды өздері ойламайды. Жаман қылықтары халықты қоршап алған, солары Менің көз алдымда."},
	{3, "3 Халық зұлымдық істеп патшаларын, жалғандық жасап әміршілерін мәз қылады."},
	{4, "4 Олардың барлығы да неке адалдығын бұзушылар! Қамырды илеген кезден бастап нан жабуға дайын болғанға дейін өшпей жанып тұратын тандыр сияқты, солардың барлығы да құмарлықтың отына күйіп-жануда."},
	{5, "5 Патшамыздың құрметіне жасалған той! деп әміршілер шараптың қызуына елігіп кеткенде, патша өркөкірек мазақтаушыларды қолдайды."},
	{6, "6 Олардың жан дүниелері пештей лаулайды, ойлағандары — қулық-сұмдық. Түні бойы ашу-ызалары сөнбей бықсып, таңертең жалындай лап ете қалады."},
	{7, "7 Бәрі де пеш сияқты өз билеушілерін жалмай береді. Патшаларының барлығы зорлықпен өлтірілді. Ал олардың ешқайсысы Менен көмек сұрамады."},
	{8, "8 Ефремнің халқы бөтен халықтармен араласып кетті. Ол төңкерілмеген, сондықтан бір жағы күйіп, екінші жағы шикі піскен нан сияқты болып қалды."},
	{9, "9 Бөгде адамдар оның қуатын жалмауда, бірақ ол соны білмейді. Оның басын ақ қырау шалған, бірақ ол соны да байқамайды."},
	{10, "10 Исраил өз асқақтығымен өзін әшкерелейді, бірақ олар бәрібір өздерінің Құдайы Жаратқан Иеге қайтпайды да, Оның еркін сұрамайды да."},
	{11, "11 Сондықтан Ефрем халқы көгершін сияқты аңғал да санасыз болып қалды. Олар біресе Мысырды шақырып, біресе Ассурға барып, қолдау сұрайды."},
	{12, "12 Ал Мен олар барған кезде үстеріне торымды тастаймын. Оларды аспанда ұшып жүретін құстар сияқты жерге түсіріп, жиындарында сөз болған қылықтарына сәйкес жазалап түзетемін."},
	{13, "13 Халық Менен адасып кеткендіктен қасіретке қалады! Олар Маған қарсы бас көтергендіктен енді апатқа душар болады! Оларды құтқарар да едім, бірақ олар Мен туралы өтірік айтып келеді."},
	{14, "14 Халық Маған шын жүректен жалбарынбайды. Оның орнына олар төсектерінде жатып еңіреп жылайды. Расында олар Менен алшақтап кетіп, жиындарында бидай мен жүзім мол болсын деп жалған тәңірден сиынып сұрайды."},
	{15, "15 Халыққа тәлім-тәрбие беріп, күшейткен Өзім едім, бірақ олар Маған қарсы зұлымдық ойластырады."},
	{16, "16 Халық Маған, Алла Тағалаға, емес, Бағалға бет бұрады. Содан да олар қисық садақ сияқты пайдаға аспайды. Елдің әміршілері тілдерінен шыққан ашулы сөздердің кесірінен семсерден өледі. Сол үшін олар Мысыр елінде жұрттың күлкісіне қалады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct kk8 poems[] = {
	{1, "1 Керней тартып дабыл қағуға дайындал! Жау бүркіт сияқты Жаратқан Иенің елінің үстінде ұшып жүр. Себебі олар Менің өздерімен жасаған Келісімімнен айнып, Таурат заңымды бұзып келеді."},
	{2, "2 Сонда да Солтүстік Исраил Мені шақырып: Сен біздің Құдайымызсың, Сені мойындаймыз, (көмектесе гөр)! — деп жалбарынады."},
	{3, "3 Ал Солтүстік Исраил ізгі нәрседен бас тартты, енді жау оны қуатын болады."},
	{4, "4 Халық өзіне патшаларын тағайындады, бірақ олары Менің еркіме сай емес. Олар билеушілерін де қойды, бірақ Мен бұларын құптаған жоқпын. Өздерінің алтын-күмісінен халық жалған тәңір мүсіндерін жасап алды, әйтсе де олар құрып кетеді."},
	{5, "5 Жас бұқа кейпінде жасалған жалған тәңірің әбден жек көрінішті, уа, Самария елі! Мен осы халыққа қатты қаһарланып отырмын. Қашан ғана олар зұлымдықтан арылып тазарар екен?"},
	{6, "6 Сол тәңірсымақты Исраилдің өзі бір қолөнершіге жасатып алды. Сондықтан ол Құдай емес! Иә, Самарияның жас бұқа кейпіндегі жалған тәңірі күл-парша болып сындырылады!"},
	{7, "7 Халықтың еккені жел еді, енді жинағандары құйын болады. Шыққан егіндерінің бастары — құр қауыз. Дән бола қалған күнде де бөтен елдіктер оны жалмап кетеді."},
	{8, "8 Солтүстік Исраилдің елін жау жалмап кетеді. Оның халқы басқа халықтардың арасында ұнамсыз ыдыс сияқты болып қалды."},
	{9, "9 Себебі олар жалғыз дара қаңғырып жүретін жабайы есек сияқты Ассурға барды. Ефрем елі өзіне ашыналарды (яғни арқа сүйейтін одақтастарды) жалдады."},
	{10, "10 Олар алым-салықтарымен жат халықтарды жалдап алған болса да, Мен Ефремнің халқын бәрібір бір жерге жинап, соттаймын. Олар қуатты патшаның езгісіне түсіп, азап шеге бастайды."},
	{11, "11 Ефрем халқы күнәнің құнын өтейтін құрбандықтар ұсынылатын үстелдерді көптеп орнатты, бірақ олары, керісінше, нағыз күнә жасайтын орындар болып кетті!"},
	{12, "12 Мен халыққа Таурат заңымдағы ережелерді егжей-тегжейлі жазып бергенмен, олар соларды бір жат нәрсе деп санайды."},
	{13, "13 Халық Маған арнап малдарын құрбандыққа шалып, етін жесе де, Мен, Жаратқан Ие, соларына риза емеспін. Қайта, Мен халқымның істеген зұлымдықтарын есіме алып, оларды күнәлары үшін жазалаймын: халқым өздері бұрын құл болған Мысырға қайта оралатын болады!"},
	{14, "14 Солтүстік Исраил өз Жаратушысын ұмытып, үлкен ғимараттар салды. Яһуда елі көптеген қалаларын қамалмен бекітті. Бірақ Мен олардың қалаларына от жіберемін. От солардағы қорғандарын өртеп жалмап қояды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct kk9 poems[] = {
	{1, "1 Уа, Исраил, қуанба, басқа халықтардай шаттанба! Сен өз Құдайыңнан бас тартып, жалған тәңірлерге табынып азғындыққа салынып келесің. Астық бастыратын қырмандардың әрбірінде жезөкшелік жасап, соның ақысын жақсы көресің."},
	{2, "2 Бұдан былай астық қырмандары мен жүзім сыққыштары халықты асырамайтын болады. Олардың аламыз деген жүзім шырыны да болмай қалады."},
	{3, "3 Халық Жаратқан Иенің осы елінде қалмайды. Жоқ, Ефрем Мысырға қайта оралып, Ассур елінде де арам тамақты жейтін болады."},
	{4, "4 Халық енді Жаратқан Иеге сұйық тартуларын құйып ұсынбайды, Ол солардың құрбандықтарына да риза болмайды. Себебі бұл құрбандықтары адамы қайтыс болған үйдің тамағы сияқты арам болып саналады. Сол тамақты олар тек қарындарын тойдыру үшін ғана жейді, оның ешбір бөлігі Жаратқан Иенің киелі үйіне апарылмайды."},
	{5, "5 Сендерге белгіленген мейрам күндері не істейтін боласыңдар? Жаратқан Иенің (алдына баруларың керек) діни мереке күндерін қалайша атап өтпексіңдер?"},
	{6, "6 Ассурдың талқандауынан бас сауғалап қашсаңдар да, сендерді Мысыр патшалығы жинап алып, құртады. Мәйіттерің сондағы Мемфис қаласында жерленбек. Күмістен жасалған бағалы заттарыңды арам шөп басып, шатырларыңда тікенек қаулап өсіп кететін болады."},
	{7, "7 Құдайдың жазалап, қарымтасын қайыратын күндері келіп қалды! Әй, Исраил халқы, осыны біліп қойыңдар! Күнәларыңның көп болғаны сонша, әрі өштесуіңнің де күшті болғаны сонша, сендер пайғамбарды ақымақ, Рухқа бөленген адамды жынды деп есептейсіңдер!"},
	{8, "8 Пайғамбар Құдайдың Ефремге қойған күзетшісі болған еді. Ал пайғамбар қай жерге барса да, оның алдында құс аулаушынікіндей тұзақ құрылған. Тіпті өз Құдайының киелі үйіндегілер де оған қастық танытуда."},
	{9, "9 Исраил халқы Гибеяның кезіндегідей азғындыққа терең батып кетті. Құдай кінәларын есінен шығармай, оларды күнәлары үшін жазалайтын болады."},
	{10, "10 Менің Исраилді тапқаным иен далада өсіп тұрған тәтті жүзімді табумен бірдей болды. Мен ата-бабаларыңа інжір ағашының алғашқы маусымында ерте піскен жемісіндей қарап, қатты ұнаттым. Бірақ олар Бағал-Пеғорға келгенде өздерін сондағы масқара тәңір мүсініне бағыштап, содан өздері жақсы көрген сол мүсін сияқты жиренішті болып кетті."},
	{11, "11 Ефрем елінің салтанаты құс сияқты пыр етіп ұшып кетеді! Себебі сендерде енді қайтып бала туылмайды, ешбір келіншек құрсақ көтеріп аяғы ауырламайды."},
	{12, "12 Ал егер асырайтын бала-шағасы бола қалса, Мен сендерді соларыңнан да айырамын, бірде-біреуін тірі қалдырмаймын. Мен Ефремнен түбегейлі бас тартқан кезімде халық нағыз қасіретке қалады!"},
	{13, "13 Ефрем халқы Тир елі іспетті құнарлы көгалда өсіп тұр екен, соны көрдім. Бірақ болашақта ол өз балаларын оларды өлтіретін жаудың алдына шығаруға мәжбүр болады."},
	{14, "14 Уа, Жаратқан Ие, өз халқыңа нені беруіңді тілейін? Олардың әйелдерін бала туа алмайтын, бала туа қалса, сүті болмай, емізе алмайтын қыла гөр!"},
	{15, "15 Олардың зұлым істерінің барлығы Ғылғалда басталған, сол жерде Мен оларды жек көре бастадым. Істеген іс-әрекеттерінің сұмдық болғаны сонша, оларды өз үйімнен қуып шығамын. Мен халықты енді сүймеймін! Олардың әміршілерінің бәрі де — тура жолдан адасқан қыңырлар."},
	{16, "16 Ефрем халқы қатты соққы жеді. Тамырлары қурап қалған, олар енді жеміс бермейді. Бала туа қалған күнде де, Мен олардың құрсақтан шыққан қымбат нәрестелерін өлтіремін."},
	{17, "17 Олар Құдайыма мойынсұнбағандықтан, Ол халықты Өзінен аластатып тастайды. Содан олар басқа халықтардың арасында кезбе болып кетеді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct kk10 poems[] = {
	{1, "1 Исраил жемісін беретін жайқалған жүзім бұтасына ұқсайды. Ал жемісі көбейген сайын халық құрбандық үстелдерін көптеп салады. Ел өркендеген сайын, халық жалған тәңірлерге арналған киелі бағаналарды өрнектеп әшекейлеп отыр."},
	{2, "2 Бұлардың кінәсі — екіжүзділігі. Жаратқан Ие олардың құрбандық үстелдерін қиратып, киелі бағаналарын талқандамақ."},
	{3, "3 Содан соң Исраил халқы: Біз Жаратқан Иені құрметтемеген едік, содан біздің патшамыз жоқ. Бірақ патшамыз болған күнде де, ол біз үшін не істей алар еді? — дейтін болады."},
	{4, "4 Ал олардың айтатыны жай сөздер ғана, келісім жасағанда беретін анттары құр өтірік. Сондықтан оларға тағылатын айып өңделіп жыртылған жерде қаулап өсетін арам шөп сияқты болмақ."},
	{5, "5 Самарияның тұрғындары Бет-Әбенде орналасқан жас бұқа мүсіні туралы уайымдайтын болады. Бүкіл халық оны жоқтап қайғырып, осы жалған тәңірдің діни қызметкерлері оның бұрынғы салтанатын ойлап еңіреп жылайтын болады. Себебі сол мүсін де жау еліне әкетіледі."},
	{6, "6 Мүсін Ассурдың ұлы патшасына арналған алым-салық ретінде оның еліне жіберіледі. Ефрем халқы масқара болып, бүкіл Исраил елі өзінің ағаш тәңірлері үшін ұялатын болады."},
	{7, "7 Самария жойылады, оның патшасы су бетінде жүзіп жүрген бұтақша іспетті ғайып болады."},
	{8, "8 Исраилдің күнәға батқан жері — Бет-Әбендегі табыну орындары қиратылмақ. Осы биіктеу жерлердегі құрбандық үстелдерінде тікенді бұта мен ошаған қаулап өсетін болады. Сол кезде адамдар тауларға: Бізді басып, жасырып тастаңдар! әрі төбелерге: Үстімізге құлап түсіңдер! — деп жалынатын болады."},
	{9, "9 Уа, Исраил! Сен Гибеяда азғындыққа батқан кезіңнен бастап күнә жасап келесің! Қазір де дәл сол қалыптасың. Гибеяда зұлымдық жасаған сол адамдарды соғыс баудай түсірді емес пе?"},
	{10, "10 Мен қалаған кезімде осы халықты жазалаймын. Халық көптеп жасаған ауыр күнәлары үшін шынжырлармен байланып жер аударылады. Сонда барша халықтар оларға қарсы жиналатын болады."},
	{11, "11 Ефрем — астық басуға үйретілген, сол жұмысты ұнататын жас сиыр сияқты. Ал енді Мен Ефремнің күшті мойнына мойынтұрық салып, оны жер айдауға жұмсаймын. Яһуда да жер жыртатын болады, Жақыптың күллі ұрпақтары бұдан кейін егістікті малалайды."},
	{12, "12 Өз өмірлеріңдегі тың жерлеріңді жыртыңдар, әділдіктің дәнін себіңдер! Солай берік мейірімнің жемісін жинап аласыңдар. Себебі осы кез — Маған, Жаратқан Иелеріңе, бет бұрып, мойынсұнатын уақыт! Сонда Мен сендерге келіп, кешірім беріп, ақталуды жаңбырдай жаудырамын."},
	{13, "13 Ал сендер зұлымдықты септіңдер, одан шыққан өнім — әділетсіздік, ал жеген жемістерің — өтіріктеріңнің нәтижесі болды. Өз күш-қуаттарыңа, әскери күштеріңнің молдығына сенім арттыңдар."},
	{14, "14 Сол себепті халқыңа бір зор апат төніп, барлық қамалдарың қиратылады. Бұл, Салман Бет-Арбелді қиратқан шайқас күніндей болады. Сонда аналар балаларымен бірге ұрылып өлтірілген еді."},
	{15, "15 Орасан зор зұлымдығың үшін саған да дәл осы нәрсе істелінеді, уа, Бетел қаласы!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct kk11 poems[] = {
	{1, "1 Исраилдің патшасы сол күнгі таңда мүлдем құриды! Исраил әлі де жас болғанда оны сүйетін едім, Мен рухани ұлымды Мысырдан шақырып алдым."},
	{2, "2 Бірақ Мен халықты Өзіме неғұрлым шақырған сайын олар соғұрлым қасымнан алшақтай берді. Олар Бағалдың бейнелеріне арнап құрбандық шалып ұсынып, сол мүсіндердің құрметіне хош иісті заттарды түтетіп жүрді."},
	{3, "3 Ал Ефремді қолынан жетелеп, аяғын тәй-тәй басып жүруді үйреткен Өзім болатынмын. Өздерін сауықтырған да Мен екенімді халық мойындағылары келмеді."},
	{4, "4 Мен оларды ыңғайлы ноқтамен, сүйіспеншіліктің арқанымен жетелеп жүрдім. Мойынтұрықтарын мойындарынан шешіп алып тастап, оларды тамақтандыру үшін еңкейетін де едім."},
	{5, "5 Маған қайта оралудан бас тартқан соң, халық енді Мысыр еліне қайта оралмай ма? Ассур оларға патшалық құрмай ма?"},
	{6, "6 Сол кезде олардың қалаларында семсерлер жарқылдап, қақпаларының ысырмаларын сындырады. Зұлым ой-ниеттері үшін оларды жалмап құртады."},
	{7, "7 Өз халқым Менен теріс бұрылуға бейім. Олар (Бағалға) биіктеу жерлерде қаншама сиынғанмен, ол соларды (мүшкіл жағдайларынан) еш шығармайды."},
	{8, "8 Мен сені қалайша тастап кетемін, уа, Ефрем? Сені қалайша ұстап беремін, уа, Исраил? Мен сені қалайша Адмадай тастап, Себоимдей ойрандаймын? Жүрегімде ниетім өзгеріп, аяушылығым арта түсті."},
	{9, "9 Сонда Мен лаулаған қаһарымды жүзеге асырмаймын, Ефремді қайтадан құртпаймын. Себебі Мен пенде емес, Құдаймын. Араларыңда тұратын Киелі Құдаймын. Сол кезде сендерге ашу-ызамен келмеймін."},
	{10, "10 Халық Менің соңымнан еріп, Мен, Жаратқан Ие, арыстандай ақыратын боламын. Мен ақырғанда, балаларым батыс жақтан дірілдеп қайтып келеді."},
	{11, "11 Олар Мысыр елінен құстай болып, Ассур елінен де көгершіндей болып дірілдеп қайтып келеді. Мен халқымды үйлеріне қайтадан орналастырамын! — деп уәде береді Жаратқан Ие."},
	{12, "12 Ефрем халқы мені жалған сөздермен қоршап, Исраил халқы өтірікпен қамап жатыр. Яһуда халқы әлі де Құдайдан, Киелі Жасаған Иеден, тайып өз бетімен жүр."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct kk12 poems[] = {
	{1, "1 Ефрем халқы желмен тамақтанатын сияқты. Олар күні бойы шығыстан соғатын желді қуып, өтірік пен зорлықты көбейтеді. Олар Ассур патшалығымен одақтасып, Мысырдан да қолдау көру үшін сол елге зәйтүн майын тасып апарады."},
	{2, "2 Жаратқан Ие Яһуданы да айыптамақ. Ол Жақыптың үрім-бұтағын жүрген жолдары үшін жазалап, істеген істерінің есесін қайтармақ."},
	{3, "3 Түпкі атасы Жақып ана құрсағында жатқанда-ақ егіз бауырласының өкшесінен ұстап алып, оны алдап соқты. Ер жеткенде ол Құдаймен күресті."},
	{4, "4 Сол кезде Жақып Құдайдың періштесімен күресіп, үстем болды, әрі періштеден ақ бата беруін жылап өтінді. Осылайша ол Бетелде Құдаймен кездесіп, тілдесті,"},
	{5, "5 Жаратқан Иемен, Әлемнің Әміршісі Құдаймен! Оның Жаратқан Ие деген аты әлемге кең танымал."},
	{6, "6 Өзің де Құдайға қайта оралып, берік сүйіспеншілік пен әділдікті сақта! Әрқашан өз Құдайыңа үмітіңді арт!"},
	{7, "7 Ал саудагерлердің таразылары дұрыс емес, олар алдамшылықты ұнатады."},
	{8, "8 Ефрем: Мен байыдым, барлығын да өзім таптым! Істегенімнің бәрінен ешкім күнә дейтіндей бірде-бір бұрыс іс таба алмайды! — деп мақтанып жүр."},
	{9, "9 Бірақ Мен өзіңді Мысыр елінен шығарған Құдайың Жаратқан Иемін. Бұрын айдалада Менімен кездескен кезіңдегідей, Мен сені қайтадан шатырларға қоныстандырамын."},
	{10, "10 Мен пайғамбарларға тіл қатып, көп рет аян бердім, әрі олар арқылы астарлы сөздерімді айтып халқыма ескерттім."},
	{11, "11 Ғилақадтың халқы зұлымдық жасаса, олар құрып кетеді. Ғылғалда да халық құрбандыққа мүйізді ірі қара мал шалып келеді. Расында олардың құрбандық үстелдері өңделіп жыртылған егістіктің шетіндегі тас үйінділері сияқты тізіліп тұр."},
	{12, "12 Ежелде Жақып Солтүстік Месопотамия еліне қашып барған болатын. Исраил деп те аталған Жақып сол жерде әйелі үшін қызмет етіп, мал бақты."},
	{13, "13 Кейін Жаратқан Ие Исраилдің үрім-бұтағын бір пайғамбары арқылы Мысырдан алып шығып, бір пайғамбары арқылы аман сақтап жүрді."},
	{14, "14 Бірақ Ефрем Жаратқан Иені қатты ашуландырды, сол себепті Ол Ефремді қылмыстары үшін жазалап, істеген барлық масқара қылықтарының қарымтасын қайтарады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct kk13 poems[] = {
	{1, "1 Өткен замандарда Ефрем тіл қатқанда адамдар қалтырап оның айбатынан сескенетін. Исраилде осы рудың мерейі үстем болатын. Бірақ кейін ол жалған тәңір Бағалға табынып кінәлі болды, мұның соңы өлімге апарып соқты."},
	{2, "2 Ал енді олар күнәға бұрынғыдан бетер батып, өздеріне жалған тәңір мүсінін жасатып алды. Бұл мүсіндерді қолөнершілер шеберлікпен күмістен құйды. Осы жас бұқа мүсіндеріне арнап құрбандық шалғандарға: Оларды өбіп сүйіңдер! — дейді."},
	{3, "3 Сондықтан олар тез сейілетін таңғы тұман не тез кебетін шық сияқты, әрі қырманнан жел айдап ұшыратын кебек не үйдің мұржасынан шығатын түтін сияқты лезде ғайып болады."},
	{4, "4 Бірақ Мен сендерді Мысыр елінен алып шыққан Құдайларың Жаратқан Иемін. Өзімнен басқа ештеңені Құдай деп танымаңдар! Менен өзге ешбір құтқарушы жоқ."},
	{5, "5 Мен сендерге иен далада, қуаңшылық жайлаған елде қамқорлық жасадым."},
	{6, "6 Халық жақсы жайылымға қоныстанғанда қарындары тоқ болды. Қарны тойынған кезде олар асқақтап, Мені естерінен шығарды."},
	{7, "7 Сондықтан Мен оларға арыстан сияқты тап беріп, қабылан сияқты жүрер жолын аңдып, шабуыл жасаймын."},
	{8, "8 Оларға қонжықтарынан айырылған ұрғашы аюдай бас саламын да, кеуделерін жарып тастаймын. Оларды арыстандай жалмап, жыртқыш аңдай жыртамын."},
	{9, "9 Өзіңді-өзің құрттың, уа, Исраил! Сен өзіңе көмек беретін Маған қарсысың!"},
	{10, "10 Сенің патшаң қайда екен? Ол сені күллі қалаларыңда құтқарып алсын! Маған патша мен әміршілер бер! деген едің. Енді сол билеушілерің қайда жүр?"},
	{11, "11 Сол себепті Мен ашуланып тұрып, сендерге бір патшаны тағайындадым. Ал кейін қаһарланып, оны сендерден алып тастадым."},
	{12, "12 Ефрем халқының зұлым істері жинаулы тұр, олардың күнәларының бәрі де жазулы."},
	{13, "13 Халық анасы толғақ азабын тарта бастаса да, құрсақтан шыққысы келмейтін түйсіксіз сәбиге ұқсайды."},
	{14, "14 Мен оларды о дүниенің билігінен босатып, өлімнен құтқарып аламын ба? (Жоқ, солай істемеймін.) Өлім, қайда улы тісің? О дүние, қайда сенің жеңісің? Мен еш аяушылық көрсетпеймін."},
	{15, "15 Ефрем бауырлас руларының арасында жайқалып өсіп-өнетін. Ал енді Жаратқан Ие шөл даладан шығыстың аптап желін жібереді. Сонда Ефремнің бұлағы құрғап, су көзі тартылып қалады. Ефрем қазына қоймасындағы құнды заттарының барлығынан айырылады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct kk14 poems[] = {
	{1, "1 Құдайына мойынсұнбай қарсы шыққандары үшін Самарияның халқы кінәларының кесірінен жазаланатын болады. Олар семсерден өледі. Жас балаларын жау жерге соғып өлтіріп, жүкті әйелдерінің іштерін жарады."},
	{2, "2 Уа, Исраил халқы, өз Құдайың Жаратқан Иеге қайта орал! Осылай күйрегеніңе өз күнәларың себепші болды."},
	{3, "3 Кінәларыңды мойындайтын сөздер айтып, Жаратқан Иеге қайтып келіңдер! Оған былай деңдер: — Барлық күнәларымызды кешіріп, бізді рақыммен қабылдай гөр! Саған аузымызбен мадақтау айтып, соны сый-тарту ретінде ұсынбақпыз."},
	{4, "4 Ассур бізді құтқара алмайды, біз атқа мініп, өз күшімізге де сенім артпаймыз. Бұдан былай өз қолымызбен жасаған бұйымға: Біздің тәңіріміз! деп табынбаймыз. Сенен ғана, уа, Жаратқан Ие, жетімдер рақым табады."},
	{5, "5 — Мен оларды опасыз мінездерінен сауықтырып, өз мейіріміме сәйкес жақсы көремін. Себебі оларға деген қаһарым қайтты."},
	{6, "6 Мен Исраилді жерге түскен шықтай сергітетін боламын. Сонда Исраил лалагүлдей жайнайды, әрі Ливан тауындағы самырсын ағаштарындай тамырларын тереңге жібереді."},
	{7, "7 Исраилдің жас өркендері кең жайылып өседі. Ол зәйтүн ағашындай көрікті, ал хош иісі Ливан самырсынының жұпарындай болады."},
	{8, "8 Халқым қайтып келіп, саямда тыныстап, дәнді дақылдай бітік өсіп, жүзім бұтасындай гүлдейді. Сонда атағы жайылып, Ливан шарабындай кең танымал болады."},
	{9, "9 Ефрем сонда: — Қойшы сол жалған тәңірлерді! — деп айтпақ. (Ал Мен мынадай жауап беремін:) — Мен сені естіп, назарымда ұстаймын. — Мен жайқалған арша ағашы сияқтымын. — Сенің жеміс беруің Менің жарылқауыммен."},
	{10, "10 Кім бұларды ұғынатындай дана болады? Кімнің түсінігі бар болса, соларға көз жеткізеді. Жаратқан Иенің көрсеткен жолдары түзу, әділдер олармен жүретін болады, ал Иемізге қарсы бас көтергендер соларда сүрініп құлайды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};