#include <map>
#include <string>
class Bible17
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
	struct kk7	{ int val; const char *msg; };
	struct kk8	{ int val; const char *msg; };
	struct kk9	{ int val; const char *msg; };
	struct kk10	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Бұл оқиға Ахасуер патшаның заманында болды. Ол Үндістаннан бастап Құш еліне дейін ұласқан жүз жиырма жеті аймаққа патшалық құрды."},
	{2, "2 Сол кездері Ахасуер Сузы қорғанындағы сарайының тағында отырып билік жүргізді."},
	{3, "3 Патшалық құрған үшінші жылы Ахасуер қарамағындағы барлық әміршілері мен қызметкерлеріне арнап той жасады. Тойға Персия мен Мидияның әскербасылары әрі аймақтардың ақсүйектері мен әміршілері жиналды."},
	{4, "4 Патша ұзақ уақыт — толық жүз сексен күн бойы патшалығының ағыл-тегіл байлығын әрі өзінің салтанатты ұлылығының қаншалықты тамаша екендігін көрсетумен болды."},
	{5, "5 Осы күндер өткен соң, патша енді Сузы қорғанындағы жасы бар, кәрісі бар бүкіл халыққа да арнап жеті күндік той жасады. Той патша сарайының саябағындағы аулада өтті."},
	{6, "6 Сол орын ақ және көк түсті бәтестен тігілген перделермен безендірілген болатын. Олар мәрмәр бағаналарға тағылған күміс шығыршықтарға ақ бәтес және қырмызы түсті жіптермен байланған еді."},
	{7, "7 Қызыл және ақ мәрмәр, маржан әрі түрлі-түсті асыл тастардан төселген еденге алтын, күміс түсті қамқамен қапталған жастықтар қойылған болатын."},
	{8, "8 Патшаның жомарттығына сай молынан әкелінген шарап алуан түрлі үлгідегі алтын ыдыстарға құйылып беріліп отырды. Патшаның әмірімен әр қонақ еш мәжбүрленбей, қалай ішкісі келсе, солай іше алды. Себебі патша шарап тасушыларға әркімге қалағанын алып келуді бұйырған болатын."},
	{9, "9 Астин патшайым да әйелдерге арнап Ахасуердің патшалық сарайында той жасады."},
	{10, "10 Жетінші күні шарапқа қызыңқырап алған патша қасындағы жеті сарай қызметкерін өзіне шақырып алды. Олардың есімдері Меһуман, Бизта, Харбона, Биқта, Абақта, Зетар, Қарқас болатын. Патша оларға:"},
	{11, "11 Астин патшайымды басына тәжін кигізіп алдыма алып келіңдер! — деп бұйырды. Патша халыққа және лауазымды адамдарға патшайымның сұлулығын көрсетпек болды. Өйткені ол аса көрікті әйел болатын."},
	{12, "12 Алайда Астин патшайым патшаның сарай қызметкерлері арқылы жіберген бұйрығын орындаудан бас тартты."},
	{13, "13 Бұған патша қатты ашуланып, бойында қаһары лаулады. Содан патша елдің тарихынан хабардар данышпан кеңесшілерімен ақылдасты. Өйткені оның заңдар мен әділетті білетін күллі адамдарымен ақылдасатын әдеті бар еді."},
	{14, "14 Сол кезде патшаға парсы және мидиялық мына жеті қызметкері жақын жүретін: Қаршена, Шетар, Адмата, Тарсис, Мерес, Марсена, Мемухан. Олар патшаның алдына келе алатын. Бүкіл патшалықта сол жетеудің мәртебесі жоғары болды."},
	{15, "15 Патша оларға мына сауалды қойды: — Заң бойынша Астин патшайымға қандай шара қолданған жөн? Өйткені ол патшаның сарай қызметкерлері арқылы жіберген бұйрығын орындаған жоқ."},
	{16, "16 Сонда Мемухан патша мен әміршілердің алдына шығып былай деді: — Астин патшайым патша ағзамға да, өзіңізге қарайтын барша аймақтардағы күллі әміршілер мен бүкіл халықтарға да зұлымдық жасады."},
	{17, "17 Себебі патшайымның осы қылығы жайлы басқа барлық әйелдердің құлақтарына жетпек. Сонда олар: Ахасуер патша Астин патшайымды өз алдына әкелуді бұйырғанда ол келмей қойды! деп, өз қожайындарын менсінбей кететін болады."},
	{18, "18 Бүгін-ақ Персия мен Мидиядағы текті әйелдер патшайымның осы істегені туралы естіп, патшаның күллі әміршілеріне де дәл солай демек. Содан менсінбеу мен қаһарлану кең етек жаймақ."},
	{19, "19 Патша ағзам мақұл көрсе, патшалық жарлық шығарылсын. Жарлық парсылар мен мидиялықтардың өзгертуге болмайтын заңдарына тіркеліп қосылсын. Онда Астиннің бұдан былай Ахасуер патшаның алдына келуіне болмайды деп жазылсын. Ал патша одан гөрі лайықты басқа бір патшайымды таңдап алсын."},
	{20, "20 Сонымен патша ағзамның осы жарлығы оның бүкіл ұлан-ғайыр патшалығы бойынша жарияланғанда, әйелдердің барлығы жоғарғысынан бастап төменгісіне дейін өз қожайындарына құрмет көрсететін болады."},
	{21, "21 Осы ұсынысты патша да, әміршілер де жөн көрді. Патша Мемуханның ұсынғаны бойынша істеп,"},
	{22, "22 патшалықтың барлық аймақтарына, әр аймаққа өз әліппесі мен өз тілінде мына жарлықты жібертті: Әрбір ер адам өз үйінде билік жүргізіп, өз халқының ана тілінде сөйлейтін болсын!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Кейінірек ашуы басылғанда Ахасуер патша Астинді, оның не істегенін және оған қарсы шығарылған жарлықты есіне алды."},
	{2, "2 Сонда патшаның жеке қызметкерлері мынадай ұсыныс жасады: Патша ағзамға арнап сұлу да пәк қыздарға іздеу салынсын."},
	{3, "3 Патша ағзам барлық аймақтарда арнаулы басқарушыларын тағайындап, бекіте көрсін. Олар сол сұлу да пәк қыздарды Сузы қорғанына әкелсін. Қыздар патшаның әйелдердің үстінен қарайтын сарай қызметкері Хегайдың қарамағындағы харемге жиналсын. Қыздар әрленуге арналған заттардың барлығымен қамтамасыз етілсін."},
	{4, "4 Сосын арулардың ішінен патшаға ұнаған қыз Астиннің орнына патшайым болсын! Патша бұл ұсынысты мақұл көріп, жүзеге асыртты."},
	{5, "5 Сузы қорғанында Мардохай есімді яһуди ер адам тұратын. Мардохай Бунямин руынан шыққан Жайырдың ұлы, Шимейдің әрі Қиштың ұрпағы болатын."},
	{6, "6 Кезінде Бабыл патшасы Набуходоносор Иерусалимді жаулап алып, Яһуда патшасы Ехонияхпен бірге жер аударып әкеткен халықтың арасында Мардохайдың отбасы да бар болған еді."},
	{7, "7 Мардохайдың қолында оның бір ағасының Хадаса есімді қызы болды. Хадаса Естер (Жұлдыз) деп те аталатын. Қыздың дене бітімі сымбатты, бет-әлпеті өте сұлу еді. Әке-шешесі қайтыс болғаннан кейін, Мардохай оны өз қызындай тәрбиелеп өсірді."},
	{8, "8 Патшаның әмірі жарияланғанда, Естер де көптеген басқа қыздармен бірге Сузы қорғанындағы патша сарайына әкелініп, харемнің бастығы Хегайдың қарамағына тапсырылды."},
	{9, "9 Естер Хегайға ұнап, оның мейіріміне бөленді. Хегай қызды әрленуге арналған иісмайлармен және арнайы тағамдармен дереу қамтамасыз етті. Ол, сондай-ақ, Естерге патша сарайынан таңдалған жеті қызметші қызды қосып беріп, оларды патшаның хареміндегі ең жақсы орынға көшіріп орналастырды."},
	{10, "10 Естер өз ұлты мен ата-тегі жайлы ешкімге тіс жармады. Себебі Мардохай оған солай істеуге тыйым салған еді."},
	{11, "11 Мардохай Естердің хал-жағдайын және оған не болып жатқанын білу үшін күн сайын харемнің ауласының маңайында әрлі-берлі жүретін."},
	{12, "12 Әрбір қыз Ахасуер патшаның алдына бару кезегі келмес бұрын әйелдерге арналған он екі айлық әрлену мерзімінен өтетін. Сол мерзім алты ай бойы мүр майымен сылану, келесі алты ай бойы иіссулар мен әрлендіретін иісмайларды жағу кезеңдерінен тұратын."},
	{13, "13 Қыздың патшаның алдына баратын уақыты келгенде, харемнен патша сарайына алып кеткісі келген нәрселерінің бәрі де оған берілетін."},
	{14, "14 Қыз патшаға кешке келетін де, таңертең екінші харемге апарылатын. Сол жерде ол патшаның кәнизактарының үстінен қарайтын сарай қызметкері Шағашқаздың қарамағында болатын. Патша оны ұнатып, атын атап өзіне қайта шақырмаса, ол бұдан былай патшаға қайтып әкелінбейтін."},
	{15, "15 Естер Мардохайдың ағасы Әбихаилдің қызы еді. Мардохай оны асырап алған болатын. Енді Естердің патшаның алдына баратын кезегі келгенде, ол патша харемінің үстінен қарайтын сарай қызметкері Хегайдың ақыл-кеңесіне мойынсұнды. Осылай Естер өзімен бірге алып кетуге оның ұсынған нәрселерінен басқа ештеңені сұраған жоқ. Ал Естерді көргеннің бәрі оған риза болды."},
	{16, "16 Естер Ахасуер патша билік құрған жетінші жылдың оныншы (яғни тебет) айында патша сарайына апарылды."},
	{17, "17 Патша басқа барлық қыздардан гөрі Естерді қатты ұнатты. Оған өзгелерге қарағанда көбірек риза болып, сүйсінгені сонша, басына патшалық тәж кигізіп, оны Астиннің орнына патшайым етті."},
	{18, "18 Содан патша барлық әміршілері мен қызметкерлеріне арнап үлкен қонақасы беріп, Естердің тойын жасады. Ол, сондай-ақ, аймақтарға демалыс күнін жариялатып, патшалық жомарттықпен сыйлықтар үлестірді."},
	{19, "19 Қыздар екінші харемге әкелініп жиналған кезде, Мардохай патша сарайының қақпасында қызмет ететін болды."},
	{20, "20 Естер өзінің ата-тегі мен ұлтын Мардохайдың ескертуімен бұдан былай да ешкімге ашпады. Ол бұрын Мардохайдың қолында тұрған кезінде де оның айтқанын екі етпейтін."},
	{21, "21 Мардохай патша қақпасында қызмет етіп жүрген сол күндердің бірінде кіреберісті күзететін екі сарай қызметкері бірдеңеге патшаға өкпелеп ашуланып қалды. Олардың есімдері Бигтана және Тәреш болатын. Содан екеуі Ахасуер патшаның көзін құртуды ойластырды."},
	{22, "22 Осы туралы Мардохай біліп қойып, оны Естер патшайымға хабарлады. Ал Естер бұл жайтты Мардохайдың атынан патшаның өзіне жеткізді."},
	{23, "23 Істің мән-жайы тексерілгенде расталып, екі қылмыскер дарға асылды. Бүкіл оқиға туралы баяндама патшаның көз алдында ресми жылнама кітабына жазылып енгізілді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Осы оқиғалардан кейін Ахасуер патша Агагтың ұрпағы Амадат ұлы Хаманды көтеріп, дәрежесін өсірді. Патша Хаманның лауазымын өзінің қасындағы күллі әміршілерден де жоғарылатты."},
	{2, "2 Патшаның сарай қақпасындағы қызметкерлерінің барлығы Хаманға жерге дейін иіліп сәлем беретін. Себебі патша солай әмір еткен болатын. Бірақ Мардохай Хаманға иіліп сәлем берген жоқ."},
	{3, "3 Патшаның сарай қақпасындағы қызметкерлері Мардохайға: Патшаның бұйрығын неге бұзасың? — деген сұрақ қойды."},
	{4, "4 Олар бұны күн сайын ескерте берсе де, ол тыңдаған жоқ. Қызметкерлер Мардохай өзінің айтқан сөзінен бас тартар ма екен деп оны сынамақ болып, бұл туралы Хаманға хабар жеткізді. Ал Мардохай өзінің яһуди екенін оларға білдірген болатын."},
	{5, "5 Хаман Мардохайдың өзіне иіліп сәлем беруден бас тартқанын естігенде, ашуға булықты."},
	{6, "6 Бірақ Мардохайдың өзін ғана құрту оған аз болып көрінді. Өйткені оның қай ұлтқа жататынын біліп алған соң, Хаман Мардохайдың ұлттастары — яһудилердің бәрін де Ахасуердің бүкіл патшалығы бойынша жаппай жойып жіберуді ойластырды."},
	{7, "7 Осылайша Ахасуер патшаның билік еткен он екінші жылының бірінші (яғни нисан) айында мұны іске асырудың тиімді күні мен айын анықтау үшін Хаманның алдында пур, демек, жеребе тасталды. Жеребе он екінші айдың (яғни адар айының) он үшінші күніне түсті."},
	{8, "8 Содан Хаман Ахасуер патшаға былай деп ұсыныс жасады: — Сіздің патшалығыңыздың күллі аймақтарындағы өзге халықтардың арасына шашырап кеткен, бірақ солармен араласпайтын бір ұлт бар. Бұл ұлттың әдет-ғұрыптары барлық басқалардікінен өзгеше. Олар патшаның заңдарын да орындамайды! Оларды осылай қалдыра беру патша ағзамның мүддесіне қарсы."},
	{9, "9 Егер патша ағзам мақұл көрсе, оларды құрту жайлы жарлық шығарылсын. Сонда мен басқарушы уәзірлердің қолдарына патшаның қазынасына салу үшін он мың ат басындай күмісті өлшеп табыстаймын."},
	{10, "10 Патша саусағындағы мөр басатын жүзігін шешіп алып, оны Амадат ұлы Хаманға берді. Хаман амалектік Агагтың ұрпағы әрі яһудилердің қас жауы болатын."},
	{11, "11 Патша Хаманға: — Сол күмісті де, сол ұлтты да қолыңа тапсырамын. Оларға өзің мақұл көргеніңді істе! — деді."},
	{12, "12 Осылайша бірінші айдың он үшінші күні патшаның хатшылары шақырылды. Олар Хаманның айтқан жарлығын патшаның өлке әміршілеріне, барша аймақтардың үстінен қарайтын әкімдерге және әрбір халықтың басшыларына арнап өздерінің әліппелерімен әрі ұлттық тілдерінде аударып жазып берді. Жарлықтың көшірмелері Ахасуер патшаның атынан жазылып, оның жүзік мөрімен бекітілді."},
	{13, "13 Сол хаттар шабармандар арқылы патшалықтың күллі аймақтарына жіберілді. Онда он екінші айдың (демек адар айының) он үшінші күні, сол бір күннің ішінде, барлық яһудилерді: жасы мен кәрісін, әйелі мен бала-шағасын құртып жоқ қылуға, ал қалған мал-мүлкін олжалауға бұйрық берілді."},
	{14, "14 Жарлықтың көшірмелері әрбір аймақта заң ретінде шығарылып, күллі ұлттардың адамдарына сол күнге дайын болсын деп паш етілуге тиіс болды."},
	{15, "15 Шабармандар патшаның бұйрығымен тез аттанып кетті. Жарлық Сузы қорғанында да жарияланды. Патша мен Хаман шарап ішуге отырды, ал Сузы қаласының халқы не болғанын түсінбей абыржыды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Мардохай болған оқиға туралы толық білгенде, қатты қайғырып киімдерінің өңірін айыра жыртты. Содан ол азалы киім киіп, басына күл шашып, дауыстап жылап қаланың ортасына барды."},
	{2, "2 Мардохай патша сарайының қақпасының алдына дейін ғана келе алды. Өйткені азалы киім киіп сарай қақпасына кіруге тыйым салынған болатын."},
	{3, "3 Патшаның шығарған жарлығы жеткен аймақтардың барлығындағы яһудилер де ораза ұстап, еңіреп жылаумен болды. Олардың көбі азалы киім киіп, күл үстінде отырды."},
	{4, "4 Естерге өзінің қызметші қыздары мен сарай қызметкерлері келіп, Мардохай туралы айтып бергенде, ол да қатты алаңдап қорықты. Естер Мардохайға азалы киімін шешіп, ауыстырып киюге жай киімдер жіберді. Бірақ Мардохай оларды қабылдамады."},
	{5, "5 Сонда Естер Хатахты шақырып алып, Мардохайдан не болғанын сұрап біліп келуге жіберді. Хатах патшаның Естерге қызмет етуге тағайындаған сарай қызметкерлерінің бірі еді."},
	{6, "6 Хатах патша қақпасынан шығып, оның алдындағы ашық алаңдағы Мардохайға барды."},
	{7, "7 Мардохай Хатахқа өзімен болған бүкіл жайтты, әрі Хаманның яһудилерді құрту үшін патшаның қазынасына төлеймін деген күмісінің дәл мөлшерін де айтып берді."},
	{8, "8 Мардохай, сондай-ақ, яһудилерді құрту жайлы Сузыда шығарылған жарлықтың бір көшірмесін Хатахқа беріп, одан соны Естерге көрсетіп, түсіндіруін сұрады. Естер патшаның алдына барып, өз халқы үшін мейірім сұрауы керек деп те тапсырды."},
	{9, "9 Қызметкер Хатах қайта оралып, Мардохайдың айтқанының бәрін Естерге жеткізді."},
	{10, "10 Сонда Естер Хатахтан Мардохайға былай деген жауабын жіберді:"},
	{11, "11 — Патшаның барлық қызметкерлері және оның аймақтарының халқы мынаны біледі: Егер кімде-кім, әйел болсын, ер адам болсын, патшаның шақыруынсыз ішкі аулаға кіріп келетін болса, оған бір-ақ заң қолданылады: сол кісі өлтіріледі! Егер патша алтын асатаяғын сол адамға қарай созса ғана, ол тірі қалады. Ал өзімнің патшаның қасына шақырылмағаныма отыз күн болды."},
	{12, "12 Естердің осы айтқаны Мардохайға жеткенде,"},
	{13, "13 ол Естерге былай деп жауап қайтарды: — Патшаның сарайында тұрып яһудилердің арасынан жеке басым аман қалармын деп ойлама!"},
	{14, "14 Себебі егер осы уақытта үндемей қалатын болсаң, яһудилерге көмек пен құтқарылу басқа жақтан келмек. Ал сенің өзің мен әкеңнің әулеті құрисыңдар. Мүмкін, патшайым болу құрметіне дәл осындай уақыт үшін де қол жеткізген шығарсың, соны кім біледі?"},
	{15, "15 Естер Мардохайға мына жауабын жолдады:"},
	{16, "16 — Онда Сузыдағы барлық яһудилерді жинап, мен үшін ораза ұстаңыздар. Үш күн, үш түн бойы ішіп-жемеңіздер. Мен де қызметші қыздарыммен бірге сіздер сияқты ораза ұстаймын. Содан соң мұным заңсыз болса да, патшаның алдына барамын. Егер өлуге тиіс болсам, өлейін!"},
	{17, "17 Мардохай барып, бәрін Естердің тапсырғанындай істеді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Үшінші күні Естер патшалық киімін киіп, патша сарайының ішкі ауласына, патша отыратын кең бөлменің алдына келіп тұрды. Патша сондағы өз тағында, кіреберіске қарама-қарсы төрде отырған еді. Аулада тұрған Естер патшайымды көре салысымен, патша оның келгеніне риза болып,"},
	{2, "2 қолындағы алтын асатаяғын оған қарай созды. Естер патшаға жақындап келді де, асатаяқтың ұшына қолын тигізді."},
	{3, "3 Патша оған тіл қатып былай деді: — Саған не керек, Естер патшайым? Қандай өтінішің бар? Патшалықтың жартысы болса да, саған беріледі! —"},
	{4, "4 Естер: — Егер патша ағзам мақұл көрсе, бүгін Хаманды ертіп өзіне арналып дайындалған қонақасына келсе екен, — деп жауап берді."},
	{5, "5 Патша: — Естердің өтінішін орындау үшін, Хаманды дереу осында жеткізіңдер! — деп бұйырды. Содан патша мен Хаман Естердің дайындаған қонақасына барды."},
	{6, "6 Олар шарап ішіп отырғанда, патша Естерге сауал қойып: — Тілегің қандай? Ол орындалады. Қандай өтінішің бар? Патшалықтың жартысы болса да, саған беріледі! — деді."},
	{7, "7 Естер былай деп жауап берді: — Менің тілегім мен өтінішім мынау:"},
	{8, "8 Егер маған патша ағзамның мейірімі түсіп, тілегімді беріп, өтінішімді орындауды мақұл көрсе, патшам Хаманды ертіп мен ертең оларға дайындайтын қонақасына келсе екен. Патша ағзамның қойған сұрағына жауабымды сонда беремін."},
	{9, "9 Хаман сол күні қонақасынан мәз болып, көтеріңкі көңілмен шықты. Алайда патша сарайының қақпасында Мардохайдың не орнынан тұрып құрмет көрсетпегенін, не қорқыныш та танытпағанын байқағанда, Хаманды қаһар кернеді."},
	{10, "10 Әйтсе де Хаман өзін-өзі ұстап, үйіне барды. Сонда достары мен әйелі Зерешті шақырып алып,"},
	{11, "11 оларға өзінің байлығының қандай ауқымды әрі ұлдарының сонша көп екенін айтып бөсті. Хаман, сондай-ақ, өзінің дәрежесін өсірген патшаның бүкіл әрекеттерін де, өзін басқа әміршілер мен қызметкерлерден қалай жоғарылатқанын да атап мақтанды."},
	{12, "12 Мұнан кейін Хаман: — Тіпті Естер патшайым да өзі дайындаған қонақасына патшамен бірге жалғыз мені шақырды. Ертеңгі қонақасына да ол патшамен бірге тек мені ғана шақырды!"},
	{13, "13 Алайда мен яһуди Мардохайдың сарай қақпасының маңында отырғанын әлі де көргенде, соның бәріне көңілім толмайды, — деп жүрек сырын ақтарды."},
	{14, "14 Әйелі Зереш пен барлық достары Хаманға: — Онда биіктігі елу шынтақ дар ағашын құрғызыңыз. Таңертең патшадан Мардохайды дарға асуды сұраңыз. Содан соң қуана патшамен бірге тойға бара бересіз, — деп ұсынды. Бұл ұсыныс Хаманға ұнап, ол дар ағашын дайындатқызып қойды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 Сол түні патшадан ұйқы қашты. Сондықтан ол болған оқиғалар баяндалып сақталатын жылнама кітабын әкелуді бұйырды. Хатшы патшаға сол кітаптан оқып берді."},
	{2, "2 Сонда кіреберісті күзеткен Бигтана мен Тәреш есімді екі сарай қызметкерінің қаскүнемдігін Мардохайдың әшкерелегені туралы жазылған баяндама табылды. Сол екеуі Ахасуер патшаның көзін құртуды ойластырған болатын."},
	{3, "3 Соңында патша: — Сол Мардохайға осы үшін қандай сый-құрмет көрсетілді? — деп сұрады. Патшаның қасында қызмет көрсететін жас малайлары: — Оған ештеңе де істелген жоқ, — деп жауап берді."},
	{4, "4 Патша: — Аулада кім бар? — деген сауал қойды. Сол кезде Хаман енді ғана патша сарайының сыртқы ауласына кіріп келген болатын. Ол Мардохайды өзі құрғызып қойған дарға асу туралы патшамен сөйлеспек еді."},
	{5, "5 Жас малайлары патшаға: — Хаман аулада тұр, — деп мәлімдеді. Патша: — Кірсін! — деп бұйырды."},
	{6, "6 Осылай Хаман кірді. Патша оған мына сұрақты қойды: — Патша құрмет көрсетпек болған адамға не істелуі керек? — Хаман ішінен: Патша менен басқа кімге құрмет көрсетуді қалар еді? — деп ойлады."},
	{7, "7 Сондықтан ол былай деп жауап берді: — Патша құрмет көрсетпек болған адамға арнап"},
	{8, "8 патшаның өзі киген арнайы шапаны, патшаның өзі мінген, басына патшалық әшекей орнатылған тұлпары әкелінсін."},
	{9, "9 Сол шапан мен ат патшаның ең жоғары лауазымды әміршілерінің біріне табыс етілсін. Әмірші патша құрмет көрсетпек болған адамды киіндіріп, тұлпарға мінгізіп, қаланың алаңымен жетелеп алып жүрсін. Сондай-ақ, оның алдында жүріп: Патша құрмет көрсетпек болған адамға осылай істеледі! деп жар салатын болсын. —"},
	{10, "10 Патша Хаманға: — Сен дереу өзің айтқандай шапан мен тұлпарды ал да, патша сарайының қақпасында қызмет ететін Мардохай есімді яһудиге осылардың бәрін істе! Барлық айтқандарыңның бірде-біреуін ұмыт қалдырма! — деп тапсырды."},
	{11, "11 Сонда Хаман шапан мен тұлпарды алып, Мардохайды киіндіріп, атқа мінгізіп, қаланың алаңымен жетелеп алып жүрді. Оның алдында жүріп: Патша құрмет көрсетпек болған адамға осылай істеледі! — деп жар салды."},
	{12, "12 Бұдан соң Мардохай патша сарайының қақпасына қайтты. Ал Хаман қатты түңіліп бетін бүркеп алып үйіне асығып барды да,"},
	{13, "13 әйелі Зереш пен күллі достарына болған істі айтып берді. Сонда оның данышпан кеңесшілері мен әйелі Зереш былай деді: Сен оның алдында төмендетіле бастаған сол Мардохай шынымен яһуди тұқымынан болса, оны жеңе алмайсың. Қайта, өзің оның алдында құлайсың!"},
	{14, "14 Олар әлі сөйлесіп тұрғанда, патшаның сарай қызметкерлері келіп, Хаманды Естер дайындаған қонақасына асықтырып алып кетті."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct kk7 poems[] = {
	{1, "1 Осылайша патша мен Хаман Естер патшайымға тағы да қонақасына келді."},
	{2, "2 Олар сол екінші күні тамақ ішіп отырған кезде патша қайтадан Естерге сауал қойып: — Тілегің қандай, Естер патшайым? Ол орындалады. Қандай өтінішің бар? Патшалықтың жартысы болса да, саған беріледі! — деді."},
	{3, "3 Сонда Естер патшайым былай деп жауап берді: — Уа, патшам, егер маған мейіріміңіз түссе, әрі патша ағзам мақұл көрсе, маған өмірім аман қалдырылса екен! Тілегім — осы. Халқымның өмірі де аман сақталса екен! Өтінішім — осы."},
	{4, "4 Өйткені өзім де, халқым да құртылып, өлтірілуге, әбден жойылуға сатылдық! Егер бізді құл-күң қылуға сатса, мен үндемес те едім. Себебі осындай ауыртпалық патшаның мазасын алатындай мәселе болмас еді."},
	{5, "5 — Ахасуер патша Естер патшайымнан: — Ол кім өзі? Мұндайды істеуге батылы барған кісі қайда? — деп сұрады."},
	{6, "6 Естер: — Сол қас жау — мына отырған зұлым Хаман! — деп жауап қатты. Сонда Хаманның патша мен патшайымның алдында зәресі қалмады."},
	{7, "7 Патша қаһарланып орнынан ұшып тұрды да, шарабын қалдырып, сарайдың саябағына шығып кетті. Ал Хаман патшаның өзін құртуға шешім қабылдағанын көріп, Естер патшайымнан өмірін сақтап қалуын сұрап жалбарыну үшін, сол жерде қалып қойды."},
	{8, "8 Содан Хаман Естердің жантайып жатқан төсегіне құлай кетті. Дәл сол кезде патша саябақтан қонақасы бөлмесіне қайта кіріп келе жатты. Патша: Ол тіпті сарайда менің қасымда болып патшайымды зорламақшы ма?! — деп айқайлап жіберді. Патшаның аузынан осы сөз шыға салысымен-ақ күзетшілер Хаманның бетін бүркеп тастады."},
	{9, "9 Патшаның қасында жүрген Харбона есімді сарай қызметкері былай деді: — Хаманның үйінің қасында биіктігі елу шынтақ дар ағашы тұр! Хаман соны патшаның игілігі үшін сөз сөйлеген Мардохайға арнап құрғызып қойған болатын. — Патша: — Сол дарға оның өзін асыңдар! — деп бұйырды."},
	{10, "10 Сонымен жендеттер Хаман Мардохайға арнап дайындатқызған дарға оның өзін асып қойды. Осыдан кейін патшаның қаһары басылды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct kk8 poems[] = {
	{1, "1 Сол күні Ахасуер патша яһудилердің жауы Хаманның сарайын Естер патшайымға сыйлады. Естер Мардохайдың өзіне кім болып келетінін айтып, Мардохай патшаның алдына әкелінді."},
	{2, "2 Патша Хаманнан қайтарып алған мөрлі жүзігін шешіп алып, Мардохайға тапсырды. Сонымен қатар Естер Мардохайды Хаманның сарайы мен мал-мүлкінің үстінен қараушы етіп тағайындады."},
	{3, "3 Естер қайтадан патшаның алдына барып, оның аяғына жығылып еңіреп жылады. Патшадан Агагтың ұрпағы Хаманның яһудилерге қарсы жасаған зұлым жоспарының бетін қайыруын өтінді."},
	{4, "4 Патша оған қарай өзінің алтын асатаяғын созды. Естер көтеріліп, патшаның алдында тұрды да,"},
	{5, "5 оған былай деді: — Егер патша ағзам мақұл көріп, маған мейірімі түссе, әрі патша бұл істі дұрыс деп бағалап, маған оң көзімен қараса, онда бір жарлық шығарылса екен. Сол жарлық Агагтың ұрпағы Амадат ұлы Хаманның патшаның аймақтарына яһудилердің көзін құрту мақсатымен жолдаған хаттарының күшін жоятын болса екен."},
	{6, "6 Халқым апатқа ұшырайын деп жатқанда мен қалайша қарап отыра аламын? Өз әулетім құрып кетейін деп жатқанда мен қалайша жайбарақат отыра аламын? —"},
	{7, "7 Ахасуер патша Естер патшайым мен яһуди Мардохайға мынадай жауап берді: — Мен яһудилерді құртқысы келгені үшін Хаманның үй-жайын Естерге бергенмін, ал оның өзі дарға асылды."},
	{8, "8 Енді сендер патшаның атынан яһудилер туралы өздерің мақұл көргендеріңді жазып, соны патшаның мөрлі жүзігімен бекітіңдер! Өйткені патшаның атынан жазылып, патшаның мөрлі жүзігімен бекітілген ешбір жарлықтың күшін жоюға болмайды."},
	{9, "9 Осылайша үшінші айдың (демек сиван айының) жиырма үшінші күні патшаның хатшылары шақырылды. Олар Мардохайдың бұйырғандарының бәрі бойынша жаңа жарлықты патшалықтың Үндістаннан Құш еліне дейін ұласқан барлық жүз жиырма жеті аймағындағы яһудилерге, өлке әміршілері мен аймақ әкімдеріне және өзге де басшыларға арнап жазып берді. Жарлық әр аймаққа өзінің әліппесімен және әр халыққа арнап өзінің тілінде, соның ішінде яһуди халқына арнап та өз тіліне аударылып, өз әліппесімен жазылды."},
	{10, "10 Мардохай осы хаттарды Ахасуер патшаның атынан жазғызып, патшаның мөрлі жүзігімен бекітті. Содан хаттарды патшаның ат қорасынан шыққан жүйрік сайгүліктерге мінген шабармандар арқылы жан-жаққа жіберді."},
	{11, "11 Жаңа жарлыққа сай, әрбір қаладағы яһудилерге бас қосып, өздерін қорғауға патшаның рұқсат бергені мәлім болды. Яһудилер кез келген халықтың не аймақтың өздеріне және әйелдері мен бала-шағаларына шабуыл жасаған жасақшыларын жойып, оларды жоқ қылуға әрі солардың мал-мүлкін олжалауға құқықты болды."},
	{12, "12 Осының бәрін жүзеге асыруға Ахасуер патшаның қарамағындағы барлық аймақтар бойынша яһудилерге бір күн белгіленді. Бұл күн — он екінші айдың (демек адар айының) он үшінші күні еді."},
	{13, "13 Яһудилер өз жауларын жазалауға дайын болып отыра алулары үшін осы жарлықтың көшірмесі әрбір аймақта заң ретінде жарияланып, әр ұлттың адамдары сонымен танысуға міндетті болды."},
	{14, "14 Шабармандар патшаның ат қорасынан шыққан жүйрік аттарға мініп, патшаның бұйрығымен тездетіп жан-жаққа аттанып кетті. Жарлық Сузы қорғанында да жарияланды."},
	{15, "15 Мардохай үстіне патша киетін көк және ақ түсті киімдер, басына үлкен алтын тәж киіп, қырмызы бәтес шапан жамылып патшаның алдынан шықты. Сузы қаласының халқы шаттана айқайлап тойлады."},
	{16, "16 Қуанышқа кенелген яһудилер көздері жайнап, құрметке бөленді."},
	{17, "17 Патшаның бұйырған жарлығы жеткен әрбір аймақ, қала және елді мекенде яһудилер мәз-мейрам болып мерекеледі. Елдегі халықтардың көптеген адамдары яһудилерден қорқып, оларды терең қастерлеп, ұлттастарына айналды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct kk9 poems[] = {
	{1, "1 Он екінші айдың (яғни адар айының) он үшінші күні патша шығарған жарлық іске асуға тиіс болды. Осы күні яһудилердің жаулары оларға күш көрсетуге үміттенген болатын. Алайда бәрі де керісінше болып, яһудилер жауларына үстемдік құрып, оларды жеңіп шықты."},
	{2, "2 Яһудилер Ахасуер патшаның барша аймақтарында жиналып, өздеріне зұлымдық жасамақшы болғандардың бәріне шабуыл жасауға дайын тұрды. Бірақ яһудилерге қарсы тұра алатын ешкім болмады. Себебі халықтардың барлығы яһудилерден қорқып, оларды терең қастерледі."},
	{3, "3 Аймақтардағы күллі басшылар, өлке әміршілері, әкімдер және патшаның тағайындаған өзге де басшылары Мардохайдан қорқып, яһудилерді қолдап жүрді."},
	{4, "4 Өйткені патша сарайында Мардохайдың мәртебесі жоғары болатын. Оның билігі күшейген сайын, атақ-даңқы барша аймақтарға жайыла түсті."},
	{5, "5 Осылайша яһудилер белгіленген күні күллі жауларын шауып өлтіріп, өздерін жек көргендерге қалағандарын істеді."},
	{6, "6 Сузы қорғанында яһудилер бес жүз адамның көзін құртып,"},
	{7, "7 сондай-ақ Паршандата, Далфон, Асфата,"},
	{8, "8 Пората, Адалия, Аридата,"},
	{9, "9 Пармашта, Арисай, Аридай, Уаизата есімді он адамды да өлтірді."},
	{10, "10 Бұлар яһудилердің қас жауы Хаманның ұлдары болатын. Бірақ та яһудилер дұшпандарының мал-мүліктеріне тиген жоқ."},
	{11, "11 Сол күні Сузы қорғанында өлтірілгендердің саны туралы мәлімет патшаға жетті."},
	{12, "12 Ол Естер патшайымға былай деді: — Яһудилер Сузы қорғанында бес жүз адамды және Хаманның он ұлын өлтірді. Патшалықтың басқа аймақтарында олар не істеді екен? Ал енді, тілегің қандай? Ол орындалады. Тағы қандай өтінішің бар? Ол да саған беріледі. —"},
	{13, "13 Естердің жауабы мынау болды: — Егер патша ағзам мақұл көрсе, Сузыдағы яһудилерге ертең де бүгінгі жарлыққа сәйкес әрекет етуге хұқық берілсе екен. Ал Хаманның он ұлының өлі денелері дарға асылып қойылғаны жөн болар еді."},
	{14, "14 Патша солай етуге бұйырды. Сузыда жарлық шығарылып, Хаманның он ұлының денелері дарға асылып қойылды."},
	{15, "15 Содан Сузыдағы яһудилер адар айының он төртінші күні де бас қосып, қаладағы үш жүз жауының көзін құртты. Бірақ солардың мал-мүліктеріне тиген жоқ."},
	{16, "16 Патшаның басқа аймақтарындағы яһудилер де өз өмірлерін қорғауға жиналған болатын. Олар жауларынан құтқарылып, өздерін жек көретін жетпіс бес мың дұшпанының көзін жойды. Алайда солардың мал-мүліктеріне тиген жоқ."},
	{17, "17 Бұл адар айының он үшінші күні болды. Аймақтардағы яһудилер он төртінші күні демалып, сол күнді қуанышпен тойлауға арнады."},
	{18, "18 Сузыдағы яһудилер болса, он екінші айдың он үшінші және он төртінші күндері дұшпандарына қарсы шығуға бас қосып, он бесінші күні демалды. Сондықтан олар айдың он бесінші күнін қуанышпен тойлайтын мереке етіп белгіледі."},
	{19, "19 Ал аймақтардағы шағын қалалар мен елді мекендерде тұратын яһудилер адар айының он төртінші күнін шаттана мейрамдайды. Сол мейрамды бір-біріне сыйлық жіберіп атап өтеді."},
	{20, "20 Мардохай осы болған оқиғаларды жазып қойып, Ахасуер патшаның бүкіл алыс-жақын аймақтарындағы яһудилердің бәріне хат жолдады."},
	{21, "21 Оларды жыл сайын адар айының он төртінші және он бесінші күндерін мейрамдауға шақырды."},
	{22, "22 Себебі осы күндері яһудилер жауларынан құтқарылды. Сол айда уайымдары қуанышқа, қайғылары тойға айналған еді. Мардохай: Осы күндер шаттана тойлап, бір-біріне сыйлық жіберіп, кедейлерге тартулар беретін күндер болсын! — деп белгіледі."},
	{23, "23 Сондықтан яһудилер өздері істей бастағандарын және Мардохайдың оларға жазғанын дәстүр етіп алды."},
	{24, "24 Барлық яһудилердің қас жауы — Агагтың ұрпағы Амадат ұлы Хаман оларды құртуға жоспар жасаған еді. Оларды жойып, көздерін құрту үшін пур, яғни жеребе, тастаған болатын."},
	{25, "25 Бірақ алдына Естер келген кезде патша: Хаманның яһудилерге қарсы жасаған зұлым жоспары оның өз басына түссін және өзі ұлдарымен қоса дарға асылсын! — деп жазбаша жарлық шығарған еді."},
	{26, "26 Жоғарыдағы пур сөзінен осы мейрам Пурим деп аталып келеді. Мардохайдың хатында жазғанына сәйкес және өздерінің көздерімен көріп, бастарынан өткендері бойынша,"},
	{27, "27 яһудилер осы екі күнді мейрам етуге шешім қабылдады. Олар мұны дәл нұсқауға сай әрі белгіленген уақытта жыл сайын міндетті түрде іске асыруға келісті. Оны өздеріне, кейінгі ұрпақтарына және Яһуда халқына қосылғандардың бәріне де тұрақты дәстүр етіп бекітті."},
	{28, "28 Күллі келер ұрпақ осы күндерді әрбір отбасында, әрбір аймақта, әрбір елді мекенде естен шығармай, мейрамдауы қажет. Яһудилер Пурим мейрамынан ешқашан бас тартпаулары керек. Олардың үрім-бұтақтары да сол күндерді мерекелеп өткізуді ұмыт қалдырмауға міндетті."},
	{29, "29 Әбихаил қызы Естер патшайым және яһуди (бас уәзір) Мардохай Пурим мейрамы туралы осы екінші хатты жаздырып, оны өздерінің бар биліктерімен бекітті."},
	{30, "30 Мардохай Ахасуер патшаның барлық жүз жиырма жеті аймағындағы яһудилерге тыныштық пен аман-есендік тілеген сәлемхаттарын жіберді."},
	{31, "31 Сол хаттарда Пурим мерекесін белгілі бір уақытта өткізу керектігі яһуди (бас уәзір) Мардохай мен патшайым Естердің нұсқаулары бойынша нық бекітілді. Яһуда халқы, сондай-ақ, өздері мен келер ұрпақтары үшін мейрамның алдында ораза ұстап қайғыру жайлы дәстүрді де орындауға шешім қабылдады."},
	{32, "32 Осылайша Естер патшайымның бұйрығымен Пурим мейрамы туралы ережелер белгіленіп, кітапқа жазылып, сақталып қойылды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct kk10 poems[] = {
	{1, "1 Ахасуер патша құрлықта және теңіз аралдарында орналасқан бүкіл патшалығына салық салды."},
	{2, "2 Оның ұлы да құдіретті іс-әрекеттерінің бәрі және өзі жоғарылатқан Мардохайдың биік дәрежесі туралы Мидия мен Персия патшаларының жылнамалары кітабында жазылған."},
	{3, "3 Яһуди Мардохайдың мәртебесі тек қана Ахасуер патшадан кейінгі екінші орында болды. Яһудилердің арасында оның абыройы өте жоғары еді. Мардохай өз халқының қамын ойлап, бүкіл келер ұрпақтың да игілігі үшін сөз сөйлеген болатын. Сол үшін ол ұлттастарының ризашылығына бөленді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};