#include <map>
#include <string>
class Bible30
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
	struct kk7	{ int val; const char *msg; };
	struct kk8	{ int val; const char *msg; };
	struct kk9	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Мұнда Яһуданың Текоя қалашығындағы шопандармен жүрген Амос пайғамбардың айтқан сөздері берілген. Ол соларды Яһуда еліне Ұзиях, ал Солтүстік Исраилге Жоғас ұлы Еробоғам патшалық құрған заманда аян көргенде Құдайдан қабылдаған еді. Бұл жер сілкіністен екі жыл бұрын болды."},
	{2, "2 Амос пайғамбар былай деді: Жаратқан Ие Сион тауынан ақырады, Ол Иерусалимнен дауысын шығарады. Сонда малшылардың жайылымдары солады, Қармил тауының төбесі де кеуіп қалады!"},
	{3, "3 Жаратқан Ие мынаны айтады: Дамаскінің халқы көптеген зұлым істер істеп келді. Сондықтан Мен оларға шығарған үкімімді жоймаймын. Олар (Исраилдің) Ғилақад аймағын темір астық бастырғышпен таптағандай аяусыз талқандады."},
	{4, "4 Сол үшін Мен (Дамаск патшасы) Хазаилдің сарайына от жіберемін. Сол от (оның ұлы) Бен-Хададтың қорғандарын да жалмап қояды."},
	{5, "5 Мен Дамаскінің қақпа ысырмаларын сындырып, Ауен аңғарының тағында отырғанды елінен аластатып қуып, Бет-Еденге билік жүргізушіні құртамын. Сонда Арама халқы тұтқындалып, (Бабыл еліндегі) Кир аймағына айдалып кететін болады. — Жаратқан Ие осыны нық айтады."},
	{6, "6 Жаратқан Ие тағы мынаны айтады: Газа қаласының халқы көптеген зұлым істер істеп келеді. Сондықтан Мен оларға шығарған үкімімді жоймаймын. Газалықтар (Яһудадағы) елді мекендердің бүкіл халқын тұтқынға алып, Едомға сатып жіберді."},
	{7, "7 Сол үшін Мен Газа қаласының қабырғаларына от жіберемін. Сол от оның сарайларын жалмап қояды."},
	{8, "8 Мен Азоттың тағында отыратынды және Ашқалонның билеушісін жайратамын, Әкронға да қарсы құдіретті қолымды созамын. Сонда філістірлердің тірі қалғандары да құриды, — деп ескертеді Жаратушы Тәңір Ие."},
	{9, "9 Жаратқан Ие мынаны да айтады: Тир қаласының халқы көптеген зұлым істер істеп келеді. Сондықтан Мен оларға шығарған үкімімді жоймаймын. Тирліктер (Исраилдегі) елді мекендердің бүкіл халқын тұтқындап, Едом еліне сатып жіберді. Сонда олар Исраилмен жасаған өзара бауырластық келісімдерін тіпті естеріне де алмады."},
	{10, "10 Сол үшін Мен Тирдің қамал қабырғаларына от жіберемін. Сол от оның бекіністі сарайларын жалмап қояды."},
	{11, "11 Жаратқан Ие тағы мынаны айтады: Едом халқы көптеген зұлым істер істеп келеді. Сондықтан Мен оларға шығарған үкімімді жоймаймын. Едомдықтар өздерімен бауырлас халықты қолдарына семсер алып қуып, өздеріндегі аяушылық сезімін басып таптап, ешқандай мейірімділік танытпады. Олар бауырластарына деген ашуынан қайтпай, соларды ызалана паршалап өлтірді."},
	{12, "12 Сол үшін Мен Теман аймағына от жіберемін. Сол от Босора қаласының сарайларын жалмап қояды."},
	{13, "13 Жаратқан Ие мынаны да айтады: Аммон халқы көптеген зұлым істер істеп келеді. Сондықтан Мен оларға шығарған үкімімді жоймаймын. Аммондықтар өз жерлерін кеңейту үшін Ғилақад аймағына бас салып, сондағы жүкті әйелдерді қарындарын жарып өлтірді."},
	{14, "14 Сол үшін мен Рабба қаласының қабырғаларына от жіберемін. Сол от оның сарайларын жалмап қояды. Дауылды күннің құйынындай бір әскердің шабуылдап атой салғаны естілетін болады."},
	{15, "15 Сонда Амонның патшасы өзінің әміршілерімен бірге басқа жаққа айдалып кетеді, — деп нық айтады Жаратқан Ие."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Жаратқан Ие тағы мынаны айтады: Моаб халқы көптеген зұлым істер істеп келеді. Сондықтан Мен оларға шығарған үкімімді жоймаймын. Моабтықтар Едом патшасының сүйегін әк іспетті күйдіріп қор қылды."},
	{2, "2 Сол үшін Мен Моабқа от жіберемін. Сол от Кериоттың сарайларын жалмап қояды. Сонда Моаб айқай-шудың әрі әскердің шабуылдап атой салып, керней тартқан дауыстарының астында күйрейді."},
	{3, "3 Мен Моабты басқарып жүрген биді елден аластатып, онымен бірге барлық әміршілерін де өлтіремін, — деп ескертеді Жаратқан Ие."},
	{4, "4 Жаратқан Ие мынаны да айтады: Яһуданың халқы көптеген зұлым істер істеп келеді. Сондықтан Мен оларға шығарған үкімімді жоймаймын. Яһудалықтар Мен, Жаратқан Ие, тапсырған Таурат заңын менсінбей, ережелерімді орындамай кетті. Бұрын ата-бабалары құлшылық еткен жалған тәңірлердің жолына енді бұлар да түсіп, адасты."},
	{5, "5 Сол үшін Мен Яһудаға от жіберемін. Сол от Иерусалимнің сарайларын жалмап қояды."},
	{6, "6 Жаратқан Ие тағы мынаны айтады: Солтүстік Исраилдің халқы көптеген зұлым істер істеп келеді. Сондықтан Мен оларға шығарған үкімімді жоймаймын. Исраилдіктер әділ жанды күміске, кедейді бір жұп аяқкиімге айырбастай салады."},
	{7, "7 Олар кедейдің басын жердің топырағына таптап, бейшараны жолынан итеріп баса көктейді. Әкесі мен баласы екеуі бірдей бір жас әйелге барып, Менің киелі есімімді қор қылады."},
	{8, "8 Олар өздеріне қарыздар адамнан кепілдікке алынған жамылғыны құрбандық үстелінің қасына төсеп жатады. Жұртқа айып төлетіп алған шарапты өздері табынған тәңірсымағының ғибадатханасында ішеді."},
	{9, "9 Ал Мен ежелде халқымның көз алдында самырсындай биік, емендей мықты Амор халқын күйреткенмін. Сонда Мен оның төбесіндегі жемісі мен түбіндегі тамырын да біржола құртқан болатынмын."},
	{10, "10 Сендердің аморлықтардың жерін иемденіп алуларың үшін Мен сендерді Мысыр елінен алып шығып, қырық жыл бойы айдалада ертіп жүрген едім."},
	{11, "11 Ұлдарыңның кейбіреулерін пайғамбар, жас жігіттеріңнің бірнешеуін Құдайға бағышталған назир еттім. Солай емес пе, уа, Исраилдің үрім-бұтағы? — деп ескертеді Жаратқан Ие. —"},
	{12, "12 Алайда сендер Өзіме бағышталған назирлерге шарап ішкізіп күнә жасатып, пайғамбарларға: Пайғамбарлық сөз айтпа! деп тыйым салып жүрдіңдер."},
	{13, "13 Біліп қойыңдар, егін баулары мол артылған арбаның жерге қарай шөгетіні сияқты, енді Мен де сендерге ауыртпалықты молынан түсіремін!"},
	{14, "14 Сонда жылдамдарыңның жүгіруге шамасы болмай қалады, мықтыларың да өз қуаттарынан айырылады, тіпті батырларың да өз жандарын құтқара алмайды."},
	{15, "15 Сонда мерген тойтарыс бере алмайды, желаяқ та, салт атты да өз жандарын құтқарып қала алмайды."},
	{16, "16 Ержүрек батыл деген жасақшылар да қару-жарағын тастап бас сауғалап қашатын болады, — деп ескертеді Жаратқан Ие."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Уа, Исраилдің үрім-бұтағы, Жаратқан Иенің сендерге қарсы айтқан сөзін тыңдаңдар! Ол ежелде Мысыр елінен Өзі алып шыққан бүкіл халыққа қарсы мына сөзін айтады:"},
	{2, "2 Жер бетіндегі барлық халықтардың ішінен Мен тек сендерді ғана таңдап алғанмын. Сондықтан Мен сендердің істеген барлық опасыз істеріңе назар аударып, жазалаймын!"},
	{3, "3 Бағыт жайлы келісіп алмаса, екі адам бірге жүре ала ма?"},
	{4, "4 Алдында жатқан олжасы болмаса, ормандағы арыстан ақыра ма? Ұстап алған ештеңесі болмаса, жас арыстан інінен даусын шығара ма?"},
	{5, "5 Егер тұзақта жем болмаса, құс оған түсе ме? Еш нәрсе түспесе, тұзақ жоғары ырши ма?"},
	{6, "6 Қалада кернейдің даусы шықса, халық үрейленбей ме? Жаратқан Ие жібермесе, қала апатқа ұшырай ма?"},
	{7, "7 Шынында Жаратушы Тәңір Ие Өзіне қызмет ететін пайғамбарларға алдын ала білдірмей ештеңе істемейді."},
	{8, "8 Ал енді Арыстан ақырды! Содан кім үрейленбейді? Жаратушы Тәңір Ие тіл қатты, Оның хабарын басқаларға кім жеткізбейді?"},
	{9, "9 Азот қаласы мен Мысыр елінің сарайларына: Самарияның тауларына жиналыңдар! Елдегі болып жатқан ғаламат ретсіздік пен қанаушылыққа көз салыңдар! — деп жариялаңдар!"},
	{10, "10 Жаратқан Ие тағы мынаны айтады: Олар дұрыс істеуді білмейді де, өз сарайларында зұлымдықпен, зорлықпен иемденіп алған байлық жинайды."},
	{11, "11 Сол себепті Жаратушы Тәңір Ие мынаны айтады: Елді жау қоршап, сені қуатыңнан жұрдай етіп, сарайларыңды талан-таражға түсіреді."},
	{12, "12 Жаратқан Ие мынаны да айтады: Шопан қойына тап берген арыстанның аранынан оның қос сирағын немесе құлағының бір жапырағын ғана шығарып ала алады. Сол сияқты Самарияда тұратын исраилдіктер де тек төсектің бір шетімен және жұқа жабынымен ғана құтқарылады."},
	{13, "13 Мынаны тыңдап алып, Жақыптан тараған Исраил халқына қарсы куәлік етіңдер! — деп бұйырады Жаратушы Тәңір Ие, Әлемнің Әміршісі Құдай. —"},
	{14, "14 Мен Исраилдің жасаған зұлым істеріне назарымды аударып, оларды жазалайтын боламын. Сол күні Бетелдегі құрбандық үстелдерін де қиратамын. Осы құрбандық үстелдеріндегі мүйіздер кесіліп, жерге түсіп қалады."},
	{15, "15 Мен байлардың қысқы және жазғы үйлерін де жермен-жексен етіп қиратамын. Сонда олардың піл сүйегімен әшекейленген үйлері және басқа да сарайлары күйреп жоқ болады. — Жаратқан Ие осыны нық айтады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Әй, Башан сиырларындай семіз әйелдер! Самарияның тауында тұратын сендер, мына сөзді тыңдаңдар! Сендер кедейлерге зорлық жасап, мұқтаждарды езгіге ұшыратып келесіңдер, әрі күйеулеріңе: Әкел бері, ішейік! — дейсіңдер."},
	{2, "2 Жаратушы Тәңір Ие Өзінің киелі атымен былай деп ант етті: Сендерді ілмекпен тартатын, ал қалғандарыңды қармақпен сүйрететін күн бастарыңа туады!"},
	{3, "3 Сендер қала қабырғасының үйіндісінің үстімен айдалып, тіп-тіке шығатын боласыңдар, ыңғайлы сарайларыңнан далаға лақтырылып тасталасыңдар! — деп ескертеді Жаратқан Ие."},
	{4, "4 Мейлі, Бетелге барып, күнәға батыңдар, Ғылғалға да барып, қылмыстарыңды одан бетер көбейтіңдер. Таң атқан сайын сонда құрбандықтарыңды шалып ұсынып, өнімдеріңнің он бөлігінің бірін әр үш жыл сайын апарып отырыңдар."},
	{5, "5 Мейлі, шүкіршілік тартуы ретінде ашытқымен пісірілген нанды өртеп ұсыныңдар, ерікті тартулар жасап, оларыңды жұртқа жариялап мақтаныңдар! Өйткені осыны істеуді сондай жақсы көресіңдер, уа, исраилдіктер! — дейді Жаратушы Тәңір Ие. —"},
	{6, "6 Сондықтан да Мен сендердің барлық қалаларыңдағы адамдардың тістерін (арасында тамақтың бірде-бір түйірін қалдырмай) таза қылдым. Барлық жерлеріңде де сендерді нанға зар етіп қойдым. Сонда да сендер Маған қайтып келмедіңдер! — деп әшкерелейді Жаратқан Ие."},
	{7, "7 Егіннің суға ең мұқтаж, енді көктеп шығып келе жатқан кезінде Мен сендерге жаңбырды жаудырмай қойдым. Бір қалаға жаңбырды жіберсем, екіншісіне жіберген жоқпын. Бір егіс алқабына жаңбыр жауса, екіншісіне жаумады. Ал жаңбыр жаумағаны қурап қалды."},
	{8, "8 Сондықтан екі-үш қаланың халқы су ішу үшін бір қалаға жиналсаңдар да, шөлдеріңді баса алмадыңдар. Бірақ сендер сонда да Маған қайтып келмедіңдер! — деп әшкерелейді Жаратқан Ие."},
	{9, "9 Сендердің егістіктеріңе, бау-бақшаларың мен жүзімдіктеріңе шіру және көгеру індеттерін жіберіп, оларды құрттым. Інжір мен зәйтүн ағаштарыңды шегіртке жалмап жойды. Бірақ сендер сонда да Маған қайтып келмедіңдер! — деп әшкерелейді Жаратқан Ие."},
	{10, "10 Араларыңа Мысырдағыдай індет жібердім, жас жігіттеріңді семсермен қырып, жылқыларыңды тартып алып кеттім. Орналасқан жерлеріңдегі өліктердің сасық иісі мұрын жаратындай болды. Бірақ сендер сонда да Маған қайтып келмедіңдер! — деп әшкерелейді Жаратқан Ие."},
	{11, "11 Ежелде Мен, Құдай, Содом мен Ғомораны қиратқанмын. Енді сендердің кейбір қалаларыңды да қираттым. Сендер шала жанып, от ішінен құтқарылып алынған отындық ағаш сияқты болдыңдар. Бірақ сонда да Маған қайтып келмедіңдер! — деп әшкерелейді Жаратқан Ие."},
	{12, "12 Сол себепті Мен сенің басыңа осы апаттарды түсіремін, ей, Исраил! Саған еш шүбәсіз осылай істейтін боламын. Сондықтан өз Құдайыңның алдынан шығуға дайындал, ей, Исраил халқы! —"},
	{13, "13 Өйткені Жаратқан Ие тауларды қалыптастырып, желді соқтырады. Ол өз ой-ниеттерін адам баласына ашып білдіреді. Құдай таңғы арайды қара түнекке айналдырып, әлемнің биік жерлерін де аяғымен басады. Оның Есімі — Жаратқан Ие, Әлемнің Әміршісі Құдай."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Уа, Исраил халқы, өздерің туралы айтатын мына қайғылы жырымды тыңдаңдар:"},
	{2, "2 Құлады, енді қайтып тұрмайды Бұрын пәк қыздай болған Исраил халқы. Өз жерінде оған назар аудармайды, Ешкім де оны қайтып тұрғызбайды."},
	{3, "3 Жаратушы Тәңір Ие мынаны айтады: Мың жасақшысын аттандырған қалаға Қайта оралады тек жүзі ғана, Ал жүз адамын жіберген қалаға Қайта оралады тек оны ғана!"},
	{4, "4 Енді Жаратқан Ие Исраилдің халқына мынаны айтады: Маған бет бұрып сиыныңдар, сонда тірі қаласыңдар!"},
	{5, "5 Бетелдегі жалған тәңірден көмек іздемеңдер, Ғылғалға да бармаңдар, Бер-Шебаға қарай да өтпеңдер! Өйткені жау Ғылғалдың халқын еш шүбәсіз тұтқынға айдап әкетеді, Бетелдің басына да апат түспек."},
	{6, "6 Жаратқан Иеге бет бұрып Оған сиыныңдар, сонда тірі қаласыңдар! Әйтпесе Ол Жүсіптің үрім-бұтағына қарсы от іспетті лап етіп, сол от Бетелді де жалмап қояды. Ал оны сөндіретін ешкім де болмайды."},
	{7, "7 Әй, сендер әділетті бұрмалап, (бейшаралар үшін) ащы бір нәрсеге айналдырасыңдар, әділдікті менсінбей, жерге таптайсыңдар!"},
	{8, "8 Үркер мен Көгалдай мерген сияқты шоқжұлдыздарды кім жаратты? Қара түнекті таңғы арайға, күнді қараңғы түнге айналдыратын, әрі теңіздің суын жоғары көтеріп, оны жер бетіне жаудыратын кім? Оның есімі — Жаратқан Ие!"},
	{9, "9 Ол мықтыларды найзағай түскендей лезде күйретіп, бекіністерін талқандап қиратады."},
	{10, "10 Ал сендер қала алаңында сот жүргізушілерді жек көріп, шындықты жасырмай айтушыдан жиренесіңдер."},
	{11, "11 Сендер кедейлерді басып-жаншып, олардан алым ретінде мол астық жинайсыңдар. Сондықтан қашалып өңделген тастан үйлер салсаңдар да, оларда тұрмайсыңдар! Жүзімдіктер отырғызсаңдар да, солардың өнімдерінің рақатын көрмейсіңдер!"},
	{12, "12 Өйткені сендердің бас көтеріп, Маған қарсы шыққан жайттарыңның қаншалықты көп әрі күнәларыңның қандай ауыр екенін білемін: сендер пара алып, әділ жанға қысым жасайсыңдар және сотта бейшараны жолдан былай итермелеп, құқығынан айырасыңдар."},
	{13, "13 Сондықтан зерделі жан осындай жағдайда үндемей қалады, өйткені бұл — зұлым уақыт!"},
	{14, "14 Зұлымдыққа емес, жақсылыққа ұмтылыңдар! Сонда тірі қаласыңдар және өздерің жиі айтатындай, Жаратқан Ие, Әлемнің Әміршісі Құдай, сендерге жар болады."},
	{15, "15 Зұлымдықты жек көріп, жақсылық жасауды ұнатыңдар! Қала алаңында сот жүргізгенде әділдікті орнатыңдар! Сонда Жаратқан Ие, Әлемнің Әміршісі Құдай, Жүсіптің үрім-бұтағының тірі қалғандарына рақымды болатын шығар."},
	{16, "16 Сондықтан Жаратқан Ие, Әлемнің Әміршісі Құдай Ие, мынаны айтады: Барлық алаңдарда жұрт жылап-сықтап, ал көшелерде ойбауырымдап қайғыратын болады. Сонда диқандарды да зар жылауға, жоқтау айтуды шебер білетіндерді де жоқтау айтуға шақыратын болады."},
	{17, "17 Күллі жүзімдіктеріңде де қайғыланып жылап-сықтайтын боласыңдар. Себебі Мен сендерді жазалау үшін араларыңнан өтемін! — Жаратқан Ие осыны нық айтады."},
	{18, "18 Уа, Жаратқан Иенің соты күні келсе екен! деп аңсайтындар, сендер қасіретке қаласыңдар! Жаратқан Иенің күні сендерге не үшін керек? Оның алып келетіні нұр емес, қара түнек қой!"},
	{19, "19 Сол күн арыстаннан қашып, аюмен кездескен немесе үйге кіріп, қабырғаға қолмен сүйеніп тұрғанда жыланның шағып алғаны сияқты қорқынышты болады."},
	{20, "20 Жаратқан Иенің соты күні сендер үшін жарық емес, қараңғы болады емес пе?! Сол күн қара түнек, нұрдан құр болады емес пе?!"},
	{21, "21 Мен мейрамдарыңды жек көремін, салтанатты жиналыстарыңның иісі Маған жиренішті."},
	{22, "22 Сонда Маған арнап толығымен өртелетін құрбандық, астық және сұйық тартуларын ұсынсаңдар да, оларды қабылдамаймын! Бордақыланған малды ризашылық құрбандығына шалып ұсынсаңдар да, соларыңа да назар аудармаймын."},
	{23, "23 Өлеңдеріңді шуламай, Менен аулақ айтыңдар! Ішекті аспаптарыңның дыбысын тыңдағым да келмейді!"},
	{24, "24 Одан да елдеріңе әділет тасқын судай, әрі әділдік еш таусылмайтын жылғадай ағып келе берсін!"},
	{25, "25 Уа, Исраилдің үрім-бұтағы, сендер қырық жыл бойы айдаланы кезіп жүрген ежелгі уақыттарыңда құрбандыққа мал шалып, басқа да сый-тартулар ұсынғанда соларыңды Маған бағыштадыңдар ма?"},
	{26, "26 Жоқ, сендер өздерің жасап алған бейнелерді: жалған тәңір Молохтың мүсіні орналасқан шатырды және тәңірсымақтарың Ремфан жұлдызының бейнесін бірге алып жүрдіңдер. Бұларды (құлшылық етіп табынуларың үшін) өздерің жасап алған едіңдер."},
	{27, "27 Сондықтан Мен сендерді жер аударып жіберемін, тіпті Дамаскіден де әрі! — деп нық айтады Жаратқан Ие. Ол Әлемнің Әміршісі Құдай деп те аталады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 Әй, Сион тауында бейқам тұрып жатқан және өздерін Самария тауында қауіпсіз сезінетіндер, сендер қасіретке қаласыңдар! Ең озат халықтың маңдай алды адамдары деп аталатын сендерге Исраилдің үрім-бұтағы келіп, ақыл-кеңес пен көмек сұрайды."},
	{2, "2 Қална қаласына барып, қараңдар! Сол жерден үлкен Хамат қаласына, содан філістір еліндегі Ғатқа да барыңдар! Өз патшалықтарың олардан артық па? Әлде олардың жерлері сендердікінен кең-байтақ болды ма? (Әрине, жоқ. Әйтсе де, жау оларды талқандады.)"},
	{3, "3 Дегенмен, сендер апат болатын күн алыс деп ойлап, аяусыз сотталатын күнді өздерің жақындатасыңдар."},
	{4, "4 Сендер піл сүйегімен әшекейленген төсек-орындарыңда жатасыңдар, төсектеріңде жатып шіренесіңдер. Жейтіндерің — отардың тоқтылары мен бордақы таналардың семіз еті."},
	{5, "5 Жетігеннің сүйемелдеуімен ән айтасыңдар, Дәуіт патшаға еліктеп, күй аспаптарыңда ойнауға әуен-күйлер ойлап табасыңдар."},
	{6, "6 Шарапты тостағандап ішіп, үстеріңе жұпар иісті май жағасыңдар. Ал Жүсіптің үрім-бұтағының басына төніп тұрған жойылу жайлы қайғырмайсыңдар!"},
	{7, "7 Сондықтан қолға түсіп, басқа жерге аударылатын алғашқылардың арасында сендер боласыңдар! Сендердің үлде мен бүлдеге оранған, сауық-сайран құрған өмірлерің осылай бітпек!"},
	{8, "8 Жаратушы Тәңір Ие Өзінің киелі атымен ант етті. Ол — Жаратқан Ие, Әлемнің Әміршісі Құдай, мынаны айтады: Мен Жақыптың үрім-бұтағының асқақтығынан жиренемін, олардың бекіністі сарайларын да жек көремін. Сондықтан да Мен осы қаланы және онда тұратындардың бәрін жауларының қолына тапсырамын."},
	{9, "9 Бір үйде он адам қалған болса, солардың барлығы да өледі."},
	{10, "10 Қайтыс болғандардың мәйіттерін өз туысқаны жерлеуге алып шығып, үйдің ішіндегі адамнан: Қасыңда тағы біреу бар ма? — деп сұрап, сол: Жоқ,.. — деп жауап бере бастағанда, әлгі туысқан: Тыныш! Жаратқан Иенің есімін бекерге атай көрме! — деп шошитын болады."},
	{11, "11 — Өйткені біліп қой: Жаратқан Ие бұйрық берсе, үлкенді-кішілі үйлердің барлығы қиратылып талқандалады!"},
	{12, "12 Жылқы жартаста ойнақтай ала ма? Теңізді соқамен жыртуға бола ма? (Әрине, болмайды.) Ал сендер әділдік пен шыншылдықты ащы уға айналдырдыңдар!"},
	{13, "13 Сендер Лодыбар (яғни ештеңе) қаласын иемденгендеріңе шаттанып, Қарнайым (яғни қос мүйіз) қаласын өз күшімізбен басып алдық деп те мақтанасыңдар."},
	{14, "14 Бірақ Жаратқан Ие, Әлемнің Әміршісі Құдай, мынаны айтады: Уа, Исраилдің үрім-бұтағы, сендерге қарсы Мен бір халықты көтеремін. Олар сендерге солтүстіктегі Лебо-Хаматтан бастап, оңтүстіктегі Араба аңғарына дейінгі бүкіл елдеріңде зорлық-зомбылық көрсететін болады!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct kk7 poems[] = {
	{1, "1 Жаратушы Тәңір Ие маған мына көріністі көрсетті: Ол шегіртке үйірлерін жасап шығарды. Бұл патшаның өнімі жиналып болып, одан кейінгі өнім көктеп шыға бастаған кезде болды."},
	{2, "2 Шегірткелер бүкіл елдегі көкті жеп қойғанда мен: — Уа, Жаратушы Тәңір Ие, бізді кешіре гөр! Жақыптың үрім-бұтағы бұған қалайша шыдасын? Біз сондай кішкентай ғана елміз ғой! — деп жалбарындым."},
	{3, "3 Сонда Жаратқан Ие райынан қайтып: — Жарайды, бұлай істемеймін! — деп шешті."},
	{4, "4 Содан соң Жаратушы Тәңір Ие маған мына көріністі көрсетті: Тәңір Ие елді жазалау үшін от лаулатты. Сол от үлкен де терең теңізді және елдегі егістіктерді жалмап қойды."},
	{5, "5 Сонда мен: — Уа, Жаратушы Тәңір Ие, тоқтата көрші! Жақыптың үрім-бұтағы бұған қалайша шыдасын? Біз сондай кішкентай ғана елміз ғой! — деп жалбарындым."},
	{6, "6 Сонда Жаратқан Ие райынан қайтты. — Жарайды, бұлай да істемеймін! — деп шешті Жаратушы Тәңір Ие."},
	{7, "7 Ол маған тағы мына көріністі көрсетті: Жасаған Ие бір тік қабырғаның жанында тұр екен. Қолында тік бағытты көрсететін, ұшына бір кесек қорғасын байланған тіктеуіш жіп бар еді."},
	{8, "8 Жаратқан Ие менен: — Не көріп тұрсың, Амос? — деп сұрады. Мен: — Тіктеуіш жіпті, — дедім. Сонда Жасаған Ие маған тіл қатып былай деді: — Мен тіктеуіш жіпті өз халқым Исраилдің ортасына орнатамын. Бұдан былай Мен олардың күнәларына шыдамдылық көрсетпеймін!"},
	{9, "9 Ысқақтың үрім-бұтағының биіктеу жерлердегі табыну орындары қаңырап бос қалады, Исраил елінің киелі табыну орындары ойрандалады! Сонда Мен семсермен Еробоғам патшаның әулетіне қарсы шығамын!"},
	{10, "10 Ал Бетелдегі табыну орнының діни қызметкері Амасиях Солтүстік Исраилдің патшасы Еробоғамға мынадай хабар жіберді: — Амос Солтүстік Исраил халқының дәл ортасында сізге қарсы үгіт жүргізіп жатыр! Біздің еліміз оның айтқан барлық сөздеріне төзе алмайды."},
	{11, "11 Өйткені Амос: Еробоғам семсерден қаза тауып, Исраил халқы еш шүбәсіз өз елінен жер аударылады! деп жүр."},
	{12, "12 Мұнан кейін Амасиях Амосқа былай деді: — Ей, көріпкел, бар! Яһуда еліне қашып кет! Наныңды сонда тауып же, пайғамбарлық сөзіңді сол жерде айт!"},
	{13, "13 Ендігәрі Бетелде пайғамбарлық сөз айтушы болма! Бетел — патшаның сиынатын киелі жері әрі бүкіл патшалықтың құлшылық ететін үйі! —"},
	{14, "14 Бірақ Амос Амасияхқа былай деп жауап берді: — Мен жай пайғамбар емеспін, пайғамбардың шәкірті де болған емеспін. Мен мал бағып, тұт ағаштарын өсіріп, жемістерін жинаумен айналысатынмын."},
	{15, "15 Ал Жаратқан Ие мені отардың соңынан шақырып алып, Барып, халқым Исраилге Менің хабарымды жеткіз! деп тапсырма берді."},
	{16, "16 Ал енді, Жаратқан Иенің сөзін тыңда! Сен Маған: Солтүстік Исраилге қарсы пайғамбарлық сөз айтпа! Ысқақтың үрім-бұтағына қарсы сөйлеме! дейсің."},
	{17, "17 Сол үшін Жаратқан Ие саған мынаны айтады: Сенің әйелің қалада жезөкше болып, ұл-қыздарың семсерден қаза табады. Жеріңді басқалар өлшеуіш жіппен өлшеп бөлісіп алады. Ал сен өзің болсаң, жат жерде өлесің. Солтүстік Исраилдің бүкіл халқы өз елінен жер аударылып кетеді!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct kk8 poems[] = {
	{1, "1 Жаратушы Тәңір Ие маған тағы бір көріністі көрсетті. Сонда мен піскен жемістер салынған себетті көрдім."},
	{2, "2 Ол менен: — Не көріп тұрсың, Амос? — деп сұрады. — Піскен жеміс салынған себетті, — деп жауап бердім. Сонда Жаратқан Ие маған тіл қатып былай деді: — Өз халқым Исраилдің де пісіп, жиналып, сотталатын уақыты жетті. Бұдан былай Мен олардың күнәларына шыдамдылық көрсетпеймін!"},
	{3, "3 Сол күні ғибадатханадағы қуанышты ән-жырлар зарлаумен алмасады. Адам өлігі көп болып, оларды әр жерден жинап, қаладан шығарып тастайды. Бәрі де үн-түнсіз болмақ! Мен, Жаратушы Тәңір Ие, осыны нық айтамын."},
	{4, "4 Әй, мұқтаждарды аяқасты қылатын, елдің жарлыларын құртатын сендер, мынаны тыңдаңдар:"},
	{5, "5 Сендер іштей былай дейсіңдер: Айдың алғашқы күні қашан өтер екен? Сонда бидай сатамыз. Демалыс күні қашан бітер екен? Сонда астықты базарға шығарамыз! Бидай өлшеп салатын ыдысымызды кішірек, күміс өлшейтін кір тастарымызды ауырырақ қылып, таразыдан да жейміз."},
	{6, "6 Кедейлерді күміске, мұқтаждарды бір жұп аяқкиімге сатып аламыз. Салмағын ауырлату үшін астықты кебегімен қоса сатамыз!"},
	{7, "7 Ал Жаратқан Ие Жақып мақтан тұтқан (Құдай) деген Өзінің атымен былай деп ант береді: Мен сол істерінің бірін де есімнен шығармаймын!"},
	{8, "8 Осыларың үшін бүкіл ел шайқалып, оның тұрғындары қайғыға батпай ма? Расында жер Мысырдың Ніл өзеніндей көтеріліп әрі тасып, сосын қайтадан басылып, төмендейтін болады."},
	{9, "9 Жаратушы Тәңір Ие тағы мынаны айтады: Сол кезде Мен күнді тал түсте бататын қылып, жерді күндіз қараңғылыққа бөлеймін!"},
	{10, "10 Көңілді мейрамдарыңды қайғыру уақытымен, әрі қуанышты әндеріңді жоқтаумен алмастырамын. Сендерге азалы киім киіндіріп, қайғыдан шаштарыңды тақырлап алып тастатамын. Бұл жалғыз ұлдың өліміне жоқтау айтқанға ұқсайды. Иә, оның ақыры өте ащы болады!"},
	{11, "11 Жаратушы Тәңір Ие мынаны да айтады: Біліп қойыңдар! Мен не нанды аңсайтын аштықты, не суды аңсайтын шөлді де емес, Менің, Жаратқан Иенің, сөзін естуге деген аштық пен шөлді жіберетін уақытым келе жатыр!"},
	{12, "12 Сонда адамдар теңізден теңізге әрі солтүстіктен шығысқа қарай шарлап кезіп, Жаратқан Иенің сөзін сарсыла іздейтін болады. Бірақ оны таба алмайды."},
	{13, "13 Сол кезде көрікті бойжеткендер мен мықты жігіттер шөлден әлсірейтін болады."},
	{14, "14 Самарияның масқара тәңірсымағымен ант ішіп, Сенің тәңіріңмен ант етемін, уа, Дан! немесе Сенің тәңіріңмен ант етемін, уа, Бер-Шеба! дейтіндер құлап, енді қайтып тұра алмайды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct kk9 poems[] = {
	{1, "1 Мен құрбандық үстелінің жанында тұрған Жасаған Иенің берген аянын көрдім. Ол маған тіл қатып былай деді: Бағаналардың бастарын ұр, босағалары күйресін! Оларды халықтың үстіне құлат! Аман қалғандарын Өзім семсермен қырамын. Ешқайсысы қашып та кетпейді, ешқайсысы құтыла да алмайды."},
	{2, "2 Олар тіпті жер астына түсіп, көміліп қалса да, Мен оларды қолыма түсірер едім. Аспанға шығып кетсе де, оларды төменге түсіремін."},
	{3, "3 Олар Қармил тауының төбесіне тығылып қалса да, сол жерден де тауып, ұстап алар едім! Менен теңіздің түбіне барып жасырынса, Мен улы жыланға оларды шағуға бұйырар едім."},
	{4, "4 Жаулары оларды тұтқындап, басқа елге айдап әкетсе, сол жерде де семсерге оларды жалмауға әмір етер едім. Мен оларға назарымды тігіп, игілік емес, қасірет жіберемін."},
	{5, "5 Әлемнің Әміршісі Жаратқан Ие қолын жерге тигізсе, ол балқи бастайды да, онда тұратындар қайғырады. Бүкіл жер Мысырдағы Ніл өзені сияқты көтеріліп әрі тасып, сосын қайтадан төмендейтін болады."},
	{6, "6 Ол Өзінің зәулім сарайын көкте салып, соның негізін жердің бетінде қалайды. Ол теңіздің суын жоғары көтеріп, оны жердің бетіне төгеді. Оның есімі — Жаратқан Ие."},
	{7, "7 Ей, исраилдіктер, сендерді қалай көрсем, құштықтарды да солай көремін! — деп ескертеді Жаратқан Ие. — Әрине, ежелде Мен сендерді Мысырдан азат етіп алып шықтым. Бірақ Мен філістір халқын да Крит аралынан, әрі арамалықтарды (Бабыл еліндегі) Кир аймағынан алып шыққанмын. —"},
	{8, "8 Жаратушы Тәңір Ие тағы мынаны айтады: — Біліп қойыңдар, Менің назарым күнәға батқан Солтүстік Исраил патшалығына бағытталған. Оны жердің бетінен құртамын. Алайда Мен Жақыптың үрім-бұтағын толығымен жойып жібермеймін, — деп нық айтады Жаратқан Ие. —"},
	{9, "9 Мен әмір бергенде, Солтүстік Исраилдің халқы бидай іспетті шайқатылып електен өткізіледі. Олар барлық халықтардың арасына шашырап тарап кетеді, әрі електің ішіндегі бірде-бір ұсақ тас (бидаймен бірге) өтіп, жерге түспейді."},
	{10, "10 Сонда Менің халқымның арасындағы Біздің басымызға қасірет түспейді! деп көкитін күнәкарлардың барлығы семсерден құриды."},
	{11, "11 Сол күні Мен Дәуіттің құлап қалған үйін қайтадан тұрғызамын; оның жарылған жерлерін жөндеп, қираған қабырғаларын қаластырып, оны бұрынғы замандағыдай қалпына келтіремін."},
	{12, "12 Сонда олар Едом халқының тірі қалғандарына және Өзім меншігім болуға тағайындаған барлық басқа ұлттарға ие болады. — Осыны айтқан Мен, Жаратқан Ие, оны іске асырамын."},
	{13, "13 Сол кезде (өнімдеріңнің мол болатыны сонша,) астықты келесі жер жыртқан уақытқа дейін жинап, қамбаға құйып бітіре алмайтын боласыңдар. Әр жыл сайын жүзімдерің тез пісіп, артылып та қалатын болады. Жүзім шырыны таулардың беткейлерінен ағып, қыраттардан тамшылап түспек."},
	{14, "14 Мен халқым Исраилді тұтқыннан қайтарып, игілікке кенелтемін. Олар қаңырап қалған қалаларды қайта тұрғызып, сонда қоныстанатын болады, жүзімдіктер мен бау-бақшалар отырғызып, солардың шырынын ішіп, жемісін жейтін болады."},
	{15, "15 Осылай Мен халқымның тамырларын өз елінде терең жайдырамын. Олар Өзім табыстаған елден енді қайтып жұлынып тасталмайды. Мұны Мен, Құдайың Жаратқан Ие, уәде етемін."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};