#include <map>
#include <string>
class Bible62
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Әуел баста Ол бар болатын. Біз Оны естіп, көзімізбен көріп, Оған анықтап қарап, қол тигіздік. Ол — шынайы өмір сыйлайтын Сөз. Сендерге Сол туралы айтып береміз,"},
	{2, "2 себебі Өмір бізге келді. Осы мәңгілік Өмірді көрдік те, енді Оған куә болып, сендерге таныстырамыз. Ол Әкемен бірге болатын, содан көктен жерге түсіп, бізге көрінді."},
	{3, "3 Сендер бізбен байланыста болсын деп, өзіміз көріп, естігеніміз туралы хабар беріп отырмыз. Осылай бәріміз Әкемен және Оның рухани Ұлы Иса Мәсіхпен байланыстамыз."},
	{4, "4 Ортақ қуанышымыздың толық болуы үшін сендерге бұларды жазып отырмыз."},
	{5, "5 Біз Мәсіхтен естіп, сендерге білдіріп отырған хабар мынау: Құдай — Нұр, Оның ішінде ешқандай түнек жоқ."},
	{6, "6 Егер біз Құдаймен байланыстамыз дей тұра, түнекте жүрсек, өтірікші боламыз, әрі өміріміз шындыққа сай болмай қалады."},
	{7, "7 Ал егер Құдайға ұқсап нұрда тұрсақ, онда өзара байланыста боламыз және Оның рухани Ұлы Исаның төгілген қаны бізді барлық күнәларымыздан тазартады."},
	{8, "8 Егер күнәсізбіз десек, онда өзімізді алдап, бізде шындықтың болмағаны."},
	{9, "9 Егер де күнәларымызды мойындасақ, Құдай сенімді де әділетті болғандықтан оларды кешіріп, бізді барлық әділетсіздігімізден тазартады."},
	{10, "10 Ал егер еш күнә жасаған жоқпыз десек, Құдайды өтірікші етіп көрсетеміз, әрі Оның сөзі жан дүниемізден орын алмағаны."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Балаларым менің, сендер күнә жасамасын деп осыны жазып отырмын. Алайда егер біреуің күнә жасап қойсаң, Әкенің алдында әділ Қорғаушымыз бар. Сол Қорғаушымыз — Иса Мәсіх."},
	{2, "2 Ол өз жанын құрбан етіп, күнәларымыздың құнын өтеді. Өзіміздің ғана емес, сондай-ақ бүкіл адамзаттың да күнәларының құнын өтеді."},
	{3, "3 Егер Құдайдың өсиеттерін орындасақ, Құдайды жақыннан танитынымызды білеміз."},
	{4, "4 Құдайды танимын дей тұра, Оның өсиеттерін орындамайтын кісі — өтірікші, соның жан дүниесінен шындық орын алған жоқ."},
	{5, "5 Құдайға деген сүйіспеншілік Оның сөзін орындаған кісіде шын мәнінде толық болып, мақсатына жетті. Құдаймен тығыз байланыста екенімізді мынаған қарап білеміз:"},
	{6, "6 Онымен қатынаста тұрмын дейтін кісі Иса Мәсіх қалай өмір сүрген болса, солай өмір сүруге тиіс."},
	{7, "7 Сүйікті бауырларым, сендерге жазып отырғаным — жаңа өсиет емес, өздеріңе бастапқыдан белгілі көне өсиет. Осы көне өсиет — сендер Исаға сене бастаған сәтте-ақ естіген хабарларың."},
	{8, "8 Дегенмен сендерге жаңа өсиет те жазып отырмын: ол бұрын Мәсіхтің өмірінде, қазір сендердің өмірлеріңде іске асуда. Себебі түнек түріліп, шынайы жарық нұрын шашып келе жатыр."},
	{9, "9 Нұрда жүрмін дей тұра, бауырын жек көретін кісі әлі де түнекте жүр."},
	{10, "10 Ал бауырын жақсы көрген әркім нұрда жүріп, азғырылуға түспейді де, өзгені азғырмайды да."},
	{11, "11 Бауырын жек көретіннің жүріс-тұрысы түнекте, ол қайда кетіп бара жатқанын білмейді. Себебі түнек оның жан дүниесін соқыр қылып қойған."},
	{12, "12 Балаларым менің, Исаның құрбандығы арқасында күнәларың кешірілгендіктен сендерге осыны жазып отырмын."},
	{13, "13 Рухани жағынан әке болғандар, өздеріңе осыны жазып отырмын, өйткені сендер әуел баста бар болған Мәсіхті білесіңдер. Рухани жағынан жастар, өздеріңе осыны жазып отырмын, өйткені сендер әзәзілді жеңіп шықтыңдар. Рухани жағынан балалар, өздеріңе осыны жаздым, өйткені сендер көктегі Әкені білесіңдер."},
	{14, "14 Әке болғандар, өздеріңе осыны жаздым, себебі сендер әуел баста бар болған Мәсіхті білесіңдер. Жастар, өздеріңе осыны жаздым, өйткені сендер күштісіңдер, әрі Құдайдың сөзі жан дүниелеріңнен орын алып, әзәзілді жеңіп шықтыңдар."},
	{15, "15 Осы күнәлі дүниені және ондағы еш нәрсені сүймеңдер! Осы дүниені сүйгендердің көктегі Әкеге сүйіспеншілігі жоқ."},
	{16, "16 Себебі осы дүниеге тән нәрселердің бәрі: күнәкар адамның құмарлықтары, көзінің қомағайлығы әрі тұрмысына мастануы көктегі Әкеден емес, осы дүниеден бастау алған."},
	{17, "17 Осы дүние мен оның ләззаты өткінші, ал Құдайдың еркін орындаушылар мәңгі өмір сүреді."},
	{18, "18 Балаларым менің, қазіргі уақыт — осы заманның соңғы дәуірі. Сендер Мәсіхке қарсы шығатын біреу келеді деп естідіңдер, ал қазірдің өзінде де Мәсіхке қарсы шығатын адамдар көп. Біз осыдан-ақ соңғы дәуірдің келгенін біле аламыз."},
	{19, "19 Олар ортамыздан шықса да, біздікі болған жоқ, өйткені егер біздікі болса, бізбен бірге қалар еді. Бұлардың бәрінің біздікі болмағандықтары осылайша білініп қалды."},
	{20, "20 Киелі Құдай сендерге Өзінің Рухын қондырғандықтан барлығын ажырата білесіңдер."},
	{21, "21 Сендер шынайы ілімді білмегендіктен емес, қайта, оны біліп, шындықтан өтірік тумайтынын да ұққандарыңа бола осыны жазып отырмын."},
	{22, "22 Исаның Құдай жіберген Мәсіх екендігін мойындамайтын әркім — өтірікші. Көктегі Әкені және Оның рухани Ұлын мойындамайтындар — Мәсіхке қарсы шығушылар."},
	{23, "23 Кім Ұлды мойындамаса, оның Әкеге қатысы жоқ. Ал кім Ұлды мойындаса, соның Әкеге де қатысы болады."},
	{24, "24 Сондықтан бастапқыдан естіген шынайы ілімді ұстаныңдар! Егер осылай істесеңдер, онда Ұлмен және Әкемен тығыз байланыста өмір сүресіңдер."},
	{25, "25 Ал Құдайдың бізге берген уәдесі — мәңгілік өмір."},
	{26, "26 Осыны дұрыс жолдан азғырушылардан сақтандыру үшін жазып отырмын."},
	{27, "27 Ал сендерге келсек, Құдайдан алған Киелі Рух өздеріңде қалады. Сол себептен сендерге жаңа ілім үйрететін біреудің қажеті жоқ, өйткені қажеттілердің бәрін де Киелі Рух үйретеді. Оның сендерге үйреткендері еш өтіріксіз, шынайы, сондықтан Киелі Рухтың үйреткені бойынша әрекет ете беріңдер."},
	{28, "28 Ал енді, балаларым менің, Мәсіхпен тығыз байланыста қала беріңдер! Сонда Ол қайтып келгенде нық сеніміміз болып, Оның алдында ұятқа қалмаймыз."},
	{29, "29 Құдайдың әділ екенін білесіңдер, сондықтан әділдік істейтін әркімнің рухани мағынада Құдайдан туғанын ұғасыңдар."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Қараңдар, Әкенің бізге деген сүйіспеншілігі қандай зор: Құдайдың рухани балалары деп аталамыз және нақ солаймыз да! Осы күнәлі дүние кім екенімізді білмейді, себебі ол Құдайды білген жоқ."},
	{2, "2 Сүйікті бауырларым, қазір Құдайдың рухани балаларымыз, ал келешекте кім болатынымыз әлі анық емес. Алайда Мәсіх қайтып келгенде Оған ұқсайтынымызды білеміз. Себебі сол кезде Оның шынымен қандай екенін көретін боламыз."},
	{3, "3 Оған осындай үміт артқан әркім Мәсіхтің кіршіксіз таза болғанындай, өзі де күнәдан арылып, тазарады."},
	{4, "4 Күнә жасаған әркімнің Құдайдың заңын бұзғаны, себебі күнә — Құдайдың заңын бұзғандық."},
	{5, "5 Ал Мәсіхтің күнәларымызды алып тастауға келгенін де, Оның ешқандай күнә жасамағанын да білесіңдер."},
	{6, "6 Сондықтан кім Мәсіхпен тығыз байланыста тұрса, сол күнә жасай бермейді. Күнә жасай беретін әркім Оны көрген де, таныған да емес."},
	{7, "7 Балаларым менің, сендерді ешкім де күнә жасауға азғырмасын! Әділдік істеуші адам Мәсіхтің Өзі сияқты әділ болады."},
	{8, "8 Ал кім күнә жасай берсе, сол — шайтанның баласы, себебі шайтан әлем жаратылғаннан бері күнә жасап келеді. Бірақ Құдайдың рухани Ұлы шайтанның ісін жою үшін бұ дүниеге келді."},
	{9, "9 Рухани мағынада Құдайдан туғандар күнә жасай бермейді, себебі олардың бойында Құдай берген жаңа өмір қалады. Осылайша олар Құдайдан туғандықтан күнә жасауларын жалғастыра алмайды."},
	{10, "10 Құдайдың рухани балаларын шайтанның адамдарынан мынадан ажыратуға болады: әділ өмір сүрмейтін, әсіресе бауырласын сүймейтін, әркім Құдайдың рухани баласы емес."},
	{11, "11 Сендер бастапқыда естіген хабар мынау: бір-бірімізді сүюіміз керек!"},
	{12, "12 Інісін ұрып өлтірген шайтанның адамы Қабылға ұқсамаңдар! Оны неліктен ұрып өлтірді? Өйткені өз іс-әрекеті әділетсіз, ал інісінікі әділетті болатын."},
	{13, "13 Сонымен осы күнәкар дүние сендерді жек көрсе, бұған таңғалмаңдар, бауырларым!"},
	{14, "14 Өзіміздің рухани өлілерден тірілерге айналғанымызды білеміз, себебі бауырларымызды сүйеміз. Бауырын сүймейтін адам өлі болып қала береді."},
	{15, "15 Бауырын жек көретін әркім — кісі өлтіруші! Ал мынаны білесіңдер: кісі өлтірушінің мәңгілік өмірі жоқ."},
	{16, "16 Иса Мәсіхтің өз өмірін біз үшін қиғандығы арқылы нағыз сүйіспеншіліктің не екеніне көзіміз жетті. Біз де бауырларымыз үшін жанымызды қиюға даяр болуымыз керек."},
	{17, "17 Ал егер осы дүниелік мал-мүлкі бар біреу басына қиыншылық түскен бауырына тасжүректік танытса, оның бойында Құдайдың сүйіспеншілігі бар ма?!"},
	{18, "18 Балаларым менің, сөз жүзінде емес, іс жүзінде шынайы сүйіспеншілік білдірейік!"},
	{19, "19 Сөйтіп өзіміздің шынайы жолда екендігімізді біліп, Құдай алдында жүрегіміз орнығады."},
	{20, "20 Себебі егер жүрегіміз бізді айыптаса да, Құдай жүрегімізден жоғары ғой, Ол бәрін де біледі."},
	{21, "21 Сүйікті бауырларым, жүрегіміз бізді айыптамағанда Құдай алдында нық сеніміміз болады және"},
	{22, "22 Одан не сұрасақ та, аламыз. Өйткені Құдайдың өсиеттерін орындап, Ол не қаласа, соны істейміз."},
	{23, "23 Ал Құдайдың өсиеттері мынау: Оның рухани Ұлы Иса Мәсіхке сеніп, бір-бірімізді сүюіміз керек."},
	{24, "24 Кім Оның өсиеттерін орындаса, ол Құдаймен және Құдай онымен тығыз байланыста тұрады. Құдайдың бізбен тығыз байланыста екенін Оның бізге сыйлаған Киелі Рухы арқылы білеміз."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Сүйікті бауырларым, кез келген рухтарға сене бермеңдер, олар Құдайдан келген бе, жоқ па — алдымен соны анықтаңдар! Өйткені көптеген жалған пайғамбарлар жер жүзіне тарады."},
	{2, "2 Құдайдың Рухын мынаған қарап ажырата білесіңдер: Құдайдан шыққан Киелі Рух Иса Мәсіхтің адам бейнесінде көктен келгенін мойындайды."},
	{3, "3 Ал Иса Мәсіхтің адам болып келгенін мойындамайтын әрбір рух Құдайдан емес, керісінше, ол — Мәсіхке қарсы шығушының рухы. Сендер соның келетінін естідіңдер, ол қазірдің өзінде-ақ дүниеде жүр."},
	{4, "4 Ал, балаларым менің, сендер Құдайдансыңдар, жалған пайғамбарларды жеңіп шықтыңдар. Өйткені сендердегі Киелі Рух күнәкар дүниені билеп тұрған шайтаннан құдіретті."},
	{5, "5 Жалған пайғамбарлар осы күнәкар дүниеден болғандықтан осы дүниелік тұрғыдан сөйлейді, әрі осы дүниенің адамдары оларға ден қояды."},
	{6, "6 Біз Құдайданбыз; Оны танитындар бізге құлақ салады, ал Құдайдан еместер бізге құлақ салмайды. Шындықты сөйлейтін Рух пен алдамшы рухты осы арқылы ажырата аламыз."},
	{7, "7 Сүйікті бауырларым, бір-бірімізді сүйейік! Себебі сүйіспеншілік Құдайдан; сүйетін адам — Құдайдың рухани баласы, ол Құдайды танып біледі."},
	{8, "8 Сүймейтін кісі Құдайды білмейді, өйткені Құдай — сүйіспеншілік."},
	{9, "9 Құдай бізге деген сүйіспеншілігін былай көрсетті: Сол арқылы шынайы өмір сүруіміз үшін Құдай Өзінің жалғыз рухани Ұлын бұ дүниеге жіберді."},
	{10, "10 Бұл сүйіспеншіліктің мәнісі мынада: Құдайды сүйген біз емес, қайта, Ол бізді сүйгендіктен, құрбандығы арқылы күнәміздің құнын өтеу үшін Өзінің рухани Ұлын жіберді."},
	{11, "11 Сүйікті бауырларым, Құдай бізді осылайша сүйгендіктен, біз де бір-бірімізді сүюіміз керек."},
	{12, "12 Ешкім еш уақытта Құдайды көзімен көрген емес; алайда бір-бірімізді сүйсек, онда Құдай жан дүниемізден орын алып, Оның сүйіспеншілігі бойымызда әбден толысып, мақсатына жеткені."},
	{13, "13 Құдай бізге Өзінің Рухын сыйлады. Біздің Онымен, Оның бізбен тығыз байланыста екендігімізді осыдан білеміз."},
	{14, "14 Әкенің Өзінің рухани Ұлын дүниеге Құтқарушы ретінде жібергенін біз өз көзімізбен көрдік, соған куә болып келеміз."},
	{15, "15 Кім Исаны Құдайдың рухани Ұлы деп мойындаса, Құдай онымен, ол да Құдаймен тығыз байланыста тұрады."},
	{16, "16 Біз Құдайдың өзімізге деген сүйіспеншілігін біліп, Оған нық сенеміз. Құдай — сүйіспеншілік. Сол себептен, кім Оның сүйіспеншілігіне сай әрекет ете берсе, ол Құдаймен, Құдай да онымен тығыз қатынаста тұрады."},
	{17, "17 Мәсіхтің осы дүниеде қалай өмір сүргеніндей өмір сүрсек, онда Құдайдың сүйіспеншілігі бойымызда әбден толысып, мақсатына жетеді. Осылай қиямет сотында нық сенімді боламыз."},
	{18, "18 Сүйіспеншілікте қорқыныш жоқ. Шынайы сүйіспеншілік қорқынышты жолатпайды, себебі қорқыныш жазаға байланысты. Қорқатын кісіде сүйіспеншілік мақсатына жеткен емес."},
	{19, "19 Біз сүйеміз, себебі Ол бізді алдымен сүйді."},
	{20, "20 Біреу Құдайды сүйемін дей тұра, бауырын жек көрсе, оның өтірікші болғаны. Себебі көз алдындағы бауырын сүймейтін кісі көзге көрінбейтін Құдайды қалай сүйе алады?"},
	{21, "21 Одан алған өсиетіміз мынау: Құдайды сүйетін кісі бауырын да сүюге тиіс!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Исаны Мәсіх деп сенетін әркім — Құдайдың рухани баласы. Әкені сүйетіндер Оның балаларын да сүйеді."},
	{2, "2 Біз рухани балаларын сүйетінімізді Құдайды сүйіп, Оның өсиеттерін орындауымыздан білеміз."},
	{3, "3 Ал өсиеттерін орындағанымыз — Құдайды сүйгеніміз; оларды орындау қиын емес."},
	{4, "4 Өйткені Құдайдың рухани балалары осы күнәлі дүниені жеңеді. Осы дүниені жеңген күш — біздің сеніміміз."},
	{5, "5 Кім осы күнәлі дүниені жеңе алады? Исаны Құдайдың рухани Ұлы деп сенген кісі ғана оны жеңе алады."},
	{6, "6 Иса Мәсіх бізге келгенде сумен шомылдыру рәсімін де, жанын қиып, қанын төгуді де басынан өткізді. Ол келгенде тек сумен шомылдыру рәсімінен өтіп қана қойған жоқ, жанын қиып, қанын төкті де. Киелі Рух бұған куә, себебі Киелі Рух — шындық."},
	{7, "7 Сонымен куә болатындар үшеу:"},
	{8, "8 Киелі Рух, су және қан; бұл Үшеуінің айғақтығы бірдей."},
	{9, "9 Адамдардың куәлігін қабылдап жүрміз. Ал Құдайдың куәлігі адамдікінен гөрі салмақтырақ. Сондықтан Құдайдың Өзінің рухани Ұлы жайында берген куәлігіне сенуге тиіспіз."},
	{10, "10 Оның рухани Ұлына сенген кісінің жүрегінде Құдайдың куәлігі жүреді. Ал Құдайға сенбеген кісі Оны өтірікші етіп көрсетеді, себебі ол Құдайдың Өзінің рухани Ұлы туралы берген куәлігіне сенбейді."},
	{11, "11 Бұл куәліктің мәнісі мынадай: Құдай бізге мәңгілік өмір сыйлады. Осы өмір Оның рухани Ұлында:"},
	{12, "12 Құдайдың рухани Ұлымен байланысы бар адам шынайы өмірге ие, ал Онымен байланысы жоқта шынайы өмір де жоқ."},
	{13, "13 Сендер Құдайдың рухани Ұлына сенгендіктен мәңгілік өмірге иесіңдер. Оған сенім артқан сендердің соны білулерің үшін бұларды жазып отырмын."},
	{14, "14 Біз Оның еркіне сай бір нәрсе сұрасақ, Құдай тілегімізге құлақ салады деп нық сенеміз."},
	{15, "15 Не сұрасақ та, Құдай бізге құлақ салады деп білсек, Оның тілегенімізді беретінін де білеміз."},
	{16, "16 Бауырының өлімге апармайтын күнә жасап жатқанын көрген кісі ол үшін Құдайға сиынсын. Сонда күнә жасағанның өмірі сақталады. Алайда өлімге апаратын күнә да бар. Құдайға сиынсын дегенде сондай күнә туралы айтып отырған жоқпын."},
	{17, "17 Әділетсіздіктің бәрі — күнә, ал өлімге апармайтын күнә да бар."},
	{18, "18 Мынаны білеміз: кім Құдайдың рухани баласы болса, сол күнә жасай бермейді. Құдайдың рухани Ұлы оны сақтағандықтан, шайтан оған тиісе алмайды."},
	{19, "19 Біз Құдайданбыз, бірақ бүкіл дүниеге шайтан билігін жүргізіп отыр, бұны білеміз."},
	{20, "20 Құдайдың рухани Ұлының келгенін де білеміз; біздің шынайы Құдаймен танысуымыз үшін Ол көзімізді ашты. Сондықтан шынайы Құдаймен және Оның рухани Ұлы Иса Мәсіхпен байланыстамыз. Ол — шынайы Құдай және мәңгілік өмір."},
	{21, "21 Балаларым менің, жалған тәңірлерден аулақ болыңдар!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};