#include <map>
#include <string>
class Bible61
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Иса Мәсіхтің басыбайлы қызметшісі және елшісі Шимон Петірден ортақ сеніміміздегілердің бәріне дұғай сәлем. Осы аса құнды сенім бізге берілгендей, сендерге де Құдайымыз бен Құтқарушымыз Иса Мәсіхтің әділдігіне сай сыйға берілді."},
	{2, "2 Лайым сендер Құдай мен Иеміз Исаны бұрынғыдан да жақынырақ танып білгендерің арқылы сендерге рақым, амандық және тыныштық молынан жауа берсін!"},
	{3, "3 Құдай бізді құдіретті күшімен және Оны жақыннан танып білуіміз арқылы Өзіне ұнамды жаңа өмір сүруімізге қажеттінің бәрімен қамтамасыз етті. Ол бізді Өзінің ұлы да ізгілікті болмысы арқылы меншікті халқы болуға шақырады."},
	{4, "4 Өзінің болмысы сондай ұлы әрі ізгілікті болғандықтан, Құдай бізге аса құнды да тамаша уәделерін берді. Бұл уәделерінің арқасында сендер Құдайдың әділ болмысын бөлісіп, арам құмарлықтарға салынбай, осы күнәкар дүниелік адамдардың азғындығынан аулақ жүріп құтыла аласыңдар."},
	{5, "5 Сол себептен де мына қасиеттерге кенелуге бар ынталарыңмен ұмтылыңдар: сенімдеріңде ізгілік көрсетіңдер, ал ізгілік көрсеткенде саналылық та танытыңдар,"},
	{6, "6 саналылықтарыңда ұстамдылық та молынан болсын! Ал ұстамдылықтарыңда төзімділік, төзімділіктеріңде Тәңір Иеге бағышталғандық,"},
	{7, "7 Тәңір Иеге бағышталғандықтарыңда бауырластарыңа деген ізгі ниеттілік, ал ізгі ниеттіліктеріңде шынайы сүйіспеншілік танытыңдар!"},
	{8, "8 Егер осы қасиеттер сендердің бойларыңда болса және молая түссе, онда рухани өмірлерің пайдасыз, өнімсіз болып қалмайды, керісінше, Иеміз Иса Мәсіхті жақынырақ танып біле бересіңдер."},
	{9, "9 Ал кімде бұл қасиеттер жетілмесе, сол алыстан көрмейтінге, тіпті соқырға ұқсайды. Сондай кісі өзінің өткен кезеңдердегі (Мәсіхке сеніп) күнәларынан тазарғанын ұмытқан."},
	{10, "10 Сондықтан да, бауырластарым, Құдайдың өздеріңді меншікті халқы болуға шақырып, таңдап алғандығын өмірлеріңмен нық бекітуге ынтамен ұмтылыңдар! Егер солай істесеңдер, ешқашан да тура жолдан тайып кетпейтін боласыңдар."},
	{11, "11 Осылайша сендерге Иеміз бен Құтқарушымыз Иса Мәсіхтің мәңгілік Патшалығының қақпасы айқара ашылып, оған емін-еркін кіресіңдер."},
	{12, "12 Сол себепті, сендер осы айтқандарымды білсеңдер де, қабылдаған шынайы ілімді берік ұстансаңдар да, мен оларды бәрібір ұдайы естеріңе салып отырмақпын."},
	{13, "13 Мен әлі де осы тәндік шатырда тұрғанымда, соларды естеріңе түсіріп, рухани дамуларыңа қозғау салып отыруды дұрыс деп санаймын."},
	{14, "14 Иеміз Иса Мәсіх өзіме анық білдіргеніндей, жуырда осы тәндік денемді тастайтыным маған белгілі."},
	{15, "15 Сондықтан мен бұ дүниеден аттанғаннан кейін де сендер сол айтқандарымды әрдайым есте сақтауларың үшін қолымнан келгеннің бәрін де істеймін."},
	{16, "16 Біз сендерге Иеміз Иса Мәсіхтің зор құдіретпен қайта оралуы туралы білдіргенде, қулықпен қиыстырылған аңыз-ертегілерге сүйенген жоқпыз. Керісінше, біз Иеміздің салтанатты ұлылығын өз көзімізбен көрген куәгерлер болған едік."},
	{17, "17 Сол кезде шексіз ұлылықтың Иесі, Құдай Әке, Мәсіхке арнап: Бұл — Менің сүйікті Ұлым, Мен Оған ризамын, — деп дауыстап, Оны құрмет пен салтанатты ұлылыққа кенелтті."},
	{18, "18 Біз Иеміз Иса Мәсіхпен бірге қасиетті тауда болғанда, көктен шыққан осы дауысты естідік."},
	{19, "19 Сонымен қатар, біздерде пайғамбарлардың жазып қалдырған нық сенімді сөздері бар ғой. Бұларға көңіл бөлсеңдер, жақсы болады. Сол сөздер қараңғылықта нұрын шашып тұрған шам-шыраққа ұқсайды. Таң атып, шолпан жұлдызының пайда болатынындай, ақырында Мәсіх көктен қайтып келіп, жүректеріңе толық түсінік құятын болады."},
	{20, "20 Ең бастысы, Киелі жазбалардағы пайғамбарлар сөздерінің ешқайсысы да пайғамбардың жеке түсінігі бойынша туындамағанын біліңдер."},
	{21, "21 Себебі бұл пайғамбарлық сөздер ешқашан адам баласының қалауымен пайда болған емес. Қайта, Киелі Рух Құдайға бағышталған адамдарға Оның хабарларын айтуға қозғау салып отырды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Алайда сол заманда Құдай халқының арасында жалған пайғамбарлар да пайда болды. Дәл солай сендердің араларыңда да жалған тәлім берушілер болмақ. Олар жік салғыш зиянды ілімдерді жасырын енгізеді; тіпті өздерінің күнәларының құнын өтеп жанын құрбан еткен Әміршісі Мәсіхті де мойындамайды! Сондықтан олар бастарына кенеттен түсетін жойылуды өздері шақырып алады."},
	{2, "2 Көптеген адамдар солардың азғындықтарына еріп кетпек. Оларға бола ақиқат жолы масқараланатын болады."},
	{3, "3 Сол жалған тәлім берушілер сендерді ашкөздіктен өтірік сөздерімен алдап кетпек. Олардың үкімі әуелден-ақ бастарына төніп тұр; жойылулары кешікпей, сөзсіз іске аспақ!"},
	{4, "4 Себебі Құдай күнә жасаған періштелерді де аяған жоқ. Оларды қияметте сотталуға сақтау үшін тозақтың қара түнегіне ұстап беріп, шынжырлатып тастады."},
	{5, "5 Тәңір Ие ежелгі дүниені де аямай, арсыз зұлымдардың әлеміне топан су жіберді. Жалғыз құтқарғаны әділдікті уағыздаушы Нұх пайғамбар мен оның отбасы, барлығы сегіз-ақ адам, болды."},
	{6, "6 Құдай Содом мен Ғомора қалаларын да үкімдеп, күл-талқандарын шығарды. Ол солардың мысалымен болашақтағы зұлымдардың неге ұшырайтынын көрсетті."},
	{7, "7 Ал әділ Лутты Тәңір Ие аман сақтап қалды. Ол айналасындағы арсыз адамдардың бұзық қылықтары үшін қатты қиналып жүрді."},
	{8, "8 Сол ізгі жан олардың арасында тұрып, Құдайдың бұйрығына қайшы іс-әрекеттерін күн сайын көріп, естіп, өзінің әділ ар-ұжданы алдында азап шекті."},
	{9, "9 Бұл солай болғанда, Жаратқан Ие Өзіне ұнамды өмір сүретіндерді өтіп жатқан сынақтарынан құтқаруды, ал әділетсіздерді қиямет соты болатын күнге дейін сақтап, жазалауды, әрине, біледі."},
	{10, "10 Әсіресе, күнәкар болмыстарының арам құмарлықтарының жетегіне ерген, ешбір билікті елемейтіндердің тағдырлары осындай болмақ! Сондай тәкаппар да қиқар жалған тәлім берушілер абыройлы билеушілерді балағаттаудан қаймықпайды."},
	{11, "11 Тіпті күш-қуаттары әлдеқайда зор періштелер де соларды Жаратқан Иенің алдында ешқандай балағат сөзбен айыптамайды."},
	{12, "12 Бірақ сол алдамшы тәлім берушілер ақылдарымен емес, жабайы аңдар сияқты түйсіктерімен ғана жүреді. Ал аңдар аулап, өлтіру үшін бар ғой. Сол адамдар түсінбеген нәрселері туралы жаман сөз айта береді. Ақырында жабайы аңдар сияқты олар да жойылмақ,"},
	{13, "13 осылай жасаған әділетсіз істеріне лайықты жазаларын тартпақ. Мұндайлар тіпті күндіз тәндік тәбеттерін қанағаттандырып, алдамшы ырду-дырдудан ләззат табады; өздеріңмен бірге тойлауларымен ар-ұяттарыңа дақ түсіріп, сендерді жұрт алдында ұятқа қалдырады."},
	{14, "14 Олар ұдайы күнә жасаудың орайын іздеп, көздерімен әйелдерді ішіп-жеп, сенімі тұрақсыздарды өздеріне еліктіріп отырады. (Солардың саны көбейе түссін деп) ашкөзденіп үйренген мұндайларды Құдайдың қарғысы атқан!"},
	{15, "15 Олар баяғыдағы Босор ұлы Балағамның жолына түсіп, тура жолдан тайып, адасып кетті. Балағам әділетсіз ісі үшін алатын сыйын қатты ұнатты,"},
	{16, "16 бірақ жаман қылықтары бетіне басылды: оның есегіне тіл бітіп, адам секілді сөйлеп, қиқар пайғамбардың ақымақ әрекетін тоқтатты!"},
	{17, "17 Сол жалған ілімді таратушылар қауымды алдап, тақырға отырғызатын, кеуіп қалған бұлақ көздеріне және дауыл айдаған, жаңбырсыз ақ бұлттарға ұқсайды. Оларға тозақтың қара түнегі дайын тұр."},
	{18, "18 Мұндайлар бос сөздермен мақтанып жүреді. Олар теріс жолмен жүргендердің арасынан жуырда ғана құтылып шыққан адамдарды күнәкар болмыстарының құмарлықтарын қайтадан жүгенсіздікпен қанағаттандыруға еліктіріп, торларына түсіреді."},
	{19, "19 Олар осындай жандарға бостандықты уәде етеді, бірақ өздері азғындықтың құлдығында жүреді. Өйткені адам неден жеңілсе, соның құлы болар."},
	{20, "20 Осындайлар Иеміз әрі Құтқарушымыз Иса Мәсіхті танып білгендері арқылы осы дүниелік арамдықтардан арылып, құтылған болатын. Алайда кейін қайтадан олардың шырмауына түсіп, жеңіледі. Сонда олардың соңғы жағдайы бұрынғысынан да мүшкіл болмақ."},
	{21, "21 Олар үшін әділет жолын танып біліп, Мәсіхтің тапсырған қасиетті өсиеттерін қабылдап, кейін кері бұрылғаннан гөрі, сол жолды мүлдем білмегендері жақсы болар еді."},
	{22, "22 Бастарынан кешкендерінде мына тауып айтылған мақал-мәтел жүзеге асады: Төбет қайта оралар өзінің құсығына, Жуылған шошқа қайтар аунайтын батпағына."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Сүйікті бауырластарым, бұл менің сендерге жазған екінші хатым. Екеуінде де осы жайттарды естеріңе түсіре отырып, шындап ойлануларыңа түрткі салмақ болдым."},
	{2, "2 Өткен замандарда Құдайға бағышталған пайғамбарлар айтып кеткен сөздерін және Иеміз әрі Құтқарушымыздың сендерге жіберген елшілері арқылы жеткізген өсиетін есте сақтағандарыңды қалаймын."},
	{3, "3 Ең бастысы, мынаны біліп қойыңдар: осы соңғы заманда арам құмарлықтарына салынып, сендерді келемеждейтін адамдар шығатын болады."},
	{4, "4 Мұндайлар: Иелеріңнің қайтып келетіні жайлы берген уәдесі қайда, ә? Аталарымыз қайтыс болғаннан кейін де барлық жайттар еш өзгеріссіз, жаратылыстың басталуынан бергі қалпында қалып келеді ғой, — дейді."},
	{5, "5 Солай ойлағанда олар мыналарды әдейі ескермейді: Құдайдың бұйрығымен көк баяғыдан бері бар болған, ал жер судан шығып, сумен қалыпқа келтірілді."},
	{6, "6 Тәңір Иенің бұйрығына сай топан су кенеттен көне заманғы дүниені басып, адамзатты жойып жіберді."},
	{7, "7 Сол сияқты, Құдай Өзінің әмірімен осы қазіргі аспан мен жерді де әділетсіздердің сотталып, тозаққа түсетін күні отпен қиратуға қалдырып отыр."},
	{8, "8 Сүйікті бауырластар, Жаратқан Иенің алдында бір күн мың жылдай, ал мың жыл бір күндей екенін жақсылап ұғып алыңдар."},
	{9, "9 Кейбіреулер Ол кешігіп, келмей қалды деп санағанмен, Иеміз уәдесін орындауын кешіктірмейді! Керісінше, Ол бізге төзімділік танытуда: ешкімнің де тозаққа түсуін емес, барлық адамдардың теріс жолдан қайтып, күнәларына өкініп, солардан арылуын қалайды!"},
	{10, "10 Ұрының табан астынан түсетіні сияқты, Иеміздің қайта оралатын күні де білдіртпей кенеттен келмек. Сол күні аспан қатты шумен жоқ болып, дүниенің құрамдас бөліктері өртеніп құрып кетеді. Жердің өзі де, ондағы бүкіл жаратылыс пен адам қолымен істелгеннің бәрі де өртеніп жоқ болады."},
	{11, "11 Бар дүние осылайша құрып кететіндіктен, сендер қандай болуларың керек? Жүріс-тұрыстарың Тәңір Иеге бағышталып, қасиетті де Оған ұнамды болуға тиіс!"},
	{12, "12 Себебі сендер Құдайдың алдын ала белгілеген күнін сағына күтіп, оны тезірек келтіргілерің келеді. Сол күні аспан өртеніп құрып, дүниенің құрамдас бөліктері оттың жалынында балқып кетеді."},
	{13, "13 Ал біз Құдайдың уәдесіне сай әділдік орнаған жаңа аспан мен жаңа жердің пайда болуын күтудеміз."},
	{14, "14 Сонымен, сүйікті бауырластар, сендер бұлардың келуін күтіп жүргендіктен, Мәсіхтің алдында тұрғанда Оның сендерді мүлтіксіз пәк таза, тыныштықпен өмір сүрді деп табуы үшін осыған жан сала ұмтылыңдар!"},
	{15, "15 Иеміз төзімділік танытуда, себебі Ол адамдарды құтқарғысы келеді, мұны дұрыс ұғыңдар! Сүйікті бауырласымыз Пауыл да сендерге Тәңір Ие өзіне сыйлаған даналығымен осы туралы хат жазған болатын."},
	{16, "16 Ол бұл мәселеге тоқталып өткен барлық хаттарында да осылай дейді. Оларда бірқатар түсінуге қиын жерлер бар. Шынайы рухани тәлім алмаған, тұрақсыз адамдар өзге Киелі жазбаларды бұрмалағандары сияқты, бұларды да бұрмалап, қате түсіндіреді. Сол арқылы олар тозаққа түсулеріне өздері себепші болады."},
	{17, "17 Алайда сендер, сүйікті бауырластарым, бұны алдын ала біліп, сақ болыңдар: ұяты жоқ, тура жолдан адасқан адамдарға ілесіп, берік негіздеріңнен айырылып қалып жүрмеңдер!"},
	{18, "18 Қайта, Иеміз әрі Құтқарушымыз Иса Мәсіхтің рақымына кенеліп, Оны жақынырақ танып білуде өсе беріңдер! Оның ұлылығы қазір де, мәңгілікте де даңқтала берсін! Аумин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};