#include <map>
#include <string>
class Bible39
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Жаратқан Ие Малахи арқылы Исраилге сөзін арнап мына хабарды жеткізді:"},
	{2, "2 — Мен сендерді сүйіп келемін, — деп нық айтады Жаратқан Ие. — Бірақ сендер: Сен бізді қалайша сүйіп келесің?! деп сұрайсыңдар. — Жаратқан Ие: — Есау Жақыптың туған ағасы емес пе еді? Бірақ Мен Жақыпты сүйіп таңдап алдым,"},
	{3, "3 ал Есауды таңдамадым. Оның қыратты аймағын қаңыраған бос далаға айналдырып, меншікті жерін құла түздің шибөрілеріне қалдырдым, — деп жауап береді."},
	{4, "4 Едом: — Біз қирасақ та, үйінділерімізді қайта тұрғызып ала аламыз! — десе де, Әлемнің Иесі мынаны айтады: — Олар тұрғызса да, Мен қайтадан қиратып тастаймын. Олардың жері — Зұлымдық елі, халқы — Жаратқан Иенің наразылығына ұдайы іліккен халық деп аталып кетеді."},
	{5, "5 Сендер бұны өз көздеріңмен көріп, Жаратқан Ие Исраилдің шекараларынан тыс жерлерде де даңқтаулы! дейтін боласыңдар."},
	{6, "6 — Ұл әкесін сыйлайды, қызметші қожайынын құрметтейді. Егер Мен көктегі Әкелерің болсам, Мені сыйлайтындарың қайда? Егер Қожайындарың болсам, Маған көрсеткен құрметтерің қайда? — деп сұрайды Әлемнің Иесі. — Алайда сендер, уа, діни қызметкерлер, Менің есімімді менсінбей жүресіңдер! Бірақ та сендер: Біз қалайша Сенің есіміңді менсінбей жүр екенбіз? деп сұрайсыңдар."},
	{7, "7 Сендер Маған бағышталған құрбандық үстелінде арам құрбандықтар ұсындыңдар! Сөйте тұра: Біз Сені қалайша қорлаппыз? деп сұрайсыңдар. Сендер Жаратқан Иенің құрбандық үстеліне ерекше мән бермесек те болады деп есептейсіңдер."},
	{8, "8 Құрбандыққа шалуға соқыр малды әкелесіңдер, бұл сұмдық емес пе?! Ақсақ не ауру мал әкелсеңдер, бұл да сұмдық емес пе?! Сондайды әкіміңе (салық ретінде) ұсынып көр! Ол соған риза болып саған оң көзімен қарар ма екен? — деп ескертеді Әлемнің Иесі."},
	{9, "9 Енді Құдайға: Бізге рақымды бола гөр! деп жалбарынып көріңдер! Бірақ сендердің алып келген осындай құрбандықтарың үшін Ол сендерге оң көзімен қарар ма екен?! — деп сұрайды Әлемнің Иесі."},
	{10, "10 — Одан да сендердің біреуің ғибадатхананың қақпаларын бекітіп қойсаңдар игі болар еді! Сонда сендер құрбандық үстелінде бекерге от жақпас едіңдер! Мен сендерге риза емеспін, — деп ескертеді Әлемнің Иесі. — Мен сендердің қолдарыңнан ешқандай сый-тартуды қабылдамаймын."},
	{11, "11 Күннің шығысынан батысына дейін халықтар арасында Менің есімім зор даңққа бөленеді. Барлық жерлерде де Маған арналып хош иісті заттар түтетіліп, адал сый-тартулар ұсынылады. Себебі халықтар арасында Менің есімім даңқталады, — деп нық айтады Әлемнің Иесі."},
	{12, "12 Алайда сендер Менің есімімді қорлайсыңдар! Өйткені Жаратқан Иенің құрбандық үстеліне лайықсыз сый-тартулар әкелулерің арқылы сендер: Оның үстелін арамдауға болады дейсіңдер."},
	{13, "13 Сондай-ақ: Қандай ауыр жүк! деп, оны менсінбей мұрындарыңды шүйіре иіскейсіңдер, — дейді Әлемнің Иесі. — Сендер ұрлап алынған, жараланған, ақсақ не ауру малды әкеліп, оны Маған арнап құрбандыққа шалғандарыңда, неліктен Менің сондай сый-тартуды қолдарыңнан қабылдауым қажет? — деп сұрайды Жаратқан Ие."},
	{14, "14 Өзінің отарында құрбандыққа ұсынуға лайықты мінсіз еркек тоқтысы болып, соны Тәңір Иеге бағыштап шалуға уәде бере тұра, кейін Оған кемістігі бар басқа малды ұсынған өтірікшіні қарғыс атады! Өйткені Мен ұлы Патшамын! — деп ескертеді Әлемнің Иесі. — Менің есімім өзге халықтардың арасында айбатты болып, терең қастерленеді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 — Ал мынау Менің сендерге арнаған ескертуім, уа, діни қызметкерлер!"},
	{2, "2 Мені тыңдап, есімімді шын жүректен құрметтеуге берік шешім қабылдаңдар! — деп нық айтады Әлемнің Иесі. — Әйтпесе Мен сендердің өздеріңе қарғыс жіберемін, әрі сендердің халыққа берген баталарыңды қарғысқа айналдырамын. Иә, тіпті қазірдің өзінде Мен оларды қарғысқа айналдырдым! Себебі сендер Менің есімімді шын жүректен құрметтемейсіңдер."},
	{3, "3 Сендердің кесірлеріңнен Мен ұрпақтарыңды жазалаймын. Өз мейрамдарыңда ұсынылған құрбандықтарыңның жынын беттеріңе жағамын. Сонда сендер соларыңмен бірге қоқыс төгілетін жерге әкетілесіңдер."},
	{4, "4 Осылай сендер Леуі руымен жасаған Келісімімнің өз күшінде қалуын көздеп өздеріңе осы ескертуді жібергеннің Мен екенімді білетін боласыңдар, — дейді Әлемнің Иесі. —"},
	{5, "5 Менің Леуі руымен жасаған Келісімім өмір мен амандықты мақсат еткен. Мен осы екеуін де оларға сыйлап келдім. Леуіліктер Менің есімімді қастерлеуге тиіс еді. Бастапқы кезде олар Менің есімімнің алдында дірілдеп қорқып, оны терең қастерледі де."},
	{6, "6 Ауыздарынан тек шынайы тәлім ғана шығып, олар еш өтірік айтпайтын. Леуіліктер Менімен байланысып тыныш та әділ жүрді, әрі көптеген адамды теріс жолдарынан қайтарды."},
	{7, "7 Себебі діни қызметкердің аузынан шыққан сөздері білімді сақтайды. Адамдар оның айтқандарынан тәлім алуға ізденулері керек. Себебі ол — Әлемнің Иесінің хабаршысы."},
	{8, "8 Бірақ сендер осы жолдан тайып кеттіңдер. Берген тәлімдеріңмен көптеген адамды адастырдыңдар. Сендер Леуімен жасасқан Келісімімді бұздыңдар! — Әлемнің Иесі осыны әшкерелейді. —"},
	{9, "9 Сондықтан да Мен сендерді бүкіл халыққа абыройсыз етіп, олардың көз алдында масқаралап, төмендеттім. Себебі сендер Менің тура жолыммен жүрмедіңдер. Таурат заңымды жүзеге асырғанда адамның бет-жүзіне қарадыңдар."},
	{10, "10 Біздің бәріміздің көктегі Әкеміз бірдей ғой! Бәрімізді де бір Құдай жаратқан жоқ па?! Ендеше неліктен біз бір-бірімізге опасыздық жасап, Жаратқан Иенің ата-бабаларымызбен жасаған Келісімін бұзамыз?"},
	{11, "11 Яһуда халқы опасыздық жасады. Исраил мен Иерусалимнің ер адамдары жексұрын іс істеді! Олар бөгде тәңірге табынатын әйелдерге үйленіп, Жаратқан Ие сүйген киелі орынды арамдады."},
	{12, "12 Мұны істеген не соны жақтаған әрбір адам тіпті Әлемнің Иесіне арнап сый-тарту әкелетін болса да, Жаратқан Ие оны Исраилдің елді мекендерінен аластатсын!"},
	{13, "13 Сендер тағы мынаны да істейсіңдер: Жаратқан Иенің құрбандық үстеліне көз жастарыңды төгіп, қынжылып жылайсыңдар. Себебі Ол сендердің құрбандықтарыңа көңіл бөліп, оларды сендерден ризалықпен қабылдаудан бас тартады."},
	{14, "14 Ал сендер: Неге? деп сұрайсыңдар. Өйткені сендер жастай үйленген әйелдеріңе адал болмай, өмірлік жар боламын деп берген серттеріңнен тайдыңдар. Бірақ сендердің әйелдеріңмен жасаған келісімдеріңе Жаратқан Иенің Өзі куә болған еді."},
	{15, "15 Құдай ерлі-зайыптыны біртұтас болуға жаратпады ма? Олар жан-тәндерімен Оның меншігі. Құдай сендерден нені қалайды? Ол құдайшыл ұрпақтардың өсіп-өрбуін қалайды. Сонымен әрқайсың жан дүниелеріңді таза сақтап жүріңдер! Ешқайсың жастай некелескен әйелдеріңе опасыздық жасамаңдар!"},
	{16, "16 Себебі Мен ерлі-зайыптының ажырасқанын жек көремін! — деп жариялайды Исраилдің Құдайы Жаратқан Ие. — Сол ісі оның әйелін зорлықпен бүркеп тастағанымен бірдей болады. Сондықтан (әйелдеріңе) опасыздық жасамау үшін жан дүниелеріңе қырағы болыңдар! — деп ескертеді Әлемнің Иесі."},
	{17, "17 Сендер айтқан сөздеріңмен Жаратқан Иеге ауыртпалық түсірдіңдер. Бірақ та Біз Оған қалайша ауыртпалық түсірдік? деп сұрайсыңдар. Сендер: Зұлымдық жасайтындарды Жаратқан Ие жақсы көріп, оларға риза болады екен! дейсіңдер де, Әділдікті қорғайтын Құдай қайда? деп сұрайсыңдар."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Біліп алыңдар, Мен алдымнан хабаршымды жіберемін, ол жүретін жолымды дайындап қояды. Сендер іздеп жүрген Жасаған Ие кенеттен Өзінің ғибадатханасына келеді. Сендер аңсап жүрген Келісімнің Хабаршысы еш шүбәсіз келетін болады, — деп ескертеді Әлемнің Иесі."},
	{2, "2 Бірақ Оның келетін сол күніне кім төзе алады? Ол келіп, ашық көрінген күні кім берік тұра алатын болады? Себебі Ол күмісті балқытып тазалайтын зергердің оты әрі мата ағартушының сілтісі сияқты әрекет етпек."},
	{3, "3 Сонда Ол күмісті балқытып, қоқысынан айырып тазартатын зергер іспетті леуіліктерді алтын-күмістей тазартып, зұлымдық атаулыдан арылтады. Содан кейін олар қайтадан Жаратқан Иеге арнап таза сый-тартулар ұсына алады."},
	{4, "4 Осылайша Яһуда мен Иерусалимнің халқы әкелген сый-тартулар баяғы күндер мен ежелгі жылдардағыдай Жаратқан Иеге ұнамды болады."},
	{5, "5 Сондықтан Мен сендерді тергеп соттау үшін жақындап келемін. Мен сиқыршыларға, неке адалдығын бұзушы мен ант бұзушыларға, жұмыскерлердің ақысын жеп, жетім-жесірлерге зорлық-зомбылық жасап, жат жұрттықтарды құқықтарынан айырғандарға қарсы куәлік келтіріп, әшкерелеуге ынтызармын, — деп нық айтады Әлемнің Иесі."},
	{6, "6 — Мен, Жаратқан Ие, еш өзгермеймін, (Келісіміме адал болып қаламын). Сондықтан да сендер, уа, Жақыптың ұрпақтары, құрып кеткен жоқсыңдар."},
	{7, "7 Сонау ата-бабаларыңның заманынан-ақ сендер Менің ережелерімнен жалтарып, оларды ұстанбай келесіңдер. Енді кері бұрылып, Маған қайтып келіңдер. Сонда Мен де сендерге қайтып келемін, — деп уәде етеді Әлемнің Иесі. Бірақ сендер: Біз қалайша қайта аламыз? деп сұрайсыңдар."},
	{8, "8 Әлде адамның Құдайдан ұрлауына бола ма? Алайда сендер Менен ұрлайсыңдар! Сенен қалайша ұрлайды екенбіз? деп сұрасаңдар, жауабым мынау: Өнімнің он бөлігінің бірін және өзге де тиесілі сый-тартуларды бермеулерің арқылы!"},
	{9, "9 Сендердің барлығың, бүкіл халқың да қарғысқа ұшырадыңдар! Себебі сендер Менен ұрлап жатырсыңдар!"},
	{10, "10 Киелі үйімде әрдайым тамақ болуы үшін қоймама өнімнің он бөлігінің бірін толықтай алып келіңдер! Менің не істейтінімді осы арқылы сынап көріңдер! — деп ұсынады Әлемнің Иесі. — Сонда Менің аспаннан мол жауын-шашын жаудырып, сендерді жарылқауымның ағыл-тегіл болатыны соншама, оның бәрін жайғастыратын орындарыңның да болмай қалғанын көресіңдер!"},
	{11, "11 Егістіктеріңдегі егінді ешбір пәлекет құртпайды, жүзімдіктеріңнің жемістері де жерге түсіп қалмайды, — деп уәде етеді Әлемнің Иесі. —"},
	{12, "12 Сонда барлық ұлттар сендерді Жарылқанған халық! деп атайтын болады, себебі сендер тамаша ел боласыңдар. — Әлемнің Иесі осыны нық айтады."},
	{13, "13 — Сендер Мен туралы ауыр сөз айттыңдар! — дейді Жаратқан Ие. — Біз Саған қарсы қандай ауыр сөз айттық? деп сұрасаңдар, міне, жауап:"},
	{14, "14 Сендер былай дедіңдер: Құдайға қызмет ету құр бекершілік! Әлемнің Иесінің талаптарын орындап, Оның алдында қасірет шеккен адамдар сияқты болып жүргенімізден бізге не пайда болды?"},
	{15, "15 Қайта, бұдан былай өркөкіректерді жарылқанған деп есептейміз. Расында зұлымдықпен шұғылданушылар табысқа кенеліп, Құдайды еркінсіп сынап келгендер аман-есен жүр ғой! дейсіңдер."},
	{16, "16 Содан соң Жаратқан Иені терең қастерлеушілер өзара сөйлесіп, Жаратқан Ие оларды ден қойып тыңдады. Сонда бұлар туралы Оның алдындағы естелік кітапқа жазылды. Сол кітапқа Жаратқан Иені терең қастерлеп, Оның есімін құрметтейтіндер тіркелген."},
	{17, "17 Мен сот жүргізетін күні олар Менің өз халқым әрі ерекше құнды меншігім болады, — деп уәде етеді Әлемнің Иесі. — Әке өзінің адал қызмет етіп келген ұлына мейірім көрсететініндей, Мен де оларға мейірім көрсетемін!"},
	{18, "18 Сол кезде сендер әділдер мен зұлымдардың, Құдайға қызмет ететіндер мен қызмет етпейтіндердің арасындағы айырмашылықты қайтадан көретін боласыңдар."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 — Сот күні еш шүбәсіз келе жатыр! Ол лаулап жанған пешке ұқсамақ. Сол кезде барлық өркөкіректер мен зұлымдық жасаушылар сабан іспетті болады. Осы келе жатқан күн оларды өртеп жібереді! — деп нық айтады Әлемнің Иесі. — Олардың бірде-бір тамырын да, бұтағын да қалдырмайды!"},
	{2, "2 Бірақ Менің есімімді терең қастерлейтін сендерге ақталу сыйлайтын күн шығады, оның сәулесінің аясында жандарың сауығады. Сонда сендер қорадан шығып, секіріп ойнайтын торпақтардай азат жүресіңдер."},
	{3, "3 Сол кезде зұлымдарды таптап тастайсыңдар. Мен осының бәрін іске асырған күні олар табандарыңның астындағы күл сияқты болады, — дейді Әлемнің Иесі."},
	{4, "4 Хориб тауында өз қызметшім Мұса арқылы бүкіл Исраилге тапсырған Таурат заңындағы ережелер мен шешімдерімді естеріңде сақтаңдар!"},
	{5, "5 Біліп қойыңдар, Жаратқан Иенің ұлы да қорқынышты соты күні келмес бұрын Мен сендерге Ілияс пайғамбарды жіберемін."},
	{6, "6 Ол әкелерді балаларымен, балаларды әкелерімен шын жүректен татуластыратын болады. Ал егер олар мойынсұнбаса, Мен келіп, бүкіл елді қарғап, қиратамын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};