#include <map>
#include <string>
class Bible60
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Иса Мәсіхтің елшісі Петірден (осы күнәкар дүниеде) жат жерлік болып, Понти, Ғалатия, Қападоқия, Азия және Бітүния аймақтарында шашыраған (сенушілерге дұғай сәлем)."},
	{2, "2 Құдай Әке сендерді алдын ала танып, Өзінің Киелі Рухымен Иса Мәсіхке мойынсұнатын, Оның құрбандық өлімінде төгілген қаны арқылы тазарған, меншікті де қасиетті халқы болуға таңдап алған еді. Рақым, амандық және тыныштық сендерге молынан жауа берсін!"},
	{3, "3 Иеміз Иса Мәсіхтің Әкесі — Құдай мадақталсын! Ол бізге зор мейірім көрсетіп, рухани қайта туғызып жаңа өмір сыйлады және Иса Мәсіхті өлімнен қайта тірілтуімен бізді тірі үмітке кенелтті."},
	{4, "4 Сондықтан да Құдайдың өз халқына сақтаған мол игілігін иемденуімізді күтеміз. Ешқашан шіріп бұзылмайтын, өшіп-солып қалмайтын сол мұраларың сендер үшін көкте дайын тұр."},
	{5, "5 Құдай Өзіне сенуші сендерді құдіретті күшімен қорғап, заманның ақырында осы күнәкар дүниеден құтқаратын болады, сол кез жеткенде бұл айқын көрінбек."},
	{6, "6 Қазір сендерге біраз уақыт азап шегіп, қуғын-сүргін көруге тура келгенмен, осы сөнбес үмітке қуаныңдар!"},
	{7, "7 Азап шегулеріңнің мақсаты — шын жүректен сенгендеріңді дәлелдеу. Жойылып кетуі мүмкін алтын отта балқытылған кезде сыналып, тазартылады. Сол сияқты, алтыннан әлдеқайда бағалы сенімдерің де бастан кешкен азаптарың арқылы сыналып, берік те шынайы екендігі дәлелденеді. Сонда Иса Мәсіхтің қайта оралып, ашық көрінетін күні Құдай сендерді мадақтап, даңқ пен құрметке бөлемек."},
	{8, "8 Мәсіхті өз көздеріңмен көрмеген болсаңдар да, Оны сүйесіңдер. Қазір де көре алмағанмен, Оған сенесіңдер. Сондықтан сендер сөзбен суреттеуге болмайтын ұлы да керемет қуанышпен шаттанып тұрсыңдар."},
	{9, "9 Ақыр соңында сенімдеріңнің нәтижесін: жандарыңның толықтай құтқарылуын қабылдамақсыңдар."},
	{10, "10 Құдайдың сендерге беретін рақымы туралы алдын ала айтқан пайғамбарлар кезінде осы құтқарылу жайында мұқият ізденіп, зерттейтін."},
	{11, "11 Оларға дарыған Мәсіхтің Киелі Рухы Оның төзуге тиісті азаптары және бұған жалғасатын салтанатты ұлылығы жөнінде алдын ала хабарлағанда, пайғамбарлар бұл оқиғалардың қалай және қай уақытта болатынын білуге тырысты."},
	{12, "12 Бірақ оларға осы пайғамбарлық қызметтерін өздері үшін емес, сендер үшін атқарғандықтары білдірілді. Ал қазіргі заманда уағыздаушылар Мәсіх туралы Ізгі хабарды көктен жіберілген Киелі Рухтың жетелеуімен сендерге әкелді. Осы тамаша хабарға тіпті періштелер де қызығып, түсінуге ұмтылады."},
	{13, "13 Сонымен, ақыл-ойларыңды іс-әрекетке дайын ұстауға бел буыңдар! Сергек болып, Иса Мәсіх салтанатпен қайтып келгенде көрсететін рақымға толығынан үміт артыңдар!"},
	{14, "14 Құдайдың рухани балалары ретінде Оған мойынсұныңдар. Бұрын Оның шынайы хабарын білмей, өмірлерің жаман істерге жетелейтін құмарлықтардың билігінде болып келді. Бұған енді жол бермеңдер!"},
	{15, "15 Қайта, өздеріңді шақырған Құдайдың қасиетті болғаны сияқты, сендер де бүкіл іс-әрекеттеріңде Оған бағышталған қасиетті болыңдар!"},
	{16, "16 Тауратта Оның былай дегені бар ғой: Мен киелімін, сондықтан сендер де Өзіме бағышталып киелі болыңдар!"},
	{17, "17 Сендер әр адамды бет-жүзіне қарамай әділ соттайтын Құдайға Әкем деп сиынасыңдар. Ендеше жер бетінде жат жерлік болып сүретін өмірлеріңді Оны терең қастерлеп, Оған ұнамайтынды істеуден шошынып өткізіңдер!"},
	{18, "18 Ата-бабаларыңнан жеткен пайдасыз өмір салтынан азат болуларың үшін не төленгенін білесіңдер: күміс, алтын сияқты өткінші заттар емес,"},
	{19, "19 Құдайдың мінсіз де мүлтіксіз Тоқтысы — Мәсіхтің Өзі құрбан болып, баға жетпес қанын төгуімен құтқарылуларыңның құнын төледі."},
	{20, "20 Құдай әлемді жаратпастан бұрын-ақ Мәсіхті бұл мақсатқа таңдап белгілеп еді, ал заманның аяғында Оны сендер үшін ашық көрсетті."},
	{21, "21 Сендер Мәсіх арқылы Құдайға сендіңдер; Ол Мәсіхті өлімнен қайта тірілтіп, ұлылыққа кенелткен еді. Сол себепті сенімдерің мен үміттерің Құдайға бағышталып келеді."},
	{22, "22 Шынайы хабарға мойынсұнып, күнәдан тазарған сендер бауырластарыңа деген нағыз сүйіспеншілікке кенелдіңдер. Енді бір-біріңді үздіксіз, шын жүректен сүйіңдер!"},
	{23, "23 Рухани қайта туылып, жаңа өмірге иесіңдер ғой. Бұл шіріп кететін табиғи тұқым арқылы жүзеге асқан жоқ. Қайта, сендер ешқашан құрымайтын рухани тұқым — Құдайдың өмір беретін мәңгілік сөзін қабылдағанда, қайта туылып жаңа өмірге ие болдыңдар."},
	{24, "24 Күллі пенде атаулы көк шөп секілді! Бар салтанаты дала гүлдеріндей өткінші: Шөптер сарғайып қурап, гүлдер солады,"},
	{25, "25 Ал Жаратқанның сөзі мәңгілік қалады! Сендерге уағыздалған Ізгі хабар — Құдайдың осы мәңгілік сөзі."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Сондықтан барлық жамандық атаулыдан арылып, бұдан былай алдамшы, екі жүзді, күншіл немесе басқаны қаралаушы болмаңдар!"},
	{2, "2 Жаңа туған сәбидің сүтке шөліркегеніндей, әрдайым Құдай сөзінің таза сүтіне құштар болыңдар. Содан нәр алғанда рухани өсіп, күнәнің құлдығынан толығырақ құтқарыла аласыңдар."},
	{3, "3 Себебі Иеміздің қандай ізгі екенін өздерің біліп алдыңдар."},
	{4, "4 Иеміз Мәсіх — адамдар менсінбей бас тартқан, бірақ Құдай бағалы деп таңдаған тірі Тас іспетті. Оған келген"},
	{5, "5 сендер де рухани үйге (яғни қауымға) қаланған тірі тастар сияқтысыңдар. Сендер Иса Мәсіхке бола Құдайға ұнамды рухани сый-тартулар ұсынып, Оған бағышталған қасиетті қызмет атқарудасыңдар."},
	{6, "6 Себебі Киелі жазбада Құдайдың мына сөзі де бар: Міне, Мен аса құнды Тасты таңдап алдым, Оны Сиондағы үйімнің бұрышының Іргетасы ретінде орнатып қоямын. Енді Оған сенімін артқан әркім Ұятқа қалмайтын болады әрдайым."},
	{7, "7 Сенетін сендер үшін осы Тас (Иса Мәсіх) ерекше қымбат. Ал сенбейтіндерге байланысты мынадай сөздер жазылған: Құрылысшылар менсінбеген Тас енді үйдің басты іргетасына айналды! Ол адамдарды сүріндіретін кедергі тас, құлататын жартас сияқты."},
	{8, "8 Олар Мәсіх туралы хабарға мойынсұнбағандықтан сүрініп, құлап, теріс жолға түсіп кетеді. Олардың ақырының осылай болатыны алдын ала белгілі еді."},
	{9, "9 Ал сендер өздеріңді қара түнектен тамаша нұрына шақырған Құдайдың қасиеттілігі мен ұлы істерін мадақтап жариялауға таңдалған нәсілсіңдер. Патшаның діни қызметкерлері, Оған бағышталған қасиетті ұлт — Құдайдың меншікті халқы болдыңдар!"},
	{10, "10 Бір кезде біртұтас халық емес едіңдер, ал қазір Құдайдың халқысыңдар. Бір кезде Оның қайырымдылығын білмеген едіңдер, ал қазір қайырымына бөлендіңдер."},
	{11, "11 Сүйікті бауырластарым, (осы күнәкар дүниеде) жат жерлік адамсыңдар, сондықтан сендерге ескертемін: өз жандарыңа ұдайы қарсы шығатын арам құмарлықтардан бас тартыңдар!"},
	{12, "12 Құдайға мойынсұнбайтын халықтар арасында адал өмір сүріңдер! Олар сендерді жамандық жасаушылар деп айыптайды. Алайда Құдай бізді құтқаруға келген күні олар өз көздерімен көріп жүрген игі істеріңе бола Оны мадақтайтын болады."},
	{13, "13 Сонымен, сендер Жаратқан Иенің меншігі болғандықтан, Ол тағайындаған әрбір билік иесіне мойынсұныңдар! Елдің басшысы ретінде патшасына бой ұсыныңдар,"},
	{14, "14 патшаның жамандық жасағандарды жазалап, жақсылық істегендерді мақтауға бекітіп жіберген әкімдеріне де бағыныңдар!"},
	{15, "15 Құдай сендердің игілік істеулерің арқылы ақымақ адамдардың (сенушілер туралы) надан әңгімелерін тойтаруларыңды қалайды."},
	{16, "16 Рухани азатсыңдар, соған сай өмір сүріңдер! Дегенмен осы азаттықты жамандық жасауға сылтау ретінде пайдаланбаңдар! Қайта, Құдайдың адал қызметшілері болып өмір кешіңдер!"},
	{17, "17 Әркімге лайықты құрмет көрсетіңдер: сенімі бір бауырластарыңды сүйіңдер; Құдайды терең қастерлеп, Оған ұнамайтынды істеуден шошыныңдар; патшаны қадірлеңдер!"},
	{18, "18 Сендер, басыбайлы қызметшілер, қожайындарыңа мойынсұныңдар; тек мейірімді де ақпейіл болғандарға ғана емес, сондай-ақ, өздеріңді жәбірлеп жүргендерге де толық құрмет көрсетіңдер!"},
	{19, "19 Кейбіреулерің әділетсіз қиналғанда, Құдайдың еркінің солай екенін білгендіктен азапқа төзе берсеңдер, Ол соған риза."},
	{20, "20 Бірақ егер жасаған жамандықтарыңа лайықты соққыға шыдасаңдар, оның несі мақтарлық? Ал жақсылық жасай тұра азап шегіп, соған шыдасаңдар, бұл Құдайға ұнайды."},
	{21, "21 Ол сендерді сол үшін де шақырды. Мәсіхтің Өзі бізге бола азап шегіп, үлгі қалдырды, сондықтан Оның ізімен жүруіміз керек."},
	{22, "22 Ол ешқандай күнә жасаған да емес, аузынан бірде-бір өтірік шыққан да емес."},
	{23, "23 Мәсіх Өзіне тіл тигізгендерге жаман сөз қайырмады, азап көрген кезде де оларды қорқытпады. Қайта, Ол ісін әділ Соттаушыға тапсырды."},
	{24, "24 Біз күнәнің құлдығынан босатылып, әділ өмір сүре алуымыз үшін Мәсіх айқыш ағашта күнәларымыздың айыбын өз денесінде көтеріп тұрды. Осылай Оның жаралары арқылы (рухани дертімізден) сауықтық."},
	{25, "25 Өз бетімен жүріп, адасып кеткен қой сияқты едіңдер, ал қазір өздеріңді бағып жетелеп, жандарыңды қорғап жүретін Бағушыларыңа қайта оралдыңдар."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Сол сияқты сендер, әйелдер, күйеулеріңе мойынсұныңдар. Осылайша, олардың кейбіреулері Құдайдың сөзіне құлақ аспаса да, өздеріңнің айтқан сөздеріңмен емес, игілікті мінез-құлықтарыңмен оларды баурап алып, Мәсіхтің иелігіне айналдырыңдар."},
	{2, "2 Олар таза да ізетті мінез-құлықтарыңды көргенде ғана бұлай болмақ."},
	{3, "3 Сендердің көріктерің сыртқы әшекейлерге: шашты ерекшелеп жинау, алтын әшекей бұйымдар тағып, көз тартарлық әдемі киімдер киюге тәуелді болмасын."},
	{4, "4 Қайта, көріктерің жүректеріңдегі көзге көрінбес ізгі қасиеттеріңнен тұрсын; мейірімді де сабырлы жан дүниелеріңнің мәңгі солмайтын көркі Құдай алдында аса бағалы."},
	{5, "5 Ежелгі заманда үміттерін Құдайға артып, Оған бағышталған әйелдер өздерін дәл осылайша әшекейлеген."},
	{6, "6 Солардың бірі Сара еді; ол Ыбырайымның айтқандарына құлақ асып, оны қожайыным деп атайтын. Егер сендер ешқандай қорқынышқа көнбей, адал өмір сүрсеңдер, Сараның рухани ұрпағы боласыңдар."},
	{7, "7 Сол секілді сендер, күйеулер, әйелдеріңе ілтипат пен қамқорлық көрсетіп бірге өмір кешіңдер! Жан-тәндерінің нәзік екенін түсіне отыра, оларды ерекше қастерлей біліңдер. Себебі Құдай рақым етіп сыйлаған мәңгілік өмірді сендермен бірге олар да иемденеді. Тәңір Иеге сиынған кездеріңде ештеңе кедергі болмас үшін де осылай істеңдер!"},
	{8, "8 Қорыта айтқанда, бәрің де өзара ниеттес, қуаныш пен қайғыға ортақтас, бір-біріңді туған бауырлардай сүйетін, қайырымды да кішіпейіл болыңдар."},
	{9, "9 Жамандыққа жамандықпен, қорлыққа қорлықпен емес, ақ батамен жауап беріңдер. Себебі Құдай сендерді шақырғанда Өзінің ақ батасына ие болсын деп мақсат еткен еді."},
	{10, "10 Забурда мынадай сөздер жазылған ғой: Өмірді ұнатып, жақсы күндерді көруді қалағандар ауыздарынан жаман сөз шығармасын, өтірік айтудан да әрқашан сақтансын!"},
	{11, "11 Жамандықтан бас тартып, жақсылықты жасасын, татулыққа ұмтылып, сол үшін лайым күш салсын!"},
	{12, "12 Себебі Жаратқан Ие әділдерге назар аударады, Өзіне жалынған оларға құлақ салады. Ал сұмдық жасайтындарға Жаратқан Ие қарсы шығады."},
	{13, "13 Егер жақсылық жасауға ынталы болсаңдар, кім сендерге нұқсан келтірмек?"},
	{14, "14 Тіпті әділдік үшін азап шегетін болсаңдар да, соларың арқылы жарылқанасыңдар. Өздеріңді қорқытқандардан не қорықпаңдар, не қысылмаңдар!"},
	{15, "15 Қайта, жүректеріңнен Мәсіхке қасиетті Иеміз деп ерекше орын беріңдер! Сендер ұстанған үмітті түсіндіруді сұраған кез келген адамға жауап беруге әрдайым даяр болыңдар. Тек ілтипат, құрмет танытып сөйлеңдер."},
	{16, "16 Ар-ұждандарыңды таза ұстаңдар, сонда Мәсіх жолындағы сендердің ізгі жүріс-тұрыстарың туралы жаман айтып айыптағандар өздерінің айтқандарынан ұялатын болсын."},
	{17, "17 Егерде жақсылық жасай тұра, азап шегулерің Құдайдың еркі болса, бұл жамандық жасап, азап шеккеннен әлдеқайда жақсы."},
	{18, "18 Мәсіх те әділ бола тұра, әділетсіздер үшін азап шекті. Ол бізді Құдаймен табыстыру үшін күнәларымызға бола біржола құрбан болды. Сонда Мәсіх тәнінде өлтірілді, ал рухани денемен қайта тірілді."},
	{19, "19 Осы рухани денесімен Мәсіх о дүниеге де барды. Ол сол жерде, өлген адамдардың жандары қамалған орында, оларға Өзінің жеңісін жариялады."},
	{20, "20 Бұдан көп бұрын, Нұх пайғамбар кемесін жасап жатқан кезде, Құдай теріс жолдан қайтуларын сабырлықпен күткен еді. Бірақ олар Тәңір Иеге мойынсұнған жоқ. Тек азғана — сегіз-ақ кісі кемеге кіріп, топан судан құтқарылды."},
	{21, "21 Бұл жайт қазіргі замандағы суға шомылдыру рәсімінің алдын ала берілген белгісі болды. Осы рәсім денеміздегі кірді жуып тазартуды емес, Құдайдан таза ар-ұждан сыйлауын өтінуді білдіреді. Осылай ол сендерді Иса Мәсіхтің өліп, қайта тірілуі арқылы күнәнің құлдығынан құтқарады."},
	{22, "22 Ал Мәсіх көкке көтеріліп, Құдайдың оң жағындағы құрметті орнына жайғасты. Періштелер, рухани билеушілер және күш атаулылар Оған бағынышты."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Сонымен, Мәсіхтің Өзі тәнімен азап шеккендіктен, сендер де (жақсылық үшін азап шегуге дайын) болыңдар! Осындай ой-ниет өздеріңді қорғайтын қалқан іспетті. Тәні азап шегіп жатқан сенуші күнәлі құмарлықтарына берілмейді."},
	{2, "2 Бұдан былай осы дүниедегі өміріңнің қалған кезеңін ескі күнәкар болмыстарыңның құмарлықтарына сай емес, Құдайдың еркіне мойынсұнып өткізулерің керек."},
	{3, "3 Өткен кезде сендер ұзақ уақыттарыңды Оған мойынсұнбайтындарға ұнайтынды жасап өткіздіңдер: өмірлерің жүгенсіздік, нәпсіқұмарлық, маскүнемдік, ырду-дырду ойын-сауықтар, мас жын-ойнақтармен және Құдайға жек көрінішті жалған тәңірлерге құлшылық етумен өтіп келді."},
	{4, "4 Бұрынғы серіктерің өздерінің иіріп, тартып әкететін азғын өмір салттарына енді батпағандықтарыңа таңғалып, налып, сендерді жамандайды."},
	{5, "5 Қиямет сотында олар тірілер мен өлілерге үкім шығаруға дайын тұрған Иемізге есеп бермек."},
	{6, "6 Ізгі хабардың кейін өлген сенушілерге де уағыздалғандығының себебі мынау: Тәңір Ие адамзатқа күнәкарлығы үшін ажалды етіп үкім шығарғандықтан, сол сенушілердің де тәндері өлді. Бірақ жандары Құдайдың еркі бойынша мәңгі тірі болмақ."},
	{7, "7 Күллі дүние атаулының ақыры таяп келеді. Сондықтан сиынып дұға ете алу үшін байсалды да салауатты болыңдар!"},
	{8, "8 Ең бастысы, бір-біріңді шынайы сүйіңдер, сондай сүйіспеншілік адамдардың көптеген күнәларын кешіреді."},
	{9, "9 Ешбір наразылықсыз өзара қонақжай болыңдар."},
	{10, "10 Тәңір Ие рақым етіп сыйлаған алуан түрлі рухани дарындарыңды жақсылап қолданыңдар. Әрқайсыларың қабылдаған дарындарыңмен бір-біріңе адал қызмет етіңдер:"},
	{11, "11 уағыз айтатындарың Құдай сөзін уағыздай беріңдер; қызмет көрсететіндерің Тәңір Иенің өздеріңе берген күш-қуатымен қызмет ете беріңдер! Осылайша барлық істе де Құдай Иса Мәсіх арқылы мадақталсын. Ұлылық, даңқ және билік мәңгі Онікі! Аумин."},
	{12, "12 Қымбатты бауырластарым, өздеріңнің от кешіп ауыр азап шегіп, сыналғандарыңды оғаш нәрсе деп ойламаңдар."},
	{13, "13 Қайта, неғұрлым көбірек Мәсіх секілді азап шексеңдер, соғұрлым көбірек қуаныңдар. Сонда Мәсіх салтанатты ұлылықпен қайта оралып, ашық көрінген кезде де шаттанып қуанатын боласыңдар."},
	{14, "14 Мәсіхтің атына бола қорлық көрсеңдер, бақыттысыңдар, себебі ұлылыққа бөлейтін Құдайдың Рухы сендерге орнығады."},
	{15, "15 Алайда егер қайсыбіреулерің азап шексеңдер, бұл, әрине, кісі өлтіріп, ұрлық не өзге қылмыс жасаудың немесе басқаның шаруасына қол сұғудың зардабы болмауға тиіс!"},
	{16, "16 Ал мәсіхші болғандарыңа бола жәбірленсеңдер, одан ұялмаңдар, керісінше, Мәсіхтің атымен аталғандарың үшін Құдайды мадақтаңдар."},
	{17, "17 Осылай Тәңір Иенің ең алдымен өз халқын соттай бастайтын уақыты келді. Ал сот бізден басталса, онда Құдайдың Ізгі хабарына бағынбайтындардың ақыры қандай болмақ!"},
	{18, "18 Әділ жанның өзі зорға құтқарылғанда, арамза, күнәлі адаммен не болмақ?!"},
	{19, "19 Сонымен, Құдайдың еркі бойынша азап шегіп жүрген сендер, жандарыңды әрдайым уәдесін орындайтын Жаратушыға сеніп тапсырыңдар, әрі игі істер жасай беріңдер!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Араларыңдағы қауым жетекшілері! Мен өзім де сендермен қызметтес қауым жетекшісімін, Мәсіхтің шеккен азаптарының куәсімін. Ол қайта оралғанда ашық көрінетін салтанатты ұлылығын бөлісетін де боламын. Сендерге ескертетінім мынау:"},
	{2, "2 Құдайдың өздеріңе сеніп тапсырған рухани отарын (яғни қауымын) қамқорлап бағыңдар! Мұны лажсыздан емес, шын көңілден, Құдайдың еркіне сай орындаңдар. Оны ашкөз пайдақорлықпен де емес, адал ынта-жігермен істеңдер."},
	{3, "3 Тәңір Иенің меншікті қауымдарына өктемдік жүргізбеңдер, қайта, рухани отарға үлгі-өнеге болыңдар!"},
	{4, "4 Осылай істесеңдер, Бас Бағушымыз (Мәсіх) қайтып келіп, анық көрінгенде, ешқашан солмайтын салтанат тәжін жүлде ретінде Оның қолынан аласыңдар."},
	{5, "5 Сол сияқты, сендер де, жастар, жетекшілерге мойынсұныңдар! Бәрің де арақатынастарыңда әрдайым кішіпейілділік танытыңдар! Себебі Құдай тәкаппарларға қарсылық жасайды, ал кішіпейілдерге рақымын сыйлайды."},
	{6, "6 Сонымен, Құдайдың құдіретті қолының астына бой ұсыныңдар; Өзі белгілеген уақыты жеткенде Ол сендерді жоғарылатпақ."},
	{7, "7 Барлық уайымдарыңды Құдайға сеніп тапсырыңдар, себебі Ол қамдарыңды ойлайды!"},
	{8, "8 Салауатты да сергек болыңдар! Сендердің қас жауларың, шайтан, ақырған арыстандай қауымды айнала шарлап, кімді жалмасам деп торуылдап жүр."},
	{9, "9 Сенімдеріңе берік болып, оған төтеп беріңдер! Дүниенің төрт бұрышындағы құрбы қауымдастарыңның да дәл сондай азаптарды шегуге мәжбүр екенін білесіңдер ғой."},
	{10, "10 Ал барлық рақымның бастауы, Құдай, біразырақ уақыт азап шегіп жатқан сендерді қайтадан жетілдіріп, нығайтып, қуатты да табанды етпек. Себебі Ол Мәсіх Иса арқылы сендерді Өзінің салтанатты ұлылығын мәңгі бөлісуге шақырды."},
	{11, "11 Оның билігі мәңгілік бола берсін! Аумин."},
	{12, "12 Мен бұл қысқа сәлемхатымды адал бауырласымыз деп сенетін Сыйласқа жаздырдым. Сендерді жігерлендіріп, Құдайдың шынайы рақымы осы айтқандарымдай екеніне куәлік етіп сендіргім келеді. Бұл рақымды қабылдай беріңдер!"},
	{13, "13 Құдай сендерді таңдағаны сияқты, Бабылда бірге таңдап алған сенушілер қауымы, сондай-ақ менің рухани ұлым Марқа да сендерге сәлем жолдауда."},
	{14, "14 Сүйіспеншіліктеріңді білдіріп, бір-біріңмен амандасып, сәлемімізді жеткізіңдер. Мәсіх Иса Өзімен тығыз байланыстағы сендердің бәріңе амандық пен тыныштық сыйлай берсін! (Аумин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};