#include <map>
#include <string>
class Bible50
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Філіпі қаласында тұратын, Иса Мәсіхпен тығыз байланыстағы қауым басқарушылары мен қызметшілеріне қоса Құдайдың барлық адамдарына Иса Мәсіхтің қызметшілері Пауыл мен Тімотеден дұғай сәлем:"},
	{2, "2 сендерге Құдай Әкеміз бен Иеміз Иса Мәсіх рақымын жаудырып, тыныштық сыйлай көрсін!"},
	{3, "3 Сендерді еске алған сайын Құдайға ризашылық білдіріп,"},
	{4, "4 бәрің үшін әрдайым қуана-қуана тілек тілеп сиынудамын."},
	{5, "5 Себебі сендерге Ізгі хабар жеткен алғашқы күннен бастап оны таратуға бізбен ортақтасып келе жатырсыңдар."},
	{6, "6 Өмірлеріңде игі ісін бастаған Құдайдың оны жалғастыра беріп, Мәсіх қайта оралар күнге дейін толықтай аяқтайтынына кәміл сенемін."},
	{7, "7 Барлығың туралы осындай жақсы пікірде болуым дұрыс, себебі менің жүрегімнен берік орын алдыңдар. Қазір мен тұтқында отырғанда да, Ізгі хабардың шындығын қорғап, нығайтқанда да Құдайдың маған мейірімділікпен тапсырған қызметіне ортақтасып келесіңдер."},
	{8, "8 Бәріңді Иса Мәсіх дарытқан сүйіспеншілікпен сағынып жүргеніме Құдай куә."},
	{9, "9 Мен Оған сиынып, былай деп тілеп отырмын: сендердің сүйіспеншіліктеріңмен қатар жан-жақты рухани білімдерің мен көрегендіктерің бұдан да арта берсін."},
	{10, "10 Соның нәтижесінде әр жағдайда ненің ізгілікті екенін ажырата білсеңдер екен деймін. Осылай сендер Мәсіх қайта оралар күні мінсіз пәк болып,"},
	{11, "11 Иса Мәсіхтің көмегімен молынан әділ іс-әрекеттер жасап келген боласыңдар. Содан Құдайдың ұлылығы көрініп, мадақталмақ."},
	{12, "12 Бауырластарым, мен басымдағы жағдайымның Ізгі хабарды бөгемей, керісінше, оның кең таралуына үлес қосып жатқанын сендерге білдіргім келеді."},
	{13, "13 Патшаның бүкіл күзетші жасағына және мұндағы барлық басқаларға да менің Мәсіхке қызмет еткенім үшін бұғауда отырғаным мәлім болды."},
	{14, "14 Сонымен қатар, тұтқындалуым бауырластардың басым көпшілігінің Иемізге деген сенімдерін нығайта түсті. Олар Құдай сөзін бұрынғыдан бетер қорықпай уағыздауға батылданды."},
	{15, "15 Рас, кейбіреулері Мәсіхті қызғаныш пен күншілдіктен, ал басқалары ақниеттен уағыздап жүр."},
	{16, "16 Бірқатарлары Мәсіхті ақпейілден емес, өз абырой-атақтары үшін уағыздайды: олар бұғаудағы маған одан да көп қасірет тартқызбақшы."},
	{17, "17 Ал өзгелері Құдайдың мені Ізгі хабарды қорғауға тағайындағанын ұғып, оны сүйіспеншілікпен таратуда."},
	{18, "18 Бірақ мұнда тұрған не бар? Мейлі, жалған не адал ниетпен, болсын, әйтеуір Мәсіх уағыздалса болғаны, мен соған қуанамын. Оған бұдан былай да қуанамын."},
	{19, "19 Өйткені сендер сиынып, Иса Мәсіхтің Киелі Рухы көмек көрсеткендіктен, осы жағдайымның мен үшін жақсылықпен аяқталатынын білемін."},
	{20, "20 Себебі мен ешбір ұятқа қалмайтыныма, қайта, батылдыққа кенеліп тірі жүремін бе, не өлемін бе, әрдайым болғандай, қазір де өз бойымда Иса Мәсіхтің дәріптелетініне үміт артып, соған нық сенемін."},
	{21, "21 Себебі Мәсіх — менің өмірім, ал өлім мен үшін ұтыспен тең."},
	{22, "22 Егер тәнім сау болса, өнімді еңбек ете аламын. Енді нені таңдауды білмей,"},
	{23, "23 екеуіне де құштармын: бұ дүниеден кетіп, Мәсіхпен бірге болғым келеді, бұл бәрінен де анағұрлым жақсы,"},
	{24, "24 ал тәнімнің аман қалғаны сендер үшін қажеттірек."},
	{25, "25 Бұған көзім жеткендіктен менің тірі жүріп, қастарыңда болатынымды білемін. Сонда сенімдерің арта түсіп, қуанышқа кенелесіңдер."},
	{26, "26 Сендерге тағы да келгенімде мені құтқарғаны үшін Иса Мәсіхке ұлан-ғайыр мақтау айтатын боласыңдар."},
	{27, "27 Қандай жағдай болмасын, тек Мәсіх жайлы Ізгі хабарға сай өмір сүріңдер! Мен келіп, сендерді көремін бе, я болмаса алыста жүремін бе, бәрібір — сендер туралы бірдей ниетпен табанды тұрады, Ізгі хабарға деген сенімдері үшін бір кісідей жұмылып, жан аямай күреседі,"},
	{28, "28 қарсыластарынан еш қорықпайды дегенді естігім келеді. Сендердің тайсалмас жігерлерің қарсыластарыңның мәңгі жойылып кететінін, ал өздеріңнің құтқарылатындарыңды алдын ала білдіреді. Мұны іске асырушы — Құдай."},
	{29, "29 Ол сендерге рақым етіп, Мәсіхке сенуді ғана емес, Ол үшін азап шегуді де белгіледі."},
	{30, "30 Осылайша сендер бұрын менен көріп, қазір де айналысып жатқанымды естіген рухани күреске өздерің де араласудасыңдар."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Мәсіхпен байланыстарың сендерді жігерлендіріп, Оның сүйіспеншілігі көңілдеріңді жұбатқандықтан және өздерің Киелі Рухпен қатынаста жүріп, қайырымды да жанашыр болғандықтан,"},
	{2, "2 пікірлес, бір-біріңді тең сүйетін, ынтымақтас әрі ниеттес болыңдар. Осылай мені қуанышқа кенелтсеңдер екен."},
	{3, "3 Жеке басының абырой-атағын ойлайтын менмен емес, кішіпейіл болып, басқаларды өздеріңнен жоғары қойыңдар!"},
	{4, "4 Әрқайсың өз мүдделеріңді ғана емес, басқалардікін де ойлап жүріңдер!"},
	{5, "5 Иса Мәсіхтің мінез-құлқы сендердікі де болсын:"},
	{6, "6 Мәсіхтің құдайлық болмысы бола тұра, Ол Онысына жармасқан жоқ,"},
	{7, "7 қайта, Өз құдіреті мен салтанатты ұлылығынан Бас тартып, қабылдады құлдың сиқын: Ол адам секілді бұ дүниеге келді, Әрі кәдімгі адамға ұқсап көрінді."},
	{8, "8 Өзін төмен тұтып, Құдайға мойынсұнды, Өлімге, тіпті айқыштағы өлімге бойсұнды."},
	{9, "9 Сондықтан да Құдай Оны көкке көтерді, Оның мәртебесін бәрінен де биіктетті, Оған бар есімнен жоғары Атақты сыйлап берді:"},
	{10, "10 Енді естігенде Исаның Атағын Көктегі, жердегі, жер астындағылардың Бәрі де тізе бүкпек Оның алдында"},
	{11, "11 Және Иса Мәсіхті тіл атаулы барлығы да Жаратқан Ие деп ашық мойындауға Тиіс һәм Құдай Әкенің даңқын арттыруға."},
	{12, "12 Сонымен, сүйікті бауырларым, сендермен бірге болғанымда әрдайым Құдайға мойынсұндыңдар, ал қазір мен қастарыңда жоқ кезде де солай істей берулерің әлдеқайда маңыздырақ болмақ: құтқарылуларыңа сай іс-әрекет жасап, соны толығымен жүзеге асыруға ұмтылыңдар, әрі Құдайды терең қастерлеп, Оған ұнамайтын нәрселерден қатты жиіркеніңдер!"},
	{13, "13 Себебі Өзіне ұнайтын істерді қалап, жүзеге асыруларыңа түрткі болушы — Құдай."},
	{14, "14 Бәрін де наразылықсыз, шүбәланбай істеңдер!"},
	{15, "15 Осылай қазіргі азғын да алдамшы ұрпақтың арасында еш кінәсіз таза, Құдайдың мінсіз рухани балалары болыңдар: қараңғы дүниеде жарық жұлдыздай жарқырап,"},
	{16, "16 адамдарға шынайы өмірді жеткізетін Құдай сөзін ұсыныңдар. Сонда мен араларыңда жан сала істеп жүрген еңбегімнің босқа кетпегеніне Мәсіхтің қайта оралған күні риза болып, қатты қуанатын боламын."},
	{17, "17 Сендердің Құдайға сеніп, өмірлеріңді бағыштауларың Оған арналған құрбандық іспетті. Ал мен, мүмкін, шейіт болып, қаным сол құрбандықтың үстіне төгілетін де шығар. Сонда мен қуанып, осы қуанышымды бәріңмен бөліспекпін."},
	{18, "18 Сол сияқты, сендер де қуанып, бірге шаттаныңдар!"},
	{19, "19 Иеміз Иса қаласа, жақын арада сендерге Тімотені жіберетін ойым бар. Осылайша сендер жігерленіп, оның сендерден алып келетін хабары маған да жігер берер деп сенемін."},
	{20, "20 Ол сияқты менімен ниеттес, шын көңілден қамдарыңды ойлайтын басқа адамым жоқ."},
	{21, "21 Өзгелердің бәрі Иса Мәсіхтің ісін емес, өз қара бастарының қамын ойлайды."},
	{22, "22 Ал Тімотенің сенімді екенін өздерің білесіңдер: ол маған Ізгі хабарды уағыздауда ұлының әкесіне көмектесетініндей қолғабыс етіп келеді."},
	{23, "23 Сот ісімнің немен аяқталатынын біле сала, оны сендерге жібермекпін."},
	{24, "24 Иеміз маған жақын арада өзім де сендерге барамын деген сенім сыйлады."},
	{25, "25 Қызметтес әрі күрестес серігім — сендер маған қамқор болсын деп жіберген бауырымыз Епафродитті шұғыл түрде өздеріңе қайтаруды қажет деп таптым."},
	{26, "26 Ол өзінің ауырып қалғаны туралы сендерге хабар жеткенін қатты уайымдап, өздеріңді көруге құштар болып жүр."},
	{27, "27 Шынында да ол қатты ауырып, хал үстінде жатты. Бірақ Құдай оған рақымшылық жасады, оған ғана емес, қасіретке қасірет қоспау үшін маған да рақым көрсетті."},
	{28, "28 Сондықтан Епафродитті жібермек болып, одан бетер асығып отырмын. Оны көріп қуанған сендерді ойлап мен де қайғырмайтын боламын."},
	{29, "29 Епафродитті Иемізбен жүрген бауырларың ретінде қуана қарсы алыңдар. Мұндайларды жалпы құрметтеңдер."},
	{30, "30 Себебі ол Мәсіхтің ісі үшін өлімге таяп келді. Маған сендер бере алмаған көмекті ол өз басын өлімге тіге отыра көрсетті."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Ал енді, бауырластарым, Иемізге шаттанып қуаныңдар! Мұны қайталап жаза беру мен үшін әуре емес, ал сендерді ол нығайтады."},
	{2, "2 Қауымды иттей шарлап, қауып жүрген зұлым қызметкерлерден, сүндеттеуді күнәдан ақталу жолы ретінде уағыздаушылардан сақтаныңдар!"},
	{3, "3 Біз — Құдайдың рухани сүндеттелген халқымыз! Құдайға Киелі Рухының көмегімен қызмет етіп, Мәсіх Исаны мақтан етеміз, әрі өз болмысымызға сүйенбейміз."},
	{4, "4 Ал менің өзіме сүйенуге себептерім жеткілікті болар еді ғой. Егер біреу өзіне сенерлік дәлелім бар десе, менікі онікінен де артық:"},
	{5, "5 туғаннан кейін сегізінші күні сүндеттелдім. Исраил халқының Бунямин руына жататын, таза еврей тұқымынан шыққан евреймін. Тәлімім бойынша Тауратты қатаң ұстанатын парызшыл болып,"},
	{6, "6 Мәсіхке сенушілердің қауымын бар ынтаммен қудалайтынмын. Осылайша Таурат заңына сай әділеттілігім мінсіз еді."},
	{7, "7 Алайда осы артықшылықтарымды Мәсіхке бола залал деп санай бастадым."},
	{8, "8 Иә, мен бәрін де залал деп санаймын, өйткені Ием Иса Мәсіхті жақыннан танып білу өзге нәрселерден әлдеқайда жоғары. Иеме бола бұлардың бәрінен айырылдым, оларды түкке тұрғысыз сыпырынды деп санаймын да. Осылайша қабылдайтын сыйым — Мәсіхтің Өзі."},
	{9, "9 Онымен тығыз байланыста тұруым үшін Таурат заңын орындауға негізделген жеке басымның ақталуына сүйенбеймін, қайта, Мәсіхке деген сенім арқылы Құдайдан ақталған адам болғым келеді."},
	{10, "10 Сөйтіп, Мәсіхтің Өзін де, Оны қайта тірілткен құдіретті де жақыннан танып білуге құштармын. Мәсіхтің азаптарына ортақтасып, Оның өз жанын Мен үшін өлімге қиғанындай, мен де Ол үшін өмірімді қиғым келеді."},
	{11, "11 Осылайша, қайтсе де, өлімнен қайта тірілуге қол жеткіземін."},
	{12, "12 Бұған әлі жете қойған жоқпын, өзімді Құдайдың көздегеніндей жетілдім деп те есептемеймін. Бірақ соның ізіне түсіп, иемденуге тырысудамын. Дәл осыған бола Мәсіх Исаның Өзі мені иемденіп алды ғой."},
	{13, "13 Бауырластарым, мен бұл мақсатқа жеттім деп санамаймын. Істеп жүргенім бір-ақ нәрсе: өткен нәрселерді ескермей, алдымдағы бәйгеге қарай жан сала жүгіріп келемін."},
	{14, "14 Құдайдың сыйына — Оның Мәсіх Иса арқылы шақырған көктегі өміріне ие болу үшін көздеген мақсатты қуып жүрмін."},
	{15, "15 Арамызда кім жетілген болса, осылай ойласын. Егер бір нәрсе жайында басқа пікірде болсаңдар, Құдай сендерге мұны да білдіреді."},
	{16, "16 Тек қол жеткізген түсінігімізге сай ойлап, өмір сүруге тиіспіз."},
	{17, "17 Қымбатты бауырластар, менің өмірімді үлгі етіңдер, әрі біздің өнегемізге сай жүргендерге назар аударыңдар!"},
	{18, "18 Себебі сендерге бұрын да айтқанмын, қазір де көз жасымды төгіп айтып отырмын: көп адамдар Мәсіхтің айқыштағы құрбандығына қас болып жүр."},
	{19, "19 Бұлардың ақыры — тозаққа түсу, құдайлары — өз құлқыны, ал мақтаныштары — ұятсыз әдеттері. Олар осы күнәлі дүниенің нәрселерін ғана ойлайды."},
	{20, "20 Алайда біздің отанымыз көкте, содан Құтқарушымызды — Иеміз Иса Мәсіхті сағына күтеміз."},
	{21, "21 Ол әлемдегі күллі нәрселерді де жеңіп бағындыру үшін қолданатын құдіретті күшімен біздің өткінші тәнімізді Өзінікі сияқты салтанатты денеге айналдырады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Сонымен, сүйікті бауырластарым, Иемізбен байланыста берік тұрыңдар! Сендерді жақсы көремін, сағынып та жүрмін. Менің қуанышым, бәйгелік тәжім сендерсіңдер ғой."},
	{2, "2 Еуодия мен Сүнтүхе екеуін де Иемізбен жүргендер ретінде өзара татуласуға шақырамын."},
	{3, "3 Иә, адал серігім, сенен де сұраймын: осы екі әйелге көмек көрсетші. Олар Ізгі хабарды таратудағы күресіме ортақтасып, Кілемент пен өзге қызметтестеріммен де бірге істесті. Солардың есімдері көктегі Мәңгілік өмір кітабына жазылып қойылған."},
	{4, "4 Әрдайым Иемізбен байланыстарыңа қуаныңдар! Тағы да айтамын: қуаныңдар!"},
	{5, "5 Сендердің кішіпейіл екендеріңді елдің бәрі көре алсын. Иеміз қастарыңда ғой."},
	{6, "6 Еш нәрсені уайымдамай, барлық жағдайда өтініштеріңді Құдайға сиынып тілекпен және шүкірлікпен білдіріңдер!"},
	{7, "7 Сонда Құдайдың адам ақылынан асқан керемет тыныштығы сендердің жүректерің мен ой-саналарыңды Мәсіх Исада сақтайды."},
	{8, "8 Сонымен, бауырластарым, күллі шынайы да қастерлі, әділ де таза, ұнамды да тартымды нәрселер, яғни қандай да адамгершілік және мақтауға тұрарлық қасиет болмасын, солар туралы ойлана беріңдер!"},
	{9, "9 Менен үйреніп, қабылдаған тәлімді әрі өмірімнен көріп, естігендеріңді іске асыра беріңдер! Сонда тыныштықтың қайнар көзі — Құдай сендерге жар болады."},
	{10, "10 Сендердің тағы да қамымды ойлай бастағандарыңа Иемізге шүкірлік етіп қатты қуанамын. Әрине, мені бұл жағынан естен шығарған жоқсыңдар, алайда оған жағдайларың мүмкіндік бермеген еді."},
	{11, "11 Мұны бір нәрсе қажет болғандықтан айтып тұрған жоқпын. Мен қандай жағдай болмасын, қолдағы барды қанағат етуді үйрендім."},
	{12, "12 Жоқшылықта да, молшылықта да өмір сүре аламын. Мен не тоя тамақ жейін, не аш жүрейін, молшылықта немесе мұқтаждықта болайын, қай жағдайда да қанағат етудің құпиясымен жақсы танысып алдым."},
	{13, "13 Себебі маған күш-қуат беретін Мәсіхпен бірге болсам, бәріне де төзе аламын."},
	{14, "14 Дегенмен, қиын-қыстау жағдайыма ортақтасқандарың бір ғанибет болды."},
	{15, "15 Қымбатты філіпіліктер, өздерің де білесіңдер: мен алғаш рет Ізгі хабарды сендерге жеткізіп, содан кейін Македония өлкесінен кеткенімде, маған басқа бір қауым емес, сендер ғана игіліктер жіберіп, Құдайдың жарылқауын қабылдауда ортақтастыңдар."},
	{16, "16 Әлі Салониқада жүргенімде де сендер маған бірнеше рет қажетімді жеткізіп тұрдыңдар."},
	{17, "17 Сендерден сәлем-сауқат дәметпеймін, менің үміттенетінім — осылар үшін өздеріңе қайтатын жарылқау мен сауап."},
	{18, "18 Сендер жібергендердің бәрін де алдым, енді артығымен жетіп жатыр. Епафродит сәлемдемелеріңді әкеліп бергелі қажетті нәрселерім ағыл-тегіл. Олар — Құдай ұнатып қабылдайтын хош иісті тартулар мен құрбандық іспетті."},
	{19, "19 Ал Иса Мәсіхпен жүрген сендердің барлық қажеттеріңді де менің Құдайым Өзінің керемет байлығы бойынша қамтамасыз ететін болады."},
	{20, "20 Құдай Әкеміздің ұлылығы мәңгілік мадақтала берсін! Аумин."},
	{21, "21 Мәсіх Исаның арқасында Құдайдікі болғандардың бәріне сәлемімізді жеткізіңдер. Қасымыздағы бауырластар да сәлем айтуда."},
	{22, "22 Сендерге Құдайдың мұндағы адамдары түгелдей, әсіресе патша сарайындағылар, сәлем айтады!"},
	{23, "23 Лайым жан дүниелерің Иеміз Иса Мәсіхтің рақымына кенеле берсін! Аумин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};