#include <map>
#include <string>
class Bible22
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
	struct kk7	{ int val; const char *msg; };
	struct kk8	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Сүлейменнің таңдаулы әні."},
	{2, "2 Иісмайыңның жұпары аңқып кетті, Атың шашылған иіссудай әйгілі, Сондықтан да қыздар өзіңе тәнті."},
	{3, "3 Ала кетші мені өзіңмен бірге, Жылдам жүгірейік екеуіміз, кәне! Патшам мені кіргізді өз бөлмелеріне. (Қалыңдықтың құрбылары:) Саған шаттанып өзіңді жырлаймыз, Махаббатыңды шараптан көп мақтаймыз. (Қалыңдық:) Өзіңді ұнатқандарына осылардың, Уа, жаным, сен әбден лайықтысың!"},
	{4, "4 Өңім қара торы, әйтсе де сұлумын, Уа, қыздары Иерусалим қаласының. Қидардағы шатырлардай қара торымын, Сүлейменнің қара перделеріне ұқсаймын."},
	{5, "5 Қарамаңдаршы маған тесірейе, Бетімді күйдірді күн сәулелері. Ағаларым маған ашуланған еді, Баққызып қойды содан жүзімдіктерді, Сөйтіп күте алмадым өз жүзімдігімді."},
	{6, "6 Айтшы маған, уа, сүйіктім, қай жерде Бағып жүресің сенің отарыңды? Әрі сен қайда барып, түскі кезде Тынықтырып аласың қойларыңды? Мен несіне қаңғырамын бет-перде Жамылған жүгенсіздей, достарыңның Отарлары арасынан сені іздеуге? (Құрбылары:)"},
	{7, "7 Ең сұлу ару, сен мұны білмеймісің? Ұсақ малдың соқпақтарымен жүр сонда, Жайып бақ лақтарыңды өзіңнің Шопан қостарының маңдарында."},
	{8, "8 Жаным, сені ұқсатам сайгүлікке Жегілген перғауынның күймесіне."},
	{9, "9 Екі бетің көрікті сырғаларыңмен, Мойның да әп-әдемі алқаларыңмен!"},
	{10, "10 Өзіңе арнап күміспен көмкерілген Алтын сырғалар соқтырып беремін мен."},
	{11, "11 Патшам дастарқан басына жайғасты, Иісмайымның жұпары сол тұста жайылды."},
	{12, "12 Сүйіктім хош иісті мүр шайырындай, Кеудемде аңқып тұрған қалташықтай,"},
	{13, "13 Ен-Геди жүзімдігінің қынагүл шоғындай."},
	{14, "14 Уа, жаным, керемет қой сұлулығың, Көгершіндей қос жанарың, сондай сұлусың! (Қалыңдық:)"},
	{15, "15 Қандай көріктісің, сүйгенім, сүйкімдісің! Көк шалғын болады төсегіміз біздің. (Күйеу жігіт:)"},
	{16, "16 Самырсын бұтақтары шаңырағымыздай, Жұпар шыршалар уықтарымыздай."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 (Қалыңдық:) Шарон жазығындағы райхандаймын, Аңғардың лалагүліне ұқсаймын. (Күйеу жігіт:)"},
	{2, "2 Рас, салыстырсам басқалармен, жалғызым, Тікенектер арасындағы лаладайсың."},
	{3, "3 Ғашығым жас жігіттер арасында Алма ағашындай орман арасында! Саясында оның отыра берсем екен, Жемісі тәтті, ләззат табамын мен."},
	{4, "4 Тойханаға алып барды ол мені, Бәріне айқын өзімді сүйетіні."},
	{5, "5 Ғашықтықтан әлсізбін, мейіз беріңдерші, Алма да жегізіп күшейтіңдерші!"},
	{6, "6 Сол қолы басымның астында болсын, Оң қолымен мені құшақтап алсын!"},
	{7, "7 Иерусалим қыздары, сендерге жалынамын, Елік пен бұғының аттарын атаймын: Махаббатты қоздырып оятпаңдар, жетілсін Өзіне ұнаған дәл мезгіліне дейін!"},
	{8, "8 Сүйіктімнің даусы бұл, ол келе жатыр, Таудан асып екпіндеп келе жатыр!"},
	{9, "9 Ол ұқсайды елік пен жас бұғыға, Жетіп те қалды үйдің арт жағына, Әне, ол терезеден қарайды да."},
	{10, "10 Тіл қатып маған былай деді сүйіктім: Тұршы, жаным, бірге жүрші, сүйкімдім!"},
	{11, "11 Қарашы, қыстың кезі өтіп кетті, Жаңбыр жауған сол бір күндер өтті."},
	{12, "12 Айнала гүлдер қаулап өсіп кеткен, Құстардың әндетер кезі де келген, Кептер гуілі естіледі әр жерден."},
	{13, "13 Інжірдің алғашқы жемісі пісуде, Жүзім де гүл шашып, хош иіс беруде, Орныңнан тұршы енді, қарашығым, Далаға шығайық, уа, ғашық жарым!"},
	{14, "14 Көгершінім, жартастың жарығында Жасырынған, шыңдардың арасында, Көрсетсеңші маған сұлу жүзіңді, Естиін мен сондай тәтті үніңді!"},
	{15, "15 Ұстаңдаршы сол кішкентай түлкілерді, Олар бүлдіреді ғой жүзімдіктерді, Жүзімдігіміз гүлдеп тұр себебі."},
	{16, "16 Сүйіктім менікі, ал мен онікімін, Ол жайылып жүр арасында лалагүлдің."},
	{17, "17 Таң атып, көлеңке жоғалып кеткенше, Жас бұғыдай тау сайларында секірші, Сүйіктім, еліктей кері қайтып келші!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 (Қалыңдық:) Түні бойы мен төсек-орнымнан Ғашығымды тосып, таба алмағам."},
	{2, "2 Кәне, мен тұрып, аралайын Қаланың көше, алаңдарын! Бірақ таба алмадым сандалғанмен, Көп іздеп бекер жүрдім мен."},
	{3, "3 Қарауылдар маған тап болды, Аралап жүрді олар қаланы. Көрдіңіздер ме жан досымды? Деп сұрап іздедім сүйген жарымды."},
	{4, "4 Мезгілде қастарынан сәл-ақ өткен Кездестірдім жарымды жаным сүйген! Оны ұстап алып жібермедім, Анашымның үйіне алып келдім, Өз шешемнің бөлмесіне кіргіздім."},
	{5, "5 Иерусалим қыздары, сендерге жалынамын, Елік пен бұғының аттарын атаймын: Махаббатты қоздырып оятпаңдар, жетілсін Өзіне ұнаған дәл мезгіліне дейін! (Құрбылары:)"},
	{6, "6 Даладан өрлеп келе жатқан бұл кім екен, Түтін бағанындай, мүрдей жұпар затпенен, Саудагердің алуан дәмдеуіш ұнтақтарымен?"},
	{7, "7 Мұнда қара, өз күймесінде Сүлеймен Келе жатыр алпыс мықты жігітімен, Исраилдің таңдаулы ерлерімен!"},
	{8, "8 Семсері белінде асынған бәрінің, Шайқаста көрсеткен өз ерліктерін, Бұл жігіттер түнгі қауіп-қатерге дайын."},
	{9, "9 Құнды ағашынан Ливан тау-төбесінің Жасатыпты Сүлеймен патша өз күймесін,"},
	{10, "10 Оның бағандарын күміспен жалатқан, Һәм оның негізін алтыннан жасатқан, Отырғышын қырмызы матамен қаптатқан. Күйменің ішін Иерусалимнің қыздары Бар ықыласпен безендіріп дайындады. (Қалыңдық:)"},
	{11, "11 Уа, сиондық қыздар, шығыңдар, кәне, Қараңдар Сүлеймен патшаның тәжіне: Оған анасы кигізген тәжіне Оның неке қиған осы күнінде, Жүрегі шаттыққа кенелген кезінде!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 (Күйеу жігіт:) Неткен сұлу едің, сүйіктім менің! Қандай көріктісің, қымбаттым, өзің! Бет пердеңнің артындағы бота көзің Тартымды-ау көзіндей көгершіннің! Ғилақад тау беткейімен түсіп келген Ешкі отарындай шашың төгілген."},
	{2, "2 Тістерің отарындай саулықтардың, Жаңа қырқып, таза жуып шығарған, Кемістік табылмас араларынан, Бәрі де бір-біріне дәл қиысқан."},
	{3, "3 Ал қызыл жіп секілді еріндерің, Қандай сұлу еді ауызың сенің! Бет пердеңмен жабылған самайларың Қос бөлігі іспетті қызғылт анардың."},
	{4, "4 Мойның сенің сымбатты Дәуіт патшаның Сәулетті салынған мұнарасындай, соның Қабырғалары әсем әшекейленген Дәуіттің мың батырының қалқандарымен."},
	{5, "5 Лалагүлдер арасында жайылып жүрген Егіз елікке қос анарың ұқсас екен."},
	{6, "6 Таң атып, көлеңке қысқара түскенше, Мүр шайыры бар тауға көтерілейінші, Жұпар шайыр төбесінде жүрейінші!"},
	{7, "7 Қымбаттым, сен тұтастай әдемісің, Жоқ тұла бойыңда ешқандай мінің!"},
	{8, "8 Ливан тауынан менімен бірге келгін, Амана шыңынан, қалыңдығым менің, Заңғар бастарынан Хермон, Сенірдің, Арыстан тыншып жатқан үңгірлерінен, Барыс білдіртпей жүрген төбелерінен."},
	{9, "9 Жүрегімді тартып алдың, қарындасым, Бір-ақ көзқарасыңмен, уа, қалыңдығым, Бір ғана асыл тасымен алқаңның!"},
	{10, "10 Қандай тәтті сенің махаббатың, Уа, қымбаттым, сүйген қалыңдығым! Ол шараптан әлдеқайда артық екен, Хош иісің сенің артық дәмдеуіштен."},
	{11, "11 Қалыңдығым, балдай тәтті еріндерің, Бал мен сүттей тәтті асты тіліңнің! Хош иісі киімдеріңнің сенің Жұпарындай Ливандағы самырсынның."},
	{12, "12 Уа, қымбаттым, сен жабық бақшадайсың, Қалыңдығым, қоршалған бұлақтайсың, Мөрленіп бекітілген қайнардайсың."},
	{13, "13 Жемісі тәтті анар бақшасындай Өз өскіндерің, һәм нард пен қынадай."},
	{14, "14 Нард пен запыран, шайыр мен дәмқабықтың, Хош иісті таңдаулы ағаштардың, Мүр мен алоэдей дәмдеуіштердің Жұпары аңқып тұр бақшаңнан сенің."},
	{15, "15 Бау-бақшадағы қайнарға ұқсайсың, Ливан тауынан ағып жатқан судайсың."},
	{16, "16 Көтерілші, самал желім, солтүстіктен, Сондай-ақ, жылы желім, оңтүстіктен, Өзімнің бақшама соғып келсеңші, Жұпарларын оның тарата берсеңші! Сүйген жарым өз бақшасына келсін, Тәтті жемістерінен таңдап жесін!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 (Күйеу:) Міне, мен өз бақшама кіріп алдым, Уа, қымбаттым, менің сүйген жарым! Мүрім мен дәмдеуішімді жинап алдым, Сондай тәтті балымнан ішіп тұрмын, Шарап пен сүтімнің дәмін татып тұрмын. (Құрбылар:) Уа, достарымыз, кәне, ішіп-жеңдер, Уа, ғашықтар, тоя іше беріңдер!"},
	{2, "2 Ұйықтап жатып, жүрегім сергек еді. Тыңда, сүйіктім қағып тұр есігімді: Ашсаңшы есікті, қымбаттым менің, Сүйген жарым, кемелді көгершінім! — Деді ол маған, — шықтан су болды басым, Түннің ылғалынан бұйра шашым!"},
	{3, "3 Шешініп ем, қалай тағы киінем? Аяғымды жудым, қалай кірлетем?"},
	{4, "4 Есік тесігінен қол сұқты сүйіктім, Қатты толқып кетті менің жүрегім."},
	{5, "5 Есікті оған ашуға тұрдым содан, Хош иісті мүр тамды қолдарымнан, Құлып ысырмасына саусақтарымнан."},
	{6, "6 Есікті ашсам, сүйіктім жоқ екен, Кері бұрылып, кетіп қалған екен! Кеткеніне жүрегім лүпіл қаққан, Іздеп шықсам да, таппадым еш жақтан! Шақырсам да, жауап бермеді маған."},
	{7, "7 Қарауылдар қаланы аралап жүрді, Ұстап алып мені, ұра берді. Күзетшілер қамал үстіндегі Жұлып тастады менің бет пердемді."},
	{8, "8 Өтінем, жалынышымды тыңдаңдаршы, Оу, Иерусалим қаласының қыздары: Егер де көрсеңдер сүйген жарымды, Ғашықтықтан талықсыды деп айтыңдаршы!"},
	{9, "9 Бұлай деп бізге өтінетініңдей сен, Сүйіктің қай жағынан артық өзгеден? Әйелдердің ең сұлуы, соны айтсаң екен! (Жас келін:)"},
	{10, "10 Сүйіктімнің беті нұрлы, албыраған, Ол айрықша он мың адам арасынан."},
	{11, "11 Басы оның саф алтындай, шашы бұйра, Қарға, құзғынға ұқсап қап-қара."},
	{12, "12 Жанарлары бұлақ жағасындағы Көгершіндер сияқты жылтырайды, Оның тістері сүтке шомылған Асыл тастардай, көмкеріле қойылған."},
	{13, "13 Екі беті оның аңқып жатқан Жұпар иісті шөптер өсіп тұрған Бақшадағы жүйектерге тұр ұқсап. Еріндері сұйық мүр тамшылап Жатқан лалагүлдерге тұр ұқсап."},
	{14, "14 Білектері оның алтыннан жасалған, Асыл тастармен жиек салынған Жұмыр сойылдарға ұқсап жаратылған. Денесі тегіс піл сүйегіне ұқсайды, Сапфир тастар тәрізді жалтырайды."},
	{15, "15 Аяқтары саф алтын негізге Орнатылған мәрмәр баған секілді. Тұлғасы оның Ливан тауындай, Таңдаулы самырсын ағаштарындай,"},
	{16, "16 Әрі оның ауызы сондай тәтті, Иә, оның өзі түгелдей сымбатты! Осыған ұқсайды сүйіктім, досым менің, Уа, қала қыздары Иерусалимнің!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 (Құрбылар:) Уа, ең сұлуы бар әйелдердің, Қай жаққа кетті сүйіктің сенің? Оны өзіңмен бірге іздейік, Ол қайда кеткен, соны білейік?! (Жас келін:)"},
	{2, "2 Сүйгенім түсті бақшасына өзінің, Жүйектеріне жұпар шөптерінің, Бау-бақшада серуендеп жүру үшін, Жинамаққа өскен лалагүлдерін."},
	{3, "3 Мен өз сүйіктімдікімін лайым, Ал сүйіктім де менікі әрдайым, Серуендеп жүр арасында лалагүлдің."},
	{4, "4 Сүйгенім, сен Тирсадай әдемісің, Иерусалим де іспетті көріктісің, Ту көтерген әскердей сес көрсетесің."},
	{5, "5 Менен бұрып әкетші көздеріңді, Толқытып жібереді олар мені. Ғилақад тау беткейімен түсіп келген Ешкі отарындай шашың төгілген."},
	{6, "6 Тоғытылған қой іспетті тістерің, Жалғыз емес, сыңары бар бәрінің."},
	{7, "7 Бет пердеңмен жабылған самайларың Қос бөлігі іспетті қызғылт анардың."},
	{8, "8 Алпыс патшайым, сексен кәнизак болсын, Әрі сансыз көп қыздар да жиналсын,"},
	{9, "9 Ал көгершінім, мінсізім, айрықша өзі, Ол — шешесінің теңдесі жоқ жалғыз қызы, Өзін туған анасының таңдаулысы! Қыздар оны көргенде мадақтады, Патшайымдар, кәнизактар да мақтады. (Құрбылары:)"},
	{10, "10 Бұл кім екен, айдай сұлу, таңдай атқан, Күндей нұрын шашып, ту көтеріп тұрған Әскерге ұқсап сес көрсетіп жатқан?"},
	{11, "11 Жаңғақ ағашының тоғайына бардым, Аңғардың көгорай шалғынын қарадым. Жүзім бұталары бүршік жарды ма, Анар ағаштары гүлдей бастады ма, Соны біліп келуге шықтым далаға."},
	{12, "12 Мен соны аңғармай тұрғанда әлі де Отырдым сүйікті патшамның күймесіне."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct kk7 poems[] = {
	{1, "1 (Құрбылары:) Айналшы, шуламдық, дөңгелеп би биле! Саған қарап тұрайық біздер сүйсіне. (Күйеу:) Неге Маханаим биін билегендер Арасындағы бұл шуламдыққа сендер Сүйсіне қарауды сонша тілейсіңдер?"},
	{2, "2 Сандал киген аяғың қандай ажарлы, Уа, ақсүйек әміршінің қызы! Сенің қос саныңның сұлу пішіні Зергер қалпын жасаған асыл тас секілді."},
	{3, "3 Кіндігің дәмді шарап құйылған тостағандай, Белің лалагүл қоршап үйілген бидайдай."},
	{4, "4 Қос анарың екі елік тәрізді, Киіктің егіз лағы секілді."},
	{5, "5 Уа, сүйіктім, сенің сымбатты мойның Піл сүйегінен жасалған мұнарадай, Қос жанарың Бат-Раббим қақпасының Маңындағы Хешбон тоғандарындай, Һәм мұрның Дамаскіге қарап тұрған Ливан тауының әсем мұнарасындай."},
	{6, "6 Басың Қармил тауындай көтеріңкі, Төгілген шашың сенің сондай көрікті, Бұйраларың патшаны баурап әкетеді!"},
	{7, "7 Қандай сұлусың, қандай сүйкімдісің, Сенен ләззат табам, сүйіктім менің!"},
	{8, "8 Сен құрма ағашындай әдемісің, Қос анарың шоғындай жемістердің."},
	{9, "9 Құрма ағашына өрмелеп шығайын, Жемістері бар сабақтарын ұстайын, Қос анарың болсын жүзім шоқтарындай, Деміңнің иісі алма жұпарындай,"},
	{10, "10 Әрі ауызың таңдаулы шараптай!"},
	{11, "11 Мен өзіме ынтық сүйіктімдікімін."},
	{12, "12 Жүрші, сүйіктім, далаға барайық, Кәне, ауылдарда түнеп шығайық."},
	{13, "13 Ерте тұрып, жүзімдіктерге барайық, Жүзім бұталары бүршік жарды ма, Олардың гүлдері ашылып қойды ма, Анар ағаштары да гүлдеп тұр ма? Соны көру үшін серуендейік бақтарда, Махаббатымды сыйлаймын саған сонда."},
	{14, "14 Махаббат жемісінің жұпары аңқуда. Алуан түрлі керемет тағамдар Біздің есігіміздің қасында бар: Уа, сүйіктім, бұрынғы мен жаңалар, Менен сен үшін сақтап қойылғандар."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct kk8 poems[] = {
	{1, "1 (Жас келін:) Сен анамның ақ төсін еміп өскен Бірге туған бауырым болсаң екен! Кездестіріп далада сонда сені, Өбіп алсам, жұрт сөкпес еді мені."},
	{2, "2 Тәрбиелеп мені өсірген шешемнің Үйіне сені ертіп келер едім, Саған дәмдеуіш қосқан шарабым Мен анар шырынын татқызар едім."},
	{3, "3 Сол қолы оның басымның астында, Оң қолымен мені құшақтасын да!"},
	{4, "4 Иерусалим қыздары, сендерден өтінемін: Махабатты қоздырып оятпаңдар, жетілсін Өзіне ұнаған дәл мезгіліне дейін! (Құрбылары:)"},
	{5, "5 Сүйіктісіне сүйене айдаладан Кім екен мынау өрлеп келе жатқан?"},
	{6, "6 Жүрегіңнің үстіне мені мөрдей тақшы, Мөрлі білезіктей білегіңе салшы! Өйткені махаббат өлімдей қуатты, Құлшынысы оның ажалдай қатты! Ол өз отын найзағайдай шашады, Лапылдап өрт жалынындай жанады."},
	{7, "7 Мол су да махаббатты өшіре алмас, Тасыған өзен оны батыра алмас. Бір адам өз үйінің бар байлығын Ұсынғанмен сүйіспеншілік үшін, Мүлдем менсінбес еді ешкім онысын!"},
	{8, "8 Кенже туған қарындасымыз бар біздің, Әлі де жетілмеген денесі қыздың, Айттырылып қойған күнінде оның Не істерміз игілігіне қарындастың?"},
	{9, "9 Егер берік қабырғадай болса, біз Күмістен оған бекініс саламыз. Ал егер есіктей ашық болса, біз Самырсын тақтаймен жауып тастаймыз. (Жас келін:)"},
	{10, "10 Өзім берік қабырғаға ұқсаймын, Һәм мұнарадай тіп-тік қос анарым. Содан оның көзінде кемелді болдым."},
	{11, "11 Бағал-Хамонда Сүлейменнің жүзімдігі болған, Соны бағуды бағбандарға тапсырған. Әрқайсысы соның жемісі үшін Мың мысқал күмістен төлеп берсін."},
	{12, "12 Менің жүзімдігімді кімге берсем, Мұны мен өзім біліп, өзім шешем. Мың мысқал, уа, Сүлеймен, сіздікі болсын, Ал екі жүз — жемісін өсіргендерге оның. (Күйеу:)"},
	{13, "13 Уа, бау-бақшада отырған жеріңнен Дос қыздарың естіп тұр даусыңды сенің, Енді маған да оны естіртсең екен! (Жас келін:)"},
	{14, "14 Уа, сүйіктім, маған жүгіріп келсең екен, Жұпар иісі аңқыған шөптер мол өскен Тауларда елік, жас бұғыдай секірсең!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};