#include <map>
#include <string>
class Bible38
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
	struct kk7	{ int val; const char *msg; };
	struct kk8	{ int val; const char *msg; };
	struct kk9	{ int val; const char *msg; };
	struct kk10	{ int val; const char *msg; };
	struct kk11	{ int val; const char *msg; };
	struct kk12	{ int val; const char *msg; };
	struct kk13	{ int val; const char *msg; };
	struct kk14	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Дарийдің (парсы патшалығына билік жүргізген) екінші жылының сегізінші айында Жаратқан Ие Барақияхтың ұлы, Иддоның немересі Зәкәрия пайғамбарға сөзін арнап былай деді:"},
	{2, "2 — Мен, Жаратқан Ие, сендердің ата-бабаларыңа қатты ашуланған едім."},
	{3, "3 Сондықтан халыққа былай де: Әлемнің Иесі мынаны айтады: Кері бұрылып, Маған қайтып келіңдер! Сонда Мен де сендерге қайтып келемін, — деп уәде етеді Әлемнің Иесі. —"},
	{4, "4 Ата-бабаларың сияқты болмаңдар! Ежелгі пайғамбарлар оларға былай деп дауыстап ескертетін: Әлемнің Иесі мынаны айтады: Зұлым жолдарыңнан қайтып, сұмдық істеріңді тастаңдар! Алайда ата-бабаларың Маған құлақ салып, тыңдаудан бас тартты, — деп сақтандырады Жаратқан Ие. —"},
	{5, "5 Сол ата-бабаларың қазір қайда екен? Ежелгі пайғамбарлар да мәңгі өмір сүрген жоқ."},
	{6, "6 Алайда Менің Өзіме қызмет етіп жүрген пайғамбарларым арқылы жеткізген сөздерім мен шешімдерім ата-бабаларыңның бастарына түсті ғой! Сонда олар теріс жолдарынан қайтып: Әлемнің Иесі бізге жүрген жолдарымыз бен істеген істерімізге сай істеді. Ол қалай ниеттеніп, алдын ала айтқан болса, солай істеді, — деп мойындады."},
	{7, "7 Персияға Дарий патшалық құрған екінші жылының он бірінші, яғни шебат, айының жиырма төртінші күні Жаратқан Ие Барақияхтың ұлы, Иддоның немересі Зәкәрия пайғамбарға тағы да сөзін арнады. (Бұл туралы Зәкәрия былай деп баяндады:)"},
	{8, "8 Түнде мен жирен атқа мінген бір адамды көрдім. Ол аңғардағы жасыл бұталардың арасында тұр екен. Оның артында жирен, торы және ақбоз аттарға мінгендер болды."},
	{9, "9 Сонда мен: — Мырзам, бұл не екен? — деп сұрадым. Менімен сөйлесіп тұрған періште маған: — Оның не екенін саған көрсетемін, — деді."},
	{10, "10 Сонда жасыл бұталардың арасында тұрған салт атты: — Бұлар Жаратқан Иенің жер бетін шолып келуге жіберген шолғыншылары, — деп жауап берді."},
	{11, "11 Салт аттылар Жаратқан Иенің жасыл бұталардың арасында тұрған періштесіне: Біз күллі жер бетін шолып шықтық. Бүкіл жер беті тыныш та бейқам тұрып жатыр, — деп баяндады."},
	{12, "12 Осыдан кейін Жаратқан Иенің періштесі: Уа, Әлемнің Иесі, осы өткен жетпіс жыл бойы Сен Иерусалимге және Яһуда елінің басқа қалаларына қаһарланып келдің. Қашанға дейін оларға рақымыңды көрсетуден бас тартпақсың? — деп өтінді."},
	{13, "13 Сонда Жаратқан Ие менімен сөйлесіп тұрған періштеге мейірімді де жұбанышты сөздермен жауап қатты."},
	{14, "14 Әлгі періште маған бұрылып, былай деді: — Сен мына хабарды жарияла: Әлемнің Иесі мынаны айтады: Мен Иерусалим қаласын және Сион тауын зор ынтызарлықпен сүйемін."},
	{15, "15 Ал бейқам тұрып жатқан сол елдерге қатты ашулымын. Себебі Мен халқыма едәуір ашуланған кезде олар оған тым көп зорлық-зомбылық жасады. —"},
	{16, "16 Сондықтан Жаратқан Ие мынаны айтады: — Мен Иерусалимге мейірімімді төгу үшін қайтып келе жатырмын. Осы қалада Менің киелі үйім қайтадан салынып, құрылысшылар өлшеуіш жіптерін тартатын болады. — Әлемнің Иесі осыны уәде етеді."},
	{17, "17 Тағы былай деп те жарияла: Әлемнің Иесі мынаны айтады: Менің қалаларым қайтадан ағыл-тегіл дәулетке кенеледі. Мен, Жаратқан Ие, тағы да Сионды жұбатып, Иерусалимді Өзімнің қалам деп таңдап аламын."},
	{18, "18 Мұнан кейін мен жоғары қарағанда, көз алдымда тұрған төрт мүйізді көрдім."},
	{19, "19 Өзіммен сөйлескен періштеден: — Мыналар не? — деп сұрадым. Ол маған: — Бұл мүйіздер Яһуданы, Солтүстік Исраилді және Иерусалимді бытыратып жіберген күшті елдерді білдіреді, — деп түсіндірді."},
	{20, "20 Содан соң Жаратқан Ие маған төрт ұстаны көрсетті."},
	{21, "21 Мен: — Мына ұсталар не істейін деп жатыр? — деп сұрадым. Періште былай деп жауап берді: — Әлгі мүйіз іспетті күшті елдер Яһуда халқын ешкім бас көтере алмайтындай етіп бытыратып жіберген еді. Бірақ мына ұсталар сол елдерді қорқытып, жерге құлатып құрту үшін келді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Мен қайтадан жоғары қарағанда қолында өлшеуіш жібі бар біреуді көрдім."},
	{2, "2 Мен одан: — Қайда бара жатырсыз? — деп сұрадым. Ол: — Иерусалимнің ені мен ұзындығын білу үшін оны өлшеуге бара жатырмын, — деп жауап берді."},
	{3, "3 Менімен сөйлескен періште сол кезде алға қарай беттеді. Сонда басқа бір періште оған қарсы кездесті."},
	{4, "4 Бұл оған былай деді: — Ана жас жігітке тездетіп барып мынаны айт: Иерусалим малы мен адамы көп болғандықтан қамал қабырғасы жоқ, ашық қала сияқты болады!"},
	{5, "5 Мен Өзім әрі қаланың айналасындағы жалындаған отты қабырғасы, әрі оның ішіндегі нұрлы салтанаты іспетті боламын, — деп уәде береді Жаратқан Ие."},
	{6, "6 Уа, халайық, дайындалып, жолға шығыңдар! Солтүстіктегі елден қашып кетіңдер! — деп ескертеді Жаратқан Ие. — Себебі Мен сендерді дүниенің шартарабына шашыратып жіберген едім."},
	{7, "7 Уа, Сионның халқы, Бабыл халқымен бірге тұрып жатқан сендер сол елден қашып кетіңдер!"},
	{8, "8 Себебі бір даңқты кезеңнен кейін Әлемнің Иесі мені өздеріңді тонаған халықтарға жіберіп, мынаны айтты: Кім сендерге тиіссе, соның Менің көзімнің қарашығына тиіскені!"},
	{9, "9 Мен таяуда оларға қарсы қолымды созбақпын. Сонда оларды өз құлдары тонайтын болады. — Сол кезде сендер Әлемнің Иесінің мені жібергенін анық білетін боласыңдар."},
	{10, "10 Қуана ән салып шаттаныңдар, уа, Иерусалимнің халқы! Мен сендердің араларыңда тұруға келе жатырмын! — деп уәде етеді Жаратқан Ие. —"},
	{11, "11 Сол күні көптеген ұлттар Менімен тығыз байланысқа түсіп, Менің халқым болады. Мен сендердің араларыңда тұрамын. — Сол кезде сендер мені өздеріңе жіберген Әлемнің Иесі екенін анық білетін боласыңдар."},
	{12, "12 Жаратқан Ие Яһуданы Өзіне бағышталған қасиетті еліндегі айрықша үлесі ретінде қабылдап, Иерусалимді (өз қаласы болуға) қайтадан таңдап алады."},
	{13, "13 Бүкіл адамзат Жаратқан Иенің алдында тынышталсын! Ол Өзінің киелі тұрағынан шығып, әрекет етіп жатыр."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Бұдан кейін періште маған Жаратқан Иенің періштесінің алдында тұрған бас діни қызметкер Ешуаны көрсетті. Ал шайтан Ешуаны айыптау үшін оның оң жағында тұрды."},
	{2, "2 Жаратқан Ие шайтанға: Саған Жаратқан Ие тыйым салады, шайтан! Иә, Иерусалимді таңдап алған Жаратқан Ие саған тыйым салады! Осы адам жанып кетпей тұрып от ішінен құтқарылып алынған отындық ағаш сияқты емес пе? — деп зекіді."},
	{3, "3 Ешуа періштенің алдында ластанған киіммен тұрды."},
	{4, "4 Ал періште өзінің алдында тұрғандарға: Оның лас киімдерін шешіп тастаңдар! — деп тапсырды. Ешуаға қарап ол: Мен сенің кінәңді алып тастадым. Енді саған салтанатты киім кигіземін, — деді."},
	{5, "5 Сонда мен: Оның басына таза сәлде кигізіңдер, — деп өтіндім. Олар оның басына таза сәлде, үстіне арнайы киімдер кигізді. Осы кезде Жаратқан Иенің періштесі жанымызда тұрды."},
	{6, "6 Одан кейін Жаратқан Иенің періштесі Ешуаға ескертіп былай деді:"},
	{7, "7 — Әлемнің Иесі мынаны айтады: Егер де сен Менің жолыммен жүріп, тапсырмаларымды орындайтын болсаң, онда сен Менің киелі үйіме жетекшілік етіп, оның аулаларын да басқаратын боласың, әрі Менің осында тұратын сенімді қызметшілерімнің арасында жүруіңе болады."},
	{8, "8 Уа, бас діни қызметкер Ешуа және алдыңда отырған серіктестерің, тыңдаңдар! Сендердің барлығың болашақтағы кереметтің бейнесісіңдер. Біліп алыңдар: Мен Өзімнің Өскін деп аталатын Қызметшімді алып келемін."},
	{9, "9 Мен Ешуаның алдына қойған асыл тас, міне, мынау: оның жеті қыры бар. Мен тасқа сөздерімді қашап жазып, осы елдің күнәсін бір-ақ күнде алып тастаймын, — деп уәде етеді Әлемнің Иесі. —"},
	{10, "10 Сол күні сендердің әрбіреуің (көріп жатқан игіліктерімен бөлісу үшін) көршісін өзінің жүзім бұтасы мен інжір ағашының түбінде отыруға шақыратын болады, — деп нық айтады Әлемнің Иесі."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Менімен сөйлескен періште қайтып келіп, мені оятқандай сілкіп қалды."},
	{2, "2 Ол менен: — Не көріп тұрсың? — деп сұрады. Мен жауап беріп былай дедім: — Бір алтын шам қойғышты көріп тұрмын. Оның төбесінде майға арналған тостағаны және жеті май шамы әрі соларға байланған жеті түтікшесі бар."},
	{3, "3 Сондай-ақ, майға арналған тостағанның оң және сол жақтарында тұрған екі зәйтүн ағашын көріп тұрмын."},
	{4, "4 Мен өзіммен сөйлескен періштеден: — Мырзам, бұлар не екен? — деп сұрадым."},
	{5, "5 Ол маған: — Бұлардың не екенін сен білмейтін бе едің? — деген сауал қойды. Мен оған: — Жоқ, білмеймін, мырзам, — дедім."},
	{6, "6 Ол маған былай деп түсіндірді: — Жаратқан Иенің Зоробабелге арнаған сөзі мынау: Күш-қуатпен де емес, билік күшімен де емес, тек Менің Рухыммен ғана табысқа жетесің! — дейді Әлемнің Иесі. —"},
	{7, "7 Мына заңғар тау не өзі? Зоробабелдің алдында заңғар тау іспетті зор қиыншылықтар жазықтай тегіс болады. Зоробабел ғимараттың соңғы тасын орнатқанда халық: Нендей мейірім! Не деген рақым! деп дауыстап мадақтайтын болады."},
	{8, "8 Жаратқан Ие маған тағы да сөзін арнап:"},
	{9, "9 Осы киелі үйдің іргетасын Зоробабелдің өзі қалаған еді, оны бітіретін де өзі болады, — деді. — Осылайша Әлемнің Иесінің мені өздеріңе жібергенін анық білетін боласыңдар."},
	{10, "10 Ұсақ-түйек істер істеліп үлгерілген күнді кім менсінбейді? Болашақта адамдар Зоробабелдің қолына тіктегішін алып, құрылысқа кіріскенін көрген кезде қуанатын болады. Ал әлгі жеті май шамы бүкіл жер бетіне көз салып бәрін де көріп тұратын Жаратқан Иенің көздерін білдіреді."},
	{11, "11 Мұнан кейін мен періштеден: — Шам қойғыштың оң және сол жақтарындағы екі зәйтүн ағашы нені білдіреді? — деп сұрап,"},
	{12, "12 тағы да мына сауалды қойдым: Алтын түсті зәйтүн майын шам қойғышқа қарай ағызатын екі алтын түтікшенің жанында екі зәйтүн бұтағы бар. Олар нені білдіреді? —"},
	{13, "13 Періште менен: — Бұлардың не екендігін сен шынымен білмейсің бе? — деп сұрады. Мен: — Жоқ, білмеймін, мырзам! — деп жауап бердім."},
	{14, "14 Сонда ол маған: — Құдай осы екеуін Өзіне, бүкіл жер бетінің Иесіне, қызмет етуге май жағу рәсімінен өткізіп тағайындап қойған, — деді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Мұнан кейін жоғары қарасам, бір шиыршық кітап ұшып бара жатыр екен."},
	{2, "2 Періште менен: — Не көріп тұрсың? — деп сұрады. — Ұшып бара жатқан бір шиыршық кітапты көріп тұрмын. Оның ұзындығы жиырма шынтақ, ені он шынтақ, — деп жауап бердім."},
	{3, "3 Сонда ол маған түсіндіріп былай деді: — Осы кітапта жазылғаны — бүкіл жер бетіне таралып жатқан қарғыс. Қағаздың бір бетінде әрбір ұры, екінші бетінде әрбір өтірік ант етуші елден міндетті түрде аластатылады деген сөз жазылған."},
	{4, "4 Әлемнің Иесі былай дейді: — Мен осы қарғысты ұрылардың және Менің атымды атап өтірік ант етушілердің үйлеріне жіберемін. Ол солардың үйлерінің ішіне қонып, үйдің тастары мен бөренелерін тып-типыл қылып құртады."},
	{5, "5 Содан кейін менімен сөйлескен періште ілгері қарай шығып, былай деді: — Басыңды көтеріп жоғары қара! Не жақындап келе жатыр? —"},
	{6, "6 Мен: — Бұл не? — деп сұрадым. Періште маған түсіндіріп: — Бұл — үлкен өлшеуіш ыдыс — деді. Ол сөзін жалғастырып: — Ыдыс бүкіл елдің тұрғындарының жасаған қылмыстарының бейнесі, — деп қосты."},
	{7, "7 Сонда ыдыстың қорғасын қақпағын ашып, қарасақ, ішінде бір әйел отыр екен!"},
	{8, "8 Періште: — Бұл — заңсыздықтың бейнесі, — деді де, әйелді ыдыстың ішіне итеріп жіберіп, қорғасын қақпағын тығыздап жауып қойды."},
	{9, "9 Осыдан кейін тағы да қарасам, екі әйел қалықтап ұшып келе жатыр екен. Олардың аққұтанның қанаттарындай қанаттарынан жел есіп тұрды. Олар ыдысты аспан мен жердің арасына, әуеге көтеріп алып кетті."},
	{10, "10 Мен өзіммен сөйлескен періштеден: — Олар ыдысты қайда алып кетті? — деп сұрадым."},
	{11, "11 Ол маған: — Олар оны Бабыл еліндегі Шинар жазығына әкетті. Сол жерде оған ғибадатхана салып береді. Ол салынып, дайын болған кезде ыдысты сондағы арнаулы тұғырына қояды, — деп жауап берді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 Мен қайтадан жоғары қарап, екі таудың арасындағы шатқалдан шығып келе жатқан төрт күймені көрдім. Сол екі тау қола тау екен."},
	{2, "2 Бірінші күймеге жирен, екіншісіне қара,"},
	{3, "3 үшіншісіне ақбоз, төртіншісіне ала аттар жегіліпті. Аттардың бәрі де мықты екен."},
	{4, "4 Сонда мен өзіммен сөйлескен періштеден: — Мыналар не, мырзам? — деп сұрадым."},
	{5, "5 Періште маған: — Бұлар көктің төрт рухын бейнелейді. Осы төрт рух бүкіл жер бетінің Иесінің алдында тұратын нөкерлері. Олар Оның еркін орындауға шығып бара жатыр, — деп түсіндірді. —"},
	{6, "6 Қара аттар жегілген күйме солтүстік жаққа қарай, ақбоз аттар жегілген күйме олардың артынан, ал ала аттар жегілген күйме оңтүстікке қарай бағыт алды."},
	{7, "7 Сол мықты аттар алға шығып, жер бетін шолып қайтуға асыға жұлқынды. Сондықтан ол: Барыңдар, жерді шолып қайтыңдар! — деп бұйырды. Осыны естісімен олар жерді шарлауға аттанды."},
	{8, "8 Сонда Жаратқан Ие маған дауыстап: — Біліп ал, солтүстікке кеткендер сол өлкеге Менің қаһарлы жазамды тартқызып, Рухымды тыныштандырды, — деді."},
	{9, "9 Жаратқан Ие маған тағы да сөзін арнап былай деді:"},
	{10, "10 — Бабылға жер аударылудан қайта оралған Хелдай, Тобиях және Едаях есімді адамдардан алып келген сый-тартуларын қабылдап, сол күні Софония ұлы Жосияның үйіне бар!"},
	{11, "11 Осы күміс пен алтыннан алып, тәж жасатып, оны бас діни қызметкер Ехосадық ұлы Ешуаның басына кигіз."},
	{12, "12 Оған былай де: Әлемнің Иесі мынаны айтады: Мынау — Өскін есімді адам. Ол өз орнынан өсіп-өрбіп, Жаратқан Иенің ғибадатханасын тұрғызатын болады."},
	{13, "13 Иә, Жаратқан Иенің ғибадатханасын тұрғызатын Сол болады! Ол салтанатқа бөленіп, өз тағында отырып билік құрмақ. Ешуа діни қызметкер ретінде патшалық таққа отырған соң, екі лауазымның арасында ынтымақ орнайды."},
	{14, "14 Ал тәж Хелдай, Тобиях, Едаях және Софония ұлы Хеннің қамқорлығына тапсырылып, ғибадатханада естелік белгі ретінде сақталады."},
	{15, "15 Алыста тұратын халықтар келіп, Жаратқан Иенің ғибадатханасын салуға көмектесетін болады. Сонда мені өздеріңе жіберген Әлемнің Иесі екенін анық білетін боласыңдар. Егер Құдай Иелеріңнің айтқандарына бұлжытпай құлақ ассаңдар, осының бәрі жүзеге асады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct kk7 poems[] = {
	{1, "1 Дарий патшалық құрған төртінші жылының тоғызыншы, яғни кислеп, айының төртінші күні Жаратқан Ие Зәкәрия пайғамбарға қайтадан сөзін арнады."},
	{2, "2 Бетелдің тұрғындары Шаресер мен Регем-Мәлікті өз адамдарымен бірге Жаратқан Иенің алдына барып сиынып, Одан рақым етуін өтінуге жіберген еді."},
	{3, "3 Бұлар Әлемнің Иесінің киелі үйіндегі діни қызметкерлер мен пайғамбарлардан: Ұзақ жылдар бойы бесінші айды ғибадатхананың қирағанын еске түсіріп, қайғырып ораза ұстаумен өткізіп келген едік. Енді соны жалғастыра берудің бұдан былай да керегі бар ма, жоқ па? — деп сұрады."},
	{4, "4 Сонда Әлемнің Иесі маған сөзін арнап былай деді:"},
	{5, "5 — Елдің бүкіл халқы мен діни қызметкерлерден мынаны сұра: Соңғы жетпіс жыл бойы бесінші және жетінші айларда қайғырып ораза ұстағандарың шынымен Маған арналып па еді?"},
	{6, "6 Әрі ішіп-жеген кездеріңде өз пайдаларың үшін ғана ішіп-жеп пе едіңдер?"},
	{7, "7 Иерусалим мен оның айналасындағы қалалар тұрғындарға толы болып, тыныштыққа кенеліп, оңтүстіктегі иен дала мен батыстағы төменгі қыраттарда да адамдар тұрып жатқан кездері Жаратқан Иенің ежелгі пайғамбарлар арқылы жариялаған сөздері осылар емес пе?"},
	{8, "8 Жаратқан Ие Зәкәрияға тағы да сөзін арнап былай деді:"},
	{9, "9 — Мен, Әлемнің Иесі, (ата-бабаларыңа) мынадай бұйрықтар берген едім: Әділ үкім шығарыңдар, бір-біріңе мейірім мен аяушылық танытыңдар!"},
	{10, "10 Жетім-жесірлерге әрі жат жұрттық пен жарлы-жақыбайға зорлық-зомбылық жасамаңдар! Бір-біріңе қарсы зұлымдық ұйымдастырмаңдар!"},
	{11, "11 Бірақ олар тыңдаудан бас тартты, тіпті тыңдамаймыз деп бет-жүздерін бұрып, естімеу үшін құлақтарын жауып алды."},
	{12, "12 Олар Таурат заңын да, Мен, Әлемнің Иесі, Өзімнің Рухыммен ежелгі пайғамбарлар арқылы жіберген өзге сөздерімді де тыңдамау үшін жүректерін тастай етіп қасарыстырып қойды. Сондықтан да оларға қатты қаһарландым."},
	{13, "13 Мен оларды шақырған кезде олар құлақ салмаған еді. Сондықтан олар Мені шақырған кезде Мен де құлақ салмадым, — дейді Әлемнің Иесі."},
	{14, "14 Осылай Мен оларды өздері бұрын-соңды көріп-білмеген халықтардың арасына дауыл айдағандай бытыратып жібердім. Олар тастап кеткен елдің иесіз бос қалғаны сонша, онда ешкім де аяқ басып жүрмейтін болды. Осылайша олар сол шұрайлы елді қаңыраған құла түзге айналдырды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct kk8 poems[] = {
	{1, "1 Осыдан кейін Әлемнің Иесі маған тағы да сөзін арнап былай деді:"},
	{2, "2 — Әлемнің Иесі мынаны айтады: Мен Сионды зор құштарлықпен сүйемін. Оған деген құштарлығым ішімде оттай лаулап тұр. —"},
	{3, "3 Жаратқан Ие тағы мынаны айтады: — Мен Сионға қайта оралып, Иерусалимде тұратын боламын. Сонда Иерусалим Ақиқат қаласы, әрі Әлемнің Иесінің киелі үйі орналасқан Сион тауы Оған бағышталған қасиетті тау деп аталмақ."},
	{4, "4 Әлемнің Иесі мынаны да айтады: Шал мен кемпірлер қайтадан Иерусалимнің көшелерінде отырып, жастары соншама ұлғайғандықтан қолдарына таяқ ұстап алатын болады."},
	{5, "5 Сонда қала көшелері ойнап жүрген ұл-қыздарға толады. —"},
	{6, "6 Әлемнің Иесі былай деп сұрақ қояды: — Қазіргі кезде осы халықтың тірі қалғандарына бұл айтқандарымның жүзеге асуы тым керемет болып көрінсе, оның Мен үшін де тым керемет болып көрінгені ме? —"},
	{7, "7 Әлемнің Иесі Өзі жауабын беріп мынаны уәде етеді: — Біліп алыңдар, Мен өз халқымды күншығыстан батысқа дейінгі бүкіл елдерден құтқарып аламын!"},
	{8, "8 Оларды Иерусалимде тұруға бастап әкелемін. Олар Менің халқым, Мен олардың Құдайы болып адалдық пен әділдік танытамын."},
	{9, "9 Әлемнің Иесі Жаратқан Ие мынаны да айтады: Басталған істі бітіру үшін қолдарыңның күшін нығайтыңдар! Осы сөздерді бүгін пайғамбарлардың аузынан естіп отырсыңдар. Әлемнің Иесінің киелі үйінің негізі қаланған кезде де пайғамбарлар сендерді оны бітіруге жігерлендірген еді."},
	{10, "10 Сол уақытқа дейін еңбегі үшін адамға да, көлік малына да ақы төленбейтін еді. Мен барлық адамдарды бір-біріне қарсы жау қылып қойғандықтан, жолға шыққандар зорлықшылдардан қауіпсіз бола алмады."},
	{11, "11 Бірақ бұдан былай Мен осы халықтың тірі қалғандарына бұрынғыдай істемеймін, — деп нық айтады Әлемнің Иесі. —"},
	{12, "12 Енді аман-есен тұқым себіліп, жүзімдік өз жемісін, жер өз өнімін беріп, аспан өз шығын түсіріп тұратын болады. Мұның бәрін Мен осы халықтың тірі қалғандарына мұралық меншік етіп беремін."},
	{13, "13 Уа, Яһуда халқы әрі (Солтүстік) Исраил халқы! Сендер бұрын басқа ұлттардың арасында қарғысқа ұшырағанның мысалы болып келген едіңдер. Ал енді Мен сендерді құтқарамын, сонда сендер жарылқанып, игілікке кенелесіңдер. Қорықпаңдар, қолдарыңның күшін нығайтыңдар!"},
	{14, "14 Себебі Әлемнің Иесі мынаны айтады: Ата-бабаларың бұрын қаһарымды тудырғанда Мен сендерді апатқа ұшыратуды ұйғарып, аяушылық білдірмеген едім."},
	{15, "15 Алайда осы күндері Мен Иерусалим мен Яһуда еліне қайтадан жақсылық жасауды ұйғардым, — деп уәде етеді Әлемнің Иесі. — Сондықтан қорықпаңдар!"},
	{16, "16 Міне, мынаны істегендерің жөн: бір-біріңе шындықты айтыңдар, сот орындарыңда әділ әрі ынтымаққа жетелейтін үкім шығарыңдар!"},
	{17, "17 Біреуге қарсы зұлымдық ойластырмаңдар, жалған ант беруге салынбаңдар! Мен осылардың бәрін жек көремін! — деп ескертеді Жаратқан Ие."},
	{18, "18 Кейін Әлемнің Иесі маған тағы да сөзін арнап былай деді:"},
	{19, "19 Әлемнің Иесі мынаны айтады: Әр жылдың төртінші, бесінші, жетінші және оныншы айларында ұстап келген ораза мезгілдеріңнің орнына бұдан былай Яһуда елінде шат-шадыман болып, жайдары мерекелер өткізесіңдер! Сондықтан шындық пен татулықты сүйіп қолдап-қорғаңдар!"},
	{20, "20 Әлемнің Иесі мынаны да айтады: Болашақта басқа халықтар мен көптеген қалалардан адамдар Иерусалимге келетін болады."},
	{21, "21 Сол кезде бір қаланың тұрғындары басқа бір қаланың халқына барып: Жүріңдер, тезірек барып, Жаратқан Иенің мейірімін сұрайық! Әлемнің Иесіне бет бұрып сиынайық! Біз өзіміз сонда бара жатырмыз, — дейді."},
	{22, "22 Көптеген халықтар мен күшті ұлттар Әлемнің Әміршісі Жаратқан Иеге сиынып рақым етуін өтіну үшін Иерусалимге келетін болады."},
	{23, "23 Әлемнің Иесі тағы мынаны айтады: Сол күндері әрбір яһудалық адамның киімінен әр түрлі тілдер мен ұлттардың он адамы ұстап алып: Құдайдың сендерге жар болып, сендермен бірге екенін естігенбіз. Өзіңмен бірге баруға рұқсат ете көрші, — деп жалынатын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct kk9 poems[] = {
	{1, "1 Жаратқан Иенің мына ауыр хабары Арама еліндегі Хадрах аймағына, әсіресе Дамаск қаласына, қарсы айтылды. Себебі бүкіл адамзаттың және Исраилдің барлық руларының көздері Жаратқан Иеге қарайды."},
	{2, "2 Дамаскімен шекаралас Хамат та, Тир мен Сидон да қанша дана болғандарымен Жаратқан Иенің ауыр айыптау сөзі соларға да қарсы айтылды."},
	{3, "3 Тир өзіне қорған салып, күмісті шаң-тозаңдай, алтынды даладағы саз балшықтай үйіп жинап алды."},
	{4, "4 Бірақ енді Тәңір Ие оның дәулетін тартып алып, байлығын теңізге лақтырады, қалғанының бәрін от жалмайды."},
	{5, "5 Ашқалон қаласы Тирдің қирағанын көріп, зәресі ұшады. Газа да қорыққанынан бүрісіп қалады, үміті үзілген Әкрон да осылай қысылып қиналмақ. Газа патшасынан айырылып, Ашқалон қаңырап бос қалады."},
	{6, "6 Азот қаласын жат жұрттық келімсектер мекендейтін болады. Філістір елінің өркөкіректігін Мен осылайша жоямын."},
	{7, "7 Мен оларды ет жегенде қанымен қосып жемейтіндей қыламын, арам деп белгіленген басқа тағамдарды да жегізбеймін. Тірі қалғандары біздің Құдайымызға бағышталып, халқымның бөлігіне айналып, Яһуда руының бір атасы болып саналады. Бұрынырақта ебустіктер сияқты, әкрондықтар да Исраил халқына қосылып сіңіп кетеді."},
	{8, "8 Мен киелі үйімді айналдыра күзетіп, келіп-кетіп жүрген тонаушы топтардан қорғаймын. Өзім оны бақылап тұрғандықтан, енді зорлықшыл жау халқымның елінен өте алмайтын болады."},
	{9, "9 Уа, Сион халқы, қатты қуан! Уа, Иерусалим халқы, шаттана ән шырқа! Қара, сенің Патшаң саған келе жатыр! Ол — әділ Құтқарушы, кішіпейілділікпен есекке мініп алып, тайқардың, бір жас есектің, үстінде отыр."},
	{10, "10 Мен Солтүстік Исраилден соғыс күймелерін, Иерусалимнен де атты әскерді аластатамын. Соғыс садақтары сындырылады. Сол Патша барлық халықтарға тыныштық жариялайды. Ол билігін теңізден теңізге дейін, үлкен Евфрат өзенінен жердің шетіне дейін жүргізеді."},
	{11, "11 Мен сендермен Келісім жасап, ол шалынған құрбандықтың қанымен бекітілген болатын. Сол үшін Мен тұтқындарыңды сусыз құдық іспетті (Бабыл еліндегі) зындандардан құтқарып аламын."},
	{12, "12 Уа, күдері үзілмеген тұтқындар, қауіпсіз қорғандарыңа қайта оралыңдар! Жоғалтқандарыңды сендерге екі есе қылып қайтарамын деп бүгін уәде беріп отырмын."},
	{13, "13 Мен Яһуданы соғыс садағы, Солтүстік Исраилді жебе ретінде қолданамын. Уа, Сион, Мен сенің ұлдарыңды грек елінің ұлдарына қарсы көтеріп, семсер ретінде пайдаланамын!"},
	{14, "14 Сонда өз халқының үстінен Жаратқан Ие пайда болып, Оның жебелері найзағайдай атылатын болады. Жаратушы Тәңір Ие кернейдей қатты дауыс шығарып, оңтүстіктегі иен даладан соққан дауылдай жауға бас салады."},
	{15, "15 Әлемнің Иесі өз халқын жан-жақтан қорғайтын болады. Олар дәу сақпан тастарымен жауларын ойрандап талқандайды. Шайқаста олар қызып алғандай айқайлайды. Олар (қан бүркуге арналған) тостағандай, әрі құрбандық үстелінің мүйіз тәрізді бұрыштарындай, қанға малынатын болады."},
	{16, "16 Сол күні олардың Құдайы Жаратқан Ие Өзінің бағып жүрген отары іспетті меншікті халқын құтқарып алады. Олар Оның жерінде тәждің асыл тастары сияқтанып жалт-жұлт етіп тұрады."},
	{17, "17 Бұл қандай игі де әдемі көрініс болмақ! Дәннен — жас жігіттері, жаңа жүзім шырынынан — қыздары әлденіп, құлпырып жайнап кетпек."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct kk10 poems[] = {
	{1, "1 Жаратқан Иеден көктемгі жауын мерзімінде жаңбыр жаудыруын өтініңдер! Себебі қалың бұлттарды жаратып, адам баласына мол жаңбырын жаудыратын, далада өсіп тұрған өсімдіктен тіршілік атаулыға азығын ризық ететін — Жаратқан Иенің Өзі."},
	{2, "2 (Ол былай дейді:) Басқа ұлттар үйлерінде табынатын тәңірсымақтардың айтатыны өтірік, бал ашқан сәуегейлердің болжағандары да жалған, көріпкелдер өтірік түс көріп, босқа жұбаныш береді. Осының бәрінен халқым қой сияқты тентіреп кетті, бағушысы болмағандықтан олар азап шегуде."},
	{3, "3 Сенің бағушыларыңа деген ашуым лаулап қозады. Мен халықты отардағы серкедей бастап жүретін билеушілеріңді жазалаймын! Себебі Әлемнің Иесі өз отары — Яһуда халқының қамын ойлайды. Оларды шайқас кезіндегі айбат шеккен тұлпардай етеді."},
	{4, "4 Яһудадан үйге бағыт беретін бұрыш тасы да, шатырдың қазығы да, шайқас садағы және әрбір билеуші де шығады."},
	{5, "5 Олар шайқаста мықты жасақшылар болып жауларын балшыққа таптап тастайды. Жаратқан Ие өздерімен бірге жүріп жар болғандықтан олар соғысып, тіпті атты әскерді масқараға ұшыратады."},
	{6, "6 Мен Яһуда халқын күшейтіп, Жүсіптің үрім-бұтағын да құтқарамын. Мен оларға мейірбандық танытып оларды елге қайтарып алып келемін. Сонда олар Мен өздерінен ешқашан бас тартпағандай болады. Мен олардың Құдайы Жаратқан Иемін ғой, Мен оларға құлақ саламын."},
	{7, "7 Міне, сонда Ефремнің адамдары батырлар іспетті болып, тойдағыдай көңілдері көтеріледі. Мұны көріп, олардың бала-шағалары да қуанып, Жаратқан Иеге шаттанатын болады."},
	{8, "8 Содан соң Мен белгі беріп шақырып, оларды жинаймын, себебі Өзім құнын төлеп құтқарып алдым. Олар енді бұрынғыша өсіп-өніп көбейетін болады."},
	{9, "9 Мен халқымды басқа ұлттардың арасына тарыдай шашыратып жіберген болсам да, олар Мені алыстағы елдерде де естеріне алады. Өздері және балалары тірі қалып, елге қайтып келеді."},
	{10, "10 Мен халқымды Мысырдан қайтарып алып, Ассур елінен де жинап әкелемін. Оларды Ғилақад пен Ливан өлкелеріне де алып барамын. Оларға тіпті сол жерде де орын жетпей қалады."},
	{11, "11 Халқым зор қиындықпен теңіз арқылы өтеді. Сонда буырқанған теңіз толқындары сабасына түсіп тыншиды. Ніл өзенінің бар арналары құрғап кеуіп қалады. Ассурдың өркөкіректігі қорланып, Мысыр да өз билігінен айырылады."},
	{12, "12 Мен халқымды өз құдіретіммен күшейтемін! Олар Менің атыммен жүретін болады, — деп нық айтады Жаратқан Ие."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct kk11 poems[] = {
	{1, "1 Уа, Ливан елі, қақпаларыңды айқара аш, самырсындарыңды от жалмап қойсын!"},
	{2, "2 Уа, қарағай ағаштары, зар жылаңдар, себебі самырсындар құлап, айбынды ағаштар қирап қалды. Уа, Башан елінің емендері, зар жылаңдар, себебі Ливанның қалың орманы күйреді."},
	{3, "3 Шопандардың беу-беулеп жоқтаған дауыстарына құлақ түрші: Олардың мақтан тұтқан жайылымдары жойылды. Ақырып жүрген жас арыстандарға құлақ тікші! Себебі олардың Иордан өзенінің жағасындағы мекені — ну қамыс құртылды."},
	{4, "4 Құдайым Жаратқан Ие мынаны айтады: Сойылуға белгіленген отарымды бақ!"},
	{5, "5 Оларды сатып алып кеткендер қырып салып, жазасыз қала береді. Ал оларды сатып жібергендер: Жаратқан Иеге шүкірлік, байып алдық! — дейді. Тіпті бақташылардың өздері баққан малын аямайды."},
	{6, "6 Мен енді елдің тұрғындарына аяушылық көрсетпеймін! — деп жариялайды Жаратқан Ие. — Оларды бір-бірінің әрі патшаларының қолдарына түсіремін. Солар елді ойрандаса да, Мен ешкімді олардың шеңгелінен құтқарып алмаймын!"},
	{7, "7 Осылай мен сойылуға белгіленген бір отар қойды бақтым. Олар езіліп, тапталғандар еді. Екі таяқ алып, бірін Рақым, екіншісін Бірлік деп атап, отарды жайдым."},
	{8, "8 Бір айдың ішінде-ақ үш зұлым бақташыны жоқ қылдым. Ал отар мені жек көріп, мен де олардан әбден мезі болдым."},
	{9, "9 Сонда: Бұдан былай мен сендердің бақташыларың болмаймын. Өлетіндерің өліп, құритындарың құрыңдар! Ал қалғандарың бір-біріңді жалмай беріңдер, — дедім."},
	{10, "10 Өзімнің Рақым атты таяғымды алып, оны сындырдым. Осылай мен барлық басқа халықтармен жасаған келісімімді жойғанымды көрсеттім."},
	{11, "11 Сөйтіп келісім сол күні жойылды. Ал отардың езіліп, тапталған қойлары мені бақылап тұрып, бұл сөздің Жаратқан Иеден келгенін ұқты."},
	{12, "12 Содан соң мен: Егер құп көрсеңдер, менің ақымды беріңдер, құп көрмесеңдер, мейлі, төлемей-ақ қойыңдар! — дедім. Олар маған отыз мысқал күмісті таразыға тартып өлшеп берді."},
	{13, "13 Жаратқан Ие маған мынаны айтты: Мен үшін белгіленген керемет жоғары бағаны алып, құмырашыға қарай лақтырып таста! — Сонда мен отыз мысқал күмісті Жаратқан Иенің киелі үйінде құмырашыға қарай лақтырып тастадым."},
	{14, "14 Осыдан кейін Бірлік дейтін екінші таяғымды сындырып, Яһуда мен Солтүстік Исраил елдерінің арасындағы ағайындық байланысты жойдым."},
	{15, "15 Жаратқан Ие маған тағы да тіл қатып былай деді: Бақташының құрал-саймандарын өзіңе ал да, жаман бақташыдай әрекет жаса."},
	{16, "16 Себебі Мен елде сондай бақташыны шығарамын. Ол отардың ішіндегі құрып бара жатқандарының қамын да ойламайды, адасып кеткен төлдерін де іздемейді, ауырған қойларын да емдемейді, сауларын да күтпейді. Керісінше, ол семіздерінің етін жалмап, тіпті тұяқтарына дейін шағып жеп тауысады."},
	{17, "17 Отарын тастап кеткен жаман бақташы қасіретке қалады-ау! Семсер оның қолы мен оң көзіне қадалсын! Сонда оның қолы әбден солып, оң көзі мүлдем көрмей қалады!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct kk12 poems[] = {
	{1, "1 Мынау Жаратқан Иенің Исраил елі жайлы айтқан ауыр хабары: Аспанды жайып жіберіп, жердің негізін қалаған, адамның денесінде рухын қалыптастырған Жаратқан Ие мынаны айтады:"},
	{2, "2 Біліп қойыңдар, Мен Иерусалимді айналасындағы елдерді теңселдіретін ішімдікке толы тостаған іспетті қыламын. Жаулар Иерусалиммен бірге Яһуда елін де қоршауға алмақ."},
	{3, "3 Сол күні Мен Иерусалимді барлық халықтар үшін зіл қара тас іспетті қыламын: оны көтеремін дегендердің бәрі де өздерін зорықтырып алатын болады. Сол кезде жер бетінің күллі халықтары оған қарсы жиналып келетін болады."},
	{4, "4 Сол күні Мен әрбір атты қатты үрейлендіріп, оған мінгенді есінен адастырамын, — деп нық айтады Жаратқан Ие. — Мен Яһуда елін қырағы күзетіп, оған қарсы келген халықтардың соғыс аттарын соқыр қылып тастаймын."},
	{5, "5 Сонда Яһуданың рубасылары іштей былай дейтін болады: Иерусалимнің тұрғындары — біздің қуатымыз, өйткені Әлемнің Иесі — олардың Құдайы!"},
	{6, "6 Сол күні Мен Яһуданың рубасыларын отынның арасындағы шоқ салғыштай, яки астық бауларының арасында жанып жатқан алаудай етемін. Олар айналадағы барлық халықтарды өртейтіндей жалмайды. Бірақ Иерусалимнің халқы қайтадан аман-есен өз мекенінде тұратын болады."},
	{7, "7 Сонда Дәуіттің әулеті мен Иерусалимнің тұрғындарының атақ-даңқы Яһуда елінің атақ-даңқынан асып кетпесін деп Жаратқан Ие алдымен Яһуданың елді мекендерін құтқарады."},
	{8, "8 Сол күні Жаратқан Иенің Өзі Иерусалимде тұратындарды қорғайды. Сол себепті олардың арасындағы ең әлсіз дегені Дәуіттей мықты болады. Ал Дәуіттің әулеті оларды Құдайдың Өзіндей, Жаратқан Иенің періштесіндей бастап алып жүреді."},
	{9, "9 Сол күні Мен Иерусалимге тап беретін барлық халықтарды құртуға кірісемін."},
	{10, "10 Мен Дәуіттің әулеті мен Иерусалимнің халқына мейірім мен мінажат ету рухын дарытамын. Сонда олар өздері түйреген Кісіге қарайтын, әрі жалғыз ұлын жоқтағандай, жоқтау айтатын болады. Олар тұңғышы қайтыс болғандай, Ол туралы қатты күйініп, қайғыратын болады."},
	{11, "11 Сол күні Иерусалимдегі жоқтау Мегидо жазығындағы Хадад-Римонда болған жоқтау сияқты өте қатты болмақ."},
	{12, "12 Сонда бүкіл ел, әрбір әулет өз алдына, ер адамдар мен әйелдер бөлек-бөлек қайғырады: Дәуіттің әулеті өз алдына, (оның ұлы) Натанның әулеті өз алдына,"},
	{13, "13 Леуінің әулеті өз алдына, (Леуіден тараған) Шимейдің әулеті өз алдына."},
	{14, "14 Аман қалған әулеттердің барлығы да, ер адамдары мен әйелдері бөлек-бөлек, қайғыратын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct kk13 poems[] = {
	{1, "1 Сол күні Дәуіттің әулеті мен Иерусалимнің тұрғындарына оларды күнә мен арамдықтан тазартатын қайнар көз ашылады."},
	{2, "2 Әлемнің Иесі тағы мынаны жариялайды: Сол күні Мен елдегі жалған тәңір аттарын өшіремін. Оларды енді қайтып ешкім есіне алмайтын болады. Мен, сондай-ақ, елден жалған пайғамбарларды да, арамдықтың рухын да аластатамын."},
	{3, "3 Егер қайтадан бір пайғамбар пайда болса, туған әке-шешесі оған: Жаратқан Иеден келген хабар деп өтірік айтып жүргендіктен сен өлуге тиіссің! деп сақтандырады. Ал егер жалған пайғамбарлық сөз айтып тұрса, әке-шешесі оны түйреп өлтіреді."},
	{4, "4 Сол күні адамдар аян көріп, жалған пайғамбарлық сөз айтудан ұялатын болады. Ешкім де енді қайтып жұртты алдау үшін пайғамбардың түйе жүн шапанын кимейтін болады."},
	{5, "5 Керісінше, әрқайсысы: Жоқ, мен пайғамбар емеспін, жер өңдеуші диқанмын. Жастайымнан басқа адам үшін жер өңдеп келемін! дейтін болады."},
	{6, "6 Егер біреу одан: Мына көкірегіңдегі не қылған жарақаттар? деп сұраса, ол: Бұл жарақаттар маған өз достарымның үйінде салынды, деп жауап береді."},
	{7, "7 — Ей, семсер, Менің бақташыма, өз серігіме, қарсы шық! — дейді Әлемнің Иесі. — Бақташыны ұрып өлтір, сонда отарындағы қойлары бытырап кетеді. Мен төлдеріне де қол жұмсаймын."},
	{8, "8 Жаратқан Ие тағы мынаны айтады: Бүкіл елде халықтың үштен екісі соққы жеп қырылады, ал үштен бірі тірі қалады."},
	{9, "9 Мен осы үштен бір бөлікті отқа салып, күмісті балқытып тазалағандай тазартамын, әрі алтынды отта сынағандай сынаймын. Олар Менің атымды атап Маған дұға етеді. Сонда оларға жауап беремін. Мен: Бұл — Менің халқым, — деп, олар: Жаратқан Ие — біздің Құдайымыз, — дейтін болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct kk14 poems[] = {
	{1, "1 Біліп алыңдар, Жаратқан Иенің күні келе жатыр! Сол заманда сендерден алынған олжа өз көз алдарыңда бөлінетін болады."},
	{2, "2 Себебі Мен барлық халықтарды Иерусалимге қарсы соғысуға жинаймын. Қала олардың қолына түсіп, жау әскері ондағы үйлерді талан-таражға салып, әйелдерді зорлап масқаралайтын болады. Қала тұрғындарының жартысы жер аударылып әкетіліп, қалғандары қалада қалдырылады."},
	{3, "3 Сонда Жаратқан Ие ежелгі замандарда шайқасқандай, осы халықтарға қарсы шайқасады."},
	{4, "4 Сол күні Оның аяғы Иерусалимнің шығысындағы Зәйтүн тауында тұрады. Зәйтүн тауы шығыстан батысқа қарай қақ айырылып, екі ортада өте кең аңғар пайда болады. Таудың бір жартысы солтүстікке, екінші жартысы оңтүстікке қарай жылжиды."},
	{5, "5 Сендер Менің тауларымның аңғарымен қашып құтыласыңдар, себебі сол аңғар Аселге дейін созылатын болады. Сендер жұрт Яһуда патшасы Ұзияхтың заманында болған жер сілкінісінен қашқандай қашасыңдар. Сонда менің Құдайым — Жаратқан Ие Өзіне бағышталған барлық қасиетті нөкерлерін ертіп келеді."},
	{6, "6 Сол күннен бастап суық пен аяз атымен болмайды."},
	{7, "7 Сол күн ешқашан бітпейді, онда күндіз бен түннің айырмашылығы болмайды. Ол туралы тек Жаратқан Ие ғана біледі. Кешке әлі де жарық бола береді."},
	{8, "8 Сол күннен бастап Иерусалимнен тірі су ағып шығып, бір жартысы шығыстағы Өлі теңізге, екінші жартысы батыстағы Жерорта теңізіне ағып кететін болады. Ағысы қысы-жазы толастамайды."},
	{9, "9 Жаратқан Ие бүкіл жер бетінің Патшасы болады. Сол күні Жаратқан Ие бірден-бір Құдай болып, жалғыз Оның есімі ғана мадақталатын болады."},
	{10, "10 Яһуданың солтүстігіндегі Геба мен Иерусалимнің оңтүстігіндегі Риммонның арасындағы бүкіл жер тегіс жазыққа айналады. Ал Иерусалим көтеріліп, өз орнында қала береді: ол Бунямин қақпасынан Бірінші қақпаның жеріне және Бұрыш қақпасына дейін, әрі Хананел мұнарасынан патшаның жүзім сыққыштарына дейін созылады."},
	{11, "11 Халық Иерусалимге қоныстанып, қала енді қайтып қарғысқа ұшырап қиратылмайды. Осылай Иерусалимнің халқы аман-есен тұратын болады."},
	{12, "12 Ал Иерусалимге қарсы соғысуға аттанған халықтардың бәріне Жаратқан Ие індет жібереді: олар аяқтарымен жер басып жүрген кездерінде-ақ тәндері іріп-шіріп, көздері ұяларында, тілдері ауыздың ішінде шіріп кетеді."},
	{13, "13 Сол күні Жаратқан Ие оларды қатты абыржытып, араларында үрей туғызады. Олар қасында тұрғанды қолынан шап беріп ұстап алып, бір-біріне бас салатын болады."},
	{14, "14 Сонда Яһуда елінің барлық адамдары да Иерусалимде соғысады. Содан айналадағы күллі халықтардың байлықтары: алтын-күміс пен киім-кешектері молынан жиналып, оларға олжа болады."},
	{15, "15 Оның үстіне жаңағы індет сияқты пәле жаулардың жылқылары мен қашырларын, түйелері мен есектерін, әрі әскер қостарындағы барлық басқа малдарын да қырып тастайды."},
	{16, "16 Сонда Иерусалимге қарсы келген халықтардан тірі қалғандары енді жыл сайын Патшаға, Әлемнің Иесіне, ғибадат етіп, Күркелер мейрамын тойлауға келетін болады."},
	{17, "17 Ал алда-жалда жер бетіндегі әулеттердің біреуі Патшаға, Әлемнің Иесіне, ғибадат етуге Иерусалимге өрлеп бармай қалатын болса, онда сондайлардың жеріне жаңбыр да жаумайтын болады."},
	{18, "18 Егер Мысыр халқы жолға шығып Иерусалимге келмейтін болса, онда Жаратқан Ие Күркелер мейрамын тойлауға келмейтін халықтарға арнаған апаттарын соларға жібереді."},
	{19, "19 Егер Мысыр мен басқа да елдердің халықтары Күркелер мейрамын тойлауға Иерусалимге өрлеп барудан бас тартса, олар осылай жазаланбақ."},
	{20, "20 Сол күні жылқылардың қоңырауларында Жаратқан Иеге бағышталған деген жазу болады. Жаратқан Иенің киелі үйіндегі құрбандық етін пісіруге арналған қазандар құрбандық үстелінің алдындағы тостағандар сияқты Оған бағышталған киелі болады."},
	{21, "21 Құрбандық ұсынушы әркім келіп, шалған құрбандығының етін пісіре алуы үшін Иерусалим мен Яһудадағы кез келген тамақ пісіретін қазан Әлемнің Иесіне бағышталған киелі болады. Сол күннен бастап Әлемнің Иесінің киелі үйінде (Оған мойынсұнбайтын) бірде-бір қанахандық қалмайды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};