#include <map>
#include <string>
class Bible53
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Құдай Әкемізге және Иеміз Иса Мәсіхке сенушілердің Салониқадағы қауымына Пауылдан, Сыйластан және Тімотеден дұғай сәлем."},
	{2, "2 Сендерге Құдай Әкеміз және Иеміз Иса Мәсіх рақымын жаудырып, тыныштығын сыйлай көрсін!"},
	{3, "3 Қымбатты бауырластар, Құдайға сендер үшін әрдайым шүкірлік етуге тиіспіз. Бұл, әрине, дұрыс, өйткені бәріңнің сенімдерің мен өзара сүйіспеншіліктерің артып келе жатыр."},
	{4, "4 Сондықтан біз бастарыңнан өтіп жатқан әр түрлі қудалау мен қысымшылықтар кезіндегі шыдамдылықтарың мен сенімдеріңді Құдайдың өзге қауымдарына айтып, мақтан етіп жүрміз."},
	{5, "5 Бұның бәрі Құдайдың барлық адамдарды әділ соттайтынын көрсетеді: Ол Өзінің Патшалығы үшін азап шеккен сендерді соған кіруге лайықтысыңдар деп есептейді."},
	{6, "6 Құдайдың әділдігі мынадай: Ол сендерді қинағандардың өздерін қинамақ,"},
	{7, "7 ал қиналып жүрген сендерге бізбен бірге тыныштық бермек. Бұл, Иеміз Иса Мәсіх құдіретті періштелерімен бірге жалындаған отпен көктен түсіп келгенде болады."},
	{8, "8 Сонда Ол Құдайға менсінбей, Иеміз Исаның Ізгі хабарына құлақ аспай жүргендерді жазаламақ."},
	{9, "9 Сол адамдар мәңгі бақи Иеміздің алдын көрмей, Оның салтанатты ұлы құдіретінен аластатылып, құрып кетеді."},
	{10, "10 Сол күні Иеміз келеді де, Өзіне бағышталған адамдарына жасаған игіліктері үшін зор мақтанышқа бөленіп, Өзіне сенген олардың бәрін қайран қалдырады. Сендер де солардың ішінде боласыңдар, өйткені біз әкелген Ізгі хабарға сендіңдер."},
	{11, "11 Сондықтан біз әрдайым сендер үшін былай деп мінажат етеміз: Құдай сендерді құтқарылуға шақырған соң соған лайықты өмір сүрулеріңе, ізгі ниеттеріңді жүзеге асыруларыңа және сеніммен бастаған істеріңді Құдайдың көмегімен аяқтауларыңа қабілет бергей."},
	{12, "12 Осылай сендер арқылы Иеміз Исаның есімі даңққа бөленіп, өздерің де Оның ұлылығын бөлісесіңдер. Құдайымыз және Иеміз Иса Мәсіх бұл үшін сендерге рақымын жаудыра көрсін."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Бауырластар, Иеміз Иса Мәсіхтің қайтып келуі мен біздің Оның қасына жиналуымызға байланысты сендерден мынаны өтінеміз:"},
	{2, "2 кейбіреулер Иеміз Мәсіхтің келетін күні болып қалған екен деген лақапты таратса, сендер бірден абыржып, қорқып қалмаңдар! Олар осы жайлы аян көрдік, не (Құдайдан) хабар жетті, не бізден хат алдық десе де, бәрібір иланбаңдар!"},
	{3, "3 Ешкім сендерді амалын тауып алдап кетпесін. Себебі Иеміз келер алдында адамдар Құдайдан бас тартып, опасыздық жасайды, әрі әділетсіздіктің қолдаушысы, кейін мүлдем құритын кісі пайда болады."},
	{4, "4 Ол Құдайға және Оның ұлылығын білдіретін бар нәрсеге қарсы тұрып, өзін олардан жоғары қояды, тіпті Құдайдың киелі үйінде отырып алып, өзін құдаймын деп жариялайды."},
	{5, "5 Қастарыңда болған кезімде менің осыны айтып отырғаным естеріңде емес пе?"},
	{6, "6 Күні бүгінге дейін сол кісіні қандай күш шығармай ұстап тұрғанын білесіңдер. Себебі оған белгіленген уақыт бар."},
	{7, "7 Әрине, адамдарды Құдайдың заңына қарсы тұрғызатын құпия күштер қазірдің өзінде әрекет етуде! Бірақ соларды ашық шығармай, ұстап тұрған қасиетті күшті алдымен Құдай алып тастауы керек."},
	{8, "8 Оның заңына қарсы тұрушы кісі содан кейін шығады. Алайда оны Иеміз Иса қайтып келіп, бәріне салтанатты түрде көрінгенде, аузынан шыққан леппен-ақ мүлдем жояды."},
	{9, "9 Ал Құдайдың заңына қарсы тұрушы кісі келгенде, шайтанның әрекетіне сай зор күш-қуат, әр түрлі алдамшы ғажайып істер мен кереметтер көрсетпек."},
	{10, "10 Ол кейін құритындардың бәрін күллі жамандықтармен тура жолдан адастырады. Себебі олар өздерін құтқара алатын шындықты ұнатпай, оны жүректеріне жолатпады."},
	{11, "11 Сондықтан да Құдай оларды өтірікке иланып, түзу жолдан оп-оңай адасатын қылып қояды."},
	{12, "12 Сонымен шындыққа сенбей, әділетсіздікке құмартқандардың бәрі сотталатын болады."},
	{13, "13 Иеміз сүйген қымбатты бауырластар, сендер үшін Құдайға үнемі алғыс айтуға міндеттіміз. Себебі Ол сендерді Киелі Рухының арқасында Өзіне бағышталып қасиетті өмір сүріп, әрі шындыққа сеніп құтқарылуларың үшін әуел бастан таңдап алған еді."},
	{14, "14 Біздің сендерге уағыздаған Ізгі хабарымыз арқылы Құдай сендерді Иеміз Иса Мәсіхтің салтанатты ұлылығынан үлестеріңді алуға да шақырды."},
	{15, "15 Сондықтан, бауырластар, сенімдеріңе берік, табанды болып, біздің ауызша және жазбаша үйреткен тәлімімізден таймаңдар."},
	{16, "16 Лайым бізді сүйетін, әрі рақымын төгіп, мәңгілік жұбаныш пен үзілмес үміт берген Иеміз Иса Мәсіх пен Құдай Әкеміз"},
	{17, "17 жүректеріңді жігерлендіріп, сендерге іс жүзінде де, сөз жүзінде де ізгілік жасауға күш бергей."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Ал енді, бауырластар, біз үшін мінажат етіңдер: Иеміздің Ізгі хабары тура сендердегідей көп тарап, құрметке бөлене берсін."},
	{2, "2 Иеміз бізді қара ниетті, зұлым адамдардың шабуылынан құтқара көрсін. Өйткені жұрттың бәрі бірдей сенуші емес."},
	{3, "3 Ал Жаратқан Ие сенімді, Ол сендерге күш-жігер беріп, әзәзілдің әрекетінен сақтайды."},
	{4, "4 Сендер Иемізбен тығыз байланыста тұрғандықтан, біз өздеріңе бұйырғанымызды қазір де, келешекте де орындайды деп сенім артамыз."},
	{5, "5 Иеміз жан дүниелеріңді Құдайдың сүйіспеншілігіне бұрып, сендер Мәсіхтің қайта оралуын сабырмен күтсін деп мінажат етеміз."},
	{6, "6 Қымбатты бауырластар, Иеміз Иса Мәсіхтің атынан сендерге тағы мынаны ескертеміз: жүгенсіз жүріп, біздің өздеріңе тапсырған ілімімізге ермейтіндерден бойларыңды аулақ ұстаңдар!"},
	{7, "7 Бұл жерде бізден үлгі алу қажеттігін өздерің де білесіңдер. Себебі біз сендерде болғанда жұмыссыз, бос жүріп,"},
	{8, "8 басқаның нанын тегін жеген жоқпыз. Ешқайсыңа ауыртпалық түсірмеу үшін күні-түні еңбек етіп, жан сала бейнеттеніп жұмыс істедік."},
	{9, "9 Нандарыңды жеуге қақымыз бар еді; бірақ сендер бізге еліктесін деп, үлгі болғымыз келді."},
	{10, "10 Араларыңда жүргенде Еңбек еткісі келмеген тамақ та ішіп-жемесін деген қағиданы саналарыңа сіңірдік."},
	{11, "11 Ал енді кейбіреулеріңнің жүгенсіз жүргендіктерің туралы естідік. Олар жұмыс істемей, басқалардың мазасын алып, босқа сандалып жүр екен."},
	{12, "12 Осындайларға біз тыныш еңбек етіп, өз нандарын өздері тауып жесін деп Иеміз Иса Мәсіхтің атынан бұйырып ескертеміз."},
	{13, "13 Ал өздерің, қымбатты бауырластар, жақсылық жасаудан жалықпасаңдар екен."},
	{14, "14 Кімде-кім біздің осы хатта айтып отырған нұсқауларымызға құлақ аспаса, соны естеріңде сақтаңдар. Өз қылығына ұялуы үшін сол кісімен араласпай қойыңдар."},
	{15, "15 Бірақ оған жау деп қарамай, бауырлас ретінде түсіндіріп ескертіңдер."},
	{16, "16 Тыныштықтың бастауы — Жаратқан Иенің Өзі сендерге әрдайым қай нәрседе де тыныштық сыйлай берсін! Иеміз барлығыңа жар болғай!"},
	{17, "17 Ал мен, Пауыл, осы сәлемімді өз қолыммен жазып отырмын. Хаттарымды ұдайы осылай аяқтаймын, олардың менікі екенін осыған қарап білесіңдер."},
	{18, "18 Лайым Иеміз Иса Мәсіх барлығыңа рақымын жаудыра көрсін!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};