#include <map>
#include <string>
class Bible56
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Құдайдың қызметшісі әрі Иса Мәсіхтің елшісі Пауылдан дұғай сәлем. Құдай таңдап алғандарын Мәсіхке сендіріп, Өзіне ұнамды өмір туралы шындықты білуге жетелеу үшін мені тағайындап, жіберді."},
	{2, "2 Осы сенім мен білім мәңгілік өмірге деген үмітімізге негізделген. Жалған сөйлемейтін Құдай бізге сол өмірді әуел бастан-ақ уәде етіп,"},
	{3, "3 Өзі белгілеген уақытында хабарын уағыздатып, паш еткізді. Соны уағыздау Құтқарушымыз Құдайдың бұйрығымен маған да аманатталды."},
	{4, "4 Менімен бірге бір сенімдегі шынайы балам іспетті Титке Құдай Әке мен Құтқарушымыз Иса Мәсіх рақымын жаудырып, тыныштық сыйлай көрсін!"},
	{5, "5 Мен сені Критте аяқталмай қалған істерді реттеп, әрбір қаладағы қауымға жетекшілер тағайындау үшін қалдырған едім. Менің нұсқауларымды ұмытпа:"},
	{6, "6 жетекші ешбір кінәратсыз, әйеліне адал, ал балаларының сенуші болуы қажет. Жұрт оларға мінез-құлықтары жаман, ешкімге мойынсұнбайды деп айып тақпауға тиіс."},
	{7, "7 Себебі қауым басқарушысына Құдайдың жұмысына жетекшілік ету сеніп тапсырылады, сондықтан ол мінсіз болып, менмен, ашушаң, арақ-шарапқа салынған, ұрыншақ, пайдакүнем болмауы керек."},
	{8, "8 Керісінше, ол қонақжай, ізгілік атаулыны сүйетін, байсалды, әділ, пәк таза әрі ұстамды болуға міндетті."},
	{9, "9 Сондай-ақ, ол басқаларды дұрыс ілімге үйретіп, соған еруге жігерлендіріп, Ізгі хабардың қарсыластарын теріске шығара алуы үшін ілімімізге сәйкес шынайы хабарды берік ұстануға тиіс."},
	{10, "10 Өйткені бағынбайтындар, бос сөйлеушілер және алдаушылар көп, әсіресе яһуди дәстүрлерін ұстанушылар арасында."},
	{11, "11 Мұндайлардың ауыздарын жабу қажет, себебі олар оқытпауға тиісті нәрселерді арам пайдалары үшін насихаттап, кейбір отбасыларын түгелдей тура жолдан адастырады."},
	{12, "12 Криттіктердің біреуі, өздерінің пайғамбары: Криттіктер — әрдайым өтірікшілер, зиянды хайуандар, еріншек мешкейлер, — деген."},
	{13, "13 Бұл — шынайы куәлік. Сол себептен де оларға мықтап ескерт: дұрыс сенімді ұстанып,"},
	{14, "14 яһуди аңыздарына, шындықтан адасқан адамдардың ережелеріне ден қоймасын!"},
	{15, "15 Көңілі тазаларға бәрі де таза, ал күнәға былғанып, сенбейтіндер үшін еш нәрсе де таза емес, олар ақыл-естері де, ар-ұждандары да арамданғандар."},
	{16, "16 Құдайды білеміз десе де, мұнысын іс-әрекеттерімен жоққа шығарады; олар — жек көрінішті, ешкімге бағынбайтын, ешқандай игі істер жасауға жарамсыз жандар."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Ал сен дұрыс ілімге сай келетінді үйретуің керек."},
	{2, "2 Егде тартқан ер адамдар қырағы, байыпты әрі байсалды, олардың сенімі, сүйіспеншілігі және шыдамдылығы шынайы да берік болуға тиіс."},
	{3, "3 Сол сияқты, егде әйелдердің жүріс-тұрыстары Құдайға бағышталған әйелдерге лайықты болуы қажет: олар ешкімге жала жаппай, арақ-шарапқа салынбай, қайта, басқаларды жақсылыққа үйрететін болсын."},
	{4, "4 Егде әйелдер қыз-келіншектерді күйеулері мен балаларын сүйіп,"},
	{5, "5 байсалды, кіршіксіз таза, үй шаруасына ұқыпты әрі мейірімді болып, күйеулеріне мойынсұнуға жігерлендіріп үйретсін. Осылайша олар Құдай сөзінің жамандалуына жол бермесін."},
	{6, "6 Осы секілді, жігіттерді де байсалды болуға шақыр."},
	{7, "7 Өзің барлық істе де ізгіліктің үлгісі, тәлім беруде адал және байыпты бол."},
	{8, "8 Айтқан сөзің айыпталмайтындай дұрыс бола берсін, сонда қарсыластарымыздың бізді жамандайтын еш нәрселері болмай, ұятқа қалады."},
	{9, "9 Басыбайлы қызметшілер қожайындарына барлық істе де мойынсұнып, көңілдерінен шығуға ұмтылсын. Оларға қарсы сөйлемей,"},
	{10, "10 ұрлық жасамай, әрдайым шын көңілмен адал болулары керек; осылайша Құтқарушымыз Құдайдың ілімін көркейтсін."},
	{11, "11 Өйткені Құдайдың бүкіл адамзатқа құтқарылуды ұсынатын рақымы анық білінді."},
	{12, "12 Ол бізді Оған ұнамсыз қылықтар мен күнәкар дүниелік құмарлықтардан бас тартып, қазіргі заманда байыпты, әділ және Құдайға ұнамды өмір сүруге бағыттайды."},
	{13, "13 Себебі біз керемет үмітіміздің іске асуын күтудеміз: ұлы Құдайымыз әрі Құтқарушымыз Иса Мәсіх зор салтанатпен көрінетін болады."},
	{14, "14 Ол бізді бүкіл жамандық атаулыдан азат етіп, тазартып, Өзінің меншікті, игі істерге ынталы халқы ету үшін жанын қиып, құрбан болды."},
	{15, "15 Бұларды қауымдарға барлық беделіңмен айтып беріп, насихаттап, елемейтіндерді әшкереле. Ешқайсысы сені менсінбей жүрмесін."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Үкімет пен жергілікті әкімшілік өкілдеріне мойынсұнып, олардың еркін орындап, жақсылық атаулыны жасауға дайын болу қажеттігін сенушілердің естеріне салып отыр."},
	{2, "2 Сонымен қатар, олар ешкімді қаралап, жанжал туғызбай, жұрттың бәріне бірдей мейірімділік пен ілтипаттылық танытуға тиіс."},
	{3, "3 Бір кезде біз де түйсіксіз болып, тіл алмай, азғырылып, түрлі құмарлықтар мен ләззаттың құлы болдық. Өмірімізді қара ниеттілікпен, күншілдікпен өткізіп, басқаларға жексұрын болып, бір-бірімізді де жек көрдік."},
	{4, "4 Алайда Құтқарушы Құдайымыз Өзінің қайырымын және адамзатқа деген зор сүйіспеншілігін айқын көрсеткенде"},
	{5, "5 бізді құтқарды. Ол бізді жасаған әділ істерімізге бола емес, Өзінің мейіріміне бола күнәдан жуып тазартып, Киелі Рухы арқылы рухани қайта туғызып жаңартты."},
	{6, "6 Құдай бізді Өзінің Киелі Рухына Құтқарушымыз Иса Мәсіхтің арқасында молынан кенелтті."},
	{7, "7 Осылай біз Құдайдың рақымымен ақталдық, Оның сыйлайтын игіліктерінен үлестерімізді алып, мәңгілік өмірден үміттіміз."},
	{8, "8 Бұл айтқандарым нағыз шындық. Құдайға сенгендердің өздерін жақсылық жасауға арнаулары үшін бұларды баса айтуыңды қалаймын. Олар адамдарға ізгілікті де пайдалы."},
	{9, "9 Мәнсіз айтыстар мен ата-тек туралы бос әңгімелерге, жіктелу мен Таурат заңы туралы дау-тартыстарға жол берме! Олар пайдасыз, құр бекершілік."},
	{10, "10 Қате ілім таратып, жік салатын әркімге бір-екі рет ескерту жасап, тыңдамаса байланыстарыңды үзіңдер."},
	{11, "11 Әбден бүлінген мұндайдың күнә жасай беріп, өз үкімін өзі шығаратынын білесің."},
	{12, "12 Мен Артема не Түхікті саған жіберген бойда кешікпей-ақ Никополға тез жетуге тырыс, сол жақта қыстап шығуға бел будым."},
	{13, "13 Заң қызметкері Зенаның және Аполлостың ешбір тапшылық көрмеулері үшін сапарларына қамқорлық жаса."},
	{14, "14 Біздің адамдарымыз өнімсіз өмір сүрмей, мұқтаждардың қажеттерін қамтамасыз етулері үшін игі істермен айналысуға үйренсін."},
	{15, "15 Қасымдағылардың бәрі де саған сәлем айтуда. Ортақ сенімде бізді сүйетіндерге сәлемімізді жеткіз. Лайым Құдай барлығыңа да рақымын жаудыра көрсін! (Аумин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};