#include <map>
#include <string>
class Bible51
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Құдайдың еркімен Мәсіх Исаның елшісі болған Пауылдан және бауырласымыз Тімотеден"},
	{2, "2 Құдайдың халқы болып Мәсіхпен тығыз байланыста жүрген, Қолос қаласында тұратын сенімді бауырластарымызға дұғай сәлем."},
	{3, "3 Сендерге Құдай Әкеміз бен Иеміз Иса Мәсіх рақымын жаудырып, тыныштық сыйлай көрсін! Біз сендер үшін Иеміз Иса Мәсіхтің Әкесі Құдайға сиынған сайын шүкірлік етеміз."},
	{4, "4 Сендердің Мәсіх Исаға сеніп, Құдайдың барлық адамдарын сүйетіндерің туралы естідік."},
	{5, "5 Ал осы сенімдерің мен сүйіспеншіліктерің өздеріңе көкте дайындалған игіліктерді иемденеміз деген үміттеріңе негізделген. Бұл туралы сендер алдымен Құдайдың шынайы хабары — Ізгі хабар өздеріңе жеткенде естідіңдер."},
	{6, "6 Осы хабар дүние жүзінде кеңінен жайылғандай, сендерге де жетті. Ол барлық жерде адамдарды жақсылық жасауға жетелеп, көптеген кісілер оны қабылдауда. Сендер Ізгі хабар туралы естіп, Құдайдың рақымын шынымен таныған күннен бастап, осылай рухани өсіп-өніп келесіңдер."},
	{7, "7 Құдайдың рақымы жөнінде біздің сүйікті қызметтесіміз Епафрастан осы тәлімді алдыңдар. Ол — сендер үшін еңбектеніп жүрген Мәсіхтің сенімді қызметшісі."},
	{8, "8 Епафрас бізге жүректеріңе Киелі Рух дарытқан сүйіспеншілік туралы айтып берді."},
	{9, "9 Сол себептен де біз мұны естіген кезден бері сендер үшін ұдайы Құдайға сиынып келеміз. Сендердің Оның еркін толықтай біліп, өте парасатты да рухани көреген болуларыңды Құдайдан өтінудеміз."},
	{10, "10 Осылайша Иеміздің халқына лайық, Оны риза қылатындай өмір сүрулеріңді, әр түрлі игі істер істеп, өсіп-өне беріп, Құдайды неғұрлым жақынырақ тануларыңды тілеп келеміз."},
	{11, "11 Сендер Оның ұлы құдіретінен мол қуат алып, әрдайым төзімділік пен ұстамдылық таныта алсын әрі қуанышқа кенеліп,"},
	{12, "12 Құдай Әкеге шүкірлік ете берсін деп мінажат етудеміз. Өйткені Ол бәрімізді Өзінің халқы иемденетін нұрлы Патшалығынан үлес алуға шақырып, лайықтады."},
	{13, "13 Құдай бізді қара түнектің билігінен құтқарып, сүйікті рухани Ұлы Иса Мәсіхтің Патшалығына енгізді."},
	{14, "14 Оның құрбандық өлімі арқылы күнәларымыздың құны өтеліп, кешірімге ие болдық."},
	{15, "15 Көзге көрінбейтін Құдайдың қандай екенін рухани Ұлы көрсетеді. Ол — жаратылыс атаулының бәрінен жоғары."},
	{16, "16 Өйткені көктегі әрі жердегі, көзге көрінетін және көрінбейтін нәрселердің бәрін Құдай Өзінің рухани Ұлы арқылы жаратты: тақтар мен үстемдік иелері, билеушілер мен әміршілер бәрі де Мәсіх арқылы және Мәсіх үшін жаратылған."},
	{17, "17 Бүкіл әлем жаратылмай тұрғанда-ақ Ол бар болатын, бәрін аман сақтайтын да — Сол."},
	{18, "18 Мәсіх — сенушілер қауымының, яғни Өзінің рухани денесінің, Басы әрі оның өмірінің Бастауы. Ол — өлімнен қайта тірілгендердің ең Бастысы да. Сондықтан барлық жағынан да Оның жолы үлкен."},
	{19, "19 Құдай Өзінің бүкіл болмысының рухани Ұлында тұрғанын ұнатты."},
	{20, "20 Ол арқылы Құдай жер мен көктегі барлық нәрсені Өзімен татуластыруды қалады, яғни Оның айқышта қанын төгіп, құрбан болғандығының арқасында татулық орнатуды жөн көрді."},
	{21, "21 Ал сендер бұрын жаман ой-пікірлерге салынып, зұлым іс-әрекет жасап, Құдайға жат әрі қас болдыңдар."},
	{22, "22 Алайда Ол сендерді Мәсіхтің тәндік өлімі арқылы Өзімен татуластырды. Бұны сендерді алдына әкелген кезде Өзіне бағышталған кінәратсыз, айып тақпайтындай таза болуларың үшін жасады."},
	{23, "23 Егер Ізгі хабар туралы естігендеріңе күмәнданбай, берік сеніп, Оған деген үміттеріңнен таймасаңдар, бұл солай болады. Осы Ізгі хабар аспан астындағы барлық адамзатқа дерлік жарияланып келеді. Мен — Пауыл да оның таратушысына айналдым."},
	{24, "24 Қазір мен сендер үшін тәнімде бейнет шегіп отырғаныма қуанамын. Мәсіхтің өз рухани денесінің, яғни бүкіл қауымның, игілігі үшін басымнан өтсін деп белгілеген азаптарын кешіп жүрмін, осылайша соларды толықтыра түсудемін."},
	{25, "25 Құдайдың хабарын сендерге толықтай жеткізесің деген Оның тапсыруымен қауымның қызметшісі болдым."},
	{26, "26 Бұл хабар ғасырдан ғасырға, ұрпақтан ұрпаққа жасырын болып келді; ал енді оның сыры Құдайдың адамдарына ашылды."},
	{27, "27 Құдай оларға осы құпия хабарда басқа ұлттар үшін қаншама мол жарылқау бар екенін білдірмек болып шешті: Мәсіх жүректеріңнен орын алды, сол себептен болашақ ұлылықтан үміттісіңдер."},
	{28, "28 Мәсіх туралы хабарды біз барлық адамдарға жеткізіп, бәріне де ескертіп, барынша даналықпен тәлім беріп келеміз. Осылай әрбір жанды Мәсіхпен тығыз байланыста, толық кемелденген түрде Құдай алдына әкелуге талаптанудамыз."},
	{29, "29 Осы үшін жан сала еңбек етіп жүрмін. Бұған мені бойыма дарып келе жатқан Мәсіхтің құдіреті қуаттандыруда."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Сендер мен лаудікиліктер үшін және менімен әлі де жүздеспегендердің бәрі үшін қаншалықты күресіп жүргенімді білдіргім келеді."},
	{2, "2 Күресімнің мақсаты — сендердің жүректеріңнің жігерленіп, сүйіспеншілікпен рухани бірлесулерің, сөйтіп Құдай Әкеміздің Мәсіх туралы құпия хабары жөнінде терең де бай түсінік алып, оны түгел тануларың."},
	{3, "3 Ал Мәсіхте Құдайдың даналығы мен білімінің бүкіл қазынасы жатыр."},
	{4, "4 Мен мұны ешкім сендерді ақылға қонымды болып көрінген сөздерімен алдап кетпесін деп айтып отырмын."},
	{5, "5 Тәніммен қастарыңда болмасам да, рухыммен орталарыңда тұрып, сендердегі ынтымақты, Мәсіхке деген берік сенімдеріңді көріп, қатты қуанамын."},
	{6, "6 Сендер Иеміз Мәсіх Исаны қалай қабылдаған болсаңдар, солай Онымен тығыз байланыста жүріңдер!"},
	{7, "7 Негіздерің Мәсіхте болып, терең тамыр жайып, өсе беріңдер; өздеріңе үйреткен сенімді мықтап ұстанып, Құдайға шексіз алғыс айтатын болыңдар!"},
	{8, "8 Қайдағы біреу пәлсапасымен, пайдасыз ілімімен сендерді өзіне баурап алмасын, байқаңдар! Адамдар ойлап шығарған аңызға негізделген ондай ілім Мәсіх туралы емес, әлемдегі тұрпайы рухани күштер туралы үйретеді."},
	{9, "9 Ал Құдайдың бүкіл болмысы Мәсіхтің бойында тұрады!"},
	{10, "10 Сендер Мәсіхпен тығыз байланысып, рухани игіліктерге толықтай ие болдыңдар. Ол күллі билік пен өктемдікке басшылық етеді."},
	{11, "11 Мәсіхпен тығыз байланысқандықтан сендер рухани сүндеттелдіңдер де. Бұл — қолмен істелген тәннің сүндеттелуі емес, Мәсіхтің рухани сүндеттеуі, яғни Оның ескі күнәкар болмыстарыңды түгелдей алып тастауы."},
	{12, "12 Сендер Мәсіхпен бірге рухани тұрғыдан жерлендіңдер әрі Мәсіхпен бірге қайта тірілдіңдер. Бұл Құдайдың Мәсіхті Өзінің құдіретімен өлімнен қайта тірілткеніне деген сенімдерің арқылы болды. Шомылдыру рәсімінен өткендерің соны білдіреді."},
	{13, "13 Бұрын сендер Құдайдың бұйрықтарын бұзып, рухани сүндеттелмеген, яғни күнәкар болмыстарыңа тәуелді болып, рухани тұрғыдан өлі едіңдер. Алайда Құдай сендерді Мәсіхпен бірге қайта тірілтіп алды. Ол күллі күнәларымызды кешірді:"},
	{14, "14 бізге айып тағып, үкім белгілейтін құжатты Мәсіх құрбан болған айқышқа шегелеп іліп қойып, күшін жойды."},
	{15, "15 Осылайша Құдай рухани билеушілер мен әміршілердің күш-қуатын талқандап, оларды бүкіл әлем алдында әшкерелеп, Мәсіхтің істегендері арқылы жеңіп шықты."},
	{16, "16 Сондықтан ешкім сендерді белгілі тағамдар мен сусындарды ішкендерің, немесе бір мерекені, айдың басын не діни демалыс күнін сақтамағандарың үшін айыптамасын!"},
	{17, "17 Өйткені осындай ережелер — келуге тиісті нәрсенің әлсіз нұсқасы ғана: шынайы жарылқауды Мәсіхтің Өзі алып келді."},
	{18, "18 Орынсыз кішіпейілділік танытып періштелерге табынуларыңды талап ететіндер сендерді кінәламасын! Осындайлардың ақыл-ойларын өз күнәкар болмыстары билейді, ал беделдері өздері ешқашан көрмеген нәрселерге негізделген. Олар ешбір себепсіз кеуделерін көтеріп,"},
	{19, "19 қауымның Басы — Иеміз Мәсіх туралы ілімді ұстанбайды. Ал өзара буындармен, сіңірлермен нығайып, тұтасқан тәндік дененің өсуін бастың басқаратыны сияқты, бүкіл қауымның Құдайдың қалағанындай рухани өсуін де Мәсіх басқарады."},
	{20, "20 Өлі денеге ешқандай бұйрық жүрмейтіні секілді, сендер Мәсіхпен бірге рухани өлгендіктен осы дүниедегі бастапқы ілімдерге бағынбауға тиістісіңдер. Ендеше сендер әлі де осы күнәкар дүниеге жататындай, неліктен мынадай ережелерге бағынасыңдар:"},
	{21, "21 Сол нәрселерді қолға ұстама, ана тағамдарды ішіп-жеме, ол заттарға қол тигізбе!"},
	{22, "22 Бұлардың бәрі түбі қолдану барысында жоқ болатындар ғой. Ондай парыздар мен ілімдер адам ойынан шыққан."},
	{23, "23 Олар кісінің өз бетімен құлшылық етіп, кішіпейілділік танытып, тәнін қатаң тәртіппен ұстауын талап етулеріне бола дана болып көрінеді. Алайда олар адамды ізгілікке жетелемей, оның күнәкар болмысының құмарлықтарын қанағаттандыруына жол береді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Сонымен, Мәсіх өлімнен қайта тірілгенде сендер Онымен бірге рухани тірілдіңдер. Сондықтан көкке лайықты қасиеттерді иемденуге ұмтылыңдар! Өйткені Мәсіх көкте, Құдайдың оң жағында отыр."},
	{2, "2 Ойларыңды күнәкар дүниедегіге емес, көктегіге аударыңдар!"},
	{3, "3 Себебі сендер рухани өлдіңдер, енді өлген кісідей бұрынғы күнәлі іс-әрекеттеріңе жоқсыңдар. Ал Мәсіхпен бірлесіп сүрген жаңа өмірлерің ел көзінен таса, Құдайдың алдында."},
	{4, "4 Өмірлеріңнің бірден-бір бастауы мен мақсаты — Мәсіх. Ол жер бетінде қайтадан көрінген кезде сендер де Онымен бірге салтанатты ұлылықпен көрінесіңдер."},
	{5, "5 Ал енді, күнәкар дүниеге жататын қылықтарыңды біржола тоқтатыңдар: неке адалдығын бұзу, әр қилы азғындық, нәпсіқұмарлық және арам пиғылдан аулақ жүріңдер; ашкөздікке де салынбаңдар, ол жалған тәңірлерге табынумен бірдей!"},
	{6, "6 Құдайға мойынсұнбайтындарға осындай күнәлары үшін Оның қаһарлы соты төніп тұр."},
	{7, "7 Бір кезде сендер де оларды жасайтындармен бірге дәл солай әрекет етіп жүрдіңдер."},
	{8, "8 Ал мына қылықтарды енді тастаңдар: ашу-ыза, кек сақтау, қаралау, бейпіл ауыздық;"},
	{9, "9 бір-біріңе өтірік те айтпаңдар! Себебі сендер ескі күнәкар болмыстарыңның іс-әрекетін тастап,"},
	{10, "10 жаңа ізгі болмысқа ие болдыңдар. Оны жаратып берген Иеміз Өзін жақынырақ тануларың үшін сендердің рухани жағынан Өзіне ұқсас болуларыңды көздеп соған ұмтылуда."},
	{11, "11 Бұл жерде яһуди не басқа ұлттық, сүндеттелген не сүндеттелмеген, шетелдік не көшпенді скиф, құл не ерікті жоқ, қайта, Мәсіх барлық сенушілердің өмірлерінде басты орында."},
	{12, "12 Ал енді, Құдай сендерді сүйіп, өз халқым деп таңдап алғандықтан, ұдайы жанашыр, мейірімді, кішіпейіл, ілтипатты, сабырлы болып, осы қасиеттерге бөленіңдер!"},
	{13, "13 Өзара төзімді болыңдар. Егер біреуге реніш сақтап, тағатын кінәларың болса, кешірімді болыңдар: сендерді Иеміз Мәсіх қалай кешірсе, сендер де солай етіңдер!"},
	{14, "14 Барлық қасиеттердің бастысы ретінде сүйіспеншілікке бөленіңдер, ол бәріңді толықтай біріктіреді."},
	{15, "15 Иеміз Мәсіх сыйлаған тыныштық сендерге билігін жүргізсін! Ол сендерді біртұтас рухани дененің құрамдас мүшелері ретінде татулықта тұруға шақырды. Сонымен қатар ризашылықтарыңды білдіріңдер!"},
	{16, "16 Мәсіх туралы Ізгі хабарға көңілдеріңнен мол орын беріңдер: Забур жырлары, мадақтау өлеңдері және Киелі Рух дарытқан басқа да әндер арқылы бір-біріңе зор парасатпен тәлім-тәрбие және бағыт-бағдар беріңдер. Жүректерің ризашылыққа кенеліп, Иемізге арнап ән айтып отырыңдар!"},
	{17, "17 Не айтып, не істесеңдер де, бәрін Иеміз Исаның атымен жасап, Иеміз арқылы Құдай Әкемізге шүкірлік етіңдер!"},
	{18, "18 Әйелдер, күйеулеріңе мойынсұныңдар! Иемізбен байланыстағы сендердің осылай істегендерің жөн."},
	{19, "19 Күйеулер, әйелдеріңді сүйіп, оларға қатаң болмаңдар!"},
	{20, "20 Балалар, барлық жағдайда да ата-аналарыңның тілін алыңдар, өйткені Иемізге осы ұнайды!"},
	{21, "21 Ата-аналар, балаларыңның ынжық болмауы үшін оларға шектен тыс ұрыспаңдар!"},
	{22, "22 Басыбайлы қызметшілер, барлық жағдайда да бұл дүниелік қожайындарыңның тілін алыңдар! Көңілдерінен шығу үшін тек олар бақылап тұрғанда ғана емес, ұдайы шын жүректен мойынсұныңдар! Осылай Құдай Иемізді терең қастерлеңдер!"},
	{23, "23 Қандай жұмыс болса да, оны адам баласы үшін ғана емес, Иеміз үшін істеп жүргендей жан-тәндеріңмен атқарыңдар!"},
	{24, "24 Себебі осының ақысы ретінде сендер Иемізден Оның уәде еткен игіліктерін қабылдайтындарыңды білесіңдер. Қызмет ететін Қожайындарың — Мәсіхтің Өзі ғой."},
	{25, "25 Ал жамандық жасайтын әркім соның лайықты жазасын тартады. Мәсіх ешкімнің бет-жүзіне қарамай әділ үкім шығармақ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Қожайындар, қызметшілеріңді тиісті нәрселермен қамтамасыз етіп, әділ болыңдар! Өйткені көкте сендердің де Қожайындарыңның бар екенін білесіңдер."},
	{2, "2 Әрдайым Құдайға сиынып, рухани сергек те шыдамды болып, шүкірлік ете беріңдер!"},
	{3, "3 Біз үшін де мінажат етіңдер: Құдай өз хабарын уағыздауымызға жол аша көрсін, осылай Мәсіх туралы құпияны жариялай алайық. Сол үшін де бұғауда отырмын."},
	{4, "4 Менің тиісті түрде бұл хабарды ашық айта алуым үшін де Құдайға сиыныңдар."},
	{5, "5 Қауымнан тыс адамдармен парасатты қарым-қатынас жасап, тиімді сәттерді пайдаланыңдар!"},
	{6, "6 Сөйлескенде ұдайы ниеттерің игі, сөздерің дәмді болсын, әрқайсысына қалай жауап беру керек екенін біліңдер."},
	{7, "7 Адал көмекшім әрі Иемізге бірге қызмет етуші, сүйікті бауырласымыз Түхік сендерге мен туралы бәрін хабарламақ."},
	{8, "8 Оны сол мақсатпен жіберіп отырмын, ол жағдайларыңның қалай екенін көріп, жүректеріңді жігерлендірмек."},
	{9, "9 Онымен бірге сүйікті де адал бауырласымыз әрі сендердің жерлестерің — Онисым да барады. Бұл жердегі болып жатқан жағдайды Түхік екеуі сендерге толық айтып береді."},
	{10, "10 Менімен бірге тұтқында отырған Арыстарқ, сондай-ақ Барнабаның жиен інісі Марқа сендерге сәлем жолдайды. Марқа жайлы ерекше нұсқау алдыңдар: ол сендерге барса, жылы қабылдаңдар!"},
	{11, "11 Иуст деп аталатын Иса да сәлем айтады. Яһудилердің ішіндегі осы үшеуі ғана Құдай Патшалығы үшін қызметтестерім болып жүр; бұлар маған нағыз жұбаныш."},
	{12, "12 Мәсіх Исаның қызметшісі әрі сендердің жерлестерің — Епафрас та сәлем айтып отыр. Ол сендердің рухани жағынан жетіліп, берік сеніммен Құдайдың бүкіл еркін орындауларың үшін үздіксіз мінажат етіп күресуде."},
	{13, "13 Оның сендерді және Лаудіки мен Иераполдағы бауырластарды қатты уайымдап жүргеніне куәмін."},
	{14, "14 Сүйікті дәрігер Лұқа да, Димас та сәлем жолдайды."},
	{15, "15 Лаудікидегі бауырластарымызға, әсіресе Нүмфан мен оның үйінде жиналатын қауымға, сәлем айтыңдар."},
	{16, "16 Сендер осы хатты оқып болған соң, оны әрі қарай Лаудікидегі қауымға беріңдер, оларға жазған хатымды да оқыңдар."},
	{17, "17 Арқыпқа: Иеміз саған міндеттеген қызметіңді адал атқаруға ықылас сал! деген сәлемімізді жеткізіңдер."},
	{18, "18 Енді мен, Пауыл, сендерге өз қолыммен сәлем жазып отырмын. Бұғауда екенімді естеріңде ұстаңдар! Лайым Құдай сендерге жар болып, рақымын жаудыра көрсін! (Аумин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};