#include <map>
#include <string>
class Bible48
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Ғалатия өлкесіндегі сенушілер қауымдарына Пауыл елшіден және қасымдағы барлық бауырластардан дұғай сәлем. Ал мені елшілікке тағайындаған — адам баласы емес, Иса Мәсіх және Оны өлімнен қайта тірілтіп алған Құдай Әкеміз."},
	{2, "3 Сендерге Құдай Әкеміз бен Иеміз Иса Мәсіх рақымын жаудырып, тыныштық сыйлай берсін!"},
	{3, "4 Иса Мәсіх бізді қазіргі зұлым дүниенің құлдығынан құтқару үшін Құдай Әкеміздің еркі бойынша күнәларымыздың құнын өтеп жанын құрбан етті."},
	{4, "5 Құдайдың ұлылығы мәңгі мадақтала берсін! Аумин."},
	{5, "6 Сендерді Мәсіхтің рақымы арқылы Өзіне шақырған Тәңір Иеден осылай тез бас тартып, өзге бір ізгі хабарға бет бұрып кеткендеріңе таңғаламын."},
	{6, "7 Дегенмен өзге ізгі хабар жоқ! Мәселе сендерді шатастырып, Мәсіх туралы Ізгі хабарды бұрмалағысы келген кейбір кісілерде болып тұр."},
	{7, "8 Егер біздер немесе тіпті көктен түскен періште сендерге бұрын уағыздағандарымызға қайшы өзге бір ізгі хабарды уағыздайтын болсақ, онда солай істегенімізді Құдайдың қарғысы атпақ."},
	{8, "9 Бұрын айтқанымызды тағы қайталаймын: біреу сендерге өздерің қабылдаған Ізгі хабарға қайшы келетінді таратып жүрсе, оны Құдайдың қарғысы атпақ!"},
	{9, "10 Ал енді, мен мұны адамға не Құдайға жағу үшін айтып отырмын ба? Жоқ, мен адамдарға ұнауға тырыспаймын, әйтпесе Мәсіхтің қызметшісі бола алмас едім."},
	{10, "11 Бауырластар, сендерге мынаны білдіргім келеді: мен уағыздаған Ізгі хабар адам ойынан шыққан емес!"},
	{11, "12 Оны ешбір адамнан не қабылдаған, не үйренген емеспін, Иса Мәсіхтің тікелей білдіруімен қабылдадым."},
	{12, "13 Сендер менің яһуди діні мен дәстүрлерін бұрын қалай ұстанғанымды естігенсіңдер: Құдайдың қауымын шектен тыс қудалап жүріп, құртуға тырыстым."},
	{13, "14 Мен яһуди дінін ұстануда ұлтымның ішіндегі көптеген құрдастарымнан озып, ата-бабаларымыздан мирас қалған салт-дәстүрлерді қызу жақтап, қатаң ұстанушы болдым."},
	{14, "15 Бірақ Құдай мені анамның құрсағында жатқанда-ақ таңдап, Өзінің зор рақымымен шақырып алды. Содан Ол маған өз қалауымен"},
	{15, "16 Исаның Өзінің рухани Ұлы екендігін ашып білдіріп, Ол туралы Ізгі хабарды яһудилерден басқа халықтардың арасына таратуға бұйырды. Сонда мен осы жайлы ешбір адамнан ақыл сұраған жоқпын,"},
	{16, "17 әрі Иерусалимге барып, менен бұрын елші болғандармен де ақылдасқан емеспін. Қайта, ешқайда соқпастан, Арабия еліне тура аттанып, сол жақтан Дамаскіге қайтып келдім."},
	{17, "18 Үш жылдан кейін ғана Петір елшімен танысу үшін Иерусалим қаласына бардым. Оның қасында он бес күн болдым."},
	{18, "19 Сол кезде басқа елшілердің ешқайсысын көрмедім, тек Иеміз Исаның туған інісі Жақыппен ғана кездестім."},
	{19, "20 Құдай куә, бұл жазып отырғандарым өтірік емес."},
	{20, "21 Содан кейін Сирия мен Кіликия өлкелеріне бардым."},
	{21, "22 Ал Яһудея аймағындағы Мәсіхке сенушілердің қауымдары мені әлі де жүзбе-жүз танымайтын."},
	{22, "23 Олар тек: Бізді бұрын қудалаған адам өзі түп-тамырымен құртпақ болған сенімді қазір уағыздап жүр дегенді естіді."},
	{23, "24 Содан олар мені тәубеге келтіргендігі үшін Құдайды мадақтады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Он төрт жылдан кейін мен тағы да Иерусалимге аттандым. Бұл жолы Барнабамен бірге барып, Титті де ертіп алдым."},
	{2, "2 Осы сапарға Иеміздің тікелей білдіруімен шықтым. Иерусалимде мен, әсіресе, қауымның беделді кісілерімен жеке сөйлесіп, оларға өзім басқа ұлт адамдарына уағыздап жүрген Ізгі хабардың мазмұнын айтып бердім. Ондағы мақсатым қазіргі әрі бұрынғы еңбектерімнің зая кетпеуі еді."},
	{3, "3 Ал менің уағыздарыммен бұлардың келіскендері сондай, қасымдағы Титтің грек болғандығына қарамастан, олар оның сүндеттелуін талап етпеді."},
	{4, "4 Мұны екіжүзділікпен кіріп кеткен жалған бауырластар ғана талап етті. Олар Иса Мәсіхтің жолындағы біздің рухани еркіндігіміздің ізіне түсіп, Таурат заңына бағындыру үшін қауымдарға ұрланып еніп алған еді."},
	{5, "5 Алайда біз оларға бір сәтке де көніп, бағынған емеспіз. Өйткені Ізгі хабардың шындығын сендерге тап-таза күйінде қалдыруды көздедік."},
	{6, "6 Ал беделділерге келсек, беделдерінің қандай екені мен үшін онша маңызды емес, Құдай адамның бет-жүзіне қарамайды ғой: олар маған ерекше міндеттер жүктеген жоқ."},
	{7, "7 Керісінше, Ізгі хабарды яһуди халқына уағыздау Петірге қалай тапсырылған болса, Ізгі хабарды басқа халықтарға уағыздаудың маған да солай аманатталғандығына көздері жетті."},
	{8, "8 Өйткені Петірдің яһудилер арасындағы елшілік қызметін қолдаған Құдай менің басқа халықтар арасындағы қызметіме де жар болды."},
	{9, "9 Қауымның тіректері деп саналатын Жақып, Петір және Жохан Құдайдың маған берген рухани дарынын мойындап, менімен және Барнабамен қол алысып, қатынасымызды бекіттік. Сонымен біз Ізгі хабарды басқа халықтарға, ал олар оны яһуди халқына алып барсын деп келістік."},
	{10, "10 Олар бізден тек қана мұқтаж сенушілерге көмектесуді ұмытпауымызды өтінді. Ал мен дәл осыны істеуге зор ынтамен ұмтылып келемін."},
	{11, "11 Бірақ Петір Антақияға келген соң, оған ашық қарсы шығуым қажет болды. Өйткені оның қылығы айыптауға тұрарлық еді:"},
	{12, "12 алғашқыда Петір сүндеттелмеген басқа ұлттық сенушілермен дастарқандас болып жүрген еді. Алайда (Иерусалимдегі қауымның жетекшісі) Жақыптан бірқатар яһудилер келгеннен кейін, Петір басқа ұлттық сенушілерден тартыншақтап, алшақтай бастады. Себебі ол сүндеттеуді талап ететін әлгі яһудилер жақтырмай жүрер деп қаймықты."},
	{13, "13 Петірмен бірге қауымдағы басқа яһудилер де сондай тұрақсыздық танытты. Тіпті Барнаба да оларға еріп адасып кетті."},
	{14, "14 Мен солардың Ізгі хабардың шындық жолынан тайып кеткендіктерін көргенде, бәрінің алдында Петірге тіл қатып былай дедім: Сіз яһуди болсаңыз да, яһудилердің дәстүрлерін орындамай, бірге тұрған басқа ұлттық сенушілер сияқты өмір сүріп келдіңіз. Енді қалайша бұл сенушілерді яһуди дәстүрлерін ұстануға зорламақсыз?!"},
	{15, "15 Яһуди болып туған біздер басқа ұлттық күнәкарлар болмасақ та,"},
	{16, "16 адамдардың Таурат заңын ұстану арқылы емес, тек Иса Мәсіхке деген сенімдерімен ғана Құдай алдында ақталатынын білеміз. Сондықтан біз де Таурат заңын орындаудың арқасында емес, Мәсіхке сенуіміз арқылы ақталу үшін сенімімізді Мәсіх Исаға арттық. Себебі заңды орындаумен ешбір адам ақтала алмайды."},
	{17, "17 Егер Мәсіхтің арқасында ақталғымыз келген біз (яһуди дәстүрлерін ұстанбағанымыз үшін) әлі де күнәкар болып есептелсек, онда Мәсіхке деген сенімнің бізді бәрібір күнәлі жағдайымызда қалдырғаны емес пе? Жоқ, мүлдем олай емес!"},
	{18, "18 Себебі Таурат заңын орындау арқылы ақталамыз деген пікірді жойып келген мен оны қайтадан қалпына келтірсем, онда өзімді заң бұзушы күнәкар етіп көрсеткен болар едім."},
	{19, "19 Адам өлгенде заңға бағынудан босайтыны сияқты, мен де Таурат заңы бойынша өлімге кесіліп, сол заңды орындаудан босатылдым. Ондағы мақсат — менің Құдай үшін өмір сүруім. Мен рухани жағынан Мәсіхпен бірге айқышқа шегеленіп өлдім,"},
	{20, "20 сондықтан өзім бұдан былай өмір сүріп жатқаным жоқ, қайта, бойымда Мәсіх өмір сүруде. Ендігі тәндік өмірім — Құдайдың рухани Ұлына деген сенімімнің арқасындағы өмір. Ол мені сүйгендіктен, Өзін мен үшін құрбан етті!"},
	{21, "21 Осылайша Құдайдың рақымын жоққа шығармай, соған ғана сүйенемін. Себебі егер Таурат заңын орындау арқылы ақтала алсақ, онда Мәсіхтің Өзін өлімге қиғаны бекер болғаны!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 О, түйсіксіз аңқау ғалаттықтар-ай, сендерді біреу сиқырлап қойды ма? Иса Мәсіхтің айқыштағы өлімін көз алдарыңнан кетпестей етіп суреттеп беріп едім ғой!"},
	{2, "2 Маған мынаны ғана айтыңдаршы, Киелі Рухты қалай қабылдадыңдар: Таурат заңын орындау арқылы ма, әлде Ізгі хабарды тыңдап, сену арқылы ма?"},
	{3, "3 Сондай түйсіксіз бе едіңдер: рухани өмірді Киелі Рухпен бастап, өз күштеріңмен кемелденбек екенсіңдер ғой?"},
	{4, "4 Сонда қалай, бастарыңнан өткізгендеріңнің бәрі бекер болғаны ма? Ол шынымен бекер болмады, солай емес пе?"},
	{5, "5 Құдайдың сендерге өз Рухын беріп, араларыңда керемет істер жасағанының себебі — Таурат заңын орындауларың ба, әлде Ізгі хабарды тыңдап, сенулерің бе?"},
	{6, "6 Ыбырайыммен де солай болды: ол Құдайға сенді, сондықтан Оның алдында ақталды."},
	{7, "7 Көздерің жетіп тұр: Тәңір Иеге сенім артқандар ғана — Ыбырайымның нағыз ұрпақтары."},
	{8, "8 Киелі жазбалар Құдайдың басқа ұлттарды сенім арқылы ақтайтынын алдын ала білдірді. Ол Ыбырайымға: Сен арқылы Мен барлық ұлттарды жарылқаймын деген Ізгі хабарды мәлімдеді."},
	{9, "9 Сондықтан Тәңір Иеге сенім артқандар ежелде Оған сенген Ыбырайым арқылы жарылқанады."},
	{10, "10 Ал өздерінің Таурат заңын ұстанғандарына сүйенушілердің бәріне қарғыс тиеді! Сол туралы мынадай сөздер жазылған: Таурат заңының кітабындағы барлық ережелерді сақтап орындамағанды қарғыс атады!"},
	{11, "11 Ендеше Таурат заңын орындаған ешкімнің сол арқылы Құдай алдында ақтала алмайтыны анық. Өйткені сенімі арқылы ақталған адам шынайы өмірге ие болады."},
	{12, "12 Осы сенім жолы Таурат заңының жолынан өзгеше: соның ережелерін бұлжытпай орындайтын адам солар арқылы өмір сүреді."},
	{13, "13 Алайда айқыш ағашқа шегеленіп ілінген кезде Мәсіх бізге тиісті қарғысты Өз мойнына алып, бізді Таурат заңы мәлімдеген қарғыстан құтқарды! Себебі Тауратта ағашқа ілінген әркім Құдайдың қарғысына ұшырап тұрады деп жазылған."},
	{14, "14 Осылайша Құдай Ыбырайымға уәде еткен ақ батаны Иса Мәсіх арқылы басқа ұлттарға да берді. Енді Мәсіхке сенген бәріміз уәделенген Киелі Рухты сенім арқылы қабылдаймыз."},
	{15, "15 Қымбатты бауырластар, күнделікті өмірден мысал келтірейін: бекітілген келісімнің күшін жоюға немесе оған бір нәрсе қосуға болмайды. Бұл жерде де солай:"},
	{16, "16 Тәңір Ие уәдесін Ыбырайымға және оның ұрпағына берді. Ол ұрпақтарыңа деп көпше түрде емес, ұрпағыңа деп жекеше түрде айтты. Ұрпағың Біреуді білдіреді, Ол — Мәсіх."},
	{17, "17 Айтайын дегенім мынау: төрт жүз отыз жылдан кейін берілген Таурат заңы Құдай бұрын бекіткен Келісімнің күшін, яғни Оның Ыбырайымға Мәсіх жөнінде берген уәдесінің күшін, жоя алмайды!"},
	{18, "18 Себебі егер мұрагерлік Таурат заңына байланысты болса, онда ол уәде арқылы берілмес еді. Алайда Құдай мұраны Ыбырайымға рақыммен уәде етті."},
	{19, "19 Онда Таурат заңының атқаратын қызметі қандай? Ол күнәларды әшкерелеу үшін қосымша ретінде берілді. Тәңірдің уәдесі Ыбырайымның Ұрпағы Мәсіхке байланысты; Ол келгенше, Таурат заңы күшінде тұрды. Періштелер мұны халыққа арада жүрген Мұса пайғамбар арқылы жеткізген еді."},
	{20, "20 Ал жалғыз біреу іс жүргізетін болса, онда арада жүрушінің керегі жоқ: Ыбырайымға уәдені берген — Құдайдың жеке Өзі!"},
	{21, "21 Сонымен, Таурат заңы Құдайдың бұрын берген уәдесіне қайшы келіп тұр ма? Жоқ, мүлдем олай емес! Себебі егер мәңгілік өмірге қол жеткізетін заң берілген болса, онда адамдар оны орындап ақтала алар еді."},
	{22, "22 Алайда Киелі жазбалар бүкіл адамзаттың күнәнің тұтқынында екенін мәлімдейді. Ондағы мақсат — Иса Мәсіхке сену арқылы табыс етілетін уәделі сыйдың (яғни күнәдан ақталудың) тек сенетіндерге ғана берілуі."},
	{23, "23 Осы сенімнің заманы туып, келуге тиісті Мәсіхке сене алғанға дейін біз Таурат заңының бақылауында болып, тұтқынында жүрдік."},
	{24, "24 Басқаша айтқанда, Таурат заңы тәрбиелеушіміз болып бізді Мәсіхке әкелді, осылай Оған сеніп, ақталдық."},
	{25, "25 Ал енді, сенімнің заманы туғаннан бері тәрбиелеушінің қарамағынан шықтық."},
	{26, "26 Өйткені барлығың Иса Мәсіхке деген сенімдерің арқылы Құдайдың рухани баласысыңдар."},
	{27, "27 Мәсіхпен тығыз байланысып, шомылдыру рәсімінен өткен бәрің де Мәсіхтің рухани қасиеттеріне бөлендіңдер."},
	{28, "28 Бұл жерде яһуди мен басқа ұлт адамының, құл мен еріктінің, еркек пен әйелдің арасында айырмашылық жоқ, себебі барлығың Иса Мәсіхпен тығыз байланыста біртұтассыңдар."},
	{29, "29 Және сендер Мәсіхтікі болғандықтан, Ыбырайымның рухани ұрпағысыңдар, әрі Құдайдың оған уәде еткен игіліктерін иемденесіңдер."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Тағы айтпағым мынау: мұрагер болашақта барлық байлықты иемденуге қақылы болса да, балалық кезінде оның құлдан еш айырмашылығы жоқ."},
	{2, "2 Жас мұрагер әкесі белгілеген уақытқа дейін қамқоршылар мен үй басқарушылардың бақылауында."},
	{3, "3 Біз де рухани балалық шағымызда осы дүниедегі бастапқы діни ілімдердің құлдығында болдық."},
	{4, "4 Ал Құдай белгілеген уақыты жеткенде, Өзінің рухани Ұлын жіберді. Ол бір әйел арқылы дүниеге келіп, Таурат заңы үстемдік етіп тұрған халықтың арасында"},
	{5, "5 сол заңға бағынғандарды босатып, Өзінің рухани балалары ету үшін келді."},
	{6, "6 Енді біз рухани балалары болғандықтан, Құдай Өзінің рухани Ұлының Рухын жүрегімізге дарытты. Сол Рух бізді: Абба, Әке! — деп Құдайға сиындырады."},
	{7, "7 Сонымен енді құл емес, рухани ұлсың; ал рухани баласы болған соң, Құдай саған Өзінің уәде еткендерін сыйлайтын болады."},
	{8, "8 Сендер бұрын Құдайды әлі білмейтін кезде шынайы Тәңір емес жын-перілерге құл болып қызмет еттіңдер."},
	{9, "9 Ал енді Құдайды жақыннан танып алғаннан кейін, дұрысын айтқанда, Құдай сендерді танып, Өзімен жақын байланыста болуға шақырғаннан кейін, қалай ғана кері айналып, қайтадан әлсіз де бейшара, бастапқы діни ілімдерге бет бұрасыңдар? Соларға тағы да құл болып жүргілерің келе ме?"},
	{10, "10 Белгілі діни күндер мен айларды, мерекелер мен жылдарды берік ұстануда екенсіңдер."},
	{11, "11 Сендерге арнаған еңбегім зая кетті-ау деп уайымдаймын."},
	{12, "12 Бауырластарым, сендерден өтінемін: пайдасыз ережелерге бағынбай, мен сияқты болыңдар, мен де сендер сияқты болдым. Жеке басыма жамандық істеген жоқсыңдар."},
	{13, "13 Сендерге Ізгі хабарды алғаш рет жариялағанымда денсаулығымның нашар болғанын білесіңдер."},
	{14, "14 Бірақ та тәнімнің ауруынан жиреніп, теріс қарап кетпедіңдер. Керісінше, мені Құдайдың бір періштесіндей, тіпті Иса Мәсіхтің Өзіндей, қабылдадыңдар."},
	{15, "15 Бұрынғы риза көңілдеріңе не болды? Өзім мынаған куәмін: сол кезде, мүмкін болса, өз көздеріңді ойып алып, маған сыйлар едіңдер."},
	{16, "16 Ал қазір мен сендерге шындықты айтқаным үшін жау болып шықтым ба?"},
	{17, "17 Көңілдеріңнен шығуға ынталанғандардың ниеттері жақсы емес: олар сендерді бізден ажыратып, өздеріне құштар етіп қаратып алмақ."},
	{18, "18 Біреудің көңілінен шығуға ізгі ниетпен ынталану — жақсы нәрсе, бірақ бұл тек қастарыңда жүргенімде ғана емес, әрдайым болу керек."},
	{19, "19 Балаларым менің! Баласын туғанда толғақ азабын басынан кешкен анадай мен тағы да сендерді уайымдап қиналып жүрмін. Бұл, мінез-құлықтарыңнан Мәсіхтің болмысы толығырақ көрінгенше, жалғаса бермек."},
	{20, "20 Дәл қазір қастарыңда болып, сендермен жұмсақ үнмен сөйлессем шіркін! Себебі сендерді түсіне алмай жүрмін."},
	{21, "21 Таурат заңына бағынғысы келген сендер маған айтыңдаршы: Тауратта айтылғанды білмейсіңдер ме?"},
	{22, "22 Онда Ыбырайымның екі ұлы: біреуі күңінен, екіншісі ерікті әйелінен туғаны туралы жазылған."},
	{23, "23 Күңінің ұлы әдеттегідей туылса, ерікті әйелінің ұлы Құдайдың берген уәдесі бойынша кереметпен дүниеге келді."},
	{24, "24 Бұл әңгімеде астарлы мағына бар, екі әйел екі түрлі Келісімді білдіреді: біреуі — перзентін құлдықта туған Ажар, ол — Синай тауында жасалған Келісімнің бейнесі."},
	{25, "25 Ал Арабиядағы Синай тауын бейнелейтін Ажар қазіргі Иерусалимге де ұқсайды. Себебі ол қала өз халқымен әлі де Таурат заңының құлдығында."},
	{26, "26 Бірақ көктегі Иерусалим ерікті, біздің рухани анамыз — сол!"},
	{27, "27 Бұған байланысты Пайғамбарлар жазбаларында: Қуан, уа, құрсақ көтермейтін, бала сүймеген әйел, шаттана ән шырқа! Иә, толғатып көрмеген сен, масаттанып дауыста! Өйткені күйеуі бардан гөрі жалғыз басты әйелдің балалары енді көбірек болады! — деп алдын ала айтылған."},
	{28, "28 Уәде бойынша дүниеге келген Ысқақ іспетті біздер де, уа, бауырластарым, Құдайдың уәдесіне сай Оның қайта туылған рухани балаларымыз. Себебі Ыбырайымның Тәңір Иеге сенгеніндей, біз де Оған сенеміз."},
	{29, "29 Ал әдеттегідей жолмен дүниеге келген бала сол заманда Құдай Рухы дарытқан қабілетпен туған баланы қудалады. Сол сияқты, қазір де құлдықта жүрген яһудилер Киелі Рухтан қайта туылған біздерді қудалауда."},
	{30, "30 Тауратта не делінген? Онда мынадай сөздер бар: Күңді баласымен бірге қуып жібер! Күңнің ұлы ерікті әйелдің ұлымен бірдей мұраға ие болмасын!"},
	{31, "31 Ендеше, бауырластар, біздер күңнің емес, ерікті әйелдің ұрпағымыз!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Мәсіх бізді еркін өмір сүрсін деп азат етті. Енді табанды болып, құлдықтың қамытын қайта кимеңдер!"},
	{2, "2 Мен, Пауыл, сендерге мынаны айтамын, сөзіме ден қойыңдар: егер Құдай алдында ақталу үшін сүндетке отырсаңдар, онда сендерге Мәсіхтен ешбір пайда болмайды."},
	{3, "3 Сүндетке отыратындардың әрбіреуіне тағы да байыппен айтамын: ақталу үшін сүндеттелген әркім Таурат заңының барлық ережелерін де бұлжытпай орындауға міндетті!"},
	{4, "4 Осы заңды ұстану арқылы ақталуға тырыссаңдар, онда Мәсіхпен байланыстарың үзілді! Сендер Құдайдың рақымынан ада болдыңдар!"},
	{5, "5 Ал біз сенім жолымен Құдай алдында ақталғандықтан, мұның Мәсіх қайта оралғанда ашық жариялануын Киелі Рухтың арқасында үміт етіп күтудеміз."},
	{6, "6 Иса Мәсіхпен тығыз байланыста болғандар үшін сүндеттелу не сүндеттелмеу маңызды емес. Біз үшін ең маңыздысы — сүйіспеншілікпен әрекет жасайтын сенім."},
	{7, "7 Жақсы жүріп бара жатыр едіңдер. Енді кім жолдарыңа бөгеу болып, сендерді шындыққа мойынсұнудан бас тартқызады?"},
	{8, "8 Бұған иландырған — сендерді Өзіне шақырған Құдай емес."},
	{9, "9 Бір құмалақ бір қарын майды шірітеді дейді. (Сол сияқты, жалған ілімдер көп зиян келтіреді.)"},
	{10, "10 Бұдан былай Иеміз сендерді Ізгі хабардан басқа пікірлерді ұстанудан сақтайды деп сенемін. Сендерді абыржытып, адастырып жүрген адам, кім болса, ол болсын, өз сазайын тартатын болады."},
	{11, "11 Ал маған келсек, бауырластар: егер мен (біреулер айтқандай) әлі де сүндеттелудің қажеттігін уағыздап жүрген болсам, неге күні бүгінге дейін қудаланудамын? Сонда Мәсіхтің айқышта жанын құрбан еткені туралы уағыздарым яһуди діндарларының ашуын қоздырмас еді ғой."},
	{12, "12 Мазаларыңды алып жүргендер қауымдарыңнан біржола кетіп қалса етті!"},
	{13, "13 Бауырластар, Құдай сендерді еркіндікке шақырды. Бірақ еркіндікті күнәлі құмарлықтарыңды қанағаттандыру үшін теріс пайдаланбаңдар, қайта, бір-біріңе сүйіспеншілікпен қызмет етіңдер!"},
	{14, "14 Бүкіл Таурат заңын орындау мына бір бұйрыққа саяды: Өзіңді қалай сүйсең, маңайыңдағы адамды да солай сүй!"},
	{15, "15 Ал егер бір-біріңді қауып, жесеңдер, жойылып кетуден сақ болыңдар!"},
	{16, "16 Ал мен былай деймін: Киелі Рухтың күші мен жетегінде өмір сүріңдер, сонда ескі күнәкар болмыстарыңның қалауы іске аспайды."},
	{17, "17 Өйткені ескі болмысымыздың қалауы Киелі Рухқа қарсы, әрі Рухтың қалауы ескі болмысымызға қарсы. Бұл екеуі бір-біріне қарама-қайшы, сондықтан игі ниеттеріңді жүзеге асыра алмайсыңдар."},
	{18, "18 Ал егер Киелі Рухтың жетелеуімен жүрсеңдер, онда Таурат заңының билігі сендерге жүрмейді."},
	{19, "19 Ескі күнәкар болмысымыздан туындайтын қылықтар белгілі, бұлар: неке адалдығын бұзу, азғындық және ұстамсыздық;"},
	{20, "20 жалған тәңірлерге табынушылық пен сиқыршылық; қаскөйлік, ұрыс-керіс, қызғаныш, ашу-ыза, жеке бастың абыройын ойлау, алауыздық туғызу, жік салу,"},
	{21, "21 күншілдік, кісі өлтіру, маскүнемдік, жүгенсіздік және сол сияқтылар. Бұлар жайлы сендерге былай деп ескертемін, бұрын да ескерткенмін: мұндаймен айналысатындарға Құдайдың Патшалығында орын жоқ."},
	{22, "22 Ал Киелі Рух өмірлеріңде жетілдіретін игілікті жеміс мынадай: сүйіспеншілік, қуаныш, тыныштық, шыдамдылық, қайырымдылық, кеңпейілділік, сенімділік,"},
	{23, "23 ілтипаттылық, ұстамдылық. Ешбір заң бұларға қарсы тұрмайды."},
	{24, "24 Сонымен қатар Иса Мәсіхтікі болғандар айқыш ағашта өлген Онымен бірігіп кетті. Сол себептен олар өздерінің ескі күнәкар болмыстарын және соның азғын құмарлықтары мен тілектерін сол айқыш ағашқа шегелеп тастағандай таза өмір сүреді."},
	{25, "25 Біз Киелі Рухтың арқасында жаңа өмірге ие болғандай, Оның жетекшілігімен өмір сүре берейік."},
	{26, "26 Жеке басымызды қастерлеп, бір-бірімізді ашуландырып, күндеуге жол бермейік!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 Бауырластар, араларыңдағы біреу күнә жасап қойса, сендер оны Киелі Рухтың жетелеуімен ілтипаттылық танытып түзу жолға қайтаруға ұмтылыңдар. Ал өздерің де азғырылудан сақ болыңдар!"},
	{2, "2 Біріңнің ауыр жүгіңді екіншің көтерісіңдер! Сөйтіп Мәсіхтің өсиетін орындайсыңдар."},
	{3, "3 Кімде-кім шын мәнінде өзгелерден артық болмай тұрып, ерекшемін деп көкірегін көтеріп, көмектесуден бас тартса, сол өзін-өзі алдайды."},
	{4, "4 Әркім өз іс-әрекетін тексерсін, сонда өзін басқалармен салыстырмай, жетістіктерін мақтан ете алады."},
	{5, "5 Өйткені әр адам өз міндетін атқаруға тиіс."},
	{6, "6 Құдай сөзінен тәлім алушылар қолда бар игіліктерін ұстаздарымен бөліссін!"},
	{7, "7 Алданбаңдар: Құдай адамның Оны елемей, өз бетімен жүруіне жол бермейді. Адам не ексе, соны орады дейді."},
	{8, "8 Өзінің ескі күнәкар болмысын қанағаттандырушы сол болмысқа тән өлімді орады. Ал Құдайдың Рухына қызмет етуші осы Рухқа тән мәңгілік өмірді орады."},
	{9, "9 Жақсылық жасаудан талмайық! Себебі бұдан шаршап, бас тартпасақ, тиісті уақытта оның игілікті өнімін Құдайдан қабылдайтын боламыз."},
	{10, "10 Сондықтан мүмкіндік барда барлық адамдарға, әсіресе сенімі бір бауырластарымызға, жақсылық істей берейік!"},
	{11, "11 Енді сендерге өз қолыммен, үлкен әріптермен жазып отырғандарыма қараңдар!"},
	{12, "12 Адамдарға ұнағысы келетіндер сендерді сүндетке отыруға мәжбүр етпек. Олардың мақсаты — яһуди діндарлардың өздерін Мәсіхтің айқыштағы құрбандығы арқылы ақталамыз деген Ізгі хабар үшін қудаламаулары ғана."},
	{13, "13 Өйткені сүндеттелгендердің өздері Таурат заңын орындамайды, тек тәндеріңе жасаған сол рәсімге мақтанулары үшін сендердің сүндетке отыруларыңды қалайды."},
	{14, "14 Мен болсам, Иеміз Иса Мәсіхтің айқыштағы өлімінен басқа еш нәрсеге де мақтанбай-ақ қояйын. Себебі Оның айқыштағы құрбандығының салдарынан осы күнәкар дүние мен үшін, ал мен ол үшін жоқпын."},
	{15, "15 Енді сүндеттелу мен сүндеттелмеуде тұрған ештеңе жоқ, мәселе Құдайдың адамды жаңадан жаратуында."},
	{16, "16 Осы ережемен өмір сүргісі келетіндердің бәріне, яғни Құдайдың рухани Исраил халқына, тыныштық пен қайырымдылық болсын!"},
	{17, "17 Бұдан былай маған ешқайсыларың осы мәселемен ауыртпалық түсірмеңдер. Иеміз Исаның таңбасы ретінде денемдегі жараларымның орындары Оның басыбайлы қызметшісі екенімді білдіреді."},
	{18, "18 Лайым жан дүниелерің Иеміз Иса Мәсіхтің рақымына кенеле берсін, бауырластарым! Аумин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};