#include <map>
#include <string>
class Bible64
{
	struct kk1	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Ақсақалдан өзі шын жүректен жақсы көретін қымбатты Гайға дұғай сәлем!"},
	{2, "2 Сүйікті бауырым! Сенің рухани өміріңнің сау болғанындай, саған барлық жағынан да Құдайдан игілік пен денсаулық тілеймін."},
	{3, "3 Кейбір бауырластар келіп, сенің шындыққа адал болып, үнемі шындық жолымен жүріп келе жатқаныңды хабарлағанда, мен қатты қуандым."},
	{4, "4 Рухани балаларымның шындық жолымен жүріп жатқанын естуден артық маған қуаныш жоқ."},
	{5, "5 Сүйікті бауырым, сендерге сапарлап келген бауырластарымыз өзіңе таныс болмаса да, оларға демеу болып дұрыс істеп жүрсің."},
	{6, "6 Олар осындағы қауым алдында сенің сүйіспеншілігіңе куәгер болды. Мұндайларды Құдайдың адамдарына лайық түрде жолға жабдықтап, шығарып салсаң, игі болады."},
	{7, "7 Себебі олар бұл сапарға Оның атын таныту үшін шықты және Оған сенбейтіндерден ешқандай жәрдем алмайды."},
	{8, "8 Сондықтан осындай кісілерді қолдау — біздің міндетіміз; шындықты таратуға осылай үлесімізді қосамыз."},
	{9, "9 Мен қауымға жазып жібердім, бірақ олардың басшысы болуға тырысып жүрген Диотреф бізді мойындамайды."},
	{10, "10 Сондықтан барған кезде оның істегендерінің бәрін есіне саламын: ол бізді жаман сөзбен өсектеп жүр; ал соған да қанағаттанбай, сапармен келген бауырластарымызды өзі де қабылдамайды, басқаларға да қабылдатпайды. Оларды қарсы алғандарды тіпті қауымнан шығарып тастайды."},
	{11, "11 Сүйікті бауырым, жамандыққа еліктемей, жақсылыққа елікте! Жақсылық істейтін адам Құдайдікі, ал жамандық жасаушы Құдайды білмейді."},
	{12, "12 Деметір туралы елдің бәрі жақсы пікір айтады. Ол шындыққа сай әрекет жасайды. Біз де соған куәлік етіп жүрміз, ал сендер шындықты айтатынымызды білесіңдер."},
	{13, "13 Саған әлі де көп нәрсе жазуым керек еді, бірақ оны жазғым келмейді."},
	{14, "14 Сені жақын арада көретін шығармын деген үмітім бар, сонда екеуіміз ауызба-ауыз сөйлесеміз."},
	{15, "15 Саған амандық пен тыныштық болсын! Бұл жақтағы достарың сәлем айтып жатыр. Сол жақтағы достардың бас-басына сәлем айт!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};