#include <map>
#include <string>
class Bible57
{
	struct kk1	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Мәсіх Исаға арнаған қызметім үшін түрмеде отырған Пауылдан және бауырласымыз Тімотеден сүйікті қызметтесіміз Філимонға,"},
	{2, "2 сондай-ақ бауырласымыз Әпияға, бізбен бірге Ізгі хабар үшін жан сала қызмет етіп жүрген Арқыпқа және Філимонның үйінде жиналатын қауымға дұғай сәлем."},
	{3, "3 Құдай Әкеміз және Иеміз Иса Мәсіх сендерге рақымын жаудырып, тыныштық сыйлай көрсін!"},
	{4, "4 Мен Құдайға сиынып сені есіме түсіргенде әрдайым шүкірлік етемін."},
	{5, "5 Өйткені Иеміз Исаға деген сенімің және Тәңір Иенің барлық адамдарына көрсеткен сүйіспеншілігің туралы естідім."},
	{6, "6 Мәсіхке деген сенімің және Құдайдың бәрімізге берген күллі игіліктерін түсінуің арқылы басқа сенушілермен байланысың Мәсіхтің даңқын асыруға әсерлі болсын деп мінажат етемін."},
	{7, "7 Сенің сүйіспеншілігіңнен зор қуаныш пен жұбаныш таптық, өйткені сен, бауырым, Құдайдың адамдарының жүректерін орнықтырып келесің."},
	{8, "8 Сондықтан Мәсіхтің елшісі ретінде керек істі саған бұйыруға батылым барса да,"},
	{9, "9 сүйіспеншілігіңе бола өтініп сұраймын. Иә, басқа біреу емес, мен — Пауыл қария, Мәсіх Исаға қызмет еткенім үшін қазір түрмеде отырған менің өзім,"},
	{10, "10 сенен ұлым жайында өтінемін. Мен осында тұтқында отырып, оған Ізгі хабарды айтып берген едім. Қайта туылып, рухани ұлыма айналған сол жан — Онисым (Пайдалы)."},
	{11, "11 Ол өткен кезеңде сен үшін пайдасыз болғанмен, енді маған да, саған да пайдалы. Оны өзіңе қайтарып отырмын,"},
	{12, "12 ал онымен бірге өз жүрегімді жіберіп отырғандаймын!"},
	{13, "13 Ізгі хабарға бола түрмеге қамалған мен оны сенің орныңда өзіме көмектесу үшін қарамағымда қалдыруды ойлаған едім."},
	{14, "14 Алайда жақсылық жасауың мәжбүрліктен емес, өз еркіңмен болсын деп, сенің келісіміңсіз ешбір шешім қабылдағым келмеді."},
	{15, "15 Мүмкін, оның уақытша сенен алшақтағанының мақсаты — оны мәңгілікке қабылдауың шығар."},
	{16, "16 Ал қазір ол құлың ғана емес, одан әлдеқайда жоғары — сүйікті бауырласың ретінде өзіңе қайта оралады. Ол мен үшін дәл сондай, ал сен үшін адам ретінде де, Иемізбен жүрген бауырласың ретінде де одан бетер жақын болады."},
	{17, "17 Сондықтан маған шынымен дос болсаң, оны мені қабылдағандай қабылдағайсың."},
	{18, "18 Ал егер ол саған жамандық жасаған не қарыздар болса, онысын менің мойнымда деп есепте."},
	{19, "19 Мен, Пауыл, өз қолыммен жазып отырмын: онысын өзім өтеймін! Алайда сенің өзіңнің рухани өмірің үшін маған қарыздар екеніңді айтпай-ақ қояйын."},
	{20, "20 Сонымен, бауырласым, Иеміз Мәсіх үшін маған осылай бір жақсылық етіп, Оған деген сүйіспеншілігің арқылы менің жүрегімді орнықтыршы."},
	{21, "21 Сен құлақ асар деп үміттеніп, айтқанымнан да артық орындайтыныңды біле отырып, осыны жаздым."},
	{22, "22 Сонымен бірге маған баспана дайындағайсың. Құдай мінажаттарыңа мейіріммен құлақ асып, Мені сендерге жіберер деп үміттенемін."},
	{23, "23 Мәсіх Исаға қызмет еткені үшін менімен бірге бұғауда отырған Епафрас"},
	{24, "24 әрі өзге қызметтестерім Марқа, Арыстарқ, Димас, Лұқа да саған сәлем жолдауда."},
	{25, "25 Лайым жан дүниелерің Иеміз Иса Мәсіхтің рақымына кенеле берсін!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};