#include <map>
#include <string>
class Bible32
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Жаратқан Ие Аматтай ұлы Жүніске сөзін арнап:"},
	{2, "2 Жолға жиналып, ұлы қала Ниневиге бар да, оны соттамақ екенімді жарияла! Олардың зұлым қылықтары Менің көз алдымда, — деп тапсырды."},
	{3, "3 Сонда Жүніс жолға жиналды. Алайда ол Жаратқан Иенің назарынан алысқа, Тарсис қаласына қашып кетуге бел буды. Содан Жүніс Яффа қаласына ылдилап барып, сол жерден Тарсиске аттанғалы тұрған кемені іздеп тапты. Ол жолақысын төлеп, кемеге отырып, Жаратқан Иеден жасырынып қалу үшін Тарсиске қарай жүзіп кетті."},
	{4, "4 Бірақ Жаратқан Ие теңізге қатты жел жіберіп, сұрапыл дауыл тұрғызды. Кемеге қирау қаупі төнді."},
	{5, "5 Теңізшілер үрейленіп, әрқайсысы өзі табынатын тәңіріне жалбарына сиынды. Олар кеменің салмағын жеңілдетіп, қауіпті азайту үшін жүктерді суға лақтыра бастады. Бұл кезде Жүніс кеменің төменгі қабатына түсіп, қатты ұйқыға кеткен болатын."},
	{6, "6 Кеме бастығы оған келіп: Әй, сен неғып ұйықтап жатырсың?! Тұрып, Тәңіріңе жалбарына сиын! Мүмкін, Тәңірің бізді ойына алып, ажалдан сақтап қалар, — деп бұйырды."},
	{7, "7 Теңізшілер өзара: Жеребе тастап, біздің осы пәлеге душар болғанымызға кімнің кінәлі екенін біліп алайық, — десті. Олар солай істегенде жеребе Жүніске түсті."},
	{8, "8 Теңізшілер оған: — Бізге айтып берші: осы апаттың басымызға түскеніне кім кінәлі? Кәсібің не? Қайдан келдің? Туған елің қайда? Қай ұлтсың? — деген сұрақтарды жаудырды. Жүніс:"},
	{9, "9 — Мен исраилдікпін. Көктегі Құдайды, яғни теңіз бен құрлықты жаратқан Тәңір Иені, қастерлеймін, — деп жауап қайырып,"},
	{10, "10 оларға өзінің Жаратқан Иеден қашып жүргенін ашық айтып берді. Сонда теңізшілердің зәрелері ұшып сасқалақтап, Жүніске: Неге бұлай істедің?! — деп қатты налыды."},
	{11, "11 Осы екі арада теңіз толқындары күшейген үстіне күшейе түсті. Сондықтан теңізшілер Жүніске: — Теңіздің тыншуы үшін саған не істеуіміз керек? — деген сауал қойды."},
	{12, "12 — Мені теңізге лақтырсаңдар, ол басылады. Өйткені осы сұрапыл дауылға ұшырап отырғандарың менің кесірімнен екенін білемін, — деп жауап берді Жүніс."},
	{13, "13 Алайда сол жігіттер бар күштерімен есе беріп, кемені жағаға жеткізуге тырысты. Бірақ дауыл долданып, күшейе түсіп, еңбектері зая кетті."},
	{14, "14 Сондықтан олар Жаратқан Иеге жалбарына сиынып: — Уа, Жаратқан Ие, мына адамның жанын алуың үшін бізді де ажалға бұйыра көрме! Ал егер ол кінәсіз болса, қанын біздің мойнымызға жүктей көрме! Себебі Сен, Жаратқан Ие, осыны өз қалауыңа сай істедің, — деді."},
	{15, "15 Содан теңізшілер Жүністі көтеріп алып, теңізге лақтырып жіберді. Сонда буырқанып тұрған теңіз тыныштала қалды."},
	{16, "16 Бұдан сол адамдардың зәрелері ұшып, Жаратқан Иеден қатты қорықты. Олар Жаратқан Иеге арнап құрбандық шалып, бұдан былай Оны қастерлеуге ант берді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Жаратқан Иенің бұйрығымен бір үлкен балық Жүністі жұтып қойды. Ол соның ішінде үш күн, үш түн бойы жатты."},
	{2, "2 Жүніс балық ішінен Құдай Иесіне сиынып былай деп мінажат етті:"},
	{3, "3 Қиын-қыстау кезімде, уа, Жаратқан Ием, Саған сиындым, жауап бердің де Сен. Сонда тұңғиықтың терең түкпірінен Көмек сұрап саған жалбарынған ем, Шақырған даусыма құлақ салдың да Сен."},
	{4, "4 Мені тұңғиыққа, терең теңіздің Түбіне Сен лақтырған едің, Айналам түгел тек ағыстар болған, Соққылап қарқынды толқындарыңның Барлығы да өтті мына басымнан."},
	{5, "5 Былай деп те айтқан болатынмын: Аластатылсам да көз алдыңнан, Киелі үйіңе қарамақпын қайтадан."},
	{6, "6 Су басып, теңіз тартып құшағына Қорқытты, балдырлар оралып басыма."},
	{7, "7 Су асты, тау түбіне түсіп қалдым, Сол жерге мәңгі қамалғандай болдым. Бірақ Сен, Жаратқан Ие, Құдайым, Жанымды тұңғиықтан алып қалдың."},
	{8, "8 Көңілім құлазып, үміт өшкенде, Уа, Тәңір Ием, Сені алдым есіме, Мінажатым құлағыңа жетті де Сенің көктегі киелі үйіңде."},
	{9, "9 Жарамсыз да жалған тәңірлерге Табынушылар безеді өздеріне Рақым көрсетпек болған Құдайынан."},
	{10, "10 Ал мен Саған әнмен шүкірлік айтам, Сый-тарту ұсынып, антымда тұрам. Құтқарылу келеді тек Жаратқаннан!"},
	{11, "11 Мұнан кейін Жаратқан Иенің бұйрығы бойынша балық Жүністі жағалауға құсып тастады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Содан соң Жаратқан Ие Жүніске екінші рет сөзін арнап:"},
	{2, "2 Сапарға жиналып, ұлы қала Ниневиге бар! Менің өзіңе айтқан хабарымды халыққа жарияла! деп тапсырды."},
	{3, "3 Осы жолы Жүніс Жаратқан Иенің айтқанын екі етпей, жолға шығып, Ниневиге барды. Бұл аралап шығуға үш күн уақыт кететін өте үлкен қала еді."},
	{4, "4 Жүніс қаланы аралай бастады. Күн ұзағына халыққа уағыз айтып: Қырық күннен кейін Ниневи күйреп, тас-талқан болады! — деп жариялап жүрді."},
	{5, "5 Қала халқы Құдайдың хабарына сенді. Олар (күнәларына өкініп) ораза жариялап, үлкен-кіші барлық адамдар азалы киім киді."},
	{6, "6 Ниневидің патшасы бұл туралы естігенде, ол да (күнәсіне опық жеп) тағынан түсіп, патшалық шапанын шешіп тастады да, азалы киім жамылып, күлге отырды."},
	{7, "7 Содан ол Ниневи халқына патша мен оның уәзірлерінің атынан мына әмірін жариялатты: Күллі халық ораза тұтсын! Барлық адамдар мен жануарлар, ірілі-ұсақты малдар азық пен сусыннан ауыз тимесін!"},
	{8, "8 Адам және жануар атаулы азалы киім мен жабу жамылсын! Әркім Құдайға қатты жалбарынып сиынсын! Бәрі де зұлым жолдарынан қайтып, қатыгез іс-әрекеттерінен бас тартсын!"},
	{9, "9 Мүмкін, сонда Құдай райынан қайтып, аяушылық танытып, қаһарын басар. Осылай біз пәледен аман қалармыз!"},
	{10, "10 Құдай олардың істегендерін көріп, зұлым жолдарынан қайтқандарына көз жеткізді. Содан Ол халыққа аяушылық танытып, бәрін құртамын деген райынан қайтты."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Алайда Жүніс бұған қатты ренжіп, ашуланды."},
	{2, "2 Ол Жаратқан Иеге сиынып былай деді: — Уа, Ием, мен осылай болатынын елімде жүргенде-ақ айтпап па едім? Сондықтан да тездетіп Тарсиске қарай қаштым. Сенің рақымды да мейірбанды Құдай екеніңді білгенмін: Сен тез қаһарлана қоймайтын төзімдісің, берік сүйіспеншілігің шексіз зор. Пәле жіберемін деген райыңнан қайтуға да дайынсың."},
	{3, "3 О, Жаратқан Ие, енді жанымды ала гөр. Маған тірі жүргенше, өлген артық. —"},
	{4, "4 Жаратқан Ие оған: — Сенің ренжіп, ашулануға қандай қақың бар? — деген сұрақ қойды."},
	{5, "5 Ал Жүніс қаладан шығып, оның күншығыс жағындағы бір жерге барып отырды. Өзіне қарапайым күрке жасап, соның көлеңкесінде қаламен не болатынын көрмек болып күтті."},
	{6, "6 Сонда Құдай Ие Жүніске саясы түсіп, оған әлдеқайда қолайлы болу үшін бір бұтаны өсіріп шығарды. Бұта Жүніске керемет ұнады."},
	{7, "7 Бірақ Құдай келесі күні таң сәріде бұтаны кеміретін құрт жіберіп, содан бұта солып қалды."},
	{8, "8 Күн көтерілгеннен кейін Құдай күншығыстан аңызақ жел соққызды. Басын күйдірген күннің аптабынан Жүніс әлсіреп қалды. Ол өлім тілеп: Маған тірі жүргенше өлген артық! — деп налыды."},
	{9, "9 Құдай оған: — Бұтаға бола ренжіп, ашулануға қандай қақың бар? — деген сұрақ қойды. Жүніс: — Менің тіпті өлгенше ашулануға қақым бар, — дегенде,"},
	{10, "10 Жаратқан Ие оған былай деп жауап берді: — Сен осы бұтаны ешқандай өңдеп, өсірмедің. Ол бір түнде өсіп шығып, келесі түні жоқ болды. Солай болса да, бұтаға сенің жаның ашиды."},
	{11, "11 Ал Ниневиде жақсы мен жаманды айыра алмайтын жүз жиырма мыңнан астам халық, сондай-ақ көптеген мал да бар. Ендеше осы үлкен қалаға қалайша Менің жаным ашымайды?!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};