#include <map>
#include <string>
class Bible36
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Яһудаға Амон ұлы Жосияның патшалық құрған кезінде Жаратқан Ие Софонияға сөзін арнады. Ол Хусидің ұлы, Ғодалияхтың немересі, Амарияхтың шөбересі, Езекияның шөпшегі еді."},
	{2, "2 Мен бәрін де жер бетінен құртып жібермекпін! — деп ескертеді Жаратқан Ие. —"},
	{3, "3 Сонда адам мен хайуанды да, аспандағы құс пен теңіздегі балықты да, азғырушы мүсін мен зұлымдық жасаушыны да жаппай жоқ қыламын. Жер бетінен адам баласының көзін құртамын! — Жаратқан Ие осыны нық айтады."},
	{4, "4 Яһуда мен Иерусалимнің күллі тұрғындарына қарсы қолымды созып, оларды жазалаймын. Бұл жерден Бағалға табынушылықты із-түзсіз құртып, абыздардың және Өзімнен бас тартқан діни қызметкерлердің есімдерін жоямын."},
	{5, "5 Жалпақ үй төбелеріне шығып, аспан денелеріне иіліп табынатындарды, әрі Жаратқан Иеге де, жалған тәңір Молохқа да бірдей құлшылық етіп, адал болуға ант ететіндерді жоқ қыламын."},
	{6, "6 Олар Маған, Жаратқан Иеге құлақ салудан бас тартып, енді Өзіме бет бұрып сиынбайды да, Менен не ақыл, не жарылқау сұрамайды да. Мен солардың барлығын да қырып-жоямын!"},
	{7, "7 (Уа, Яһуда халқы,) Жаратушы Тәңір Иенің алдында үнсіз болыңдар! Себебі Жаратқан Иенің соты күні таяп қалды! Жаратқан Ие Яһуда халқын құрбандық болуға дайындады. Өзі асқа шақырған Яһуданың жауларын сол рәсімге арнап тазартқандай даярлады."},
	{8, "8 Мен, Жаратқан Ие, құрбандық шалған сол күні әміршілер мен патшазадаларды, шетелдік киім киіп бөгде әдет-ғұрыптарға бой ұрған солардың барлығын да жазалаймын!"},
	{9, "9 Сол күні Мен соқыр сенімге салынып табалдырыққа аяқ басудан шошынатындардың барлығын және қожайындарының үйлерін зорлықпен әрі алдамшылықпен иемденген байлыққа толтырғандардың бәрін жазалаймын."},
	{10, "10 Жаратқан Ие тағы мынаны айтады: Сол күні қаланың Балық қақпасынан айқай, Екінші ауданынан жылап-сықтау, қыраттардан зор күйреудің даусы шығатын болады."},
	{11, "11 Жылаңдар, Төменгі ауданның тұрғындары! Араларыңдағы күллі саудагерлер құрып, күміспен сауда-саттық жасайтындардың барлығы аластатылады."},
	{12, "12 Сол кезде Мен Иерусалим қаласын шырақтармен шарлап, тінту жүргіземін. Сонда бейқам күнәкарларды жазалаймын. Олар іштей былай дейді: Жаратқан Ие не жаман, не жақсы ештеңе де істемейді."},
	{13, "13 Ал шынында олардың бар дәулеті тоналып, үйлері қирап, қаңырап бос қалмақ. Олар үй салып, онда тұра алмайтын, жүзімдік отырғызып, оның шырынын іше алмайтын болады."},
	{14, "14 Жаратқан Иенің ұлы күні таяп, жақындап қалды, ол тез келе жатыр! Жаратқан Иенің сол күні қатты дауыс шықпақ, сонда мықты жасақшылар да ащы зармен айқайлайтын болады."},
	{15, "15 Сол күн — Тәңір Иенің қаһары төгілетін күн, адамның қайғырып, азап шегетін күні, елдің қирап қаңырап қалатын күні, қараңғылық пен қара түнектің күні, қалың бұлттар мен қара мұнардың күні,"},
	{16, "16 кернейдің даусы мен шайқастың айқай-шуының күні болады! Сонда бекіністі қалалар мен зәулім мұнараларға қарсы шабуыл жасалады."},
	{17, "17 Мен халықтың басына қиын-қыстау кез тудырамын. Олар Маған, Жаратқан Иеге, қарсы күнә жасағандықтан, енді соқыр адам іспетті сипалап жүретін болады. Олардың қаны жердегі шаң-тозаңдай төгіліп, ішек-қарындары қи-қоқыс сияқты лақтырылып тасталады. —"},
	{18, "18 Жаратқан Иенің қаһары төгілетін сол күні алтын-күмістері оларды құтқаруға дәрменсіз болады. Оның ашу-ызасының отында бүкіл жер беті жанып кетеді, себебі Ол жер бетінде тұратындардың барлығын да аяқ астынан толықтай құртатын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Масақ іспетті жиналып, байланыңдар, уа, арсыз халық!"},
	{2, "2 Әйтпесе алдын ала белгіленген шешім орындалып, теріс жолдарыңнан қайту мүмкіндіктерің жел ұшырған қабықтай ғайып болады! Сонда Жаратқан Иенің лаулаған қаһары сендерге лап етіп, Оның қаһары ашылатын күні бастарыңа туады."},
	{3, "3 Жиналып, Жаратқан Иеге бет бұрып сиыныңдар, уа, елдегі кішіпейіл әрі Оның еркін орындаушы жандар! Оған мойынсұнып әділдік үшін ұмтылыңдар! Мүмкін, сол күні Жаратқан Иенің қаһарынан аман сақталатын боларсыңдар."},
	{4, "4 (Філістір еліндегі) Газа қаласы қаңырап бос қалып, Ашқалон да қирап үйіндіге айналады; Азоттың тұрғындары тал түсте айдалып әкетіліп, Әкронның халқы да түп-тамырымен жұлынып тасталады."},
	{5, "5 Уа, теңіз жағасында тұратын кереттік халық, сендер де қасіретке қаласыңдар, Жаратқан Ие сендерге үкімін шығарады, уа, філістірлер мекендеген Қанахан елі: Мен сені құртамын, бірде-бір тұрғының да аман қалмайды! —"},
	{6, "6 Содан теңіз жағасындағы жерлерің шопандардың баспаналары мен мал қоралары орналасқан жайылымға айналады."},
	{7, "7 Сол кезде теңіз жағалауы Яһуда халқының аман қалғандарына өтеді. Олар сонда малдарын бағып, Ашқалонның үйлерінде түнейтін болады. Себебі өздерінің Құдайы Жаратқан Ие аман қалған яһудалықтарды назарында ұстап, қайтадан игілікке кенелтеді."},
	{8, "8 Менің халқымды ренжітіп, олардың еліне қоқан-лоқы жасаған моабтықтардың келемеждеген сөздері де, аммондықтардың мазағы да құлағыма жетті. —"},
	{9, "9 Сондықтан Әлемнің мәңгі тірі Иесі, Исраилдің Құдайы, өз атымен ант етіп былай дейді: — Моаб елі Содом іспетті, аммондықтар елі Ғоморра сияқты болады. Сонда олар қалақай шөбі қаптаған, тұзды шұңқырларға толған, мәңгілікке қаңыраған елсіз далаға айналады. Халқым Яһудадан аман қалғандары оларды тонап, елдерін иемденіп алады. —"},
	{10, "10 Олардың менменсіп, Әлемнің Иесінің халқына тіл тигізіп, мазақ еткендерінің қарымтасы осы болады."},
	{11, "11 Жаратқан Ие оларға айбат көрсетіп, сол елдегі бүкіл тәңірсымақтарды әлсіретіп құртады. Сонда теңіз жағалауындағы барлық халықтар Оған өз жерлерінде ғибадат ететін болады."},
	{12, "12 Сендер де, ей, құштықтар, Менің семсерімнен қырыласыңдар!"},
	{13, "13 Жаратқан Ие Өзінің қолын тағы солтүстікке қарай созып, Ассур елін қиратып, Ниневи қаласын да шөл даладай қуратып, қаңыратып бос қалдырады."},
	{14, "14 Қаланың ортасында отар-табындар мен әр түрлі аңдар жайылып, дамылдайтын болады. Бірқазан мен батпақ жапалағы қираған сарайлардың бағаналарының бастарын паналап, дауыстары терезелерден жаңғырады. Есіктерді үйінділер бөгеп, самырсын тақталары сыртқа шығып жатады."},
	{15, "15 Біліп қойыңдар, бұрын масайрап, бейқам жатқан қаланың сиқы осындай болады. Сол кезде ол мақтанып: Мен өзім бар болушымын, маған тең келер еш нәрсе жоқ! — дейтін. Ал енді ол қирап үйінді болып, жабайы аңдардың мекеніне айналды! Оның жанынан өткен-кеткеннің барлығы ысқырып, қолдарын сілтеп, оны мазақтайды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Қанаушылардың мойынсұнбас, қыңыр әрі арамданған қаласы қасіретке қалады!"},
	{2, "2 Ол ешкімді тыңдамай, ешкімнен ескерту қабылдамайды. Қала Жаратқан Иеге сенім артпайды, өз Құдайына жақындамайды!"},
	{3, "3 Оның әміршілері ақырған арыстандай, төрешілері аш қасқырдай. Олар кешке жортуылға шығып, таң атқанша жемтігінің ештеңесін де қалдырмайды."},
	{4, "4 Қаланың пайғамбарлары менмен де сатқын жандар. Діни қызметкерлері киелі орынды арамдап, Таурат заңын бұзып аяққа басады."},
	{5, "5 Иерусалимді мекендейтін Жаратқан Ие әділ, Ол әділетсіз еш нәрсе істемейді. Таң атқан сайын Ол әділдікті жүзеге асырып, әрбір жаңа күн сайын сонысын тоқтатпайды. Бірақ әділетсіздер ұят дегенді білмейді."},
	{6, "6 (Жаратқан Ие тағы мынаны айтады:) Мен халықтарды қырдым, олардың бекіністі қалаларын бұздым. Көшелерін қаңыраттым, олармен жүретін ешкім де қалмады. Қалалары қираған, адамдары жоқ, тіпті бірде-бір тұрғыны қалмаған."},
	{7, "7 Мен қалаға былай дегенмін: Сен Мені сөзсіз қастерлеп, ескертуімді қабылдайтын боласың. Солай істеген болса, ол қирамай, Менің бірде-бір жазама ұшырамаған болар еді. Бірақ олар бәрібір баяғы зұлым істерін бұрынғысынан бетер жалғастыра беруге әуестенді."},
	{8, "8 Сондықтан Менің орнымнан тұрып, осы халықты айыптайтын күнімді күтіңдер! — деп ескертеді Жаратқан Ие. — Мен халықтар мен патшалықтарды жинап, оларға ашу-ызамды төгіп, лаулаған қаһарымды лап еткізуді шештім. Сол кезде бүкіл дүние Менің қаһарымның отына шалынып, жанып кетеді."},
	{9, "9 Сонда Мен адамдардың еріндерін тазартып, олардың бәрі Жаратқан Иенің атын атап сиынып, Оған бірге ғибадат ететін болады."},
	{10, "10 Құш еліндегі өзендердің арғы жағынан Маған сиынып ғибадат ететіндер — Менің шашырап кеткен халқым сый-тартулар әкелетін болады."},
	{11, "11 Сол күні сен (Иерусалим) Маған қарсы бас көтеріп жасаған бүкіл опасыз істерің үшін тағы да масқараға ұшырамайсың. Себебі Мен қаланың ішінен өркөкірек паңдардың барлығын аластатамын. Енді қайтып Менің киелі тауымда кеуде көтермейсің."},
	{12, "12 Қайта, сендердің араларыңда Жаратқан Иенің есіміне сенім артқан қарапайым да кішіпейіл халықты қалдырамын."},
	{13, "13 Исраил халқынан аман қалғандар бұдан былай жамандық істемейді, өтірік те айтпайды. Олардың ауыздарынан жалғандық шықпайтын болады. Олар ішіп-жеп, алаңсыз тынығады, өйткені қорқытатын жаулары болмайды."},
	{14, "14 Уа, Сион халқы, ән-жырыңды айта берші! Қуана айқайлашы, уа, Исраил! Шын жүректен қуанып-шаттан, Иерусалим халқы!"},
	{15, "15 Жаратқан Ие сенің үкіміңнің күшін жойып, жауыңды кері қайтарды. Исраилдің Патшасы Жаратқан Ие араңда тұр, Ол саған жар! Енді қайтып пәледен қорықпайсың."},
	{16, "16 Сол күні Иерусалимге былай деп жарияланатын болады: Қорықпа, Сион, қолыңнан күш таймасын!"},
	{17, "17 Құдайың Жаратқан Ие араңда тұр! Ол — батыр іспетті құдіретті Құтқарушы саған қатты шаттанады, сүйіспеншілігімен сені тыншытып, саған қуанып мерекелейді."},
	{18, "18 Тағайындалған мейрамдарға өздері қатыса алмағандары үшін қайғыланған адамдарды енді жинаймын. Сенікі болған олар бір кезде жаудың олжасына айналып, сен масқараға ұшыраған едің."},
	{19, "19 Болашақ кезде Мен саған қысым көрсеткендерді де қолға алып, барлығын жазалаймын. Ақсақ адамдарыңды құтқарып, шашырап кеткендеріңді жинап аламын. Масқара болған елдерінде енді оларға даңқ пен мадақ сыйлаймын."},
	{20, "20 Мен сендерді жинағанда ата мекендеріңе бастап алып келемін. Өз көз алдарыңда сендерді тағы да игілікке кенелтіп, жер бетіндегі барлық халықтардың алдында атақ-даңққа бөлеймін. — Жаратқан Ие осыны уәде етеді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};