#include <map>
#include <string>
class Bible58
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
	struct kk7	{ int val; const char *msg; };
	struct kk8	{ int val; const char *msg; };
	struct kk9	{ int val; const char *msg; };
	struct kk10	{ int val; const char *msg; };
	struct kk11	{ int val; const char *msg; };
	struct kk12	{ int val; const char *msg; };
	struct kk13	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Өткен заманда Құдай әлденеше рет түрлі жолдармен өз хабарын ата-бабаларымызға пайғамбарлар арқылы жеткізіп отырған."},
	{2, "2 Ал осы соңғы заманда Ол бізге хабарын Өзінің рухани Ұлын жіберіп жеткізді. Құдай Сол арқылы әлемді жаратып, Оны барлығының иесі етіп тағайындады."},
	{3, "3 Одан Құдайдың салтанатты ұлылығы жарқырап көрінеді: Ол — Құдайдың болмысының дәлме-дәл сипаты. Ұл бүкіл әлемді құдіретті сөзімен қолдап ұстап тұр. Өзінің құрбандық өлімі арқылы күнәдан тазару жолын ашып бергеннен кейін, Ол көктегі Ұлылық Иесіне (яғни Құдай Әкеге) барып, Оның оң жағындағы ең құрметті орынға жайғасты."},
	{4, "4 Сонымен, рухани Ұлдың иемденген Атағы періштелердікінен қаншама жоғары болса, Оның жолы да олардікінен соншама үлкен."},
	{5, "5 Себебі Құдай періштелердің ешқайсысына да былай деп айтқан емес: Рухани Ұлымсың, Мен бүгінгі күн Әке болдым Саған. Және: Мен Оған Әке боламын, ал Ол Менің рухани Ұлым болады."},
	{6, "6 Құдай осы дүниеге жолы бәрінен де үлкен рухани Ұлын жібергенде, Ол туралы мынадай сөздер айтты: Жаратқан Иенің бар періштелері де Оған тағзым етсін! —"},
	{7, "7 Періштелер жайлы (Забурда) мына тәрізді сөздер айтылған: Ол желдей етеді періштелерін, от жалынындай да өз нөкерлерін."},
	{8, "8 Ал Ұл туралы былай делінген: Сенің тағың, о, Құдай, сақталады мәңгілік, Патшалығыңа жүргізесің әділ билік."},
	{9, "9 Заңсыздықты жек көріп, әділдікті сүйесің, Сондықтан да Құдай, өз Құдайың Сенің, Өзіңді тағайындап, сыйлады Саған Серіктеріңнен гөрі шаттықты молынан."},
	{10, "10 Ол туралы тағы мынадай сөздер де айтылған: Ием, жердің негізін салғансың әуел баста, Құдіретіңмен жараттың аспанды да."},
	{11, "11 Олар құриды, Сен боласың әр уақытта, Киімдей тозады олардың барлығы да,"},
	{12, "12 Сен соларды көйлектей ауыстырасың, Шапандай бүктеп алып та қоясың. Ал Өзің өзгермей қалатын боласың, Еш таусылмайды Сенің жасар жылдарың."},
	{13, "13 Ал енді, Құдай қай кезде қай періштеге: Мен жауларыңды табаныңның астына салып бергенімше отыр оң жағымда! — деп айтқан еді?"},
	{14, "14 Періште атаулы — қызмет көрсететін рухтар ғана, солай емес пе? Жаратқан Ие оларды мәңгілік құтқарылуға ие болатын адамдарға қызмет етуге жібереді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Сол себепті біз беттеген бағытымыздан ауытқып кетпеуіміз үшін Мәсіх туралы естігендерімізге мықтап ден қоюымыз керек."},
	{2, "2 Құдайдың періштелер арқылы (Мұсаға) жеткізген Таурат заңын халықтың бәрі берік ұстануға міндетті болды. Кім оның ережелерін бұзып, бағынбаса, сол әділ жазасын тартты. Бұл осылай болған күнде,"},
	{3, "3 егер біз сондай керемет құтқарылуды елемесек, онда жазадан қалайша құтылмақпыз? Осы құтқарылуды алғашқыда Иеміздің Өзі паш еткен еді. Оны өз құлақтарымен естіген куәгерлер кейін соған біздің де көзімізді жеткізді."},
	{4, "4 Құдай Өзінің құдіретін көрсетіп, түрлі таңғаларлық кереметтер мен ғажайып істер жасау арқылы және Киелі Рухтың өз еркіне сай әркімге үлестіріп берген түрлі рухани дарындары арқылы да осы Ізгі хабарды растады."},
	{5, "5 Біз айтып отырған болашақ әлемді Құдай періштелердің қол астына тапсырған емес."},
	{6, "6 Қайта, Киелі жазбалардың бір жерінде осы туралы біреу мынаны байыппен айтқан ғой: Өзің ескеретіндей адам сонша кім? Сен қамқорлайтындай адам баласы кім?"},
	{7, "7 Оны періштелерден сәл төмен қойдың, Құрмет, салтанатты оған тәждей сыйладың,"},
	{8, "8 Бәрін де оған бағындырып бердің. Құдай адам баласына бәрін де бағындырып берген кезде оған бағындырмаған еш нәрсені қалдырған жоқ. Алайда біз бәрінің де адам баласына бағынғандығын қазір көре алмаймыз."},
	{9, "9 Бірақ Исаның азапты өлім шеккені үшін Патша ретінде ғаламат салтанат пен құрметке бөленгенін көреміз. Ол біраз уақыт періштелерден төмен болып, Құдайдың рақымының арқасында күллі адамзат үшін жанын қиды."},
	{10, "10 Тәңір Ие көптеген адамдарды күнәдан құтқарып, Өзінің рухани балалары етіп құрметке бөледі; ал оларға құтқарылу жолын салған Мәсіхті азап шегуі арқылы кемелді Бастаушы етті. Бүкіл әлемді Өзі үшін жаратқан Құдайға осы лайық еді."},
	{11, "11 Адамдарды Оған бағыштаған Мәсіх те, сол адамдар да бір Әкеден тарайды. Сондықтан да Мәсіх оларды бауырларым деп атаудан ұялмайды."},
	{12, "12 Ол алдын ала былай деген: Атыңды бауырларыма білдіремін, қауым жиынында Сені дәріптеймін. — Ол тағы мынадай сөздер де айтқан:"},
	{13, "13 Мен Оған сенімімді арта беремін және Міне, Мен және Жаратқан Ие Маған сыйлаған (рухани) балалар мұндамыз!"},
	{14, "14 Тәңір Иенің рухани балалары ет пен сүйектен жаралғандықтан, Иса да ет пен сүйектен тұратын тәнді қабылдады. Осылайша Ол Өзінің құрбандық өлімі арқылы өлімнің әміршісін, яғни әзәзіл шайтанды, жеңіп шықты,"},
	{15, "15 әрі өмір бойы өлімнен қорқып, шайтанның құлы болып жүрген адамдарды азат етті."},
	{16, "16 Себебі Мәсіх періштелердің емес, Ыбырайымның ұрпақтарының қамын ойлайды."},
	{17, "17 Сондықтан Ол барлық жағынан бауырластарына ұқсас болуға тиіс еді. Осылай Мәсіх Құдайға қызмет ететін қайырымды да адал Бас діни қызметкер болып, өз жанын халқының күнәларының құнын өтеу үшін құрбандыққа қиды."},
	{18, "18 Өзі азап шегіп ауыр сынаққа төзген Ол сынақтан өтіп жатқан бізге де көмектесе алады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Бұл солай болғандықтан, қымбатты бауырластарым, әрі көктегі Құдай сендерді Өзіне бағыштап, қасиетті болуға басқалармен бірге шақырғандықтан, Мәсіх Исаға берік ден қойыңдар: Ол — Құдайдың Елшісі және Бас діни қызметкері. Оған сенім артқанымызды ашық мойындаймыз."},
	{2, "2 Мұса пайғамбар Құдайдың бүкіл үйіндегі қызметін адал атқарғанындай, Иса да Өзін тағайындаған Құдайға адал болды."},
	{3, "3 Ал салынған үйден гөрі үй салушы көбірек құрметке лайық, сол сияқты Иса да Мұсаға қарағанда әлдеқайда зор құрметке ие."},
	{4, "4 Әрбір үйдің салушысы бар, ал бәрінің де Жаратушысы — Құдай. (Сондықтан да Оның рухани Ұлы Мәсіх Мұсадан анағұрлым мәртебелі!)"},
	{5, "5 Мұса Құдайдың бүкіл үйінде адал қызметшісі болып, Оның кейін жариялайтын хабарына меңзеп, ол туралы алдын ала айтып кетті."},
	{6, "6 Ал Мәсіх Құдайдың рухани Ұлы ретінде Оның үйін (яғни Құдайдың халқын) адал басқарады. Егер (Мәсіхке деген) нық сенімімізді және мақтан тұтып келген үмітімізді берік ұстансақ, біз Соның рухани үйіміз."},
	{7, "7 Сондықтан Киелі Рухтың мынадай айтқандарына мән беріңдер: Бүгін сендер Оның даусын естігенде,"},
	{8, "8 Ежелде айдалада сыналған кезде Бас көтергендердің істегендері секілді Қасарыстырмаңдар енді жүректеріңді!"},
	{9, "9 (Тәңір Ие олар туралы былай деген еді:) Қырық жыл ата-бабаларың сол жерде Көріп жүрсе де керемет істерімді, Еркінсіп сынай берді төзімімді."},
	{10, "10 Бұл ұрпаққа сол себепті ашуландым, Сонымен былай деп қорыттым: Жүрек қалаулары теріс бағыттағы Олар тағылымымды қабылдамады!"},
	{11, "11 Қаһарланып ант еттім Мен сондықтан: Тыныштық сыйлау үшін Мен дайындаған Елге кірмейді олар енді ешқашан!"},
	{12, "12 Бауырластар, сақ болыңдар: ешқайсың жүректеріңді қасарыстырып сенбейтін болмаңдар, мәңгі тірі Құдайдан безіп кетіп жүрмеңдер!"},
	{13, "13 Қайта, бірде-біреуің күнәнің кесірінен алданып, қасарысып кетпеу үшін, әлі де бүгін деген мерзім бітпей тұрғанда, күн сайын өзара дем берісіп отырыңдар!"},
	{14, "14 Алғашқы сенімімізді аяғына дейін берік ұстанғанда ғана Мәсіхпен тығыз байланыста болып, бірге қызмет етеміз."},
	{15, "15 Жоғарыда айтылғандай, Бүгін сендер Оның даусын естігенде, бас көтергендердің істегендері секілді қасарыстырмаңдар енді жүректеріңді!"},
	{16, "16 Жаратқан Иенің даусын естісе де, Оған қарсы бас көтергендер кімдер? Олар Мұса пайғамбардың соңынан еріп Мысыр елінен көшіп шыққандардың бәрі емес пе еді?"},
	{17, "17 Ал Құдай қырық жыл бойы кімдерге ашуланды? Олар күнә жасағандықтан айдалада жүргенде өліп, жерленген ата-бабаларымыз емес пе еді?"},
	{18, "18 Құдай кімдер туралы Тыныштық сыйлау үшін Мен дайындаған елге кірмейді олар енді ешқашан! деп ант еткен болатын? Оған мойынсұнбаған ата-бабаларымыз туралы емес пе еді?"},
	{19, "19 Сонымен олардың Тәңір Иеге сенбегендіктеріне бола сол елге кіре алмағанын көреміз."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Құдайдың шынайы тыныштық сыйлайтын елге кіргізу жайлы уәдесі әлі де күшінде. Сол себепті бірде-біреуіңнің осы мүмкіндікті жіберіп алмауларың үшін сақ болайық!"},
	{2, "2 Ата-бабаларымыз сияқты біз де Құдайдың сыйлайтын тыныштығы туралы уәдесін естідік. Олар бұл хабарды сеніммен қабылдамай, тек естіп қана қоя салғандықтан, оның пайдасын көрмеді."},
	{3, "3 Ал сенімімізді Мәсіхке артқан біздер уәде етілген тыныштықты иемденеміз. Рас, Тәңір Ие былай деген болатын: Қаһарланып ант еттім сондықтан: Тыныштық сыйлау үшін Мен дайындаған елге кірмейді олар енді ешқашан! Ал Тәңір Иенің өз жұмысы әлемді жаратып болған кезде-ақ тамамдалған еді ғой."},
	{4, "4 Киелі жазбалардың бір жерінде жаратылыстың жетінші күні туралы былай делінген: Құдай жүргізген жарату жұмысының бәрін жетінші күні аяқтап, демалды."},
	{5, "5 Алайда Құдай (жоғарыда келтірілген аяттарда) былай деген: Тыныштық сыйлау үшін Мен дайындаған елге кірмейді олар енді ешқашан!"},
	{6, "6 Демек, ежелде Ізгі хабарды естіген ата-бабаларымыз Құдайға бағынбағандықтан сол тыныштыққа кіре алмады. Ал өзге кейбіреулер үшін кіру мүмкіндігі әлі де сақтаулы."},
	{7, "7 Сол себепті Құдай кейін басқа бір күнді белгіледі, ол күн — бүгін. Көп уақыт өткен соң Ол бұл туралы Дәуіт пайғамбар арқылы былай деді: Бүгін сендер Оның даусын естігенде, қасарыстырмаңдар енді жүректеріңді!"},
	{8, "8 Егер кезінде Ешуа пайғамбар халықты Құдай дайындап қойған шынайы тыныштыққа жеткізген болса, онда кейінірек тыныштық сыйланатын басқа бір күн туралы сөз болмас та еді."},
	{9, "9 Мұның бәрі осылай болғандықтан, Құдайдың Өзі жетінші күні демалып тыныққаны сияқты, Оның халқы үшін де шынайы тыныштыққа жету мүмкіндігі әлі де бар."},
	{10, "10 Құдайдың жарату жұмысын тамамдаған соң тынығып демалғанындай, Оның дайындап қойған шынайы тыныштығына ие болған әркім де өз бетімен еңбектенуін доғарып, тынығады."},
	{11, "11 Сондықтан ешқайсымыз ата-бабаларымыз сияқты бағынбаушылыққа бола сол тыныштықтан құр қалмау үшін оны иемденуге жан сала ұмтылайық!"},
	{12, "12 Себебі Құдайдың сөзі тірі, әсері де күшті. Ол екі жүзді семсердің қайсысынан да өткір! Құдайдың сөзі бойымызға терең еніп, жан мен рухты айырып, буын мен жұлынға жеткен іспетті, жүрегіміздің түкпіріндегі ой-ниетімізді де әшкерелеп, бағалайды."},
	{13, "13 Құдайдан жасырын жатқан ешбір жан иесі жоқ, Оның көз алдында барлығы ашық та айқын көрініп тұр. Біз Құдайдың алдында есеп беруге тиіспіз."},
	{14, "14 Сонымен сенімімізді берік ұстанып, оны тапжылмастан мойындайық. Көкке көтеріліп кеткен зор мәртебелі Бас діни қызметкеріміз — Құдайдың рухани Ұлы Иса бар."},
	{15, "15 Ол бізге жаны ашымайтын, осал жақтарымызды түсінбейтін діни қызметкер емес, қайта, өзіміз сияқты әр түрлі сынақтан өтіп көрді, бірақ ешқашан күнә жасаған жоқ."},
	{16, "16 Ендеше рақымы мол Құдайдың тағына нық сеніммен жақындап, өтініштерімізді білдірейік. Осылай көмекке мұқтаж кездерімізде Оның мейірімділігі мен рақымына ие боламыз."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Әдетте әрбір бас діни қызметкер пенделер арасынан таңдалып, олар үшін Құдайға қызмет етуге тағайындалады: Оған арнап сый-тартулар ұсынып, адамдардың күнәларының құнын өтеу үшін құрбандықтар шалады."},
	{2, "2 Бас діни қызметкер өзінің де пенделік кемшіліктері бар болғандықтан, білмей тура жолдан адасып кеткендерге мейірімділік көрсете алады."},
	{3, "3 Сол себептен ол халық үшін де, өзі үшін де күнәнің құнын өтейтін құрбандықтар шалуға міндетті."},
	{4, "4 Бас діни қызметкер болу құрметін ешкім өз бетімен иемденбейді, оны Құдай белгілейді. Һарон да қызметіне осылай тағайындалған еді."},
	{5, "5 Сондай-ақ Мәсіх те Бас діни қызметкер болу құрметін өз бетімен иемденген жоқ. Қайта, Құдай Оған: Рухани Ұлымсың, Мен бүгінгі күн Әке болдым Саған деген."},
	{6, "6 Киелі жазбалардың тағы бір жерінде былай да делінген: Сен Мәліксадықтай діни қызметкерсің, мәңгі сондай болып қала да бересің!"},
	{7, "7 Сонымен қатар Мәсіх жер бетінде жүргенде Өзін өлімнен құтқаруға құдіреті жететін Әкесіне қатты дауыстап сиынып, көз жасын төгіп жалбарынды. Мәсіх Әкесін терең қастерлегендіктен мінажаты қабыл болды."},
	{8, "8 Құдайдың рухани Ұлы бола тұра, Мәсіх ауыр азаптар шеккен кезінде де Әкесіне мойынсұнуға үйренді."},
	{9, "9 Жүктелген тапсырмасын толық орындап шыққан Ол Өзіне мойынсұнғандардың барлығы үшін мәңгілік құтқарылуға жол ашты."},
	{10, "10 Құдайдың Өзі Мәліксадықты тағайындағанындай, Мәсіхті де Бас діни қызметкер болуға белгіледі."},
	{11, "11 Бұл тақырып туралы тағы бірталай нәрселерді айтқанымыз жөн болар еді. Бірақ оларды түсіндіру қиын, өйткені сендер зейін қойып тыңдамайтын болдыңдар."},
	{12, "12 (Мәсіхтің тура жолына түскеннен бергі) кездеріңді ескерсек, өзгелерге тәлім берулерің орынды болар еді. Керісінше, сендер әлі де Құдайдың хабарындағы ең бастапқы қарапайым тәлімді басқа біреуден үйренуге мұқтажсыңдар. Өздеріңе қатты тағамның орнына әлі де жай сүт керек!"},
	{13, "13 Сүтпен тамақтанатындар Құдай алдында ақталу туралы Ізгі хабарды әлі де не ұқпайды, не дұрыс қолдана да алмайды. Олар — рухани сәбилер."},
	{14, "14 Тек рухани кемеліне келгендер ғана қатты тағамдарды жей алады. Байыппен ойлауға дағдыланғандықтан да, олар жақсы мен жаманды айыра біледі."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 Сол себепті Мәсіхтің Ізгі хабарының ең бастапқы тәлімін былай қойып, одан бетер жетілу үшін алға басайық. Тағы да ең негізгі тақырыптарға: бізді рухани өлімге бастап әкететін қылықтардан бас тартып, Құдайға сенім арту жайында,"},
	{2, "2 шомылдыру рәсімі мен қол тигізіп бата беру жөнінде немесе өлгендердің қайта тірілуі және мәңгілік үкімделуі туралы тәлімдерге тоқталғымыз келмейді."},
	{3, "3 Құдай қаласа, енді әрі қарай жылжымақпыз."},
	{4, "4 Себебі кейбір адамдарды істегендеріне өкіндіріп, қайтадан Құдай жолына түсіру мүмкін емес: бір кезде жан дүниелері Тәңір Иенің нұрынан ағарған еді. Олар Оның көктен жіберген сыйының дәмін татып, Киелі Рухтан үлестерін алды."},
	{5, "5 Сондай-ақ, Құдай сөзінің игілігінің де, болашақ заманның құдіретінің де дәмін татып көрген болатын."},
	{6, "6 Алайда кейінірек олар тура жолдан безіп кетті! Мұндай адамдар өз еріктерімен Құдайдың рухани Ұлын тағы да айқышқа шегелеп тастағандай, жұрттың мазағына айналдырып жүр. Мұндай жағдайда оларды Құдай жолына қайтару мүмкін емес."},
	{7, "7 Егіндік жер жиі жауған жаңбырмен шөлін қандырып, өзін өңдеп, баптаған егіншінің игілігі үшін өнімін бергенде, Құдай оны жарылқайды."},
	{8, "8 Ал тікен мен ошаған шығаратын жер пайдасыз. Көп ұзамай егінші мұндай жерді үкімдеп, ақыры өртейді."},
	{9, "9 Ал, сүйікті бауырластарым, осыларды айтқанмен, сендердің бұдан жақсырақ жағдайда екендіктеріңе, яғни құтқарылуларыңды берік ұстанғандарыңа, көзіміз жетті."},
	{10, "10 Құдай әділетсіз емес қой: Ол жасаған игі істеріңді, өз адамдарына берген, әлі де беріп жатқан көмектерің арқылы Өзіне де көрсеткен сүйіспеншіліктеріңді ешқашан есінен шығармайды."},
	{11, "11 Әрқайсыларыңның үміттеріңді соңына дейін берік ұстануларың үшін де осындай ынта-жігер танытқандарыңды аңсап тілейміз."},
	{12, "12 Сонда сендер жігерсіз болмайсыңдар. Керісінше, сенім мен шыдамдылық көрсетіп, уәде етілген игіліктерді иемденгендерден үлгі аласыңдар."},
	{13, "13 Мысалы, Құдай Ыбырайымға уәде берді. Өзінен жоғары ешкім тұрмағандықтан, Құдай Өзінің атымен ант етіп"},
	{14, "14 былай деді: Саған ақ батамды шүбәсіз үйіп-төгіп бере отырып, сенің ұрпақтарыңды сансыз көбейтемін."},
	{15, "15 Осылай Ыбырайым шыдамдылықпен күтіп, Құдайдың уәде еткендеріне ие болды."},
	{16, "16 Адамдар өздерінен жоғарының атымен ант береді. Сол арқылы айтқандарын бекітіп, күллі дау-дамайларын доғартады."},
	{17, "17 Сондықтан Құдай да Өзінің уәдесін иемденетіндерге алға қойған мақсатының мызғымас екенін өте айқын көрсеткісі келгенде, айтқандарын антпен бекітті."},
	{18, "18 Осылайша біз бұл екі мызғымас негізге (Құдайдың уәдесі мен антына) сүйеніп, олардан зор күш-жігер аламыз. Себебі Құдайдың өтірік айтуы еш мүмкін емес қой. Бізге ұсынылған осы үміттен күдер үзбей, Одан пана таптық."},
	{19, "19 Бұл үмітіміз — берік зәкір сияқты жанымыздың сенімді сүйеніші; ол көктегі киелі үйдің ішіндегі шымылдықтың арт жағында Құдайдың Өзімен бекітілген."},
	{20, "20 Сол жерге Исаның Өзі кіріп, осы арқылы бізге де сонда кіруге жол ашты. Себебі Иса — Мәліксадық сияқты тағайындалған мәңгілік Бас діни қызметкеріміз."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct kk7 poems[] = {
	{1, "1 Сол Мәліксадық Салим қаласының патшасы және Алла Тағаланың діни қызметкері болатын. Ыбырайым бірнеше патшаны жеңіп, шайқастан қайтып келе жатқанда, Мәліксадық оған жолығып, батасын берді."},
	{2, "2 Сонда Ыбырайым қолындағы бар мал-мүліктің оннан бір бөлігін (құдайы сый-тарту етіп) оған қалдырып кетті. Мәліксадық есімінің мәнісі Әділдік патшасы болса, Салимнің патшасы — Амандық пен тыныштық патшасы дегенді білдіреді."},
	{3, "3 Мәліксадықтың әке-шешесі, шыққан тегі және өмір сүрген уақытының бас-аяғы туралы ешбір мәлімет берілмеген. Сол жағынан ол мәңгі бақи діни қызметкер болып қалатын Құдайдың рухани Ұлына ұқсайды."},
	{4, "4 Мәліксадықтың мәртебесінің қандай жоғары екенін ойлап көріңдер: тіптен түп атамыз Ыбырайым түскен олжасының оннан бір бөлігін оған берді."},
	{5, "5 (Ыбырайымның шөбересі) Леуінің тұқымынан шыққан діни қызметкерлер Құдайдың өсиетіне сай өз ағайындары — Исраил халқының жалпы түсімінің оннан бір бөлігін алып отырады. Бұлардың да Ыбырайымнан тарағандықтарына қарамастан, леуіліктер олардан әлгі бөлікті жинайды."},
	{6, "6 Ал Мәліксадық Леуі руынан шықпаса да, Құдайдың уәдесін алған Ыбырайымның түсімінің оннан бір бөлігін иемденіп, оған батасын берді."},
	{7, "7 Бата алғаннан бата бергеннің дәрежесі, сөзсіз, жоғары."},
	{8, "8 Оннан бір бөлігін жинайтын леуілік діни қызметкерлер күндердің күнінде өлетін пенделер ғана, ал Мәліксадықтың тірі екендігі туралы мәлімет берілген."},
	{9, "9 Ыбырайымның Мәліксадыққа қолындағысының оннан бір бөлігін беруі арқылы кейінірек халықтан түсімінің оннан бір бөлігін жинайтын Леуі руы туралы да: олар Мәліксадыққа сол құдайы сый-тартуды берді деп айтуға болады."},
	{10, "10 Себебі Леуі руы Мәліксадықпен кездескен атасы Ыбырайымнан тарағандықтан, соның істегендерінің нәтижесі бұларға да қонды. (Сондықтан да Мәліксадықтың діни қызметкер ретіндегі дәрежесі Леуі руынан шыққандардан әлдеқайда жоғары.)"},
	{11, "11 Таурат заңы Исраил халқына леуіліктердің діни қызметінің негізінде тапсырылды. Егер осылардың қызметі көзделген мақсатқа қол жеткізген болса, онда Мәліксадық іспетті басқа діни қызметкердің тағайындалуының қажеті болмай, (Леуінің ұрпағы) Һароннан тараған діни қызметкерлер де жетіп жатқан болар еді. Алайда олардың қызметі жеткіліксіз болды."},
	{12, "12 Ал діни қызметте өзгерістер болса, онда Таурат заңының да өзгертілуі керек."},
	{13, "13 Сол секілді, осы айтылғандарға қатысы бар Мәсіхтің Өзі бірде-бір діни қызметкер шықпаған басқа рудан еді:"},
	{14, "14 Иеміздің Яһуда руынан шыққандығы белгілі. Сол рудың діни қызметі туралы Мұса пайғамбар еш нәрсе айтпаған болатын."},
	{15, "15 (Ал леуіліктердің діни қызметі адамдарды рухани мақсатына жеткізе алмай келді.) Бұл жайт Мәліксадық іспетті басқа бір Діни қызметкердің тағайындалуы арқылы бұрынғыдан бетер анық болып тұр."},
	{16, "16 Ол — адам ретінде Таурат заңында жазылған шығу тегіне қатысты ережеге сай болғандықтан емес, бойында сарқылмас құдіретті өмір болғандықтан Діни қызметкер."},
	{17, "17 Себебі Забурда Ол туралы Сен Мәліксадықтай діни қызметкерсің, мәңгі сондай болып қала да бересің! деген куәлік берілген."},
	{18, "18 Сонымен бұрынғы заң күшсіз, пайдасыз болғандықтан, оның ережелері істен шықты."},
	{19, "19 Мұса арқылы берілген сол заң еш нәрсені де кемелділікке жеткізе алған жоқ. Ал қазір бұрынғыдан гөрі жақсы үмітіміз бар: сол бойынша біз шынымен Құдай алдына барып, Оған сиына аламыз!"},
	{20, "20 Сонымен қатар, Құдай Мәсіхтің діни қызметкерлігін тіпті антпен бекітті."},
	{21, "21 Леуілік діни қызметкерлерге Ол ант берген жоқ, ал Мәсіх діни қызметкер болып тағайындалғанда Құдай Оған ант берді. Бұл туралы былай делінген: Жаратқан Ие былай деп ант берген еді, Онысын ешқашан да өзгертпейді: Сен діни қызметкерсің, мәңгі сондай болып қала да бересің!"},
	{22, "22 Құдай осы антты бергендіктен, Иса — бұрынғыдан гөрі жақсы Жаңа Келісімнің кепілі."},
	{23, "23 Тағы бір айырмашылық бар: Көне Келісімнің тұсында бір-бірінің орнын басқан көптеген діни қызметкерлер болды. Барлығы да ажалы жеткенде қызметінде қала алмады."},
	{24, "24 Ал Иса мәңгі бақи жасайтындықтан, Оның діни қызметі де өткінші емес."},
	{25, "25 Сол себептен Ол Өзі арқылы Құдайға сиынғандардың бәрін толықтай құтқара алады. Иса мәңгі өмір сүріп, олар үшін өтініш жасайды."},
	{26, "26 Бізге дәл сондай Бас діни қызметкер қажет: қасиетті де кінәратсыз, кіршіксіз таза Ол, күнәкарлардан аластатылып, аспаннан да жоғары, Құдайдың қасына, көтерілді."},
	{27, "27 Иса бұрынғы бас діни қызметкерлер сияқты күнде алдымен өз күнәларының құнын өтеу үшін, сонан соң халықтың күнәлары үшін құрбандық шалуға тиісті емес. Ол айқышта өлгенде Өзін біржола құрбан етіп күнәлардың құнын өтеді."},
	{28, "28 Таурат заңы бойынша пенделік кемшіліктері бар адамдар бас діни қызметке тағайындалады. Ал сол заңнан кейін Құдайдың өз антымен бекітілген сөзі бас діни қызметке Өзінің рухани Ұлын тағайындады. Ол мәңгілік еш кемшіліксіз кемелді болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct kk8 poems[] = {
	{1, "1 Айтып жатқандарымыздың ең бастысы мынау: көкте біздің Бас діни қызметкеріміз бар; Ол тағына жайғасқан Ұлылық Иесінің оң жағындағы құрметті орнында отыр."},
	{2, "2 Сол жерде Ол адам баласы емес, Жаратқан Иенің Өзі көкте тұрғызған шынайы киелі үйде қызметін атқарып жүр."},
	{3, "3 Әрбір бас діни қызметкер Құдайға сый-тарту мен құрбандық жасау үшін тағайындалады. Сол сияқты біздің Бас діни қызметкеріміздің де Құдайға ұсынатын құрбандығы болуға тиіс еді."},
	{4, "4 Егер Ол жер бетінде қалса, діни қызметкер бола алмас та еді. Себебі Таурат заңы бойынша ғибадатханада құрбандық жасайтын арнайы діни қызметкерлер бар."},
	{5, "5 Бұлардың құлшылық етуі көктегі рухани қызметке ұқсағанмен, онымен бірдей емес. Мұса киелі шатырды дайындауға кіріскенде Құдай оған: Байқа, барлығын саған осы тау басында көрсетілген үлгіге сай жасайтын бол! — деп ескертті ғой."},
	{6, "6 Ал Исаға жер бетіндегі діни қызметкерлердің міндетінен анағұрлым жоғары қызмет тапсырылды. Сол сияқты Ол Құдай мен адамдардың арасындағы бұрынғысынан гөрі жақсы Келісімге жол ашты. Бұл Құдайдың ерекше игілікті уәделеріне негізделген."},
	{7, "7 Егер бұрынғы Келісім ешбір кемшіліксіз болған болса, онда өзгесін жасаудың керегі болмас та еді."},
	{8, "8 Алайда (Еремия пайғамбар) халқының айыбын әшкерелегенде былай деген: Жаратқан Ие мынаны айтады: Біліп алыңдар, Мен Исраилдің және Яһуданың үрім-бұтақтарымен Жаңа Келісім жасайтын уақыт келеді."},
	{9, "9 Бұл Келісім Мен олардың ата-бабаларын қолдарынан жетелеп Мысырдан алып шыққанда солармен жасаған Келісіміммен бірдей болмайды. Өйткені олар бұл Келісіміме адал болмағандықтан ықыласымнан айырылды, — дейді Жаратқан Ие. —"},
	{10, "10 Қайта, Менің кейінгі заманда Исраил халқымен жасайтын Келісімім мынадай болады: Мен өз тәлімімді олардың ақыл-саналарына дарытамын әрі жүректеріне жазып та қоямын. Мен олардың Құдайы, ал олар Менің халқым болады, — дейді Жаратқан Ие."},
	{11, "11 Сонда ешкімге замандасы мен ағайынына: Жаратқан Иені жақыннан танып біл! деп үйретудің қажеті болмайды. Өйткені үлкенді-кішілі барлығы да Мені жақыннан танып білетін болады."},
	{12, "12 Себебі Мен олардың әділетсіз істерін рақымшылықпен кешіріп, жасаған күнәларын бұдан былай есіме алмайтын боламын."},
	{13, "13 Осылай Құдай Жаңа Келісім дегенде бұрынғысының ескіргендігін білдірді. Ал ескіріп, көнерген нәрсе көп ұзамай күшінен айырылып, жойылмақ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct kk9 poems[] = {
	{1, "1 Бұрынғы Келісімге сай Құдайға құлшылық ету үшін арнайы ережелер және жер бетіндегі қасиетті ғибадат орны болды."},
	{2, "2 Киелі шатыр тігіліп, оның қасиетті бөлме деп аталған алдыңғы бөлімінде шам қойғыш, үстел және соның үстінде сый-тарту ретінде ұсынылған нандар тұратын."},
	{3, "3 Ал шатыр ішіндегі шымылдықтың арт жағында ең қасиетті бөлме деп аталған киелі орын болатын."},
	{4, "4 Сол жерде алтын жалатқан түтету үстелі және жан-жағынан алтынмен қапталған Келісім сандығы орналасқан еді. Сол үстелдің үстінде Құдайға арнап хош иісті заттар өртеліп түтетілетін. Ал сандықтың ішінде Келісімнің куәліктері: манна деген керемет тағам салынған алтын құмыра, Һаронның бүр жарған таяғы және он өсиет жазылған екі тас тақташа сақталатын."},
	{5, "5 Құдайдың салтанатты ұлылығы қонатын сол сандықтың үстінде керуб атты екі періштенің мүсіндері тұратын. Олардың жайылған қанаттары сандық қақпағын жауып тұрды. Сол қақпаққа халықтың күнәсінің құнын өтеу үшін жыл сайын шалынған құрбандықтың қаны бүркілетін. Алайда мұны қазір егжей-тегжейлі айтып жатудың қажеті жоқ."},
	{6, "6 Осылай жабдықталған киелі үйдің алдыңғы бөлмесіне діни қызметкерлер күн сайын кіріп, Құдайға құлшылық етеді."},
	{7, "7 Ал екінші, ең қасиетті бөлмесіне тек бас діни қызметкерге ғана жылына бір-ақ рет енуге болады. Сол кезде ол өзінің және халықтың білмей жасаған күнәларының құнын өтеу үшін шалынған құрбандықтың қанын ала кіруге тиісті."},
	{8, "8 Киелі Рух осы арқылы бізге мынаны білдіреді: киелі үйдің алдыңғы бөлімі әлі де бар болып тұрғанда, ең қасиетті бөлімге (яғни Құдайдың алдына) апаратын жол ашық емес."},
	{9, "9 Бұл осы замандағы жайттың бейнесі! Құдайға ұсынылатын сый-тартулар мен құрбандықтар Оған сиынатын адамдардың ар-ұжданын өздерінің жасаған күнәларынан түпкілікті арылта алмайды."},
	{10, "10 Сол ескі ғибадат ету жолының ережелері тек ішіп-жеу және түрлі тазару рәсімдері сияқты сыртқы дәстүрлерге байланысты. Олар Жаңа Келісім енгізілген кезге дейін ғана күшінде болды."},
	{11, "11 Енді міне, Бас діни қызметкеріміз Мәсіх бізге соншама рухани игіліктер алып келді! Сонда Ол жер бетіндегі ғибадат орнынан гөрі әлдеқайда ұлы да кемелді көктегі киелі үйге кірді. Бұл адам қолынан шыққан, осы жаратылыстың бір бөлігі емес."},
	{12, "12 Мәсіх, сондай-ақ, құрбандыққа шалынған қошқарлар мен бұзаулардың қанын емес, Өзінің құрбан болған кезінде төгілген қанын осы киелі үйдің ең қасиетті бөліміне біржола алып кірді. Осылайша Ол бізді күнәміздан арылтып, мәңгілік азат етті."},
	{13, "13 Таураттың ережелеріне сай арам деп есептелген адамдарға құрбандыққа шалынған қошқардың не бұзаудың қаны, немесе шалынып, өртелген жас сиырдың күлі бүркіліп себілетін. Сол арқылы олар сырттай тазартылатын."},
	{14, "14 Олай болса, мәңгілік Киелі Рухқа кенелген, Өзін мүлдем кемшіліксіз құрбандық ретінде Құдайға ұсынған Мәсіхтің өз қаны рухани өлімге бастап әкететін қылықтардан ар-ұжданымызды одан бетер арылтып тазартпақ! Соның нәтижесінде біз мәңгі тірі Құдайға шынымен ғибадат ете аламыз."},
	{15, "15 Сол себептен де Мәсіх Жаңа Келісімнің негізін салушы! Ол адамдардың Көне Келісімнің тұсында жасаған күнәларының құнын төлеп оларды азат ету үшін өз жанын өлімге қиды. Сондықтан енді Құдай шақырғандар Оның уәде еткен мәңгілік жарылқауына ие болады."},
	{16, "16 Құдай бекіткен Келісімді өсиетнамамен салыстыруға болады: өсиетнаманы қалдырған кісінің өлгендігі анықталған соң ғана, оны ашып оқуға болады."},
	{17, "17 Өсиетнама адам тірі жүргенде емес, қайтыс болғаннан кейін ғана күшіне енеді."},
	{18, "18 Сол сияқты, бұрынғы Келісім де қанмен бекітіліп, күшіне енді."},
	{19, "19 Алдымен Мұса пайғамбар бүкіл Исраил халқына Таурат заңының барлық өсиеттері мен ережелерін жариялаған еді. Содан кейін құрбандыққа шалынған бұзаулар мен қошқарлардың қанын алып, су қосты да, сайсағыз бұтақшалары мен аздаған ал қызыл түсті жүнді соған малып алып, Келісім кітабына және бүкіл халыққа бүркіп тұрып:"},
	{20, "20 Бұл — Құдайдың өздеріңмен жасаған Келісімін бекітетін қан, — деді."},
	{21, "21 Дәл солай Мұса киелі шатырға да, Құдайға қызмет жасағанда қолданылатын барлық бұйымдарға да қан бүркіп септі."},
	{22, "22 Таурат заңы бойынша бәрі дерлік қанмен тазартылады. Қан төгілмей, Құдай күнәні кешірмейді."},
	{23, "23 Сонымен, көктегі киелі үйдің көшірмесі болған жердегі ғибадат орны құрбандыққа шалынған малдың қаны арқылы тазартылуға тиіс болды. Алайда көктегі киелі үй үшін бұдан әлдеқайда құнды құрбандық жасау қажет еді."},
	{24, "24 Себебі Мәсіх адам қолымен жасалған ғибадат орнына кірмеді. Сол ғибадат орны шынайы киелі үйдің көшірмесі ғана болатын. Қайта, Мәсіх көктің өзіне енді. Ол қазір сонда Құдайдың алдында тұрып, бізді қолдап сөйлейді."},
	{25, "25 Көне Келісімге сай бас діни қызметкер шалынған құрбандықтың қанын киелі үйдің ең қасиетті бөліміне жылма-жыл алып кіреді. Ал көкке енген Мәсіхке өз жанын қайта-қайта құрбан етудің қажеті жоқ."},
	{26, "26 Әйтпесе Ол әлем жаратылғаннан бері әлденеше рет азап шегіп өлуге мәжбүр болған болар еді. Керісінше, Мәсіх қазір, дүниенің ақырғы заманында, бір-ақ рет жер бетіне келіп, адамдарды күнәларынан біржола арылту үшін Өзін құрбандыққа қиды."},
	{27, "27 Құдай адамның бір рет өліп, содан соң қиямет сотының алдында тұратынын белгілеген."},
	{28, "28 Сол секілді Мәсіх бір рет көптеген адамдардың күнәларын өз мойнына алып құрбан болды. Ол дүниеге қайта оралған кезде тағы да күнәнің құнын өтеу үшін емес, Өзін аңсап күтіп жүргендерді түгелдей құтқару үшін келеді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct kk10 poems[] = {
	{1, "1 Таурат заңына негізделген ескі құлшылық ету жолы Құдайдың адамдарға дайындап қойған игілігінің өзі емес, оның күңгірт жобасы ғана. Сол заң бойынша жыл сайын қайталап жасала беретін бірдей құрбандықтар Құдай алдына баратын адамдарды еш уақытта түпкілікті тазартып, мүлтіксіз ете алмайды."},
	{2, "2 Егер адамдар құрбандық жасаулары арқылы біржола тазартылса, онда олар өз күнәкарлықтарын сезінуден қалып, құрбандық жасауларын доғарған болар еді."},
	{3, "3 Ал шын мәнісінде жылма-жыл ұсынылатын құрбандықтар адамдардың жасаған күнәларын естеріне түсіріп қана отырады."},
	{4, "4 Өйткені құрбанға шалынған бұқалар мен қошқарлардың қаны адамның күнәсін толығымен алып тастай алмайды."},
	{5, "5 Сол себепті Мәсіх бұл дүниеге келгенде, Өзін құрбандыққа қиятыны туралы (Құдай Әкеге) мынадай сөздер айтқан: Құрбандықтар мен сый-тартуларды қаламадың, Бірақ Маған тәндік денемді дайындадың."},
	{6, "6 Шалып, өртелетін не күнәнің құнын Өтейтін құрбандықтарды жақтырмадың."},
	{7, "7 Сонда Мен былай дедім: Міне, келе жатырмын, Уа, Құдай, Сенің еркіңді орындау үшін. Шиыршық кітапта Мен туралы жазылған."},
	{8, "8 Сол құрбандықтардың Таурат заңына сай ұсынылатынына қарамастан, Ол алдымен былай деді: Құрбандықтар мен сый-тартуларды қаламадың, шалып, өртелетін не күнәнің құнын өтейтін құрбандықтарды жақтырмадың."},
	{9, "9 Содан кейін Ол: Келе жатырмын, уа, Құдай, Сенің еркіңді орындау үшін деп қосты. Осылайша Тәңір Ие бұрынғы құрбандық рәсімдерін доғартып, олардың орнына Мәсіхтің құрбандығын енгізді."},
	{10, "10 Иса Мәсіхтің өз денесін біржола құрбан етіп, Құдайдың еркін орындауы арқылы біз Оның қасиетті адамдарына айналдық."},
	{11, "11 Әрбір діни қызметкер күн сайын міндетін атқарып, әрдайым бірдей құрбандықтарды ұсынады. Бірақ шын мәнісінде солар ешқашан күнәларды толығымен алып тастай алмайды."},
	{12, "12 Ал біздің Бас діни қызметкеріміз — Мәсіх сенушілердің күллі күнәларының құнын өтеп, тазарту үшін бір ғана құрбандық ұсынған соң, Құдайдың оң жағындағы құрметті орнына мәңгілікке жайғасты."},
	{13, "13 Енді Ол барлық жауларының Өзінің табанының астына салынып берілуін күтіп отыр."},
	{14, "14 Сонымен Мәсіх Құдайға бағышталғандарды жалғыз-ақ құрбандығымен мәңгілік кінәратсыз таза қылды."},
	{15, "15 Киелі Рух та бізге осыны растайды. Алдымен Ол былай деді емес пе:"},
	{16, "16 Жаратқан Ие мынаны айтады: Менің кейінгі заманда Исраил халқымен жасайтын Келісімім мынадай болады: Мен өз тәлімімді жүректеріне дарытамын әрі ақыл-саналарына жазып та қоямын."},
	{17, "17 Бұған Ол мына тәрізді сөздерді қосты: Мен олардың күнәлары мен әділетсіз істерін бұдан былай есіме алмайтын боламын."},
	{18, "18 Ал күнәлар кешірілген жерде енді қайтып оларды алып тастайтын құрбандықтың қажеті де жоқ."},
	{19, "19 Сонымен, бауырластар, Исаның өз қанын төккенінің арқасында енді нық сеніммен ең қасиетті орынға кіре аламыз."},
	{20, "20 Өйткені Құдай алдына баруымызға бөгет болған шымылдықты Иса өз денесін құрбан етуімен қақ айырып, біз үшін мәңгілік өмірге жаңа жол ашты."},
	{21, "21 Ол, сондай-ақ, ұлы Діни қызметкеріміз ретінде бүкіл Құдай үйінің үстінен қарайды."},
	{22, "22 Сондықтан да адал жүрекпен, нық сеніммен Құдай алдына барып, Оған сиынайық. (Мәсіхтің төгілген қаны) жүректерімізге бүркіліп, ар-ұжданымыз күнә атаулыдан арылған әрі денеміз таза сумен жуылған болсын."},
	{23, "23 Мойындаған үмітімізді үзбей, берік ұстанайық, себебі уәде берген Құдай сөзіне адал."},
	{24, "24 Өзара сүйіспеншілік көрсетіп, игілік істеуге қозғау салудың қамын ойлайық."},
	{25, "25 Кейбіреулер сенушілердің жиналыстарына бармай қалуды дағдыға айналдырып алған сияқты. Ал біздер солай істемей, бір-бірімізді одан бетер жігерлендірейік. Иеміздің қайтып келетін күнінің таяп қалғанын білесіңдер ғой."},
	{26, "26 Ал егер шынайы хабарды естіп-білгеннен кейін де әдейі күнә жасай берсек, онда бізді күнәміздан арылта алатын ешқандай құрбандық жоқ."},
	{27, "27 Қайта, қиямет сотын және Иемізге қарсы шыққандарды жалмайтын тозақ отын үрейленіп күтуден басқа бізге түк те қалмайды."},
	{28, "28 Егер біреу Мұсаға берілген Таурат заңынан бас тартып, онысын екі-үш куә дәлелдесе, сол адам аяусыз өлімге кесіледі."},
	{29, "29 Ендеше Құдайдың рухани Ұлын аяқпен таптағандай менсінбеген әркім бұдан бетер қаншама ауыр жазаға лайық деп ойлайсыңдар! Сондайлар Тәңір Ие Жаңа Келісімін бекіткен Исаның қаны арқылы күнәларынан арылғанмен, енді Оның қанына немкетті қарайды, әрі өздеріне Құдайдың рақымын жеткізген Киелі Рухты қорлайды."},
	{30, "30 Кек алу — Менің ісім, соның есесін қайтарамын Мен Өзім дегеннің Кім екенін білеміз ғой. Жаратқан Ие сотта тергейді өз халқын деп те (Тауратта) жазылған."},
	{31, "31 Мәңгі тірі Құдайдың қолына түсіп, сотталу қандай қорқынышты!"},
	{32, "32 Бұрынғы уақытты еске алыңдаршы: Құдайдың нұры жүректеріңді ағартқаннан кейін, сендер азапқа толы күреске тап болып, соған төтеп бердіңдер."},
	{33, "33 Кейбіреулерің масқараға, зорлық-зомбылыққа ұшырап, жұрт қызықтап қарайтын тамашаға айналдыңдар. Ал өзгелерің осылай күйзеліп жүрген бауырластарыңның қасіретін бөлісіп,"},
	{34, "34 тұтқынға түскендерге жандарың ашып, жәрдем бердіңдер. Мал-мүліктеріңді талан-таражға салғанда, бұны тіпті қуана қабылдадыңдар! Себебі көкте өздеріңе арналған, одан әлдеқайда құнды, мәңгілік дәулеттің бар екенін білдіңдер."},
	{35, "35 Ендеше жігер берген нық сенімдеріңнен күдер үзбеңдер! Сол үшін берілетін зор сый алдарыңда күтіп тұр."},
	{36, "36 Құдайдың еркін орындап, Оның уәде еткенін иемдену үшін төзімді болуларың қажет."},
	{37, "37 Себебі келуге тиісті Ол сәлден кейін келіп, еш кешікпейді."},
	{38, "38 Әділ адамым сенімі арқылы шынайы өмір сүреді. Ал кім қаймығып, бағытынан кері қайтса, Мен оған риза болмаймын."},
	{39, "39 Бірақ біз алған бағытынан кері қайтып, тозаққа түсетіндердің қатарынан емеспіз. Қайта, Құдайға нық сеніп, мәңгі құтқарылмақпыз."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct kk11 poems[] = {
	{1, "1 Ал сенім дегеніміз — үміттенгеннің жүзеге асатынына күмәнданбау, әлі де көрінбей тұрған уәденің орындалуына шүбәсіз илану."},
	{2, "2 Тәңір Иеге осындай сенім артқандары үшін ата-бабаларымыз Оның ризашылығына ие болды."},
	{3, "3 Құдайдың әлемді айтқан сөзімен жаратып, ретке келтіргенін, яғни көз алдымыздағы жаратылысты көзге көрінетін заттан емес, ғайыптан жасап шығарғанын сенімімізбен ұғынамыз."},
	{4, "4 Құдайға сенгендіктен Әбіл Оған арнап Қабылдікінен гөрі тиімді құрбандық жасады. Сенімі арқылы Әбіл ақталды, өйткені Құдай оның ұсынған сый-тартуларын ұнатып қабылдады. Әбіл өлтірілген болса да, оның сеніммен істегені әлі де үлгі болып келеді."},
	{5, "5 Енох Құдайға сенгені үшін ажалға жолықтырылмай бұ дүниеден әкетілді. Ол жер бетінен ғайып болды, себебі Құдай оны Өзіне алып кеткен еді. Енохтың бұған дейінгі өмірінің Құдайға ұнамды болғаны туралы да Тауратта куәлік берілген."},
	{6, "6 Ал сенім артпай Құдайға ұнау мүмкін емес. Құдайға келген әркім Оның бар екеніне сенуге және Өзін іздеп, жақыннан танығысы келгендерді Құдайдың жарылқайтынына илануға тиіс."},
	{7, "7 Нұх пайғамбар әлі де көзге көрінбеген топан су туралы ескертілгенде, Құдайға сеніп, Оны терең қастерледі, сондықтан отбасын құтқару үшін кемесін жасап дайындады. Осы сенімімен Нұх дүниенің қиқарлығын әшкереледі, әрі сенім арқылы болатын ақталуға қолы жетті."},
	{8, "8 Ыбырайым пайғамбар да Құдай өзін шақырып алып, кейін тұрақты меншігіне беруге уәде еткен елге барып тұруға бұйырғанда, Оған сеніп, мойынсұнды. Ыбырайым қайда бара жатқанын білмесе де, жолға шықты."},
	{9, "9 Уәде етілген елде ол жат жұрттық келімсек болып, Тәңір Иеге сеніп өмір сүрді. Сондай уәдені алған Ысқақ пен Жақып та Ыбырайым сияқты көшіп-қонып, шатырларда тұрып жатты."},
	{10, "10 Себебі Ыбырайым сәулетшісі де, құрылысшысы да Құдайдың Өзі болған, негізі берік қаланған мәңгілік қаланың пайда болуын күтіп жүрді."},
	{11, "11 Сенімі арқылы Ыбырайым жасы ұлғайған шағында әйелі Сарадан бала сүю үшін Құдайдың құдіретін қабылдады. Ол Сараның бедеулігіне қарамастан, ұлды етуге уәде берген Тәңір Иені сөзінде тұрады деп санады."},
	{12, "12 Сондықтан төрінен көрі жуық қарт адамнан аспандағы жұлдыздар мен теңіз жағалауындағы құм қиыршықтарындай сансыз көп ұрпақ тарады."},
	{13, "13 Ыбырайым, Ысқақ, Жақып үшеуі де сенімдерін ұстанған күйі дүние салды. Тәңір Ие өздеріне уәде еткен игіліктерді иемденбестен соларды тек алыстан ғана көріп, қуанды. Олар өздерінің жер бетінде тек жат жұрттық келімсек ретінде тұрғандарын мойындады."},
	{14, "14 Осылай айтқандар өздерінің шынайы отандарын көздеп жүргендерін білдіреді."},
	{15, "15 Өздері тастап кеткен елдерін естеріне түсіріп отырса, соған қайта оралудың орайы да болар еді."},
	{16, "16 Ал олар одан гөрі жақсы елді, яғни көктегі отандарын, аңсап күтті. Сол себептен де Құдай олардың Құдайы деп аталудан бас тартпайды, соларға арнап Ол көкте мәңгілік қаланы дайындап та қойды."},
	{17, "17 Ыбырайым сенімі сыналғанда Құдайға нық сенгендіктен Ысқақты құрбандыққа ұсынды. Ол туралы сенің ұрпағың Ысқақтан тарайтын болады деген уәде алғанымен, Ыбырайым жалғыз ұлын құрбан етуге дайын болды."},
	{18, "19 Ыбырайым Құдай баламды өлімнен қайта тірілтуге де құдіретті деп есептеді; астарлап айтқанда, ол баласын өлімнен қайтарып алды да."},
	{19, "20 Ысқақ та Құдайға сенім артып, ұлдары Жақып пен Есауға олардың болашағы жайында көреген батасын берді."},
	{20, "21 Жақып өлер алдында сеніміне бола Жүсіптің екі ұлына батасын беріп, таяғының басына сүйеніп тұрып Құдайға ғибадат етті."},
	{21, "22 Жүсіп Құдайға сенгендіктен, бұ дүниеден аттанарда Исраил ұрпақтарының келешекте Мысырдан көшіп шығатындары жайлы ескертіп, өзінің сүйегін бірге алып кетулерін өсиеттеді."},
	{22, "23 Мұса пайғамбардың әке-шешесі Құдайға сенгендіктен, жаңа туған нәрестесін үш ай бойы жасырып қойды. Оның ерекше сәби екенін көрген олар Мысыр патшасы перғауынның жарлығынан қаймықпады."},
	{23, "24 Сеніміне бола Мұса жасы кәмелетке келгенде перғауынның қызының баласы деп аталудан бас тартты."},
	{24, "25 Ол күнәкар өмірдің өткінші рақатынан гөрі Құдай халқымен бірге жәбірленуді таңдады."},
	{25, "26 Осылай Мұса (Құдай уәде еткен) Мәсіх үшін масқара болуды Мысырдың қазыналарынан артық байлыққа санады. Себебі ол болашақтағы зор сыйды көздеді."},
	{26, "27 Мұса Тәңір Иеге сенгендіктен, патшаның қаһарынан қаймықпай, Мысырды тастап кетті. Ол көзге көрінбейтін Жаратқан Иеге көріп тұрғандай иланып, Оның тапсырғандарына берік болды."},
	{27, "28 Мұса сеніміне бола Құтқарылу мейрамында исраилдіктерге құрбандыққа тоқты шалып, соның қанын босағаларына жағу рәсімін орындатты. Осылай мысырлықтардың тұңғыштарын өлтіруші (періште) оларға жоламады."},
	{28, "29 Исраил халқы Құдайға сенгендіктен, Қызыл теңізден құрғақ жермен жүргендей өте шықты. Мысырлықтар да солай істемекші болғанда суға батып қырылды."},
	{29, "30 Исраилдіктер Тәңір Иеге сеніп Иерихон қаласын жеті күн бойы айналып жүргеннен кейін оны қоршаған қамалдары құлап түсті."},
	{30, "31 Бұрын жеңіл жүрісті болған Рахаб Құдайға сенім артқандықтан, исраилдік барлаушыларды үйіне түсіріп, аман-есен сақтап қалды. Сол себепті ол Құдайға мойынсұнбаған жерлестерімен бірге өлтірілген жоқ."},
	{31, "32 Тағы не айтайын? Гедеон, Барақ, Самсон, Ефтах, Дәуіт, Самуил және басқа пайғамбарлар туралы әңгімелеуге уақытым жетпес те еді."},
	{32, "33 Олар Құдайға сенгендіктен патшаларды жеңіп шығып, әділдік орнатып, уәде етілгенге ие болды. Кейбіреулері арыстандардың аузын жауып,"},
	{33, "34 жалын шашқан өртті сөндіріп, семсер жүзінен аман қалды. Олар әлсірегенде Құдайдан күш алып, ұрыс-шайқаста нығайып, жау жасақтарын қуып шықты."},
	{34, "35 Кейбір әйелдер өлгендері қайта тіріліп, олармен қайтадан қауышты. Ал қиналып өлтірілген басқалар да болды. Олар сатқындықпен бостандық алудан бас тартып, өздерінің әлдеқайда жақсы өмірге қайта тірілулерін көздеді."},
	{35, "36 Өзге кейбіреулері мазаққа ұшырап, соққыға жығылып, шынжырмен құрсауланып, түрмеге жабылды."},
	{36, "37 Біреулері таспен атқыланып, арамен кесіліп, семсермен шабылып өлтірілді. Басқалары қой-ешкінің терісін жамылып, жоқшылық көріп, азапталып жәбірленді."},
	{37, "38 Күнәкар дүние сондай ержүрек адамдарға лайықсыз еді! Олар айдалада таулы-тасты жерлерде қаңғып жүріп, үңгірлер мен апандарда жасырынып өмір сүрді."},
	{38, "39 Бұлардың барлығы сенімдерінің арқасында Тәңір Иенің ризашылығына ие болды. Дегенмен Оның уәде еткенін иемдене алмады."},
	{39, "40 Себебі Құдай біз үшін одан да жақсы жоспар ойлап қойған болатын: Ол осы адамдарды бізбен бірге ғана кемелді етіп, мәңгілік мақсатына жеткізуді қалады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct kk12 poems[] = {
	{1, "1 Осылай өз сенімдерін айқын паш еткен қалың көпшілік бізді жарыстағы жанкүйерлердей қоршап тұр. Сондықтан да бізге бөгет болатынның барлығынан, әсіресе, тез шырмап алатын әрбір күнәдан арылып, алдымыздағы жарысты қажырлылықпен аяқтайық!"},
	{2, "2 Басқа жаққа мойын бұрмай, бар назарымызды Исаға аударайық! Бастапқыда сенім жолын салған Ол бізді сеніміміз арқылы Құдай белгілеген мақсатымызға жеткізеді де. Иса Өзін күтіп тұрған зор қуаныш үшін айқышқа шегеленудің қорлығын елемей, соған төзді. Бұдан кейін Ол Құдайдың тағының оң жағындағы құрметті орнына жайғасып отырды."},
	{3, "3 Исаның күнәкарлардың қаншама жауыздықтарына шыдағанын ескеріңдер! Осылай сендер де қажымаңдар, жігерлеріңді жасытпаңдар!"},
	{4, "4 Күнәға қарсы тойтарыс берген күрестеріңде сендер әлі де қандарыңды төгіп, жандарыңды пида еткен жоқсыңдар."},
	{5, "5 Расында Құдайдың сендерді Өзінің рухани балалары деп атаған мынадай ескертпесін ұмыттыңдар ма: Балам, Тәңір сені тәрбиелегенде Онысын ешқашан менсінбей жүрме, Ол сені жөнге келтіргенде, Лайым еңсең түсіп жүнжіме!"},
	{6, "6 Иеміз сүйетін әркімді де Түзетіп тәрбиелейді де, Бауырына басқан әр баласын да Жазалайды қажет болғанда."},
	{7, "7 Көріп жатқан азаптарыңа тәрбие ретінде шыдаңдар. Құдай сендерге рухани баласына қарағандай қарайды. Әкесі түзетпейтін бала бола ма?"},
	{8, "8 Барлық сенушілер де соны бастарынан өткізеді. Егер сендер осылай тәрбиеленбесеңдер, онда Оның шынайы рухани балалары болмағандарың."},
	{9, "9 Туған әке-шешелеріміз бізді тәрбиеледі, біз оларды қастерлеп, сыйлап келеміз. Ендеше шынайы өмірге ие болу үшін көктегі рухани Әкемізге одан бетер мойынсұнумыз керек емес пе?"},
	{10, "10 Әке-шешелеріміз өз пайымдауларынша шектеулі уақыт аралығында жазалап та тәрбиелесе, Құдай бізді нағыз игілігіміз үшін басымызға қиыншылықтар туғызып тәрбиелейді. Осылайша Өзінің қасиетті болғанындай бізді де қасиетті етуді көздейді."},
	{11, "11 Кезінде әрбір жаза қуаныш емес, реніш туғызады. Ал соны басынан өткізіп тәрбиеленгенге ол кейінірек әділдік пен тыныштықтың игілікті жемісін береді."},
	{12, "12 Сонымен салдырап, дәрменсіз қалған аяқ-қолдарыңның буындарын бекітіп, еңселеріңді көтеріңдер!"},
	{13, "13 Рухани жағынан әлсіреген бауырластарыңның адаспай, қайта, сауығып кетулері үшін түзу жолмен аяқтарыңды нық басып жүріңдер!"},
	{14, "14 Барлық адамдармен тату болып, Құдайға бағышталған қасиетті өмір сүруге ұмтылыңдар! Мұнсыз ешкім Жаратқан Иені көре алмайды."},
	{15, "15 Абай болыңдар, ешқайсың Құдайдың рақымынан құр қалып жүрмеңдер! Әйтпесе улы жеміс беретін тамырды қазып алып тастамаса, оның қайтадан көктеп, қаулап өсіп кететіні сияқты, мұндай адамдарың өздерінің жаман көзқарастарына көптеген басқаларды да еліктіріп, арамдап, зор зиян тигізетін болады."},
	{16, "16 Ешқайсыларың да опасыз болып, азғын өмір сүрмеңдер! Яки Есау сияқты қасиетті атаулыға немқұрайды қарамаңдар! Ол бір ішер тамаққа бола өзінің тұңғыштық жолын сата салды ғой."},
	{17, "17 Кейінірек ол әкесінің ерекше батасын алғысы келгенмен, өтініші қабылданбады. Есау жылап тұрып жалбарынса да, өзінің істеп қойғанын өзгерте алмады."},
	{18, "18 Сендер ата-бабаларымыз іспетті көріп-естуге болатын мынадай жайтты бастарыңнан өткізбедіңдер: олар от болып лаулап жанып жатқан Синай тауына жақындады. Айнала қара түнек болып, сұрапыл дауыл соғып,"},
	{19, "19 кернейдің қатты даусы шығып, сөздер айтылды. Соны естіген халық мұндай сөздерді енді қайтып естімесек екен деп жалбарынды."},
	{20, "20 Олар Тауға аяқ-қолдарын тигізген әркімді, тіпті мал тұяғы тисе де, оны таспен атқылап өлтіру керек деген бұйрықтан қорықты."},
	{21, "21 Осы көріністің әсерінің үрей туғызатындай болғаны сонша, Мұса пайғамбардың өзі: Мен қорқып, үрейленіп тұрмын, — деді."},
	{22, "22 Ал сендер рухани Сион тауына, яғни мәңгі тірі Құдайдың көктегі Иерусалим қаласына, әрі ондағы сан-мыңдаған періштелерге келдіңдер."},
	{23, "23 Сондай-ақ, сенушілердің мерекелік жиыны мен қауымына қосылдыңдар. Сендер де, біз де Тәңір Иеге әке мен тұңғыш баласындай жақынбыз, есімдеріміз Оның көктегі кітабына жазылған. Барлық адамдарға үкім шығаратын Құдайдың алдына, әрі өткен кезеңдерде сенімдері арқылы ақталып, мақсаттарына жеткендерге"},
	{24, "24 және Жаңа Келісімнің негізін салған Исаға да келдіңдер. Оның төгілген қаны Әбілдікінен гөрі игілікті хабарға меңзейді."},
	{25, "25 Абай болыңдар, өздеріңе сөйлеп тұрған Тәңір Иені тыңдаңдар! Ежелде Оның тапсырмасымен жер бетінде сөйлеген Мұса пайғамбарды тыңдамай қойған Исраил халқы жазадан құтылмады. Ендеше бізге көктен сөйлеп тұрған Құдайдың Өзінен бас тартсақ, онда алатын жазамыздан одан бетер құтыла алмаймыз!"},
	{26, "26 Сол кезде Тәңір Иенің зор даусы жерді шайқалтты. Ал қазіргі заман туралы Құдай пайғамбары арқылы мынадай уәде берді: Мен тағы да жер түгіл, аспанды да шайқалтамын!"},
	{27, "27 Тағы да деген сөздер мынаны білдіреді: Құдай Өзі жаратқанның барлығын шайқалтып, орнынан алып тастамақ. Сонда тек шайқалтуға болмайтындар ғана қалады."},
	{28, "28 Сонымен, өзіміз шаңырағы ешқашан шайқалмайтын Патшалықтан үлес алғандықтан, біз сол үшін Құдайға шын жүректен шүкірлік айтайық! Оны риза қылатындай қызмет етіп, терең қастерлеп, Оған ұнамсызды істеуден шошынатын болайық!"},
	{29, "29 Біздің сиынатын Құдайымыз жалмап қоятын от іспетті!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct kk13 poems[] = {
	{1, "1 Бір-біріңді бауырластар ретінде ұдайы жақсы көріңдер!"},
	{2, "2 Қонақжайлылық танытуды ұмытпаңдар. Солай еткен кейбіреулер білместен тіпті Тәңір Иенің періштелерін қонақ қылды."},
	{3, "3 Тұтқынға түскендеріңнің қамын ойлап, солармен бірге құрсауда отырғандай сезініңдер. Жәбір көріп жүргендерді өздерің де тәндік азап шеккендей естеріңнен шығармай, қолдау көрсетіңдер!"},
	{4, "4 Некеге барлығың да құрметпен қарап, жар төсегін былғамаңдар! Азғындар және неке адалдығын бұзғандар Құдайдың сотына түспек."},
	{5, "5 Ақшақұмар болмай өмір сүріп, қолдағы барды қанағат тұтыңдар! Құдай: Мен сені ешқашан тастап та кетпеймін, жалғыз да қалдырмаймын, — деген ғой."},
	{6, "6 Сондықтан да біз: Ием маған жар, мен қорықпаймын ешбір жайттан, не істей алады адам баласы маған? деп нық сеніммен айтамыз."},
	{7, "7 Өздеріңе Құдайдың хабарын айтқан жетекшілеріңді ұмытпаңдар. Олардың қалай өмір сүріп, қалай бұ дүниеден кеткендерін естеріңде ұстап, сенімдерін үлгі-өнеге етіңдер!"},
	{8, "8 Иса Мәсіх өткенде, қазір және болашақта мәңгілік Өзі болып қала береді."},
	{9, "9 Түрлі бөтен ілімдерге ілесіп кетпеңдер! Жан дүниеміздің Құдайдың рақымымен нығаюы игі. Бұған ішіп-жеуге болатын тағамдар туралы діни ережелердің қатысы жоқ. Мұндайларды ұстанғандар олардан еш пайда таппайды."},
	{10, "10 Мәсіх біз үшін өмірін құрбан етті. Ал ғибадатханада ескі рәсімдерге сай құлшылық етіп жүргендерге Мәсіхтің құрбандық өлімінен келер пайда жоқ."},
	{11, "11 Сол рәсімдер бойынша бас діни қызметкер күнәнің құнын өтеу үшін құрбандыққа шалынған малдардың қанын (жылына бір рет) киелі үйдің ең қасиетті бөліміне алып барады. Ал құрбандықтардың өздері ел қонысының сыртына шығарылып, өртеледі."},
	{12, "12 Сол сияқты Иса да, адамдарды Өзінің қаны арқылы Құдайға бағыштап қасиетті ету үшін қала қақпасының сыртында азапталып, құрбан болды."},
	{13, "13 Сондықтан біз ескі құлшылық ету рәсімдерінен аулақ шығып, Мәсіхке еріп, Оның көрген қорлығын бөлісейік."},
	{14, "14 Осы күнәкар дүниеде біз тұратын мәңгілік қала жоқ, қайта, көктегі келешек қаланы аңсап күтудеміз."},
	{15, "15 Сонымен Мәсіх арқылы Құдайды үнемі мадақтап сый-тартуымызды ұсынайық: Оның Жаратқан Ие деген атағын ауызбен де мойындап, дәріптеуіміз біздің Тәңір Иеге арнаған құрбандығымыз болады."},
	{16, "16 Сондай-ақ, қолдағы игіліктеріңмен өзара бөлісіп жақсылық жасауды ұмытпаңдар! Мұндай құрбандықтарға да Құдай риза."},
	{17, "17 Жетекшілеріңе мойынсұнып, айтқандарын тыңдаңдар. Олар ұдайы рухани өмірлеріңнің қамын жеп, сол қызметтері туралы Мәсіх алдында есеп беруге тиісті. Мұны қинала емес, қуана атқарулары үшін оларға мойынсұныңдар. Олай етпесеңдер, өздерің зиян көресіңдер."},
	{18, "18 Біз үшін Құдайға сиыныңдар. Ар-ұжданымыздың таза екеніне сенімдіміз, барлық жағдайда да адал жүруге ұмтыламыз."},
	{19, "19 Маған тезірек өздеріңе қайтып баруға жол ашсын деп Тәңір Иемізден тілеулеріңді ерекше өтінемін."},
	{20, "20 Татулық пен тыныштық орнатқан Құдай біздің Иеміз Исаны өлімнен тірілтіп алды. Иеміз өз қанын төгіп құрбан болуымен мәңгілік Жаңа Келісімді бекіткендіктен, сенушілер қауымының Ұлы Бағушысы болды."},
	{21, "21 Лайым Құдай Өзінің айтқандарын орындауларың үшін сендерге қажетті барлық жақсылықты дарыта көрсін, әрі Өзіне ұнайтын игі істерді Иса Мәсіхтің қолдауымен сендерге жасата берсін. Мәсіхтің ұлылығы мәңгілік мадақтала берсін! Аумин."},
	{22, "22 Қымбатты бауырластар, өтінемін, сендерге арнаған ескертпелерімді қабыл алыңдар; қысқа ғана жаздым емес пе?"},
	{23, "23 Бауырласымыз Тімотенің тұтқыннан босатылғанынан хабардар болыңдар. Егер ол мұнда тезірек келсе, онымен бірге өздеріңді көретін ойым бар."},
	{24, "24 Барлық жетекшілеріңе және Құдайдың бүкіл халқына сәлемімді жеткізіңдер. Италиялық бауырластарымыз да сендерге сәлем жолдауда."},
	{25, "25 Лайым бәріңе Құдай жар болып, рақымын жаудыра көрсін! (Аумин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};