#include <map>
#include <string>
class Bible55
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Құдайдың Мәсіх Исамен байланыстағыларға шынайы өмірді уәде еткендігін жариялау үшін Оның еркімен Мәсіх Исаның елшісі болған Пауылдан"},
	{2, "2 сүйікті рухани балам Тімотеге дұғай сәлем. Құдай Әкеміз бен Иеміз Мәсіх Иса саған рақымы мен қайырымын жаудырып, тыныштығын сыйлай берсін."},
	{3, "3 Ата-бабаларым қызмет еткен Құдайға мен де таза ар-ұжданыммен қызмет етемін. Оған сен үшін күні-түні шүкірлік етіп, дұғаларымнан өзіңді ешқашан тастамаймын."},
	{4, "4 (Қоштасқандағы) көз жасыңды есіме түсіріп, сені қайтадан көріп қуанышқа кенелуді қатты аңсаймын."},
	{5, "5 Шынайы сенімің есімде. Ол алдымен әжең Лойда мен анаң Әуникенің жүректерінен орын алған еді. Оның сенің жүрегіңнен де орын алғанына көзім жетті."},
	{6, "6 Сол себепті саған ескертемін: мен үстіңе қолымды қойып сиынғанымда Құдай рақым етіп, өзіңе берген дарынды көбірек ынтамен қолдан!"},
	{7, "7 Өйткені Құдай бізге қорқыныш емес, күш, сүйіспеншілік және ұстамдылықты дарытатын Киелі Рухын сыйлады."},
	{8, "8 Сондықтан да Иемізді ашық мойындаудан ешқашан тартынба! Иемізге бола түрмеде отырған мен үшін де ұялма. Қайта, Құдай беретін рухани күш-қуатқа сүйеніп, Ізгі хабар үшін азаптарды бірге көр."},
	{9, "9 Құдай бізді құтқарып, өз халқы ретінде қасиетті өмір сүруге шақырды. Ол мұны біздің жасаған игі істерімізге бола емес, Өзінің мақсаты мен рақымы бойынша істеді. Себебі Құдай бізге Иса Мәсіх арқылы рақымын сыйлауға әлем басталмастан бұрын-ақ ниеттенген еді."},
	{10, "10 Қазір Ол соны Құтқарушымыз Иса Мәсіхтің келуімен ашық көрсетті: Мәсіх өлімнің күшін жойып, Ізгі хабары арқылы шынайы, ешқашан өшпейтін өмірді жарыққа әкелді."},
	{11, "11 Тәңір Ие мені осы Ізгі хабарды халықтарға жариялаушы, елші және тәлім беруші етіп тағайындады."},
	{12, "12 Сол себептен мен осындай азап көріп жатырмын. Ал соған еш ұялмаймын, себебі Кімге сенім артқанымды білемін. Оның қайтып келетін күніне дейін Өзінің маған аманаттаған Ізгі хабарын аман-есен сақтайтынына кәміл сенемін."},
	{13, "13 Менен естігендеріңді дұрыс ілімнің үлгісі ретінде Иса Мәсіхке деген сеніммен және сүйіспеншілікпен берік ұстан!"},
	{14, "14 Өзіңе аманатталған Ізгі хабарды өмірімізден орын алған Киелі Рухтың көмегімен аман-есен сақта!"},
	{15, "15 Азия аймағындағы сенушілердің бәрінің дерлік мені тастап кеткенін білесің. Олардың арасында Фігел мен Ермоген де бар."},
	{16, "16 Иеміз Онисыфордың үй ішіне мейірімін сыйлай көрсін. Онисыфор әлденеше рет көңілімді көтеріп, жігерлендіріп, бұғауда отырған жағдайыма ешқандай ұялмады."},
	{17, "17 Керісінше, Римде болғанда ерінбей-жалықпай мені тапқанша іздеді."},
	{18, "18 Иеміз қайта оралатын күні оған мейірімін көрсете көрсін! Онисыфор маған Ефесте де қаншама қызмет еткенін өзің жақсы білесің ғой."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Ал сен, балам менің, Мәсіх Исаның сыйлайтын рақымымен күшейе бер."},
	{2, "2 Өзің менен естіп, көптеген кісілер растаған шынайы ілімді басқаларға да тәлім беруге қабілеті бар, сенімді жандарға аманатта!"},
	{3, "3 Иса Мәсіхтің адал сарбазы ретінде азаптарды бірге көр!"},
	{4, "4 Есіңде болсын: ешбір сарбаз тұрмыстық істермен шырмалмайды, қайта, қолбасшысының көңілінен шығуға ұмтылады."},
	{5, "5 Сондай-ақ, балуан күрес тәртібін бұзса, жүлдені жеңіп ала алмайды."},
	{6, "6 Жиналған өнімнен үлесін ең алдымен жан сала еңбектенген диқан алуға тиіс."},
	{7, "7 Айтқандарым туралы ойлана бер, сонда Құдай саған бәріне түсінік береді."},
	{8, "8 Дәуіттің ұрпағынан шыққан, өлімнен қайта тірілген Иеміз Иса Мәсіхті әрдайым есіңде ұста! Мен уағыздаған Ізгі хабар — осы."},
	{9, "9 Соған бола азап шегіп, қылмыскердей бұғауланудамын. Алайда Құдайдың сөзі бұғаулы емес!"},
	{10, "10 Сондықтан мен Құдайдың таңдаған адамдары үшін, олардың да Иса Мәсіх арқылы құтқарылып, мәңгілік ұлылықты иемденулері үшін бәріне де төземін."},
	{11, "11 Мынау — дәл айтылған, шынайы сөз: Егер Мәсіхпен бірге өлген болсақ, Онымен бірге өмір сүретін де боламыз."},
	{12, "12 Егер қиыншылықтарға төзе берсек, Онымен бірге патшалық ететін де боламыз. Ал егер Мәсіхті мойындаудан бас тартсақ, Ол да бізді мойындаудан бас тартпақ."},
	{13, "13 Біз айтқанымызға адал болмасақ, Ол айтқанына адал болып қала береді, Өз болмысымен келіспейтінді Ол істемейді."},
	{14, "14 Осыларды бәрінің есіне түсіріп, сөздер туралы айтыспасын деп Құдай алдында мықтап ескерт. Ондай айтыстардан ешқандай пайда жоқ. Қайта, олар тыңдағандардың сенімдеріне зор нұқсан келтіреді."},
	{15, "15 Сен кінәратсыз жұмысшы — Құдайдың шынайы сөзін дұрыс үйретуші ретінде Оған ұнамды болуға жан сала ұмтыл!"},
	{16, "16 Жай, бос әңгімелерден аулақ жүр. Бұларды айтатындар Құдайдың адал жолынан одан бетер адасып кетеді."},
	{17, "17 Олардың сөздері қабынған жарадай жайыла беріп, рухани денені құртпақ. Солардың арасында Үменей мен Філет те бар."},
	{18, "18 Олар шындық жолынан тайып, Қайта тірілу болып кетті, — деп жариялап, кейбіреулердің сенімдерін жоюда."},
	{19, "19 Бірақ Құдайдың салған негізі берік тұрады, онда мына сөздер мөрленіп жазылған: Иеміз Өзінікі болған адамдарын жақсы біледі және Иеміздің атын атап сиынатын әркім жамандықтан алшақтасын!"},
	{20, "20 Бір үлкен үйде алтын мен күмістен ғана емес, ағаш пен қыштан жасалған ыдыс-аяқтар да бар: алдыңғылары қадірмен тұтылса, соңғылар қадір-құрметтен ада. (Сол сияқты, қауымның көптеген мүшелері игі істерімен Құдайды құрметтесе, басқалары жамандықтарымен Оның даңқы мен ісіне нұқсан келтіреді.)"},
	{21, "21 Сол себепті, кім өзін соңғылардан арылтып таза ұстаса, қадірлі ыдыстар іспетті Қожайынына бағышталған, пайдалы және әрбір ізгі істер үшін қолданылуға дайын болады."},
	{22, "22 Сонымен жастықтың құмарлықтарынан бас тартып, пәк жүрекпен Иемізге сиынатындардың бәрімен бірге әділдік, сенім, сүйіспеншілік және татулыққа ұмтыл."},
	{23, "23 Ақылсыз, мәнсіз айтыстардан аулақ бол, олардың дау-жанжал туғызатынын білесің ғой."},
	{24, "24 Жаратқан Иенің қызметшісінің жанжалдасуына болмайды. Ол бәріне бірдей жылы жүзді, жақсылап тәлім беретін, сабырлы болып,"},
	{25, "25 қарсыластарын ілтипаттылықпен түзету қажет. Мүмкін болса, Құдай оларды өкіндіріп, шындықты мойындатар."},
	{26, "26 Осылайша олар ақылға келіп, өзінің еркіне бағындыру үшін ұстап алған шайтанның тұзағынан босап, құтыла алмақ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Есіңде болсын, соңғы дәуірде қиын-қыстау күндер туады."},
	{2, "2 Адамдар өзімшіл, ақшақұмар, мақтаншақ, тәкаппар, өсекшіл болып, ата-аналарына бағынбайды. Олар алғысты білмей, қасиеттіні танымай, ешкімді сүймей,"},
	{3, "3 ымыраға келмейді. Адамдар, сондай-ақ, жалақор, ұстамсыз, қатыгез болып, жақсылықты жек көреді."},
	{4, "4 Опасыз сатқын, ақылсыз қызба, кеуде көтерген олар Құдайдан гөрі ләззат-ермекті артық көреді."},
	{5, "5 Олар сырт көзге Құдайға ұнайтындай болып көрінгенмен, Оның күшінен бас тартады. Мұндай адамдардан аулақ жүр!"},
	{6, "6 Олардың кейбіреулері кісілердің үйлеріне қулықпен кіріп, түйсіксіз әйелдерді еліктіріп, құлдыққа түсіреді. Сондайлар күнәға белшесінен батып, түрлі құмарлықтардың жетегінде жүреді."},
	{7, "7 Олар әрдайым тәлім алуға ұмтылғанмен, ешқашан шындықты білуге қол жеткізбейді."},
	{8, "8 Янни мен Ямбыридың Мұса пайғамбарға қарсы күрескені сияқты, мұндай азғырушылар да шынайы ілімге қарсы шығады. Бұлардың ақылдары бүлінген, сенімдері түкке тұрғысыз, жалған."},
	{9, "9 Бірақ та олар алысқа бара алмайды, өйткені олардың ақылсыздығы бәріне айқын болады. Кезінде Янни және Ямбыримен де солай болған."},
	{10, "10 Ал сен маған еріп, менің ілімімді, жүріс-тұрысым мен өмірлік мақсатымды үлгі тұтып келесің. Сенімім, төзімділігім және сүйіспеншілігімді,"},
	{11, "11 әрі қуғындалып, азап шеккен кездерімде көрсеткен табандылығымды өз көзіңмен көрдің. Антақия, Қония және Лүстрада маған қандай жағдайлардың болғанының бәрін, сол қалаларда қандай қудалауды басымнан кешкенімді білесің. Ал Иеміз мені солардың бәрінен де құтқарды."},
	{12, "12 Мәсіх Исамен жүріп, Құдайға ұнамды өмір сүргісі келетіндердің бәрі де қуғындалатын болады."},
	{13, "13 Қараниеттілер мен алаяқтар бұрынғыдан бетер жамандық жасап, өздері де алданып, өзгелерді де алдай бермек."},
	{14, "14 Ал сен үйреніп, берік сенгендеріңе адал болып қала бер! Өйткені өзіңнің кімдерден тәлім алғаныңды білесің."},
	{15, "15 Сонымен бірге балалық шағыңнан-ақ Киелі жазбалармен таныссың. Олар сені парасатты етіп, Мәсіх Исаға деген сенімің арқылы құтқарылуға бастап әкеледі."},
	{16, "16 Киелі жазбалардың бәрі Құдай Рухының жетелеуімен жазылған. Олар тәлім беру, әшкерелеу, түзету әрі әділдікке тәрбиелеу үшін тиімді."},
	{17, "17 Осылай Құдайдың адамы барша игі іске дайындалып, толықтай даяр болмақ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Құдай (Әке) алдында және қайтып келіп көрініп, Патшалық құрғанда тіріні де, өлгенді де соттайтын Иса Мәсіх алдында саған мықтап ескертемін:"},
	{2, "2 Құдайдың сөзін уағызда! Мұны адамдарға ұнауы, ұнамауына қарамастан әрдайым орындауға табандылықпен ұмтыл. Олардың қателерін әшкерелеп, тыйым сал, әрі жақсылыққа жігерлендіре тұрып, зор сабырлылықпен тәлім бер!"},
	{3, "3 Себебі адамдар дұрыс тәлімді еш қабылдамайтын уақыт та туады. Олар жеке құмарлықтарының жетегінде кетіп, құлақтарына жағатындарды ғана айтатын тәлім берушілерді көптеп шақырып, соларды тыңдайтын болады."},
	{4, "4 Осылай олар шындыққа құлақ салмай, бос аңыздарға назар аудармақ."},
	{5, "5 Ал сен әрдайым қырағы, азапқа төзімді бол! Ізгі хабарды уағыздаушының міндетін атқарып, қызметіңді орындай бер!"},
	{6, "6 Менің қаным төгіліп құрбан болып, бұ дүниеден аттанатын кезім таяп қалды."},
	{7, "7 Мен ізгі күреске қатысып болдым, жарыста жүгіріп, мәреге жеттім, сенімімді сақтап қалдым."},
	{8, "8 Енді мені жеңімпаздың жүлдесі — әділдіктің тәжі күтіп тұр, оны маған сол күні әділ Төреші — Иеміз бермек. Ол тек маған ғана емес, Оның қайта оралып, анық көрінуін сүйіспеншілікпен күткендердің бәріне де сол жүлдені сыйлайды."},
	{9, "9 Маған тезірек келуге тырыс."},
	{10, "10 Себебі Димас осы күнәкар дүниені жақсы көріп, мені тастап, Салониқа қаласына кетті. Кіріскент Ғалатияға, ал Тит Далматияға аттанды."},
	{11, "11 Жалғыз Лұқа ғана қасымда. Марқаны тауып бірге ала кел, өйткені ол қызметіме пайдалы болмақ."},
	{12, "12 Түхікті Ефеске жібердім."},
	{13, "13 Трояда Қарпостың үйіне тастап кеткен шапанымды, сондай-ақ, шиыршық кітаптарымды да ала кел, әсіресе, жарғаққа жазылғандарын."},
	{14, "14 Мыс шебері Ескендір маған көп жамандық жасады. Иеміздің Өзі оған істегендеріне лайықтысын қайтарар."},
	{15, "15 Ескендір айтқандарымызға тым қарсы шықты, сен де одан сақтанып жүр."},
	{16, "16 Алғашқы тергеліп, жауапталған кезімде қасымда жақтаған ешкім болмады, қайта, бәрі мені тастап кетті. Құдай олардың мұнысын мойындарына артпай-ақ қойсын!"},
	{17, "17 Алайда Иеміз маған жар болып, әр ұлттық адамдардың естуі үшін Ізгі хабарды толықтай жариялауға күш-қуат беріп, мені арыстанның құлқынынан құтқарғандай, өлімнен аман алып қалды."},
	{18, "18 Иеміз мені болашақта да жамандық атаулыдан сақтап, Өзінің көктегі Патшалығына апармақ. Оның ұлылығы мәңгі мадақтала берсін! Аумин."},
	{19, "19 Прискила мен Ақилаға, сондай-ақ Онисыфордың үй ішіне сәлем айт."},
	{20, "20 Ераст Қорынт қаласында қалды, Трофимды ауырғандықтан Мілит қаласында қалдырдым."},
	{21, "21 Қыс түспей келуге тырыс. Еубұл, Пұд, Лин, Клаудия және барлық басқа бауырластарымыз саған сәлем жолдап жатыр."},
	{22, "22 Жаратқан Ие жар болып, рухыңды жігерлендіре көрсін, Оның рақымы бәріңе де жауа берсін! (Аумин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};