#include <map>
#include <string>
class Bible47
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
	struct kk7	{ int val; const char *msg; };
	struct kk8	{ int val; const char *msg; };
	struct kk9	{ int val; const char *msg; };
	struct kk10	{ int val; const char *msg; };
	struct kk11	{ int val; const char *msg; };
	struct kk12	{ int val; const char *msg; };
	struct kk13	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Құдайдың еркімен Мәсіх Исаның елшісі болған Пауылдан және бауырласымыз Тімотеден Құдайдың Қорынттағы қауымына және Оның бүкіл Ахая аймағындағы барлық адамдарына дұғай сәлем!"},
	{2, "2 Құдай Әкеміз бен Иеміз Иса Мәсіх сендерге рақымын жаудырып, тыныштық сыйлай көрсін!"},
	{3, "3 Иеміз Иса Мәсіхтің Әкесі Құдай мадақталсын! Құдай — қайырымды Әкеміз, жұбаныш пен жігер атаулының бастауы."},
	{4, "4 Ол бізді барлық азаптарымызда жұбатып, жігерлендіреді. Осылай Құдайдың өзімізді жігерлендірген жұбанышымен біз де әр түрлі қайғы-қасірет шегіп жүргендерді жігерлендіре аламыз."},
	{5, "5 Өмірімізде Мәсіхтің жолындағы азаптарымыздың молая түскеніндей, Ол арқылы көретін жұбанышымыз да ағыл-тегіл мол болады."},
	{6, "6 Азап шегуіміз сендердің жігерленіп, құтқарылуларыңа септігін тигізеді. Өйткені біз көрген жұбаныш өздеріңді де жігерлендіреді. Соның нәтижесінде сендер дәл біз сияқты азаптарды бастан кешкенде шыдамдылықпен төзе аласыңдар."},
	{7, "7 Өздерің жайындағы үмітіміз берік. Себебі азабымызды бөліскендеріңдей, біз қабылдайтын жұбанышты да бөлісетіндеріңді білеміз."},
	{8, "8 Сондықтан, қымбатты бауырластар, сендерді Азия аймағында тап болған қиындықтарымыздан хабарсыз қалдырғымыз келмейді. Басымызға түскен ауыртпалықтың шектен тыс, адам төзе алмастай болғаны сонша, тірі қаламыз деп үміттенбедік те."},
	{9, "9 Жүрегімізде өлімге кесілгендей сезіндік. Бұл жайт біздің өзімізге емес, Құдайға ғана сүйене алуымыз үшін де осылай болды. Ол өлгендерді тірілте алады ғой."},
	{10, "10 Мұндай қорқынышты ажал қаупінен Ол бізді құтқарып алды және әлі де құтқаруда; сондай-ақ болашақта да құтқаратын болады деп Оған нық сенім артамыз."},
	{11, "11 Бұған сендердің дұғаларың да септігін тигізеді. Осылайша көптеген сенушілердің мінажаттарына Құдай құлақ асып, бізге рақымын төгіп, сол үшін олар шүкірлік ететін болады."},
	{12, "12 Біздің айналамыздағы адамдармен, әсіресе өздеріңмен, Құдайға ұнамды ашықтықпен, адалдықпен қатынас жасап келгендігімізге ар-ұжданымыз куә; мұны мақтан тұтамыз. Ескі күнәкар болмысымыздың даналығымен емес, Құдайдың рақымына бола солай өмір сүріп келеміз."},
	{13, "13 Сендердің жазған хаттарымыздан оқып, түсінгендеріңнен өзге құпия ниетіміз жоқ. Мұнымызды ұға бастадыңдар, енді толық ұғасыңдар деп үміттенемін. Сонда Иеміз Иса қайтып келген күні біздің сендерді мақтан ететініміздей, өздерің де бізді мақтан тұтатын боласыңдар."},
	{14, "15 Бұның бәріне сенгенім сонша, сендер екі рет рухани игілікке ие болсын деп, алдымен өздеріңе баруға ниеттендім."},
	{15, "16 Осылайша Македонияға бара жатқанда да, қайтып келе жатқанда да сендерге соға кетуді жоспарладым. Бұдан кейін Яһудея аймағына аттанғанымда мені шығарып сала алар едіңдер."},
	{16, "17 Осыған ниеттенгенімде ұшқалақтандым ба? Әлде мені жоспарларын ескі күнәкар болмысына сүйеніп, біресе иә, біресе жоқ деп жасады дейсіңдер ме?"},
	{17, "18 Құдай берген уәдесіне берік болғандай, біздің сендерге айтқан хабарымыз да кейде иә, кейде жоқ емес, еш жалтақсыз!"},
	{18, "19 Сендердің араларыңда Сыйлас, Тімоте үшеуіміз уағыздаған Құдайдың рухани Ұлы Иса Мәсіх те біресе иә, біресе жоқ болған емес. Қайта, Ол арқылы Құдай иә дейді:"},
	{19, "20 Оның барлық уәделері Мәсіх арқылы жүзеге асып, иәға айналады; сондықтан аумин деп, Мәсіхтің атымен Тәңір Иенің ұлылығын мадақтаймыз."},
	{20, "21 Мәсіхпен байланысымызда бізді сендермен бірге табанды етіп, тағайындаған — Құдайдың Өзі:"},
	{21, "22 Ол бізге өз иелігінің таңбасын басып, берген уәделерінің орындалуының кепілі ретінде Киелі Рухын жүректерімізге орнықтырды."},
	{22, "23 Осы кезге дейін менің Қорынтқа келмегенім сендерді аяғандығымнан екеніне Құдай куә."},
	{23, "24 Сенімдеріңе өктемдік еткіміз келмей, қуаныштарың үшін өздеріңмен бірге еңбектенеміз. Өйткені сенімдерің арқылы беріксіңдер."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Сол үшін де мен сендерге бармай-ақ қояйын деген шешімге келдім. Себебі барсам, өздеріңді тағы да ескертіп, ренжітуіме тура келер еді."},
	{2, "2 Себебі егер сендерді ренжітсем, онда мені кім қуантпақ? Өзім қамықтырған сендерден басқа кім көңілімді серпілтер еді?"},
	{3, "3 Сондықтан да барып, мені қуантуға тиісті сендерден реніш табудың орнына сол хатты жазып жібердім. Бәріңнің мені қоштап, бірге қуанатындарыңа сендім."},
	{4, "4 Оны қатты қиналып, жүрегім ауырып, көзіме жас ала отырып жаздым. Өздеріңді қайғырту үшін емес, қайта, шексіз сүйетінімді ұғындыру үшін жаздым."},
	{5, "5 Сол ренішті туғызған адам болса, оның тек мені ғана емес, бәріңді де едәуір ренжіткені; тым асырып айтпау үшін едәуір дедім."},
	{6, "6 Мұндайға көпшіліктен алған жазасы жеткілікті."},
	{7, "7 Ендеше шексіз қайғыға батпасын деп, оны кешіріп, жігерлендіргендерің дұрыс болар."},
	{8, "8 Сонымен сендерден өтінерім: оған сүйіспеншіліктеріңді көрсетіңдер."},
	{9, "9 Сондай-ақ, барлық жағынан да айтқандарыма құлақ асар ма екенсіңдер деп тексеріп, сынау үшін де сол хатты жазып жібердім."},
	{10, "10 Сендер кешірген адамды мен де кешіремін. Ал менің кешіргенім — егерде оның бір айыбын кешіруім қажет болса — оны сендердің игіліктеріңді көздеп, Мәсіхтің алдында кешіргенім."},
	{11, "11 Әзәзіл шайтан бізден амалын асырмау үшін осылай істедім, оның зымиян ниетін жақсы білеміз."},
	{12, "12 Мәсіх туралы Ізгі хабарды уағыздау үшін Трояға келген кезімде Иеміздің маған Өзінің жұмысы үшін есік ашып қойғанын көрдім."},
	{13, "13 Бірақ сол жерден бауырласым Титті таба алмай мазам кетті. Сондықтан ондағы сенушілермен қоштасып, Македонияға жөнелдім."},
	{14, "14 Алайда Құдайға шүкір: Ол Мәсіхпен тығыз байланыстағы бізді әрдайым жеңістің шеруімен жетелеп, біз арқылы Мәсіхті танудың хош иісін барлық жерге де таратуда."},
	{15, "15 Себебі құтқарылу жолындағылар арасында да, тозаққа қарай бара жатқандар арасында да Құдай үшін Мәсіхтің хош иісі іспеттіміз."},
	{16, "16 Соңғылар үшін біздің таратқан Ізгі хабарымыз өлімнің шіріген иісіндей болса, алғашқылар үшін сол хабар шынайы өмірдің жұпар иісі секілді. Ал кім мұндай жауапты қызметті атқаруға қабілетті?"},
	{17, "17 Біз көптеген басқалар сияқты Құдайдың хабарын пайда көздеп, бұрмаламаймыз. Қайта, Мәсіхпен тығыз байланыста тұрып, Құдайдан жіберілгендер ретінде Ізгі хабарды Оның көз алдында адалдықпен уағыздаймыз."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Бұл тағы да өзімізді-өзіміз мақтағандай болып тұр ма? Яки кейбір басқалар сияқты сендерге немесе сендерден кепілдеме хаттарына мұқтажбыз ба?"},
	{2, "2 Жоқ, біздің хатымыз — өздеріңсіңдер: бәріне белгілі, бәрі де оқитын, жүрегімізге жазылған кепілдемеміз сендерсіңдер!"},
	{3, "3 Осы хатты біздің қызметіміз арқылы Мәсіхтің Өзінің жазып жібергендігі сендердің өмірлеріңнен анық көрініп тұр. Ол сиямен емес, мәңгі тірі Құдайдың Рухымен, тас тақтайшаларға емес, адамдардың жүректеріне жазылды."},
	{4, "4 Біз Мәсіх арқылы сендер жайында Құдайға нық сенгендіктен осылай дейміз."},
	{5, "5 Бұл қызметке өзіміз қабілеттіміз деп ойлайтындай еш негізіміз жоқ. Біздегі бар қабілеттілік өзімізден емес, Құдайдан."},
	{6, "6 Ол бізді жазылған заңдарға емес, Киелі Рухына негізделген Жаңа Келісімге сай қызмет етуге қабілетті қылды. Жазылған заңдар рухани өлім әкеледі, ал Киелі Рух шынайы өмір сыйлайды."},
	{7, "7 Рас, Таурат заңы тас тақтайшаларға ойып жазылған әріптермен берілген кезде Құдайдың нұрлы салтанаты көрінді. Сонда Мұса пайғамбардың бет әлпетіндегі нұрдың сәулесінің күшті болғаны сонша, исраилдіктер оған қарап тұра алмады. Дегенмен сол нұрдың сәулесі өткінші ғана еді. Ал енді, рухани өлім әкелетін Таурат заңына сай қызмет сондай салтанатпен көрінген болса,"},
	{8, "8 онда Киелі Рухтың қызметінің салтанаты содан бетер қаншама ұлы болуға тиіс!"},
	{9, "9 Яки адамдарды үкімдейтін қызмет сондай салтанатқа кенелгенде, ақтау мен әділдік әкелетін қызмет одан да зор салтанатқа кенелген болуға тиіс!"},
	{10, "10 Кезінде салтанатқа кенелген Көне Келісім, өзінен әлдеқайда салтанатты Жаңа Келісімнің келуіне байланысты бар салтанатынан айырылды."},
	{11, "11 Себебі өткінші салтанат осыншама ұлы болғанда, мәңгілік салтанат одан бетер қаншама ұлы болмақ!"},
	{12, "12 Ендеше осындай үмітке ие болған біз зор батылдықпен қызмет етеміз."},
	{13, "13 Өшіп бара жатқан өткінші салтанатқа исраилдіктер қадала қарамасын деп, бетін пердемен жапқан Мұса сияқты істемейміз де."},
	{14, "14 Ал солардың саналары да зердесіз болды. Олар Көне Келісімді оқығанда, ой-саналары тіпті күні бүгінге дейін сондай пердемен жабулы тұрған іспетті. Осы пердені алып тастаушы — Мәсіх."},
	{15, "15 Әлі күнге дейін олар Мұсаның жазбаларын оқығанда жүректері пердемен жабулы тұрғандай."},
	{16, "16 Ал Иемізге бет бұрғанда перде алынып тасталады."},
	{17, "17 Иеміз — Рух, Иеміздің Рухы бар жерде азаттық бар."},
	{18, "18 Ал енді, бәріміз бетімізді бүркемей, ашық түрде Иеміздің салтанатты ұлылығына айнадан көргендей мұқият көз жібереміз. Осылайша Ол бізді Өзіне ұқсатып, өзгертіп келеді. Сол арқылы Оның салтанатты ұлылығы барған сайын бізден көбірек көрініс табады. Бұл Иемізден — Киелі Рухтан келеді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Сонымен, Құдайдың рақымымен осы қызметке ие болған біз ешбір мойымаймыз."},
	{2, "2 Қайта, құпия да ұят қылықтардан аулақ жүріп, ешқандай қулық-сұмдықты қолданбаймыз. Құдайдың хабарын бұрмаламаймыз да: Оның көз алдында шындықты ашық уағыздап, өзімізді барлық адамдардың ар-ұждандарына таныстырамыз."},
	{3, "3 Біз жариялап жүрген Ізгі хабар жабық болса, ол тозақ жолындағылар үшін ғана жабық."},
	{4, "4 Бұлар оған сенбейді, себебі осы күнәкар дүниенің тәңірі (әзәзіл шайтан) олардың ой-саналарын соқыр қылып қойған. Содан олар Мәсіхтің салтанатты ұлылығы туралы Ізгі хабардың нұрын көре алмайды. Ал Мәсіх Құдайдың қандай екенін айқын көрсетеді."},
	{5, "5 Біз өзімізді емес, Мәсіх Исаны уағыздаймыз, Ол — Жаратқан Ие, ал біз Исаға бағышталып, сендерге қызмет етеміз."},
	{6, "6 Жаратылыстың басталуында қараңғылықтан нұрдың жарқырауын бұйырған Құдай жан дүниемізді де жарқыратып, бізді Иса Мәсіхтің бетінен көрінетін Өзінің салтанатты ұлылығын білуіміз арқылы нұрландырды."},
	{7, "7 Біз осы рухани қазынаны сақтайтын қарапайым қыш құмыралар іспеттіміз. Осылайша ондағы шексіз зор құдіреттің өзімізден емес, Құдайдан екені анық болып тұр."},
	{8, "8 Жан-жақтан қысым көрудеміз, бірақ тапталған жоқпыз, шарасыз болып қысылудамыз, бірақ үмітімізді үзген жоқпыз."},
	{9, "9 Қуғынға түссек те, Тәңір Ие бізді жалғыз қалдырған жоқ; жығылсақ та, жойылмаймыз."},
	{10, "10 Иеміз Иса іспетті тәнімізде әрдайым азап шегіп, өлім қаупіне душар боламыз. Сол арқылы Оның өмірі де тәнімізден көрініс табуда."},
	{11, "11 Себебі тірі жүрген біздер ұдайы Исаға бола өліммен бетпе-бет келеміз, осылай ажалды тәнімізден Оның өмірі көрініс табады."},
	{12, "12 Мұның нәтижесінде бізде өлім, ал сендерде өмір әрекет етуде."},
	{13, "13 Ал Забурда: Мен Саған сенімімді жүктедім, содан мынаны айттым деп жазылған. Осындай сенімді Құдайға біз де жүктейміз, сондықтан Ол туралы айтамыз."},
	{14, "14 Иеміз Исаны қайта тірілткен Құдайдың бізді де Иса арқылы қайта тірілтіп, сендермен бірге өз алдына әкелетінін білеміз ғой."},
	{15, "15 Басымыздан өткен осылардың бәрі де сендердің игіліктерің үшін. Бұның нәтижесінде барған сайын көптеген адамдар Құдайдың рақымын қабылдап, Оған шексіз ризашылық білдіріп, даңқын асырмақ."},
	{16, "16 Сондықтан да еш мойымаймыз. Тәніміз тозып әлсірегенмен, жан дүниеміз күн сайын жаңара түсуде."},
	{17, "17 Уақытша көретін жеңіл азаптарымыз бізді өздерінен әлдеқайда зор, тіпті шексіз де мәңгілік ұлылыққа жеткізеді!"},
	{18, "18 Сонымен көзге көрінетін емес, көрінбейтін нәрселерге назар тігеміз. Себебі қазір көрініп тұрғандар өткінші, ал көрінбейтіндер мәңгі."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Мынаны да білеміз: жер бетіндегі шатырымыз, яғни тәніміз, күйрегенде, адам қолы емес, Құдайдың Өзі жасаған көктегі мәңгілік мекенімізге, яғни жаңа денеге, ие боламыз."},
	{2, "2 Қазірдің өзінде ыңқылдай күрсіне отырып, көктен келетін денелерімізді жамылатын кезді зарыға күтудеміз."},
	{3, "3 Себебі жаңа денені жамылғанда мекенсіз қалмаймыз."},
	{4, "4 Әлі де осы шатырда тұрып, ауыртпалық көргенде ыңқылдай күрсініп отырмыз. Алайда ажалдан жанымыз жалаңашталмай-ақ, көктен келген денемізді бірден жамылуды қалаймыз. Сонда өткінші тұрмысымыздың орнын мәңгілік өмір ауыстырады."},
	{5, "5 Бізді осы үшін де жаратқан Құдай Өзінің берген уәделерінің орындалуының кепілі болсын деп, Киелі Рухын сыйлады."},
	{6, "6 Сол себептен әрдайым жігерліміз. Әлі де қазіргі тәнімізде тұрғанда Иеміздің қасындағы мекенімізден алшақ екенімізді білеміз."},
	{7, "7 Ал біз көргенімізбен емес, сенімімізбен өмір сүреміз."},
	{8, "8 Содан жігерлі болып, осы тәнімізді тастап, Иеміздің қасында орнығуды қалаймыз."},
	{9, "9 Сондықтан әлі де осы тәнімізде болайық немесе одан тыс (Иеміздің қасында) болайық, бәрібір бар ынтамен Оған ұнауға тырысамыз."},
	{10, "10 Барлығымыз Мәсіхтің төрелік тағының алдында тұрып, әшкереленуге тиіспіз ғой. Сонда әрқайсымыз тәндік өміріміздегі іс-әрекетіміздің жақсы-жамандығына қарай лайықты бағамызды алатын боламыз."},
	{11, "11 Сонымен Иемізді терең қастерлеп, Оған ұнамсызды істеуден шошынуды ұдайы есімізде ұстаймыз. Сондай-ақ басқа адамдарды да осы шындыққа сендіруге ұмтыламыз. Біз Құдай алдында әйгіліміз. Сендердің ар-ұждандарыңа да әйгіліміз деп үміттенеміз."},
	{12, "12 Тағы да өзімізді алдарыңда мақтайтын ойымыз жоқ. Қайта, сендердің бізді мақтан тұта алуларыңның себебін айтып тұрмыз. Сонда сендер адамды ішкі дүниесіне емес, сырт көрінісіне ғана қарап мадақтайтын кісілерге жауап бере аласыңдар."},
	{13, "13 Біз есімізден адасқан болсақ, Құдайға бағышталғанымыз үшін солай болып көрінгені. Ал іс жүзінде есіміздің дұрыс екендігі сендерге тиімді."},
	{14, "14 Мәсіхтің сүйіспеншілігі бізді алға басуға мәжбүр етеді. Себебі мынадай қорытындыға келдік: бір Адам бәрі үшін өлгендіктен барлығы да рухани өлді."},
	{15, "15 Мәсіхтің бәрі үшін өлгендігінің мақсаты мынау: жаңа өмірге ие болғандар енді тек өздері үшін ғана тіршілік етпесін, қайта, Мәсіхке бағышталып өмір сүрсін! Ол солардың игілігіне бола жанын құрбан етіп, өлімнен қайта тірілді ғой."},
	{16, "16 Ендеше ешкімге адам тұрғысынан қарамаймыз. Бұрын біз Мәсіхке солай қарағанмен, қазір олай етпейміз."},
	{17, "17 Сонымен, біреу Мәсіхпен тығыз байланыста болса, сол — жаңадан жаратылған адам. Ескі өмірі өтіп кетіп, міне, жаңасы пайда болды!"},
	{18, "18 Осының бәрі де Құдайдың ісі. Ол бізді Мәсіх арқылы Өзімен татуластырып, бізге басқаларды Өзімен татуластыру қызметін аманаттады."},
	{19, "19 Құдай адамзатты Мәсіхтің арқасында Өзімен татуластырды, енді олардың күнәларын мойындарына артпай, татуласу туралы Ізгі хабарды жариялауды бізге тапсырды."},
	{20, "20 Осылайша Мәсіхтің өкілдеріміз, біз арқылы Құдайдың Өзі адамдарға ескертеді. Мәсіхтің атынан: Құдаймен татуласыңдар! — деп өтінеміз."},
	{21, "21 Тәңір Ие біздің күнәларымызды ешқашан күнә жасамаған Мәсіхке артты. Онымен тығыз байланысқан біз осы арқылы Құдайдың алдында ақталдық."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 Құдаймен бірге еңбектенуші біз сендерден мынаны өтініп, ескертеміз: өздерің қабылдаған Құдайдың рақымы өмірлеріңде өнімсіз болмасын."},
	{2, "2 Себебі Ол мынадай сөздерді айтқан: Мен мейірім көрсететін кезімде саған құлақ салдым, халқымды құтқаратын күнім келгенде сені қамқорладым. Тыңдаңдар: Оның мейірім көрсететін кезі осы, құтқаратын күні, міне, бүгін!"},
	{3, "3 Қызметіміз ұятқа қалмасын деп, жұрттың Ізгі хабарды қабылдауларында іс-әрекетімізбен ешкімге ешқандай кедергі жасамаймыз."},
	{4, "4 Қайта, барлық істе де Құдайдың қызметшілеріне лайық болуға ұмтылып, зор шыдамдылықпен азаптар, ауыртпалықтар және қиын-қыстау жағдайларды басымыздан өткіземіз."},
	{5, "5 Біз ұрып-соғылып, түрмеге қамалып, қуғындалғанда, сондай-ақ, ауыр еңбек етіп, ұйқысыз түндер мен аш күндерді бастан кешкенде"},
	{6, "6 таза жүреміз. Түсінігіміз, төзімділігіміз және ақпейілділігімізбен бойымыздағы Киелі Рух арқылы адал сүйіспеншілік танытамыз;"},
	{7, "7 шындықтың хабарын уағыздап, Құдайдың құдіретін көрсетеміз. Осылай Оның қызметшілері екенімізді паш етеміз. Екі қолымызда ұстанған қаруымыз — әділдік."},
	{8, "8 Бізді не құрметтеп, не қараласа да, не сөгіп, не мадақтаса да, не өтірікшілер десе де, бәрібір адалмыз."},
	{9, "9 Танымал болмасақ та, бізді таниды. Өлгендер деп санаса да, міне, тіріміз. Бізді жазаласа да, өлген жоқпыз."},
	{10, "10 Бізді ренжітеді, бірақ әрдайым қуаныштымыз. Кедей болсақ та, көптеген адамдарды байытамыз. Ештеңеміз жоқ болғанмен, бәріне де иеміз."},
	{11, "11 Қымбатты қорынттықтар, сендермен ашық сөйлестік, жүректеріміз де айқара ашық."},
	{12, "12 Өздеріңе деген пейіліміз кең болғанмен, сендер бізге жүректеріңнен аз-ақ орын бердіңдер."},
	{13, "13 Мен сендермен балаларымен сөйлескен әкедей сөйлесемін: енді өздерің де бізге пейілдеріңді кең жайсаңдаршы!"},
	{14, "14 Сенбейтіндермен қоян-қолтық бірге жүріп, жаман ниеттеріне ортақтаспаңдар! Себебі әділдік пен заңсыздық арасында ортақ не бар? Яки жарық пен түнек қалай тығыз байланыста тұрмақ?"},
	{15, "15 Мәсіх пен белияр (шайтан) арасында ынтымақ бола ала ма? Мәсіхке сенуші мен сенбейтіннің арасында ортақ не бар?"},
	{16, "16 Құдайдың киелі үйі мен жалған тәңірлер арасында қандай келісімнің болуы мүмкін? Себебі біздер мәңгі тірі Құдайдың киелі үйіміз. Құдайдың Өзі мынадай сөздер айтқан: Мен орталарында тұрып, араларында жүретін боламын. Мен олардың Құдайы, ал олар Менің халқым болады."},
	{17, "17 Жаратқан Ие мынаны айтады: Сондықтан олардың арасынан шығыңдар! Олардан бөлек тұрыңдар, арам нәрселеріне мүлдем жоламаңдар! Сонда Мен сендерді қабылдаймын."},
	{18, "18 Мен сендерге Әке боламын, ал сендер рухани ұл-қыздарым боласыңдар дейді Әлемнің Билеушісі — Жаратқан Ие."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct kk7 poems[] = {
	{1, "1 Осы уәделердің бәрі де бізге берілгендіктен, сүйікті бауырластарым, тәніміз бен рухымызды арамдайтын барлық нәрселерден тазарып, Құдайды терең қастерлеп, толығымен Оған бағышталған қасиетті өмір сүрейік!"},
	{2, "2 Жүректеріңнен бізге орын беріңдер. Біз ешқайсыңа да әділетсіздік істеп, зиян келтірген жоқпыз. Ешкімді алдап, пайдаланған да емеспіз."},
	{3, "3 Бұларды айтқандағы мақсатым сендерді айыптау емес. Бұрын айтып кеткенімдей, жүрегіміздің төріндесіңдер; бірге өліп не бірге өмір сүруге дайынбыз."},
	{4, "4 Өздеріңе деген сенімім зор, сендерді ерекше мақтан тұтамын. Соншама көп азап шексек те, жігерім артып, қуанышым қойныма сыймайды."},
	{5, "5 Ал Македонияға келгеннен кейін тәніміз дамыл таппай, жан-жақтан қысым-қыспақ көрдік: сырттан — шабуыл, ішімізде — үрей-қорқыныш."},
	{6, "6 Бірақ еңсесі түскенді жігерлендіретін Құдай бізді Титтің келуімен жігерлендірді."},
	{7, "7 Тек Титтің келуі ғана емес, сондай-ақ, сендердің оны жігерлендіргендерің туралы айтып бергендері де көңілімізді орнықтырды. Тит өздеріңнің бізді аңсап-сағынып, опық жеп жылап, мен үшін ынталана құлшыныс жасағандарың жайында хабар әкелді. Бұған одан бетер қуандым."},
	{8, "8 Тіпті сендерді жазған хатыммен қапаландырсам да, мұныма өкінбеймін. Расында мен хатымның сендерді қасіретке батырғанын көріп, өкінген де едім. Ал қасіреттерің уақытша ғана болды."},
	{9, "9 Қазір мен қуаныштымын — қасіреттеріңе бола емес, опық жеп қайғырып, теріс жолдан қайта оралғандарыңа бола. Сол қайғыларың Құдайдың еркімен болған еді, сондықтан да ешқандай зиян көрмедіңдер."},
	{10, "10 Себебі Құдайдың еркімен болған қайғы-қасірет адамның Оған бет бұрып, құтқарылуына түрткі болады. Ол кейін соған өкінбейді де. Ал күнәкар дүниелік қайғы-қасіреттің нәтижесі — рухани өлім."},
	{11, "11 Құдайдың еркімен болған қайғыларыңнан өздеріңде не туындағанын қараңдаршы: қандай ынта-жігер, күнәдан арылуға деген неткен ұмтылыс, болған жайтқа не қылған наразылық пен абыржу, неткен сағыныш, бәрін түзетуге деген соншама құлшыныс, қандай әділ жаза! Осының бәрімен сендер бұл істе кінәратсыз таза екендіктеріңді дәлелдедіңдер."},
	{12, "12 Ал мен сол хатты не қорлағанға, не қорланғанға бола жазған жоқпын. Сендердің Құдай алдында біздің қамдарымызды қалай ойлайтындарыңа көздеріңнің жетуін қаладым."},
	{13, "13 Сол себептен де жігерлендік. Ал Титтің қуанышына одан бетер риза болдық, барлығың да оның көңілін орнықтырдыңдар."},
	{14, "14 Сонымен, сендерді мақтауыммен ешбір ұятқа қалмадым. Қайта, сендерге айтқанымыздың түгел шынайы екеніндей, Титке өздеріңді мақтауымыз да нағыз шындық болып шықты."},
	{15, "15 Ол сендерді тіптен жақсы көріп, бәріңнің өзін қалай тыңдап, қатты қобалжып қастерлеп, қол қусырып қабылдағандарыңды есіне алып отырады."},
	{16, "16 Ал мен қай істе де өздеріңе сене алатыныма қатты қуанамын!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct kk8 poems[] = {
	{1, "1 Ал енді, қымбатты бауырластар, сендерді Құдайдың Македониядағы қауымдарға рақымын төккені туралы да хабардар еткіміз келеді."},
	{2, "2 Бастарынан өтіп жатқан ауыртпалықтар арқылы сенімдері қатты сыналғанмен, (Иемізге деген) қуаныштары шексіз болды. Осылайша олар ағыл-тегіл мол беріп, өздерінің тақыр кедейліктеріне қарамастан жомарттық көрсетті."},
	{3, "3 Олардың қолдарынан келгенше, тіпті мүмкіндіктерінен де артық кеңпейілділік танытқандарына мен куәмін: өз жүрек қалауларымен"},
	{4, "4 бізден өтініп, өздері де Құдайдың халқына көмек жіберіп, қызмет етуге қатыса алуларын қоймастан жалынып сұрады."},
	{5, "5 Бұл күткенімізден де артық болды! Олар өздерін алдымен Иемізге бағыштап, сондай-ақ, Құдайдың еркімен бізге де беріле көмектесті."},
	{6, "6 Сонымен, Тит сендердің араларыңда да осындай игілікті істі бастағандықтан, одан онысын тамамдауын сұрадық."},
	{7, "7 Сенім, Құдайдың хабарын уағыздау, түсінік, барлық іске де ынта-жігер және бізге деген сүйіспеншіліктерің — бұлардың бәрі сендерде ағыл-тегіл мол. Дәл сол сияқты осы игілікті істі де молынан атқарыңдар."},
	{8, "8 Мұны бұйыра айтып отырғаным жоқ. Ал басқалардың құлшыныстарына меңзеп, сүйіспеншіліктеріңнің шынайылығын сынап тұрмын."},
	{9, "9 Иеміз Иса Мәсіхтің рақымдылығын жақсы білесіңдер: Ол сондай бай бола тұра, сендердің рухани баюларың үшін бәрінен бас тартып, жоқшылыққа ұшырады!"},
	{10, "10 Бұған байланысты айтар ақылым: былтыр сендер алғашқы болып көмек беріп қана қоймай, соны өз қалауларыңмен де атқардыңдар."},
	{11, "11 Ал енді, құлшына тілегендеріңді жүзеге асырып, қолдарыңдағы бармен бөлісіп, осы істі тамамдаңдар."},
	{12, "12 Біреу беруге ынталы болса, Тәңір Ие оның тарту-таралғысын қолындағы жоғына емес, барына қарай ризашылықпен қабылдайды."},
	{13, "13 Басқалардың жағдайын жеңілдету үшін өздеріңнің қиналып қалуларыңның қажеті жоқ; керісінше, екі жақта да теңдік болуы керек."},
	{14, "14 Қазіргі сендердің молшылықтарың олардың мұқтаждықтарын қамтамасыз етіп, кейін олардағы молшылық сендердегі мұқтаждықты қамтамасыз етпек; сонда екі жақта да теңдік орнайды."},
	{15, "15 Осылайша көп жинаған кісіден артылған жоқ, аз жинаған мұқтаж да болған жоқ деп Тауратта жазылғандай болмақ."},
	{16, "16 Сендерге қамқорлық жасауға деген құлшынысты бізге бергеніндей, оны Титтің де жүрегіне сепкені үшін Құдайға шүкірлік."},
	{17, "17 Жаңағы тілегімізді Тит жылы ықыласпен қабылдап қана қойған жоқ, сендерге зор құлшыныспен, өз қалауы бойынша бара жатыр."},
	{18, "18 Титпен бірге тағы бір бауырласымызды да жіберіп отырмыз. Оның Ізгі хабарды уағыздаудағы жұмысы барлық қауымдарда мақталып жүр."},
	{19, "19 Мұның үстіне қауымдар оны осы игілікті істі орындау мақсатымен (Иерусалимге) аттанған сапарымызда бізбен бірге еріп баруға таңдап алды. Бұл игі істі Иеміздің даңқын арттырып, ізгі ниетімізді білдіру үшін атқарып жүрміз."},
	{20, "20 Сеніп тапсырылған осы мол сый-тартуды қалай басқарғанымыз жайында бізге ешкім айып тақпасын деп сақ жүреміз."},
	{21, "21 Иеміз алдында да, адамдар алдында да адал жүруге тырысамыз."},
	{22, "22 Олармен бірге тағы бір бауырласымызды жіберіп жатырмыз. Оның ізгі ынта-жігеріне алуан түрлі жағдайларда әлденеше рет көз жеткіздік. Ол өздеріңе сенім артып, баруға бұрынғыдан бетер құлшынған."},
	{23, "23 Тит — менің әрі жолдасым, әрі араларыңдағы қызметтесім. Ал осы бауырластарға келсек, олар — қауымдардың жіберген өкілдері, сүрген өмірлерімен Мәсіхтің ұлылығын паш ететіндер."},
	{24, "24 Сонымен, оларға сүйіспеншіліктеріңді көрсетіңдер! Осылай біздің өздеріңді мақтан тұтатынымыздың орынды екеніне қауымдардың көздерін жеткізіңдер."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct kk9 poems[] = {
	{1, "1 Шынында сендерге Құдайдың халқына көмектесу туралы жазып жатудың қажеті де жоқ."},
	{2, "2 Соған деген құлшыныстарыңды білемін ғой. Содан мен Ахая аймағында тұратын сендердің тіпті былтырдан бері көмектесуге әзір екендіктеріңді македониялықтарға айтып, мақтан тұтып келемін. Осы құлшыныстарың олардың көбіне де қозғау салған."},
	{3, "3 Ал енді өздеріңді мақтағаным бекер болмасын деп, бауырластарды жіберіп отырмын. Осылай өзім айтып кеткендей, іс жүзінде де көмектесуге даяр бола аласыңдар."},
	{4, "4 Олай етпеген күнде македониялықтар менімен бірге келіп, даяр еместеріңді көрсе, өздеріңді айтпай-ақ қояйын, біз қандай ұятқа қалар едік! Сендерді сондай нық сеніммен мақтап жүрдік қой."},
	{5, "5 Сондықтан да бауырластардан сендерге бізден бұрын баруларын сұрауды тиімді деп таптым. Олар өздерің уәде еткен жомарт тарту-таралғыларыңды алдын ала жинап, дайындаудың қамын ойластырмақ. Сонда сыйларың іштарлықпен лажсыздан берілген емес, кеңпейілділікпен жасалған игілік болады."},
	{6, "6 Бұл жайында: Сараң сепкен сараң жинар, жомарт сепкен жомарт жинар делінген ғой."},
	{7, "7 Әрқайсың жүректеріңнің шешіміне сай, еш ренішсіз, зорлықсыз барларыңмен бөлісіңдер! Құдай қуанышпен беретіндерді ұнатады."},
	{8, "8 Ал сендерді бүкіл игілікке молынан кенелтуге Құдайдың құдіреті жетеді! Сонда әрдайым, қандай жағдайда да қажеттеріңнің бәрімен қамтамасыз етіліп, әр қилы игі істерді молынан жасай аласыңдар."},
	{9, "9 Ол мұқтаждарға мол көмек таратады, оның әділдігі мәңгіге ұласады деп Забурда жазылған."},
	{10, "10 Егіншіге себуге тұқым, ашыққанға жеуге нан беретін Құдай сендерге игіліктің тұқымын ағыл-тегіл мол сыйлап, әділ істеріңнің өнімін молайта түспек."},
	{11, "11 Ондағы көздегені — сендердің әр жағдайда жомарттық жасай алатындай дәулетті болуларың, әрі біз арқылы жіберген көмектерің үшін көп адамдардың Құдайға шүкірлік етуі."},
	{12, "12 Өйткені атқарып жатқан қызметтерің Құдай халқының мұқтаждықтарын қамтамасыз етеді. Олар сонымен қатар бұл сенушілердің Жаратқан Иеге шексіз ризашылықтарын білдіріп шүкірлік етулеріне себепші болмақ."},
	{13, "13 Сендер осы қызметте игі ниеттеріңді дәлелдеп, өздерің мойындаған Мәсіхтің Ізгі хабарына мойынсұнып, солармен және басқалардың бәрімен жомарттықпен бөлісудесіңдер. Сондықтан олар Құдайды мадақтап,"},
	{14, "14 Оның өздеріңе шексіз мол жаудырған рақымына риза болып, шынайы сүйіспеншілікпен сендер үшін дұға ететін болады."},
	{15, "15 Бізге берген баға жетпес сыйы үшін Құдайға лайым шүкірлік етейік!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct kk10 poems[] = {
	{1, "1 Қасымызда жүргенде момын, ал алыста жүргенде батыл деп келекеленген мен — Пауыл Мәсіхтің ілтипаттылығы мен төзімділігін естеріңе сала отырып мынаны өтініп сұраймын:"},
	{2, "2 сендерге барған кезімде қатаң батылдықты қолдануға мені мәжбүр етпеңдер! Соны бізді күнәкарлар сияқты іс-әрекет жасайды деп ойлайтын кейбіреулеріңе қарсы қолданатын ниетім бар."},
	{3, "3 Біз осы күнәкар дүниеде өмір сүргенмен, оның салты бойынша күреспейміз:"},
	{4, "4 қолданып жүрген қаруларымыз осы дүниелік емес, оларда Құдайдың құдіреті бар. Солармен жау бекіністерін талқандаймыз; оның дәлелдемелерінің қате екенін әшкерелеп,"},
	{5, "5 адамдардың Құдайды тануларына бөгет болатын тәкаппарлық атаулыны құртып, күллі ой-пікірлерін Мәсіхке бағындырамыз."},
	{6, "6 Осылай өздерің Оған толық мойынсұнғаннан кейін (араларыңдағы қиқарлардың) бүкіл бағынбаушылықтарын жазалауға дайын боламыз."},
	{7, "7 Сендер тек жайттың сыртқы көрінісіне ғана назар аударып келесіңдер. Өзін Мәсіхтікімін деп иланған әркім қайтадан ойлансын: ол сияқты біз де Мәсіхтікіміз."},
	{8, "8 Иеміз бізге сендерге зиян келтіру үшін емес, сенімдеріңді нығайту үшін билік берген болатын. Сол билігіммен емін-еркін мақтансам да, ұятқа қалмас едім."},
	{9, "9 Бірақ сендерді хаттарыммен қорқытқым келмейді, солай болып көрінбесін!"},
	{10, "10 Кейбіреулерің мені хаттары қатаң да күшті, ал жүзбе-жүз кездескенде өзі де әлсіз, сөзі де мәнсіз дейді екенсіңдер."},
	{11, "11 Ондайлар біздің сендерге алыстан хатта жазғандарымыз бен қастарыңда жүргенде істейтіндеріміздің бірдей болатынын білсін!"},
	{12, "12 Сондай мақтаншақтармен өзімізді теңестіруге не салыстыруға біздің дәтіміз, әрине, бармайды: олар өздерін өзіндік үлгілерімен бағалап, өздерін өздерімен ғана салыстырады. Қандай ақымақтық!"},
	{13, "13 Ал біз шексіз мақтанбаймыз. Керісінше, өзімізге Құдай белгілеген қызмет ауқымында қаламыз. Бұл сендерді де қамтиды,"},
	{14, "14 сондықтан да өз ауқымымыздың шегінен тыс шықпаймыз. Егерде сендерге бұрын еш бармаған болсақ, солай болар еді. Алайда Мәсіхтің Ізгі хабарын сендерге алғаш рет біз жеткіздік емес пе?!"},
	{15, "15 Сонымен басқалардың еңбектерімен мақтанатындай тиімсіз іс жасамаймыз. Қайта, сендердің сенімдеріңнің өсуі арқылы араларыңдағы қызмет ауқымымыз әлі де молынан кеңейе түседі деп күтеміз."},
	{16, "16 Осылай біз Ізгі хабарды сендерден тыс, өзге жерлерде де уағыздай алып, басқаның ауқымында атқарылған дайын істер үшін мақтанбайтын боламыз."},
	{17, "17 Кім мақтанғысы келсе, тек Жаратқан Иемен мақтансын! деп Пайғамбарлар жазбаларында айтылған ғой."},
	{18, "18 Ендеше өзін-өзі мақтаған емес, тек Иеміз мақтаған ғана шынымен қадірленуге лайық."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct kk11 poems[] = {
	{1, "1 Мақтануыммен біраз ақымақ болып көрінгеніме төзсеңдер екен деймін. Іс жүзінде төзіп келесіңдер де."},
	{2, "2 Сендерді Құдай берген қамқорлықпен қызғыштай қорғап келемін. Өздеріңді бір-ақ Күйеу — Мәсіхке айттырып қойдым, әрі пәк таза қыз күйлеріңде ұзатқым келеді."},
	{3, "3 Әзәзіл жыланның қулықпен Хауа ананы алдап, азғырғанындай, кейбіреулер сендердің де ой-саналарыңды Мәсіхке деген адалдық пен пәк берілгендіктеріңнен ауытқытып жүрмесін деп уайымдаймын."},
	{4, "4 Себебі, біреулер сендерге келіп, біз уағыздағаннан өзге Исаны уағыздағанда, немесе өздерің қабылдаған Киелі Рухтан өзге рухты, яки қабыл алған Ізгі хабардан басқа біреуін насихаттағанда, сендер бұның бәріне оңайлықпен көне кетесіңдер."},
	{5, "5 Алайда өзімді сол бір озат елшілерден кеммін деп ойламаймын."},
	{6, "6 Тіптен сөзге шешен болмасам да, білімім жеткілікті. Соған барлық жағынан да көздеріңді толық жеткіздік қой."},
	{7, "7 Сендерді рухани жағынан көтермелеу үшін өзімді төмендетуіммен күнә жасадым ба? Құдайдың Ізгі хабарын сендерге тегін уағыздадым емес пе!"},
	{8, "8 Өздеріңе қызмет ету үшін басқа қауымдардың көмегін қабылдап, оларды тонағандай болдым. Қастарыңда жүрген кезімде мұқтаждық көрген күнде де ешқайсыңды әуреге салмадым."},
	{9, "9 Өйткені Македониядан келген бауырластар қажет нәрселерімнің орнын толтырды. Қай істе де сендерге ауыртпалық түсірмеуге тырыстым және тырысамын да."},
	{10, "10 Өз бойымдағы Мәсіхтің адалдығымен мәлімдеймін: Ахая аймағындағы ешкім осы мақтануымды тоқтата алмайды!"},
	{11, "11 Неге бұлай істеймін? Сендерді сүймегендіктен бе? Өздеріңді сүйетінім Құдайға аян! Қалай істеп келсем, солай істеуді жалғастырмақпын."},
	{12, "12 Жасаған игіліктеріне мақтанып, бізбен бірдей көріну үшін сылтау іздейтіндерге жол беретін ойым жоқ."},
	{13, "13 Ондайлар — жалған елшілер, алдамшы қызметкерлер, өңдерін айналдырып, Мәсіхтің елшілері болып көрінгендер."},
	{14, "14 Мұнда таңғалатын ештеңе жоқ: шайтанның өзі өңін айналдырып, нұрлы періште болып көрінеді."},
	{15, "15 Сондықтан оның қызметшілерінің де өңдерін айналдырып, әділдіктің қызметшілері болып көрінуі ғажап іс емес. Олардың ақыры қылықтарына сай болмақ!"},
	{16, "16 Тағы да қайталаймын: ешқайсыларың мені ақымақ деп ойламаңдар! Ал егер олай ойласаңдар, мені ақымақ ретінде қабылдаңдар, сонда (Ізгі хабарды бұрмалап таратушы солар сияқты) мен де аздап мақтана аламын."},
	{17, "17 Ендеше батыл мақтанғанда, Иеміздің үлгісі бойынша емес, ақылсыз болғансып айтатын боламын."},
	{18, "18 Талай жалған тәлім берушілердің өзімшіл ниетпен (сендердің жетістіктеріңе) мақтанып жүргені іспетті, (өздеріңе жіберген елші болуымды қорғау үшін) мен де мақтанбақпын."},
	{19, "19 Себебі сондай дана сендер ақымақтарға қуана төзесіңдер-ау!"},
	{20, "20 Расында біреу өздеріңді құл қылса да, ақыларыңды жеп, тонап кетіп, менсінбей өктемдік көрсетсе де, беттеріңді соқса да, бәрібір төзесіңдер!"},
	{21, "21 Осындай қылықтарды өздеріңе істеуге біздің күшіміз жетпеді. Мұны айтқанда алдарыңда ұятқа қаламын ба? Ал егер солардың біреуінің бір нәрсеге мақтануға дәті болса — ақымақша айтайын — соған мақтануға менің де дәтім барады."},
	{22, "22 Олар яһуди ме? Мен де яһудимін. Олар исраилдіктер ме? Мен де солаймын. Олар Ыбырайым атаның ұрпағынан ба? Мен де."},
	{23, "23 Олар Мәсіхтің қызметшілері ме? Ақымақ кісідей сөйлеп тұрмын: мен Мәсіхке солардан бетер қызмет етудемін. Оларға қарағанда әлдеқайда көбірек еңбектеніп, түрмеге қамалып, аяусыз соғылдым, талай рет өліммен бетпе-бет келдім."},
	{24, "24 Яһудилер мені бес рет отыз тоғыздан қамшымен соқты."},
	{25, "25 Мені үш рет таяқпен дүре соқты, бір рет өлтірмек болып таспен атқылады. Үш рет кеме апатына ұшырадым, бір тәулік бойы ашық теңізде малтып, әрең аман қалдым."},
	{26, "26 Көп рет саяхатқа шығып, сансыз қауіп-қатерге ұшырап келемін: тасыған өзендерден, қарақшылардан, өз ұлттастарым мен басқа ұлттық адамдардан да зардап шектім. Қала мен шөл далада, теңізде және жалған бауырластар арасында қатерге тап болдым."},
	{27, "27 Ешқандай аянбастан еңбектеніп келемін, ұйықтамаған түндерімнің есебі жоқ. Аштықтың, шөлдің не екенін білемін, киімге мұқтаж болып талай рет тоңдым."},
	{28, "28 Басқа жайттар туралы айтпағанның өзінде күн сайын барлық қауымдардың қамдары еңсемді басып, толғандырады."},
	{29, "29 Біреу әлсіз болса, мен де өзімді әлсіз сезінбеймін бе? Біреу күнәға азғырылса, сол үшін күйіп-жанбаймын ба?"},
	{30, "30 Егерде мақтануға тиіс болсам, өзімнің күшсіз екенімді көрсететін жайттармен мақтанайын."},
	{31, "31 Иеміз Исаның Әкесі, мәңгілік мадаққа лайық Құдай, мына айтатындарымның нағыз шындық екенін біледі:"},
	{32, "32 Дамаскіде болған кезімде Аретас патшаның аймақ әміршісі қала қақпаларын күзеттіріп, мені тұтқындауға бұйырды. Бірақ мен қаланы қоршаған қамалдағы терезеден үлкен себетпен төмен түсіріліп, оның қолынан сытылып кеттім."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct kk12 poems[] = {
	{1, "1 Түбі пайдалы болмаса да, мақтануым қажет; енді Иеміздің маған көрсеткен аяндары мен ашқан құпияларына тоқталайын."},
	{2, "2 Мәсіхпен тығыз байланыстағы біреуді танимын; оны он төрт жыл бұрын кенет көктің ең биігіне көтеріп әкетті. Оның рухы көкке апарылды, ал тәнінде ме, әлде тәнсіз бе, о жағы маған емес, Құдайға ғана аян."},
	{3, "3 Сол кісінің жұмаққа апарылғанын дәл білемін; тек оның тәнсіз, не тәнінде барғаны маған емес, жалғыз Құдайға ғана анық."},
	{4, "4 Сонда ол адам тілімен айтуға келмейтін, әрі басқаларға әңгімелеуге тыйым салынған сөздерді естіді."},
	{5, "5 Сол ғажап оқиғаны мақтан ете аламын. Ал жеке басым туралы жалғыз күшсіздігімнен өзге ештеңемен мақтанбаймын."},
	{6, "6 Дегенмен мақтанғым келген күнде де ақымақ болмас едім, өйткені нағыз шындықты айтамын. Алайда мен туралы аса жоғары пікірде болмауларың үшін содан бас тарттым. Одан да өзімнен көріп-естігендеріңе сай ғана мені бағалаңдар!"},
	{7, "7 Өзіме ашылған құпиялардың төтенше ұлылығына байланысты кеуде көтермеуім үшін, тәніме шаншылып түйрелу азабы бұйырылды: шайтанның хабаршысы мені соғып қинайды. Бұл мені өркөкіректеніп кетуден сақтамақ."},
	{8, "8 Мен бұл азапты өзімнен аластатуын өтініп, үш рет Иемізге сиындым."},
	{9, "9 Бірақ Ол маған былай деді: Менің рақымым саған жетер: күшсіз жағдайыңда Менің құдіретім толықтай іске аса алады. Сондықтан Мәсіхтің құдіретінің бойымда орнығуы үшін, күшсіздігіме қуана мақтанамын."},
	{10, "10 Сонымен, басымнан әлсіздік, қорлық, мұқтаждық, қуғын-сүргін, қысымшылық өткізгенде Мәсіхке бола ризамын. Себебі өзім күшсіз болғанымда Ол арқылы күштімін."},
	{11, "11 Мақтанып ақымақтай көріндім, мені соған мәжбүр еттіңдер. Ал сендер мені мадақтауға тиісті едіңдер, өйткені сол бір озат елшілермен салыстырғанда ешқандай кемшілігім жоқ қой. Дегенмен жеке басым өздігінен түк те емес."},
	{12, "12 Құдайдың шынайы елшісі екенімді көрсететін белгілер, яғни ғажап кереметтер мен құдіретті істер, үлкен төзімділікпен көз алдарыңда орындалды."},
	{13, "13 Басқа қауымдарға қарағанда сендерге не жетіспейді, тек менің сендерге ауыртпалық түсірмегенім болмаса?! Мұнымды айыпқа бұйыра көрмеңдер."},
	{14, "14 Ендеше сендерге үшінші рет бармақшымын, бірақ ешқандай ауыртпалық түсірмеймін. Маған дүние-мүліктерің емес, өздерің қымбатсыңдар. Балалары ата-анасы үшін емес, ата-анасы балалары үшін енші жинауға тиіс қой."},
	{15, "15 Осылайша мен рухани игіліктеріңе бола қолымдағы барымды қуана жұмсап, өзімді де еш аямаймын. Сендерді неғұрлым артық көрген сайын мені анағұрлым аз сүйсеңдер де, солай істей беремін."},
	{16, "16 Қалай болған күнде де өздеріңе ауыртпалық түсірмедім. Дегенмен қу болғандықтан сендерден айлакерлікпен амалымды асырып кеттім (дейсіңдер ме)?"},
	{17, "17 Не болмаса жіберген кісілерімнің біреуі арқылы өздеріңді пайдаландым ба?"},
	{18, "18 Титтен сендерге баруын өтініп, онымен бірге бауырластардың біреуін жібердім. Тит те өздеріңді пайдаланған жоқ, солай емес пе? Екеуіміз бірдей рухпен әрекет жасап, бір жолмен келеміз ғой."},
	{19, "19 Өзімізді сендердің алдарыңда ақтауға тырысамыз деп әлі де ойлайсыңдар ма? Жоқ, біз Құдай алдында, Мәсіхпен тығыз байланыста тұрамыз. Істегендеріміздің бәрі де, сүйікті бауырластар, сенімдеріңнің нығаюына арналған."},
	{20, "20 Сендерге барған кезімде қалаған жағдайда болмайсыңдар ма деп қамығамын, онда мен де өздерің қалағандай бола алмаймын. Араларыңда айтыс-керіс, қызғаныш, ашу-ыза, жікке бөліну, жала жабу, өсек-аяң, менмендік және тәртіпсіздік жайылуы мүмкін деп уайымдаймын."},
	{21, "21 Сонда тағы барған кезімде Құдай мені сендерге бола ұялтпасын! Бұрын да күнә жасаған, әлі де жасап жүрген арамдықтан, неке адалдығын бұзушылық пен жүгенсіздіктерінен бас тартпаған талай адамдарың үшін көз жасымды төгіп қайғырып жүрмейін!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct kk13 poems[] = {
	{1, "1 Сонымен сендерге үшінші рет бармақпын. Әрбір іс ең кем дегенде екі не үш куәгердің айтқандарымен дәлелденуі керек (деп Тауратта жазылғандай, мәселелеріңді қайтадан дұрыстап тексермекпін)."},
	{2, "2 Екінші рет қастарыңда болған кезде ескерткенмін, қазір де сендерден алыс жүріп, осы хат арқылы ескертемін: қайтадан барғанымда бұрын күнә жасағандарды және кез келген басқаларыңды да еш аямаймын!"},
	{3, "3 Мен арқылы Мәсіх шынымен айтып тұр ма, жоқ па, соған дәлел талап етіп отырсыңдар. Мен бұған былай деймін: өздеріңе әрекет жасағанда Мәсіх күшсіз емес, Ол араларыңда күшті болады."},
	{4, "4 Кезінде Мәсіх өз құдіретінен бас тартып, айқышқа шегеленіп өлсе де, қазір Құдайдың құдіретімен тірі! Онымен тығыз байланыстағы біз де күшсізбіз, алайда сендерге әрекет жасағанда Құдайдың құдіреті арқылы Мәсіхпен бірге тіріміз!"},
	{5, "5 Шынында да сенім жолымен жүрсіңдер ме, жоқ па, соларыңды тексеріңдер! Әрқайсың жеке бастарыңды сынаңдар: әрине, жүректеріңнің төрінен Иса Мәсіхтің орын алғанын білесіңдер. Егер Ол орын алмаған болса, шынымен сенім жолында емессіңдер!"},
	{6, "6 Алайда біздің (елшілік өкілеттілігіміздің) дәлеліне көздерің жететін болады деп сенемін."},
	{7, "7 Дегенмен, сендер бұдан былай жамандық жасаудан бас тартсын деп Құдайдан өтініп сиынамыз. Ондағы мақсатымыз — біздің абыройлы болып көрінуіміз емес, сендердің жақсылық жасауларың. Егер осылай (бізге елшілік өкілеттілігіміздің дәлелін келтіруге орайы болмай) өзіміз абыройсыз болып көрінсек, мейлі, солай-ақ бола қойсын."},
	{8, "8 Себебі біз ақиқатқа қарсы емес, ақиқатты жақтап күш саламыз."},
	{9, "9 Өзіміз күшсіз, ал сендер күшті болсаңдар, соған қуанып шаттанамыз. Дәл осыны, түгелдей түзелулеріңді, сұрап Тәңір Иеге сиынамыз."},
	{10, "10 Сондықтан бұларды алыста жүріп өздеріңе жазып отырмын. Иеміздің маған күйрету үшін емес, нығайту үшін берген билігін сендерге барған кезімде қатаңдықпен қолданғым келмейді."},
	{11, "11 Сонымен, қымбатты бауырластар, қош-сау болыңдар! Түзеле беріңдер, жігерленіңдер, бір ниеттес, тату болыңдар! Сонда сүйіспеншілік пен тыныштықтың бастауы — Құдай сендерге жар болады."},
	{12, "12 Шын жүректен бір-біріңе сүйіспеншіліктеріңді білдіріп, сәлемімізді жеткізіңдер. Құдайдың барлық адамдары сендерге сәлем жолдауда."},
	{13, "13 Лайым Иеміз Иса Мәсіхтің рақымы, Құдайдың сүйіспеншілігі және Киелі Рухпен қарым-қатынастарың бәріңде бола берсін! (Аумин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};