#include <map>
#include <string>
class Bible23
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
	struct kk5	{ int val; const char *msg; };
	struct kk6	{ int val; const char *msg; };
	struct kk7	{ int val; const char *msg; };
	struct kk8	{ int val; const char *msg; };
	struct kk9	{ int val; const char *msg; };
	struct kk10	{ int val; const char *msg; };
	struct kk11	{ int val; const char *msg; };
	struct kk12	{ int val; const char *msg; };
	struct kk13	{ int val; const char *msg; };
	struct kk14	{ int val; const char *msg; };
	struct kk15	{ int val; const char *msg; };
	struct kk16	{ int val; const char *msg; };
	struct kk17	{ int val; const char *msg; };
	struct kk18	{ int val; const char *msg; };
	struct kk19	{ int val; const char *msg; };
	struct kk20	{ int val; const char *msg; };
	struct kk21	{ int val; const char *msg; };
	struct kk22	{ int val; const char *msg; };
	struct kk23	{ int val; const char *msg; };
	struct kk24	{ int val; const char *msg; };
	struct kk25	{ int val; const char *msg; };
	struct kk26	{ int val; const char *msg; };
	struct kk27	{ int val; const char *msg; };
	struct kk28	{ int val; const char *msg; };
	struct kk29	{ int val; const char *msg; };
	struct kk30	{ int val; const char *msg; };
	struct kk31	{ int val; const char *msg; };
	struct kk32	{ int val; const char *msg; };
	struct kk33	{ int val; const char *msg; };
	struct kk34	{ int val; const char *msg; };
	struct kk35	{ int val; const char *msg; };
	struct kk36	{ int val; const char *msg; };
	struct kk37	{ int val; const char *msg; };
	struct kk38	{ int val; const char *msg; };
	struct kk39	{ int val; const char *msg; };
	struct kk40	{ int val; const char *msg; };
	struct kk41	{ int val; const char *msg; };
	struct kk42	{ int val; const char *msg; };
	struct kk43	{ int val; const char *msg; };
	struct kk44	{ int val; const char *msg; };
	struct kk45	{ int val; const char *msg; };
	struct kk46	{ int val; const char *msg; };
	struct kk47	{ int val; const char *msg; };
	struct kk48	{ int val; const char *msg; };
	struct kk49	{ int val; const char *msg; };
	struct kk50	{ int val; const char *msg; };
	struct kk51	{ int val; const char *msg; };
	struct kk52	{ int val; const char *msg; };
	struct kk53	{ int val; const char *msg; };
	struct kk54	{ int val; const char *msg; };
	struct kk55	{ int val; const char *msg; };
	struct kk56	{ int val; const char *msg; };
	struct kk57	{ int val; const char *msg; };
	struct kk58	{ int val; const char *msg; };
	struct kk59	{ int val; const char *msg; };
	struct kk60	{ int val; const char *msg; };
	struct kk61	{ int val; const char *msg; };
	struct kk62	{ int val; const char *msg; };
	struct kk63	{ int val; const char *msg; };
	struct kk64	{ int val; const char *msg; };
	struct kk65	{ int val; const char *msg; };
	struct kk66	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Мұнда Амос ұлы Ишая пайғамбардың Яһуда елі мен астанасы Иерусалим туралы көрген көріністерінде Құдайдан алған хабарлары берілген. Пайғамбар оларды Яһуда еліне Ұзиях, Жотам, Ахаз және Езекия патшалық құрған кездерде көрді."},
	{2, "2 Көк пен жер, ден қойып тыңдаңдар, Жаратқан Ие сөйлеп тұр. Ол былай дейді: Мен балалар асырап алып, өсірдім. Алайда олар Маған қарсы шығып, бас көтерді."},
	{3, "3 Әр өгіз өз қожайынын таниды, есек те иесінің жем салатын астауын біледі. Бірақ Исраил Мені танымайды: меншікті халқым Менің кім екенімді ұқпайды!"},
	{4, "4 О, күнәкар ұлт, мойнында ауыр кінәсі бар халық, зұлымдардың тұқымы, азғындыққа салынған ұрпақ! Мен Жаратқан Ие, Исраилдің Киелі Құдайы болсам да, олар Мені менсінбей, бас тартып, сырт айналып кетті!"},
	{5, "5 Неліктен сендер тағы да соққы жей бермексіңдер? Неге Маған қарсы тұрып, опасыздық жасауды қоймайсыңдар? Содан халықтың басы түгелдей жара, жүрегі әлсіз."},
	{6, "6 Табанынан тас төбесіне дейін сау жері жоқ. Тұла бойы толған жарақаттар, қамшының іздері, жараларының ауыздары ашық. Ешкім оларды жуып, май жағып сылап, таңған емес."},
	{7, "7 Сендердің жерлерің қаңырап бос қалған, қалаларың өртеніп, қираған. Жат жерліктер егістіктеріңнің өнімін көз алдарыңда жеп қояды. Жау қырып-жойып кеткен елдерің быт-шыт, жұрдай болып жатыр."},
	{8, "8 Тек Сион тауындағы Иерусалим қаласы ғана қалды. Ол жүзімдік ішіндегі шатырдай, қауын бақшасындағы күркедей жападан-жалғыз тұрған, жау қоршауға алған қалаға ұқсайды."},
	{9, "9 Әлемнің Иесі біразымызды тірі қалдырмағанда, біз де ежелгі Содом мен Ғомора қалаларының кебін киіп, толықтай жойылып кеткен болар едік."},
	{10, "10 Ей, Содомның билеушілері (сияқты зұлым басшылар), Жаратқан Иенің сөзін тыңдаңдар! Ғомораның халқы (іспетті күнәкарлар), Құдайымыздың тәліміне ден қойыңдар!"},
	{11, "11 Жаратқан Ие мынаны айтады: Көптеп құрбандық шалуларыңның Мен үшін қандай мәні бар? Ұсынған қошқарларыңа, бордақыланған малдарыңның майына әбден тойдым. Құрбандыққа шалған бұқаларың мен қой-ешкілеріңнің төгілген қанына да риза емеспін."},
	{12, "12 Алдыма келу үшін ғибадатханамның аулаларына кіресіңдер, әкелген құрбандық малдарың оларды аяқтарымен таптап тастайды. Кім мұны сендерден талап етті?"},
	{13, "13 Пайдасыз сый-тартуларыңды Маған бұдан былай ұсынбаңдар! Хош иісті зат түтетулеріңді де ұнатпаймын. Демалыс күндерін және Айдың бірінші күнгі мерекесін атап, діни жиындарда бас қосасыңдар. Ал сонымен қатар зұлымдықты жасай бересіңдер! Бұларыңа енді төзе алмаймын."},
	{14, "14 Сол себептен Айдың бірінші күнгі және өзге де мерекелеріңді жаным жек көреді. Олар Мен үшін ауыртпалыққа айналды, бос рәсімдеріңе төзуден мезі болдым!"},
	{15, "15 Сендер қолдарыңды жайып Маған сиынғанда назар аудармаймын. Қаншама көп мінажат етсеңдер де, Мен құлақ салмаймын. Себебі қолдарың жазықсыз адамдардың қанымен былғанған."},
	{16, "16 Күнәларыңнан арылып, тазарыңдар! Көз алдымда жасап келген зұлым істеріңді тоқтатып, жамандық атаулыдан бас тартыңдар!"},
	{17, "17 Жақсылық істеуді үйреніп, әділдікке ұмтылыңдар! Зорлық-зомбылық жасағандарды әшкерелеп, оларға тыйым салыңдар, жетім-жесірлерді қолдап, мүдделерін қорғаңдар!"},
	{18, "18 Жаратқан Ие былай деп шақырады: Келіңдер, мәселелеріңді талқылап, шындығына жетейік! Күнәларың ал қызыл болса да, рақым етіп, сендерді қардай аппақ қылмақпын. Қылмыстарың қан қызыл болса да, сендерді кешіріп, аппақ жүндей ағартпақпын."},
	{19, "19 Егер Маған мойынсұнып, тілімді алсаңдар, жердің жақсы өнімдерін жейтін боласыңдар."},
	{20, "20 Алайда қасарысып, Маған қарсы тұра берсеңдер, сендерді жаудың семсері жалмап қояды. — Жаратқан Иенің Өзі осыны нық айтқан."},
	{21, "21 Қарашы, ежелде Құдайға адал болған қала енді өзін опасыз әйелдей ұстайды! Бұл қала әділдік пен адалдықтың ордасы болатын, ал қазір оны кісі өлтірушілер мекендейді."},
	{22, "22 О, Иерусалим, сен күмістей құнды едің, енді қоқысқа ұқсайсың, дәмді сусындай едің, сұйылып кеттің."},
	{23, "23 Басшыларың — Құдайға қарсы шыққан бүлікшілер, ұры-қарақшылардың сыбайластары! Бәрі де пара алғанды ұнатып, сый-сияпат дәметушілер. Олар жетімдердің мүдделерін қорғамайды, жесірлердің өтініштеріне құлақ та салмайды."},
	{24, "24 Соған орай Исраилдің құдіретті Құдайы — Әлемнің Әміршісі Жаратқан Ие былай дейді: Ә, бәлем, Мен дұшпандарыма қаһарымды төгіп, теріс қылықтарының тиісті жазаларын тартқызамын!"},
	{25, "25 Иә, Иерусалим, саған қарсы да қатаң шара қолданамын: зергердің күмісті балқытып, сілтімен тазартатынындай, Мен де сені былғайтын қоқыс атаулыңнан арылтып, тазартамын."},
	{26, "26 Ежелде істегенімдей, саған тағы да әділ төрешілер мен дана кеңесшілерді тағайындаймын. Содан сен Әділетті қала, Адал астана деп аталатын боласың."},
	{27, "27 Осылай Жаратқан Ие Сион қаласын күнәларының құрсауынан құтқарып, әділдікті қалпына келтірмек. Сонда Ол қаланың опық жеп, теріс жолдан қайтқан тұрғындарын кешіріп, тура жолға түсіреді."},
	{28, "28 Алайда Құдайға қарсы тұрып, күнә жасаушылардың бәрі бірдей құриды, Жаратқан Иеден безгендер қырылып жойылады!"},
	{29, "29 Сендер киелі деген емен ағаштарыңның астында және бау-бақшаларыңның ішінде жалған тәңірлерге құлшылық етуді қатты ұнатып, соны таңдаған едіңдер. Міне, соларыңа бола масқараланасыңдар!"},
	{30, "30 Өйткені жапырақтары қурап кеткен емен ағашына, сусыз, кеуіп қалған бау-бақшаға ұқсайтын боласыңдар."},
	{31, "31 Күшті адамдарың кепкен дән қауызындай, ал арам қылықтары от ұшқынындай болады. Сонда олар кенеттен лап етіп жанып, бұл өртті ешкім де сөндіре алмайды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Құдайдың Яһуда елі мен Иерусалим қаласы туралы Амос ұлы Ишаяға аян арқылы білдірген хабары:"},
	{2, "2 Кейінгі заманда Жаратқан Иенің Киелі үйі тұрған Сион тауы Бастысы болады бар тау-төбелердің, Бәрінен де оның атақ-даңқы Әлдеқайда жоғары болып қалады. Барлық халықтардың адамдары Соған қарай ағылатын болады."},
	{3, "3 Енді жүріңдер, Жаратқан Иенің, Жақыптың халқы сиынған Құдайдың, Сион тауындағы киелі үйіне Өрлеп барайық барлығымыз, кәне! Сол жерде Жасаған Иеміз бізге Ақ жолын нұсқайды, сонымен жүрейік, Оның әділ еркін орындай берейік! Деп, көп ұлттар жолға шығады бірігіп. Сөзін таратады тәлімін үйретіп Жаратқан Ие Иерусалимнен, Сиондағы өз киелі үйінен."},
	{4, "4 Сонда Иеміз халықтар арасында Төрелік етіп, көптеген ұлттарға Шығаратын болады әділ үкімін. Енді олар төс үстінде қаруларын Қайта соғып соқаға қылыштарын Айналдырады, ораққа найзаларын. Содан халықтар енді қайтып ешқашан Бір-біріне қарсы қару көтермейді, Олар соғысуды тіптен үйренбейді."},
	{5, "5 Жақыптың үрім-бұтағы, келіңдер, Жаратқанның нұрында жүрейік біздер!"},
	{6, "6 О, Иеміз, Сен бізді: Өзің таңдап алған халқыңды, Жақыптың үрім-бұтағын тастап кеттің! Себебі ел іші шығыстан келген жаман әдет-салттарға толып тұр. Халқың Өзіңе мойынсұнбаған бөтендермен қол алысып, келісім жасайды, әрі філістірлердей сәуегейлікпен, сиқыршылықпен айналысады."},
	{7, "7 Бұл халықтың жері алтын-күміске кенелген. Қазынасының шегі жоқ, мінетін аттары мен соғыс күймелері де сансыз көп."},
	{8, "8 Осы ел пайдасыз қуыршақ тәңірлерге толы, адамдар өз қолдарынан шыққан заттарға табынады!"},
	{9, "9 Әрбір адам төмендетіліп, бәрі де масқараланады. О, Иеміз, соларға кешірім бермейсің!"},
	{10, "10 Ей, опасыздар, Жаратқан Иенің қорқынышты қаһарынан, Оның айбынды ұлылығынан құз-шатқалдардың қуыстарына қашып барып, жердің ой-шұңқырларына жасырынуға тырысыңдар!"},
	{11, "11 Менменнің көзі төмен түсіп, адамзаттың асқақтығы талқандалатын күн туады! Сонда жалғыз Жаратқан Иенің ғана мерейі үстем болады."},
	{12, "12 Әлемнің Иесінің сот жүргізетін сол күні күллі мақтаншақтар мен тәкаппарлар, өзін-өзі дәріптеуші әркім де масқараланып төмендетіледі!"},
	{13, "13 Сонда Ливан тауындағы зәулім самырсындар, Башан тауындағы күллі емендер шабылады,"},
	{14, "14 тіпті асқар биік тау-төбелер,"},
	{15, "15 заңғар мұнаралар мен мықты қамалдардың бәрі де тегістеліп, жермен-жексен болады."},
	{16, "16 Қандай да алып сауда кемесі мен көз тартатын әшекейлі бейне болмасын, барлығы да құртылады."},
	{17, "17 Сол күні адамның өркөкіректігі басылып, пенденің менмендігіне шек қойылып, жалғыз Жаратқан Иенің ғана мерейі үстем болады!"},
	{18, "18 Ал сол пайдасыз жалған тәңірлер мүлдем ғайып болып жоғалады."},
	{19, "19 Жаратқан Ие жерді сілкінту үшін тағынан тұрған сол кезде Оған мойынсұнбағандар құз-шатқалдардың қуыстарына әрі жердің ой-шұқырларына қашып барып, Жаратқан Иенің қорқынышты қаһарынан, Оның айбынды ұлылығынан жасырынып қалуға тырысады."},
	{20, "20 Сол күн туғанда күнәкарлар табыну үшін өздері жасап алған алтын, күміс тәңір мүсіндерін лақтырып, көртышқандар мен жарқанаттарға қалдырып кетеді."},
	{21, "21 Жаратқан Ие жерді сілкінту үшін тағынан тұрған сол кезде олар құз-шатқалдардың ішіндегі үңгірлер мен қуыстарға қашып кіріп, Оның қорқынышты қаһарынан әрі айбынды ұлылығынан тығылып қалмақ болады."},
	{22, "22 Ендеше пендеге арқа сүйеулеріңді доғарыңдар! Онда тұрған не бар? Ол алған деміндей өткінші ғой."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Сондықтан біліп алыңдар, енді Әлемнің Әміршісі Жаратқан Ие Иерусалим мен Яһуда елін барлық сүйеніштерінен ада етеді: олардың ас-су қорларын жоқ қылып,"},
	{2, "2 батырлары мен жауынгерлерін, төрешілері мен пайғамбарларын, сәуегейлері мен рубасыларын,"},
	{3, "3 елубасылары мен лауазымдыларын, кеңесшілері мен шебер ұсталарын және білгір бақсыларын да халық арасынан алып кетеді."},
	{4, "4 (Жаратқан Ие былай дейді:) Бұл елді жас балаларға басқартамын, жүгенсіз жасөспірімдерді билеушілері етіп қоямын."},
	{5, "5 Бұдан былай адамдар бір-бірін қанап, әркім өз жақын-жарандарына қысымшылық жасайды. Жастар паңданып үлкендерге қарсы шығады, қадірсіздер менменсіп беделділерді сыйламайды."},
	{6, "6 Сол кезде адамдар ағайындарының біреуіне жармасып: Үстіңде киімің бар ғой. Біздің басшымыз болып, қираған осы жерді қол астыңа алып, қалпына келтіре гөр! деп жалынатын болады."},
	{7, "7 Бірақ ол кісі қарсы шығып: Халықтың қасіретін емдеп жазатындай құдіретім жоқ! Жеуге тамақ, киюге киім өз үй ішіме де жетіспейді! Мені басшыларың қыла көрмеңдер! деп бас тартпақ."},
	{8, "8 Иерусалим қаласы осылай шайқалып, Яһуда елі осылай құлайды! Себебі олар сөздерімен де, істерімен де Жаратқан Иеге қарсы шығып, Оның көз алдында салтанатты ұлылығын менсінбей келеді."},
	{9, "9 Бұлардың бет-әлпеттері өздерін әшкерелейді. Олар ежелгі Содом халқы сияқты ашықтан-ашық күнә жасап, соларын мақтан да етеді. Өз бастарына өздері пәле тілеген олар қасіретке қалады!"},
	{10, "10 Ал әділ жандарға мына ізгі хабарды жеткізіңдер: олар еңбектерінің жемісін жеп, игіліктерін көреді."},
	{11, "11 Бірақ зұлымдар қасіретке қалады! Істеген жамандықтары өз бастарына түседі."},
	{12, "12 Балалар халқыма зорлық-зомбылық көрсетіп, әйелдер оған билік жүргізеді. Ей, халқым менің, жетекшілерің сендерді адастырып, теріс жолға түсіруде!"},
	{13, "13 Жаратқан Ие халықтарды соттауға дайын тұр."},
	{14, "14 Сонда Жаратқан Ие таңдап алған халқының рубасылары мен әміршілеріне айыптарын атап көрсетеді: Сендер Менің жүзімдігімді ойрандадыңдар! Өз сарайларыңды бейшаралардан тонап алған дүние-мүлікпен толтырдыңдар."},
	{15, "15 Менің халқыма қысымшылық жасап, кедейлерді езіп-жаншығандарың не?! — деп нық айтады Әлемнің Әміршісі Жаратқан Ие."},
	{16, "16 Жаратқан Ие тағы былай дейді: Сион шаһарының қыз-келіншектері қандай менмен! Олар бастарын қақшитып, көздерін қылмыңдатып жүреді, қадамдарын кербездене басып, аяқтарындағы сылдырмақтары сыңғыр-сыңғыр етеді."},
	{17, "17 Содан Жасаған Ие Сионның қыз-келіншектерін жазалайды: Жаратқан Ие олардың бастарына жара қаптатып, таз қылады."},
	{18, "18 Сол күні Жасаған Ие Иерусалимнің әйелдерін өздерінің мақтан тұтатын әшекейлерінен де айырады: аяқ сылдырмақтары мен шашбауларын, айшықты алқаларын,"},
	{19, "19 сырға-білезіктерін және бет перделерін, әдемі бас киімдері мен аяқ білезіктерін, белбеулері мен әтірлі құтыларын, бой тұмарларын, жүзіктерін және мұрындық сырғаларын, сондай-ақ сәнді киімдері мен шапандарын, халаттары мен әмияндарын, айналары мен бәтес киімдерін, шәлілері мен бөкебайларын — осылардың бәрін де Тәңір Ие Иерусалимнің әйелдерінен алып қояды."},
	{20, "23 Сонда хош иісті иіссуларының орнын сасық иіс басады. Әшекейлі белбеулердің орнына олар кендір жіп байлап, тым баптаған шаш орнына тақыр бас болады. Сәнді киімдер орнына азалы киім киіп, сұлулықтың орнын құлдықтың таңбасы басады."},
	{21, "24 Иерусалимнің ер адамдары семсерден өліп, жауынгерлері ұрыста қаза табады."},
	{22, "25 Қала қақпаларының басында жоқтау айтылып, жылап-сықтау болады. Қаңырап бос қалған астана тақыр жерде отырған әйелге ұқсап қалады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Сол күн туғанда әрбір ер адамға жеті әйел жармасып, оған: Нанымызды өзіміз тауып жеп, киімімізді өзіміз тауып киеміз. Тек күйеуіміз болып, масқаралықтан арылта көріңіз! — деп жалынып-жалбарынады."},
	{2, "2 Сол күндері Жаратқан Ие өсіріп шығарған Жас Өскін салтанатты да қадірлі болады. Исраил халқының қырғыннан тірі қалғандары осы жердің өнімін мақтан тұтып, даңққа кенеледі."},
	{3, "3 Сонда Сионда тірі қалып, Иерусалимде өмір сүру үшін тізімге тіркелген әрбір адам Құдайға бағышталған қасиетті деп аталады."},
	{4, "4 Себебі Жасаған Ие Сион шаһарының әйелдерін жан дүниелеріндегі ластан арылтады, әрі қан төккен Иерусалим қаласын әділдікпен соттап, қан дақтарынан отпен тазартады."},
	{5, "5 Содан кейін Жаратқан Ие Сион тауының және осында жиналғандардың үстерінен күндіз бұлт пен түтін, түнде жалындаған оттың сәулесін жаратады. Бұлар салтанатты қаланы тұтастай қалқалап жауып тұрып,"},
	{6, "6 оны күндізгі қапырықтан тасалап, дауыл мен жауыннан да қорғайтын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct kk5 poems[] = {
	{1, "1 Енді мен Жан досымның атынан Оның жүзімдігі жайлы жырын айтып берейін: Досымның жүзімдігі құнары асқан Қыраттың беткейіне орналасқан."},
	{2, "2 Досым оның топырағын қопсытып, Тазартты барлық тастардан арылтып, Таңдаулы бұталарды отырғызып, Күзетуге мұнара салды қойып. Жүзім шырынын таптап сығуға арнап Шұңқыр да жасап қойды әктастан қашап. Содан тәтті жемістің шығуын күтті, Жүзімдер бірақ ащы болып шықты!"},
	{3, "3 Сол себептен Досым мынаны айтады: Ал, кәне, Иерусалим тұрғындары, Сондай-ақ Яһуда азаматтары, Бақша мен Өзімнің арамыздағы Дауымызға төрелік айтыңдаршы:"},
	{4, "4 Баққа Мен істемеген не қалып еді? Мен одан тәтті жүзім күткенімде, Неліктен ол сондай ащы өнім берді?"},
	{5, "5 Сендерге білдірем жүзімдігіме Менің не істейтінімді келешекте: Қоршаған шарбағын шауып тастаймын, Тас дуалын қиратып, талқандаймын, Мал мен аңдарға таптатып қоямын, Жүзімдікті жермен-жексен қыламын,"},
	{6, "6 Осылай бақшамды ойрандатамын! Енді қайтып сабақтарын қысқартып, Топырағын өңдемеймін қопсытып. Тікенді бұталар, жантақ, ошаған Қаптап басып кетеді, әрі оған Еш уақытта да жаңбыр жауғызбауға Өзім бұйыратын болам бұлттарға."},
	{7, "7 Әлемнің Иесінің бұл жүзім бағы — Исраилден шыққан үрім-бұтағы, Оның сүйсіне еккен бау-бақшасы — Яһуда елінің адамдары. Құдай бұлардан әділдік күтті, Ал, міне, олар жазықсыз қан төкті! Жаратқан Ие олардан адалдық тосты, Ал, міне, жапа шеккендердің айқайы Құдайдың құлағына жетіп жатты!"},
	{8, "8 Үйлеріңе үй, егіндіктеріңе егіндік қосып алатындар, қасіретке қаласыңдар! Басқаларға орын қалдырмай, тек өздерің ғана осы жерде тұрмақсыңдар."},
	{9, "9 Әлемнің Иесінің мына сөздері құлағыма шалынды: Біліп қойыңдар: осы көптеген үйлер иелерінен айырылады, әдемі сарайлар да қаңырап бос қалады!"},
	{10, "10 Сол кезде он сотық жүзімдіктен жиналған өнімнен небәрі бір күбідей ғана шырын шығады, әрі себілген он қап тұқымнан бір-ақ қап астық жиналады!"},
	{11, "11 Таң ата тұрысымен сыраның соңына түскендер, түннің бір уағына дейін шарапқа қызып алып мас болып жүретіндер қасіретке қалады!"},
	{12, "12 Тойларында домбыра мен жетіген, даңғыра мен сыбызғы ойналғанда мұндайлар шарап ішіп қызыққа кенеледі. Алайда олар Жаратқан Иенің игілікті істеріне де назар аудармайды, Оның құдіретті қолымен жасаған іс-әрекеттеріне де көңіл бөлмейді."},
	{13, "13 Сол себепті халқым өз түсінбеушілігіне бола жер аударылады! Оның атақтылары аштыққа ұшырап, қалың көпшілік те шөл азабын тартатын болады."},
	{14, "14 Бұларға қоса о дүние де құнығып, аузын арандай ашып тұр. Ол еліміздің даңқты астанасын тосып тұрып, оның бұқара халқын, шулаған тобыры мен сауық-сайран салғандардың бәрін бірдей жұтып қояды."},
	{15, "15 Әрбір пенде төмендетіліп, бәрі де масқараланып, менменнің көзі төмен түседі."},
	{16, "16 Ал Әлемнің Иесі оларды соттап, әділ үкімін шығарғанына бола дәріптеледі, иә, Киелі Құдай Өзінің әділдігі арқылы өз киелілігін де ашық көрсетеді."},
	{17, "17 Сол кезде осы ел ойрандалып, қойлар онда емін-еркін жайылады. Жат жерлік кірмелер бұрынғы байлардың жерлерінен тойынатын болады."},
	{18, "18 Әділетсіз істеріне жіптей шандылып байланғандар қасіретке қалады! Олар жалғандыққа шырмалып, күнәларын арқанмен буылғандай арттарынан сүйреп жүр."},
	{19, "19 Оның үстіне: Құдай тездетсін, істейтінін жылдамдап істесін, көрейік! Исраилдің Киелі Құдайының жоспары жақында жүзеге ассын, Оның көздегенін біліп алайық! — деп олар мысқылдайды."},
	{20, "20 Жақсыны жаман, жаманды жақсы дейтіндер, қараңғылықты жарық, жарықты қараңғылық деп атайтындар, әрі ащыны тәтті, тәттіні ащы деп санайтындар қасіретке қалады!"},
	{21, "21 Өздерін сондай дана, парасатты деп есептейтіндер де қасіретке қалады!"},
	{22, "22 Сол шарап ішкіш батырлар, ішімдікті күшті етіп дайындаудың озаттары қасіретке қалады!"},
	{23, "23 Олар пара алып, кінәліні ақтап, әділді заңды құқығынан айырады."},
	{24, "24 Сондықтан от тілінің сабанды жалмап, жалынның пішенді өртеп жіберетіні сияқты, олар да әп-сәтте ғайып болады. Шөптің тамырлары шіріп, гүлдері қурап, желмен ұшып кететініндей, бірден жойылады. Өйткені олар Исраилдің Киелі Құдайы — Әлемнің Иесінің тәлімін мойындамай, Оның сөздерінен бас тартты."},
	{25, "25 Осы себептерден де Жаратқан Ие Өзінің халқына деген қаһарын лаулатып, оны жазалау үшін қолын көтеріп тұр. Оның құдіретінен таулар сілкінеді. Сонда өлгендердің денелері қоқыстай далаға лақтырылады. Соның өзінде Жаратушының қаһары әлі де басылған жоқ, Оның құдіретті қолы жазалау үшін көтеріліп тұр!"},
	{26, "26 Жаратқан Ие алыстағы халықтарға арнап туын көтеріп, ысқырғандай белгі береді. Сонда әскерлері жер шетінен асығыс аттанып, тез жетеді."},
	{27, "27 Ешқайсысы шаршамайды да сүрінбейді, қалғымайды да ұйықтамайды. Белбеулері босамайды, етіктерінің баулары да үзілмейді."},
	{28, "28 Бұл ерлердің жебелері үшкір, садақтары атуға дайын тұр. Мінген аттарының тұяқтары шақпақ тастай қатты, соғыс күймелерінің дөңгелектері құйындай жүйткиді."},
	{29, "29 Сол жауынгерлер шабуыл жасағанда арыстандай ақырады, күшті жас арыстандай айбат шегіп, олжасына бас салып, гүрілдеп алып кетеді. Соны ешкім де құтқарып қала алмайды."},
	{30, "30 Сол күні жау Исраилдің үстінен буырқанып долданған теңіздей ақырады. Пенде жағаға қарап, қара түнек пен азапты көреді. Қараңғы бұлттар жарықты жауып тастағандай, әркімнің де күдері үзіледі."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct kk6 poems[] = {
	{1, "1 Ұзиях патша қайтыс болған жылы мен аса дәріптелген, заңғар биік тағында отырған Тәңір Иенің аянын көрдім. Оның салтанатты шапанының етегі киелі үйдің ішін алып жатты."},
	{2, "2 Тәңір Иені айналдыра оттай жалындаған періштелер қызмет етіп тұрды. Әрқайсысында алты қанаттан болды, солардың екеуімен бетін, тағы екеуімен денесін жауып, қалған екеуімен ұшатын."},
	{3, "3 Жалындаған періштелер бір-біріне дауыстап: Әлемнің Иесі киелі, қасиетті, қастерлі! Бүкіл дүние Оның салтанатты ұлылығына кенелген! — десіп тұрды."},
	{4, "4 Олардың бұл айқайынан киелі үйдің есік жақтаулары мен табалдырықтары шайқалды. Үй іші түтінге толып кетті."},
	{5, "5 Сонда мен дауыстап: Қасіретке қалдым-ау, енді құритын болдым! Себебі мен күнәкармын, аузымнан шыққан сөздерім арам, әрі сөйлеген сөздері арам халықтың арасында тұрып жатырмын. Сонда да мен Патшаны, Әлемнің Иесін, өз көзіммен көрдім! — дедім."},
	{6, "6 Осы кезде жалындаған періштелердің бірі құрбандық үстелінен жанып тұрған көмір шоғынан көсеумен алып, маған ұшып келді."},
	{7, "7 Ол шоқты аузыма тигізіп былай деді: Міне, бұл еріндеріңе тиді. Енді сен әділетсіз істеріңнен арылып, күнәңнің арамдығынан тазардың."},
	{8, "8 Бұдан кейін Тәңір Иенің: — Мен кімді жіберейін? Біздің хабаршымыз кім болады? — деген даусын естідім. — Мен бармын, Ием. Мені жібере гөр, — деп жауап бердім."},
	{9, "9 Сонда Тәңір Ие маған былай деп бұйырды: — Осы халыққа барып, мына хабарды жеткіз: Естіп тұрыңдар, бәрібір түсінбейсіңдер, көріп тұрыңдар, бәрібір аңғармайсыңдар!"},
	{10, "10 Бұл халықтың жүректерін қасарысқан сезімсіз, құлақтарын керең, көздерін соқыр қыл! Әйтпесе олар көздерімен көріп, құлақтарымен естіп, жүректерімен ұғынып, теріс жолдарынан қайтып, рухани дертінен сауығар еді."},
	{11, "11 — Тәңір Ие, мұндай жайт қашанға дейін созылады? — деп сұрағанымда, Оның жауабы мынау болды: — Сол жайт қалалар қирап, қаңырап бос қалғанша, үйлер ешбір тұрғынсыз, егіндіктер ойрандалып, иесіз қалғанға дейін созылмақ."},
	{12, "12 Сонда Мен, Жаратқан Ие, халықтың бәрін алысқа қуып жіберіп, бүкіл елді талқандатып, айдалаға айналдырамын."},
	{13, "13 Елде жұрттың оннан бірі қалса да, олар да қайтадан жойылады. Алайда үлкен ағаштар кесіліп тасталғаннан кейін түбірлері қалатыны сияқты, халықтың Өзіме бағышталған тұқымы оның түбірі іспетті болып аман қалады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct kk7 poems[] = {
	{1, "1 Яһуда елінде Ұзияхтың немересі Жотамның ұлы Ахаз патшалық құрған кезде Арама патшасы Ресин мен Солтүстік Исраилдің патшасы Ремалиях ұлы Пақах екеуі Иерусалимге қарсы аттанып, шабуыл жасады. Алайда олар қаланы басып ала алмады."},
	{2, "2 Кейін тағы да Арама Солтүстік Исраилмен бізге қарсы одақтасты! деген суық хабар Дәуіттің әулетіне жетті. Содан Ахаз патша мен оның халқының қорыққаны сонша, дауыл шайқаған орман ағаштарындай дірілдеді."},
	{3, "3 Ал Жаратқан Ие Ишаяға бұйрық беріп былай деді: Сен ұлың Шеяр-Язубты ертіп алып, қаланың сыртында Ахазбен жолық. Оны Жоғарғы тоғанға қарай аққан арықтың соңынан, мата ағартушы шеберлердің даласына апаратын жол бойынан табасың."},
	{4, "4 Ахазға мына хабарымды жеткіз: Абай болып, тыныштық сақта! Ана бықсып, шала жанған екі отындық ағашқа ұқсайтын жауларыңнан қорықпа! Ресин мен Араманың және сол бір Ремалиях ұлының лаулаған қаһарынан зәрең ұшпасын!"},
	{5, "5 Рас, Арама Ефреммен, оның патшасы Ремалиях ұлымен бірге саған қарсы зұлым жоспар құрды:"},
	{6, "6 Кәне, Яһудаға қарсы аттанып, үрейін ұшырайық! Елді өзара бөлісіп алып, оған Табеил ұлын патша етіп тағайындайық! дейді."},
	{7, "7 Алайда Жаратушы Тәңір Ие мынаны айтады: Бұл ешқашан да жүзеге аспайды!"},
	{8, "8 Себебі Дамаск тек Араманың бас қаласы, ал Ресин небәрі Дамаскінің басы ғана болады. Ефремге келсек, ол алпыс бес жылдың ішінде талқандалып, халық болудан қалады."},
	{9, "9 Самария тек Ефремнің бас қаласы, ал Ремалиях ұлы небәрі Самарияның басы ғана бола береді. Ал егер сенімдеріңде берік тұрмасаңдар, онда (жауға қарсы) берік тұра алмайсыңдар!"},
	{10, "10 Жаратқан Ие Ахаз патшаға тағы бір хабар жіберіп:"},
	{11, "11 — Осыны істейтіндігімді саған дәлелдеуім үшін Менен, Құдайың Жаратқан Иеден, бір керемет жасауымды сұра! Бұл керемет іс жердің терең тұңғиығынан немесе аспанның қиыр шетінен болса да, сұрай бер! — деп бұйырды."},
	{12, "12 Бірақ Ахаз: — Жоқ, мен соны сұрамаймын! Жаратқан Иені осылайша сынағым келмейді, — деп бас тартты."},
	{13, "13 Сонда Ишая оған былай деді: — Дәуіттің әулеті, сөзіме құлақ салыңдар! Адамдардың төзімін сынағандарың аз болғандай, енді Құдайымның да төзімін сынамақсыңдар ма?!"},
	{14, "14 Ендеше Тәңір Иенің Өзі сендерге осыны істейтіндігін дәлелдейтін кереметті жасайды: Біліп алыңдар, пәк қыз құрсақ көтеріп, ұл туады. Оған Имануил (яғни Құдай бізбен бірге) деген ат қояды."},
	{15, "15 Нәресте есейіп, жаманнан бас тартып, жақсыны таңдай білетін жасқа келгенде ішетін тамағы тек айран мен бал болады."},
	{16, "16 Себебі бала ер жетіп, жаманнан гөрі жақсыны таңдай білетін жасқа келместен бұрын-ақ, сені соншама қатты қорқытқан әлгі екі патшаның елдері ойрандалады."},
	{17, "17 Жаратқан Ие саған, сенің халқыңа және әкеңнің әулетіне де ауыр күндерді төндіреді. Солтүстік Исраил Яһудадан бөлініп шыққаннан бері, елің сондай пәлені бұрын-соңды басынан кешпеген еді: Жаратқан Ие сендерге қарсы Ассур патшасын аттандырмақ!"},
	{18, "18 Сол кезде Жаратқан Ие жауларыңа ысқырып белгі беріп, оларды осы елге шақырып алады. Бәрі де не шыбын-шіркей секілді Мысырдағы Ніл өзенінің алыс салаларынан, не жабайы ара сияқты Ассур патшалығынан осы елге қаптап келеді. Олар үйір-үйірімен сай-салаларға, құз-шатқалдардың жарықтарына, тікенекті бұталар мен суаттардың барлығына қонатын болады."},
	{19, "20 Сол күндері Тәңір Ие Ассур патшасын Евфрат өзенінің ар жағынан жалдап алып, сендерге қарсы жібереді. Сонда Ол Ассур патшасын ұстарадай қолданады: сендердің шаштарың мен аяқтарыңдағы түктеріңді, тіпті сақал-мұрттарыңды да алып тастаған іспетті сендерді масқара қылады."},
	{20, "21 Бұл уақыт келгенде шаруа өзінің табын-отарларынан тек бір қашары мен екі қой-ешкісін ғана қырғыннан сақтап қала алады. Бірақ соның өзінде"},
	{21, "22 олар (тапталған егіндіктер мен бау-бақшаларда емін-еркін жайылып) сүтті мол беретіні сонша, ол айран ұйытуға да жетеді. Елдегі пәледен аман қалғандар тек айран ішіп, бал жейтін болады."},
	{22, "23 Бұрын құны бір мың мысқал күміс болған, бір мың жүзім бұтасы өскен әрбір жүзімдікті сол күндері тікенді бұталар әрі жантақ, ошаған қаптап кетеді."},
	{23, "24 Адамдар осылай ойрандалып, тікенді бұталар мен арам шөп басқан барлық жерге тек садақпен қаруланып қана баратын болады."},
	{24, "25 Бір кезде кетпенмен қопсытылып, өңделген барлық қырат-қырқаларыңа тікенді бұталар әрі жантақ, ошаған қаулап өсіп тұрғандықтан, енді онда бара алмайтын боласыңдар. Сол жерлерді ірі қара мен ұсақ малдар емін-еркін таптайтын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct kk8 poems[] = {
	{1, "1 Кейінірек Жаратқан Ие маған мынадай бұйрық берді: Аумақты тақта ал да, оған жұрт оқитындай етіп: Тез-Тонап-Жылдам-Олжалау деп жаз!"},
	{2, "2 Сол үшін мен екі адамды: діни қызметкер Ұрияны және Барақиях ұлы Зәкәрияны сенімді куәгерлерім етіп алдым."},
	{3, "3 Бұдан кейін мен пайғамбар әйел — жұбайыммен жақындасып, ол құрсақ көтеріп, ұл туды. Жаратқан Ие маған былай деп бұйырды: Бұл балаға Тез-Тонап-Жылдам-Олжалау деген ат қоясың."},
	{4, "4 Себебі оның тілі шығып, Апа, әке дегенше, Дамаск пен Самарияның бүкіл байлығын Ассур патшасы олжалап кетеді."},
	{5, "5 Жаратқан Ие маған тағы да тіл қатып"},
	{6, "6 былай деді: Осы халық (Өзім Иерусалимнің игілігі үшін ағызып отырған) Силоғам бұлағының тыныш суын менсінбейді. Қайта, олар Ресинге және Ремалияхтың ұлына қуанады!"},
	{7, "7 Біліп қойыңдар: сол себепті Мен, Тәңір Ие, Евфрат өзенінің буырқана тасыған мол суларын, яғни Ассур патшасын, күллі қарулы күштерімен осы жерге бағыттаймын. Евфрат өзені көктемде арна-салаларынан асып-тасып, сулары"},
	{8, "8 адамдардың мойнына дейін көтеріледі. Сол сияқты, Ассур патшасы мен оның әскері де жуырда бүкіл Яһуда жеріне жайылып шығып, бұлқан-талқан болып ағып, елді басып кетеді! О, Имануил, оның кең қанаттары бүкіл жеріңе жайылатын болады!"},
	{9, "9 Ей, халықтар, қанша ұран салсаңдар да, бәрібір шайқалып құрисыңдар. Жер бетінің алыс түкпірлері, тыңдаңдар! Шабуылға бел байлап қарулансаңдар да, бәрібір күйреп, құрисыңдар. Иә, айқасқа дайындала беріңдер, алайда қырыласыңдар."},
	{10, "10 Кеңесіп жоспар құрып, көп сөз сөйлесеңдер де, бұларың іске аспайды, себебі Құдай бізге жар!"},
	{11, "11 Жаратқан Ие менің үстіме құдіретті қолын қойып тұрып хабарын жеткізді. Ол мені осы халық жүріп бара жатқан теріс жолға түсуден сақтандырып былай деді:"},
	{12, "12 Бұл халықтың бүлік деп атағандарын сендер солай санамаңдар! Басқалардың қорыққандарынан сендер қорқып, үрейленбеңдер!"},
	{13, "13 Тек Әлемнің Иесін ғана киелі деп құрметтеп, терең қастерлеңдер, (Оның еркіне қарсы шығудан) шошынып дірілдейтін болыңдар!"},
	{14, "14 Жаратқан Ие сендер үшін паналайтын киелі орын іспетті болмақ. Бірақ Ол Исраилдің екі патшалығы үшін адамдарды сүріндіретін кедергі тас, құлататын жартас сияқты, әрі Иерусалимнің тұрғындарын түсіретін тұзақ пен тор секілді болады."},
	{15, "15 Олардың көбі сүрініп құлап, талқандалады, не торға түсіп, ұсталады."},
	{16, "16 Енді осылар туралы білдірген ескертулерім мен тәлімдерім жазылған қағаздарды шиыршықтап орап, байлап, шәкірттерімнің көз алдарында мөрлеп, соларға сақтатқызып қой!"},
	{17, "17 Жаратқан Ие Жақыптың үрім-бұтағынан өз бетін жасырып жатса да, мен Оған үмітпен қарап, сенімімді арта беремін."},
	{18, "18 Міне, мен және Жаратқан Ие маған сыйлаған балалар мұндамыз! Жер бетіндегі тұрағы Сион тауында орналасқан Әлемнің Иесі бізді Исраил елінде Өзінің болашақта не істейтінін білдіретін хабары мен белгісі етті."},
	{19, "19 Алайда халық сендерге: Аруағы мен жынын шақырып, сыбырлап, міңгірлейтін бақсылар мен сәуегейлерден кеңес сұрауды сұраңдар! деп ұсынады. Онда оларға былай деңдер: Халық жалғыз Құдайына ғана сиынып, Оның еркін сұрауға тиісті емес пе? Тірілерге болашақты білу үшін өлгендермен ақылдасудың қажеті бар ма?!"},
	{20, "20 Қайта, Жаратқан Иенің білдірген тәлімдері мен ескертулеріне көңіл бөліп, соларға сүйеніңдер! — Егер халық осы хабарларыма сай сөйлемесе, онда оларға атар таң жоқ."},
	{21, "21 Керісінше, олар зор қысымшылық көріп, ашығып, жер-жерде қаңғырып жүретін болады! Аштықтан қиналғанда олар қатты ашуланып, өздерінің патшасы мен Құдайына тіл тигізеді. Содан олар аспан мен"},
	{22, "22 жерге көз салып, тек қайғы-қасірет, қара түнек пен үрейлі қараңғылықты ғана көреді-ау! Олар әбден түңіліп, қара түнекке қуылады. Алайда қазір қысымшылық көріп жатқан жерде ұдайы қараңғы бола бермейді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct kk9 poems[] = {
	{1, "1 Забулон мен Нафталимнің отанын Иеміз бұрыннан масқараға ұшыратқан. Ал болашақта осы бір аймақты — Теңізге баратын жол бойындағы Әрі Иорданның батыс жағындағы Бөтен ұлттар тұрған Ғалилея аймағы Зор абыройға бөлейтін болады!"},
	{2, "2 Халық қараңғыда ғұмыр кешіп келеді, Ал енді бір ғаламат Нұрды көреді, Түнек басқан жерде тұратын елге Таңның шапағы сәулесін төгуде!"},
	{3, "3 Уа, Ием, Сен санын көбейтіп халқыңның, Оған үлкен қуаныш та сыйлайсың. Адамдар өнім жинау маусымында, Не жау олжасын бөлісіп алғанда Қатты қуанатындары сияқты, Халқың шаттанады Сенің алдыңда."},
	{4, "4 Себебі Сен өз ата-бабаларын Ежелде Мадиянның зорлығынан Шексіз құдіретіңмен құтқарғансың! Енді тағы да меншікті халқыңның Еңсесін басқан езгіні құртасың, Арқасын ұрып-соққан жау сойылын, Қатал қанаушының асатаяғын Біржола сындырып, жойып тастайсың!"},
	{5, "5 Әскердің жер таптаған етіктері Әрі қанға малынған киімдері Енді өртелуге белгіленеді, Бәрі де отқа жем болып кетеді."},
	{6, "6 Себебі Сәби дүниеге келді, Біз үшін осы Ұл сыйға берілді! Билік Оның қолында қала береді: Ол керемет ақылды Кеңесші, Құдіретті Құдай, Мәңгілік Әке, Тыныштықты сыйлайтын әмірші Деп те аталатын болады."},
	{7, "7 Оның құрған билігі арта түсіп, Орнатқан тыныштығы шексіз болады, Өзі Дәуіттің тағына отырып, Мәңгі патшалығын сол кезден бастайды, Әділдікпен нығайтып, жалғастырып, Ақиқатты да ұстанатын болады. Барлық қайрат-жігерімен бұларды Әлемнің Иесі іске асырады!"},
	{8, "8 Жасаған Ие Жақыптың үрім-бұтағына үкім шығарды, әрі бұл шешімін олардың арасында жүзеге асырады. Солтүстік Исраилдің бүкіл халқы, Самария қаласының әрбір тұрғыны мұны ұғынатын болады. Олар өркөкіректеніп, менменсіп:"},
	{9, "10 Саман үйлеріміз құлады, бірақ біз қашалған тастан қалап мықтылап қайтадан үй саламыз! Тұт ағаштарымыз кесіліп тасталды, бірақ орнына әлдеқайда құнды балқарағайлар отырғызамыз! — деп, қиқарлық көрсетіп келді."},
	{10, "11 Алайда Жаратқан Ие Ресин патшаның жауларын күшейтіп, Солтүстік Исраилге қарсы"},
	{11, "12 шығыстан Араманы, батыстан філістірлерді аттандырды. Олар Исраилді жалмап қоюға құнығып, ауыздарын арандай ашты. Соның өзінде Жаратқан Иенің қаһары әлі де басылған жоқ, Оның құдіретті қолы жазалау үшін көтеріліп тұр!"},
	{12, "13 Алайда осы халық өзін жазалаған Әлемнің Иесіне қайтадан бет бұрып, Оның еркін білуге ұмтылған жоқ."},
	{13, "14 Сол себепті бір-ақ күн ішінде Жаратқан Ие Исраилдің басы мен құйрығын, оның үлкенді-кішілі барлығын да шауып тастайды:"},
	{14, "15 рубасылар мен атақтылар — елдің басы, ал құйрығы — жалған тәлім беруші көріпкелдер."},
	{15, "16 Бұл халықты өз жетекшілері адастырады. Соларға еріп жүргендер теріс жолға азғырылады."},
	{16, "17 Сондықтан Жасаған Ие осы халықтың жас жігіттерін аямайды, жетім-жесірлеріне де жаны ашымайды. Себебі бәрі де арсыз зұлымдар, ауыздарынан шыққан сөздері өтірік! Алайда Жаратушының қаһары әлі де басылған жоқ, Оның құдіретті қолы жазалау үшін көтеріліп тұр!"},
	{17, "18 Расында адамдардың әділетсіздігі от іспетті лаулап жанып, тікенді бұталарды әрі жантақ, ошағанды жалмап, ну орманды да өртеп жібереді. Түтін бағаналары зәулім биікке дейін көтеріледі."},
	{18, "19 Әлемнің Иесінің лаулаған қаһарынан жер өртеніп, халық отқа жем болады. Сонда адамдар жақындарын да аямай, әркім өз қара басын ғана қорғайды."},
	{19, "20 Олар оңды-солды тапқандарын жалмап жеп жатса да, көрген аштығының беті қайтпайды. Адам тіпті өз қандастарын да жалмап,"},
	{20, "21 Манаса Ефреммен, Ефрем Манасамен соғысып, содан екеуі бірігіп Яһудаға шабуыл жасайды. Соның өзінде Жаратушының қаһары әлі де басылған жоқ, Оның құдіретті қолы жазалау үшін көтеріліп тұр!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct kk10 poems[] = {
	{1, "1 Әділетсіз заңдар шығарып, халықты азаптайтын ережелер жариялаған билеушілер қасіретке қалады-ау!"},
	{2, "2 Олар халқымның арасындағы жарлыларды құқықтарынан айырып, жәбір көргендерге әділет жолын жауып тастайды. Тіпті жесірлерді олжалап, жетімдердің барын тонайды!"},
	{3, "3 Ей, мұндай озбырлық жасайтындар, Құдай сендерді жауапқа тартып, алыс елдерден апат жіберген кезде не істемексіңдер? Көмек сұрап кімге жүгіріп, мақтан тұтқан байлықтарың мен беделдеріңді қайда қалдырмақсыңдар?"},
	{4, "4 Сендер не тұтқындардың қатарында бүгіліп айдалып кетесіңдер, не шайқаста өлесіңдер! Соның өзінде Жаратушының қаһары әлі де басылған жоқ, Оның құдіретті қолы жазалау үшін көтеріліп тұр!"},
	{5, "5 Жаратқан Ие былай дейді: — Ассур патшалығы қасіретке қалады! Мен оны ызғарлы қаһарыма ұшырағандарды жазалау үшін ғана таяқ, сойыл сияқты пайдаланамын."},
	{6, "6 Ассурдың әскерін Менен безіп, қаһарымды шақырған арсыз халыққа қарсы аттандырамын, әрі оны тонап, олжалауға, даладағы саз-балшықтай таптауға жіберемін."},
	{7, "7 Алайда Ассур патшасының ой-ниеті Менің еркімнен басқаша: ол көптеген халықтарды жойып, мүлдем жоқ қылуды көздейді."},
	{8, "8 Содан Ассур патшасы былай деп мақтанып бөседі: Менің барлық әміршілерім патшадай күш-қуатқа ие емес пе?"},
	{9, "9 Мен Қаркеміш сияқты Қална қаласын да, Хамат секілді Арпад қамалын да, Дамаск сияқты Самарияны да оп-оңай басып аламын!"},
	{10, "10 Мен талай патшалықтарды өзіме қаратып, уысымда ұстаймын. Бұлардың түкке тұрғысыз тәңірлері мен мүсіндері Иерусалим мен Самариядағылардан күштірек."},
	{11, "11 Мен Самарияны өзінің пайдасыз тәңірлерімен қоса құрттым, Иерусалимге және ондағы жұрт табынатын мүсіндерге де дәл солай істеймін!"},
	{12, "12 Алайда Тәңір Ие Сион тауы мен бүкіл Иерусалимге қарсы істеп жатқандарының бәрін бітірген кезде былай дейтін болады: — Мен Ассур патшасын өркөкіректеніп, паңдана қарап жүргені үшін жауапқа тартатын боламын!"},
	{13, "13 Ол патша былай деп мақтанады: Мен сол істерді өз қолымның күшімен әрі өз көрегендігіммен жүзеге асырдым, себебі ақылды да парасаттымын! Мен халықтардың шекараларын алып тастап, қазыналарын талан-таражға салдым. Өз құдіретіммен тақ иелерін құлаттым."},
	{14, "14 Құстың ұясынан жұмыртқаларын жинағандай мен халықтардың жерлерін әрі байлықтарын оп-оңай қолыма түсірдім. Мені қорқыту үшін бірде-бір қанат қағылып, бірде-бір тұмсық айбаттанып, шиқ деп үн де қатпады."},
	{15, "15 Бірақ балта өзімен ағаш шапқан иесінен гөрі кереметпін деп мақтана ала ма? Немесе ара өзімен жұмыс істейтін ұстаның алдында көкіректене ала ма? Таяқ, сойыл адамды көтермейді, қайта, адам таяқ не сойылды көтеріп, сілтейді!"},
	{16, "16 Сол себептен Әлемнің Әміршісі Жаратқан Ие Ассур патшасының денелі жауынгерлерін қатты ауыртып, жүдетеді, оның даңқты әскерін лаулаған өртпен жалмағандай құртады."},
	{17, "17 Исраил сиынған Киелі Құдай, оның жарық Нұры, лаулаған от пен жалынға ұқсап бір-ақ күнде Ассурдың тікенді бұталарын әрі жантақ, ошағанын өртеп жібереді:"},
	{18, "18 оның әйгілі ормандары мен құнарлы бау-бақшаларын түгелдей жалмап жояды. Сонымен қатар Ассурдың даңқты әскері де қатты ауырған адамдай әлсірей береді."},
	{19, "19 Сонда жас баланың өзі-ақ санап шыға алатындай біразы ғана аман қалады."},
	{20, "20 Сол кезде Исраил халқының тірі қалғандары өздерін талқандап, жойған одақтастарына енді қайтып сүйенбейтін болады. Керісінше, олар бұдан былай сенімдерін шын жүректен Жаратқан Иеге, Исраилдің Киелі Құдайына, артады."},
	{21, "21 Тірі қалғандары қайта оралады: Жақыптың үрім-бұтағының аман қалғандары Құдіретті Құдайға қайтадан бет бұрады."},
	{22, "22 Уа, Исраил, сенің халқың теңіз жағалауындағы құм қиыршықтарындай сансыз көп болса да, олардың біразы ғана тірі қалып, қайта оралады! Құдай осы халыққа қырылуды бұйырып, шексіз әділдікпен үкімін шығарған."},
	{23, "23 Иә, Әлемнің Әміршісі Жаратқан Ие бұл үкімін бүкіл жерде іске асырады."},
	{24, "24 Сондықтан Әлемнің Әміршісі Жаратқан Ие мынаны айтады: Уа, Сионда тұратын халқым, Ассур патшалығынан қорықпаңдар! Рас, ол сендерді ежелгі мысырлықтардай таяқ, сойылмен ұрып-соғып, зәбір көрсетуде."},
	{25, "25 Бірақ аз уақыттан кейін Мен сендерге деген ызғарлы қаһарымнан қайтып, оны Ассурға төгіп, сол елді қырып-жоямын."},
	{26, "26 Мен, Әлемнің Иесі, баяғыда Ориб құзының маңайында Мадиян тайпасының жасағын күйрете соққанымдай, енді Ассурды қамшыммен соғамын. Ежелде таяғым Мысыр елі мен Қамысты теңіздің үстінен көтеріліп, алға созылғандай, енді Ассурдың өзенінің үстінен де таяғымды созып, құдіретімді көрсетемін."},
	{27, "27 Сол уақыт жеткенде сендер қанаушыларыңның мойындарыңа артқан ауыр жүктерінен арыласыңдар! Жаудың еңселеріңді басқан езгісін күл-талқан етесіңдер. Себебі семіріп, зор күшке ие боласыңдар."},
	{28, "28 Ассур әскері Аят қаласына басып кіріп, Мигроннан өтіп кетті, содан Миқмаста қару-жарақ, азық-түлік қорларын тексеріп, сонда қалдырды!"},
	{29, "29 Олар өткелден асып, Гебада түнемек. Рамақ қаласының үрейі ұшып, Саулдың мекені болған Гибеяның тұрғындары да қашып кетті."},
	{30, "30 Ғалимның халқы, айқайла! Құлақ салыңдар, Лайша мен шарасыз Анатоттың тұрғындары!"},
	{31, "31 Мадмена қашып кетіп, Гебимнің халқы да бас сауғалап тығылуда."},
	{32, "32 Жау Ноб қаласында бүгін-ақ аялдап, Сион тауына, Иерусалим қаласы салынған төбеге қарай жұдырығын сілтейді."},
	{33, "33 Біліп алыңдар, Әлемнің Әміршісі Жаратқан Ие оларды ағаштың кесілген бұтақтарындай етіп қорқынышты құдіретпен шауып құлатады. Зәулім ағаштай өркөкіректеніп, менменсіген олар кесіліп түсіп, қор болады."},
	{34, "34 Ливанның қалың ормандары балтамен шабылып тасталғандай, паңданған жаудың әскері Құдіретті Құдайдың алдында құлап, жермен-жексен болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct kk11 poems[] = {
	{1, "1 Кесілген ағаштың түбірі мен тамырларынан жас өркен өсіп шығады. Сол сияқты Есей ұлы Дәуіттің патшалық биліктен айырылған әулетінен шығатын бір ұрпақ күндердің күнінде қайтадан патшалық құрады."},
	{2, "2 Осы патшаға Жаратқан Иенің Рухы қонып, оған даналық пен парасат, ақыл-кеңес пен құдірет, білімділік және Жаратқан Иені терең қастерлеуді дарытады."},
	{3, "3 Өзі Жаратқан Иеге мойынсұнып, Оны терең қастерлеуден қуаныш табады. Патша тек көрген сырт пішінге, ұзын құлақтан естігеніне ғана сүйеніп үкім шығармайды."},
	{4, "4 Қайта, жарлыларға әділдікпен төрелік айтып, жердің жапа шеккендерінің заңды мүдделерін қорғайды. Оның аузынан шыққан үкімдер осы дүниеге дүре соққан таяқ сияқты: айтқан әмірлерімен зұлымдардың көздерін құртады."},
	{5, "5 Патша әділдікпен билік жүргізіп, ақиқат пен адалдықты берік ұстануға белін бекем буады."},
	{6, "6 Сол заманда қасқыр қозымен тату-тәтті тұрып, қабылан лақпен бірге тынығады. Бұзау, мықты жас арыстан және бордақы өгіз де қатарласып бірге жататын болады. Бәрін бір жас бала айдап, баға алады."},
	{7, "7 Сиыр мен аю қатар жайылып, бұзаулары мен қонжықтары бірге тынығып, арыстан өгіз сияқты сабан, шөп жейді."},
	{8, "8 Сәбилер сұр жыланның інінің қасында ойнап, балдырғандар зәрлі жыланның ұясына қолын емін-еркін тығатын болады."},
	{9, "9 Бүкіл қасиетті тауымда ешқандай зұлымдық пен қиянат жасалмайтын болады, — дейді Жаратқан Ие. Себебі теңіздің суға толы болатынындай, жер де Жаратқан Иені жақыннан танып, қастерлеген адамдарға солай толы болады!"},
	{10, "10 Сол заманда Есей ұлы Дәуіт патшаның тамырынан өскін іспетті шыққан Ұрпақ халықтарға арнап тігілген ту сияқты белгі болады. Басқа ұлттар Оған бет бұрып, үмітін артады. Оның тынығып демалатын орны салтанатты да құрметті болады."},
	{11, "11 Сол күн туғанда Тәңір Ие (ата-бабаларын Мысырдағы құлдықтан азат еткеніндей) тағы да құдіретті қолын алға созады. Оның халқының тірі қалғандары Ассурға, Төменгі мен Жоғарғы Мысырға, Құшқа, Елам мен Бабылға, Арамадағы Хаматқа және теңіз жағаларындағы алыс жерлер мен аралдарға шашырап кеткен еді. Енді Тәңір Ие оларды Өзіне қайтарады."},
	{12, "12 Басқа халықтарға арнап туын көтергендей белгі беріп, Солтүстік Исраил мен Яһуда патшалықтарының жер аударылып, шашыраған халқын дүниенің төрт бұрышынан жинап, қайтарып әкелмек."},
	{13, "13 Солтүстік Исраил елі енді қайтып Яһуданы күндемейді, Яһудаға қарсы жауласып келгендердің бәрі де ғайып болады. Бұдан былай Яһуда Солтүстік Исраилге қастық жасамайды."},
	{14, "14 Керісінше, екеуі бірігіп батысқа қарай аттанып, қырат беткейімен құлдырап түсіп, філістірлерге шабуыл жасайды. Олар шығыстағы жау халықтардың олжаларын да иемденіп, Едом мен Моабқа билік құрады, Аммон да оларға мойынсұнады."},
	{15, "15 Жаратқан Ие Мысыр теңізінің шығанағын құрғатып, жоқ қылады. Өзінің құдіретті қолын бұлғап, аңызақ желімен Евфрат өзенін де кептіріп тастайды: оның кісі жаяу өте алатындай таяз етіп жеті тармағын ғана қалдырады."},
	{16, "16 Сонда Жаратқан Иенің халқының тірі қалғандарына Ассурдан шығатын даңғыл жол дайын тұрады. Бұл жайт олардың ата-бабаларының Мысыр елінен шыққан кезіндегідей болмақ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct kk12 poems[] = {
	{1, "1 Сол кезде мынадай ән-жыр айтатын боласың: Уа, Жаратқан Ием, Сені мадақтаймын! Маған ашуланған едің, ал сосын Қаһарыңды басып, мені жұбаттың."},
	{2, "2 Сөз жоқ, тек Құдай менің Құтқарушым! Оған сеніп, қорықпаймын да енді, Жаратқан Ие — күш-қуатымның көзі, Айтатын жырым Тәңір Ием жайлы, Ол адал Құтқарушым болып келеді!"},
	{3, "3 Құтқарылудың қайнар көздерінен Су ала бересіңдер қуанышпен."},
	{4, "4 Сол кезде былай дейтін боласыңдар: Жаратқан Иеге шүкірлік етіп, Есімін атап Оған сиыныңдар, Әділ істерін ұлттарға білдіріп, Есімінің ұлылығын хабарлаңдар!"},
	{5, "5 Жаратқан Иеге арнап ән шырқаңдар, Ол ұлы кереметтерді істеді, Осыны білсін жер жүзінің бәрі!"},
	{6, "6 Уа, Сионның халқы, масаттаныңдар, Дауыстап қалықтата ән салыңдар: Исраил сиынған Киелі Құдай Енді өздеріңнің араларыңда Бөленеді салтанатты ұлылыққа!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct kk13 poems[] = {
	{1, "1 Амос ұлы Ишая Бабыл қаласы туралы көрініс көріп, мына ауыр хабарды алды:"},
	{2, "2 Тақыр төбе басына ту көтеріңдер, келетін әскерге айқайлап та, қол бұлғап та белгі беріңдер! Олар Бабылдағы ақсүйектердің қақпаларына басып кірсін."},
	{3, "3 Мен, Жаратқан Ие, бұл жасақшыларды осы мақсатым үшін таңдап алдым. Сол мықты адамдар Менің қаһарлы үкімімді орындайды. Олар салтанатты ұлылығыма шаттанады."},
	{4, "4 Таудан шыққан дауысқа құлақ түріңдер, ол — жүріп келе жатқан үлкен әскердің шуы сияқты ғой! Патшалықтардың жиналған халықтары айқайлауда. Әлемнің Иесі осы әскерді шайқасқа дайындап түгендеп жатыр."},
	{5, "5 Олар көкжиектің ар жағындағы алыс елдерден келді. Бұл жасақшылар — Жаратқан Иенің қаһарын іске асырып, бүкіл елді құртатын құралдары."},
	{6, "6 Зар жылаңдар, Жаратқан Иенің (соты) күні таяп қалды! Сол кезде құдіреті шексіз Құдай жерді талқандайды."},
	{7, "7 Сондықтан бүкіл бабылдықтардың қолдарынан күші кетіп, әркім жүрексініп қалтырауда."},
	{8, "8 Бәрінің үрейлері ұшып тұр. Олар толғағы қысқан әйелдей аласұра бүрісіп, бір-біріне таңырқай қарайды. Беттері қорқыныштан алабұртқан."},
	{9, "9 Біліп қойыңдар, Жаратқан Иенің (сот жүргізетін) күні таяп қалды! Ол — Оның лаулаған сұрапыл ашу-ызасының күні! Сонда Жаратқан Ие жерді құла түзге айналдырып, ондағы күнәкарларды қырып-жоймақ."},
	{10, "10 Аспандағы жұлдыздар мен шоқжұлдыздар жарқылдауын доғарады. Күн шықса да, оны қараңғылық басады, ай да жарқырамайтын болады."},
	{11, "11 Мен, Жаратқан Ие, жер бетіндегі адамзатқа жасаған зұлым істерінің сазайын тартқызып, әділетсіз адамдарды күнәлары үшін жазалаймын. Мен өркөкіректердің асқақтығын тоқтатып, зорлықшылдардың паңдығын жоямын."},
	{12, "12 Осылай Мен адамзаттың санын азайтып, пендені саф алтыннан да сирек, тіпті сонау Опыр елінен әкелінген таңдаулы алтыннан да құнды қыламын."},
	{13, "13 Себебі Мен, Әлемнің Иесі, лаулаған қаһарымды көрсеткен сол күні аспанды шайқалтамын! Сонда жер сілкініп өз орнынан қозғалады."},
	{14, "14 Содан (Бабылдағы) әрбір адам аңшы қуған киіктей, бақташысы жоқ отардай өз халқы мен еліне қарай қашып кетеді."},
	{15, "15 Жау көзіне түскен әркім найзамен шаншылады, қолға түскен әркім семсермен түйреліп өлтіріледі."},
	{16, "16 Жау олардың балаларын көз алдарында ұрып өлтіріп, үйлерін тонап, әйелдерінің абыройын төгіп масқаралайды."},
	{17, "17 Біліп қойыңдар, Мен мидиялықтарды оларға қарсы шабуылға шығарамын. Олар күмісті қадірлемейді, алтынға да құмартпайды."},
	{18, "18 Мидиялықтар садақтарымен жас жігіттерді жайпап салып, құрсақтағы сәбилерге де қайырымсыздық танытып, балаларды да аямайды."},
	{19, "19 Бабыл қаласы — патшалықтардың сән-салтанаты, халдей халқының асқақ мақтанышы. Алайда Мен, Құдай, Содом мен Ғомороға істегенімдей, Бабылдың да астан-кестенін шығарамын."},
	{20, "20 Бабылдың жерін енді қайтып ешкім мекендемейді, адамдар ешқашан сонда тұрмайтын болады. Не көшпелі арабтар да шатырын тікпейді, не өзге шопандар да отарларын жаймайды."},
	{21, "21 Құла түздің жабайы аңдары оның үйінділерінде тынығып жатып, қираған үйлері үкінің ұяларына толады. Бұл жерде түйеқұстар да тұрып, сабалақ жүнді ешкілер секіріп жүреді."},
	{22, "22 Қираған қорғандары және сәулетті сарайларының қалдықтары қорқау қасқыр мен шибөрінің ұлыған даусымен жаңғырады. Иә, Бабылдың құритын уақыты таяп қалды, оның күні өтті!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct kk14 poems[] = {
	{1, "1 Жаратқан Ие Жақыптың үрім-бұтағына аяушылық танытып, Исраил халқын тағы да Өзінікі қылып таңдап алып, оларды өз елінде қайтадан орналастырады. Жат жұрттықтар да мұнда келіп, Жақыптың үрім-бұтағына қосылмақ."},
	{2, "2 Басқа ұлттар Исраил халқын өз еліне қайтып әкеледі, әрі оларға Жаратқан Иенің таңдаған жерінде ұдайы қызмет ететін болады. Сонда халық бұрын өзін тұтқын етіп, езіп-жаншығандарды тұтқындап, үстерінен билік құрмақ."},
	{3, "3 Сол күні Жаратқан Ие сені азап пен қорқыныштан, құлдықтың ауыр жүгінен азат ететін болады."},
	{4, "4 Бұл орындалғанда сен Бабыл патшасын мазақ еткен өлең айтып былай дейсің: Жауыз қанаушы қалайша тоқтатылды! Асқақтап тонауы оның доғартылды!"},
	{5, "5 Сұмның асатаяғын Жаратқан сындырды, Зұлым билеушіден үстемдігін тартып алды."},
	{6, "6 Сол патша ұлттарды ашулана ұрғылады, Халықтарды тоқтатпай жаншып қудалады."},
	{7, "7 Енді бүкіл жер тыншып аман болады, Барлығы шаттана ән-жырлар салады."},
	{8, "8 Шыршалар да қуанышқа кенеледі, Ливанның самырсындары да былай дейді: Уа, патша, сен тақтан құлағандықтан енді Бізді шауып құлатуға ешкім келмейді."},
	{9, "9 Ей, патша, о дүние сенің келуіңді күтіп қозғалуда. Саған бола ол өлгендердің аруақтарын, жер бетінде мықты болған билеушілердің бәрін де орындарынан тұрғызады. Күллі халықтардың патшалары (сені құрметтегенсіп) тақтарынан көтерілуде."},
	{10, "10 Олардың бәрі саған тіл қатып былай дейді: Енді сен де біз сияқты әлсізсің! Сен де бізге ұқсас болдың!"},
	{11, "11 Бүкіл сән-салтанатың да, сарайыңдағы күй-сазың да өзіңмен бірге қабірге қойылды. Сенің астыңа шыбын құрттары төселіп, жамылып жатқан жамылғың жауын құрттары болды."},
	{12, "12 Ей, Шолпан жұлдыз әрі таң шапағы (іспетті болған Бабыл патшасы)! Аспаннан сен қалай құлап түстің! Халықтарды таптап келген сен өзің қалайша жерге лақтырылдың!"},
	{13, "13 Өйткені іштей былай дегенсің: Мен аспанға көтерілемін, өз тағымды Құдайдың жұлдыздарынан да жоғары орнатамын! Қиыр солтүстікте орналасқан, (жалған тәңірлер) жиналатын таудың басындағы тағыма жайғасамын."},
	{14, "14 Биік бұлттардан да жоғары көтеріліп шығамын, өзімді Хақ Тағаламен бірдей қыламын!"},
	{15, "15 Қайта, сен о дүниеге, тұңғиықтың түбіне лақтырыласың!"},
	{16, "16 О дүниедегілер саған қадала қарап, сен жайлы былай деп ойлайтын болады: Жерді сілкінтіп, патшалықтарды шайқалтқан адам осы ма?"},
	{17, "17 Әлемді құла түзге айналдырған бұл ма? Қалаларды қиратып, тұтқынға алғандарын үйлеріне қайтармаған қатыгез патша осы ма?"},
	{18, "18 Халықтардың барлық патшалары құрметтеп қойылған өз қабірлерінде жатыр."},
	{19, "19 Ал сен қажетсіз бұтақшадай қабіріңнен алыс жерге лақтырылып тасталдың. Мәйітің бір шұңқырда семсердің жүзінен қаза тапқандардың сүйектерімен жабылып, тастардың астында қалады. Иә, сүйегің өлексе іспетті тапталып,"},
	{20, "20 патшалар қабіріне қойылмады. Өйткені сен өз еліңді талқандап, өз халқыңды құрттың. Зұлымдардың тұқымы ешқашан еске алынбасын!"},
	{21, "21 Осы патшаның ұлдары да ата-бабаларының жасаған күнәларына бола құртылмақ, соған арналған орынды дайындап қойыңдар! Олар бас көтеріп, жерді иемденіп, дүние жүзін өз қалаларымен толтыра алмасын!"},
	{22, "22 Мен оларға қарсы шықпақпын! — дейді Әлемнің Иесі. — Мен Бабылды атымен жоқ қылып, оның халқын түп-тамырымен құртып, ешбір ұрпағын тірі қалдырмаймын. Осыны айтқан Мен Жаратқан Иемін."},
	{23, "23 Мен қаланы жабайы аңдар мекендейтін ми батпаққа айналдырып, ондағы барлық нәрсені де сыпырып тастаймын. — Әлемнің Иесі осыларды нық айтады."},
	{24, "24 Әлемнің Иесі былай деп ант еткен: Менің ой-ниетім шүбәсіз іске асады! Мен қалай жоспарлаған болсам, ол дәл солай орындалады!"},
	{25, "25 Мен ассурлықтарды өз елім Исраилде талқандап, оларды өз тауларымда басып тастаймын. Осылай халқымның мойнынан Ассурдың мойынтұрығы алынып, олар көтерген ауыр жүктерінен арылады."},
	{26, "26 Бұл — бүкіл әлемге арнаған шешімім! Мынау — барлық халықтардың үстінен созылған құдіретті қолым! —"},
	{27, "27 Өйткені Әлемнің Иесі осыны ұйғарды. Мұнысын орындатқызбайтын кім бар?! Жаратқан Ие құдіретті қолын алға созып тұр. Онысын тоқтата алатын кім бар?!"},
	{28, "28 Ахаз патша қайтыс болған жылы мына ауыр хабар (пайғамбарға Жаратқан Иеден) жетті:"},
	{29, "29 Уа, бүкіл філістір елі, сені ұратын таяқ сынғанмен, шаттануыңа себеп жоқ. Бір жылан өлген кезде оның орнына улы сұр жылан келеді. Улы сұр жыланның жұмыртқасынан атылып, шағып алатын оқ жылан шығады."},
	{30, "30 Сол кезде (Менің халқымның ішіндегі) ең кедейлер тамақтанып, мұқтаждар қауіп-қатерсіз тынығып жатады. Алайда, уа, філістір халқы, Мен сендерді ашаршылық арқылы түп-тамырларыңмен жұлып тастаймын. Тіпті аман қалғандарыңның өздерін де қырып жоямын."},
	{31, "31 Қала қақпаларының маңында еңіреңдер! Қаланың ішінде зар жылаңдар! Уа, філістірлер, қорқыныштарыңнан су жүрек боласыңдар. Солтүстік жақтан шаң-топырақтың құйын бұлты іспетті жау аттанып келе жатыр! Осы айбынды әскердің қатарларында бірде-бір қорқақ жоқ."},
	{32, "32 Сол халықтан келетін хабаршыларға біз не деп жауап қатамыз? Оларға: Жаратқан Ие Сионды берік негізге орнатқан. Оның халқының азап шеккендері осы қаладан баспана табады! — деп айтамыз."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct kk15 poems[] = {
	{1, "1 Бұл — Моаб елі туралы ауыр хабар: Ойбай, Моабтағы Ар қаласы еш шүбәсіз бір-ақ түнде қиратылып талқандалмақ! Моабтағы Кир қаласы да бір-ақ түнде жойылып күл-талқан болмақ!"},
	{2, "2 Халық жалған тәңірдің ғибадатханасына көтеріледі. Олар Дибонның биіктеу жерлеріндегі табыну орындарында жылау үшін өрлеп шығады. Моаб халқы Небо мен Медеба қалаларын жоқтап жылайды. Барлығы да қайғырып шаштарын, сақал-мұрттарын алып тастайды."},
	{3, "3 Олар көшеде азалы киім киіп жүріп, алаңдар мен үйлердің жалпақ төбелерінде де жоқтау айтып жылайды."},
	{4, "4 Хешебон мен Елғаленің халқы зар еңіреп, олардың даусы Яхасқа дейін естіліп тұрады. Сондықтан Моабтың жасақшылары да айқайлап, дірілдеп қорқады."},
	{5, "5 Мен шын жүректен Моаб үшін жылаймын. Оның босқындары Сиғор мен Үшінші-Әглат қалаларына дейін қашып кетпек. Олар Лухитке апаратын асуға еңірей көтеріліп, Хоронаимға қашып барып, шеккен азаптарына қатты қайғыра жылай береді."},
	{6, "6 Өйткені Нымрим сайының суы тартылып қалып, жағасындағы шөптер күйіп кетті. Көк шөп пен өсімдік атаулыдан ештеңе қалмады."},
	{7, "7 Өздерінің жиып-теріп, сақтап қойған мол байлықтарын халық Теректер жылғасының ар жағына тасып әкетеді."},
	{8, "8 Иә, Моаб елінің қай жерінен де зар еңіреген дауыс естіледі. Айтылған жоқтау Әглаим мен Бегер-Елім қалаларынан да естілмек."},
	{9, "9 Дибондағы өзеннің суы төгілген қаннан қып-қызыл болып ағады. Алайда Мен мұндағы халықтың басына бұдан да көбірек ауыртпалық түсіремін: арыстан Моабтан қашып кетіп бара жатқандарға да, елде қалғандарға да бас салатын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct kk16 poems[] = {
	{1, "1 Уа, Моаб халқы, елдің әміршісіне арнап алым-салық ретінде қошқарлар жіберіңдер! Оларды Села қаласынан иен дала арқылы Сион тауына апарыңдар!"},
	{2, "2 Моабтық қыз-келіншектер Арнон өзенінің жағалауында тентіреп, ұясынан лақтырып тасталған құстардай абыржып, әрлі-берлі жүре береді."},
	{3, "3 Олар Яһуда халқына жалынып былай дейді: Бізге не істейтінімізді айтыңдаршы! Қашып жүрген біздерді тал түсте саясын түсірген ағаштай қорғап, жасыра көріңдер! Қуған жауға бізді ұстап бермеңдерші!"},
	{4, "4 Моабтық босқындарды елдеріңде қалдырыңдаршы. Бізді жойғылары келгендерден жасырып қорғаңдаршы! Зорлық-зомбылық жасап, елді ойран қылғандар тоқтатылып, жойылған кезде"},
	{5, "5 Құдай Дәуіттің әулетінен шыққан біреуді таққа отырғызады. Ол халыққа адалдықпен және берік мейіріммен билік жүргізіп, шындыққа сай үкім шығарып, әділетті тез орнататын болады."},
	{6, "6 Біз Моабтың ерен тәкаппарлығы мен өркөкіректігі, оның менмендігі мен кердеңдігі туралы естігенбіз, алайда олар босқа мақтанады."},
	{7, "7 Сондықтан Моаб халқы зар жылайды, олардың бәрі де еңіреп жылайды. Кир-Хәрешеттен әкелінетін мейіздердің енді болмайтыны туралы қатты қайғырып еңкілдейсіңдер. Халық торығып, үміттерін үзеді."},
	{8, "8 Хешебон маңындағы егіндіктер мен Сибмадағы жүзімдіктер кеуіп қалды. Халықтардың билеушілері ондағы таңдаулы жүзім бұталарын быт-шыт қылды. Бұрын олардың бау-бақшалары солтүстікте Жазерге дейін жетіп, шығыста шөлге қарай, батыста Өлі теңіздің арғы жағалауына қарай жайылып, жайқалып тұратын еді."},
	{9, "9 Сондықтан Сибманың жүзім бұталары үшін Жазер халқы іспетті мен де қатты қайғырамын. Уа, Хешебон мен Елғала, сендерді де жоқтап, көз жасымды көл қыламын. Өйткені енді қайтып мұнда халықтың құрма, інжір жемістері мен егіннің өнімдерін қуана жинайтын маусымдары болмайды."},
	{10, "10 Құнарлы бау-бақшаларда шат-шадымандық ғайып болады. Жүзімдіктерде көңілді әндер шырқалмайды. Сыққыш шұңқырларда ешкім де қуана айқай сала жүзімді таптап шырынын ағызбайды."},
	{11, "11 Сол себепті жан дүнием Моаб елі үшін әрі жүрегім ондағы Кир-Хәрес қаласы үшін қайғылы әуен тартқан жетігендей зарлайды."},
	{12, "12 Моаб халқы дұға ету үшін өздерінің биіктеу жерлеріндегі табыну орындарына барып, жалған тәңірлердің ғибадатханаларында қатты тырысып құлшылық етеді, бірақ оларынан ештеңе шықпайды."},
	{13, "13 Жаратқан Иенің бұдан ертерек Моаб туралы берген хабары осы."},
	{14, "14 Бірақ қазір Жаратқан Ие мынаны айтады: Дәл үш жылда Моабтың ұлылығынан түк қалмайды. Оның құжынаған халқынан тірі қалғандар өте аз әрі дәрменсіз болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct kk17 poems[] = {
	{1, "1 Бұл — Дамаск жайлы ауыр хабар: Біліп қойыңдар, енді қайтып Дамаск қала болмайды, ол қиратылып, тау-төбе үйіндіге айналады."},
	{2, "2 Арогер аймағының қалалары қаңырап бос қалады. Енді олар малдың жайылымына айналып, ешкім де олардан малды қуып аластатпайды."},
	{3, "3 Солтүстік Исраил қамалды қалаларынан айырылып, Дамаск өзінің тәуелсіз патшалық болуынан ада қалады. Тірі қалған арамалықтар Исраил халқы сияқты ұлылығын жоғалтады. — Әлемнің Иесі, осыны нық айтады."},
	{4, "4 Сол кезде Жақыптың нұрлы салтанаты күңгірттеніп, оның мықты денесі жүдейді."},
	{5, "5 Сонда Исраил елі орақшылар егінді жинап алғаннан кейінгі егістікке ұқсайды. Ол ештеңесін қалдырмай жиып-терген Рефаим аңғарындағы қаңыраған бос егіндік іспетті болады."},
	{6, "6 Тек біразырақ адам ғана аман қалады. Бұл, жемісі жинап алынған зәйтүн ағашындай болмақ: ең биік ұшар басында тек екі-үш, ең төменгі өнімді бұтақтарында төрт-бес-ақ жемісі қалмақ. — Исраилдің Құдайы Жаратқан Ие осыны нық айтады."},
	{7, "7 Сол уақыт жеткенде адамдар өздерін жаратқан Жасаған Иеге бет бұрып, Исраилдің Киелі Құдайына сеніммен қарап мойынсұнады."},
	{8, "8 Олар енді қайтып өздері жасаған құрбандық үстелдеріне бет бұрмайды, әрі өз қолдарынан шыққан Ашера бағаналары мен хош иісті заттар түтететін үстелдерге сеніммен қарамайтын болады."},
	{9, "9 Сол заман келгенде олардың бекіністі қалалары да иесіз ну орманға ұқсап, қанахандықтардың Исраил халқынан қашқан кезде тастап кеткен қырат бастарындағы қалалары сияқты елсіз бос болады."},
	{10, "10 Неге десең, сен өзіңді құтқарған Құдайыңды менсінбей, өзіңді қорғайтын Жартасыңды ұмыттың! Мейлі, таңдаулы деген өсімдіктерді егіп, шетелден әкелінген жүзім бұталарын отырғыза бер!"},
	{11, "11 Олар сен еккен күні тармақ жайса да, сен отырғызған күні гүлденсе де, бәрібір олардан өнім жинамайсың: соның орнында тек қайғы-қасірет пен жазылмас ауру ғана болады."},
	{12, "12 Қап, әттеген-ай! Көптеген халықтардың әскерлері долданған теңіздің гүріліндей шулайды! Әттеген-ай, ұлттардың дабыры қандай! Олар ағысты судың гүріліндей шулайды,"},
	{13, "13 әрі жағаны соғып зулаған толқындардай алға жылжиды. Бірақ Құдай оларға бұйрық бергенде, қашып кетеді де, тау жаққа жел ұшырған кебектей, құйын көтерген тозаңдай кері шегінеді."},
	{14, "14 Кешке қарай қорқыныш тудырғанмен, олар ертеңгісін жоқ болады. Біздің елді тонап, мал-мүлкімізді талап әкеткен әрбір жаудың тағдыры, міне, осындай болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct kk18 poems[] = {
	{1, "1 Қап, әттеген-ай, Нілге құятын салалардың ар жағында орналасқан, қанаттылар сусылдап ұшатын Құш елі қасіретке қалады!"},
	{2, "2 Сол ел қамыстан жасалған қайықпен Ніл өзенімен елшілерін жібереді. Уа, жүрдек хабаршылар! Өзендермен бөлінген өз елдеріңе қайтыңдар! Әр жерде қорқыныш туғызатын мықты да зорлықшыл өз халқыңа мына хабарды жеткізіңдер:"},
	{3, "3 Ей, жер бетінде тұратын барлық адамдар, ден қойыңдар! Тау бастарында ту көтерілгенде соны көріп, керней тартылғанда соны еститін боласыңдар!"},
	{4, "4 Себебі Жаратқан Ие маған мынаны айтты: Мен Өзім тұратын көктен тыныштықпен төменге көз саламын. Осы тыныштық күн күйіп тұрған кездегі жым-жырт ыстыққа әрі өнім жинайтын кездегі аптапта жоғары қарай ақырын көтерілген буға ұқсайды."},
	{5, "5 Жүзімші өнімді жинамас бұрын, бүршік гүлдеп болып, жүзім піскен кезде, пышағымен артық өскіндерді кесіп түсіреді. Сол сияқты, Жаратқан Ие Құштың жасағын шауып тастайды."},
	{6, "6 Оның өлген жасақшыларының денелері таудағы жыртқыш құстар мен даладағы аңдарға қалады. Олармен жазда құстар, қыста аңдар қоректенеді."},
	{7, "7 Сол кезде ұзын бойлы, сақал-мұртсыз, әр жерде қорқыныш туғызатын мықты да зорлықшыл халықтан Әлемнің Иесіне арналған сый-тарту келеді. Олар соны өзендермен бөлінген өз елдерінен Әлемнің Иесінің есімі құрметтелетін орынға, Сион тауына, әкеледі."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct kk19 poems[] = {
	{1, "1 Бұл — Мысыр туралы ауыр хабар: Біліп қойыңдар, Жаратқан Ие ұшқыр бұлтқа мініп алып, Мысырға аттанбақ. Мысырдың жалған тәңірлері Оның алдында дірілдеп, мысырлықтар да сужүректеніп қорқады."},
	{2, "2 (Жаратқан Ие мынаны айтады:) Мен мысырлықтарды өзара қарсыластырып қоямын. Бірге туған бауырлар да, көршілер де бір-бірімен тартысып, қалалар да, патшалықтар да өзара соғысатын болады."},
	{3, "3 Сонда мысырлықтар жүрексініп, түңіліп, Мен олардың жоспарларын шатастырамын. Олар өздері табынған жалған тәңірлері мен аруақтарынан, жынын шақырған бақсылар мен сәуегейлерден ақыл-кеңес сұрайтын болады."},
	{4, "4 Мен мысырлықтарды қатыгез қожайынның қолына табыстаймын, сол қайырымсыз патша оларға үстемдік жүргізетін болады. — Әлемнің Әміршісі Жаратқан Ие осыны нық айтады."},
	{5, "5 Ніл өзеніндегі судың деңгейі төмендеп, оның арнасы кеуіп, құрғап қалады."},
	{6, "6 Өзен салалары мен арықтар сонда саси бастап, қалаларды қоршаған орлардың суы да жоқ болады. Қамыс пен қоға кеуіп, семіп қалады."},
	{7, "7 Нілдің жағалауындағы басқа да өсімдіктер, өзеннің жағасындағы егістіктердегі егіннің бәрі де қурап, желмен ұшып, ғайып болады."},
	{8, "8 Нілден балық аулап күн көріп жүрген әрбір адам күрсініп жыламақ. Олардың қармақтары мен ауларынан енді еш пайда болмайды."},
	{9, "9 Зығырдан мата тоқып, бәтес жасап шығарушылар да үміттерін үзеді."},
	{10, "10 Тігіншілер мен жалдамалы жұмысшылардың сағы сынып, тұнжырайды."},
	{11, "11 Елдің астанасы Соғанның басшылары зердесіздер! Мысырдың ең кемеңгерлері ақымақ кеңес береді. Қалай ғана олардың дәттері барып патшаға: Мен ежелгі кемеңгерлер мен патшалардың ұрпағымын деп мақтана алады?"},
	{12, "12 Уа, Мысыр патшасы, сенің сол бір ақылды кеңесшілерің қайда? Олар Әлемнің Иесінің Мысырға не жоспарлап отырғанын біліп алып, саған айтып берсін!"},
	{13, "13 Соғанның басшылары ақымақ болып, Мемфистің басшылары да алданып қалды! Мысырдың руларының басты адамдары халықты адастырып, басын айналдырды."},
	{14, "14 Жаратқан Ие араларына оларды шатастыратын рух төкті. Соның нәтижесінде Мысыр барлық нәрсені қате жасап, өз құсығына тайып теңселген мас адамдай болады."},
	{15, "15 Мысырдағы әркім де, не бастық, не жарлы болсын, не атақты, не қарапайым болсын, қай-қайсысы да шарасыз болмақ."},
	{16, "16 Сол кезде Мысыр елі Әлемнің Иесінің өздеріне қарсы созылған қолынан әйел заты іспетті қорқып дірілдейтін болады."},
	{17, "17 Яһуда елінен Мысырдың зәрелері ұшпақ. Яһуданың аты аталғанда мысырлықтар қалтырап, жандары түршігетін болады. Себебі Әлемнің Иесі Өзінің мысырлықтарға қатысты жоспарын дайындап қойды."},
	{18, "18 Осы уақыт жеткенде Мысырдың бес қаласы Қанахан тілінде сөйлеп, Әлемнің Иесіне адал болуға ант бермек. Қалалардың біреуі Күнқала деп аталмақ."},
	{19, "19 Сол заманда Мысыр елінің ортасында Жаратқан Иеге бағышталған құрбандық үстелі болады. Мысырдың шекарасында Оған арналған ескерткіш те орнатылмақ."},
	{20, "20 Бұл, Әлемнің Иесінің Мысырда екендігін дәлелдейтін айғақ болады. Себебі олар өздеріне жәбір көрсеткендерге қарсы қолдау сұрап Жаратқан Иеге дауыстап жалбарынғанда, Ол соларды аман алып қалуға бір мықты Құтқарушыны жібереді."},
	{21, "21 Осылайша Жаратқан Ие Өзін мысырлықтарға таныстырмақ. Сол кезде олар Жаратқан Иені жақыннан біліп, Оған мойынсұнатын болады. Олар Жаратқан Иеге арнап құрбандықтар шалып, басқа сый-тартулар да ұсынбақ. Оған уәде берсе, соларын сөзсіз орындайды."},
	{22, "22 Жаратқан Ие Мысыр халқына (күнәларына бола) індет жіберіп жазасын тартқызады, бірақ кейін оларды Өзі сауықтырады да. Олар Жаратқан Иеге бет бұрып, сиынады. Ол мінажаттарына құлақ түріп, оларды айықтырады."},
	{23, "23 Осы уақыт жеткенде Мысыр мен Ассур елдерінің арасында даңғыл жол болады. Осы екі елдің халқы бір-біріне барып келеді әрі бірігіп Құдайға ғибадат ететін болады."},
	{24, "24 Сол заманда Исраил Мысырмен және Ассурмен қатарлас тұрған үшіншісі болып, осы халық арқылы Жаратқан Иенің жарылқауы жер бетіне жететін болады."},
	{25, "25 Әлемнің Иесі оларға батасын беріп: Мен өз халқым Мысырды өз қолымнан шыққан Ассурды және меншікті халқым Исраилді де жарылқай беремін! — дейді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct kk20 poems[] = {
	{1, "1 Ассур патшасы Саргон өзінің бас қолбасшысын філістірлердің Азот қаласына қарсы аттандырды. Қолбасшы шабуыл жасап, қаланы басып алды. Сол жылы"},
	{2, "2 Жаратқан Ие Амос ұлы Ишаяға тіл қатып былай деді: Азалы киіміңді және аяқкиіміңді шешіп таста! — Ишая солай істеп, сырт киімсіз жалаң аяқ жүрді."},
	{3, "3 Кейін Жаратқан Ие осы тапсырмасын былай деп түсіндірді: Менің қызметшім Ишая үш жыл бойы сырт киімсіз, жалаң аяқ жүрді. Бұл — Мысыр мен Құш елдерінің басына түсетін азапты жайды алдын ала білдірген белгі."},
	{4, "4 Ассур патшасы сол кезде Мысыр мен Құштан тұтқындағандарын осылайша айдап әкетеді. Жасы бар, кәрісі бар, олар сырт киімсіз, жалаң аяқ, арттары ашылған күйі жер аударылады. Содан Мысыр әбден масқараланады."},
	{5, "5 Құшқа сенім артып, Мысырды мақтан тұтқандар үрейленіп, ұятқа қалады."},
	{6, "6 Осы уақыт жеткенде теңіз жағалауын мекендегендер былай дейтін болады: Бізді Ассур патшасынан қорғайды деп сенген Мысыр мен Құш елдеріне не болғанын қараңдар! Онда біз қалайша аман қаламыз?!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct kk21 poems[] = {
	{1, "1 Бұл — теңізге жақын құла түз туралы ауыр хабар: Оңтүстіктің иен даласындағы құйындар соққандай, сол қорқынышты шөл жақтан апат келеді."},
	{2, "2 Маған кәрлі көрініс көрсетілді: сатқын сатқындығын, құртушы құртуын жалғастыра береді. Ей, Елам жасағы, шабуылға шық! Ей, Мидия әскері, қамап ал! Мен Бабылдың халықтарды езіп-жаншып зарлатуын түгелдей тоқтатамын! (— дейді Жаратқан Ие.)"},
	{3, "3 Осыдан тұла бойым қалтырап, қатты ауырып жатырмын. Толғақ қысқан әйелдей азапқа баттым. Көріністе көріп-естігендерім мені абыржытып, әбден түңілдірді."},
	{4, "4 Басым айналып, қорыққаннан қалшылдадым. Кештің түсуін аңсаған едім, бірақ ол маған қатты қорқыныш әкелді."},
	{5, "5 Көрпелер төселіп, дастарқан жайылып, біреулер ішіп-жеп жатыр екен. Кенеттен: Уа, қолбасшылар, тұрыңыздар! Қалқандарыңызды майлап дайындаңыздар! — деген дауыс шығады."},
	{6, "6 Осы екі арада Жасаған Ие маған тіл қатып мынаны айтты: Бар да, күзетші қой, көргендерін айтып тұрсын."},
	{7, "7 Егер де ол қос-қостан келе жатқан салт аттыларды және есекке, түйеге мінгендерді көрсе, соларға мұқият ден қойсын!"},
	{8, "8 Күзетші кейін былай деп айқайлады: Мырзам, мен күндіз мұнарада тұрып, әрбір түні де сол орнымда қалып келемін!"},
	{9, "9 Міне, салт аттылар қос-қостан келе жатыр! Келіп жеткен шабарман мына жаңалықты хабарлады: Бабыл құлады! Оның халқы табынған жалған тәңірлердің барлық мүсіндері де жерге құлатылып, күл-талқан болды!"},
	{10, "10 Уа, сорлы халқым, қырмандағы астықтай тапталып басылдыңдар. Ал мен Исраил сиынған Құдайдан, яғни Әлемнің Иесінен, естігендерімді сендерге айтып бердім."},
	{11, "11 Бұл — жым-жырт ел туралы ауыр хабар: Біреу маған Сейірден айқайлап: Ей, күзетші, түннің қай кезі болды? Күзетші, түн қашан бітеді? — деп сұрайды."},
	{12, "12 Күзетші былай деп жауап береді: Қазір таң атады, кейін жер түн жамылады. Егер тағы да сұрағыларың келсе, қайтып келіп, сұрай беріңдер."},
	{13, "13 Бұл — Арабия туралы ауыр хабар: Ей, дедандық керуендер, Арабияның ну тоғайларында жасырынып түнеңдер!"},
	{14, "14 Уа, Тема шұратының халқы, шөлдеп келгендерге су ішкізіңдер, бұл босқындарға тамақ әперіңдер!"},
	{15, "15 Олар жаудың семсерінен, атуға дайын тұрған садақтарынан, сұрапыл шайқастан құтылу үшін қашып келеді."},
	{16, "16 Сонда Жасаған Ие маған былай деді: Дәл бір жылдан кейін Қидар халқының сән-салтанаты ғайып болады."},
	{17, "17 Сонда Қидардың мықты да батыл садақшыларынан тірі қалғандары аз болады. — Исраилдің Құдайы Жаратқан Ие осыны кесіп айтты."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct kk22 poems[] = {
	{1, "1 Бұл — Аян аңғары туралы ауыр хабар: Не болып жатыр? Неліктен барлығың да үйлердің жалпақ төбелеріне шығып алғансыңдар?"},
	{2, "2 Уа, бұрын толқыған, у-шу мен той-думанға толған қала! Сенің тұрғындарың өлді, бірақ семсерден емес, ашаршылық пен індеттен!"},
	{3, "3 Күллі басшыларың бірге қашып кетіп, бір жебе де атпастан тұтқынға түсті. Сенен табылған адамдарыңның бәрі бірдей ұсталды. Олар алысқа қашып кетпекші болған еді."},
	{4, "4 Сондықтан былай деймін: Маған қарамаңдар, мен зар жылап жатырмын, қырылған халқымды жоқтаудамын. Мені жұбатуға тырыспаңдар!"},
	{5, "5 Өйткені Аян аңғарындағы осы бір үрей мен жеңіліс әрі мидай шатасқан уақыт Әлемнің Әміршісі Жаратқан Иенің Өзінен келді! Қаламыздың қабырғалары құлап, айқайлағандардың даусы төбелерді жаңғыртуда."},
	{6, "6 Еламның жасақшылары садақ пен жебе асынып, күймелерге мініп келді, Кир елінің адамдары қалқандарын дайындады."},
	{7, "7 Сонда ең құнарлы деген аңғарларың күймелерге толды. Салт атты жасақшылар Иерусалим қақпасына қарсы сапта тұр."},
	{8, "8 Яһуданы қорғайтын бекіністері талқан болды. Сол күні сендер Орман сарайындағы қару-жарақтарға үмітпен қарадыңдар."},
	{9, "9 Алайда Дәуіттің шаһарының қамал қабырғасында қанша жарылған жердің бар екендігін көрдіңдер. Төменгі тоғанда су сақтап қойдыңдар."},
	{10, "10 Иерусалимдегі үйлерді тексеріп шығып, солардың тастарымен қамалдың қабырғасын бекіту үшін кейбіреулерін құлаттыңдар."},
	{11, "11 Көне тоғанның суын жинау үшін қаланың екі қабырғасының арасына тоған саласыңдар. Алайда сендер Құдайға көңіл бөлмедіңдер! Оның Өзі осының бәрін бұдан көп бұрын жоспарлап, оның осылай болуына себепші болды!"},
	{12, "12 Сондықтан сол кезде Әлемнің Әміршісі Жаратқан Ие сендерді жылап жоқтау айтуға, шаштарың мен сақал-мұрттарыңды алып тастап, азалы киім киюге шақырды."},
	{13, "13 Алайда соның орнына сендер мәз-мейрам болып тойладыңдар, ірі қара мен ұсақ малдарды сойып, етін жеп, шарап ішіп отырып: Ішіп-жеп тойып алайық, ертең бәрібір өліп қалармыз! деп, еркінсіп жүрдіңдер."},
	{14, "14 Әлемнің Иесі маған оларға арналған мына хабарды естіртіп білдірді: Осы күнәларыңның арамдығы көздерің тірі болған кезде тазартылмайды! — Әлемнің Әміршісі Жаратқан Ие осыны антпен бекіткен."},
	{15, "15 Кейінірек Әлемнің Әміршісі Жаратқан Ие маған тағы мына тапсырманы берді: Бар да, сарай басқарушысы Шебнаға былай де:"},
	{16, "16 Осы қалада қандай құқығың бар, қандай тума-туыстарың бар? Төбе басындағы жартасты үңгітіп, өзіңе керемет қабір дайындауға қалай дәтің барады?"},
	{17, "17 Ей, күшті адам, Жаратқан Ие сені қатты қысып ұстап, алысқа лақтыра салады."},
	{18, "18 Ол сені жүн шумағындай қағып алып, ұлан-ғайыр елге лақтырып жібереді. Сен сол жерде өліп, өзіңнің сондай сән-салтанатты күймелерің де сонда болады. Саған бола қожайыныңның әулеті масқараланады."},
	{19, "19 Сені сарайдан шығарып, жоғарғы дәрежеңнен құлдыратамын, — деп ескертті Жаратқан Ие."},
	{20, "20 Сол күні Мен Хелкия ұлы Елиәкімді шақырып аламын."},
	{21, "21 Сенің шапаныңды оған жауып, жалпақ белбеуіңді оның беліне таңамын. Сенің барлық мәртебе-дәрежеңді оған сеніп тапсырамын. Ол Яһуда мен Иерусалим халқына әке іспетті қорғаушы болады."},
	{22, "22 Оның қолына Дәуіттің әулеті тұратын сарайдың кілтін табыстаймын. Ол ашқанды ешкім жаппайды, ол жапқанды ешкім ашпайды."},
	{23, "23 Мен оны ағашқа қаққан ілмектей мықтап бекітемін. Ол әкесінің отбасына атақ-даңқ әкеледі."},
	{24, "24 Әкесінің әулеті оның арқасында абыройлы болмақ. Әкесінің барлық үрім-бұтағы да ілмекке ілінген қыш құмыра не тостаған іспетті оған байлаулы болмақ."},
	{25, "25 Алайда Әлемнің Иесі тағы мынаны айтады: Мықтап бекітілген осы ілмек күндердің күнінде босап кетіп, құлап түседі. Оған ілінген барлық жүк те онымен бірге құлап түсетін болады. — Жаратқан Ие осыны кесіп айтты."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view23() {
struct kk23 poems[] = {
	{1, "1 Бұл — Тир туралы ауыр хабар: Зар еңіреңдер, уа, алып сауда кемелеріндегі теңізшілер! Тир қаласы талқандалып, үйлері мен айлағы ғайып болды. Кемелер Кипр аралынан жеткенде осы апат туралы біліп алды."},
	{2, "2 Үндемей қайғырыңдар, уа, теңіз аралдарының тұрғындары әрі Сидон қаласының саудагерлері! Теңізбен жүзіп келетіндер сендерді байытатын."},
	{3, "3 Олар терең сумен жүзіп, Мысырдағы Шихор алқабынан астық тасып әкелетін. Ніл өзенінің бойында жиналған өнімнен Тир қаласы пайда көріп, халықтардың сауда-саттық орталығына айналған еді."},
	{4, "4 Ал қазір, уа, Сидон қаласы, ұятқа қаласың. Себебі теңіздегі қорған (Тир) былай дейді: Мен ешқашан да толғатып, бала таппаған, ұл-қыз асырап та алмаған әйел іспетті жападан-жалғызбын!"},
	{5, "5 Мысыр халқы да Тир туралы хабарды естігенде дірілдеп қорқатын болады."},
	{6, "6 Тарсисқа барыңдар, (суық хабарды жеткізіңдер)! Уа, аралдардың тұрғындары, (Тирді жоқтап) жылаңдар!"},
	{7, "7 Іргесі ежелде қаланған, шаттыққа кенелген Тир қаласы осы ма? Оның адамдары алыс жерлерді кезіп жүріп, қоныстанатын."},
	{8, "8 Тир қаласы патшалық салтанатқа ие болатын. Оның саудагерлері әміршілер іспетті дүние жүзінде құрметтелетін. Осы қалада сондай апат болсын деп кім ұйғарды?"},
	{9, "9 Әлемнің Иесі Тирдің өз салтанатына деген мақтанышына шек қойып, осы дүниедегі барлық мәртебелілерді де жуасыту үшін осылай ұйғарды."},
	{10, "10 Уа, тарсистіктер, өзеннен өткендей өз елдеріңе қайтып барыңдар! Бұдан былай (Тирде) айлақ болмайды."},
	{11, "11 Жаратқан Ие қолын теңіз үстіне созып, патшалықтарды дірілдетіп қорқытып қойды. Ол финикиялық саудагерлердің қорғандарын талқандау туралы бұйрық беріп"},
	{12, "12 былай деді: Сидон қаласы, сен бұдан былай күліп-ойнамайсың, қайта, қорланып езгі көресің! Жиналып, теңізден өтіп Кипр аралына барсаңдар, сол жерде де тыным таппайсыңдар!"},
	{13, "13 Халдейлердің еліне көз салыңдар, оның халқы ғайып болды! Ассурлықтар сол жерді жабайы аңдар жайлайтын құла түзге айналдырды. Олар Бабылды қоршауға алғанда оған қарсы ағаштан мұнаралар салып, Бабылдың бекіністерін қиратты. Осылай қалаға басып кіріп, оның күл-талқанын шығарды."},
	{14, "14 Зар еңіреңдер, уа, алып сауда кемелеріндегі теңізшілер! Сендер арқа сүйеген бекіністі Тир қаласы талқандалды."},
	{15, "15 Сол кезде Тир жетпіс жыл бойы, яғни бір патшаның өміріндей кезеңге, ұмыт болады. Сол уақыт аяқталғанда Тир өлең-жырдағы азғын әйелдей болады:"},
	{16, "16 Қаланы аралап жүр жетігеніңмен, Ұмыт болған жезөкше іспеттісің сен, Адамдардың сені ескеруі үшін Күйің мен жырың ұнамды естілсін."},
	{17, "17 Жетпіс жыл өткеннен кейін, Жаратқан Ие Тирге назар салып, оған рақым етпек. Алайда қаланың халқы қайтадан жер бетіндегі барлық патшалықтарға қызмет көрсетіп, азғын әйелдей пайданың артынан қуатын болады."},
	{18, "18 Бірақ ақырында олардың саудамен және қызметтерімен тапқан пайдалары Жаратқан Иеге бағышталмақ. Олар бір жерге сақталып қойылмайды. Қайта, Жаратқан Иенің көз алдында әділ жүргендер сол байлықты жеткілікті азық-түлік пен таңдаулы киім-кешек сатып алу үшін пайдаланатын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view24() {
struct kk24 poems[] = {
	{1, "1 Біліп қойыңдар, Жаратқан Ие жерді ойрандап, құнарсыз қылмақ! Ол жер бетінің күл-талқанын шығарып, тұрғындарын шашыратып жібермек."},
	{2, "2 Бәрінің басына түскен жағдай бірдей болады: не қарапайым халық, не діни қызметкер болсын, не құл-күң, не қожайыны болсын, не сатып алушы, не сатушы болсын, не жалға алушы, не жалға беруші болсын, не қарыз алушы, не қарыз беруші болсын: барлық адамдардың тағдыры бірыңғай болады."},
	{3, "3 Сонда жер беті түгелдей қаңырап, тоналады. Жаратқан Ие осы сөздерді нық айтты."},
	{4, "4 Жер құрғап кеуіп, бүкіл дүние әлсіреп, солып қалады. Жердің жоғары мәртебелі адамдары да әлсіремек."},
	{5, "5 Адамдар Құдайдың заңы мен ережелерін бұзып, Оның мәңгілікке жасаған Келісіміне опасыздық жасауларымен жерді арамдады."},
	{6, "6 Сондықтан да қарғыс жерді жалмайды. Оның тұрғындары өз кінәларының жазасын тартып, отпен жойылады. Аздаған адамдар ғана тірі қалады."},
	{7, "7 Жүзім бұталары кеуіп кетіп, шырыны азаяды. Бір кезде сауық-сайранға салынып көңіл көтергендер енді қайғырып күрсінетін болады."},
	{8, "8 Даңғыра мен жетігеннің көңілді үндері мен ермекке салынғандардың у-шуы басылып қалған."},
	{9, "9 Енді олар әндетіп шарап ішіп отырмайды, сыраның дәмі де ішкендерге тым ащы көрінбек."},
	{10, "10 Қаңыраған қала талқандалған, әрбір үй бекітіліп, ешкім кіре алмайды."},
	{11, "11 Көшедегі адамдар шараптың жоқтығынан шулайды. Шаттық түңілумен алмасқан, қуаныш жер бетінен ғайып болған."},
	{12, "12 Қала қиратылып, қаңырап, қақпалары да құлап қалған."},
	{13, "13 Бүкіл жер бетіндегі халықтар, міне, осындай жағдайға ұшырайды. Бұл жайт жұрттың зәйтүн ағашын соғып шайқалтып, жемістерін жинағанына, әрі жүзім бұтасындағы жүзім шоқтарының үзіліп алынып, біразы ғана қалған кезге ұқсайды."},
	{14, "14 Ал осы жазадан аман қалғандар көңілді ән салмақ, олар батыс жақтан Жаратқан Иенің ұлылығын паш ететін болады."},
	{15, "15 Сондықтан, уа, шығыстағылар, сендер де Оны мадақтаңдар! Теңіз жағалауларын мекендеуші халықтар да, Исраилдің Құдайы Жаратқан Иенің есімін дәріптеңдер!"},
	{16, "16 Әлемнің түпкір-түпкірлерінен біз: Хақ Тағала даңқталсын! деген әндерді естиміз. Алайда мен былай деймін: Әттеген-ай, сорлы басым, мен қасіретке қаламын! Сатқын сатқындығын, опасыз опасыздығын қаталдықпен жалғастыра береді."},
	{17, "17 Уа, жер бетінің тұрғындары, сендерді күтіп тұрғандар: қорқыныш, ор әрі тұзақ!"},
	{18, "18 Қорқыныштан қашатындар орға түседі, ал ордан өрмелеп шыққандар тұзаққа түседі. Себебі аспан қақпалары айқара ашылып, жердің негізі сілкінеді!"},
	{19, "19 Жер жарылып, қақ айырылуда, жер сұрапыл сілкінуде!"},
	{20, "20 Жер мас адамдай теңселіп, дауылдағы лашық үйдей шайқалады. Жер өзінің бүлікшіл істерінің салмағынан төмен тартылады. Ол құлап, енді қайтып көтерілмейді."},
	{21, "21 Сол кезде Жаратқан Ие аспанның заңғар биігіндегі күштілердің үлкен тобына және жер бетіндегі патшаларға назарын аударып, жазаларын тартқызбақ."},
	{22, "22 Олар зындандағы тұтқындардай жиналып, бірге қамалады. Ұзақ қамалғаннан кейін олар Құдайдың назарына қайтадан ілігеді."},
	{23, "23 Әлемнің Иесі Иерусалимдегі Сион тауында патшалық құрып, Оның нұрлы салтанаты халқының ақсақалдарына көрінеді. Содан ай абыржи қызарып, күн де ұялатын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view25() {
struct kk25 poems[] = {
	{1, "1 Уа, Жаратқан Ие, менің Құдайымсың Сен! Құрметтеп Сені атыңды мақтаймын мен. Сондай керемет істерді жасадың, Өзің көп бұрын оларды жоспарладың, Шынайы адалдықпен жүзеге асырдың."},
	{2, "2 (Бас көтерген) қаланы талқандадың, Қамалының күл-талқанын шығардың. Сол бөтен жердегі дұшпандарымыздың Сарайларын қайта салынбастай жойдың."},
	{3, "3 Сондықтан мықты халықтар Сені даңқтамақ, Қатыгез ұлттардың қалалары қорықпақ."},
	{4, "4 Ал жарлылар Өзіңнен баспана табады, Апатта мұқтаждар қасыңда қорғанады, Оларға қорғаныш боласың дауылдан Әрі ыңғайлы көлеңке боп ыстықтан. Жауыздардың кәрлі лебі қабырғаны Соққылаған боран"},
	{5, "5 не шөлдің аптабы Іспетті болды. Бірақ Сен, Ием менің, Бөгде жаулардың үндерін өшіртесің Һәм мақтанған әндерін сол аяусыздардың, Қалың бұлттай салқындатқан күн аптабын."},
	{6, "6 Сион тауының басында Әлемнің Иесі барлық халықтарға арнап семіз ет пен жілік майынан, таңдаулы сусындардан мол дастарқан жайып, тамаша той дайындайды."},
	{7, "7 Осы таудың басында Ол барлық халықтардың беттерін жабатын пердені, күллі ұлттардың үстінен төніп тұрған жабынды ысырып тастайды."},
	{8, "8 Ол өлімді біржола жоқ қылады. Жаратушы Тәңір Ие барлық бет-жүздердің көз жастарын сүртіп жұбатып, өз халқының көрген масқарасын бүкіл жер бетінен алып тастайды. Жаратқан Иенің Өзі осыны нық айтқан."},
	{9, "9 Сол кезде адамдар былай дейтін болады: Біліп алыңдар, Бұл — біздің Құдайымыз, Аңсап Оны Оған сенім артамыз, Ол — жаудың қолынан Құтқарушымыз, Біздің Иеміз һәм Жаратушымыз, Оны аңсап Оған сенім артамыз. Енді бәріміз қатты қуанамыз, Бізді құтқарғанына шаттанамыз!"},
	{10, "10 Себебі Жаратқан Ие Сион тауының үстінен қолын жайып тұрып, қаланы жарылқайтын болады. Ал (қасарысып, Оған қарсы шыға берген) Моаб тыңайтқыш үшін шалшықта тапталған сабандай тапталатын болады."},
	{11, "11 Олар суда жүзбекші болған адамдай қолдарын сермейтін болады. Бірақ Жасаған Ие моабтықтарды төмен басады, әрі қолдарынан келген алдамшылығы мен әрі асқан өркөкіректігін тыйып қор қылады."},
	{12, "12 Ол Моабтың зәулім қамал қабырғаларын қиратып, солардың күл-талқанын шығарады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view26() {
struct kk26 poems[] = {
	{1, "1 Сол кезде Яһуда еліндегі халық мына жырды әндететін болады: Біздің қала мықты, Құдайдың Өзі Қабырғалар мен бекіністер іспетті Оны құтқарып, қауіпсіз етеді!"},
	{2, "2 Айқара ашыңдар қала қақпаларын! Қалаға әділ халық ене алсын, Шынымен адал халық кіре алсын!"},
	{3, "3 Әрдайым ойын Саған бағыттаған Әрі сенімін бір Өзіңе артқан Жанды сақтайсың Сен тыныш, аман."},
	{4, "4 Жаратқан Иеге сеніңдер әрқашан, Құдай жартастай берік, мәңгі қорған."},
	{5, "5 Ол өркөкіректерді төмендетеді, Солар тұрған зәулім қаланы күйретеді, Оны түгелдей жерге құлатады, Әрі оның күл-талқанын шығарады."},
	{6, "6 Бұрын езілгендер қаланы таптар, Иә, кедейлер үстінде аяқ басар."},
	{7, "7 Тегіс те түзу — жолы әділдердің, Уа, Хақ Тағала, жолды тегістейсің Ой-ниеті адал адамдар үшін."},
	{8, "8 Сенің шешімдеріңе бағынамыз, Сені күтіп Саған сенім артамыз. Уа, Тәңір, есіміңді қатты ұнатамыз, Есімізге Сені алып тұрамыз."},
	{9, "9 Жан дүнием аңсайды Сені түнде, Рухым да сағынады таң сәріде. Сен дүниеге сот жүргізген кезіңде Жердің халқы үйренеді әділдікке."},
	{10, "10 Зұлымға рақым көрсетілсе де, Бәрібір үйренбейді әділдікке, Тіпті турашыл халықтың елінде Ол әлі де әділетсіздік істеуде, Жаратқанның ұлылығын менсінбеуде."},
	{11, "11 О, Тәңір, қолың соғуға көтерілген, Бірақ зұлымдар соған қоймайды ден, Өз халқыңды қорғайтыныңды зор ынтамен Көрсетіп оларды ұялтасың Сен. Жауларыңа дайын тұрған от расында Оларды жалмайтын болады да."},
	{12, "12 Ал бізге, уа, Жаратқан, тыныштық бересің. Себебі өзіміздің қол жеткеніміздің Бәрі — нәтижесі Сенің істегендеріңнің."},
	{13, "13 О, Жаратқан Ие, өз Құдайымыз, Бізді билеп келді бөгде иелеріміз. Бірақ Сенің атыңды ғана құрметтейміз!"},
	{14, "14 Сол иелеріміз енді дүниеден өткен, Әрі аруақтары тірілмес өлімнен, Өйткені ден қойып, оларды қырдың Сен, Содан олар шықты бәрінің естерінен."},
	{15, "15 Уа, Иеміз, халқымыздың санын көбейттің, Жерімізді де Сен жан-жаққа кеңейттің. Осылайша ұлтымызды үлкейттің, Содан зор құрмет пен даңққа бөлендің."},
	{16, "16 Уа, Жаратқан Ие, Сен бізді жазалағанда, Саған сыбырлап қана мінажат еттік."},
	{17, "17 Толғақ қысқан әйелдің аурудан бүрісіп айқайлағанындай, біз де көз алдыңда қиналдық, уа, Жаратқан Ие."},
	{18, "18 Содан толғақ қысқандай бүрісіп келеміз, алайда көрген азабымыздан еш нәтиже болмады: не осы жерге құтқарылу әкелмедік, не жаңа тұрғындар дүниеге келмеді."},
	{19, "19 Сендердің өлген адамдарың қайтадан өмір сүреді, олардың тәндері өлімнен қайта тірілмек. Уа, жер астында жатқан бәрің де, өлімнен оянып, шаттана әндетіңдер! Сендер таңғы шықпен суартылған өсімдіктей өсіп-өнесіңдер. Жер өлгендерді шығарып, бұ дүниеге қайтармақ."},
	{20, "20 Уа, халқым, үйлеріңе барып, есіктеріңді бекітіп алыңдар. Жаратқан Иенің ашу-ызасы басылғанша біраз уақыт жасырына тұрыңдар."},
	{21, "21 Біліп алыңдар, Жаратқан Ие Өзінің көктегі тұрағынан шығып, жер бетін мекендеген адамдарға олардың әділетсіз істеріне бола назарын аударады. Жер бетіндегі қантөгіс атаулы әшкереленіп, жер ондағы өлтірілгендерді бұдан былай жасырмайтын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view27() {
struct kk27 poems[] = {
	{1, "1 Сол кезде Жаратқан Ие ирелеңдеп, бұралаңдаған алып жылан және теңіздегі айдаһарға ұқсаған жауларға назарын аудармақ. Оларды Өзінің қатты, үлкен әрі күшті семсерімен қырып-жоймақ."},
	{2, "2 Сол заманда ұнамды жүзімдік жайлы мына жырды айтыңдар:"},
	{3, "3 Мен, Жаратқан Ие, оны күтіп баптаймын, Әрі суарып тұрамын әрдайым, Ешкім оған зиян жасамасын лайым Деп күні-түні күзетіп қорғаймын,"},
	{4, "4 Бұдан былай оған ашуланбаймын. Ал тікенек пен ошаған өссе онда, Мен қарсы шығамын құртып-жоюға, Түгелдей өртеп жіберемін соңында."},
	{5, "5 Әйтпесе солар Мені паналасын, Менімен бітімге келіп, татулассын, Осылай Өзіммен ынтымақта болсын!"},
	{6, "6 Болашақта Жақыптың үрім-бұтағы — Исраил халқы қайта тамыр жаяды. Гүлдейді олар әлі бүршік жарады, Жемісімен жердің бетін толтырады."},
	{7, "7 Жаратқан Ие Исраилді соққан жауларын жазалағанындай, Исраилдің өзін де жазалады ма? Әлде көп исраилдікті құртқан жауларының өлтірілгеніндей, Исраилдің де көп адамы өлтірілді ме?"},
	{8, "8 Жоқ, Жаратқан Ие өз халқын тиісті мөлшерде жазалау үшін жер аударады. Ол шығыстан соққан аптап жел сияқты оларды қатты дауылмен елінен айдап шығады."},
	{9, "9 Сол арқылы Жақыптың үрім-бұтағының күнәлары құны өтеліп кешіріледі. Ал олар өздерінің күнә жасауды доғарғандарын көрсетулері керек! Халық жалған тәңірлерге құрбандық ұсынылатын орындардың тастарын әктастай ұнтақтап жоймақ. Сонымен қатар не әйел тәңір Ашераға арналған ағаш бағаналары, не жалған тәңірлерге арналған түтету үстелдері қалмауға тиіс!"},
	{10, "10 Сонда қамалды қалалар қаңыраған бос иен даладай елсіз қалады. Сол жерде жас бұқалар жайылып әрі тынығып, бұтақшаларды жеп қалдырмайды."},
	{11, "11 Ағаштың бұтақшалары солып кеуіп қалғанда, әйелдер келіп, оларды отынға жинап, жағып жібереді. Исраил халқымен де сол сияқты болмақ. Олар еш нәрсені түсінбегендіктен, өздерін жаратқан Құдай оларға рақым бермейді де, аяушылық көрсетпейді де."},
	{12, "12 Сол заманда Жаратқан Ие ұлы Евфрат өзенінен бастап Мысырдың шетіндегі өзенге дейін жайылған жерді шайқалтып, сендерді, Исраил халқын, бір-бірлеп жинап алмақ."},
	{13, "13 Сол уақыт келгенде Ассур мен Мысырға айдалып, құрып кете жаздаған исраилдіктерді кері шақыру үшін үлкен керней тартылады. Сонда олар қайтып келіп, Иерусалимдегі қасиетті Сион тауында Жаратқан Иенің алдында иіліп ғибадат ететін болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view28() {
struct kk28 poems[] = {
	{1, "1 Солтүстік Исраилдің сондай әсем де сәулетті астанасы қасіретке қалады! Елдің маскүнем басшылары қаланы өте әдемі гүл шірі не тәждей мақтан тұтады. Сол қала құнарлы алқаптың бас жағында орналасқан. Шарапқа салынып кеткен адамдары қаланы дәріптейді. Бірақ оның әсемдігі гүлдей солып қалмақшы."},
	{2, "2 Біліп қойыңдар, Тәңір Иенің Өзі тағайындаған аса күшті де қуатты біреу бар. Сол бұршақты дауылдай, құртушы құйындай әрі зулаған ғаламат тасқындай келіп, Самария қаласын жерге құлатады."},
	{3, "3 Осылай Солтүстік Исраилдегі маскүнемдердің мақтаған сәулетті астанасы аяқ астында тапталады."},
	{4, "4 Қала құнарлы алқаптың үстінен қарайтын қырат басында орналасқан. Ал сол кезде оның салтанатты көркі гүлдей солып қалады. Өтіп бара жатқан біреу ерте піскен інжір жемісін көріп қалса, соны жұлып алып, жеп қояды. Сол сияқты Самария да тез жойылып, жоқ болып кетеді."},
	{5, "5 Сол кезде Әлемнің Иесі Исраилдің салтанатты тәжі іспетті болады. Ол халқының тірі қалғандары үшін гүлдерден жасалған көрікті шірдей тамаша болмақ."},
	{6, "6 Жаратқан Ие сот жүргізетін төрешіге әділдіктің рухын дарытады, әрі қала қақпасын шабуылдан қорғайтын күзетшілерге батылдық сыйлайды."},
	{7, "7 Бірақ елдің қазіргі басшылары шарап, сыра ішіп алғандықтан теңселеді. Пайғамбар мен діни қызметкер сыра ішіп, жолдарынан тайып кетеді. Олар шарапқа салынып, естерінен адасқан. Сондықтан (пайғамбарлар) аян көргенде шайқалады, әрі (діни қызметкерлер) алдарына әкелінген істерді әділ шеше алмайды."},
	{8, "8 Олар айналдыра жайғасқан дастарқандар құсыққа былғанған, ешқандай таза жері жоқ."},
	{9, "9 Алайда олар мен туралы былай дейді: Ана кісі кімдерге үйретпек? Кімдерге хабарларын жеткізбек? Ол бізді жаңа ғана емшектен шыққан сәбилер деп ойлай ма? — Олар: —"},
	{10, "10 Ол бізге бір өсиеттен кейін тағы бір өсиетті, бір ережеден кейін тағы бір ережені жол-жолмен, біртіндеп-біртіндеп айта береді, — деп те мазақтайды."},
	{11, "11 Ал енді, Құдай осы халыққа арнап бөтен тілдерде сөйлеп, жат жерліктердің тілдерімен үн қатпақ."},
	{12, "12 Ол осы халыққа былай деген: Бұл — тыныш жер, шаршағандардың тынығып демалатын мекені. Осында тыныштықта боласыңдар. Бірақ бұлай да олар Мені тыңдаудан бас тартты!"},
	{13, "13 Сондықтан Жаратқан Иенің оларға арнаған сөзі бір өсиеттен кейін тағы бір өсиет, бір ережеден кейін тағы бір ереже болып жол-жолмен, біртіндеп-біртіндеп айтылғаны іспетті болады. Сонда олар жүргенде сүрініп, шалқалақтап құлап, жарақаттанады, әрі торға түсіп, тұтқындалады."},
	{14, "14 Ей, Иерусалимде осы халықты билеп тұрған мазақшыл адамдар, Жаратқан Иенің айтқан сөздерін тыңдаңдар!"},
	{15, "15 Сендер: Ажалмен келісімшарт жасастық, о дүниемен келісімге қол жеткіздік, — деп мақтанасыңдар. — Ғаламат апат келген кезде бізге жоламай өтіп кетеді. Өйткені біз өтірікті паналап, алдамшылықпен жасырынамыз."},
	{16, "16 Сондықтан Жаратушы Тәңір Иенің айтқаны мынау: Міне, Мен аса құнды Тасты таңдап алдым, Оны Сиондағы үйімнің бұрышының Іргетасы ретінде орнатып қоямын. Енді Оған сенімін артқан ешкім Ұятқа қалмайтын болады лайым."},
	{17, "17 Мен сендерге қолданамын әділдікті Құрылыстың өлшеуіш жібі секілді, Адалдықты таразының кіртасы іспетті. Сонда бұршақ дауылы сендер паналаған өтірікті жойып, су тасқыны сендердің жасырынған орындарыңды ағызып алып кетеді."},
	{18, "18 Сендердің ажалмен жасасқан келісімшарттарың жойылып, о дүниемен жасасқан келісімдерің күшінде қалмайды. Ғаламат апат бәрін жайлағанда, ол сендерді де құлатып, жайрататын болады."},
	{19, "19 Апат өткен сайын сендерді ұстайды. Ол әр таң сәріде, күні-түні өтіп шықпақ. Осы хабар халықты дірілдетіп қорқытатын болады."},
	{20, "20 Себебі төсек орындарың көсілуге тым қысқа, көрпелерің жамылуға тым енсіз."},
	{21, "21 Өйткені Жаратқан Ие ежелде Перасим тауының маңында және Гибеон алқабында қаһарлана қозғалғаны сияқты, енді осында келмек. Ол Өзінің әдеттен тыс әрі таңғаларлық ісін жүзеге асыратын болады."},
	{22, "22 Мен Әлемнің Әміршісі Жаратқан Иеден Өзінің бүкіл жерді талқандауды ұйғарғаны жайлы естідім. Сондықтан бұдан былай мазақтаушы болмаңдар! Әйтпесе сендердің кісендерің одан бетер ауыр болады."},
	{23, "23 Ал енді, үніме құлақ салып, өздеріңе айтып тұрғаныма көңіл бөліңдер!"},
	{24, "24 Диқан тұқым себу үшін егіндігін ұдайы жырта бере ме? Әлде ол ұдайы жерді жыртып, топырақ кесектерін малалай бере ме?"},
	{25, "25 Қайта, диқан егіндіктің бетін тегістеп болған соң, аскөкті сеуіп, зирені шашып тастайды. Сондай-ақ, бидайды қатар-қатар, арпаны да өзінің танабына егіп, егістіктің шеттеріне қарай бидайға ұқсас басқа дақылды сеуіп тастайды."},
	{26, "26 Диқан өзінің жұмысын қалай істеуді біледі, өйткені Құдай оған сол туралы түсінік сыйлаған."},
	{27, "27 Диқан аскөк пен зирені бастыру үшін не өткір тісті астық бастыратын тақтайды, не арбаның қатты дөңгелектерін қолданбайды. Қайта, аскөкті жеңіл таяқпен, ал зирені тоқпақпен соққылайды."},
	{28, "28 Нанға арналған дәндерді де шексіз бастырумен құртпайды. Диқан астықты дәндерін бүлдірмей, ат жегілген арбамен қалай бастыруды біледі."},
	{29, "29 Бұл даналық та Әлемнің Иесінен келеді. Оның ақыл-кеңесі керемет, даналығы ғаламат!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view29() {
struct kk29 poems[] = {
	{1, "1 Уа, Құдайдың құрбандық үстелі орналасқан Иерусалим қаласы — ежелде Дәуіт патша тұрған шаһар, сен қасіретке қаласың! Мейлі, жыл сайын өз мейрамдарыңды өткізе бер!"},
	{2, "2 Әйтсе де Мен басыңа қиыншылық түсіремін. Сонда еңіреп жылайсың. Ал қала қанмен былғанған құрбандық үстеліне ұқсайды."},
	{3, "3 Мен қаланы жан-жақтан қоршап алып, дуал мен мұнаралар тұрғызып қамаймын."},
	{4, "4 Сонда сен құлап түсіп, жерде жатып сөйлейтін боласың. Сенің сөздерің өзің жатқан шаң-тозаңнан естілмек. Даусың тіпті көрдегі аруақтың сыбырына ұқсамақ."},
	{5, "5 Алайда саған шабуыл жасаған көптеген жат жерлік жауларың кенеттен майда шаң-тозаңдай кері үрленіп тасталады. Айбарлы жасақшылар тобырлары қауыз іспетті ұшып кетеді. Бұл лезде, күтпеген жерден болмақ."},
	{6, "6 Мен, Әлемнің Иесі, сұрапыл зор күркілмен, жер сілкінісі, құйын, дауыл және жалмайтын өртпен сені құтқаруға келемін."},
	{7, "7 Сонда Құдайдың құрбандық үстелі орналасқан Иерусалим қаласына қарсы соғысып жатқан көптеген халықтардың шулы әскерлері көрген түс сияқты түгелдей ғайып болады. Олар қаланы оның бекіністерімен бірге қамап алған еді. Енді сол әскерлердің бәрі де түн ішінде көзге елестеген бір нәрседей жоқ болып кетеді."},
	{8, "8 Аш адам тамақ ішіп отырмын деп түс көрсе де, қарны ашып оянады. Шөлдеген адам су ішіп отырғаны жайлы түс көрсе де, шаршап-шалдыққан күйі оянады. Сион тауына қарсы соғысқан халықтардың бүкіл әскерлерімен де солай болады."},
	{9, "9 Аң-таң болып, қайран қаласыңдар! Көр соқыр бола бересіңдер! Еш шарап ішпей-ақ мас болып, еш сыра ішпей-ақ теңселіп жүретін боласыңдар."},
	{10, "10 Себебі Жаратқан Ие сендерге терең ұйқыға кетіретін рухты дарытты. Ол көздеріңді жапқан іспетті, сендердің пайғамбарларыңды шындықты көрмейтін етті, әрі бастарыңды бүркеген сияқты, оларға көрініс пен аян көрсетпей қойды."},
	{11, "11 Осы пайғамбарлық сөздің бүкіл мазмұны сендер үшін мөрленіп бекітілген шиыршық кітап іспетті жабық болмақ. Егер оны сауатты біреуге тапсырып: Маған оқып берші! деп сұрасаңдар, ол: Кітап шиыршықталып, мөрленгендіктен оқи алмаймын демек."},
	{12, "12 Егер оны сауатсыз біреуге тапсырып: Маған оқып берші десеңдер, ол: Оқи алмаймын деп жауап бермек."},
	{13, "13 Жасаған Ие мынаны айтады: Бұл халық тек ауызбен алдыма келіп, Мені сөздерімен ғана сыйлайды, ал жүректері Менен тым алшақ. Адам баласы шығарған ережелерді үйретіп, Мені құрметтегенсиді, ал солары бекершілік!"},
	{14, "14 Сондықтан біліп қойыңдар: Мен осы халыққа тағы да әдеттен тыс, таңғажайып та керемет бір нәрсе істеймін. Сонда олардың дана адамдарының даналығы жойылып кетеді, ақылдыларының ақылы жоқ болады."},
	{15, "15 Ой-ниеттерін Жаратқан Иеден жасыруға тырысқандар қасіретке қалады! Олар іс-әрекеттерін түнекте істеп: Бізді кім көреді? Істеп жатқанымызды қайдан біледі? деп ойлайды."},
	{16, "16 Сендер бәрін керісінше ойлайсыңдар! Құмырашыны саз балшықпен теңестіруге бола ма?! Жаратылған нәрсе өзін жаратқан туралы: Ол мені жаратқан жоқ! деп айта ала ма? Әлде бір ыдыс өзіне пішін беріп жасаған құмырашы жайлы: Ол ештеңені білмейді! дей ала ма?"},
	{17, "17 Көп кешікпей Ливанның ормандары Қармил іспетті бау-бақшаға, ал бау-бақшалар қалың орманға айналады."},
	{18, "18 Сол күн туғанда саңырау адамдар оқылған кітапты естіп, соқырлардың көздері ашылып, тас қараңғылықтан құтылып, көретін болады."},
	{19, "19 Бейнет шеккендер Жаратқан Иеден жаңадан қуаныш тауып, мүсәпірлер Исраилдің Киелі Құдайына шаттана ән салатын болады."},
	{20, "20 Айбарлы жәбірлеушілер енді ғайып болып, мазақтаушылар жойылып, зұлымдық ойлаушылардың барлығы да құриды."},
	{21, "21 Басқаларды кінәлап өсектегендер де, қала алаңында сот жүргізушілерге тұзақ құрып, әділ адамды құр таласпен құқығынан айырып келгендер де енді жоқ болады."},
	{22, "22 Сондықтан да Ыбырайымды талай қиындықтардан құтқарған Жаратқан Ие Жақыптың үрім-бұтағы (Исраил халқы) туралы мынаны айтады: Жақыптың үрім-бұтағы бұдан былай қарабет болып масқараланбайды."},
	{23, "23 Олар Мен өздеріне сыйлайтын балаларын көргенде, Жақыптың Киелі Құдайы деген қасиетті есімімді құрметтеп, Мені, Исраилдің Құдайын, терең қастерлейді."},
	{24, "24 Халықтың теріс жолға адасып кеткендері енді шындықты түсінеді, әрі шағымданып күңкілдейтіндері тәлім-тәрбиені қабылдайды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view30() {
struct kk30 poems[] = {
	{1, "1 Жаратқан Ие тағы мынаны айтады: Бас көтергіш балаларға ұқсайтын халқым қасіретке қалады! Олар Менің еркімнен тыс жоспарлар ойлап, одақ құрады, әрі Менің Рухымның жетелеуінсіз келісімшарт жасайды. Осылай күнәларына күнә жамап келеді."},
	{2, "2 Халқым Менен ақыл сұрамай-ақ Мысырға ылдилап барады. Сол елдің қуатты патшасы перғауыннан қорғаныш іздеп, Мысырдың саясын паналайды."},
	{3, "3 Алайда перғауынның қорғанышы оларға ұят келтірмек, Мысырдың саясын паналау оларды масқараға ұшыратпақ."},
	{4, "4 Яһуданың әміршілері (Мысырдың солтүстік астанасы) Соғанда болып, елшілері Ханес қаласына жеткенмен,"},
	{5, "5 сол елге сенім артқандардың барлығы да ұятқа қалады. Перғауыннан ешқандай көмек пен пайда таппаған олар масқараға қалады."},
	{6, "6 Бұл — оңтүстіктегі Негев аймағындағы хайуандар туралы ауыр хабар: Елшілер керуені ақырған арыстандар, улы сұр жыландар мен атылып шағып алатын оқ жыландар мекендейтін қорқынышты құла түз арқылы өтіп Мысырға барады. Олар есектерінің арқаларына, түйелерінің өркештеріне артқан бағалы заттары мен қазыналарын тасып әкетеді. Алайда Мысыр елі оларды қорғай алмайды,"},
	{7, "7 оның көрсететін көмегі еш пайдасыз. Сондықтан Мен оны тыныш отыратын айдаһар деп атаймын."},
	{8, "8 Енді барып, осы сөздерді бұлардың көз алдында бір тақташаға жаз, шиыршық кітапқа да жазып қой! Келер күндері солар берік айғақ болсын."},
	{9, "9 Себебі бұл — бас көтергіш халық, өтірікші балалар, Жаратқан Иенің тәлімін тыңдаудан бас тартатын перзенттер."},
	{10, "10 Олар көріпкелдерге: Аян көруші болмаңдар! — дейді, пайғамбарларға да былай деп тыйым салады: Ненің ақиқат екені туралы емес, бізге ұнамды жайттар туралы айтыңдар! Қиялдар көріп, соларды жеткізіңдер!"},
	{11, "11 Біздің жолдан тайып тұрыңдар, өздерің жүретін тым тар соқпақтан бұрылып шығыңдар! Исраилдің Киелі Құдайына назарымызды аудартпаңдар!"},
	{12, "12 Сол себептен Исраилдің Киелі Құдайы жауап беріп мынаны айтады: — Сендер сол айтқандарымды қабылдамай, зорлық пен алдамшылыққа сеніп, соларға сүйенесіңдер."},
	{13, "13 Осы әділетсіз іс-әрекеттеріңе бола сендердің бастарыңа зор қауіп төніп тұр! Ол шығыңқы жерлері мен жарықтары бар, құлауы әбден ықтимал биік қабырғаға ұқсайды. Сондай қабырға бір-ақ сәтте, күтпеген жерден құлап, қирайды да,"},
	{14, "14 қыш құмыра сияқты паршаланып сынып қалады. Одан ең болмағанда ошақтан шоқ салып әкелуге немесе құдықтан шөміштеп су алуға жарамды бірде-бір сынық қалмайды. (Сендермен де солай болмақ!)"},
	{15, "15 Исраилдің Киелі Құдайы — Жаратушы Тәңір Ие тағы мынаны айтады: — Теріс жолдарыңнан қайтып, тынышталыңдар, сонда құтқарыласыңдар. Уайымға салынбай Маған сенім артыңдар, Мен сендерді күшті қыламын. Алайда солай істегілерің келмеді."},
	{16, "16 Қайта, сендер: Атқа мініп қашып кетеміз! дейсіңдер. Солай-ақ болсын, шынында да қашып кетесіңдер! Жүйрік аттарға мініп, басқа жаққа кетеміз! дейсіңдер. Солай-ақ болсын, бірақ сендерді қуатындар да өте жүйрік болмақ!"},
	{17, "17 Жаудың бір жасақшысы айбат көрсеткенде, сендердің мыңың қаша жөнелесіңдер. Олардың бес-ақ жасақшысының айбатынан бәрің де қашып кететін боласыңдар. Сонда сендер тау шыңында қадалған жалау сабына немесе қырат басындағы сырыққа ұқсап жападан-жалғыз қаласыңдар."},
	{18, "18 Сондықтан Жаратқан Ие сендердің Өзіне қайтып келіп, рақымына ие болуларыңды сағына күтуде. Ол орнынан тұрып, сендерге мейірбандық көрсетуге дайын. Өйткені Жаратқан Ие — әділ Құдай. Оған сенім артып Оны күтетіндер қандай бақытты!"},
	{19, "19 Уа, Иерусалимде тұратын Сион халқы, бұдан былай сендер жыламайсыңдар. Азапталып, Жаратқан Иенің құтқаруын сұрап шақырсаңдар, Ол сендерге рақым көрсетеді. Дауыстарың құлағына шалынысымен-ақ Ол сендерге жауап береді."},
	{20, "20 Жасаған Ие сендерге нанның орнына мұқтаждық, судың орнына қысымшылық жіберді. Ал енді Ол — өздеріңді үйрететін Ұстаздарың, жасырын емес, көз алдарыңда болмақ."},
	{21, "21 Сонда сендер жолдан оңға не солға қарай бұрылмақ болғанда, бір дауыстың арт жақтан: Жол мынау, сонымен жүріңдер! дегенін еститін боласыңдар."},
	{22, "22 Енді сендер күміспен қапталған не алтын жалатқан жалған тәңір мүсіндеріңді алып, оларды арам нәрседей менсінбей: Көз алдымнан жоғалыңдар! деп, лақтырып тастайсыңдар."},
	{23, "23 Егістікке тұқым сепкен кездеріңде Иеміз жаңбыр жаудырып, ағыл-тегіл өнім бергізеді. Малдарыңның жайылымы ұлан-ғайыр болады."},
	{24, "24 Жер жыртатын өгіз-есектерің күрекпен жел өтінде тазартылып, сүрленген өте құнарлы жем жейді."},
	{25, "25 Жаудың мұнаралы бекіністері қолға түсіп, жасақшылары қырылған кезде әр тау мен төбе басынан су бұлақтары аға жөнеледі."},
	{26, "26 Ай күндей нұрлы, ал күн әдеттегіден жеті есе артық сәуле шашып, жеті күнгі нұр бір күні жайнағандай болмақ. Жаратқан Ие өз халқының сынған сүйектерін таңып, Өзінің оларды жазалағанда жарақаттаған жерлерін сауықтыратын кезде осылай болады."},
	{27, "27 Біліп қойыңдар, атағы жайылған Жаратқан Ие алыстан лаулаған қаһарымен, көтеріліп жатқан қалың түтінмен келіп жетеді. Оның аузынан шыққан сөздері қаһарлы. Оның тілінен бәрін жалмайтын от лаулап шығады."},
	{28, "28 Оның лебі жауларының мойындарына жететін қатты ағысты тасқындай шығады. Жаратқан Ие ұлттарды електен өткізіп, айырады. (Өзіне бағынудан бас тартатын) халықтарды ауыздық пен жүген салғандай жолдан адасып, жойылуға жетелейді."},
	{29, "29 Ал, Құдайдың халқы, сендер Оған бағышталған мейрам күнінің қарсаңындағы кеште қуана шырқайтындай ән салатын боласыңдар. Сендер Исраилдің жартастай берік Қорғаушысы — Жаратқан Иенің Сион тауына қарай сыбызғының даусына сәйкес салтанатты шерумен жүріп бара жатқан кездеріңдей, жүректерің шаттыққа кенелмек."},
	{30, "30 Жаратқан Ие адамдарға Өзінің ғаламат зор үнін естіртіп, лаулаған қаһарымен күш-қуатын көрсетеді. Ол бәрін жалмайтын оттың жалынымен әрі дауыл, нөсер және ірі бұршақ арқылы Өзінің құдіретін танытады."},
	{31, "31 Жаратқан Иенің дауысы Ассурды қағып-сілкиді. Ол билігінің асатаяғымен дұшпандарын соғады."},
	{32, "32 Иеміз жауларына дүре соққандай жазаларын тартқызғанда, Оның жеңісін мадақтайтын даңғыралар мен жетігендердің әуендері естіледі. Жаратқан Иенің Өзі құдіретті қолын созып, жауға қарсы шайқасады."},
	{33, "33 Көп уақыт бұрын-ақ Ассур патшасының мәйітін салтанатпен, үлкен отпен өртеп жіберетін орын дайындалып қойылған болатын. Ондағы шұңқыр терең де кең, әрі мол отын қаластырылып дайындалған. Оны өртеп жіберу үшін Жаратқан Иенің лебі жанартаудан шыққан күкірт іспетті отты жалын үрлейді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view31() {
struct kk31 poems[] = {
	{1, "1 Мысырға ылдилап барып, көмек сұрағандар қасіретке қалады! Олар Мысырдың көптеген аттары мен соғыс күймелеріне әрі сондай мықты салт аттыларына сенім артады, ал Исраилдің Киелі Құдайы — Жаратқан Иеге бет бұрып сиынбайды."},
	{2, "2 Бірақ Жаратқан Ие Өзінің зор даналығымен оларға апат жібермек. Ол айтқан сөзінен таймайды, әрі зұлымдық істеуші елге, әділетсіздік жасайтындарды қолдағандарға қарсы шығатын болады."},
	{3, "3 Мысырлықтар тәңір емес, жай пенделер ғана. Олардың астындағы аттары да рух емес, жай ет пен сүйектен тұратын тән. Жаратқан Ие Өзінің құдіретті қолын алға созғанда, Яһудаға қол ұшын беретін Мысыр елі сүрінеді. Мысырдың қолдауын қабылдаған Яһуда халқы да құлап түседі. Осылай олардың екеуі де құриды."},
	{4, "4 Жаратқан Ие маған мынадай уәде берген еді: — Мықты жас арыстан шапқан олжасының үстінде тұрып ырылдағанда, тіпті малшылардың бүкіл тобы оған қарсы шығып, қатты айқайлап, у-шу жасаса да, арыстан соларынан қорқып шошымайды. Сол сияқты Әлемнің Иесі де көктен түсіп, Сион тауы мен оның маңындағы қыраттарда шайқасатын болады."},
	{5, "5 Ұясының үстінен қалықтап ұшып жүретін құс іспетті, Әлемнің Иесі де Иерусалимді қорғайды. Иә, Ол қаланы қорғап, құтқарады, оны ешкімге күйретпей үстінен өте шығып, аман алып қалады."},
	{6, "6 Өздерің мүлдем бас тартып, опасыздық жасаған Жаратқан Иеге енді қайтып келіңдер, уа, Исраил халқы!"},
	{7, "7 Сол кезде әрқайсыларың күнәға батып өз қолдарыңмен алтын-күмістен жасап алған тәңір мүсіндеріңді лақтырып тастайтын боласыңдар."},
	{8, "8 Ассур әскері соғыста семсерден құриды, бірақ пенденің семсерінен емес. Адам қолымен жасалмаған қару оларды жалмайтын болады. Ассурлықтар семсерден қашып кетпек, ал олардың жас жігіттері құлдыққа түсіп, ауыр жұмыс істейтін болады."},
	{9, "9 Олар үрейленіп, өздері паналаған қорғанды тастап кетеді. Ассурдың әміршілері сендердің туларыңды көргенде зәрелері ұшады, — деп нық айтады Жаратқан Ие. Оның (жауларын жалмайтын) оты Сионда, әрі жалындаған ошағы Иерусалимде жанып тұратын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view32() {
struct kk32 poems[] = {
	{1, "1 Біліп қойыңдар, бір кезде мұнда бір патша әділдікпен билік құрып, оның әміршілері елді заңды бұзбай басқаратын болады."},
	{2, "2 Әрқайсысы желден қорғайтын панадай, дауылдан бас сауғалайтын қорғаныштай болмақ. Олар құла түзде ағып жатқан өзенге, әрі кеуіп шөліркеген даладағы дәу жартастың саясына ұқсамақ."},
	{3, "3 Сонда көретіндердің көздері жабылмайды, еститіндердің құлақтары шындыққа ашық болады."},
	{4, "4 Ұшқалақ жандар парасатқа кенеледі, тілі мүкіс сөйлейтіндер ойларындағыны мүдірмей ағыла айта алатын болады."},
	{5, "5 Енді қайтып ақымақ қадірлі, алдамшы мырза деп аталмас."},
	{6, "6 Себебі ақымақтар ессіздік айтып, ой-ниеттері заңсыз істерге бейімделген. Олар зұлымдықпен айналысып, Жаратқан Ие туралы жалған тәлім таратады. Ақымақтар ашыққандарды құр алақан жіберіп, шөлдегендерге сусын беруден бас тартады."},
	{7, "7 Алаяқтың қолданған әдістері арамза. Бейшара кедей өзінің әділ ісін қорғап сөйлегенде, алаяқ оны алдап құрту үшін сұм айласын құрады."},
	{8, "8 Ал әділ жан әділ жоспар құрып, әділдікті қорғап нық тұрады."},
	{9, "9 Уа, жайбарақат жатқан әйелдер, тұрып, мені тыңдаңдар! Ей, бейқам бойжеткендер, сөзіме құлақ асыңдар!"},
	{10, "10 Уа, алаңсыз жүрген қыз-келіншектер, бірер жылдан кейін сендер зәрелерің ұшып қорқасыңдар. Өйткені өнімін жинауға не жүзім, не басқа да жемістер болмайды."},
	{11, "11 Әй, жайбарақат жүрген бейқам қыз-келіншектер, зәрелерің ұшып қалтыраңдар! Сәнді киімдеріңді шешіп тастап, азалы киім киіп, белдеріңді байлап алыңдар!"},
	{12, "12 Шұрайлы егістіктеріңді, құнарлы жүзімдіктеріңді жоқтап қолдарыңды кеуделеріңе қойып қайғырыңдар!"},
	{13, "13 Себебі тікенді бұталар мен ошағандар халқымның еліне қаптап кетеді. Ермекке салынған барлық үйлеріңді, шат-шадыман дауыстарға кенелген қалаларыңды аза тұтыңдар!"},
	{14, "14 Өйткені тұрғындары қорғанды тастап кетеді, халқы ығы-жығы мол қала да елсіз бос қалатын болады. Қамалы мен күзет мұнаралары әрдайым күл-талқан болып жатпақ. Бұл жер жабайы есектерге ұнап, отарлардың жайылымына айналады."},
	{15, "15 Ал кейін Құдай көктен өз Рухын үстімізге құяды. Сонда елсіз дала бау-бақшаға айналып, бау-бақша ормандай жайқалып, мол өнім беретін болады."},
	{16, "16 Иен далаға әділет жайылып, бау-бақшаны да әділдік мекендейді."},
	{17, "17 Әділдіктің жемісі амандық пен бейбітшілік болмақ. Иә, әділдік мәңгі бақи тұрақты тыныштық пен қауіпсіздік әкелмек."},
	{18, "18 Сонда Менің халқым тыныш мекендерде тұрып, үйлері қауіпсіз әрі жанға жайлы болады."},
	{19, "19 Тіпті (асқақтаған) ормандарға бұршақ жауып, (бас көтергіш) қала жермен-жексен болғанда да,"},
	{20, "20 сендер жарылқанасыңдар. Себебі барлық өзендер мен сай-салалардың бойына тұқым сеуіп, (мол өнім аласыңдар). Мүйізді ірі қараларың мен есектерің еркін жайылатын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view33() {
struct kk33 poems[] = {
	{1, "1 Ей, ойрандаушы жау, өзің әлі де ойрандалмадың, әйтсе де енді қасіретке қаласың! Ей, опасыздық жасаушы жау, өзіңе әлі де опасыздық жасалмады, әйтсе де енді қасіретке қаласың! Ойрандап болған кезіңде өзің де ойрандаласың. Опасыздық жасап болған кезіңде басқалар саған опасыздық жасамақ."},
	{2, "2 Уа, Жаратқан Ие, бізге рақым көрсете гөр! Саған сенім артып, Сені күтетін боламыз. Таң атқан сайын бізге күш-қуат сыйлап, қиын-қыстау кезеңде құтқара гөр!"},
	{3, "3 Сенің күркіреген даусыңнан халықтар қашады. Сен орныңнан көтерілсең, олар бытырап кетеді."},
	{4, "4 Сонда жаудың жиған олжалары құрт не шегіртке жалмағандай ғайып болады."},
	{5, "5 Жаратқан Иенің мәртебесі қандай жоғары! Ол көкте тұрып, Сионды әділдік пен ақиқатқа кенелтеді."},
	{6, "6 Сол заманда Ол сендерге тұрақтылық, молынан аманшылық пен даналық және білім сыйлайды. Жаратқан Иені терең қастерлеу ұлы қазыналарың іспетті болмақ."},
	{7, "7 Қараңдар, Яһуданың күшті адамдары көшелерде айқайлауда, бітім жасауға жіберілген елшілер қатты жылап (Ассурдан қайта оралады)."},
	{8, "8 Даңғыл жолдар қаңырап бос жатып, жолаушылар олармен енді жүрмейді. (Ассур бейбітшілік жайлы) келісімшартты бұзды. Куәгерлер алдында жасалған уәделер ұмытылып, адамның өміріне еш құрмет көрсетілмейді."},
	{9, "9 Жеріміз құрғап, кеуіп қалуда. Ливан тауының ормандары солып ұятқа қалады. Шаронның құнарлы жазығы Өлі теңіздің жағасындағыдай құла түзге айналып, Башан мен Қармилдың қыратты аймақтарындағы ағаштар да қурап, жапырақтары түсіп жатыр."},
	{10, "10 Жаратқан Ие (халықтарға) мынаны айтады: Енді Мен орнымнан тұрамын! Мен қазір көтеріліп даңқымды шығарамын!"},
	{11, "11 (Ей, ассурлықтар), сендер қауыздай түкке тұрғысыз жоспар құрасыңдар. Істегендерің орылған егіндіктегі қурап қалған сабақтардай пайдасыз. Ашу кернеп осқырған лептерің оларыңды от сияқты өртеп жібермек."},
	{12, "12 Сонда халықтар әк іспетті күйдіріліп, кесілген тікенді бұта іспетті өртеніп кетеді."},
	{13, "13 Ей, алыстағылар, Менің істегенімді естіп біліңдер! Жақындағылар да, құдіретімді мойындаңдар!"},
	{14, "14 Сиондағы күнәкарлар үрейленіп, арсыздар дірілдеп қорқып былай деп жатыр: Біздің қайсымыз осы жалмайтын отта тұра аламыз? Қайсымыз сөнбейтін отта аман қала аламыз? —"},
	{15, "15 Тек әділ жолмен жүріп, шындықты айтатындар, зорлықпен пайда табудан бас тартып, пара алуға қол созбайтындар, әрі қан төгуді көздегендерге құлақ аспай, басқа да жауыз істерге қызықпайтындар ғана аман қала алады."},
	{16, "16 Мұндайлар зәулім жартасты не мықты қорғанды паналағандай қауіпсіз болмақ. Оларға жейтін тамақтары беріліп, ішетін сусындары да таусылмас."},
	{17, "17 Сендер Патшаны асқан салтанатында өз көздеріңмен көресіңдер. Алысқа созылып жатқан ұлан-ғайыр елге көз саласыңдар."},
	{18, "18 Өткен кездегі қорқыныш туралы ойланатын боласыңдар. (Жау қалаларыңды тонағанда олар:) Есепші қайда екен? Олжаны таразыға тартатын тіркеуші қайда? Мұнараларды санаушы қайда? — деп айқайлайтын."},
	{19, "19 Сендер бөгде, түсініксіз тілде сөйлескен сол қатал халықты бұдан былай көрмейсіңдер."},
	{20, "20 Сион шаһарына қараңдар, оның ішінде Құдай белгілеген мейрамдарымызды тойламақпыз! Сонда Иерусалимді өз көздеріңмен көресіңдер, ол аман-есен жатқан мекен болмақ. Қала қазықтары суырылмайтын, арқандары үзілмейтін, ешқашан да құлатылып, орнынан қозғалмайтын тұрақты шатырға ұқсамақ."},
	{21, "21 Сонда Жаратқан Ие бізге салтанатты ұлылықпен билік жүргізеді. Еліміз екі жағында да үлкен өзендер мен бұлақтар ағып жатқан қауіпсіз жер іспетті болады. Жаудың ескекті қайықтары да, дәу кемелері де сонда жүзбейді."},
	{22, "22 Себебі Соттаушымыз да, Заң Шығарушымыз да, Патшамыз да — Жаратқан Ие. Ол бізді құтқаратын болады."},
	{23, "23 Уа, халқым, қазір сен арқандары босап кеткен кемеге ұқсайсың. Арқандар кеменің діңгегін мықтап ұстай алмайды, желкенді де жая алмайды. Ал кейін (жаудың әскерінен қалған) ағыл-тегіл мол олжасын бөлісіп аласыңдар. Тіпті ақсақтар да соған қатысып, өз үлестерін алмақ."},
	{24, "24 Елімізде тұратын бірде-бір жан енді қайтып: Әлсізбіз деп түңілмейді. Жерді мекендеген халықтың барлық күнәлары кешірілген болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view34() {
struct kk34 poems[] = {
	{1, "1 Уа, ұлттар, жақындап келіп тыңдаңдар! Уа, халықтар, құлақ салыңдар! Жер де, онда тұратындардың бәрі де, әлем де, онда туылғандардың барлығы да тыңдап тұрсын!"},
	{2, "2 Жаратқан Ие барша халықтарға ашуланып, олардың күллі әскерлеріне қаһарланады. Соларды жойылуға арнап, қырылуға тастады."},
	{3, "3 Содан өліктері далаға лақтырылып, қабірге қойылмай, шіріп, сасып жатады. Төгілген қандарынан тау-төбелердің топырағы ылғалданады."},
	{4, "4 Аспандағы күн, ай және жұлдыздар еріп кетеді. Аспан шиыршық кітаптай шиырылады, әрі жұлдыздар жүзім бұтағынан не інжір ағашынан түскен құрғақ жапырақтай жерге құлап түспек."},
	{5, "5 Осылай семсерім аспандағы күштерді қырып тастайды. Бұдан кейін ол Едомды, Өзім жойылуға арнаған халықты шабады, (— деп ескертеді Жаратқан Ие)."},
	{6, "6 Иә, Жаратқан Иенің семсері құрбандыққа шалынған қой-ешкілердің қанына малынып, солардың майына және қошқарлардың бүйрек майына малынып, тойған іспетті. Себебі Жаратқан Ие Едом жерінің Босора қаласында құрбандық шалғандай үлкен қантөгіс жасамақ."},
	{7, "7 Сонда тіпті жабайы бұқадай мықты адамдар — жас жігіттер және күшті жетекшілер қырылмақ; жер қаннан қып-қызыл болып боялып, топырағы майға тойынады."},
	{8, "8 Себебі Жаратқан Ие Өзінің зұлымдарға тиісті жазаларын тартқызатын күнін жоспарлады. Ол Едомға оның Сион халқына көрсеткен зорлық-зомбылығын қайтаратын уақытын белгіледі."},
	{9, "9 Сонда Едом елінің өзендері қарамайға, оның топырағы күкіртке айналады. Бүкіл жері қарамай сияқты өртенетін болады."},
	{10, "10 От күндіз-түні өшпейді, оның түтіні мәңгі шығып жатпақ. Сол жер ұрпақтан ұрпаққа қаңырап бос қалмақ. Енді қайтып ешкім де одан өтпейтін болады."},
	{11, "11 Бірқазан мен кірпі оны иемденіп, үкі мен қарға сонда ұяларын салады. Құдай Едомның жерін тәптіштеп өлшеп, оны ретсіз, тіршіліксіз бос жатуға бағыштайды."},
	{12, "12 Енді Едомды Патшалық жоқ деп атайтын болады, оның әміршілерінің барлығы да жоғалады."},
	{13, "13 Оның қорғандарын тікенді бұталар басып, бекіністі қалаларын қалақай мен ошаған жайлап кетеді. Осы жер шибөрі мен түйеқұстың тұрағына айналмақ."},
	{14, "14 Сонда иен даланың аңдары қорқау қасқырларға ұшырасып, жабайы текелер бір-бірін маңырап шақырады. Түнгі аңдар сол жерде демалып, тыным табады."},
	{15, "15 Жапалақтар сонда ұяларын салып, жұмыртқаларын басады. Балапандарының үстіне қанаттарын жайып, оларды жинайды. Лашындар да сол жерге жұптасып келеді."},
	{16, "16 Жаратқан Иенің кітабын оқып шығып, білімді қабылдаңдар! Сол кезде осы аңдардың бір түрі де жоқ болмайды, ешқайсысы да жұпсыз қалмайды. Себебі Жаратқан Иенің Өзі мұны бұйырды, Оның Рухы оларды жинап әкелмек."},
	{17, "17 Ол соларға осы жерден мекендерін үлестіріп, өлшеп тапсырды. Олар оны әрдайым иемденіп, барлық ұрпақтары да соны мекендемек."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view35() {
struct kk35 poems[] = {
	{1, "1 Сол кезде тіпті иен дала мен құла түз қуанып, меңіреу дала да шаттанып, сарғалдақтар гүлдейді."},
	{2, "2 Айдала жайқала гүлдеп, қуана ән шырқайды. Құла түз енді Ливан тауларындай салтанатты, Қармил тауы мен Шарон жазығындай құлпырып, көрікті болады. Әрбір жан Құдайымыз Жаратқан Иенің салтанатты ұлылығын көретін болады."},
	{3, "3 Сонымен салдырап, дәрменсіз қалған аяқ-қолдарыңның буындарын бекітіп, еңселеріңді көтеріңдер!"},
	{4, "4 Жүрексінген адамдарыңа былай деңдер: Қорықпай, берік болыңдар! Біліп қойыңдар, сендер сиынатын Құдай жауларыңды өздері жасаған қылмыстары үшін жазалауға келеді. Иә, Құдай сендерді құтқаруға келе жатыр!"},
	{5, "5 Сонда соқырдың көзі ашылып, көре алады, саңыраудың құлағы ашылып, ести алады."},
	{6, "6 Ақсақ адам енді бұғыдай секіріп, еш сөйлей алмаған сақау қуана айқайлайды. Шөл далада бұлақ көздері қайнап, құла түзде өзендер ағады."},
	{7, "7 Шөлейт жер көлге айналып, қураған дала бұлақтарға толады. Шибөрілер тынығып келген аңызақ жерлерде енді көк шөп пен қамыс-құрақ жайқалады."},
	{8, "8 Сол жерде даңғыл жол болып, ол Қасиеттілік жолы деп аталмақ. Бұл жолмен арам ниетті адамдар емес, тек Құдайдың халқы жүреді. Менмен ақымақтар оған еш түспейді."},
	{9, "9 Оның бойында не арыстандар, не басқа да жыртқыш аңдар аңдып жүрмейтін болады. Өзге қауіптер де сонда болмайды. Тек жау қолынан азат етілгендер ғана сол жолмен жүрмек."},
	{10, "10 Жаратқан Иенің азат еткен халқы Сионға ән шырқап қайтып келеді, Олар ұдайы мәз-мейрам болады, Қуаныш пен шаттыққа кенеледі, Қайғы-қасірет, күрсіну атаулы Бастарынан бірден алыстап кетеді!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view36() {
struct kk36 poems[] = {
	{1, "1 Езекияның патшалық құрған он төртінші жылы Ассур патшасы Сеннахирим Яһуда елінің (Иерусалимнен өзге) барлық қамалды қалаларына қарсы аттанып, оларды басып алды."},
	{2, "2 Сол кезде Ассур патшасы Лахыштан өзінің бас уәзірін қалың қолмен Иерусалимдегі Езекия патшаға жіберді. Бас уәзір Жоғарғы тоғанға қарай аққан арықтың бойында, мата ағартушы шеберлердің даласына апаратын жолда тоқтады."},
	{3, "3 Сонда Яһуда патшасының сарай басқарушысы Хелкия ұлы Елиәкім, хатшысы Себна және жылнамашысы Асаф ұлы Жоғах қаладан шығып, оның алдына келді."},
	{4, "4 Ассур патшасының бас уәзірі бұларға тіл қатып былай деді: — Езекияға мына сәлемді жеткізіңдер: Ассур елінің ұлы патшасы мынаны айтады: Сен не нәрсеге арқа сүйейсің?"},
	{5, "5 Менде соғысуға ақыл-кеңес пен күш-қуат бар дейсің. Алайда мұның тек бос сөздер ғана. Маған қарсы бас көтеретіндей сен енді кімге сүйенесің?!"},
	{6, "6 Біліп ал, сен сүйеніп келген Мысыр сынық қамыс іспетті. Егер адам сынық қамысқа сүйенсе, сол оның қолына кіріп, алақанын тесіп шықпай ма? Сол сияқты, Мысыр патшасы перғауын да өзіне сүйенгендердің бәріне осылай істейді."},
	{7, "7 Ал егер маған Сиынатын Құдайымыз Жаратқан Иеге сеніп отырмыз десеңдер, мынаны ойлаңдар: Езекия Оны қатты ренжітті емес пе? Ол Жаратқан Иеге арналған биіктеу жерлердегі табыну орындары мен құрбандық үстелдерін қиратып, Яһуда мен Иерусалим халқына Тек (Иерусалимдегі) осы құрбандық үстелінің алдында ғана ғибадат етіңдер! деп бұйырған жоқ па?!"},
	{8, "8 Ал енді, менің тақсыр ием — Ассур патшасымен келісім жасаңдар: мен сендерге екі мың ат беремін, егер де араларыңнан соншама атқа мінер жігіт шығара алсаңдар!"},
	{9, "9 Сендер тіпті Мысырға, оның соғыс күймелері мен атты әскеріне сүйене отырып та, тақсыр иемнің нөкерлерінің арасынан ең кіші деген әкіміне де қарсы тұра алмайсыңдар!"},
	{10, "10 Мұның үстіне мені осы жерді талқандауға Жаратқан Иенің еркінсіз келді дейсіңдер ме? Маған: Сол елге өрлеп барып, оны құртып жібер! деген — Жаратқан Иенің Өзі!"},
	{11, "11 Сонда Елиәкім, Себна және Жоғах Ассур патшасының бас уәзірінен: — Біздей құлдарыңызға арамейше сөйлей беріңіз, біз оны да түсінеміз. Яһудилердің тілінде сөйлемей-ақ қойыңыз. Әйтпесе қамал басындағы халық естіп қояр, — деп өтінді."},
	{12, "12 Бірақ бас уәзір жауап қайырып: — Тақсыр ием мені осы сөздерді тек сендердің иелерің мен өздеріңе ғана айту үшін жіберді дейсіңдер ме? Мені мына қабырғаның үстінде отырған адамдарға да жіберді емес пе? Олар әлі де сендермен бірге өз нәжістері мен зәрлерін ішіп-жейтін болады! — деді."},
	{13, "13 Содан бас уәзір отырған орнынан тұрып, бар даусымен айқайлап яһудилердің тілінде былай деді: — Ұлы патша — Ассур патшасының сөзін тыңдаңдар!"},
	{14, "14 Патша мынаны айтады: Езекияның еліктіруіне алданбаңдар! Ол сендерді менің қолымнан құтқарып қала алмайды."},
	{15, "15 Езекияның Бізді Жаратқан Ие шүбәсіз құтқарады, осы қала Ассур патшасының қолына түспейді деп сендерді Жаратқан Иеге нандыруына жол бермеңдер!"},
	{16, "16 Езекияны тыңдамаңдар! Өйткені Ассур патшасы мынаны айтады: Менімен бітім жасап, қаладан шығып келіңдер! Сонда әркім өз жүзім бұтасы мен інжір ағашының жемісін жеп, өз құдығынан су ішетін болады."},
	{17, "17 Кейін мен мұнда қайтып келіп, сендерді осы елдерің сияқты басқа бір елге көшіремін. Онда нан мен жүзім шырыны, егіндіктер мен жүзімдіктер мол болады."},
	{18, "18 Тек Езекия Жаратқан Ие бізді құтқарады деп сендерді еліктірмесін! Әлде басқа халықтардың қандай да бір тәңірі өз елін Ассур патшасының қолынан құтқара алып па еді?!"},
	{19, "19 Хамат пен Арпадтың тәңірлері қайда? Сепар-Уаймның тәңірлері қайда? Әлде бірде-бір тәңір Самарияны менің қолымнан аман алып қала алды ма?"},
	{20, "20 Осы елдердің барлық тәңірлерінің қайсысы өз елін менің қолымнан құтқарып қалған еді? Ендеше Жаратқан Ие Иерусалимді менің қолымнан құтқарып алмақшы ма?!"},
	{21, "21 Ал халық еш жауап қайтармай, үндемей тұра берді. Себебі Езекия патша: Оған жауап қайырмаңдар! деген жарлық шығарған болатын."},
	{22, "22 Мұнан кейін сарай басқарушысы Хелкия ұлы Елиәкім, бас хатшы Себна және жылнамашы Асаф ұлы Жоғах Езекияға қайта оралды. Олар қатты күйзеліп үстеріндегі көйлектерінің өңірін айыра жыртып, патшаға Ассур патшасының бас уәзірінің сөздерін жеткізді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view37() {
struct kk37 poems[] = {
	{1, "1 Езекия патша осыларды естігенде қатты күйзеліп, көйлегінің өңірін айыра жыртты. Үстіне азалы киім киіп, Жаратқан Иенің киелі үйіне кіріп, Оған сиынды."},
	{2, "2 Содан кейін патша сарай басқарушысы Елиәкімге, хатшысы Себнаға және аға діни қызметкерлерге азалы киім кигізіп, оларды Амос ұлы Ишая пайғамбарға жіберді."},
	{3, "3 Олар пайғамбарға мына сәлемді жеткізді: — Езекия сізге былай дейді: Бүгінгі күн біз үшін азапқа, балағатқа, масқараға толы күн болып отыр! Толғатып отырғанымен баласын тууға тым әлсіз әйелдей бейшара күйдеміз."},
	{4, "4 Ассур патшасы мәңгі тірі Құдайды қорлауға өзінің бас уәзірін жіберді. Мүмкін, Құдайыңыз Жаратқан Ие осы сөздерді естіген соң, Ассур патшасын айтқандары үшін сөгіп ескертер. Сондықтан халықтың әлі де тірі қалғандары үшін Жаратқан Иеге мінажат етіңізші!"},
	{5, "5 Езекия патшаның нөкерлері оның сәлемін Ишаяға алып келгеннен кейін,"},
	{6, "6 пайғамбар оларға былай деп жауап берді: — Тақсыр иелеріңе былай деңдер: Жаратқан Ие мынаны айтады: Ассур патшасының нөкерлерінің Мені балағаттап айтқан сөздеріне бола қорықпа!"},
	{7, "7 Біліп ал, Мен оған (үрейін ұшыратын) рухты дарытамын; сонда ол бір суық хабар естіп, еліне қайтып кетеді. Оны өз елінде семсердің жүзінен өлтіртемін."},
	{8, "8 Осы аралықта ассурлық бас уәзір Ассур патшасының Лахыштан кеткенін біліп алды. Содан ол кері қайтып, патшаны Либна қаласына қарсы соғысып жатқан жерінен тапты."},
	{9, "9 Сол кезде Ассур патшасына Құштық патша Тирхақ сізге қарсы соғысуға аттанып келе жатыр деген хабар жетті. Мұны естіген Ассур патшасы Езекияға елшілерін жіберіп, оларға мына тапсырманы берді:"},
	{10, "10 Яһуда патшасы Езекияға былай деңдер: Өзің үміт артқан Құдайыңның сені Иерусалим Ассур патшасының қолына берілмейтін болады деп алдауына жол берме!"},
	{11, "11 Ассур патшаларының барлық елдерге не істегендерін естідің: оларды толығымен жойылуға бағыштады ғой! Ендеше сен аман қалар ма екенсің?!"},
	{12, "12 Әлде мына халықтардың тәңірлері: Ғозанның, Харанның, Ресефтің әрі Тел-Ассардағы Еденнің тәңірлері сол елдерді құтқарып қалды ма? Оларды менің аталарым құртқан жоқ па?!"},
	{13, "13 Хамат пен Арпадтың патшалары, Сепар-Уайм қаласының, Ена мен Ибахтың патшалары қайда екен?"},
	{14, "14 Езекия елшілердің алып келген хатын алып, оқып шыққаннан кейін Жаратқан Иенің киелі үйіне өрлеп барды. Сол жерде ол хатты Жаратқан Иенің алдында жайып салды."},
	{15, "15 Содан Езекия Жаратқан Иеге дұға етіп былай деді:"},
	{16, "16 Уа, Исраилдің Құдайы, Әлемнің Иесі! Керуб мүсіндерінің үстіндегі тағыңда отырған Сен жер бетіндегі күллі патшалықтардың үстінен қарайтын жалғыз Құдайсың! Көк пен жерді жаратқан да Сенсің!"},
	{17, "17 О, Жаратқан Ие, құлақ асып тыңдай гөр, уа, Иеміз, көз салып назар аудара гөр! Сеннахиримнің Сені, мәңгі тірі Құдайды, балағаттап айтқан барлық сөздеріне құлақ салшы!"},
	{18, "18 Уа, Жаратқан Ие, Ассурдың патшаларының сол халықтардың бәрін құртып, жерлерін қаңыратып бос қалдырғандары,"},
	{19, "19 олардың табынған тәңірлерін өртеп жібергендері рас. Алайда солар шынайы құдай емес, адам қолынан шыққан ағаш не тас мүсіндер ғана. Сондықтан да ассурлықтар оларды құртып жібере алды."},
	{20, "20 Ал енді, уа, Құдайымыз Жаратқан Ие, бізді сол адамның қолынан құтқара гөр. Сонда бүкіл дүниенің патшалықтары жалғыз Сенің Жаратқан Ие екеніңді білетін болады."},
	{21, "21 Амос ұлы Ишая пайғамбар сол кезде Езекияға мына хабарды жіберді: — Исраилдің Құдайы Жаратқан Ие мынаны айтады: Сен Маған Ассур патшасы Сеннахирим жайлы дұға еткендіктен,"},
	{22, "22 Мен, Жаратқан Ие, оған қарсы мына сөзді айттым: Маған бағышталған Сион қаласы сені менсінбей, келекелеп отыр! Иерусалим қаласы қашып кетіп бара жатқан сені мазақтап басын шайқайды!"},
	{23, "23 Сен кімді мазақтап, балағаттадың? Кімді дауыстап қорлап, кімге паңдана қарап тұрсың, соны білесің бе?! Маған, Исраилдің Киелі Құдайына қарсы солай істеп тұрсың!"},
	{24, "24 Сен өкілдерің арқылы Мені, Жасаған Иені, балағаттап, тағы былай деп паңдана мақтандың: Мен көптеген соғыс күймелеріммен таулардың зәулім бастарына, тіпті Ливанның ең алшақ баурайларына көтерілдім. Ең биік деген самырсын және ең таңдаулы қарағай ағаштарын шауып құлаттым, ең заңғар шыңдарға, ормандардың ең қалың түбіне дейін жеттім!"},
	{25, "25 Бөтен елдерде құдық қазып, суын іштім. Басқан табаныммен Мысырдың барлық өзендерін құрғатамын! деп те көкідің."},
	{26, "26 Сен осының барлығын Менің бұрыннан-ақ дайындап қойғанымды естімеп пе едің?! Енді Мен соны жүзеге асырдым. Содан да сен бекіністі қалалардың талқанын шығара алдың."},
	{27, "27 Осы себептен де сол елдердің халықтары дәрменсіз болып, абдырап, масқараға қалды. Олар даладағы отты шөп әрі жас өскін секілді нәзік, үй төбесіндегі өсіп шықпай жатып, күннің аптабынан солып қалатын шөпке ұқсас болды."},
	{28, "28 Ал сенің өзің туралы, қайда тұрып, қашан жолға шығып, қашан қайтып келіп, не істейтініңді Мен жақсы білемін. Маған өршелене қарсы шыққаныңды да білемін."},
	{29, "29 Сенің сол өршелене қарсы шыққаның әрі тәкаппарлығың құлағыма шалынды. Соныңа бола Мен енді мұрныңа мұрындық, аузыңа ауыздық саламын. Қай жолмен келген болсаң, сол жолмен сені өз жағыңа қайтарамын!"},
	{30, "30 Ей, Езекия, не болайын деп жатқанының белгісі мынау болады: биыл былтырғы шашылып қалған масақ дәндерінен өсіп шыққан астықпен күн көріп күнелтесіңдер. Келесі жылы да өздігінен өсіп шыққанды азық қыласыңдар. Бірақ одан кейінгі жылы тұқым сеуіп, астық орасыңдар, жүзімдіктер отырғызып, жемістерін жинап, жейсіңдер."},
	{31, "31 Яһуда халқының тірі қалғандары қайтадан терең тамыр жайып, өсіп-өнетін болады."},
	{32, "32 Себебі халқымның құтқарылып, тірі қалғандары Иерусалимдегі Сион тауынан өсіп шығатын болады. Әлемнің Иесі бұларды қайрат-жігерімен іске асырады."},
	{33, "33 Сондықтан Жаратқан Иенің Ассур патшасы туралы айтқаны мынау: Ол бұл қалаға кірмейді, оған бірде-бір жебе атпайтын да болады! Жасақшылары қалқан ұстап оған жақындамайды, тас-топырақтан үймек жасап, қамалынан өтпейді."},
	{34, "34 Ассур патшасы қай жолмен келсе, сол жолмен кері қайтып, осы қалаға кірмейтін болады. Мен, Жаратқан Ие, осыны нық айтамын."},
	{35, "35 Себебі Мен осы қаланы Өзім үшін және адал қызметшім Дәуіт үшін қорғап, құтқарамын!"},
	{36, "36 Сол кезде Жаратқан Иенің періштесі ассурлық әскердің қосына барып, ондағы бір жүз сексен бес мың адамды қырып кетті. Таң ата тірі қалғандары тұрып қараса, солардың бәрінің өліктері жатыр екен!"},
	{37, "37 Сонда Ассур патшасы Сеннахирим жолға шығып, еліне кері қайтып, астанасы Ниневиде тұрып қалды."},
	{38, "38 Бірде Сеннахирим Нисрох есімді жалған тәңірінің ғибадатханасында құлшылық етіп тұрған кезде оның ұлдары Адрам-Мәлік пен Сәресер оны семсермен шауып өлтірді. Содан екеуі Арарат еліне қашып кетті. Сеннахиримнің өзге ұлы Асардан әкесінің орнын басып патша болды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view38() {
struct kk38 poems[] = {
	{1, "1 Сол күндері Езекия қатты науқастанып, өлім аузында жатты. Амос ұлы Ишая пайғамбар оған келіп, былай деді: Жаратқан Ие мынаны айтады: Үй ішіңе соңғы өсиеттеріңді беріп, істеріңді аяқта! Себебі бұл аурудан жазылмай, қайтыс боласың."},
	{2, "2 Содан Езекия бетін қабырғаға қарай бұрып, Жаратқан Иеге сиынып:"},
	{3, "3 Уа, Жаратқан Ие! Сенің көз алдыңда ізгі жолыңмен жүріп, шын жүректен әділ істер істеп келгенімді ескере көрші! — деді. Мұнан кейін Езекия қатты жылады."},
	{4, "4 Сонда Жаратқан Ие Ишаяға сөзін арнап былай деді:"},
	{5, "5 Езекияға барып, былай де: Түп атаң Дәуіттің сиынған Құдайы Жаратқан Ие саған мынаны айтады: Сенің мінажатыңды естіп, көз жасыңды көрдім. Біліп ал, сенің өміріңе тағы он бес жыл қосамын."},
	{6, "6 Мен өзіңді және мына қаланы Ассур патшасының қолынан құтқарып, қаланы қорғап қаламын!"},
	{7, "7 Жаратқан Иенің Өзінің уәде еткенін іске асыратындығының саған арнаған белгісі мынау болмақ:"},
	{8, "8 Жаратқан Ие Ахаз патша салғызған баспалдақтың үстімен көлеңкені он қадам кері жылжытады. — Сонда көлеңке шынымен он қадам кері жылжыды!"},
	{9, "9 Яһуда патшасы Езекия науқасынан сауығып кеткеннен кейін (Жаратқан Иені мадақтаған мына жырын) жазып қалдырды."},
	{10, "10 Былай дедім: Өмірімнің ортасындамын, Бірақ енді о дүниеге аттанамын, Сөйтіп соңғы жылдарымнан ада қаламын!"},
	{11, "11 Осылай тіршілік әлемінде ешқашан Жаратқанның көз алдына бара алмаймын, Һәм адамдарды бұ дүниеде тұратын Енді қайтып еш көрмеймін деп ойладым."},
	{12, "12 Өмірім қойшының қосындай жиылады, Біржола өзімнен тартылып алынады. Сонда ғұмырым менің шиыршықталады, Әрі тоқылған матадай қиылады, Ымырт жабыла ол тез аяқталады."},
	{13, "13 Таң атқанға дейін мен төзіп шыдадым, Арыстан сүйегімді сындырғандай ауырдым, Ымыртта жанымды аласың деп ойладым."},
	{14, "14 Қарлығаш не шымшықтай шырылдадым, Гүрлеген көгершіндей аһыладым. Ұдайы аспанға қарап талды көзім, Азаптан мені құтқаршы, уа, Тәңірім!"},
	{15, "15 Енді не айтайын? Ол маған сөйледі: Иемнің Өзі маған мұны жіберді. Абайлап өткізем бар келер кезімді, Шеккен қасіретім мені ескертеді."},
	{16, "16 Уа, Ием, тәртібіңмен өмір кешемін, Жаңартылды осылайша рухым менің. Сен мені сауықтырып, өмір сүргіздің."},
	{17, "17 Зор қайғы шеккенім игі болды маған! Сен алып қалдың мені өлім аузынан, Күнәмді лақтырдың асыра арқаңнан."},
	{18, "18 Өлілер Сені мадақтамайтын шығар, Өлім де Саған мақтау айтпайтын болар, Дүние салғандар үміт артпайтын шығар,"},
	{19, "19 Саған шүкірлік айтады тек тірілері. Мен адалдығыңды мақтаймын бұл күндері, Балаларына ол жайлы айтады әкелері."},
	{20, "20 Жаратқан Ие мені сақтап қалды аман, Оның киелі үйінде біз шат-шадыман Ән-жыр айтамыз ішекті аспаппен әрқашан!"},
	{21, "21 Бұрынырақ Ишая пайғамбар патшаның қызметкерлеріне: Інжір жемістерінен шелпек алып келіңдер! — деп тапсырған болатын. — Соны шиқаның үстіне қойғаннан кейін патша айығып кетеді. —"},
	{22, "22 Сол кезде Езекия: Мен Жаратқан Иенің үйіне қайтадан көтеріліп бара алатыным жайлы алдын ала берілетін белгі не болады? — деп сұраған еді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view39() {
struct kk39 poems[] = {
	{1, "1 Сол кездері Бабыл патшасы Баладан ұлы Меродах-Баладан Езекия патшаның қатты ауырып қалып, сауықтырылғанын естіп, оған сәлемхаттары мен сыйлығын жіберді."},
	{2, "2 Езекия келген бабылдық елшілерді жылы қабылдап, оларға өзінің қазына қоймаларын: ондағы алтын-күмісін, дәмдеуіштері мен құнды иісмайларын, тіпті бүкіл қару-жарақ қоймасын да түгелдей көрсетті. Езекияның өз сарайы мен барлық патшалығында оларға көрсетпеген бағалы заттары қалмады."},
	{3, "3 Кейін Ишая пайғамбар Езекия патшаның алдына барып, оған: — Ана адамдар не деді, олар қайдан келді? — деген сауал қойды. Езекия: — Олар маған алыстағы елден келді, сонау Бабылдан, — деді. Пайғамбар:"},
	{4, "4 — Олар сарайыңыздан не көрді? — деп сұрағанда, Езекия: — Менің сарайымда не бар, соның бәрін көрді. Менің қазына қоймаларымда оларға көрсетпеген ештеңем қалған жоқ, — деп жауап берді."},
	{5, "5 Сонда Ишая Езекияға былай деді: — Енді Әлемнің Иесінің сөзін тыңдаңыз:"},
	{6, "6 Өз сарайыңдағы бар нәрсенің, ата-бабаларыңның осы кезге дейін жиған-тергендерінің барлығы да Бабылға әкетілетін күн туады. Мұнда ештеңе қалмайтын болады! — деп нық айтады Жаратқан Ие. —"},
	{7, "7 Өзіңнен тарайтын ұрпақтарыңның кейбіреулері де сол елге әкетіледі. Бабылдықтар оларды белінен айырып азбанқұл қылып, Бабыл патшасының сарай қызметшілері етіп қояды! —"},
	{8, "8 Сонда Езекия Ишаяға: — Сіз жеткізген Жаратқан Иенің сөзі жөн екен, — деді. Өйткені ол: Әйтсе де менің тірі кезімде тыныштық пен аман-есендік болады, — деп ойлады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view40() {
struct kk40 poems[] = {
	{1, "1 — Халқымды Менің жұбатыңдар, Көңілін оның орнықтырыңдар! — Дейді сендер сиынған Құдай Иең. —"},
	{2, "2 Иерусалимге жылы сөз айтыңдар, Мына хабарды оған жариялаңдар: Өтіп кетті басыңдағы ауыр кезең, Кінәңнің құны өтеліп, кешірілдің! Себебі Жаратқан Иенің қолы саған Бар күнәңнің жазасын берді молынан."},
	{3, "3 Жар салған дауыс шығады айдалада: Жаратқан Иеге жолды дайындаңдар! Құдайымызға арнап иен далада Түзу қылып даңғыл жолды салыңдар!"},
	{4, "4 Жолдағы сай-салалар толтырылсын, Әрі тау-төбелер аласартылсын, Бұралаң жерлері де түзетілсін, Ой-қырлары да түгелдей тегістелсін!"},
	{5, "5 Сонда Жаратқан Иенің ұлылығы Бар адамзатқа көрінетін болады, (Оның өз халқын құтқарып алғанын) Барлығы да ап-анық көре алады. Себебі Жаратқан Иенің Өзі Осы бұйрықтарды шығарған еді."},
	{6, "6 — Жар сал! — деп бір дауыс бұйырды. — Не туралы жариялайын? — деп сұрады хабаршы. — Күллі пенде атаулы көк шөп секілді! Бар салтанаты мен сенімділігі дала гүлдеріндей өткінші:"},
	{7, "7 Жаратқан Ие ыстық лебін үрлесе, шөп қурап, гүлдер солып қалады. Шынында халық сондай шөпке ұқсайды!"},
	{8, "8 Шөптер сарғайып қурап, гүлдер солады, ал Құдайымыздың сөзі мәңгі қалады."},
	{9, "9 — Ей, жақсы хабарды Сион халқына жеткізуші, биік тау басына шық! Иерусалимге ізгі хабарды әкелуші, бар даусыңмен айқай салып жарияла! Қорықпай Яһуданың қалаларына: Міне, Құдайларың! деп хабарла!"},
	{10, "10 Біліп алыңдар, Жаратушы Тәңір Ие жуырда зор құдіретімен келіп, билікті өз қолына алады. Жеңісінің олжасы мен сыйы Оның қасында: азат еткен халқы алдында жүреді."},
	{11, "11 Тәңір Ие оларды ізгі шопандай бағады: қозыларын қолына алып, кеудесіне басып көтеріп, саулықтарын жайлап алға бастап жүреді."},
	{12, "12 Кім теңізді алақанымен сарқып өлшеген, Аспанды қарысымен қамтып белгілеген? Кім жердің топырағын себетке салған, Тау-төбелерді де таразыға тартқан?"},
	{13, "13 Кім Жаратқанның ақыл-ойын ұққан, Кеңесшісі болып бағыт берді Оған?"},
	{14, "14 Жаратқан Ие кіммен ақылдасқан, Кім түсінік беріп те еді Оған? Кім Жаратушыны білімге үйреткен, Оған даналық жолын да нұсқаған?"},
	{15, "15 Қайта, бар халықтар судың шелектегі Тамшысындай ғана болып көрінеді, Таразыға қонған шаң-тозаң іспетті Олар да салмақсыз деп есептеледі. Құдай аралдарды түйіршік секілді Оп-оңай қолына алып көтереді."},
	{16, "16 Ливан тауындағы бар мал Тәңірге Арнап құрбандыққа шалынып, өртелсе, Олар да жеткілікті болмас еді! Ливан ормандары құрбандық отына Жетпей қалар да еді жағылуға."},
	{17, "17 Бар халықтар Жаратқанның алдында Онша маңызсыз болып саналады, Олар Құдай Иемен салыстырғанда Мүлдем жоқ, мағынасыз болып шығады."},
	{18, "18 Сонда Құдайды кімге теңейсіңдер, Қандай бейнеде елестетесіңдер?!"},
	{19, "19 Ұста болса, тәңір мүсінін қалыпқа құйып жасайды. Кейін зергер соны алтынмен қаптап, күмістен шынжыр бауларын дайындайды."},
	{20, "20 Ал кедейлер мұндай қымбат тартуды ұсына алмайды. Сондықтан олар шірімейтін қатты ағашты таңдап алып, жақсы шеберді де іздеп табады. Шебер сол ағаштан жалған тәңірдің бейнесін мүсіндеп, оны бір жерге қозғалмастай етіп орнатады."},
	{21, "21 Мынаны естіп, білмейтін бе едіңдер, әуел бастан-ақ ешкім оны сендерге айтпады ма? Жер жаратылғаннан бері мынаны түсінбейтін бе едіңдер:"},
	{22, "22 Жасаған Ие жер шарының үстіндегі тағында отыр! Жер бетіндегілер Оның алдында шегірткелердей кіп-кішкентай. Жаратқан Ие аспанды шымылдықтай жайып жібереді, оны шатырдай тігіп, Өзіне мекен етеді."},
	{23, "23 Құдай жердің әміршілерін түкке тұрғысыз етіп, осы дүниенің билеушілерін күшінен айырады."},
	{24, "24 Олар жуырда жерге себілген не отырғызылған, енді ғана тамыр жайған өсімдіктерге ұқсайды: Жаратқан Ие ыстық лебін үрлегенде солар бірден кеуіп, солып қалады. Содан қатты дауыл оларды қауыздай ұшырып әкетеді."},
	{25, "25 Сендер Мені кімге ұқсатасыңдар, Кіммен Мені салыстырасыңдар? — Деп сауал қояды Киелі Құдай."},
	{26, "26 Аспанға көз жіберіп қараңдаршы: Кім жаратты ондағы жұлдыздарды?! Бір-бірлеп алып шығып шоқжұлдыздарды, Ол әрқайсысын өз атымен шақырады. Жаратқанның құдіреті сонша зор болып, Біреуі шет қалмай, бәрі Оған бағынады."},
	{27, "27 Жақыптың әулеті, неге шағым айтасың, Исраил халқы, неге былай деп налисың: Жүрген жолым Жаратқаннан жасырынған, Мүддем Құдайымның назарынан тыс қалған!"},
	{28, "28 Сен мынаны естіп, білмеуші ме едің: Мәңгілік Құдай — сенің Жаратқан Иең, Шексіз зор даналығы Өзінің, Ол жаратты жердің түкпір-түкпірін! Ешқашан Құдай шаршап-шалдықпайды,"},
	{29, "29 Қалжырағанға Ол қуат сыйлайды, Қажып, шаршағанға күш табыстайды."},
	{30, "30 Жасөспірімдер әлсіреп шаршайды, Тіпті жігіттер де сүрініп құлайды,"},
	{31, "31 Ал сенім артқандар Жаратқан Иеге Жаңа күш-қуатты иемденеді де, Қырандай қанаттарын жайып кеңістікке Самғай жөнеледі, алайда талмайды, Жүре береді, бірақ еш болдырмайды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view41() {
struct kk41 poems[] = {
	{1, "1 Ей, теңіз жағалауларындағы елдер, тынышталып, алдыма келіңдер! Халықтар күш-қуат жинап, жақындап келсін де жауап берсін! Осылай даулы мәселені шешейік."},
	{2, "2 Кім шығыстан жеңімпаз қолбасшыны аттандырып, оны Өзіне қызмет етуге шақырды? Ол осы жеңімпаздың алдына халықтарды табыстап, солардың патшаларын да оған бағындырады, оның семсерімен халықтарды талқандап, садағымен қауыздай алысқа ұшырады."},
	{3, "3 Осы жеңімпаз өз аяғы бұрын баспаған жолдармен жауларын қуып, аман жүре береді."},
	{4, "4 Кім бұларды жоспарлап, жүзеге асырады? Кім болашақ дәуірлерді алдын ала жариялайды? Мұны істеуші Мен, Жаратқан Иемін! Алғашқы да, Соңғы да Өзіммін!"},
	{5, "5 Теңіз жағалауларындағы елдер байқап қалып, үрейлері ұшады. Жер бетінің қиыр шетіндегі халықтар қалтырап қорқады. Олар өзара бас қосып,"},
	{6, "6 әркім серігіне көмектесіп, бауырласына: Батыл бол, қорықпа! — дей береді. (Содан олар көптеп тәңір мүсіндерін жасайды:)"},
	{7, "7 ұста зергерді жігерлендіріп, балғамен қаңылтырды тегістеуші де төс ұратын серігін: Дәнекері жақсы, — деп қуаттайды. Олар осылай жасаған тәңірсымақтарын тұғырынан қозғалмас үшін шегемен бекітеді."},
	{8, "8 Ал сен, Исраил халқы — Менің қызметшім, Өзім таңдап алған Жақыптың үрім-бұтағы әрі жаныма жақын Ыбырайымнан тараған ұрпақ, сөзіме құлақ сал:"},
	{9, "9 Мен сені қиыр шеттен шақырып алып, жер бетінің түкпір-түкпірінен әкелгенмін. Менің қызметшімсің, сені таңдап алған едім, сенен бас тартпаймын да."},
	{10, "10 Қорықпа, Мен саған жар боламын, Абыржыма, Мен сенің Құдайыңмын! Саған қуат беріп көмектесемін, Жеңімпаз қолыммен сүйемелдеймін."},
	{11, "11 Саған өшіккендер ұятқа қалады, Жауларың дымы қалмай құртылады."},
	{12, "12 Іздесең де, еш таппайсың оларды, Сенімен соғысқандар жоқ болады."},
	{13, "13 Себебі Құдайың Жаратқан Иемін, Сені оң қолыңнан сүйемелдеймін. Қорықпа, Мен сені қолдап-қорғаймын Деп саған берік уәдемді беремін."},
	{14, "14 Құрт секілді дәрменсіз Жақып халқы, Исраилдің азғантай жұрты, Қорықпа, Мен сені қолдаймын! — Деп нық айтады Жаратқан Ие. Ол, Исраилдің Киелі Құдайы, сені туысқан қамқоршыдай азат етеді"},
	{15, "15 әрі былай дейді: Біліп ал, Мен сені астық бастыратын өткір тісті, жаңа тақтай сияқты қолданбақпын: тау-төбелерді бастырып, талқандап, қауызға айналдыратындай жеңімпаз боласың."},
	{16, "16 Жауларыңды жел ұшырып, дауыл айдап алып кеткендей жоқ қыласың. Сонда Маған шаттана қуанып, Исраил сиынған Киелі Құдаймен мақтанатын боласың."},
	{17, "17 Мына бейшара, мүсәпір халқым су іздеп, таба алмайды. Олар шөлдеп, таңдайлары кеуіп қалады. Ал Мен, Жаратқан Ие, мінажаттарына құлақ асамын. Мен, Исраил сиынған Құдай, оларды жалғыз қалдырмаймын;"},
	{18, "18 тақыр төбелер мен аңғарлар ортасынан қайнар көздерін ашып, бетпақ даланы көлге айналдырып, шөл даламен де бұлақтар ағызбақпын."},
	{19, "19 Мидай далаға балқарағай мен қараған, жасыл бұталар мен зәйтүн ағаштарын әрі құнарсыз, бос далаға қарағай, емен, шыршаларды бірге отырғызбақпын."},
	{20, "20 Сонда адамдар Жаратқан Иенің бұл кереметтерді өз құдіретті қолымен істегеніне көз жеткізеді. Олар осыларды Исраил сиынған Киелі Құдайдың жаратқанын түсінеді."},
	{21, "21 Жақып халқының Патшасы — Жаратқан Ие былай деп шақырады: Мәселені ортаға салыңдар! Ең мықты дәлелдеріңді келтіріңдер!"},
	{22, "22 (Жалған тәңірлеріңді) алып келіңдер, олар не болатынын алдын ала айтып берсін! Ақылмен байыптап, немен бітетінін ұғуымыз үшін бізге бұрынғы оқиғалардың мәнісін білдіріңдер немесе болашақ жайттарды паш етіңдер!"},
	{23, "23 Ей, тәңірсымақтар, келешекте не болатынын айтыңдар, шынайы құдай екендеріңе көз жеткіземіз. Иә, не жақсы, не жаман, әйтеуір бір кереметті жасаңдар! Оны көріп, бәріміз шошынатын боламыз."},
	{24, "24 Алайда шынайы емессіңдер, істерің де түкке тұрғысыз! Сендерді таңдап алып, құлшылық етуші әркім әбден жексұрын!"},
	{25, "25 Ал Мен солтүстіктен біреуді аттандырамын. Сол қолбасшы жуырда шығыстан шығып, Менің атымды жариялайтын болады. Ол билеушілерді батпақтай аяққа басып, құмырашының саз балшықты таптағанындай жермен-жексен қылады."},
	{26, "26 Ендеше, араларыңдағы кім бұл туралы басынан-ақ білдіріп, бізге алдын ала хабарлады? Егер біреу болған болса, онда оны шынайы дер едік. Ал іс жүзінде ешкім мұны білдірген жоқ, расында ешкім алдын ала хабарлаған да емес! Сендердің үндеріңді естіген бірде-бір жан жоқ."},
	{27, "27 Қайта, Өзім бірінші болып Сион қаласына: Қара, олар келе жатыр! дедім. Иә, Иерусалимге ізгі хабар жеткізушіні жіберген Өзіммін."},
	{28, "28 Көз салып, іздесем де, мұны істей алатын басқа ешкім болмады. Сол жалған тәңірлердің араларынан сауалдарыма жауап бере алатын бір кеңесші де табылмады!"},
	{29, "29 Көріп тұрсыңдар ма, сол тәңірсымақтардың бәрі де жалған: істегендері бекершілік және мүсіндері құр жел мен қиял іспетті түкке тұрғысыз!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view42() {
struct kk42 poems[] = {
	{1, "1 Міне, Менің қолдап жүрген Қызметшім, Жаным рақат табатын таңдаулым! Оған қондырдым Өзімнің Рухымды, Ол халықтарға жеткізбек әділ үкімді."},
	{2, "2 Қызметшім ақырмайды да айқайламайды, Оның даусы көшелерде шықпайды."},
	{3, "3 Ол майысқан таяқты сындырмайды, Бықсыған білтені де сөндірмейді, Шынында әділдікті орындайды."},
	{4, "4 Ол соны берік орнатқанша жер бетіне Күші тасып, алған бетінен қайтпайды. Алыс елдер үміт артар оның тәліміне."},
	{5, "5 Аспанды жайып жіберіп жаратқан, Жерді де өнімімен жайып тастаған, Адамдарға өмірдің лебін үрлеген, Жер басқанның бәріне тыныс берген Құдай Ие мынаны да айтқан:"},
	{6, "6 Сені әділдікпен Өзім шақырдым, Қолыңнан ұстап, қорғаймын, әрі қойдым Келісімнің кепілі болуға өз халқыма, Жол көрсеткіш Нұр да өзге ұлттарға."},
	{7, "7 Соқыр көзді ашып, тұтқынды түрмеден, Түнектегіні қапастан босату үшін Сені Мен, Тәңір Ие, жіберемін."},
	{8, "8 Жаратқан Иемін, бұл — Менің есімім. Даңқымды басқаға бере салмаймын, Жалған тәңірлермен оны бөліспеймін!"},
	{9, "9 Жүзеге асты бұрынғы айтқандарым, Енді жаңа жайттарды жариялаймын, Сендерге алдын ала хабарлаймын."},
	{10, "10 Иемізге жаңа әнді шырқаңдар, Жер шетінен Оған мақтау айтыңдар! Теңізде жүзіп жүрген теңізшілер, Жағалауларды мекендеген елдер,"},
	{11, "11 Шөлдала мен сол жақтағы қалалар Және қидарлықтар тұрған ауылдар, Бәрі Тәңірімізді дәріптесін! Села халқы да қуана дауыстасын, Тау бастарынан шырқап ән-жырларын,"},
	{12, "12 Жариялап Жаратқанның ұлылығын Бар аралдарда Оны мадақтасын!"},
	{13, "13 Иеміз күшті жауынгердей аттанады, Батырдай қайрат-жігер танытады, Даусын көтеріп ұранын салады, Жауларының бәрін жеңіп шығады!"},
	{14, "14 Мен ұзақ уақыт үнсіз болған едім, Өзімді сабырлықпен ұстап келдім, Ал қазір толғақ қысқан әйелге ұқсап Ентіге айқайлап, ашуымды төгем!"},
	{15, "15 Тау-төбені ойрандап, бос қалдырамын, Өсімдік атаулысын қуратамын, Өзендерді құрлыққа айналдырып, Көлдерді де кептіріп құрғатамын."},
	{16, "16 Шындықты көрмейтін халқымды Менің Өзі білмейтін жолмен жетелеймін, Бейтаныс жолдармен бастап алып жүріп, Түнекті алдынан нұрға айналдырамын, Қисық жолдардың бәрін түзетемін. Халқым үшін осыларды жасаймын, Ешқашан оны жалғыз қалдырмаймын!"},
	{17, "17 Ал табынғандар жалған тәңірлерге Қоладан құйылған мүсіндеріне: Құдайымыз сенсің деп бас ұрады, Содан беттері күйіп масқара болады!"},
	{18, "18 Ей, рухани саңыраулар, құлақ асыңдар, көкірегі соқырлар, көздеріңді ашып, қараңдар!"},
	{19, "19 Кім өз хабаршым Исраил халқы сияқты саңырау, кім осы қызметшімдей рухани соқыр?! Менімен Келісім жасаған осы халықтай шындықты көрмейтін біреу бар ма?! Жаратқан Иенің қызметшісі деп аталған Исраилдей сөзімді естімейтін кім бар?!"},
	{20, "20 Расында сен көпті көрген едің, бірақ ештеңені ұқпайсың, құлақтарың естіген еді, бірақ тыңдамайсың!"},
	{21, "21 Жаратқан Ие өз әділдігіне сай Таурат заңы мен тәлімін дәріптелуге лайық әрі тамаша етіп шығаруды жөн көрген еді."},
	{22, "22 Алайда бұл халық тоналып, талан-таражға ұшырады. Бәрі тұтқындалып, құлдыққа түсті. Олжа болған оларды құтқаратын біреу де жоқ. Ешкім: Талан-таражға түскен осы халықты қайтарып бер! деп талап етпейді."},
	{23, "23 Араларыңдағы қайсың осыларды тыңдайсыңдар? Қайсың байыбына барасыңдар?"},
	{24, "24 Кім Исраил халқын тонаушылардың қолдарына тапсырып, талан-таражға қалдырды? Мұны істеген Жаратқан Иенің Өзі емес пе?! Себебі біздер Жаратқан Иеге қарсы күнә жасай бердік. Ата-бабаларымыз да Оның жолымен жүргілері келмей, Таурат заңы мен тәліміне бағынбай қойды."},
	{25, "25 Сондықтан Тәңір Ие оларға қайнаған қаһарын төгіп, сұрапыл соғыс жіберді. Бірақ олар Құдайдың лаулаған қаһарына ұшыраса да, соның себебін ұқпады! Тіпті жалыны жалмағанмен, олар мұны көңілдеріне түймеді!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view43() {
struct kk43 poems[] = {
	{1, "1 Ал енді, Жақыптың үрім-бұтағы, Исраил халқы, сені жаратып қалыптастырған Тәңір Ие мынаны айтады: Қорықпа, Мен сені құныңды төлеп құтқарып алдым. Сені өз атыңмен шақырдым: Сен Мендіксің!"},
	{2, "2 Судан өткен кезіңде саған жар боламын, өзендерден өткенде батып кетпейсің. Отты жарып өтсең, күйіп қалмайсың, тіпті жалыны да шарпымайды."},
	{3, "3 Себебі Мен сенің Құдайың Жаратқан Иемін, Мен, Исраил сиынған Киелі Құдай, Құтқарушыңмын! Сенің құның үшін Мысырды беріп, Құш пен Себаны да төлемің еттім."},
	{4, "4 Мен үшін аса қымбат, қадірлісің, сені сондай қатты сүйемін! Сенің орныңа көп адамды қиып, өмірің үшін халықтарды төлем етемін."},
	{5, "5 Қорықпа, Мен саған жар боламын, ұрпақтарыңды шығыстан алып келемін, батыс елдерінен де сені жинаймын."},
	{6, "6 Солтүстіктегі халықтарға: Босатып жіберіңдер! — деп, оңтүстіктегілерге де: Жолынан қалдырмаңдар! — деп бұйырамын. Рухани ұл-қыздарымды алыстан, тіпті жердің қиыр шетінен де алып келіңдер!"},
	{7, "7 Мен салтанатты ұлылығымды паш ету үшін жаратып, қалыптастырып жасаған, әрі өз атыммен атаған олардың барлығын да алып келіңдер!"},
	{8, "8 Көзі болса да көрмейтін, құлағы болса да естімейтін халқымды құлдықтан алып шығыңдар!"},
	{9, "9 Жалған тәңірлерге табынатын ұлттар жиналып, барлық халықтар бас қоссын! Араларындағы кім (Исраилдің құтқарылуын) алдын ала жариялап, өтіп кеткен оқиғаларды да білдіре алды? Олар айғақтарын шығарып, өздерінің дұрыстығын дәлелдесін! Осылай айтқандарының шынайылығы айқын көрінсін."},
	{10, "10 Ал сендер Мен туралы шындықты паш етуге тиіссіңдер, ей, Исраил халқы! — дейді Жаратқан Ие. — Мені жақыннан танып, Маған сеніп, кім екенімді ұғынуларың үшін таңдап алған қызметшімсіңдер. Менен бұрын болған да, кейін бола алатын да ешқандай құдай жоқ!"},
	{11, "11 Мен Жаратқан Иемін, Менен басқа Құтқарушы жоқ!"},
	{12, "12 Болашақтағы жайттарды алдын ала білдіріп, сендерді жаудан құтқарып, мұны жариялаған Өзіммін. (Бұларды істеген) бөгде бір тәңірлерің жоқ. Сондықтан сендер Мен туралы шындықты паш етуге тиіссіңдер! — деп ескертеді Жаратқан Ие. — Жалғыз Құдай Менмін,"},
	{13, "13 мәңгі Сол болып келемін! Менің қолымнан құтқара алатын ешкім жоқ. Менің істегендерімді кім бұрынғы қалпына келтіре алады?!"},
	{14, "14 Сендерді құтқарушы Қамқоршыларың, Исраил сиынған Киелі Құдай, мынаны айтады: Сендер үшін Мен Бабылға (жау әскерін) жіберемін. Осылай Бабылдың барлық тұрғындарын, араларындағы халдейлерді де, бұрын даурыға мақтан тұтқан кемелеріне мінгізіп, қашып кетуге мәжбүрлеймін."},
	{15, "15 Мен Киелі Құдайларың Жасаған Иемін, ей, Исраил халқы, Мен сендердің Жаратушы әрі Патшаларыңмын!"},
	{16, "16 Баяғыда Жаратқан Ие ата-бабаларымыз үшін теңіздің аласұрған суларынан өтетін жол салған болатын. Жаудың соғыс күймелерін, аттарын және мықты әскер күштерін Мысырдан ала шыққан еді. Олар бәрі бірдей жер құшып, қайтып тұрмайтын болды, сөнген шырақтай өмірлері өшті. Бүгінде Жаратқан Ие мынаны айтады:"},
	{17, "18 Естеріңе бұрынғыны алмаңдар, Бұдан былай баяғыны ойламаңдар!"},
	{18, "19 Енді Мен жаңаны жасаймын да, Қазір ол шыққалы тұр жарыққа, Сендер мұны ұғынбайсыңдар ма? Міне, Мен иен далада жол саламын, Шөл даладан бұлақтар ағызамын."},
	{19, "20 Таңдап алған халқымды сумен қамтып Құла түзден өзендер ағызамын. Шибөрі, түйеқұс, дала аңдары Содан Мені дәріптейтін болады."},
	{20, "21 Өзім үшін жаратқан халқым Менің Ұлылығымды мақтап жариялайды."},
	{21, "22 Алайда сендер, Жақыптың ұрпақтары, атымды атап Маған сиынып келген жоқсыңдар! Қайта, ей, Исраил халқы, Менен қажып шаршап жүр екенсіңдер!"},
	{22, "23 Өзіме арнап көптеп тоқтыларды шалып, өртеген жоқсыңдар. Маған басқа да сый-тартуларыңмен лайықты қадір-құрмет көрсетпедіңдер! Мен астық тартуларыңды көптеп ұсыныңдар деп сендерді қинаған да жоқпын, хош иісті заттарды молынан түтетіңдер деп ауыртпалық түсірген де емеспін."},
	{23, "24 Сендер Маған арнап түтетілетін хош иісті құрақты сатып алған жоқсыңдар, құрбандық майын да Маған жомарттықпен ұсынбадыңдар. Керісінше, сендер Мені күнәларыңмен қинап, әділетсіз істеріңмен Маған ауыртпалық арттыңдар!"},
	{24, "25 Алайда Мен өз еркіме сай қылмыстарыңды өшіріп тастаймын! Енді қайтып ешқашан да күнәларыңды есіме алмаймын!"},
	{25, "26 Енді даулы мәселені талқыға салайық: жасаған жақсылықтарыңды есіме түсіріңдер, ақталуларың үшін істеріңді ашық көрсетіңдер!"},
	{26, "27 Сендер тараған түп аталарың да күнә жасаған еді, арада жүрген өкілдерің де тура жолымнан тайып кетті."},
	{27, "28 Сондықтан Мен оларды, киелі үйдің басшыларын, абыройларын төгіп ұятқа қалдырамын! Сонымен қатар Жақыптың ұрпақтары, Исраил халқын, қарғысқа ұшыратып қор қыламын!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view44() {
struct kk44 poems[] = {
	{1, "1 Ал енді, тыңда, Жақыптың үрім-бұтағы, қызметшім Менің! Маған құлақ сал, таңдап алған Исраил халқым!"},
	{2, "2 Ана құрсағында сені қалыптастырып жаратқан Қолдаушың, Мен, Жаратқан Ие, саған былай деймін: Қорықпа, Жақыптың үрім-бұтағы, қызметшім Менің, Өзім таңдап алған әділ халқым!"},
	{3, "3 Мен шөлдеген жерді суға кенелтіп, кеуіп қалған далаға суды тасқындатып ағызамын. Ұрпақтарыңның үстіне Рухымды құйып, оларға жарылқауымды жаудыра беремін."},
	{4, "4 Олар жайлаудың шөбіндей көктеп, өзен жағасындағы теректей өсіп-өне береді."},
	{5, "5 Сол кезде көптеген адамдар Менің халқыма қосылып, біреулер: Жаратқан Иенікімін деп хабарлап, өзгелері мұны өз қолдарына жазып та алады. Олар Жақыптың есімімен, иә, халқымның қадірлі түп атасы Исраилдің атымен, атанатын болады."},
	{6, "6 Жаратқан Ие — Исраилдің Патшасы мен азат еткен Қамқоршысы әрі Әлемнің Иесі мынаны айтады: Алғашқы да, Соңғы да Менмін, Менен өзге (шынайы) құдай жоқ!"},
	{7, "7 Әлде Мен сияқты біреу бар ма? Сол өзін әйгілеп, дәлелдерін Менің алдымда ашық келтірсін: ол Мен халқымды жаратып, еліне орналастырған ежелгі кезден бері не болып келгенін және келешекте не болатынын рет-ретімен айтып берсін! Содан кейінгі жайттарды да ашық мәлімдесін!"},
	{8, "8 Ей, халқым, қорықпаңдар, үрейлерің де ұшпасын! Мен бұрыннан-ақ сендерге болашақтағыны алдын ала жариялап келдім емес пе? Мен туралы шындықты мойындаңдар: Менен өзге құдай бар ма? Менен басқа қорғандарың жоқ, Маған біреуі де мәлім емес!"},
	{9, "9 Жалған тәңірлердің мүсіндерін жасаушылардың бәрі де дәрменсіз! Олар өз тәңірсымақтарын соншалықты ұнатып, бағалағанмен, соларынан ешқандай пайда көрмейді. Өздері бұған куә! Мүсіндері көре алмайды да, ештеңені ұқпайды да, сондықтан олар масқара болады."},
	{10, "10 Ешбір пайдасы жоқ қуыршақ тәңірлерді жасап, мүсіндерін құйып қалыптастыратындар кімдер?"},
	{11, "11 Сондайлар ұятқа қалатын болады! Мүсіндерді жасайтын зергерлер жай пенделер ғана. Олар бәрі жиналып, алдымда тұрсын! Сонда үрейлері ұшып, барлығы масқара болады."},
	{12, "12 Ұста сом темірден мүсіннің тұлғасын жасап, оны отпен шыңдайды. Мұнан кейін мықты қолына балғасын алып, тұлғаны ұрғылап, қуыршақ тәңірді қалыптастырады. Содан қарны ашып, әлсіреп, су ішпегеннен шаршап-шалдығады."},
	{13, "13 Ағаш шебері (қатты ағаш таңдап алып), жіп тартып өлшеп, қашаумен мүсіннің сұлбасын белгілейді. Оны кескішпен өңдеп, жұмырлап, адамның келбетті бейнесін жасайды. Содан оны жалған тәңірдің ғибадатханасына апарып қояды."},
	{14, "14 Бұл жұмыс үшін самырсынды, я болмаса қарағай не еменді кесіп алады. Оларды ормандағы ағаштардың арасынан таңдап алып, сақтап қойған болатын. Немесе шырша отырғызған еді, ол жауған жаңбырмен өсті."},
	{15, "15 Енді сол ағашты адам отын етеді. Бір бөлігін отқа жағып, жылынса, басқасымен нан пісіреді. Ал қалған ағаштан қуыршақ тәңірін ойып мүсіндеп, соған иіліп табынады! Адамдар жай мүсін жасап алып, оның алдына жерге жығылып құлшылық етеді!"},
	{16, "16 Олар ағаштың бір бөлігін отқа жағып, үстіне тамақ пісіріп, тағы бір бөлігімен ет қуырып, тойғанынша жеген еді ғой! Сондай-ақ отқа жылынып: Ой, бәрекелді, оттың қызуы керемет екен! — деп риза болды."},
	{17, "17 Ал ағаштың қалғанынан тәңір мүсінін ойып жасап, оған: Мені құтқара гөр, сен тәңірімсің ғой! — деп жалбарынып, иіліп табынады."},
	{18, "18 Бұлай істейтіндер шындықты білмейді де, ұқпайды да. Олардың көздері балшықпен сыланғандай жұмылған, ақыл-саналары ұғына алмастай тас жабылған."},
	{19, "19 Ешқайсысы бұларына ой жібермейді, оларда қажетті білім мен түсінік жоқ. Сол себептен: Мен жартысын отқа жағып, қоламтасына нан пісіріп, ет қуырып та жедім. Ал қалдығынан жексұрын тәңір мүсінін жасап, сол бір ағаш кесегіне табынғаным қалай?! — демейді."},
	{20, "20 Керісінше, күлге айналатын нәрсені қанағат тұтады! Алданған саналары сондай адамдарды адастырады. Олар өз жандарын құтқара алмайды. Оң қолымдағы осы нәрсе жалған емес пе?! — деген қорытынды шығармайды."},
	{21, "21 Жақыптың үрім-бұтағы, Өзімнің қызметшім, Осыларды ескеріңдер, ей, Исраил халқым: Сені Өзіме қызмет ету үшін жараттым, Мен ешқашан да сені есімнен шығармаймын!"},
	{22, "22 Әділетсіз істеріңді тұмандай сейілттім, Күнәларыңды жел айдаған бұлттай жоқ еттім, Енді теріс жолыңнан қайтып, бет бұр Өзіме! Мен қамқоршың болып құтқарып, кешірдім!"},
	{23, "23 Аспан, мұны істеген Тәңірді әнмен мадақта, Жер, сен де Оны дәріптеп шаттана айқайла, Шуылдап мақтаңдар, таулар, орман ағаштары да: Жаратқан Жақыптың әулетін құтқарып алды, Өз ұлылығын Ол Исраилде жар қылды!"},
	{24, "24 Сені ана құрсағында қалыптастырған, әрі туысқан қамқоршыңдай құтқарып алған Жаратқан Ие мынаны айтады: — Мен, Жасаған Ие, бүкіл әлемді жараттым. Жалғыз Өзім аспан кеңістігін жайып жіберіп, өз құдіретіммен жер бетін де жайып тастадым."},
	{25, "25 Жалған пайғамбарлардың болжамдарын жоққа шығарамын, сәуегейлердің есалаңдығын да әшкерелеймін. Мен данасынғандарды абыржытып, білімдерінің ақымақтық екенін көрсетемін!"},
	{26, "26 Бірақ Өзімнің қызметшімнің сөздерін іске асырып, пайғамбарларымның айтқандарын орындаймын. Мен Иерусалимге: Жұрт сені қайтадан мекендейді! деп уәде етіп, Яһуда елінің өзге қалаларына да: Жаңадан салынасыңдар! деймін. Иерусалимнің қираған ғимараттарын қайта қалпына келтіремін!"},
	{27, "27 Ежелде терең теңізге: Кеуіп қал, ағыстарыңды кептіріп тастаймын! деп бұйрық берген де Өзіммін."},
	{28, "28 Енді Кир туралы алдын ала былай деймін: Ол — Маған қызмет ететін бағушы, Менің еркімді түгелдей орындаушы. Кир Иерусалим қайта салынсын! деген жарлық шығарып, ғибадатхананың да негізін қайтадан салғызатын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view45() {
struct kk45 poems[] = {
	{1, "1 Мен, Жаратқан Ие, Өзім тағайындаған Кир патшаны оң қолынан сүйемелдеп, оған халықтарды бағындырамын. Оның алдынан есіктерін ашып, қала қақпаларын жапқызбау үшін елдердің патшаларының сауыт-саймандарын шештіріп тастаймын. Кир патшаға былай деймін:"},
	{2, "2 Мен алдыңда жүріп отырып, жолыңдағы тау-төбедей кедергілерді тып-типыл етіп тегістеймін. Мықты қола қақпаларды быт-шыт қылып, темір ысырмаларын да сындырамын."},
	{3, "3 Қараңғы жерлерде сақталған қазыналарды, жасырын орындарда жатқан байлықтарды саған табыс етемін. Осылай Менің кім екенімді білетін боласың: сені атыңды атап Өзіме қызмет етуге шақырған Жаратқан Иемін, Исраилдің Құдайымын!"},
	{4, "4 Өзімді әлі білмеген кезіңде-ақ сені атыңды атап шақырып, жоғары лауазымға тағайындаймын. Мұны өз қызметшім үшін, Жақыптың үрім-бұтағы, таңдап алған Исраил халқым үшін істеймін."},
	{5, "5 Мен Жаратқан Иемін, жалғыз Құдаймын, Менен өзге құдай жоқ! Өзімді білмесең де, Мен сені күшті қыламын."},
	{6, "6 Шығыстан батысқа дейінгі аралықтағы адамдардың бәрі Менен өзге бірде-бір құдай жоқ екеніне көз жеткізсін! Мен Жаратқан Иемін, жалғыз Құдаймын."},
	{7, "7 Жарықты да, қараңғылықты да Мен жараттым, не амандық орнатып, не апат жіберемін. Мен, Жаратқан Ие, мұның бәрін істеймін."},
	{8, "8 Аспаннан әділдік жауып, жерден құтқарылу шығып, екеуі де бірге өсіп-өне берсін! Мен, Жасаған Ие, бұларды жараттым."},
	{9, "9 Өзін жаратқан Құдайды сынап, шағым айтқан пенде қасіретке қалады! Ол саздан жасалған ыдыстың сынығына ұқсайды. Әлде саз балшықтың құмырашыны: Не істеп отырсың? — деп сынауына бола ма? Немесе өзің жасап жатқан бұйымыңның сен туралы: Қолынан түк келмейді, — деп наразылық білдіруіне қақысы бар ма?!"},
	{10, "10 Әкесіне: Мені неге дүниеге келтірдіңіз? — шешесіне: Неге мені тудыңыз? — деген әркім де қасіретке ұшырайды!"},
	{11, "11 Исраил халқы сиынған Киелі Құдай, оны жаратқан Тәңір Ие, тағы мынаны айтады: Сендер Маған болашақтағы жайттар туралы сұрақ қоясыңдар ма?! Рухани балаларым және қолымнан шыққан істерім жөнінде бұйрық бересіңдер ме?!"},
	{12, "12 Жерді және оның үстіндегі адамдарды жаратқан Менмін! Өз қолыммен аспан кеңістігін жайып жіберіп, барлық аспан денелерін өз бұйрығыммен орналастырдым және бақылаймын да."},
	{13, "13 Мен Кирді әділдікпен тағайындап, барлық жүретін жолдарын тегістеймін. Ол Менің таңдаған қаламды қайтадан салғызып, тұтқындарымды ешбір төлемсіз, парасыз-ақ босатып жіберетін болады. — Әлемнің Иесі осыларды нық айтады."},
	{14, "14 Жаратқан Ие таңдаған халқына мынаны да айтады: Мысырдың жасап шығарған заттары және Құштың саудадан тапқан табыстары сенікі болмақ. Себаның бойшаң адамдары да сенің жағыңа өтіп, меншігіңе айналады. Олар шынжырланған күйде артыңнан еріп, құрмет көрсете алдыңа жығылып: Расында да Құдай тек саған жар болып жүр, Одан басқа шынайы құдай жоқ! деп мойынсұнатын болады."},
	{15, "15 Уа, Жаратқан Ие, шынымен Сен Өзіңді жасыратын Құдайсың, Исраилдің сиынған Құдайы әрі Құтқарушысысың!"},
	{16, "16 Тәңірлердің мүсіндерін жасайтындар қорланып, масқара болады. Олар бәрі бірдей ұятқа қалады."},
	{17, "17 Ал Жаратқан Ие Исраил халқын құтқарып, ұдайы қорғап-қолдайды. Содан оларға: Енді қайтып қорланбайсыңдар, мәңгі масқара болмайсыңдар! — делінеді."},
	{18, "18 Аспанды жасаған Жаратқан Ие — шынайы Құдай. Ол жерді де қалыптастырып, нығайтты. Оны ретсіз, бос тұру үшін емес, мекендеу үшін жаратты. Құдай былай дейді: Мен Жаратқан Иемін, Менен өзге құдай жоқ!"},
	{19, "19 Мен көзден таса, қараңғы жерден құпиялап сыбырлаған емеспін, әрі Жақыптың ұрпақтарынан Өзіме бекерге бет бұрып, бой ұсынуын талап етпедім. Қайта, Мен, Жаратқан Ие, нағыз шындықты айтамын және анық паш етемін."},
	{20, "20 Ей, басқа ұлттардың жойылудан қашып құтылғандары, бәрің де жиналып, қасыма жақындаңдар! Ағаштан жасалған тәңір мүсінін көтеріп алып жүрушілер, өздерін құтқара алмайтын тәңірсымаққа сиынушылар қандай аңқаулар!"},
	{21, "21 Енді өзара ақылдасып, күшті дәлелдеріңді келтіріңдер: Кім бұл жайттарды баяғыдан бері жария етті? Оларды алдын ала айтқан кім? Мен, Жаратқан Ие, емес пе едім? Жалғыз Мен ғана әділ Құдай әрі Құтқарушымын. Менен өзге құдай болған емес, болмайды да!"},
	{22, "22 Ей, жердің түкпір-түкпіріндегілер, Маған бет бұрыңдар, сонда құтқарыласыңдар. Жалғыз Құдай Менмін, өзге құдай жоқ!"},
	{23, "23 Аузымнан тек шындық шығады, Мен сөзімнен қайтпаймын. Өз атыммен былай деп ант етемін: Менің алдымда әрбір адам тізе бүгіп, тіл біткен әр пенде Маған ант беріп бағынып:"},
	{24, "24 Әділдік пен құдірет тек Жаратқан Иеде! деп мойындайтын болады. Жаратқан Иеге ашуланғандардың бәрі Оның алдына келіп, өкініп ұялады."},
	{25, "25 Сонда Жаратқан Ие Исраилдің бүкіл үрім-бұтағын ақтап, олар Оны мақтан тұтатын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view46() {
struct kk46 poems[] = {
	{1, "1 Бел тізе бүгіп, Небо да иіледі. Осы жалған тәңірлердің мүсіндері малдарға тиеліп, әкетіледі. Бұларды салтанатпен көтеріп жүретінсіңдер. Салмағы зілдей олар — шаршаған көліктерге ауыртпалық."},
	{2, "2 Осылайша жалған тәңірлердің бәрі бірдей тізе бүгіп, құлайды. Олар ауыр мүсіндерін қорғай алмайды, қайта, өздері де тұтқынға түседі!"},
	{3, "3 Тыңдаңдар Мені, ей, Жақыптың ұрпақтары, сөзіме құлақ салыңдар, ей, Исраил халқының тірі қалғандары! Сендерді туғаннан-ақ қолдап келіп, өмір бойы көтеріп те жүремін."},
	{4, "4 Сендер қартайған шақта да Мен өзгермеймін, шаштарың ағарған кезде де қолдай беремін. Сендерді жаратқан едім, бұдан былай да көтеріп жүремін. Мен ауыртпалықтарыңа төзіп, құтқарып қорғай беремін."},
	{5, "5 Мені кіммен салыстырып, кімге ұқсатасыңдар? Яки Мені кіммен теңестіресіңдер?"},
	{6, "6 Адамдар таразыға күміс өлшеп, соған шебер зергерді жалдап алады. Қалталарынан мол алтын төгіп беріп, содан тәңір мүсінін жасатқызады. Осы қуыршақ тәңірге бас иіп, оның алдына етпетінен жығыла табынады!"},
	{7, "7 Оны иықтарына көтеріп алып жүріп, арнайы жерге қояды. Мүсін сол жерде әрдайым тұра беріп, орнынан қозғала да алмайды. Жұрт оған қанша айқайлап, жалынып-жалбарынса да, ол ешқандай жауап бере алмайды да, пәледен құтқара алмайды да."},
	{8, "8 Сонымен, ей, жолдан тайғандар, бұл жайттарды естеріңде берік сақтап, көңілдеріңе түйіп алыңдар!"},
	{9, "9 Баяғыда болғандарды да ұмытпаңдар! Жалғыз Мен ғана шынайы Құдаймын, Менен өзге құдай жоқ, Маған ұқсас ешкім де болмайды!"},
	{10, "10 Ақырғы жайттарды әуел бастан-ақ және әлі істелмеген істерді баяғыдан-ақ алдын ала білдіріп келемін. Мен мақсатымды орындап, Өзіме ұнайтындарды іске асыратын боламын деп уәде беремін."},
	{11, "11 Шығыстағы алыс елден біреуді шақырып, алып келемін. Ол жауларына қырғидай тиіп, мақсатымды белсене орындайды. Мен айтқанымды еш шүбәсіз жүзеге асырамын, солай шешкен соң оны орындаймын!"},
	{12, "12 Ей, жүректері қасарысқандар, әділдіктен қашық жүргендер, айтқандарыма құлақ түріңдер!"},
	{13, "13 Мен осы жерде әділдігімді жүзеге асыратын боламын. Ол алыс емес, жақындап қалды, Менің құтқаруым кешікпейді! Мен Сион шаһарын азат етемін, бүкіл Исраил елін салтанатты ұлылығыма бөлейтін боламын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view47() {
struct kk47 poems[] = {
	{1, "1 Тағыңнан түсіп, топыраққа отыр, ей, Бабыл қаласы! Халдей халқының астанасы, сен ханша сияқты ешкімге бағынбаған едің. Ал енді тақыр жерде отыра бер! Бұдан былай сені ақсаусақ, нәзік деп атамайды."},
	{2, "2 Қайта, диірменді қолға алып, тарта бер! (Бағынышты күңге айналған сен) бет пердеңді шеш! Етегіңді түріп, балтырыңды көрсетіп өзендерді кешіп өте бер!"},
	{3, "3 Сонда тәнің ашылып, жұрт ұятыңды көреді. Осылай сені еш аямай жазалаймын! (— дейді Жаратқан Ие.)"},
	{4, "4 Бізді құтқаратын қамқоршымыздың есімі — Әлемнің Иесі, Ол — Исраилдің Киелі Құдайы!"},
	{5, "5 Ей, Бабыл, халдей халқының астанасы, қараңғы жерге барып, үніңді шығармай отыр! Сені енді қайтып патшалықтарға билік жүргізетін ханым деп атамайтын болады."},
	{6, "6 Мен меншікті халқыма қаһарымды төгіп, оны сенің қолыңа түсіріп, қорлыққа салдым. Ал сен мейрімділік танытпай, оның қарттарына да тым ауыр жүк артып қойдың!"},
	{7, "7 Сен мәңгілік патшайым боламын деп, Менің халқымның шеккен азабына көңіл бөлмедің. Мұның ақырының не боларын ойламадың да."},
	{8, "8 Рақатқа батып, бейқам тұрып жатырсың. Әлемде тек мен ғана маңыздымын, мендей ешкім жоқ! Ешқашан жесірдей жалғыз қалмаймын, тұрғындарымнан еш айырылмаймын! деп мақтанасың. Ал енді, мынаған жақсылап құлақ сал:"},
	{9, "9 Бір күннің ішінде, табан астынан, екеуі де басыңа түсіп, тұрғындарыңнан айырылып, жесірдей жалғыз қаласың! Осы екі қасіретке де ұшырайсың! Сен сиқыршылыққа иланып, бақсылықпен де соншама көп айналысып келсең де, бәрібір сол пәледен амал тауып құтыла алмайсың."},
	{10, "10 Жауыздығыңа кәміл сеніп: Қылықтарымды ешкім көрмейді, дейсің. Сені (жалған) даналығың мен білімің еліктіріп тура жолдан адастырды. Әлемде тек мен ғана маңыздымын, мендей ешкім жоқ! деп паңданасың."},
	{11, "11 Алайда басыңа апат төніп, оның қайдан келетінін әлі білмейсің. Сонда тас-талқан болып қирайсың, ал одан амал тауып құтыла алмайсың. Кенеттен сен еш ойламаған қырғынға ұшырайсың!"},
	{12, "12 Сонымен (Құдайға бағынбаған сен, мейлі) жас кезіңнен айналысып келген әр түрлі бақсылық, сиқырлығыңмен бұдан былай да шұғылдана бер. Мүмкін, олардан саған пайда тиер, мүмкін, тіпті жауыңа үрей туғызар? Керісінше,"},
	{13, "13 көп ақыл-кеңес сұрап қажығандайсың. Аспанды бақылап, жұлдыздарды санаушыларың, жаңа ай туған сайын жорамал жасайтындар, енді алға шығып ақылдарын айтсын, сені басыңа төнген апаттан құтқарып алсын!"},
	{14, "14 Бірақ олардың өздері өртеніп жатқан сабанға ұқсайды. Жалмаған өрттен өз бастарын да құтқара алмайды. Бұл қасында жай жылынып отыратын көмір оты емес, ол Құдайдың қаһарының лаулаған жалыны!"},
	{15, "15 Ал жас кезіңнен бері сенімен бірлесіп саудамен айналысқандардың саған істейтіндері мынау болады: Әркім өз жөнімен қашып кетіп, сені құтқаратын ешкім де қалмайды!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view48() {
struct kk48 poems[] = {
	{1, "1 Ей, Жақыптың үрім-бұтағы, ей, Яһуда руынан тарағандар, сөзіме құлақ салыңдар! Сендер түп аталарың Исраилдің атымен аталып, Жаратқан Иенің атын атап ант етесіңдер. Исраилдің сиынған Құдайына құлшылық етеміз дей беріп, бұларыңды шын жүректен адал істемейсіңдер!"},
	{2, "2 Киелі қаладанбыз деп мақтанып, Әлемнің Иесі деп те аталған Исраилдің Құдайын сүйеніш етеді екенсіңдер. Енді Оның айтқандарына құлақ түріңдер:"},
	{3, "3 Мен болатұғын жайттарды баяғыда-ақ алдын ала мәлімдеп, сендерге қайта-қайта білдірген едім. Кенеттен оларды орындап, жүзеге асырдым."},
	{4, "4 Қандай қасарыспа екендерің де маған айқын болатын. Тоң мойын, беттеріңнен қайтпайтын қиқарсыңдар!"},
	{5, "5 Сондықтан Мен сендерге жасайтын істерімді алдын ала хабарладым, оларды болмай тұрып-ақ білдірдім. Сонымен: Өз тәңірлеріміз осылай істеді! Ағаштан ойылған және қоладан құйылған мүсіндеріміз солай болсын деп бұйырды! дей алмайсыңдар."},
	{6, "6 Хабарларымды естіген едіңдер. Енді жүзеге асқандарының бәріне қарап көз жеткізіңдер! Оларды ашық мойындамайсыңдар ма? Бұдан былай Мен сендерге жаңа жайттарды жария етпекпін, өздеріңе беймәлім, жасырын жатқандарды хабарламақпын."},
	{7, "7 Олар бұрын емес, қазір пайда болып жатыр. Бүгінге шейін солар туралы естімедіңдер. Сондықтан сендер: Әрине, мұны білген едік, — дей алмайсыңдар."},
	{8, "8 Жоқ, оларды алдын ала естіп, түсінген жоқсыңдар! Баяғыдан-ақ сөздеріме құлақ салмадыңдар. Сендердің опасыздық жасайтындарың да маған бұрыннан айқын болатын. Туғаннан-ақ Құдайға қарсы тұрушы деп аталасыңдар!"},
	{9, "9 Бірақ өз атымның құрметіне бола Мен қаһарымды тежеп, әлі де төкпей тұрмын. Әйтпесе сендерді қасымнан үзілді-кесілді аластатып, құртуым қажет болар еді."},
	{10, "10 Оның орнына сендерді тазарту үшін азап отынан өткіздім. Сонда да балқытылған күмістей саф таза болып шықпадыңдар."},
	{11, "11 Өзіме бола әрі өз еркіме сай сендерді құтқармақпын. Қалайша Мен абыройыма дақ түсіртемін?! Өз ұлылығымды қайдағы біреуге қимаймын."},
	{12, "12 Ей, Жақыптың ұрпақтары, Мен өз халқым болуға шақырған Исраил, сөзіме құлақ түріңдер! Мәңгі тірі Жаратқан Иемін, Алғашқы да, Соңғы да Менмін."},
	{13, "13 Құдіретті қолыммен жердің негізін салып, аспан кеңістігін де жайып жібергенмін. Мен бұйрық берсем болды — олардың барлығы бірдей орындарына тұра қалады."},
	{14, "14 Ендеше жиналыңдар, бәрің де құлақ салыңдар! Жаратқан Иенің сүйікті қызметшісі (Кир патша) Оның еркін Бабылда орындап, мықты қолымен сол елдегі халдейлерге қарсы шығатын болады. Жалған тәңірлердің қайсысы бұны алдын ала білдіріпті?"},
	{15, "15 Жоқ, тек Мен ғана соны алдын ала айттым. Өзім оны шақырып әкелемін және оның жолын сәтті етемін."},
	{16, "16 Қасыма жақындап, сөзіме құлақ түріңдер: Мен ниетімді басынан-ақ бүкпей ашық айтып келемін. Оны іске асыратын уақытта да Өзім сол жерде боламын. Енді Жаратушы Тәңір Ие және Оның Рухы мені мына хабармен жіберіп отыр:"},
	{17, "17 Сендерді құтқарушы Жаратқан Ие, Исраил сиынған Киелі Құдай, былай дейді: Мен, Құдай Иелерің, сендерге пайдалыны үйретіп, түзу жолмен бастап алып жүремін."},
	{18, "18 О, егер өсиеттеріме құлақ ассаңдар ғой, шіркін! Сонда сендердегі амандық пен тыныштық сарқылмас өзендей, әділдік те теңіз толқындарындай шексіз болар еді!"},
	{19, "19 Ұрпақтарың тау тастарындай, үрім-бұтағың құм қиыршықтарындай сансыз мол болар еді ғой. Олардың есімдері Менің алдымнан ешқашан өшпес те, жойылмас та еді."},
	{20, "20 Бабылдан тездетіп көшіп шығып, халдейлердің езгісінен құтылыңдар! Мына хабарды қуанышты үнмен жер шетіне дейін жариялаңдар: Жаратқан Ие өз қызметшісін, Жақыптың үрім-бұтағын, азат етті!"},
	{21, "21 Ежелде Жаратқан Ие (Мысырдың езгісінен) құтқарған халқын айдала арқылы жетелеп алып жүргенде олар шөлдемеді: Өзі солар үшін жартастан су ағызды. Жаратқан Ие құзды қақ жарғанда су сарқырай жөнелді. (Осы кезде де Тәңір Ие отанына қайтуға шақырған өз халқына кереметпен қамқорлық жасайтын болады.)"},
	{22, "22 Ал әділетсіздерде амандық пен тыныштық болмайды! — деп нық айтады Жаратқан Ие."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view49() {
struct kk49 poems[] = {
	{1, "1 Аралдар мен теңіз жағалауларындағы елдер, алыстағы халықтар, сөзіме құлақ түріп, тыңдаңдар: мені ана құрсағынан-ақ Жаратқан Ие тағайындады, есімімді туған кезімнен-ақ есінде сақтады."},
	{2, "2 Ол сөзімді семсердей өткір етті. Мені қолының саясында қорғап үшкірленген жебеге ұқсас қылып қорамсағында сақтап келеді."},
	{3, "3 Жаратқан Ие маған мынаны айтқан еді: — Исраил, сен Менің Қызметшімсің. Өзіңде салтанатты ұлылығымды ашық көрсетемін."},
	{4, "4 Ал мен былай деп жауап бердім: — Бүкіл еңбегімді зая еттім, құр бекерге күшімді жұмсадым! — Бірақ Жаратқан Ие мені ақтайды, Құдайым еңбегімнің әділ бағасын сақтайды."},
	{5, "5 Ал енді Жаратқан Ие сөйлейді. Ол мені анамның құрсағында қалыптастырып, Өзінің қызметшісі болуға дайындаған еді. Маған Жақыптың үрім-бұтағын, Исраил халқын, Өзінің қасына қайтарып жинауды тапсырды. Өйткені Жаратқан Иенің алдында қадірлімін, Құдайым маған күш-қуат сыйлайды."},
	{6, "6 Жаратқан Ие мынаны да айтады: Сен Менің Қызметшімсің, Жақыптың шашыраған руларын қайтадан біріктіресің. Сен тек Исраил халқынан аман сақтап қалғандарымды ғана Өзіме қайтарып қоймайсың. Сені басқа ұлттар үшін де жарық Нұр болуға белгіледім! Сонда жердің түкпір-түкпіріндегі адамдарға Мен дайындаған құтқарылу жолын жария етесің!"},
	{7, "7 Құдайдың Қызметшісі адамдардан қорлық көріп, халыққа жексұрын болып, билеушілердің құлына айналған еді. Ал Исраилді құтқарушы Киелі Құдай — Жаратқан Ие оған тіл қатып былай дейді: Сені көрген патшалар алдыңда тік тұрады, әміршілер де саған бас иетін болады. Себебі Мен — Исраил сиынған Киелі Құдай, сөзіне адал Жаратқан Ие, сені таңдап алдым!"},
	{8, "8 Жаратқан Ие тағы мынаны айтады: Мен мейірім көрсететін кезімде саған жауап беремін, халқымды құтқаратын күнім келгенде сені қолдап-қорғап жүремін. Өзіңді халқым үшін Келісімімнің кепілі етіп белгілеймін. Осылай Мен мына уәдемді бекітемін: ойран болған Исраилдің жерін қалпына келтіріп, оны халқыма қайтадан үлестіріп беремін."},
	{9, "9 Сен арқылы қараңғыдағы тұтқындарды Сыртқа шығып, көрініңдер! деп шақырып, босатамын. Олар бағып, қамқорлайтын отарым іспетті жол бойында тамақтанатын болады, тіпті құнарсыз қыраттардан да жайылым табады."},
	{10, "10 Енді қайтып олар аштық пен шөлді білмейді, күннің аптап ыстығы да күйдірмейді. Себебі халқының жанашыры Жасаған Ие оларды жетелеп, су көздеріне бастап алып жүреді."},
	{11, "11 Мен бүкіл тауларымды жолға айналдырып, даңғыл жолдарымды биіктетіп саламын."},
	{12, "12 Міне, бұлар алыстан, көбі солтүстік пен батыстан, басқалары Асуан аймағынан келе жатыр!"},
	{13, "13 Ей, аспан, шаттана шырқап, жер де, қатты қуанып, тау-төбелер де, шуылдап мақтау айтыңдар! Жаратқан Ие өз халқын жұбатып, азап шеккендеріне жаны ашып мейірім танытады."},
	{14, "14 Ал Сионның халқы былай деген еді: — Құдайым мені ұмытып, тастап кетті! — (Жасаған Иенің жауабы мынау:)"},
	{15, "15 — Әлде әйел өз сәбиін ұмыта ала ма, құрсағынан шыққан ұлын аямай ма?! Анасы ұмытып кеткен күнде де Мен сені ешқашан ұмытпаймын, Иерусалим!"},
	{16, "16 Есіміңді алақаныма ойып жазып алдым, қамалдарың әрдайым көз алдымда!"},
	{17, "17 Сені қайтадан салуға келе жатқан халқың өзіңе жетуге асығуда, ал сені қырып-жойып, талқандаған қарсыластарың қасыңнан кетуге мәжбүр болуда!"},
	{18, "18 Айналаңа көз жүгіртіп қарашы: бүкіл балаларың жиналуда! — Мәңгі тірі Жаратқан Ие ант етіп былай деп уәде береді: — Сен осы адамдардың бәрін әшекей етіп таққандай өзіңе қабылдайтын боласың. Олармен қалыңдықтай сәнденіп, көркейіп салтанатқа бөленесің."},
	{19, "19 Ойрандалып, қаңырап бос қалған орындарың енді ағылып келген тұрғындарыңның көптігінен тар болады. Ал сені қанап, жалмап келген дұшпандарың қасыңнан алшақ кетеді."},
	{20, "20 Халқыңның жер аударылған кезеңде шетелде туған ұрпақтары қайтып келіп, сенен: Бұл орын бізге тұруға тым тар. Кеңірек жер берсеңіз екен! деп өтінетін болады."},
	{21, "21 Сол кезде сен іштей былай дейсің: Бұларды мен үшін туған кім? Мен құрсақ көтеріп, балалы болған емеспін. Халқым жер аударылып, қуылған еді. Сонда бұлардың бәрін кім өсірді екен?! Мен жападан-жалғыз болғанда бұлар қайдан шықты?!"},
	{22, "22 Ал Жаратушы Тәңір Ие мынаны айтады: Мен қолымды созып, туымды жоғары көтергендей барлық халықтарға белгі беремін. Олар ұлдарыңды кеуделеріне басып, қыздарыңды да иықтарына отырғызып, көтеріп алып келетін болады."},
	{23, "23 Сонда патшалар кіндік әкелерің болып, ханымдары күтуші әйелдеріңе айналады. Олар саған жерге дейін иіліп тағзым етіп, аяғыңа жабысқан шаңды сүртіп құлдық ұрады. Осылай сен Менің Жаратқан Ие екенімді білетін боласың. Маған үміт артқандар ұятқа қалмайды!"},
	{24, "24 — Күшті жаудың қолынан олжасын тартып алып, жеңімпаздың тұтқындарын босату мүмкін бе?! — (деп күдіктенесің.)"},
	{25, "25 Бірақ Жаратқан Ие мынаны айтады: — Күшті жаудың тұтқындары тартылып алынып, жеңімпаздың олжасы қайтып алынады! Сенімен арпалысып келген жауыңмен Өзім алысып, адамдарыңды босатамын!"},
	{26, "26 Сені езіп-жаншығандар сол кезде өз тәндерін жейтін болады. Олар төгілген өз қандарына тәтті шарап ішкендей мас болады. Осылай бар адамзат Менің Жақып сиынған құдіретті Жаратқан Ие екенімді білетін болады: Мен сенің Құтқарушыңмын, сені азат ететін Қамқоршыңмын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view50() {
struct kk50 poems[] = {
	{1, "1 Жаратқан Ие мынаны айтады: Сендер Мені шешелерің Иерусалимді қуып жіберді дейсіңдер. Ендеше соны дәлелдейтін куәлік қағазы қайда? Мені біреуге берешек болып, соны өтеу үшін өздеріңді құлдыққа сатып жіберді деп те айыптайсыңдар. Жоқ, олай емес, сендер өздерің жасаған күнәларың үшін құлдыққа түстіңдер! Шешелерің де сендердің жасаған зұлым істеріңе бола қуылды!"},
	{2, "2 Халқыма келгенімде неліктен Мені ешқайсың қарсы алмадыңдар? Мен қанша шақырсам да, ешқайсың жауап бермедіңдер? Өздеріңді азат ету қолымнан келмейді деп ойлайсыңдар ма? Жоқ, сендерді құтқаруға құдіретім әбден жетеді! Менің бұйрығыммен теңіз кеуіп қалады. Мен өзендерді де шөл далаға айналдыра аламын. Сонда ондағы балықтар сусыз өліп, шіріп кетеді."},
	{3, "3 Аспанды қара түнекпен қаптап, оны қаралы жамылғымен жауып тастағандай тас қараңғы ететін де Менмін."},
	{4, "4 Маған Жаратушы Тәңір Иенің Өзі тәлім беріп, қажығандарды жігерлендіру үшін не айту керегін аузыма салып отыр. Күн сайын ертеңгісін Ол мені оятып, айтқандарына шәкірттей құлақ салғызады."},
	{5, "5 Жаратушы Тәңір Ие құлағымды ашқанда мен қасарысып, кері бұрылған жоқпын."},
	{6, "6 Арқамды ұрып-соққандарға тостым, сақалымды жұлғандарға екі жағымды ұсынып, бетімді балағат пен түкіріктен жаппадым."},
	{7, "7 Мені Жаратушы Тәңір Ие қолдайды, сондықтан ұялмаймын да қысылмаймын. Өзі белгілеген жолдан шықпауға белді бекем будым. Соңында ұятқа қалмайтынымды білемін."},
	{8, "8 Мені ақтайтын Құдай қасымда, маған сонда кім кінә тақпақ? Келіңдер, беттесейік, енді кім маған айып таңбақшы? Кәне, сол мұнда жақындап келсін!"},
	{9, "9 Мені Жаратушы Тәңір Ие қолдайды, маған үкім шығаратын кім болмақ? Солай етуге тырысқандар тозып, күйеге жем болған киімдей құрымақ."},
	{10, "10 Ей, өз араларыңда Жаратқан Иені терең қастерлеп, Оның Қызметшісінің даусына құлақ түретін кім? Сендер қараңғыда жүріп, жарықтан ада болсаңдар да, Жаратқан Иеге үміт артыңдар, иә, Құдайларыңды сүйеніш етіңдер!"},
	{11, "11 Ал өз беттеріңмен от жағып, қолдарыңа жанып тұрған алау ұстайтын басқалар, мейлі, өздерің лаулатып жандырған от пен алауларыңның жарығында жүре беріңдер. Сендердің Менен алатын марапаттарың мынау: қатты қиналып жататын боласыңдар!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view51() {
struct kk51 poems[] = {
	{1, "1 Әділдікке ұмтылып, Маған бет бұрып сиынғандар, сөзіме құлақ түріңдер! — деп шақырады Жаратқан Ие. — Шыққан ата-тектеріңе көз жүгіртіңдер: қандай жартастан қашалып, қай орыннан қазылып алынғандарыңа көңіл бөліңдер!"},
	{2, "2 Түп ата-аналарың Ыбырайым мен Сараны естеріңе түсіріңдерші. Мен Ыбырайымды балалы болмай тұрып-ақ тағайындап алдым. Оны жарылқап, кереметпен үрім-бұтақты еттім."},
	{3, "3 Сол сияқты, Жаратқан Ие енді Сион шаһарына да жаны ашып, оның қаңырап бос қалған жерлерінің бәрін кереметпен қалпына келтірмек. Ол елдегі шөл дала мен құла түзді жұмақ секілді, иә, Жаратқан Иенің пейіш бағының өзі іспетті ғажап етпек! Сонда Сион шат-шадыман болып, шүкірлікке, шырқалған әнге бөленетін болады."},
	{4, "4 Ей, халқым Исраил, Маған көңіл аударып, құлақ салыңдар! Мен барлық ұлттарға арнап тәлімімді шығарамын. Бүкіл адамзатқа да әділ шешімдерім нұр болып, тура жолды көрсетеді."},
	{5, "5 Менің әділдігім жуырда жер бетінде орнамақ. Сендерді тез арада құтқарып алып, басқа халықтарға өз құдіретіммен билік айтатын боламын. Алыстағы елдер Мені үміттене күтіп, құдіретті күшіме сенімдерін артады."},
	{6, "6 Аспанға көз жүгіртіп, жерге де назар аударыңдар: аспан түтіндей ғайып болып, жер ескі киімдей пайдасыз болып қалады, оның тұрғындары шыбын-шіркей секілді лезде өліп құриды. Бірақ Менің құтқаруым мәңгілік болады, әділ билігімнің шегі болмайды."},
	{7, "7 Ей, әділдікті білетіндер, тәлімдерімді жүрегінде ұстайтын халық, сөзіме құлақ түріңдер! Пенденің мазағынан қорықпаңдар, жұрттың өсек-жаласынан да шошынбаңдар!"},
	{8, "8 Олар күйе түсетін киімдей, құрт жеген жүндей өткінші ғана. Ал Менің әділ билігім мәңгілік, құтқаруымның игілігі ұрпақтан ұрпаққа жалғаса бермек."},
	{9, "9 — Уа, Жаратқан Ие, орныңнан тұрып, Баяғыдай құдіретті қолыңды созып, Ежелдегі істегенің іспетті Қазір де көрсете гөр ерен күшіңді! Сол заманда Мысыр елін талқандап, Осы айдаһардай жауды жарақаттап, Жойып жіберген Өзің емес пе едің?!"},
	{10, "10 Сонда Сен теңіздің суын құрғатып Түпсіз тұңғиығынан бір жол аштың, Халқыңды жаудың қолынан құтқарып Сол жолмен арғы жаққа алып шықтың!"},
	{11, "11 Содан Жаратқанның азат еткен халқы Сионға ән шырқап қайта оралады, Олар мәңгі бақи мәз-мейрам болады, Қуаныш пен шаттыққа әбден толады. Қайғы-мұң атаулы бастарынан сонда Лезде алыстап кетеді біржолата."},
	{12, "12 Жаратқан Ие таңдап алған халқына былай дейді: Мен Өзім сені жұбатып, сүйенішің боламын. Қалай сен ажалды пендеден шошынып, адам баласынан қорқасың? Ол солып қалатын шөп секілді өткінші емес пе?"},
	{13, "13 Ал өзіңді жаратқан Мені, Жасаған Иені, ұмытып келесің! Мен әуел баста аспан кеңістігін жайып жіберіп, жердің негізін салғанда шексіз құдіретімді көрсеткен едім. Неліктен сен өзіңе зорлық-зомбылық жасаған жауыңның қаһарынан күн ұзағына үрейің ұшып қорқасың? Рас, ол сені қырып-жоймақшы болды. Ал қазір сол қанаушыңның қаһары қайда?!"},
	{14, "14 Тұтқындарың жуырда азат болады. Олар өліп, көрге түспейді, әрі нансыз да қалмайды."},
	{15, "15 Себебі Мен сенің Құдайың Жаратқан Иемін. Теңізді буырқантып, толқындарын гүрілдетуге құдіретім жетеді. Әлемнің Иесі — Менің тағы бір есімім."},
	{16, "16 Аузыңа сөздерімді саламын. Сені қолымның аясында ұстап қорғаймын. Аспанды күмбездей орналастырып, жердің негізін салып бекіткен Өзіммін. Сен өз халқымсың деп Сионды қайтадан қамқорыма алатын да Менмін."},
	{17, "17 Оян, орныңнан тұр, Иерусалим! Сен Жаратқан Иенің қаһарына әбден ұшырадың. Сол қаһары шарапқа толы тостағанға ұқсады. Оны түбіне дейін тауысып ішіп, мас болғандай теңселіп жүрдің."},
	{18, "18 Өзіңде туып-өскен тұрғындарыңның бірде-біреуі саған қол ұшын беріп, тура жолмен жетелеп алып жүрген жоқ."},
	{19, "19 Мына пәленің екеуі де: тас-талқан болу және ашаршылық пен семсерден қырылу басыңа түсті. Ал кім сен үшін қайғырады? Менен басқа кім саған жанашыр бола алады?"},
	{20, "20 Тұрғындарың естерінен танып, көшелердің бұрыштарында жатып, торға түскен бөкендерге ұқсайды. Олар Құдайдың қаһарына ұшырап, Жаратқан Иенің үкімін толықтай бастарынан өткізді."},
	{21, "21 Сондықтан енді сөзіме құлақ сал, ей, Иерусалим! Сен шарап ішпей-ақ мас болғандай әлсізсің, қиналып та жатырсың."},
	{22, "22 Жаратушы Тәңір Иең, өз халқын қорғаушы Құдайың, былай дейді: Мен қаһарыма толы тостағанымды қолыңнан қайтарып аламын. Одан ішкенде сен теңселіп, әбден әлсіреген едің. Мен сол қаһарымнан бас тартып, енді қайтып оны саған төкпеймін."},
	{23, "23 Керісінше, сені азапқа салған дұшпандарыңа қаһарыма толы тостағанымнан ішкіземін. Олар саған: Жерге етпетіңнен жат! Үстіңнен басып өтейік деп бұйыратын. Осылай сен олардың аяқтарымен басатын жолы болып арқаңды тосып, бағынуға мәжбүр болған едің."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view52() {
struct kk52 poems[] = {
	{1, "1 Оян, Сион халқы, оян! Күш-қуатқа бөлен! Қасиетті қала Иерусалим, салтанатты киін! Құдайсыз, күнәлі жауларың енді қайтып саған кірмейтін болады!"},
	{2, "2 Отырған жеріңнен тұрып, шаңыңды қағып тастап, төрдегі орныңа жайғас, уа, Иерусалим! Мойныңдағы шынжырларды алып таста, тұтқындалған Сион халқы!"},
	{3, "3 Себебі Жаратқан Ие былай дейді: Сендер ақшаға сатылмай-ақ құлдыққа түстіңдер. Енді құн төленбей-ақ босатыласыңдар!"},
	{4, "4 Жаратушы Тәңір Ие тағы мынаны айтады: Ежелде Менің халқым Мысырға барып, жат жерлік кірмелер ретінде сонда тұрған еді. Соңғы уақытта Ассур патшалығы оларға зорлық-зомбылық көрсетіп келді."},
	{5, "5 Ал енді, мына жағдай не? — дейді Жаратқан Ие. — Жау халқымды құнын төлемей-ақ айдап алып кетіп, билеп-төстейді. Сол ісіне шулап мақтанады. Менің атым күн ұзағына қорланады."},
	{6, "6 Алайда болашақта Менің халқым атымды мойындайтын болады. Қараңдар, Мен мұндамын! деп шақырған Өзім екеніме сол күні олар көздерін жеткізбек. — Жаратқан Ие осыны нық айтады."},
	{7, "7 (Татулық туралы) ізгі хабарды жеткізушінің таудан асып келгені қандай тамаша! Ол тыныштықты жариялап, бақыттың жақсы хабарын алып келіп, құтқарылуды паш етеді. Сионға: Құдайың патшалық құрып жатыр! — деп мәлімдейді."},
	{8, "8 Бір үн естіледі: күзетшілерің дауыс көтеріп, барлығы да шаттана шырқайды. Олар өз көздерімен Жаратқан Иенің Сионға қайтып келгенін көреді!"},
	{9, "9 Иерусалимнің қираған орындары, бәрің бірігіп шаттана ән шырқаңдар! Тәңір Ие өз халқына жаны ашып, Иерусалимді құтқарады."},
	{10, "10 Жаратқан Ие Өзінің киелі құдіретін барлық халықтардың көз алдында ашық көрсетеді. Құдайымыздың бізді құтқаруын жердің түкпір-түкпіріндегілердің барлығы көретін болады."},
	{11, "11 Кәне, жүріңдер, шығыңдар Бабылдан! Күнә атаулыға жоламай, сол жерден шығыңдар! Жаратқан Иенің (киелі үйінің) бұйымдарын көтеріп алып жүретіндер, өздеріңді Оған бағыштап, тазару рәсімінен өтіңдер!"},
	{12, "12 Сендер жау елінен қашып жүгірмей, асықпай шығасыңдар. Себебі Жаратқан Ие алдарыңнан жүріп, сендерді жетелейді; Исраилдің сиынған Құдайы өздеріңді арттарыңнан да қорғап жүретін болады."},
	{13, "13 (Тәңір Ие былай дейді:) Біліп қойыңдар, Менің Қызметшім ақыл-парасатпен әрекет жасайды. Ол беделі артып, дәрежесі жоғары көтеріліп, ұлан-ғайыр дәріптелетін болады."},
	{14, "14 Оған қарап көпшілік аң-таң болды. Себебі Қызметшімнің ұсқынының бұзылғаны сонша, тіпті адам сияқты көрінбеді. Оның түр-тұрпаты адам баласына ұқсамай қалды."},
	{15, "15 Қызметшім көптеген халықтарды қайран қалдырады. Оның алдында патшалар да ауыздарын жабатын болады. Себебі олар өздеріне еш хабарланбағандарды енді көреді, әрі еш естімегендерді енді түсінеді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view53() {
struct kk53 poems[] = {
	{1, "1 Біздің хабарымызға азғана кісілер сенді! Жаратқан Иенің құдіретті күші кімге ашық көрсетілді?"},
	{2, "2 Қызметшісі Құдай алдында жас көшеттей, құрғақ жерден шыққан жас өркендей өсіп шықты. Оның біз таңырқап қарайтындай ажары мен келбеті немесе бізге ұнайтындай ұсқыны жоқ еді."},
	{3, "3 Оны адамдар менсінбей, жалғыз қалдырды. Ол ауыр азап көріп, көп қасірет шегіп, жұрт бетін бұрып әкететіндей жиренішті болды. Оны біз де бағалаған жоқпыз."},
	{4, "4 Шынында Құдайдың Қызметшісі біздің қасіретімізді Өзіне алды, біздің ауруларымызды өз мойнымен көтерді. Оның ұрылып, азап шегуін Құдай бұйырған жаза деп ойладық!"},
	{5, "5 Алайда Құдайдың Қызметшісі біздің күнәларымыз үшін түйреліп, біздің әділетсіз істеріміз үшін құртылды. Оның тартқан жазасы бізге амандық пен тыныштық әкелді. Оның жараларының арқасында біз (рухани дертімізден) сауықтық."},
	{6, "6 Барлығымыз адасқан қойлардай тентіреп, өз бетімізбен жүрдік. Ал Жаратқан Ие бәріміздің күнәларымызды Қызметшісінің мойнына артты."},
	{7, "7 Ол зорлық көріп қиналды, алайда аузын ашпады. Оны тоқты сияқты сойылатын жерге алып барды. Ол қырқылып жатқанда үні шықпайтын қой секілді тіс жармады."},
	{8, "8 Оны жәбірлеп, әділетсіз соттап, өлтіруге алып кетті. Оның замандастарынан кім мынаны ойлады: Ол халқымның күнәларына бола азапталып, бұ дүниеден аластатылды."},
	{9, "9 Оның моласы қылмыскерлер қорымында белгіленгенмен, мәйіті бай адамның қабіріне қойылды. Өйткені Ол ешқандай күнә жасаған да емес, аузынан бірде-бір өтірік шыққан да емес."},
	{10, "10 Алайда Жаратқан Иенің Қызметшісі Оның еркімен азап шегіп құртылды. Ол өз жанын айыпты өтейтін құрбандық еткен соң, өз үрім-бұтағын көріп, ғұмыры ұзақ болады. Қызметшісінің арқасында Жаратқан Иенің еркі жүзеге асады."},
	{11, "11 Әділ Қызметшім жан азабының нәтижесіне қарап қанағаттанатын болады. Оны көп адамдар танып мойындап, ақталады. Ол солардың күнәларын өз мойнына алады."},
	{12, "12 Оған сол себептен көптеген адамдарды табыс етемін. Ол билік иелерін де олжалайды. Себебі Қызметшім жанын өлімге қиып, қылмыскерлердің қатарында саналды. Ол бірақ көптеген адамдардың күнәларын өз мойнына алып, қылмыскерлердің кешірілуі үшін ара түсті."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view54() {
struct kk54 poems[] = {
	{1, "1 Қуан, уа, құрсақ көтермейтін, бала сүймеген әйел, шаттана ән шырқа! Иә, толғатып көрмеген сен, масаттанып дауыста! Өйткені күйеуі бардан гөрі жалғыз басты әйелдің балалары енді көбірек болады! — дейді Жаратқан Ие. —"},
	{2, "2 Халқым, шатырыңның орнын кеңейтіп ал! Оның жапқыштарын аямай созып, жіптерін ұзын етіп, қазықтарын мықтап қақ!"},
	{3, "3 Бұдан былай сен жан-жаққа тарайтын боласың. Ұрпақтарың басқа халықтарға да билік жүргізіп, қаңырап бос қалған қалаларды жаңадан мекендейтін болады."},
	{4, "4 Халқым, қорықпа, енді қайтып ұятқа қалмайсың, қысылма, сен масқара болмайсың. Жас кезіңдегі ұятқа қалған жайтты ұмытып, жесірлік қасіретіңді де есіңе алмайсың."},
	{5, "5 Өйткені өзіңді жаратқан Тәңір саған жар! Ол сені құтқарып алған Қамқоршың, Әлемнің Иесі және Исраилдің Киелі Құдайы деп те аталады. Бүкіл жер бетінің Құдайы деген атағы да бар."},
	{6, "6 Сен қуылған, мұңды әйел секілдісің. Біреу жас кезінде үйленіп, тастап кеткен әйелге ұқсайсың. Жаратқан Ие сені қайтадан қасына шақырады! — Құдайыңның Өзі мұны айтады."},
	{7, "7 Сені біраз уақытқа тастап кетіп едім, бірақ зор сүйіспеншілікпен Өзіме қайтарып алып келемін."},
	{8, "8 Қаһарланған кезде сенен бір сәтке бетімді жасырған едім. Алайда мәңгілік сүйіспеншілігіммен саған рақым етемін, — дейді сені құтқарып алған Қамқоршың Жаратқан Ие."},
	{9, "9 Нұхтың заманында топан су жер бетін басып кеткеннен кейін Мен енді қайтып жерге топан су жібермеймін деп ант еткен едім. Сол сияқты саған да былай деп ант беремін: бұдан былай саған ашуланып, сөгіс бермеймін."},
	{10, "10 Таулар қозғалып, төбелер шайқалар, бірақ Менің сүйіспеншілігім сенен айнымас, сенімен амандық пен тыныштық жайлы жасаған Келісімім де шайқалмас! — дейді саған рақымын төккен Жаратқан Ие."},
	{11, "11 Азап шегіп, дауыл сабалап, жұбаныш көрмеген қала, мынаны біліп ал: Мен сені қайтадан салып тұрғызамын: көгілдір асыл тастарды негіздерің етіп, тастарыңды ең сапалы ерітіндімен қаластырамын."},
	{12, "12 Қамалыңның мұнаралары лағыл тастан, қақпаларың інжу-маржаннан, бүкіл қабырғаларың да асыл тастардан жасалып, жалт-жұлт ететін болады."},
	{13, "13 Балаларыңның бәрі де Тәңір Иеден тәлім алмақ, әрі керемет амандық пен тыныштыққа кенелмек."},
	{14, "14 Сен әділдікпен берік негізделесің. Жәбір көруден аулақ, тыныштықта тұратын боласың. Сені ештеңе де қорқытпай, үрей атаулы саған жоламайды."},
	{15, "15 Саған қарсы аттанған біреу болған күнде де ол Мен жіберген жау болмайды. Кімде-кім саған қарсы шабуылға шықса, сенен жеңіліс табады."},
	{16, "16 Есіңе сақта, Мен Өзім ұстаны жараттым. Ол көмірді үрлеп от жағып, қолдану мақсатына қарай қару-жарақ жасап шығарады. Дәл осылай Мен сені талқандау үшін қырып-жоюшы жауларыңды жаратқан едім."},
	{17, "17 Ал бұдан былай қандай қару-жарақ саған қарсы жасалса да, сені құрта алмайтын болады. Өзіңді айыптағандардың сөздерін әшкерелеп, жоққа шығарасың. Жаратқан Иенің қызметшілері осы игіліктерді иеленетін болады. Оларды Өзім ақтап аламын, — деп нық айтады Жаратқан Ие."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view55() {
struct kk55 poems[] = {
	{1, "1 Ей, шөлдегендер, бәрің су көздеріне келіңдер! Ақшасы жоқтар да, келіп, тамақ алып жеңдер! Иә, келіп, шырын мен сүтті ақша төлемей-ақ тегін алыңдар!"},
	{2, "2 Нәрсіз тамақ үшін неге ақша төлейсіңдер? Өздеріңді қанағат қылмайтын нәрселер үшін неге еңбек етесіңдер? Мені мұқият тыңдап, рухани нәрді қабылдаңдар, ағыл-тегіл жақсылықтан жан рақатын табыңдар!"},
	{3, "3 Маған жақындап, айтқандарыма құлақ түріңдер! Сонда шынайы өмірге ие боласыңдар. Сендермен мәңгілік Келісім жасамақпын. Кезінде Дәуітке уәде еткен мызғымас рақымымды енді өздеріңе көрсетпекпін."},
	{4, "4 Еске алыңдар, Мен Дәуіт арқылы халықтарға құдіретімді паш еттім, Дәуітті соларға көсем әрі билеуші болуға тағайындадым."},
	{5, "5 Сион, сен де бұрын білмеген халықтарды шақырасың. Өзіңді танымаған ұлттар саған келуге асығатын болады. Себебі Мен, сенің Құдайың Жаратқан Ие, Исраилдің Киелі Құдайы, осыларды іске асырып, сені салтанатты ұлылыққа бөлемекпін."},
	{6, "6 Әлі кеш болмай тұрғанда Жаратқан Иеге бет бұрып, мойынсұныңдар! Иеміз құлақ салуға дайын тұрған осы кезде Оған сиынып жалбарыныңдар!"},
	{7, "7 Азғын адам теріс жолынан қайтып, әділетсіз жан өз ойларынан бас тартсын! Бәрі Жаратқан Иеге бет бұрсын, сонда Иеміз мейірімділік танытады. Олар Құдайымызға қайта оралсын, өйткені Ол жомарттықпен кешіреді"},
	{8, "8 Жаратқан Ие: Менің ойым сендердің пікірлеріңнен өзге, Менің жолым сендердікінен басқа, — деп ескертеді."},
	{9, "9 — Аспанның жерден қаншама жоғары болатынындай, Менің жолым да сендердікінен соншама жоғары, Менің ойым да пікірлеріңнен тым биік."},
	{10, "10 Аспаннан жауған жаңбыр мен қар аспанға бекер қайта оралмайды. Керісінше, олар жерді суарып, көгертіп, дақылдарды өсіріп шығарады да, диқанға себуге тұқым, халыққа жеуге нан береді."},
	{11, "11 Менің аузымнан шыққан сөзім де соған ұқсайды: ол нәтиже берместен Өзіме қайта оралмайды. Керісінше, Менің сөзім еркімді толық орындап, көздеген мақсаттарымды жүзеге асырады."},
	{12, "12 Сондықтан сендер зор қуанышпен тұтқыннан босап шығып, жолдарыңда аман-есен жетеленетін боласыңдар. Тау-төбелер алдарыңда ән шырқап, даладағы күллі ағаштар сендерге қол соқпақ."},
	{13, "13 Тікенді бұта орнына қарағайлар өсіп, қалақай орнын жұпар иісті жасыл бұталар басады. Бұл керемет іс Жаратқан Иенің даңқын асыратын, мәңгі өшпейтін белгі болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view56() {
struct kk56 poems[] = {
	{1, "1 Жаратқан Ие тағы мынаны айтады: Әділетті бұйрықтарымды сақтап, әділ істер жасаңдар! Мен сендерді жақында құтқарып, әділдігімді ашық көрсететін боламын."},
	{2, "2 Айтқандарымды мұқият орындайтын адам қандай бақытты! Демалыс күнін қор қылмай, Өзіме бағышталған күн ретінде қастерлейтін әрі жамандық атаулыдан алыс жүретін адам баласын Мен жарылқайтын боламын."},
	{3, "3 Өзін Жаратқан Иеге түбегейлі арнаған басқа ұлт адамы: Жаратқан Ие, сірә, мені өз халқынан бөлек қояр, — деп уайымдамасын. Белінен айырылған еркек: Мен қурап қалған ағашқа ұқсаймын, — деп те қайғырмасын."},
	{4, "4 Себебі Жаратқан Ие мынаны айтады: Егер белінен айырылғандар Менің еркімді орындауды таңдап, демалыс күнінің ережелерін сақтап, Келісімімді берік ұстанса,"},
	{5, "5 онда Мен оларға ғибадатханамнан және оның алаңдарынан орын беріп, мәңгі өшпейтін ат пен абырой сыйлаймын. Бұл, ұл-қыздар арқылы қол жеткізуге болатын абыройдан да артық."},
	{6, "6 Сол сияқты, егер басқа ұлт адамдары Маған ғибадат етіп, Мені сүйіп, қызметшілерім болуға өздерін түбегейлі арнаса, әрі демалыс күнінің ережелерін сақтап, Келісімімді берік ұстанса,"},
	{7, "7 онда Мен, Жаратқан Ие, олардың Өзіме бағышталған қасиетті Сион тауына келулеріне жол беремін. Маған сиынуға арналған ғибадатханада оларды қуанышқа кенелтемін. Сол басқа ұлттық сенушілердің Өзімнің құрбандық үстелімде шалып, өртеген құрбандықтарына және өзге де сый-тартуларына риза боламын. Себебі Менің киелі үйім барлық ұлттар мінажат ететін үй деп аталатын болады."},
	{8, "8 Жаратушы Тәңір Ие жер аударылып, шашырап кеткен исраилдіктерді қайтадан жинамақ. Ол былай деп жариялайды: Мен халқымды жинап алып, оларға басқаларды да қоспақпын!"},
	{9, "9 Дала мен ормандағы жыртқыш аңдар, бәрің де осында келіңдер! Халқымның жаулары, келіп, бас салыңдар!"},
	{10, "10 Исраилді күзетіп жүруге тиісті басшылары соқыр да надан! Барлығы үре алмайтын мылқау, қиялдап жатып, ұйықтағанды жақсы көретін иттер сияқты."},
	{11, "11 Олар қомағай, тоюды білмейтін төбеттерге ұқсас! Түсінігі жоқ осы бағушылардың бәрі өз беттерімен жүріп, әрқайсысы өз пайдасын ғана ойлайды."},
	{12, "12 Кәне, шарап алып, соңынан сыраны сімірейік. Ертең де бүгінгідей, тіпті бұдан да күшті болады! деседі сол зұлымдар."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view57() {
struct kk57 poems[] = {
	{1, "1 Әділ жандар жойылады, бірақ ешкім бұған көңіл бөлмейді, мәнін де түсінбейді: мейірімді, шыншыл адамдар бұ дүниеден әкетілгенде жамандық атаулыдан құтылып,"},
	{2, "2 тыныш, жайлы орынға енеді. Тура жолмен жүргендер о дүниеде тынығатын болады."},
	{3, "3 Ей, сиқыршылардың балалары, мұнда келіңдер! Жүгенсіз еркектер мен жезөкшелерден тараған сендер, қасыма жақындаңдар!"},
	{4, "4 Кімді келеке етіп, тілдеріңді шығарып мазақтап тұрсыңдар? Сендер Өзіме қарсы шыққан өтірікшілердің тұқымысыңдар!"},
	{5, "5 Әрбір саялы ағаш түбінде жалған тәңірлерге табынып, құштарлық отына өртенесіңдер. Сайлардағы жартастардың қуыстарында өз балаларыңды құрбандыққа қиясыңдар!"},
	{6, "6 Сол сайлардағы тегіс те жұмыр тастарды өздеріңе тәңір етіп таңдап алдыңдар. Сондықтан да сендерге қалатын үлес сол тастар болады. Оларға арнап сұйық тарту құйып, астықтан да сый-тарту ұсынасыңдар. Қалайша Мен осындай қылықтарыңа қарап қаһарымды басамын?!"},
	{7, "7 Сендер биік те салтанатты тау бастарына көтеріліп, сол жерлерге азғындық үшін төсектеріңді жайып, құрбандықтарыңды шалып та келесіңдер."},
	{8, "8 Сондай-ақ есік пен жақтауларыңның арт жағына Менің сөздерімді емес, жалған тәңірлеріңнің белгілерін салып қойдыңдар. Ей, опасыз халық, Менен алыстап кетіп, тәңірсымақтарға қосылдың! Көрпеңді ашып, кең төсегіңе жатып, сол ашыналарыңмен келістің. Олармен бірге болуды ұнатып, мүсіндеріне қадала қарайсың."},
	{9, "9 Сен қымбат май мен мол етіп жұпар майыңды алып, шетелдік патшаға барып тұрдың. Хабаршыларыңды алыс елдерге жіберіп, азғындыққа әбден баттың."},
	{10, "10 Бұл жолмен ұзақ жүріп, шаршап, қажыдың. Алайда одан күдеріңді үзбей келесің. Қайтадан күш жинап, әлсіздік көрсетпейсің."},
	{11, "11 Мені осылай алдайтындай кімнен соншама қорқып, зәрең ұшты? Мені есіңе алмай, Маған көңіл де бөлмедің. Ұзақ уақыт бойы үндемедім. Сол үшін де Менен қорықпайсың ба?"},
	{12, "12 Сенің жалған әділдігің мен істеріңді әшкерелеймін. Олардан саған пайда болмайды."},
	{13, "13 Сен айқайлап көмек сұрағанда, жинап алған тәңірсымақтарың сені құтқарып көрсін! Бірақ олардың барлығын жел айдап әкетіп, аузымның лебі жоқ қылады. Ал Мені паналағандар елді иеленіп, Өзіме бағышталған Сион тауында мәңгі тұратын болады."},
	{14, "14 Сол кезде: Тегістеп, биік етіп даңғыл жол салыңдар! Халқымның жүретін жолындағы бөгеттерді алып тастаңдар! деп бұйырады."},
	{15, "15 Себебі Киелі Құдай деп аталған, мәңгі тірі дәріптелген Алла Тағала мынаны да айтады: Мен көктегі киелі мекенімде тұрамын. Сондай-ақ күйреп, күнәсіне шын көңілден өкінген кішіпейіл жанның қасында да боламын. Оны қайтадан рухтандырып, жаралы жүрегін сауықтырамын."},
	{16, "16 Мен сондайларға мәңгі бақи ашуланбаймын, айып та тақпаймын. Әйтпесе адамның жаны алдымда әлсіреп, Өзім өмір лебін үрлеп жаратқан пенде құрып, жоқ болар еді."},
	{17, "17 Яһуда халқының дүниеқұмарлық күнәсі үшін Мен оған қатты ашуланып, жазасын тартқызып, одан бетімді жасырдым. Алайда халқым Менен бас тартуын доғармай, өз жүрек қалауымен жүре берді."},
	{18, "18 Мен жүрген жолдарын анық көрсем де, халқымды сауықтырып, жетелемекпін. Араларындағы өкініп қайғырғандарын жұбатып,"},
	{19, "19 ауыздарына мадақтау сөздерін саламын. Алыстағылар мен жақындағыларға амандық пен тыныштық молынан болсын! Мен оларды сауықтырамын! — Жаратқан Ие осыны нық айтады."},
	{20, "20 Бірақ әділетсіздер буырқанып, тынши алмайтын теңізге ұқсайды. Толқындары лай мен балшықты жоғары көтере береді."},
	{21, "21 Әділетсіздерде амандық пен тыныштық болмайды! — деп ескертеді Құдайым."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view58() {
struct kk58 poems[] = {
	{1, "1 — Өзіңді тежемей қатты айқайла! Даусыңды кернейдей көтер! Таңдап алған халқыма опасыз істерін ашық айт! Иә, Жақыптың үрім-бұтағына жасаған күнәларын әшкереле!"},
	{2, "2 Олар Маған күнде сиынып, еркімді білуді қалағансиды, әрі әділдік жасайтын, Құдайының айтқандарына мойынсұнатын халық сияқты болып көрінеді. Осылай олар Құдай алдына келуді ұнатып, Менен әділ шешімдер өтініп, былай дейді:"},
	{3, "3 Біз ораза ұстап едік, Сен неге көз салмадың? Саған бой ұсынған едік, Сен неге байқамадың? (Бұған Менің жауабым мынадай:) Ораза тұтқан күндеріңнің өзінде сендер қалағандарыңды істеп, тіпті бейшара жұмысшыларыңды қанайсыңдар!"},
	{4, "4 Оразаларыңның аяғы ұрыс-талас, зұлым төбелеспен бітеді. Мұндай оразаларың мінажаттарыңды көкке жеткізбейді."},
	{5, "5 Әлде пенденің кішіпейіл болғансып, басын қоғадай иіп, қайғы шеккен азалы жандай көрінген күнін Маған ұнайтындай ораза деп ойлайсыңдар ма? Осындай әрекетті шынымен ораза әрі Жаратқан Иені риза қылатын күн деп атауға бола ма?!"},
	{6, "6 Жоқ, Маған ұнайтын ораза мынадай: зұлымдықпен бұғауланғандардың кісендерін үзіп, құлдықтың шынжырларын шешу және зорлық көріп жатқандарды азат етіп, езгі атаулыны жойып жоқ қылу!"},
	{7, "7 Сондай-ақ аштармен наныңды бөлісіп, қаңғырған кедейлерді үйіңе кіргіз! Киімге мұқтаждарға тап болсаң, киіндіріп, өзге пенделерге де қол ұшын беруден бас тартпа!"},
	{8, "8 Сонда саған кенеттен таңғы шұғыладай нұр төгіліп, тез сауығатын боласың. Әділдігің алдыңнан бастап, Жаратқан Иенің салтанатты ұлылығы сені артыңнан қорғап жүретін болады."},
	{9, "9 Сол кезде Оны шақырасың және Жаратқан Ие жауап береді. Көмек сұрап жалбарынғаныңда Ол: Саған жар боламын! деп сені жігерлендіреді. Араларыңнан езгі атаулыны алып тастаңдар, сырттай өсектеу мен тіл тигізуді де доғарыңдар!"},
	{10, "10 Қарны аштарға шынайы жанашырлық танытыңдар, әрі зорлық-зомбылық көргендерді жұбатып, мұқтаж нәрселерімен қамтамасыз етіңдер! Сонда айналаларыңдағы қара түнекте Менің нұрым сәулесін шашып, рухани қараңғылықтарың тал түстей жап-жарық болады."},
	{11, "11 Мен, Жаратқан Ие, сендерді әрқашан жетелеп жүремін, шөл далада да қажеттеріңмен қамтамасыз етіп, денелеріңе қуат беремін. Осылай сендер суы мол баққа, ешқашан сарқылмайтын бұлаққа ұқсайтын боласыңдар."},
	{12, "12 Халқың ежелде қираған мекендеріңді қайтадан салып, баяғы ұрпақтардан қалған негіздердің үстінен қалаларыңды қайта орнатады. Жұрт сендерді Қираған қамалдарды қалпына келтіріп, жолдар мен үйлерді қайта салушылар деп атайтын болады."},
	{13, "13 Жаратқан Ие тағы былай дейді: Демалыс күнін Маған бағыштап, берік ұстаныңдар! Бұл күні әдеттегі істеріңмен айналыспай, оны қадірлеп-қастерлеп, үлкен ғанибет деп өткізіңдер! Демалыс күні өз беттеріңмен жүрмеңдер, құмарлықтарыңды қандыру мен бос мылжыңнан да бас тартып, сол күнді толығымен Маған арнаңдар!"},
	{14, "14 Егер осылай істесеңдер, сонда рақаттарыңды Менен, Жаратқан Иеден, табасыңдар. Сендерге жердің биік қорғандарын тездетіп иемденіп алуға мүмкіндік беремін. Өзім түп аталарың Жақыпқа мұралық меншікке берген осы елдің өнімдерімен тойынатын боласыңдар. — Жаратқан Ие осыны нық айтады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view59() {
struct kk59 poems[] = {
	{1, "1 Біліп алыңдар: Жаратқан Иенің қолы сендерді құтқаруға дәрменсіз емес, Оның құлағы мінажаттарыңды естуге мүкіс те емес."},
	{2, "2 Қайта, өздеріңнің әділетсіз істерің Құдаймен араларыңды ажыратып келеді! Жасаған күнәларың Оның бетін сендерден бұрып әкетеді. Сондықтан да Құдай Ие мінажаттарыңа құлақ салмайды."},
	{3, "3 Қолдарың зұлымдық жасап, қан төгіп арамданды. Ауыздарыңнан өтірік пен жамандық толассыз шыға береді."},
	{4, "4 Ешкім адалдық пен әділдікті жақтап дауыс көтермейді. Бәрі бос жайттарға сүйеніп, сотта да өтірік айта береді. Олар зұлым жоспарлар ойлап шығарып, соларын жамандықпен жүзеге асырады."},
	{5, "5 Осылай сұр жыланның жұмыртқаларын басып шығарғандай болады. Сол жұмыртқаларды жеген құриды, ал жарса, ішінен улы жылан шығады."},
	{6, "6 Олардың құрған жоспарлары сондай-ақ өрмекке де ұқсас. Өрмек киім болмайды ғой. Олар өз тоқығандарын жамылып, ешқандай пайда көре алмайды. Жасағандары әділетсіздік пен зорлық-зомбылық."},
	{7, "7 Аяқтары жамандыққа алып ұшып, жазықсыз қан төгуге асығады. Олардың ой-ниеттері қара, жүрген жерлерін қиратып, күл-талқандарын шығарады."},
	{8, "8 Олар татулық дегенді білмейді, жүрген жолдарында әділдік жоқ. Қайта, олар жолдарын өз мүдделері үшін қисайтып, бұралаң етеді. Солармен жүрген бірде-бір жан тыныштықты білмейді."},
	{9, "9 Сол себептен әділдік бізден тым алшақ, адалдық қасымызға жоламайды. Нұрды күтсек те, айналамыз қара түнек, үміттенген жарықтың орнына қараңғылықта жүреміз."},
	{10, "10 Соқыр адамдай қабырға бойын қармалап, көзсіз зағиптей жолымызды іздеп сипалаймыз. Тал түсте кеш түскен кездегідей сүрінеміз, күшіміз болғанмен өлілерге ұқсаймыз."},
	{11, "11 Аюдың гүжілдеп, көгершіннің мұңая гулегеніндей, бәріміз де қайғыра ыңқылдаймыз. Әділдікті қанша күтсек те, ол жоқ. Құтқарылудан үміттенсек те, ол бізден тым алшақ!"},
	{12, "12 Уа, Жаратқан Ие, Сенің алдыңда қылмыстарымыз сансыз көп, күнәларымыз бізге қарсы айғақ болып тұр. Әділетсіз істеріміз өз бастарымызда, күнәларымызды мойындаймыз:"},
	{13, "13 біз бас көтеріп, Саған, Жаратқан Иеге, опасыздық жасадық, өз Құдайымыздан безіп кеттік. Зорлық-зомбылық пен бүлінушілікті жақтап келеміз. Іштей өтіріктер ойлап тауып, оларды сыртқа шығарамыз."},
	{14, "14 Осылай әділдік кері қуылып, адалдық тым алыс қалады. Шындық сот алаңында сүрініп құлап, ақиқат арамызға кіре алмайды."},
	{15, "15 Шындық құрып кетті. Зұлымдықтан аулақ жүргендер соның құрбаны болады. Жаратқан Ие бұған назар аударып, әділдіктің жоқтығына наразы болды."},
	{16, "16 Ақиқатты жақтайтын бірде-бір адамның жоқ екенін көріп, зорлық-зомбылық шеккендерді қолдайтын ешкімнің болмағанына таңғалды. Сондықтан Тәңір Ие Өзінің әділдігіне сүйеніп, құдіретті қолымен құтқаруды дайындады."},
	{17, "17 Ол әділдікті сауыттай, құтқаруды басына дулығадай киіп, зұлымға жазасын тартқызуды жамылғыдай оранып, қайратын шапандай жамылған жауынгер секілді даяр тұр."},
	{18, "18 Құдай әркімге істеріне қарай қайтарып, зұлым қарсыластарына қаһарын төгеді. Сонда Ол тіпті алыстағы елдердегі жауларына да жазаларын тартқызады."},
	{19, "19 Осылай батыстағылар мен шығыстағылар да Жаратқан Иені терең қастерлеп, Оның салтанатты ұлылығына қайран қалады. Өйткені Жаратқан Иенің дауылы су тасқынын қатты айдағандай, Өзі де тездете аттанып келеді."},
	{20, "20 Сион қаласына және Жақыптың үрім-бұтағының теріс жолдан қайтқандарына оларды құтқаратын Қамқоршы келеді! — деп жариялайды Жаратқан Ие. —"},
	{21, "21 Сонда олармен мынадай Келісім жасайтын боламын: Мен өздеріңе қондырған Рухым сендерден алшақ кетпейді, ауыздарыңа салған сөздерім де сендерде сақталады. Олар өз ауыздарыңнан және балаларың мен кейінгі ұрпақтарыңның ауыздарынан бұдан былай мәңгі түспейді. — Жаратқан Ие осыны нық айтады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view60() {
struct kk60 poems[] = {
	{1, "1 Орныңнан тұр, уа, Иерусалим, сәулеңді шаш! Сен нұрға бөленіп, Жаратқан Иенің нұрлы салтанаты үстіңнен көтеріліп келе жатыр."},
	{2, "2 Міне, жер бетін қою қараңғылық жайлап, халықтарды қара түнек жауып алды. Бірақ сенің үстіңнен Жаратқан Иенің нұры жарқырап, Оның нұрлы салтанаты көрінеді."},
	{3, "3 Ұлттар сенің сәулеңе ағылып, патшалары да шұғылаңа жақындап келеді."},
	{4, "4 Уа, Сион қаласы, еңсеңді көтеріп, айналаңа қара! Халқың жиналып, саған қайтуға дайындалып жатыр! Ұлдарың алыс жолдан келіп, қыздарың баппен көтеріліп әкелінеді."},
	{5, "5 Оларды көргенде жүзің нұрланып, жүрегің дүрсілдеп, шат-шадыман боласың. Сен теңіздің мол байлығын иемденіп, халықтар өз қазыналарын саған ұсынады."},
	{6, "6 Жеріңді түйелер қаптайды. Мадиян мен Ефа халықтарынан желмая түйелер айдалып, сәбалық керуендер де саған жиі тоқтайтын болады. Олар алтын мен хош иісті заттар тасып әкеліп, Жаратқан Иенің ұлылығын жырлап паш етеді."},
	{7, "7 (Жасаған Ие былай дейді:) Қидар тайпасы саған отар-отар қой-ешкілерін айдап әкеліп, Набайоттың адамдары да саған қошқарларын ұсынады. Сол малдар шалынып, құрбандық үстелімде өртелгенде Маған ұнамды болады. Мен сәулетті ғибадатханамды қайтадан нұрлы салтанатыма кенелтемін."},
	{8, "8 Жел айдаған бұлттай зымырап, көгершіндей ұясына қарай зулап келе жатқан бұлар кімдер?"},
	{9, "9 Теңіз жағалауларындағы шалғай елдер Менен белгі күткен еді. Енді, міне, үлкен сауда кемелері бірінші болып жетіп жатыр. Сион, олар сенің ұлдарыңды алыстан алып келе жатыр! Олар Менің құрметіме алтын-күмістерін бағыштайды. Мен Өзім, сенің Құдайың Жаратқан Ие, Исраилдің Киелі Құдайы, саған салтанат пен сәулет сыйлаймын."},
	{10, "10 Қамалыңды жат жерліктер қайта тұрғызады, олардың патшалары да саған қызмет ететін болады. Сион, Мен қаһарланып, сені жазалаған едім. Енді саған риза болып, жанашырлық білдіремін."},
	{11, "11 Қақпаларың күні-түні жабылмай, әрдайым ашық тұратын болады. Олар арқылы өзге халықтар мен олардың патшалары салтанатты шерумен жетелене кіріп, байлықтарын үздіксіз әкеле береді."},
	{12, "12 Егер бір халық не патшалық өзіңе қызмет етуден бас тартса, онда ол қырылып, мүлдем жойылатын болады."},
	{13, "13 Ливан тауынан оның аты шулы ағаштары: қарағай, шырша, самырсын саған бірге тасылады. Солармен киелі үйім әдеміленіп қайта салынады. Мен осы жер бетіндегі тұрағымды нұрлы салтанатыма кенелтпекпін."},
	{14, "14 Өзіңе азап шеккізгендердің ұрпақтарының сенің алдыңа келіп, бас июлеріне тура келеді. Саған қорлық көрсеткендердің бәрі аяғыңа жығылып, сені Жаратқан Иенің қаласы, Исраил сиынған Киелі Құдайға бағышталған Сион деп атап, қадірлейтін болады."},
	{15, "15 Сион, сен бұған дейін жалғыз қалдырылған, жек көрінішті қала болдың. Ешкім саған соғып өткен жоқ. Бірақ Мен сені келешек ұрпақтарыңның мәңгілік қуанышы мен мақтанышы етемін."},
	{16, "16 Анасының емшектегі сәбиіне қамқорлық жасағанындай, басқа халықтар мен олардың патшалары сені күллі қажетті нәрселеріңмен қамтамасыз ететін болады. Сонда сен Менің Жаратқан Иенің, сені құтқарып, қорғайтын Қамқоршың әрі Жақып сиынған құдіретті Құдай екенімді білетін боласың."},
	{17, "17 Саған қола орнына алтынды, темір орнына күмісті, ағаш орнына қоланы, тас орнына темірді иелікке беремін. Сенің еліңе бейбітшілікті билеуші, әділдікті әмірші етіп тағайындаймын."},
	{18, "18 Сион, бұдан былай еліңде зорлық-зомбылықтың айқай-шуы естілмейді, өзің де қиратылып, талқандалмайсың. Керісінше, сен өзіңді құтқарған Мені қамалым, Маған арнаған мадақтауыңды бекітулі қақпаларым деп атайтын боласың."},
	{19, "19 Саған күндіз күннің нұрын шашып, түнде айдың сәулесін түсіруінің қажеті де болмайды. Мен, Жаратқан Ие, сенің Құдайың, Өзім мәңгілік нұрың мен салтанатың боламын!"},
	{20, "20 Сенде күн мен ай батып, қараңғылық жайламайды, себебі Мен, Жаратқан Ие, саған мәңгі бақи нұр боламын. Қайғырған кезеңің осымен аяқталады."},
	{21, "21 Күллі халқың әділ болып, осы елге ұдайы ие болады. Халқым Өзім отырғызған көшетке ұқсайды. Мен оны жараттым, ол арқылы ұлылығымды паш етемін."},
	{22, "22 Ең қарапайымдарыңнан да мыңдаған адам шығып, әлсіздеріңнен де мықты ұлт тарайтын болады. Мен, Жаратқан Ие, мұны уақыты келгенде тездетіп жүзеге асырамын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view61() {
struct kk61 poems[] = {
	{1, "1 — Маған Жаратушы Тәңір Ие Өзінің Рухын қондырды. Жаратқан Ие мені жарлыларға ізгі хабар жеткізуге және жаралы жүректерді жұбатып орнықтыруға тағайындады, сондай-ақ тұтқындарға босатылатындарын, бұғаудағыларға азат болатындарын жар салуға жіберді."},
	{2, "2 Мені Құдай Иеміз Өзінің кешірім беретін мейірімділік жылын әрі жауларына лайықты жазаларын тартқызатын кезін жариялауға жұмсап, қайғырып жүргендердің бәрін жұбатуға да жіберді."},
	{3, "3 Маған Сион қаласындағы жоқтап жүргендердің бастарына шашқан күл орнына әшекейлі тәж кигізіп, жұпар иісмай жағып, қайғыларын қуанышпен алмастыруды тапсырды. Үміттері үзіліп, көңілдерін мұң шалғандар енді мадақтау әндерін шырқап, шаттыққа бөленетін болады. Сонда олар Жаратқан Иенің Өзі отырғызған мықты ағаштары деп аталады, әрі Оның алдында ақталған, әділдік істеп, салтанатты ұлылығын паш ететін халқы болады."},
	{4, "4 Олар ежелгі заманда қиратылған мекенжайларды қайтадан салып, ежелгі ұрпақтардың талқандалып, қаңырап бос қалған қала-қыстақтарын жаңадан тұрғызып қалыпқа келтіреді."},
	{5, "5 Сол кезде жат жерліктер сендерге қызмет етіп, отарларыңды бағып, егіншілерің мен жүзімшілерің болады."},
	{6, "6 Өздерің Құдай Иеміздің діни қызметкерлері деп аталып, қызметтеріңді тек Оған ғана арнайтын боласыңдар. Басқа халықтардың байлығынан тамақтанып, олардың қазыналарын мақтан тұтасыңдар."},
	{7, "7 Бұрын масқара болғандарыңның орнына айрықша қадірленесіңдер. Бастарыңнан өткізген қорлықтарыңның орнына енді үлестеріңе тиген мұраларыңа қуана ән шырқайсыңдар. Сонымен Құдай халқы өз елінде бұрынғысынан екі есе мол дәулетке қол жеткізіп, мәңгі бақи шаттанатын болады."},
	{8, "8 — Себебі Мен әділдікті сүйіп, зорлық-зомбылықты жек көремін, — дейді Жаратқан Ие. — Меншікті халқыма тиісті сыйларын адалдықпен беріп, олармен тұрақты Келісім жасаймын."},
	{9, "9 Солардың ұрпақтары басқа халықтар арасында танымал және қадірлі болады. Мұны көргендердің бәрі бұлардың Жаратқан Ие жарылқаған ұрпақ екенін мойындайды."},
	{10, "10 Жаратқан Иеге қатты қуанам, Құдайыма шаттанады жан дүнием, Мені Ол құтқарып, амандыққа бөледі, Үстіме әділдікті де жауып берді! Күйеу жігіт діни қызметкер іспетті Әшекейлі тәж басына киеді, Қалыңдық асыл тастарын тағады, Дәл солай мен де болдым салтанатты!"},
	{11, "11 Өскіндерді топырақ көктетеді, Себілген дәндерді бақша өсіреді. Ал енді Жаратушы Тәңір Ие Әділдігі мен даңқты істерін де Барлық халықтардың көз алдарында Шүбәсіз қаулатып шығарады да!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view62() {
struct kk62 poems[] = {
	{1, "1 Мен Сионды сүйіп, Иерусалимнің құтқарылуын зарыға күткендіктен тынши алмаймын. Оның әділдігі таңғы шұғыладай жарқырап, құтқарылуы алаудай лаулап жанбайынша, Құдайға жалбарынудан бас тартпаймын!"},
	{2, "2 Сион, сол кезде барлық ұлттар әділдігіңді көріп, патшалары да салтанатты ұлылығыңа көздерін жеткізеді. Жаратқан Ие саған қойған жаңа атыңмен аталатын боласың."},
	{3, "3 Сен Құдай Иеңнің қолында патшаның керемет әдемі тәжі іспетті болып көрінесің."},
	{4, "4 Бұдан былай ешкім сені күйеуі тастап кеткен деп атамайды, жеріңді ойсырап қалған деп те айтпайды. Қайта, сені Қуанышым және жеріңді Келіншек деп атайтын болады. Себебі Жаратқан Ие саған қатты қуанады. Күйеуінің келіншегін қамқорлайтынындай, Жаратушы да сенің жеріңді қамқорлайтын болады."},
	{5, "5 Жас жігіттің қызға үйленетініндей, сенің тұрғындарың өзіңмен тұрақты байланыс орнатады. Күйеу жігіттің қалыңдығына қуанатынындай, Құдайың да саған шаттанатын болады."},
	{6, "6 — Мен қамалыңның үстіне күзетшілер қойдым, уа, Иерусалим. Олар күндіз-түні үнсіз қалмай, мінажат етуге тиіс. Ей, Жаратқан Иеге сиынатындар, ешқашан жалбарынуларыңды доғармаңдар!"},
	{7, "7 Иә, Жасаған Ие Иерусалимді қайтадан салғызып, жер бетінде оның даңқын асырмайынша, Оған үздіксіз сиынып сұрай беріңдер!"},
	{8, "8 Жаратқан Ие ант етіп, мынадай уәде берген еді, соны Өзінің құдіретті оң қолымен ешбір шүбәсіз іске асыратын болады: — Енді қайтып сені жауларыңа жеңілдірмеймін! Оларға астығыңды тамақ етіп тапсырмаймын, әрі ауыр еңбек сіңіріп шығарған жүзім шырыныңнан да бөтен елдіктерге тегін ішкізбеймін!"},
	{9, "9 Қайта, өнімді жинағандар жеп, Маған, Жаратқан Иеге, шүкірлік етпек. Жүзімді жинағандар да оның шырынын Менің киелі үйімнің ауласында мейрамдап ішетін болады."},
	{10, "10 Қақпадан өтіп, далаға шығыңдар, Халқыма жүретін жолын дайындаңдар, Бөгет болған тастарды алып тастаңдар, Биік етіп даңғыл жолды салыңдар! Белгі ретінде басқа халықтарға Туды тігіп қойыңдар жоғарыға!"},
	{11, "11 Құлақ түріңдер, Жаратқан Ие жердің түкпір-түкпіріне былай деп жариялайды: — Сион қаласына айтыңдар: Міне, сені құтқаратын Қамқоршың келе жатыр! Жеңісінің олжасы мен сыйы Оның қасында: азат еткен халқы алдынан жүреді."},
	{12, "12 Олар Жаратқан Иенің құтқарып, Өзіне бағыштаған халқы деп аталады. Уа, Иерусалим, сен бұдан былай күйеуі тастап кеткен емес, ерекше қалаулы қала деп аталатын боласың."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view63() {
struct kk63 poems[] = {
	{1, "1 — Едом еліндегі Босорадан келе жатқан, қан қызыл шапан жамылған мына Кісі кім екен? Сән-салтанатпен киініп, зор күшпен алға басқан Бұл кім Өзі? — Ол: — Мен әділдікті айтамын, құтқаруға құдіреттімін, — дейді."},
	{2, "2 — Неліктен киімдеріңіз бен шапаныңыз қып-қызыл? Олар арнайы шұңқырда жүзімді таптап, қызыл шырынын сығып шығаратын кісінің киіміндей қан қызыл ғой?"},
	{3, "3 — Мен жүзімдерді жалғыз таптадым, халықтардан ешкім қасымда болып көмектеспеді. Ашуға мініп, зұлым жауларымды таптап, қаһарлана басып-жаншыдым. Солардың қаны шапаныма шашырап, барлық киімдерім де ластанды."},
	{4, "4 Мен халқымды езгіден құтқаратын жыл келді, арамза жауларыма жазаларын тартқызатын мезгіл жетті деп ұйғардым."},
	{5, "5 Айналама қарасам, Маған көмектесіп, сүйеніш болатын ешкімнің жоқтығына қатты таңғалдым. Сонда құтқаруды өз құдіретті қолыммен іске асырдым, өз қаһарым Өзіме сүйеніш болды."},
	{6, "6 Мен ашуға мініп, зұлым халықтарды таптадым. Оларды қаһарыммен мас қылып теңселтіп, қандарын жерге төктім."},
	{7, "7 Жаратқан Иенің берік мейірімін, Біз үшін жасаған бар игі істерін Мен есіме түсіріп дәріптеймін. Иеміз Исраил халқына молынан Көрсетіп келеді мейірімділігін, Аямай төккен шексіз рақымымен Тәңір істеп келеді зор игіліктерін."},
	{8, "8 Жаратқан Ие былай деген болатын: Шынында олар Менің меншікті халқым, Алдамайтын рухани балаларым. Содан Ол халқын құтқармақшы болды."},
	{9, "9 Олар азап шеккен кездің бәрінде Жаратқан Ие бірге азап шекті, Өзінің қасындағы періштесі Таңдаған халқын қорғап-қоршап жүрді. Құдайымыз сүйіспеншілігімен Және мол қайырымдылығымен Халқын құтқарып алып, бүкіл өткен Заманда Қамқоршысы болып келген."},
	{10, "10 Ал өз халқы Құдайға қарсы көтерілді, Киелі Рухын қатты ренжіте берді. Сондықтан Тәңір оның жауына айналды, Халқына қарсы Өзі күреске шықты."},
	{11, "11 Сонда Оның халқы ежелгі заманды — Мұса пайғамбар мен оның қасындағы Халқының тарихын естеріне алды: Бағушысы Мұсамен бірге халықты Теңізден өткізіп, басшыларына Өзінің Киелі Рухын қондырған Сол Жаратқан Иеміз қазір қайда?"},
	{12, "12 Өзі Мұсаны ұлы құдіретімен Қолынан ұстағандай болып жетелеген, Алдынан теңіз суын қақ айырған, Халқын теңіз түбімен бастап алып шыққан, Өз даңқын мәңгілікке нық орнатқан Құдай Иеміз қазір қайда екен? Олар кең далада көсіле шапқан Сайгүліктей терең теңіз түбінен Ешбір сүрінбестен-ақ өте шықты."},
	{13, "14 Шұрайлы сайға түскен мал сияқты Халқына Жаратқан Иенің Рухы Сыйлады тыныштық пен амандықты. О, Құдай, осылай халқыңды Өзіңнің Ежелгі замандарда бастап жүрдің, Осы бір құдіретті істеріңмен Мәңгілік өшпейтін даңққа кенелдің."},
	{14, "15 Уа, Жаратқан Иеміз, енді көктен, Қасиетті, салтанатты мекеніңнен, Қайтадан бізге назар аудара гөр! Өз қайрат-жігерің мен құдіретің, Зор жанашырлығың мен қайырымың Қазіргі уақытта қайда екен? Неге рақымыңды аяйсың бізден?"},
	{15, "16 Себебі Сен рухани Әкемізсің, Түпкі аталарымыз Ыбырайым Мен Исраил бізді танымайды екен, Ал Сен, Жаратқан Ие, бізге Әкесің, Ежелден-ақ мынау болды өз есімің: Құтқарып алған Қамқоршымыз біздің."},
	{16, "17 Уа, Жаратқан Ие, бізге неліктен Жолыңнан тайып кетуге жол бердің? Неге жүрегіміздің қасарысып, Өзіңді сыйламауына жол бердің? Қайтып келе гөр қызметшілеріңнің, Меншікті руларыңның, мүддесі үшін!"},
	{17, "18 Сенің халқың біраз уақытқа ғана Ие болды қасиетті орныңа. Енді жауымыз ғибадатханаңды Тас-талқан етіп, таптап тастады."},
	{18, "19 Біз Өзің арнайы билік құрмаған, Сенің атыңмен еш те атамаған Бөтен халықтардай болып кеттік содан! (Сен неге жол беріп келесің бұған?)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view64() {
struct kk64 poems[] = {
	{1, "1 Уа, Жаратқан Ие, Сен көкті жарып, жерге зымырап түссең екен, шіркін! Сенің алдыңда таулар шайқалар еді!"},
	{2, "2 Бұл, өрттің сексеуілге тиіп, лаулап жанып, суды қайнатқанындай сұрапыл оқиға болар еді. Сонда Сенің есімің жауларыңа танымал болып, алдыңда халықтар дірілдер еді."},
	{3, "3 Ежелде Сен халқымыз күтпеген қорқынышты істер істедің. Көктен зымырап түсіп келгеніңде алдыңда таулар шайқалды да!"},
	{4, "4 Сен Өзіңді сеніммен күткендерге игіліктер жасайсың. Мұны істейтін бірде-бір өзге құдай жоқ! Бұрын-соңды ешкім ондай құдай туралы құлағымен естіп, көзімен көрген де емес."},
	{5, "5 Әділдікті қуана іске асырып, ақ жолыңмен жүріп, Өзіңді естен шығармайтындарды Сен рақыммен қарсы аласың. Алайда біз бұрыннан-ақ еркіңе қарсы күнә жасап келгендіктен, Сен қатты ашуландың. Енді біз қалай құтқарыла аламыз?"},
	{6, "6 Бәріміз де күнәға батып рухани ластанып кеттік! Күллі әділ істеріміздің өзі лас шүберектей жиренішті! Солып қалған жапыраққа ұқсаймыз, күнәларымыз бізді желдей ұшырып әкетеді."},
	{7, "7 Ал ешқайсымыз Саған сиынып, рақым етуіңді сұрап жалынып-жалбарынбаймыз. Сен бізден бас тартып, бізді күнәміздің кесірінен жойылуға қалдырдың."},
	{8, "8 Алайда, о, Жаратқан Ие, Сен рухани Әкемізсің. Сен құмырашыға, біз саз балшыққа ұқсаймыз. Бәріміз Сенің қолыңнан шыққан жаратылысыңбыз."},
	{9, "9 Уа, Жаратқан Ие, шексіз ашуланып, күнәларымызды есіңде мәңгілік сақтай көрме! Саған жалбарынамыз, бізге көз сала гөр, Сенің халқыңбыз ғой."},
	{10, "10 Өзіңе бағышталған қалаларың қиратылып, елсіз далаға айналды. Тіпті Сион тауы қаңырап бос қалып, Иерусалим қаласы тас-талқан болды:"},
	{11, "11 ата-бабаларымыз Сені мадақтаған киелі де салтанатты ғибадатханамыз өртеніп кетті! Біз үшін сондай қымбат нәрселердің бәрі де күйреді."},
	{12, "12 Осылай болғанда, уа, Жаратқан Ие, Өзіңді ұстап тұрмақсың ба? Үн-түнсіз қалып, бізді шексіз қинамақсың ба?!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view65() {
struct kk65 poems[] = {
	{1, "1 — Мен туралы сұрамағандарға Өзімді көрсеттім. Іздемегендер Мені таба алды. Маған сиынбаған халықты: Мен мұндамын, осында келіңдер! деп шақыра бердім."},
	{2, "2 Өз беттерімен жүріп, теріс жолға түсіп, қасарысқан халықты күні бойы құшақ жайып шақырумен болдым."},
	{3, "3 Бұл халық әрдайым көз алдымда күнә жасап, ашуымды туғызады. Жалған тәңірлерге арнаған бақтарда құрбандық шалып, кірпіш үстелдердің үстінде хош иісті заттарды да түтетеді."},
	{4, "4 Олар қабір бастарында отырып, құпия жерлерде түнеп, аруақтарға сиынады. Сонымен қатар арам ет жеп, оның жиренішті сорпаларын ыдыстарына құйып:"},
	{5, "5 Тоқта, маған жақындама! Мен әулие адаммын, деп менменсиді. Мұндай адамдар Мен үшін ащы түтін әрі күн ұзағына бықсып жанған от сияқты жеркенішті."},
	{6, "6 Біліп алыңдар, көз алдымда: Мен үндемей қалмаймын, еселерін толықтай қайтарамын! деген сөздер жазулы тұр."},
	{7, "7 Мен, Жаратқан Ие, мынаны айтамын: өз күнәларыңа қоса ата-бабаларыңның күнәларының да жазасын толықтай тарқызамын! Олар тау-төбелерде жалған тәңірлерге арнап хош иісті заттар түтетіп, Мені қорлайтын. Енді Мен оларға жасаған қылықтарына қарай жазаларын толығымен тартқызамын!"},
	{8, "8 Жаратқан Ие тағы мынаны айтады: — Жүзім шоғының аз да болса шырыны бар кезінде жұрт: Мұны лақтырып тастама, әлі де пайдасы бар ғой дейді. Сол секілді, Мен де қызметшілерімнің бәрін бірдей құртпай,"},
	{9, "9 Жақыптың үрім-бұтағын қайтадан өрбітіп шығармақпын, әрі Яһуда руынан да Менің таулы жеріме ие болатын ұрпақтарын өркендетіп таратпақпын. Өзім таңдап алған бұлар сол жерді иеленіп, сонда қоныстанып, Маған қызмет ететін болады."},
	{10, "10 Елдің батысындағы Шарон жазығы ұсақ мал отарларына жайылым және шығысындағы Ахор аңғары ірі қара табындарына тынығатын жер болады. Барлығы Маған бет бұрып сиынған халқымның меншігіне айналады."},
	{11, "11 Алайда Менен, Жаратқан Иеден, бас тартқан өзгелеріңе былай деймін: Сендер Өзіме бағышталған Сион тауын естеріңнен шығарып, Бақыт пен Тағдырды пір тұтасыңдар. Соларға арнап дастарқан жайып, дәмді шарапты толтыра құйып бересіңдер."},
	{12, "12 Бірақ сендердің тағдырларыңды Өзім шешіп қойдым: Жауларыңның алдында тізе бүгіп, семсерден қырыласыңдар. Себебі Мен шақырғанда жауап бермедіңдер, тіл қатқанымда сөзіме құлақ аспадыңдар. Қайта, көз алдымда зұлымдық жасап, Маған ұнамайтын нәрселерді таңдап алдыңдар."},
	{13, "13 Сондықтан Мен, Жаратушы Тәңір Ие, былай деймін: Біліп қойыңдар, Маған қызмет ететіндер тойына ішіп-жеп, ал сендер, зұлымдар, ашығып, шөлдейтін боласыңдар! Қызметшілерім шаттанғанда сендер ұятқа қаласыңдар!"},
	{14, "14 Олар көтеріңкі көңілмен ән шырқаса, сендер қинала айқайлап, жаралы жүрекпен еңіреп жылайтын боласыңдар."},
	{15, "15 Сендердің есімдерің Менің таңдап алғандарым үшін қарғыс іспетті болып қалады. Мен, Жаратушы Тәңір Ие, көздеріңді құртамын, ал адал қызметшілеріме жаңадан құрметті есім сыйлаймын."},
	{16, "16 Енді ел ішінде бата сұраған әркім Маған, Сөзіне адал шынайы Құдайға, сиынып бата сұрайды. Ант еткендер де Сөзіне адал шынайы Құдайдың атымен деп ант бермек. Сонда бұрынғы қиыншылықтар ұмытылып, бұдан былай көзіме түспейтін болады."},
	{17, "17 — Біліп алыңдар: Мен жаңа аспан мен жаңа жерді жаратпақпын. Бұрынғылар енді еске алынбай, ойға да келмейтін болады."},
	{18, "18 Сонда сендер жасағандарыма мәңгі бақи мәз болып шаттанасыңдар. Мен Иерусалим қаласы мен оның халқын рақат пен қуаныштың қайнар көзіне айналдырамын."},
	{19, "19 Өзім де Иерусалимге шаттанып, халқым үшін мәз-мейрам боламын. Енді қайтып қалада зар еңіреп жылаған дауыс естілмейді."},
	{20, "20 Санаулы күн ғана өмір сүріп шетінеген сәбилер, жасына жетпей өлетін кәрілер одан табылмайды. Жүз жасап қайтыс болған жас деп, ал жүзге жетпей өлген қарғысқа ұшыраған күнәкар деп саналады."},
	{21, "21 Халқым үй салса, сонда өзі тұратын, жүзімдік отырғызса, соның жемісін өзі жейтін болады."},
	{22, "22 Енді қайтып олардың үйлерін бөтен кісілер иемденіп тұрмайды, жүзімдіктерінің жемісін де жаулары жемейді. Халқым мықты ағаш сияқты ұзақ өмір сүретін болады. Менің таңдап алғандарым жұмыстарының өнімдерін ұзақ уақыт пайдаланып, бейнеттерінің зейнетін көреді."},
	{23, "23 Олар бекерге еңбек етпейді де, апатқа ұшырайтын балалар тумайды да. Себебі өздері мен ұрпақтары Өзім, Жаратқан Ие, жарылқаған үрім-бұтақ болады."},
	{24, "24 Маған сиынбастан бұрын Мен оларға жауап беремін, олар әлі сөйлеп жатқанда-ақ Мен өтініштеріне құлақ саламын."},
	{25, "25 Қасқыр мен қозы бірге бейбіт жайылып, арыстан сиырдай сабан жеп, жыланға топырақ жем болады. Бұдан былай ешкім де Өзіме арналған бүкіл Сион тауында жамандық жасап, зияндық келтірмейді. — Жаратқан Ие осыны нық айтады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view66() {
struct kk66 poems[] = {
	{1, "1 Жаратқан Ие мынаны айтады: Аспан Менің тағым, ал жер табан тіренішім сияқты. Сонда сендер Маған қандай үй салып бермексіңдер? Яки тынығып демалатын орным қай жер болмақ?!"},
	{2, "2 Осы әлем түгелдей Менің қолымнан шығып, пайда болды емес пе?! — деп ескертеді Жаратқан Ие. Ал Мен көз қырымды салатындар: күнәларына шын жүректен өкініп, сөзімді терең қастерлеп, іске асыратындар."},
	{3, "3 Алайда адамдар (екіжүзділік жасайды. Олар Маған арнап) бұқаларды құрбандыққа шалып, (сонымен қатар жалған тәңірлерге арнап) кісілерді де өлтіреді! Алдыма тоқтылары мен астықтан сый-тартуларын алып келушілер мойнын үзген иттерді және шошқаның қанын да ұсынады. Маған арнап хош иісті заттар түтетіп, пайдасыз тәңірлерге де мақтау айтады. Бұл адамдар Менің емес, өз жолдарын таңдап алды. Олар жасаған жексұрын қылықтарынан тіпті рақат табады."},
	{4, "4 Сол себепті Мен де оларды аяусыз жазалауды таңдап алдым. Өздері қатты қорқатын азаптарды бастарына түсіремін. Себебі Мен шақырғанда ешқайсысы жауап бермеді, Мен тіл қатқанда олар сөзіме құлақ аспады. Қайта, көз алдымда зұлымдық жасап, Маған ұнамайтын нәрселерді таңдап алды."},
	{5, "5 Жаратқан Иенің сөзін терең қастерлеп, орындайтындар, Оның мына айтқандарына ден қойыңдар: — Сендерді Маған бола жек көріп, шеттетіп келген бауырластарың: Жаратқан Ие Өзінің салтанатты ұлылығын паш етіп алсын! Мүмкін, сонда қуанғандарыңды көретін шығармыз деп мысқылдап жүр. Бірақ олар өздері масқара болады!"},
	{6, "6 Қаладан шығып жатқан у-шуға құлақ түріңдер! Ғибадатханадан айқай-шу естіледі. Жаратқан Ие жауларына лайықты жазаларын беріп жатыр."},
	{7, "7 Ал Құдайдың таңдаған қаласы толғатпай-ақ босанып, қиналмай-ақ ұл туған әйел секілді болады."},
	{8, "8 Мұндайды кім естіп, кім көрген? Бір күннің ішінде тұтастай бір ел туып, бүкіл халық пайда бола ала ма? Әрине, бола алмайды. Алайда Сион толғақ азабын шегер-шекпестен балалы болып, бір күнде-ақ тұрғындарға толатын болады."},
	{9, "9 — Айы-күніне жеткізе отырып, Мен Сионды қалайша босандырмаймын? Туу қабілетін сыйлай тұра, қалайша оның құрсағын бекітіп қоямын? — дейді астарлап Құдайың Жаратқан Ие."},
	{10, "10 Иерусалимді сүйетіндердің бәрі де, онымен бірге шаттана қуаныңдар! Азап шеккен бұл қала үшін қайғырған барлығың да, онымен бірге мәз-мейрам болыңдар!"},
	{11, "11 Сендер ана төсін еміп жұбанған сәбидей оның игіліктеріне тойынасыңдар. Ағыл-тегіл мол дәулетіне кенеліп, ләззатқа бөленесіңдер."},
	{12, "12 Өйткені Жаратқан Ие мынаны айтады: — Мен бұл қалаға амандық пен тыныштықты дариядай ағызып молынан сыйлаймын. Елдердің байлығын да оған тасқынды судай ағызамын. Сонда өздеріңді анасын еміп рақаттанған нәрестедей сезінесіңдер. Бұл, Сионның сендерді аялы алақанымен көтеріп алып жүріп, тізесіне салып, әлдилегені секілді тамаша болады."},
	{13, "13 Шешесінің бөбегін жұбатқанындай, Мен де сендерді жұбатпақпын. Иерусалимде жұбаныш табасыңдар."},
	{14, "14 Мұның бәрін көріп, шаттанып, көңілденесіңдер. Көк шөп секілді өсіп-өнетін боласыңдар. Осылай Жаратқан Ие Өзіне қызмет ететіндерді құдіретімен қорғап-қолдап, ал қарсы шыққандарға қаһарын төгетін болады."},
	{15, "15 Естеріңе алыңдар, Жаратқан Ие жалындаған от ішімен түсіп келеді. Оның соғыс күймелері құйындай құйғытады. Иеміз жауларына ашуланып, қаһарын төкпек. Оларды лаулаған отпен тоқтатады."},
	{16, "16 Иә, Жаратқан Ие адамзатқа шығарған үкімін отпен және семсерімен іске асырады. Ол сонда көбінің көзін құртады."},
	{17, "17 Өздерін жалған тәңірлерге бағыштағандардың бәрі бірдей жойылатын болады! — деп жариялайды Жаратқан Ие. — Олар тазару рәсімдерінен өтіп, киелі бақтарға кіреді. Солардың іштеріндегі тәңірсымаққа табынып, шошқа мен тышқан етін және басқа да жиренішті нәрселерді жейді."},
	{18, "18 Олардың істері мен ойларын білемін. Менің бүкіл халықтарды, әр түрлі тілде сөйлейтін ұлттарды жинайтын кезім жақындады. Олар келіп, құдіретті ұлылығымды көретін болады."},
	{19, "19 Мен араларында кереметтер істеп, билігімді паш етемін. Солардың аман қалғандарынан кейбіреулерін әлі де атағым мен ұлылығымды естіп-көрмеген алыстағы халықтарға жіберемін. Хабаршыларым батыстағы Тарсис жағына, Либияға, аты шулы садақшылардың елі Лүдияға, солтүстіктегі Тұбалға, Грекияға және аралдар мен теңіз жағалауларындағы басқа елдерге барып, сол халықтарға да асқан ұлылығымды жариялайтын болады."},
	{20, "20 Сонда күллі елдерден Маған арналған сый-тарту іспетті барлық бауырластарыңды ат, қашыр, желмаяларға немесе арба-күймелерге мінгізіп, Иерусалимдегі Өзіме бағышталған Сион тауына тездетіп алып келеді, — дейді Жаратқан Ие. — Бұл, Исраил халқының Маған арнаған сый-тартуларын таза ыдыстармен киелі үйіме алып келгені іспетті болады."},
	{21, "21 Мен осы кісілердің кейбіреулерін де таңдап алып, діни қызметкерлер және ғибадатханада қызмет көрсететін леуіліктер етіп тағайындаймын. — Жаратқан Ие осыларды нық айтады."},
	{22, "22 Мен жарататын жаңа аспан мен жаңа жердің көз алдымда мәңгі жойылмайтынындай, сендердің есімдерің де өшпейді, үрім-бұтақтарың да мәңгі көз алдымда болады, — деп уәде береді Жаратқан Ие."},
	{23, "23 — Сонда әрбір айдың басында және демалыс күні сайын бүкіл адамзаттың өкілдері Менің алдыма бас иіп сиынуға келетін болады. Жасаған Ие тағы мынаны айтады:"},
	{24, "24 Олар қаладан шыққанда Маған қарсы бас көтергендердің өліктерін көреді. Солардың тәндерін кеміретін құрттар өлмейді, жалындаған от та мәңгі сөнбейді. Осылай жазаланған күнәкарлар бүкіл адамзат үшін жексұрын болады."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};