#include <map>
#include <string>
class Bible37
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Дарийдің (парсы патшалығына) билік жүргізген екінші жылының алтыншы айының бірінші күні Жаратқан Ие Яһуда аймағының әкімі Салатиел ұлы Зоробабелге және бас діни қызметкер Ехосадық ұлы Ешуаға Өзінің Хаққай есімді пайғамбары арқылы сөзін арнап былай деді:"},
	{2, "2 Әлемнің Иесі мынаны айтады: Бұл халық: Жаратқан Иенің киелі үйін қайтадан салатын уақыт әлі келген жоқ! деп жүр."},
	{3, "3 Сондықтан Жаратқан Ие Хаққай пайғамбар арқылы тағы мына хабарын да жіберді:"},
	{4, "4 Осы киелі үй әлі де қирап жатқанда сендерге іштері ағаш тақтайлармен қапталған сәулетті үйлерде тұратын уақыт па?!"},
	{5, "5 Әлемнің Иесі енді мынаны айтады: Істеген іс-әрекеттеріңе ден қойып, ойланып алыңдар!"},
	{6, "6 Сендер көп еккенмен аз жинайсыңдар, тамақ жегенмен қарындарың тоймайды, сусын ішкенмен шөлдерің қанбайды, киім кигенмен жылынбайсыңдар, жалақы алғанмен оларың тесік қалтаға кетіп жатқандай болады."},
	{7, "7 Сол себепті Әлемнің Иесі тағы мынаны айтады: Істейтін іс-әрекеттеріңе ден қойып, ойланып алыңдар!"},
	{8, "8 Тауға шығып, бөренелер тасып әкеліп, киелі үйді қайтадан салыңдар! Осылайша Мен риза болып, атақ-даңқым жайылады, — деп бұйырады Жаратқан Ие. —"},
	{9, "9 Сендер мол өнім күткенмен, онысы аз болды. Ал үйлеріңе алып келгендеріңді Мен ұшырып жібердім. Неліктен? — деп сұрайды Әлемнің Иесі. — Менің киелі үйім қирап жатқанда сендер әрқайсың өз үйлеріңді сәндеп салуға асыққандарың себепті!"},
	{10, "10 Сондықтан да аспанның шығы әрі жердің өнімі сендерге берілмей келеді."},
	{11, "11 Мен жерлеріңдегі дала мен қыратқа қуаңшылық жібердім. Соның кесірі астық, жүзім шырыны мен зәйтүн майына, жалпы, жер беретін өнімнің барлығына әрі адамдар мен малға да тиді. Содан сендердің істеген барша еңбектерің құр бекер болуда."},
	{12, "12 Сонда Яһуданың әкімі Салатиел ұлы Зоробабел, бас діни қызметкер Ехосадық ұлы Ешуа және халықтың тірі қалғандарының барлығы олардың Құдайы Жаратқан Иенің Хаққай пайғамбар арқылы айтқандарына құлақ асты. Өйткені оны жіберген — олардың Құдайы Жаратқан Иенің Өзі болатын. Содан халық Жаратқан Иені терең қастерлей бастады."},
	{13, "13 Мұнан кейін Жаратқан Иенің хабаршысы Хаққай халыққа Оның мына уәдесін жеткізді: Мен сендермен бірге жүріп жар боламын! — дейді Жаратқан Ие. —"},
	{14, "14 Осылай Жаратқан Ие Яһуданың әкімі Зоробабелдің, бас діни қызметкер Ешуаның және қалған барлық халықтың рухын оятып, оларға қайрат-жігер дарытты. Сонда олар өздерінің Құдайы — Әлемнің Иесінің киелі үйіне барып, оны қайта салу жұмысына кірісті."},
	{15, "15 Бұл, Дарийдің патшалық құрған екінші жылының алтыншы айының жиырма төртінші күні болатын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Жетінші айдың жиырма бірінші күні Жаратқан Ие халыққа Хаққай пайғамбар арқылы сөзін арнап былай деді:"},
	{2, "2 Яһуданың әкімі Салатиел ұлы Зоробабелге, бас діни қызметкер Ехосадық ұлы Ешуаға және халықтың тірі қалған басқаларына енді мынаны айт:"},
	{3, "3 Осы киелі үйді оның бұрынғы салтанатында көргендерден араларыңда кім қалды? Ал қазір көріп тұрғандарың қандай? Бұрынғыға қарағанда ол сендерге түк еместей болып көрінбей ме?"},
	{4, "4 Дегенмен енді нығайып батыл бол, уа, Зоробабел! — дейді Жаратқан Ие. — Сен де нығайып батыл бол, уа, бас діни қызметкер Ехосадық ұлы Ешуа! Нығайып батыл болыңдар, уа, елдің бүкіл халқы! — деп шақырады Жаратқан Ие. — Еңбек етіңдер! Мен сендермен бірге жүріп жар боламын! — Әлемнің Иесі осы уәдені береді. —"},
	{5, "5 Мысырдан шыққандарында Мен осылай болады деп сендердің ата-бабаларыңмен Келісім жасағанмын. Бұдан былай да Менің Рухым араларыңда тұратын болады. Қорықпаңдар!"},
	{6, "6 Әлемнің Иесі мынаны да айтады: Біраздан кейін Мен тағы да аспан мен жерді, теңіз бен құрлықты шайқалтамын!"},
	{7, "7 Мен барлық халықтарды да шайқалтамын. Сонда халықтардың бәрі өздерінің ерекше бағалаған қазыналарын әкеліп, Мен бұл үйді салтанатты ұлылыққа кенелтемін, — деп уәде береді Әлемнің Иесі. —"},
	{8, "8 Күміс те менікі, алтын да Менікі, — дейді Әлемнің Иесі. —"},
	{9, "9 Бұл киелі үйдің болашақ салтанаты бұрынғы киелі үйдікінен де асып түседі, — деп нық айтады Әлемнің Иесі. — Осы жерде Мен амандық пен тыныштық сыйлаймын! — Әлемнің Иесінің Өзі осы уәдені береді."},
	{10, "10 Дарийдің патшалық құрған екінші жылының тоғызыншы айының жиырма төртінші күні Жаратқан Ие Хаққай пайғамбарға сөзін арнап былай деді:"},
	{11, "11 Әлемнің Иесі мынаны айтады: Діни қызметкерлерге Таурат заңы туралы мына сұрақты қой:"},
	{12, "12 Егер біреу құрбандықтың Құдайға бағышталған киелі етін бір нәрсеге орап алып бара жатқанда, онысы нанға, піскен етке, сусынға, зәйтүн майына немесе басқа бір тағамға тиіп кетсе, сол тағам Құдайға бағышталған киелі болып қала бере ме? — Діни қызметкерлер: — Жоқ, киелі болмайды, — деп жауап берді."},
	{13, "13 Хаққай сөзін сабақтап: — Ал егер өлікпен жанасып арамданған біреу осындай заттарға жанасып кетсе ше, олар да арамданып қала ма? — деп сұрады. Діни қызметкерлер: — Иә, арамданады, — деп жауап берді."},
	{14, "14 Сонда Хаққай былай деді: Жаратқан Ие мынаны айтады: Осы халықтың адамдары да (Маған толығымен бағынбағандықтарына бола) Менің көз алдымда арамданған. Сол себепті олардың істеп жүрген істері мен шалып жүрген құрбандықтарының бәрі де арамданған."},
	{15, "15 Бірақ осы күннен бастап басқаша болады! Маған бағышталған осы киелі үйдің алғашқы тасы қаланбай тұрып, қалай өмір сүргендеріңе ден қойып, ойланып алыңдар!"},
	{16, "16 Өнім жинайтын кезінде біреу бастыруға үйілген масақ бауларынан жиырма қап астық шығады деп дәметсе, расында одан тек он қап қана шығады. Шырын сыққыштан елу шелек жүзім шырынын аламын деп дәметсе, онда небәрі жиырма шелек қана шырын бар болып шығады."},
	{17, "17 Себебі Мен сендерді және істеген істеріңнің бәрін өсімдік татымен, қуаңшылықпен және бұршақпен зақымдадым. Әйтсе де сендер өкініп, Маған қайтып келмедіңдер, — деп ескертеді Жаратқан Ие."},
	{18, "18 Бүгін, тоғызыншы айдың жиырма төртінші күні, сендер Менің киелі үйімнің іргетасын қайтадан қалап болдыңдар. Бүгінгі күннен бастап не болатынына ден қойып ойланып алыңдар!"},
	{19, "19 Тұқым әлі де қамбаларыңда сақталып келеді, солай емес пе? (Демек, сендер әлі де егін егіп, жинаған жоқсыңдар.) Жүзім, анар, інжір және зәйтүн ағаштары да жемістерін әлі берген жоқ. Алайда бүгіннен бастап Мен сендерді жарылқайтын боламын!"},
	{20, "20 Сол айдың жиырма төртінші күні Жаратқан Ие Хаққай пайғамбарға тағы бір рет сөзін арнап былай деді:"},
	{21, "21 Яһуданың әкімі Зоробабелге мынаны жеткіз: Мен аспанды да, жерді де шайқалтамын,"},
	{22, "22 патшалықтардың тақтарын төңкеріп, басқа халықтардың мемлекеттерінің күш-қуатын жоямын. Мен соғыс күймелерін оларды айдайтындарымен қоса аударамын. Атты әскерлер де жерге құлап, бір-бірінің семсерінен қаза табады."},
	{23, "23 Жаратқан Ие тағы мынаны айтады: Сол күні, уа, қызметшім Салатиел ұлы Зоробабел, Мен сені өз қолымдағы мөрлі жүзігімдей беделді етіп тағайындаймын. Себебі Мен сені таңдап алдым. — Осы уәдені Әлемнің Иесінің Өзі берді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};