#include <map>
#include <string>
class Bible8
{
	struct kk1	{ int val; const char *msg; };
	struct kk2	{ int val; const char *msg; };
	struct kk3	{ int val; const char *msg; };
	struct kk4	{ int val; const char *msg; };
public:
static void view1() {
struct kk1 poems[] = {
	{1, "1 Исраилді билер басқарып тұрған заманда бірде елді аштық жайлады. Сонда Яһуда руының Бетлехем қаласынан бір ер адам әйелі мен екі ұлын ертіп, Исраилден көшіп кетті. Олар жат жұрттықтар ретінде Моаб елінде уақытша тұра тұрмақ болды."},
	{2, "2 Сол адамның аты Елімәлік, әйелінікі Нағима, ал екі ұлы Махлон мен Хилион еді. Олар ефраталықтар, Яһуда жеріндегі Бетлехем қаласының тұрғындары болатын. Осылай бұл отбасы Моаб еліне барып, сонда тұрып жатты."},
	{3, "3 Алайда күйеуі Елімәлік қайтыс болып, Нағима екі баласымен жесір қалды."},
	{4, "4 Ұлдары моабтық қыздарға үйленді, келіндерінің біреуінің аты Орпа, екіншісінікі Рут еді. Отбасы Моаб елінде он жылдай тұрғаннан кейін"},
	{5, "5 Нағиманың ұлдары Махлон мен Хилион да қайтыс болды. Сонымен әйел күйеуі мен ұлдарынан айырылып, жалғыз қалды."},
	{6, "6 Моаб елінде жүрген Нағима Жаратқан Ие Өзінің таңдап алған халқы Исраилді жарылқап, елде астықтың бітік шыққаны туралы естіді. Содан Нағима екі келінін ертіп Моаб жерінен өз еліне кері қайтуға жиналды."},
	{7, "7 Сонымен олар уақытша тұрған мекенжайын тастап, Яһуданың жеріне қарай сапарға шықты."},
	{8, "8 Жолшыбай Нағима келіндеріне: — Ал енді, сендер әке-шешелеріңнің үйлеріне қайтыңдар. Менің өзіме, марқұм ұлдарыма адал да мейірімді болып келдіңдер. Лайым сендерге сол үшін Жаратқан Ие рақымын түсіре көрсін!"},
	{9, "9 Ием сендерге жақсы күйеу мен жайлы баспана сыйлай көрсін! — деп батасын беріп, беттерінен сүйді. Бірақ олар зар еңіреп жылап:"},
	{10, "10 — Сізбен бірге біз де ел-жұртыңызға барайықшы, — деп өтінді."},
	{11, "11 Алайда Нағима: — Қыздарым, үйлеріңе қайтсаңдаршы! Маған несіне ересіңдер? Сендерге үйлене алатын басқа ұлдарым жоқ қой."},
	{12, "12 Кері қайтыңдар, қарақтарым! Өзім енді күйеуге шығуға кәрімін. Тіптен бүгін күйеуге шығып, ұлды болармын деген үмітім болған күнде де,"},
	{13, "13 олар ер жеткенше күте алар ма едіңдер? Соларға бола күйеуге шықпай жүре берер ме едіңдер? Жоқ, қыздарым, Жаратқан Иенің маған жіберген қайғысын бірге бөлісіңдер деп сендерді ұстауым дұрыс болмас, — деп жауап берді."},
	{14, "14 Екеуі бұрынғыдан бетер зар еңіреп жылады. Соңында Орпа енесінің бетінен сүйіп қоштасты, ал Рут одан айырылмай қалып қойды."},
	{15, "15 Нағима Рутқа: — Көрдің ғой, абысының ел-жұртына және сиынатын тәңірлеріне қайта оралды. Сен де оның ізімен кері қайтсаңшы, — деді."},
	{16, "16 Алайда Рут: — Сізді тастап, қайта оралуға мені қинай көрмеңіз. Сіз қайда барсаңыз, мен де сонда барамын. Қайда тұрсаңыз, мен де сонда тұрамын. Сіздің халқыңыз менің халқым, сіздің Құдайыңыз менің Құдайым болады!"},
	{17, "17 Қайда өлсеңіз, мен де сонда өліп, жерленемін. Егер мен бұ дүниеден кеткенше сізден ажырассам, мені Жаратқан Ие жазалаған үстіне жазалай түссін! — деп тұрып алды."},
	{18, "18 Руттың өзімен бірге жүруге белді бекем буғанына көзі жеткен соң, Нағима оны әрі қарай үгіттеуін доғарды."},
	{19, "19 Сонымен екеуі Бетлехемді бетке алып, жүріп кетті. Оған жеткенде, қала халқы толқып: — Ойбай-ау, мынау Нағима ғой?! — десті."},
	{20, "20 Сонда ол: — Мені Нағима (Бақытты) емес, Мара (Қайғылы) деп атаңдар, — деді. — Себебі құдіреті шексіз Құдай маған қайғылы өмір бұйырды."},
	{21, "21 Бұл жерден үй ішіміз түгел аттанған едік, ал енді Жаратқан Ие менің жалғыз қара басымды ғана қайтарып отыр. Сендер мені несіне Бақытты деп атайсыңдар? Жаратқан Ие маған қарсы шығып, құдіреті шексіз Құдай басыма бақытсыздық түсірді ғой."},
	{22, "22 Осылай Нағима моабтық келіні Рутпен бірге Моаб елінен қайта оралған еді. Олар Бетлехем қаласына келгенде арпаны жаңа жинай бастаған кез болатын."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct kk2 poems[] = {
	{1, "1 Нағиманың марқұм күйеуі Елімәліктің Боғоз есімді аталас туысы бар еді. Боғоз абыройлы да ауқатты кісі болатын."},
	{2, "2 Бір күні моабтық Рут Нағимаға: — Мен егіндікке барайын. Қайырымды біреу кездесіп қалар, соның артынан жүріп, масақ терейін, — деді. — Жақсы, қызым, бара ғой, — деп енесі келісті."},
	{3, "3 Рут егістікке барып, орақшылардың соңынан жүріп, жинағанда қалып қойған масақтарды тере бастады. Бұл жер танабы Елімәліктің туысы Боғоздың меншігі болып шықты."},
	{4, "4 Сол кезде Бетлехемнен Боғоз да келіп, орақшыларымен: — Ассалаумағалайкүм! — деп амандасып, олар: — Уағалайкүмассалам! — деп жауап қайырды."},
	{5, "5 Боғоз олардың басқарушысынан: — Мынау кімнің қызы? — деп сұрағанда,"},
	{6, "6 ол: — Бұл — Моаб елінен Нағимаға еріп келген моабтық жас келіншек."},
	{7, "7 Ол орақшылардың артынан жүріп, баулардың арасынан түсіп қалған масақтарды теруге рұқсат сұрады. Таң атқаннан бері еңбектеніп жүр, күркеде аз-ақ демалды, — деп жауап берді."},
	{8, "8 Содан Боғоз Рутқа тіл қатып: — Қызым, сөзіме құлақ сал. Басқаның егістігіне масақ теруге бармай-ақ қой. Осында менің қызметші қыздарымның қасында жүріп, тере бер."},
	{9, "9 Қай жақта орып жатқандарын байқап жүріп, қыздардың соңынан ер. Мен қызметші жігіттеріме саған тиіспеуге бұйырдым. Шөлдегенде барып, олар толтырып қойған құмыралардан су іше бер, — деді."},
	{10, "10 Таңғалған Рут: — Қалайша сіз жат жерлік маған сондай қайырымдылықпен қарайсыз? — деп, Боғозға иіліп тағзым етті."},
	{11, "11 — Сенің күйеуің өлгеннен кейін енеңе қалай көмектескеніңді, әке-шешеңді, еліңді тастап, бұрын білмеген халық арасына көшіп келіп, бірге тұрып жатқаныңды мен түгелдей естіп білдім."},
	{12, "12 Осы істеген жақсылықтарың Жаратқан Иеден қайтсын! Сен Исраил сиынатын Құдай — Жаратқан Иенің қанаты астынан пана іздеп келдің. Ол сені молынан жарылқасын! —"},
	{13, "13 Сонда Рут: — Мырзам, маған әрдайым оң көзіңізбен қарасаңыз екен. Сіз жылы сөзіңізбен жүрегіме жігер құйдыңыз. Ал мен ең болмағанда күңдеріңіздің бірі де емеспін, — деді."},
	{14, "14 Түскі тамақ кезінде Боғоз: — Мұнда кел. Нанымыздан ауыз тиіп, сусынымызға батырып же, — деп Рутты шақырды. Ол орақшылардың қасына отырғанда, Боғоз оған қуырылған арпадан берді. Рут тойғанша жеп, артылып та қалды."},
	{15, "15 Содан кейін тұрып, жұмысына оралды. Ал Боғоз қызметшілеріне былай деп айтып қойған еді: — Рут жаңа орылған масақтардың арасынан да тере берсін, оны ренжітпеңдер!"},
	{16, "16 Қайта, жинап алсын деп, байлайтын масақтарыңнан әдейі тастап та кетіңдер. Қалай болғанда да оған ұрыспаңдар!"},
	{17, "17 Рут осылай кешке дейін масақ терді. Соңында ол жинағанын бастырып, желге ұшырып қауызынан тазартқанда, бір үлкен себетке сиярдай арпа шықты."},
	{18, "18 Келіні арпаны қалаға алып барып, енесіне көрсетті. Оған түскі астан артылып қалған тамағын да алып келді."},
	{19, "19 — Өй, бүгін қайдан масақ тердің? Қайда жұмыс істедің? Саған оң көзімен қараған адамды Құдай жарылқасын! — деп енесі таңғалды. Рут оған: — Бүгін Боғоз деген адамның егістігінде жұмыс істедім, — деп білдіргенде,"},
	{20, "20 енесі: — Тірілер мен өлгендерге қайырымын аямаған сол адамды Жаратқан Ие жарылқасын! — деді. Содан соң: — Боғоз — жақын қайындарымыздың біреуі. Ол бізге (Таурат заңына сәйкес) туысқан қамқоршы бола алады, — деп қосты."},
	{21, "21 — Әлгі кісі маған егіні орылып біткенше қызметшілерінің соңынан жүріп, теруіме де рұқсат етті, — деді Рут."},
	{22, "22 Сонда Нағима: — Қызым, сол адамның қызметші қыздарымен бірге жүргенің жақсы болады. Бөтен егісте саған біреулердің тиісуі де мүмкін, — деп келісті."},
	{23, "23 Сонымен Рут енесінің қолында тұрып, арпа мен бидайдың ору мерзімі біткенше Боғоздың қызметші қыздарының қасында жүріп, масақ тере берді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct kk3 poems[] = {
	{1, "1 Бір күні Нағима: — Қызым, саған жақсы болу үшін жайлы баспана тауып берсем, қалай болар еді? — деп құлақ қағыс етті."},
	{2, "2 — Сен қызметші қыздарымен бірге жүрген Боғоз — біздің ет жақын қайнымыз ғой. Ол бүгін кеште қырманда арпасын ұшырып, тазартып жатыр екен."},
	{3, "3 Кәне, жуынып-шайынып, иісмай жақ та, әдемі киініп алып, қырманға бар. Бірақ Боғоз кешкі асын ішіп-жеп болмайынша көзіне түспе."},
	{4, "4 Ол ұйқыға кіріскенде жатқан жерін біліп ал. Кейін сонда барып, жамылғысының етегін аздап көтеріп, аяқ жағына жата кет. (Осылай сен Боғоздың өзіңе қамқоршы болуын сұраған тілегіңді білдіресің.) Әрі қарай заңды түрде не істеу керек екенін оның өзі айтар."},
	{5, "5 — Айтқаныңыздың бәрін істеймін, — деп жауап берді келіні."},
	{6, "6 Содан қырман басына барып, енесінің тапсырғандарын орындады."},
	{7, "7 Ішіп-жеп, көңілі көтерілген Боғоз үйілген астықтың шет жағына жатып, ұйықтап қалғаннан кейін, Рут білдіртпей жамылғысын аздап көтеріп, аяқ жағына жата кетті."},
	{8, "8 Түн ортасында Боғоз орнынан аударылып, шошып оянды. Аяқ жағында бір әйел жатыр екен! Ол абыржып:"},
	{9, "9 — Өй, сен кімсің? — деп сұрады. — Мен Рутпын ғой, мырза. Мені қанатыңыздың астына ала көріңіз, әмеңгерім бола алатын қайнағам емессіз бе? — деп жауап берді ол."},
	{10, "10 Сонда Боғоз былай деді: — Қалқам, Жаратқан Ие сені жарылқасын! Мына игі ісің бүгінге дейін енеңе жасап келген жақсылығыңнан да асып түсті! Сенің бай болсын, кедей болсын жас жігіттердің артынан жүгірмегенің жөн болды."},
	{11, "11 Енді уайымдамай-ақ қой, қарағым. Мен өтінішіңді түгелдей орындаймын. Қала халқының бәрі сенің үлгілі әйел екеніңді біледі."},
	{12, "12 Менің саған әмеңгер бола алатын қайнағаң екенім рас. Бірақ менен де жақын қайның бар."},
	{13, "13 Бүгін осында түнеп шық. Ертең сол адам саған әмеңгер болуға келіссе, онда жақсы, солай болсын. Ал егер ол бас тартса, мәңгі тірі Жаратқан Иенің алдындағы адал сөзім: онда мен саған әмеңгерің болып үйленемін. Ал әзірше таңға дейін осы жерде ұйықтай бер."},
	{14, "14 Осылай Рут сол жерде таң атқанша ұйықтап, адамдар әлі бір-бірінің бет-жүзін ажырата алмайтын қараңғы кезде тұрды. Боғоз (өсек тарап кетпеу үшін): Әйелдің қырманға келгенін ешкім білмесін, — деген еді."},
	{15, "15 Рут қайтып кетпес бұрын Боғоз: Жамылғыңды жайып ұстай ғой, — деп, соған алты себеттей арпа құйып, буып-түйіп, Рутқа арқалатып жіберді. Өзі де қала жаққа жөнелді."},
	{16, "16 Рут енесіне келгенде Нағима: — Қалай болды, қызым? — деп сұрады. Келіні оған сол адамның не істеп, не қойғанын түгелдей айтып беріп:"},
	{17, "17 — Ол маған Енеңе құр қол қайтпа деп, мына алты себеттей арпаны беріп жіберді! — деп қосты. Сонда енесі:"},
	{18, "18 — Соңы немен бітерін білгенше тоса тұр, қызым. Бұл кісі бүгін осы істі аяқтамай тыным таппайды, — деп түйді."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct kk4 poems[] = {
	{1, "1 Боғоз қала қақпасының қасындағы алаңға барып отырды. Қараса, өзі Рутқа айтқан туысқаны қасынан өтіп бара жатыр екен. Боғоз оған: Туысқан, мұнда келіп, отыра тұр, — деді. Ол қасына келіп, жайғасқаннан кейін"},
	{2, "2 Боғоз қаланың он ақсақалын шақырып алып: Қасымызға отырсаңыздар екен, — деп өтінді. Содан ақсақалдар да жайғасып отырды."},
	{3, "3 Боғоз жаңағы туысқанына қарап былай деп сөз бастады: — Моаб елінен қайтып келген Нағима ағайынымыз Елімәлікке тиісті мұралық жер үлесін сатпақшы."},
	{4, "4 Соны сенің құлағыңа салғым келеді. Халқымның ақсақалдарының және мына отырған жұрттың алдында саған ұсыныс жасаймын: соны сен сатып ал. Егер сол отбасының қамқоршысы болғың келсе, бола бер. Ал бас тартсаң, ашығын айт, мен білейін. Себебі қамқоршы бола алатын ең жақын туысқан сенсің, сенен кейінгі кезек менікі. — Туысы: — Жарайды, құнын төлеп, сатып алайын, — деді."},
	{5, "5 Сонда Боғоз: — Егер сен Нағимадан жерді сатып алсаң, онда марқұмның моабтық жесір келіні Руттың әмеңгері болып соған үйленесің. Рут ұлды болғанда тұңғыш ұлы марқұмның ұрпағы деп есептелініп, мұралық жер үлесін сол иемденбек, — деді."},
	{6, "6 Бұған туысы: — Олай болса, жерді сатып ала алмаймын. Бұл өзімнің мұралық үлесіме нұқсан келтірмек. Одан да сенің қамқоршы болып, жерді сатып алғаның жөн. Ал менің қолымнан келмейді, — деп жауап берді."},
	{7, "7 Ежелгі заманда Исраилде мынадай дәстүр бар болатын: егер біреу туысқан қамқоршы ретіндегі борышын басқа біреуге аударса, онда ол бұл істі растау үшін бір аяқкиімін шешіп алып, сол адамға беруге тиісті еді."},
	{8, "8 Сондықтан туысқаны Жерді өзің сатып ал дегеннен кейін Боғозға аяқкиімін шешіп берді."},
	{9, "9 Сонымен Боғоз айналасындағы ақсақалдар мен барлық жұртқа қарап былай деді: — Бүгін сіздер менің Нағимадан Елімәліктің, Хилионның және Махлонның бүкіл меншігін сатып алғандығыма куәсіздер."},
	{10, "10 Мен, сондай-ақ, марқұмның ұрпағын жалғастырып, соған барлық мұрасын қалдыру үшін Махлонның жесірі моабтық Рутты әйелдікке аламын. Осылай марқұмның аты өз әулеті мен қала шежіресінен өшуден аман сақталмақ. Сіздер бүгін соған куәсіздер."},
	{11, "11 Ақсақалдар және қақпа алдындағы алаңда жиналған барлық адамдар: — Иә, куәміз, — деп растады. Олар Боғозды құттықтап: — Жаратқан Ие сенің үйіңе кіретін бұл әйелді Исраилдің үрім-бұтағын таратқан Рахила мен Лиядай ұрпақты ете көрсін! Сен Ефрата аймағында күшті болып, атың Бетлехемде жасасын!"},
	{12, "12 Тамар ата-тегіміз Яһудаға Тамар Паресті туып беріп, үлкен әулетті таратқандай, Жаратқан Ие осы жас әйелден сыйлайтын ұрпақтарың арқылы сені де үбірлі-шүбірлі қыла көрсін! — деп баталарын берді."},
	{13, "13 Осылай Боғоз той жасап Рутқа үйленді. Жаратқан Иенің жарылқауымен Руттың аяғы ауырлап, ұл туды."},
	{14, "14 Әйелдер Нағиманы құттықтап: Жаратқан Ие мадақталсын! Енді Ол сені қамқорлайтын мұрагермен қамтамасыз етті. Баланың атағы Исраилге жайылсын!"},
	{15, "15 Ол өміріңді қуанышқа кенелтіп, қартайған шағыңда сүйенішің болады. Себебі оны туған — өзіңді жақсы көріп, соншама адал болып келген келінің. Осы келінің саған жеті ұлдан да артық! — деді."},
	{16, "16 Нағима нәрестені қолына алып, бауырына басып, бағып-қақты."},
	{17, "17 Көрші әйелдер: Бұл — Нағима үшін туылған ұл, — деп, оған Ғабит деген есім берді. Ғабит Есейдің әкесі, Дәуіттің атасы болды."},
	{18, "18 Парес әулетінің тарау тегі мынау: Парестен Хесрон,"},
	{19, "19 Хесроннан Рам, Рамнан Әминадап,"},
	{20, "20 Әминадаптан Нағасон, Нағасоннан Салмон,"},
	{21, "21 Салмоннан Боғоз, Боғоздан Ғабит,"},
	{22, "22 Ғабиттен Есей, ал Есейден Дәуіт туды."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};