#include <map>
#include <string>
class Bible56
{
	struct ara1	{ int val; const char *msg; };
	struct ara2	{ int val; const char *msg; };
	struct ara3	{ int val; const char *msg; };
public:
static void view1() {
struct ara1 poems[] = {
	{1, "1 بولس عبد الله ورسول يسوع المسيح لاجل ايمان مختاري الله ومعرفة الحق الذي هو حسب التقوى"},
	{2, "2 على رجاء الحياة الابدية التي وعد بها الله المنزه عن الكذب قبل الازمنة الازلية"},
	{3, "3 وانما اظهر كلمته في اوقاتها الخاصة بالكرازة التي اؤتمنت انا عليها بحسب امر مخلّصنا الله"},
	{4, "4 الى تيطس الابن الصريح حسب الايمان المشترك نعمة ورحمة وسلام من الله الآب والرب يسوع المسيح مخلّصنا"},
	{5, "5 من اجل هذا تركتك في كريت لكي تكمل ترتيب الامور الناقصة وتقيم في كل مدينة شيوخا كما اوصيتك"},
	{6, "6 ان كان احد بلا لوم بعل امرأة واحدة له اولاد مؤمنون ليسوا في شكاية الخلاعة ولا متمردين"},
	{7, "7 لانه يجب ان يكون الاسقف بلا لوم كوكيل الله غير معجب بنفسه ولا غضوب ولا مدمن الخمر ولا ضرّاب ولا طامع في الربح القبيح"},
	{8, "8 بل مضيفا للغرباء محبا للخير متعقلا بارا ورعا ضابطا لنفسه"},
	{9, "9 ملازما للكلمة الصادقة التي بحسب التعليم لكي يكون قادرا ان يعظ بالتعليم الصحيح ويوبّخ المناقضين"},
	{10, "10 فانه يوجد كثيرون متمردين يتكلمون بالباطل ويخدعون العقول ولا سيما الذين من الختان"},
	{11, "11 الذين يجب سد افواههم فانهم يقلبون بيوتا بجملتها معلّمين ما لا يجب من اجل الربح القبيح"},
	{12, "12 قال واحد منهم. وهو نبي لهم خاص. الكريتيون دائما كذابون وحوش رديّة بطون بطالة"},
	{13, "13 هذه الشهادة صادقة. فلهذا السبب وبخهم بصرامة لكي يكونوا اصحاء في الايمان"},
	{14, "14 لا يصغون الى خرافات يهودية ووصايا اناس مرتدين عن الحق"},
	{15, "15 كل شيء طاهر للطاهرين واما للنجسين وغير المؤمنين فليس شيء طاهرا بل قد تنجس ذهنهم ايضا وضميرهم"},
	{16, "16 يعترفون بانهم يعرفون الله ولكنهم بالاعمال ينكرونه اذ هم رجسون غير طائعين ومن جهة كل عمل صالح مرفوضون"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ara2 poems[] = {
	{1, "1 واما انت فتكلم بما يليق بالتعليم الصحيح"},
	{2, "2 ان يكون الاشياخ صاحين ذوي وقار متعقلين اصحاء في الايمان والمحبة والصبر"},
	{3, "3 كذلك العجائز في سيرة تليق بالقداسة غير ثالبات غير مستعبدات للخمر الكثير معلمات الصلاح"},
	{4, "4 لكي ينصحن الحدثات ان يكنّ محبات لرجالهنّ ويحببن اولادهنّ"},
	{5, "5 متعقلات عفيفات ملازمات بيوتهنّ صالحات خاضعات لرجالهنّ لكي لا يجدف على كلمة الله"},
	{6, "6 كذلك عظ الاحداث ان يكونوا متعقلين"},
	{7, "7 مقدما نفسك في كل شيء قدوة للاعمال الحسنة ومقدما في التعليم نقاوة ووقارا وإخلاصا"},
	{8, "8 وكلاما صحيحا غير ملوم لكي يخزى المضاد اذ ليس له شيء رديء يقوله عنكم"},
	{9, "9 والعبيد ان يخضعوا لسادتهم ويرضوهم في كل شيء غير مناقضين"},
	{10, "10 غير مختلسين بل مقدمين كل امانة صالحة لكي يزيّنوا تعليم مخلّصنا الله في كل شيء"},
	{11, "11 لانه قد ظهرت نعمة الله المخلّصة لجميع الناس"},
	{12, "12 معلّمة ايانا ان ننكر الفجور والشهوات العالمية ونعيش بالتعقل والبر والتقوى في العالم الحاضر"},
	{13, "13 منتظرين الرجاء المبارك وظهور مجد الله العظيم ومخلّصنا يسوع المسيح"},
	{14, "14 الذي بذل نفسه لاجلنا لكي يفدينا من كل اثم ويطهر لنفسه شعبا خاصّا غيورا في اعمال حسنة"},
	{15, "15 تكلم بهذه وعظ ووبّخ بكل سلطان. لا يستهن بك احد"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ara3 poems[] = {
	{1, "1 ذكّرهم ان يخضعوا للرياسات والسلاطين ويطيعوا ويكونوا مستعدين لكل عمل صالح"},
	{2, "2 ولا يطعنوا في احد ويكونوا غير مخاصمين حلماء مظهرين كل وداعة لجميع الناس"},
	{3, "3 لاننا كنا نحن ايضا قبلا اغبياء غير طائعين ضالين مستعبدين لشهوات ولذّات مختلفة عائشين في الخبث والحسد ممقوتين مبغضين بعضنا بعضا"},
	{4, "4 ولكن حين ظهر لطف مخلّصنا الله واحسانه"},
	{5, "5 لا باعمال في بر عملناها نحن بل بمقتضى رحمته خلّصنا بغسل الميلاد الثاني وتجديد الروح القدس"},
	{6, "6 الذي سكبه بغنى علينا بيسوع المسيح مخلّصنا"},
	{7, "7 حتى اذا تبررنا بنعمته نصير ورثة حسب رجاء الحياة الابدية"},
	{8, "8 صادقة هي الكلمة. واريد ان تقرر هذه الامور لكي يهتم الذين آمنوا بالله ان يمارسوا اعمالا حسنة. فان هذه الامور هي الحسنة والنافعة للناس"},
	{9, "9 واما المباحثات الغبية والانساب والخصومات والمنازعات الناموسية فاجتنبها لانها غير نافعة وباطلة"},
	{10, "10 الرجل المبتدع بعد الانذار مرة ومرتين اعرض عنه"},
	{11, "11 عالما ان مثل هذا قد انحرف وهو يخطئ محكوما عليه من نفسه"},
	{12, "12 حينما ارسل اليك ارتيماس او تيخيكس بادر ان تأتي اليّ الى نيكوبوليس لاني عزمت ان اشتي هناك"},
	{13, "13 جهز زيناس الناموسي وابلّوس باجتهاد للسفر حتى لا يعوزهما شيء"},
	{14, "14 وليتعلّم من لنا ايضا ان يمارسوا اعمالا حسنة للحاجات الضرورية حتى لا يكونوا بلا ثمر"},
	{15, "15 يسلم عليك الذين معي جميعا. سلم على الذين يحبوننا في الايمان. النعمة مع جميعكم. آمين"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};