#include <map>
#include <string>
class Bible49
{
	struct ara1	{ int val; const char *msg; };
	struct ara2	{ int val; const char *msg; };
	struct ara3	{ int val; const char *msg; };
	struct ara4	{ int val; const char *msg; };
	struct ara5	{ int val; const char *msg; };
	struct ara6	{ int val; const char *msg; };
public:
static void view1() {
struct ara1 poems[] = {
	{1, "1 بولس رسول يسوع المسيح بمشيئة الله الى القديسين الذين في افسس والمؤمنون في المسيح يسوع"},
	{2, "2 نعمة لكم وسلام من الله ابينا والرب يسوع المسيح"},
	{3, "3 مبارك الله ابو ربنا يسوع المسيح الذي باركنا بكل بركة روحية في السماويات في المسيح"},
	{4, "4 كما اختارنا فيه قبل تأسيس العالم لنكون قديسين وبلا لوم قدامه في المحبة"},
	{5, "5 اذ سبق فعيّننا للتبني بيسوع المسيح لنفسه حسب مسرة مشيئته"},
	{6, "6 لمدح مجد نعمته التي انعم بها علينا في المحبوب"},
	{7, "7 الذي فيه لنا الفداء بدمه غفران الخطايا حسب غنى نعمته"},
	{8, "8 التي اجزلها لنا بكل حكمة وفطنة"},
	{9, "9 اذ عرّفنا بسر مشيئته حسب مسرته التي قصدها في نفسه"},
	{10, "10 لتدبير ملء الازمنة ليجمع كل شيء في المسيح ما في السموات وما على الارض في ذاك"},
	{11, "11 الذي فيه ايضا نلنا نصيبا معيّنين سابقا حسب قصد الذي يعمل كل شيء حسب رأي مشيئته"},
	{12, "12 لنكون لمدح مجده نحن الذين قد سبق رجاؤنا في المسيح"},
	{13, "13 الذي فيه ايضا انتم اذ سمعتم كلمة الحق انجيل خلاصكم الذي فيه ايضا اذ آمنتم ختمتم بروح الموعد القدوس"},
	{14, "14 الذي هو عربون ميراثنا لفداء المقتنى لمدح مجده"},
	{15, "15 لذلك انا ايضا اذ قد سمعت بايمانكم بالرب يسوع ومحبتكم نحو جميع القديسين"},
	{16, "16 لا ازال شاكرا لاجلكم ذاكرا اياكم في صلواتي"},
	{17, "17 كي يعطيكم اله ربنا يسوع المسيح ابو المجد روح الحكمة والاعلان في معرفته"},
	{18, "18 مستنيرة عيون اذهانكم لتعلموا ما هو رجاء دعوته وما هو غنى مجد ميراثه في القديسين"},
	{19, "19 وما هي عظمة قدرته الفائقة نحونا نحن المؤمنين حسب عمل شدة قوته"},
	{20, "20 الذي عمله في المسيح اذ اقامه من الاموات واجلسه عن يمينه في السماويات"},
	{21, "21 فوق كل رياسة وسلطان وقوة وسيادة وكل اسم يسمى ليس في هذا الدهر فقط بل في المستقبل ايضا"},
	{22, "22 واخضع كل شيء تحت قدميه واياه جعل راسا فوق كل شيء للكنيسة"},
	{23, "23 التي هي جسده ملء الذي يملأ الكل في الكل"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ara2 poems[] = {
	{1, "1 وانتم اذ كنتم امواتا بالذنوب والخطايا"},
	{2, "2 التي سلكتم فيها قبلا حسب دهر هذا العالم حسب رئيس سلطان الهواء الروح الذي يعمل الآن في ابناء المعصية"},
	{3, "3 الذين نحن ايضا جميعا تصرفنا قبلا بينهم في شهوات جسدنا عاملين مشيئات الجسد والافكار وكنا بالطبيعة ابناء الغضب كالباقين ايضا"},
	{4, "4 الله الذي هو غني في الرحمة من اجل محبته الكثيرة التي احبنا بها"},
	{5, "5 ونحن اموات بالخطايا احيانا مع المسيح. بالنعمة انتم مخلّصون"},
	{6, "6 واقامنا معه واجلسنا معه في السماويات في المسيح يسوع"},
	{7, "7 ليظهر في الدهور الآتية غنى نعمته الفائق باللطف علينا في المسيح يسوع"},
	{8, "8 لانكم بالنعمة مخلّصون بالايمان وذلك ليس منكم. هو عطية الله"},
	{9, "9 ليس من اعمال كي لا يفتخر احد"},
	{10, "10 لاننا نحن عمله مخلوقين في المسيح يسوع لاعمال صالحة قد سبق الله فاعدها لكي نسلك فيها"},
	{11, "11 لذلك اذكروا انكم انتم الامم قبلا في الجسد المدعوين غرلة من المدعو ختانا مصنوعا باليد في الجسد"},
	{12, "12 انكم كنتم في ذلك الوقت بدون مسيح اجنبيين عن رعوية اسرائيل وغرباء عن عهود الموعد لا رجاء لكم وبلا اله في العالم"},
	{13, "13 ولكن الآن في المسيح يسوع انتم الذين كنتم قبلا بعيدين صرتم قريبين بدم المسيح"},
	{14, "14 لانه هو سلامنا الذي جعل الاثنين واحدا ونقض حائط السياج المتوسط"},
	{15, "15 اي العداوة. مبطلا بجسده ناموس الوصايا في فرائض لكي يخلق الاثنين في نفسه انسانا واحدا جديدا صانعا سلاما"},
	{16, "16 ويصالح الاثنين في جسد واحد مع الله بالصليب قاتلا العداوة به"},
	{17, "17 فجاء وبشركم بسلام انتم البعيدين والقريبين"},
	{18, "18 لان به لنا كلينا قدوما في روح واحد الى الآب"},
	{19, "19 فلستم اذا بعد غرباء ونزلا بل رعية مع القديسين واهل بيت الله"},
	{20, "20 مبنيين على اساس الرسل والانبياء ويسوع المسيح نفسه حجر الزاوية"},
	{21, "21 الذي فيه كل البناء مركبا معا ينمو هيكلا مقدسا في الرب"},
	{22, "22 الذي فيه انتم ايضا مبنيون معا مسكنا للّه في الروح"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ara3 poems[] = {
	{1, "1 بسبب هذا انا بولس اسير المسيح يسوع لاجلكم ايها الامم"},
	{2, "2 ان كنتم قد سمعتم بتدبير نعمة الله المعطاة لي لاجلكم"},
	{3, "3 انه باعلان عرّفني بالسر. كما سبقت فكتبت بالايجاز"},
	{4, "4 الذي بحسبه حينما تقرأونه تقدرون ان تفهموا درايتي بسر المسيح"},
	{5, "5 الذي في اجيال أخر لم يعرف به بنو البشر كما قد أعلن الآن لرسله القديسين وانبيائه بالروح"},
	{6, "6 ان الامم شركاء في الميراث والجسد ونوال موعده في المسيح بالانجيل"},
	{7, "7 الذي صرت انا خادما له حسب موهبة نعمة الله المعطاة لي حسب فعل قوته"},
	{8, "8 لي انا اصغر جميع القديسين أعطيت هذه النعمة ان ابشر بين الامم بغنى المسيح الذي لا يستقصى"},
	{9, "9 وانير الجميع في ما هو شركة السر المكتوم منذ الدهور في الله خالق الجميع بيسوع المسيح"},
	{10, "10 لكي يعرّف الآن عند الرؤساء والسلاطين في السماويات بواسطة الكنيسة بحكمة الله المتنوعة"},
	{11, "11 حسب قصد الدهور الذي صنعه في المسيح يسوع ربنا"},
	{12, "12 الذي به لنا جراءة وقدوم بايمانه عن ثقة"},
	{13, "13 لذلك اطلب ان لا تكلّوا في شدائدي لاجلكم التي هي مجدكم"},
	{14, "14 بسبب هذا احني ركبتيّ لدى ابي ربنا يسوع المسيح"},
	{15, "15 الذي منه تسمى كل عشيرة في السموات وعلى الارض"},
	{16, "16 لكي يعطيكم بحسب غنى مجده ان تتأيدوا بالقوة بروحه في الانسان الباطن"},
	{17, "17 ليحل المسيح بالايمان في قلوبكم"},
	{18, "18 وانتم متأصلون ومتأسسون في المحبة حتى تستطيعوا ان تدركوا مع جميع القديسين ما هو العرض والطول والعمق والعلو"},
	{19, "19 وتعرفوا محبة المسيح الفائقة المعرفة لكي تمتلئوا الى كل ملء الله"},
	{20, "20 والقادر ان يفعل فوق كل شيء اكثر جدا مما نطلب او نفتكر بحسب القوة التي تعمل فينا"},
	{21, "21 له المجد في الكنيسة في المسيح يسوع الى جميع اجيال دهر الدهور. آمين"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ara4 poems[] = {
	{1, "1 فاطلب اليكم انا الاسير في الرب ان تسلكوا كما يحق للدعوة التي دعيتم بها"},
	{2, "2 بكل تواضع ووداعة وبطول اناة محتملين بعضكم بعضا في المحبة"},
	{3, "3 مجتهدين ان تحفظوا وحدانية الروح برباط السلام"},
	{4, "4 جسد واحد وروح واحد كما دعيتم ايضا في رجاء دعوتكم الواحد"},
	{5, "5 رب واحد ايمان واحد معمودية واحدة"},
	{6, "6 اله وآب واحد للكل الذي على الكل وبالكل وفي كلكم"},
	{7, "7 ولكن لكل واحد منا اعطيت النعمة حسب قياس هبة المسيح"},
	{8, "8 لذلك يقول. اذ صعد الى العلاء سبى سبيا واعطى الناس عطايا"},
	{9, "9 واما انه صعد فما هو الا انه نزل ايضا اولا الى اقسام الارض السفلى"},
	{10, "10 الذي نزل هو الذي صعد ايضا فوق جميع السموات لكي يملأ الكل"},
	{11, "11 وهو اعطى البعض ان يكونوا رسلا والبعض انبياء والبعض مبشرين والبعض رعاة ومعلّمين"},
	{12, "12 لاجل تكميل القديسين لعمل الخدمة لبنيان جسد المسيح"},
	{13, "13 الى ان ننتهي جميعنا الى وحدانية الايمان ومعرفة ابن الله. الى انسان كامل. الى قياس قامة ملء المسيح"},
	{14, "14 كي لا نكون فيما بعد اطفالا مضطربين ومحمولين بكل ريح تعليم بحيلة الناس بمكر الى مكيدة الضلال"},
	{15, "15 بل صادقين في المحبة ننمو في كل شيء الى ذاك الذي هو الراس المسيح"},
	{16, "16 الذي منه كل الجسد مركبا معا ومقترنا بموازرة كل مفصل حسب عمل على قياس كل جزء يحصّل نمو الجسد لبنيانه في المحبة"},
	{17, "17 فاقول هذا واشهد في الرب ان لا تسلكوا في ما بعد كما يسلك سائر الامم ايضا ببطل ذهنهم"},
	{18, "18 اذ هم مظلمو الفكر ومتجنبون عن حياة الله لسبب الجهل الذي فيهم بسبب غلاظة قلوبهم"},
	{19, "19 الذين اذ هم قد فقدوا الحس اسلموا نفوسهم للدعارة ليعملوا كل نجاسة في الطمع"},
	{20, "20 واما انتم فلم تتعلّموا المسيح هكذا"},
	{21, "21 ان كنتم قد سمعتموه وعلمتم فيه كما هو حق في يسوع"},
	{22, "22 ان تخلعوا من جهة التصرف السابق الانسان العتيق الفاسد بحسب شهوات الغرور"},
	{23, "23 وتتجددوا بروح ذهنكم"},
	{24, "24 وتلبسوا الانسان الجديد المخلوق بحسب الله في البر وقداسة الحق"},
	{25, "25 لذلك اطرحوا عنكم الكذب وتكلموا بالصدق كل واحد مع قريبه. لاننا بعضنا اعضاء البعض"},
	{26, "26 اغضبوا ولا تخطئوا. لا تغرب الشمس على غيظكم"},
	{27, "27 ولا تعطوا ابليس مكانا"},
	{28, "28 لا يسرق السارق في ما بعد بل بالحري يتعب عاملا الصالح بيديه ليكون له ان يعطي من له احتياج"},
	{29, "29 لا تخرج كلمة رديّة من افواهكم بل كل ما كان صالحا للبنيان حسب الحاجة كي يعطي نعمة للسامعين"},
	{30, "30 ولا تحزنوا روح الله القدوس الذي به ختمتم ليوم الفداء"},
	{31, "31 ليرفع من بينكم كل مرارة وسخط وغضب وصياح وتجديف مع كل خبث"},
	{32, "32 وكونوا لطفاء بعضكم نحو بعض شفوقين متسامحين كما سامحكم الله ايضا في المسيح"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ara5 poems[] = {
	{1, "1 فكونوا متمثلين بالله كاولاد احباء"},
	{2, "2 واسلكوا في المحبة كما احبنا المسيح ايضا واسلم نفسه لاجلنا قربانا وذبيحة للّه رائحة طيبة"},
	{3, "3 واما الزنى وكل نجاسة او طمع فلا يسمّ بينكم كما يليق بقديسين"},
	{4, "4 ولا القباحة ولا كلام السفاهة والهزل التي لا تليق بل بالحري الشكر"},
	{5, "5 فانكم تعلمون هذا ان كل زان او نجس او طماع الذي هو عابد للاوثان ليس له ميراث في ملكوت المسيح والله"},
	{6, "6 لا يغركم احد بكلام باطل لانه بسبب هذه الامور يأتي غضب الله على ابناء المعصية"},
	{7, "7 فلا تكونوا شركاءهم"},
	{8, "8 لانكم كنتم قبلا ظلمة واما الآن فنور في الرب. اسلكوا كاولاد نور"},
	{9, "9 لان ثمر الروح هو في كل صلاح وبر وحق"},
	{10, "10 مختبرين ما هو مرضي عند الرب"},
	{11, "11 ولا تشتركوا في اعمال الظلمة غير المثمرة بل بالحري وبخوها"},
	{12, "12 لان الامور الحادثة منهم سرّا ذكرها ايضا قبيح"},
	{13, "13 ولكن الكل اذا توبخ يظهر بالنور. لان كل ما اظهر فهو نور"},
	{14, "14 لذلك يقول استيقظ ايها النائم وقم من الاموات فيضيء لك المسيح"},
	{15, "15 فانظروا كيف تسلكون بالتدقيق لا كجهلاء بل كحكماء"},
	{16, "16 مفتدين الوقت لان الايام شريرة"},
	{17, "17 من اجل ذلك لا تكونوا اغبياء بل فاهمين ما هي مشيئة الرب"},
	{18, "18 ولا تسكروا بالخمر الذي فيه الخلاعة بل امتلئوا بالروح"},
	{19, "19 مكلمين بعضكم بعضا بمزامير وتسابيح واغاني روحية مترنمين ومرتلين في قلوبكم للرب"},
	{20, "20 شاكرين كل حين على كل شيء في اسم ربنا يسوع المسيح للّه والآب"},
	{21, "21 خاضعين بعضكم لبعض في خوف الله"},
	{22, "22 ايها النساء اخضعن لرجالكنّ كما للرب"},
	{23, "23 لان الرجل هو راس المرأة كما ان المسيح ايضا راس الكنيسة. وهو مخلّص الجسد"},
	{24, "24 ولكن كما تخضع الكنيسة للمسيح كذلك النساء لرجالهنّ في كل شيء"},
	{25, "25 ايها الرجال احبوا نساءكم كما احب المسيح ايضا الكنيسة واسلم نفسه لاجلها"},
	{26, "26 لكي يقدسها مطهرا اياها بغسل الماء بالكلمة"},
	{27, "27 لكي يحضرها لنفسه كنيسة مجيدة لا دنس فيها ولا غضن او شيء من مثل ذلك بل تكون مقدسة وبلا عيب"},
	{28, "28 كذلك يجب على الرجال ان يحبوا نساءهم كاجسادهم. من يحب امرأته يحب نفسه"},
	{29, "29 فانه لم يبغض احد جسده قط بل يقوته ويربيه كما الرب ايضا للكنيسة"},
	{30, "30 لاننا اعضاء جسمه من لحمه ومن عظامه"},
	{31, "31 من اجل هذا يترك الرجل اباه وامه ويلتصق بامرأته ويكون الاثنان جسدا واحدا"},
	{32, "32 هذا السر عظيم ولكنني انا اقول من نحو المسيح والكنيسة"},
	{33, "33 واما انتم الافراد فليحب كل واحد امرأته هكذا كنفسه واما المرأة فلتهب رجلها"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ara6 poems[] = {
	{1, "1 ايها الاولاد اطيعوا والديكم في الرب لان هذا حق"},
	{2, "2 اكرم اباك وامك. التي هي اول وصية بوعد"},
	{3, "3 لكي يكون لكم خير وتكونوا طوال الاعمار على الارض"},
	{4, "4 وانتم ايها الآباء لا تغيظوا اولادكم بل ربوهم بتأديب الرب وانذاره"},
	{5, "5 ايها العبيد اطيعوا سادتكم حسب الجسد بخوف ورعدة في بساطة قلوبكم كما للمسيح"},
	{6, "6 لا بخدمة العين كمن يرضي الناس بل كعبيد المسيح عاملين مشيئة الله من القلب"},
	{7, "7 خادمين بنيّة صالحة كما للرب ليس للناس"},
	{8, "8 عالمين ان مهما عمل كل واحد من الخير فذلك يناله من الرب عبدا كان ام حرا"},
	{9, "9 وانتم ايها السادة افعلوا لهم هذه الامور تاركين التهديد عالمين ان سيدكم انتم ايضا في السموات وليس عنده محاباة"},
	{10, "10 اخيرا يا اخوتي تقووا في الرب وفي شدة قوته"},
	{11, "11 البسوا سلاح الله الكامل لكي تقدروا ان تثبتوا ضد مكايد ابليس"},
	{12, "12 فان مصارعتنا ليست مع دم ولحم بل مع الرؤساء مع السلاطين مع ولاة العالم على ظلمة هذا الدهر مع اجناد الشر الروحية في السماويات"},
	{13, "13 من اجل ذلك احملوا سلاح الله الكامل لكي تقدروا ان تقاوموا في اليوم الشرير وبعد ان تتمموا كل شيء ان تثبتوا"},
	{14, "14 فاثبتوا ممنطقين احقاءكم بالحق ولابسين درع البر"},
	{15, "15 وحاذين ارجلكم باستعداد انجيل السلام"},
	{16, "16 حاملين فوق الكل ترس الايمان الذي به تقدرون ان تطفئوا جميع سهام الشرير الملتهبة"},
	{17, "17 وخذوا خوذة الخلاص وسيف الروح الذي هو كلمة الله"},
	{18, "18 مصلّين بكل صلاة وطلبة كل وقت في الروح وساهرين لهذا بعينه بكل مواظبة وطلبة لاجل جميع القديسين"},
	{19, "19 ولاجلي لكي يعطى لي كلام عند افتتاح فمي لاعلم جهارا بسر الانجيل"},
	{20, "20 الذي لاجله انا سفير في سلاسل. لكي اجاهر فيه كما يجب ان اتكلم"},
	{21, "21 ولكن لكي تعلموا انتم ايضا احوالي ماذا افعل يعرّفكم بكل شيء تيخيكس الاخ الحبيب والخادم الامين في الرب"},
	{22, "22 الذي ارسلته اليكم لهذا بعينه لكي تعلموا احوالنا ولكي يعزي قلوبكم"},
	{23, "23 سلام على الاخوة ومحبة بايمان من الله الآب والرب يسوع المسيح"},
	{24, "24 النعمة مع جميع الذين يحبون ربنا يسوع المسيح في عدم فساد. آمين. كتبت الى اهل افسس من رومية على يد تيخيكس"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};