#include <map>
#include <string>
class Bible64
{
	struct ara1	{ int val; const char *msg; };
public:
static void view1() {
struct ara1 poems[] = {
	{1, "1 :"},
	{2, "2 ايها الحبيب في كل شيء اروم ان تكون ناجحا وصحيحا كما ان نفسك ناجحة"},
	{3, "3 لاني فرحت جدا اذ حضر اخوة وشهدوا بالحق الذي فيك كما انك تسلك بالحق"},
	{4, "4 ليس لي فرح اعظم من هذا ان اسمع عن اولادي انهم يسلكون بالحق"},
	{5, "5 ايها الحبيب انت تفعل بالامانة كل ما تصنعه الى الاخوة والى الغرباء"},
	{6, "6 الذين شهدوا بمحبتك امام الكنيسة. الذين تفعل حسنا اذا شيعتهم كما يحق للّه"},
	{7, "7 لانهم من اجل اسمه خرجوا وهم لا يأخذون شيئا من الامم"},
	{8, "8 فنحن ينبغي لنا ان نقبل امثال هؤلاء لكي نكون عاملين معهم بالحق"},
	{9, "9 كتبت الى الكنيسة ولكن ديوتريفس الذي يحب ان يكون الاول بينهم لا يقبلنا"},
	{10, "10 من اجل ذلك اذا جئت فسأذكّره باعماله التي يعملها هاذرا علينا باقوال خبيثة. واذ هو غير مكتف بهذه لا يقبل الاخوة ويمنع ايضا الذين يريدون ويطردهم من الكنيسة"},
	{11, "11 ايها الحبيب لا تتمثل بالشر بل بالخير لان من يصنع الخير هو من الله ومن يصنع الشر فلم يبصر الله"},
	{12, "12 ديمتريوس مشهود له من الجميع ومن الحق نفسه ونحن ايضا نشهد وانتم تعلمون ان شهادتنا هي صادقة"},
	{13, "13 وكان لي كثير لاكتبه لكنني لست اريد ان اكتب اليك بحبر وقلم"},
	{14, "14 ولكنني ارجو ان اراك عن قريب فنتكلم فما لفم. ( [ (III John 1:15) ) سلام لك. يسلم عليك الاحباء. سلم على الاحباء باسمائهم ]"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};