#include <map>
#include <string>
class Bible61
{
	struct ara1	{ int val; const char *msg; };
	struct ara2	{ int val; const char *msg; };
	struct ara3	{ int val; const char *msg; };
public:
static void view1() {
struct ara1 poems[] = {
	{1, "1 سمعان بطرس عبد يسوع المسيح ورسوله الى الذين نالوا معنا ايمانا ثمينا مساويا لنا ببر الهنا والمخلص يسوع المسيح"},
	{2, "2 لتكثر لكم النعمة والسلام بمعرفة الله ويسوع ربنا"},
	{3, "3 كما ان قدرته الالهية قد وهبت لنا كل ما هو للحياة والتقوى بمعرفة الذي دعانا بالمجد والفضيلة"},
	{4, "4 اللذين بهما قد وهب لنا المواعيد العظمى والثمينة لكي تصيروا بها شركاء الطبيعة الالهية هاربين من الفساد الذي في العالم بالشهوة"},
	{5, "5 ولهذا عينه وانتم باذلون كل اجتهاد قدموا في ايمانكم فضيلة وفي الفضيلة معرفة"},
	{6, "6 وفي المعرفة تعففا وفي التعفف صبرا وفي الصبر تقوى"},
	{7, "7 وفي التقوى مودة اخوية وفي المودة الاخوية محبة"},
	{8, "8 لان هذه اذا كانت فيكم وكثرت تصيّركم لا متكاسلين ولا غير مثمرين لمعرفة ربنا يسوع المسيح"},
	{9, "9 لان الذي ليس عنده هذه هو اعمى قصير البصر قد نسي تطهير خطاياه السالفة"},
	{10, "10 لذلك بالاكثر اجتهدوا ايها الاخوة ان تجعلوا دعوتكم واختياركم ثابتين. لانكم اذا فعلتم ذلك لن تزلّوا ابدا"},
	{11, "11 لانه هكذا يقدم لكم بسعة دخول الى ملكوت ربنا ومخلّصنا يسوع المسيح الابدي"},
	{12, "12 لذلك لا اهمل ان اذكّركم دائما بهذه الامور وان كنتم عالمين ومثبتين في الحق الحاضر"},
	{13, "13 ولكني احسبه حقا ما دمت في هذا المسكن ان انهضكم بالتذكرة"},
	{14, "14 عالما ان خلع مسكني قريب كما اعلن لي ربنا يسوع المسيح ايضا"},
	{15, "15 فأجتهد ايضا ان تكونوا بعد خروجي تتذكرون كل حين بهذه الامور"},
	{16, "16 لاننا لم نتبع خرافات مصنعة اذ عرّفناكم بقوة ربنا يسوع المسيح ومجيئه بل قد كنا معاينين عظمته"},
	{17, "17 لانه اخذ من الله الآب كرامة ومجدا اذ اقبل عليه صوت كهذا من المجد الاسنى هذا هو ابني الحبيب الذي انا سررت به"},
	{18, "18 ونحن سمعنا هذا الصوت مقبلا من السماء اذ كنا معه في الجبل المقدس"},
	{19, "19 وعندنا الكلمة النبوية وهي اثبت التي تفعلون حسنا ان انتبهتم اليها كما الى سراج منير في موضع مظلم الى ان ينفجر النهار ويطلع كوكب الصبح في قلوبكم"},
	{20, "20 عالمين هذا اولا ان كل نبوة الكتاب ليست من تفسير خاص"},
	{21, "21 لانه لم تأت نبوة قط بمشيئة انسان بل تكلم اناس الله القديسون مسوقين من الروح القدس"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ara2 poems[] = {
	{1, "1 ولكن كان ايضا في الشعب انبياء كذبة كما سيكون فيكم ايضا معلّمون كذبة الذين يدسّون بدع هلاك واذ هم ينكرون الرب الذي اشتراهم يجلبون على انفسهم هلاكا سريعا"},
	{2, "2 وسيتبع كثيرون تهلكاتهم. الذين بسببهم يجدف على طريق الحق"},
	{3, "3 وهم في الطمع يتّجرون بكم باقوال مصنعة الذين دينونتهم منذ القديم لا تتوانى وهلاكهم لا ينعس"},
	{4, "4 لانه ان كان الله لم يشفق على ملائكة قد اخطأوا بل في سلاسل الظلام طرحهم في جهنم وسلمهم محروسين للقضاء"},
	{5, "5 ولم يشفق على العالم القديم بل انما حفظ نوحا ثامنا كارزا للبر اذ جلب طوفانا على عالم الفجار"},
	{6, "6 واذ رمّد مدينتي سدوم وعمورة حكم عليهما بالانقلاب واضعا عبرة للعتيدين ان يفجروا"},
	{7, "7 وانقذ لوطا البار مغلوبا من سيرة الاردياء في الدعارة"},
	{8, "8 اذ كان البار بالنظر والسمع وهو ساكن بينهم يعذب يوما فيوما نفسه البارة بالافعال الاثيمة"},
	{9, "9 يعلم الرب ان ينقذ الاتقياء من التجربة ويحفظ الاثمة الى يوم الدين معاقبين"},
	{10, "10 ولا سيما الذين يذهبون وراء الجسد في شهوة النجاسة ويستهينون بالسيادة. جسورون معجبون بانفسهم لا يرتعبون ان يفتروا على ذوي الامجاد"},
	{11, "11 حيث ملائكة وهم اعظم قوة وقدرة لا يقدمون عليهم لدى الرب حكم افتراء"},
	{12, "12 اما هؤلاء فكحيوانات غير ناطقة طبيعية مولودة للصيد والهلاك يفترون على ما يجهلون فسيهلكون في فسادهم"},
	{13, "13 آخذين اجرة الاثم. الذين يحسبون تنعم يوم. لذة ادناس وعيوب يتنعمون في غرورهم صانعين ولائم معكم"},
	{14, "14 لهم عيون مملوءة فسقا لا تكف عن الخطية خادعون النفوس غير الثابتة. لهم قلب متدرب في الطمع. اولاد اللعنة"},
	{15, "15 قد تركوا الطريق المستقيم فضلّوا تابعين طريق بلعام بن بصور الذي احب اجرة الاثم"},
	{16, "16 ولكنه حصل على توبيخ تعديه اذ منع حماقة النبي حمار اعجم ناطقا بصوت انسان"},
	{17, "17 هؤلاء هم آبار بلا ماء غيوم يسوقها النوء. الذين قد حفظ لهم قتام الظلام الى الابد"},
	{18, "18 لانهم اذ ينطقون بعظائم البطل يخدعون بشهوات الجسد في الدعارة من هرب قليلا من الذين يسيرون في الضلال"},
	{19, "19 واعدين اياهم بالحرية وهم انفسهم عبيد الفساد. لان ما انغلب منه احد فهو له مستعبد ايضا"},
	{20, "20 لانه اذا كانوا بعدما هربوا من نجاسات العالم بمعرفة الرب والمخلّص يسوع المسيح يرتبكون ايضا فيها فينغلبون فقد صارت لهم الاواخر اشر من الاوائل"},
	{21, "21 لانه كان خيرا لهم لو لم يعرفوا طريق البر من انهم بعدما عرفوا يرتدّون عن الوصية المقدسة المسلمة لهم"},
	{22, "22 قد اصابهم ما في المثل الصادق كلب قد عاد الى قيئه وخنزيرة مغتسلة الى مراغة الحمأة"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ara3 poems[] = {
	{1, "1 هذه اكتبها الآن اليكم رسالة ثانية ايها الاحباء فيهما انهض بالتذكرة ذهنكم النقي"},
	{2, "2 لتذكروا الاقوال التي قالها سابقا الانبياء القديسون ووصيتنا نحن الرسل وصية الرب والمخلّص"},
	{3, "3 عالمين هذا اولا انه سيأتي في آخر الايام قوم مستهزئون سالكين بحسب شهوات انفسهم"},
	{4, "4 وقائلين اين هو موعد مجيئه لانه من حين رقد الآباء كل شيء باق هكذا من بدء الخليقة"},
	{5, "5 لان هذا يخفى عليهم بارادتهم ان السموات كانت منذ القديم والارض بكلمة الله قائمة من الماء وبالماء"},
	{6, "6 اللواتي بهنّ العالم الكائن حينئذ فاض عليه الماء فهلك"},
	{7, "7 واما السموات والارض الكائنة الآن فهي مخزونة بتلك الكلمة عينها محفوظة للنار الى يوم الدين وهلاك الناس الفجار"},
	{8, "8 ولكن لا يخف عليكم هذا الشيء الواحد ايها الاحباء ان يوما واحدا عند الرب كالف سنة والف سنة كيوم واحد"},
	{9, "9 لا يتباطأ الرب عن وعده كما يحسب قوم التباطؤ لكنه يتأنى علينا وهو لا يشاء ان يهلك اناس بل ان يقبل الجميع الى التوبة"},
	{10, "10 ولكن سيأتي كلص في الليل يوم الرب الذي فيه تزول السموات بضجيج وتنحل العناصر محترقة وتحترق الارض والمصنوعات التي فيها"},
	{11, "11 فبما ان هذه كلها تنحل ايّ اناس يجب ان تكونوا انتم في سيرة مقدسة وتقوى"},
	{12, "12 منتظرين وطالبين سرعة مجيء يوم الرب الذي به تنحل السموات ملتهبة والعناصر محترقة تذوب"},
	{13, "13 ولكننا بحسب وعده ننتظر سموات جديدة وارضا جديدة يسكن فيها البر"},
	{14, "14 لذلك ايها الاحباء اذ انتم منتظرون هذه اجتهدوا لتوجدوا عنده بلا دنس ولا عيب في سلام"},
	{15, "15 واحسبوا اناة ربنا خلاصا. كما كتب اليكم اخونا الحبيب بولس ايضا بحسب الحكمة المعطاة له"},
	{16, "16 كما في الرسائل كلها ايضا متكلما فيها عن هذه الامور. التي فيها اشياء عسرة الفهم يحرّفها غير العلماء وغير الثابتين كباقي الكتب ايضا لهلاك انفسهم"},
	{17, "17 فانتم ايها الاحباء اذ قد سبقتم فعرفتم احترسوا من ان تنقادوا بضلال الاردياء فتسقطوا من ثباتكم"},
	{18, "18 ولكن انموا في النعمة وفي معرفة ربنا ومخلّصنا يسوع المسيح. له المجد الآن والى يوم الدهر آمين"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};