#include <map>
#include <string>
class Bible1
{
#define rubible1_1 "rectangle"
    struct ru1	{ int val; const char *msg; };
    struct ru2	{ int val; const char *msg; };
    struct ru3	{ int val; const char *msg; };
    struct ru4	{ int val; const char *msg; };
    struct ru5	{ int val; const char *msg; };
    struct ru6	{ int val; const char *msg; };
    struct ru7	{ int val; const char *msg; };
    struct ru8	{ int val; const char *msg; };
    struct ru9	{ int val; const char *msg; };
    struct ru10	{ int val; const char *msg; };
    struct ru11	{ int val; const char *msg; };
    struct ru12	{ int val; const char *msg; };
    struct ru13	{ int val; const char *msg; };
    struct ru14	{ int val; const char *msg; };
    struct ru15	{ int val; const char *msg; };
    struct ru16	{ int val; const char *msg; };
    struct ru17	{ int val; const char *msg; };
    struct ru18	{ int val; const char *msg; };
    struct ru19	{ int val; const char *msg; };
    struct ru20	{ int val; const char *msg; };
    struct ru21	{ int val; const char *msg; };
    struct ru22	{ int val; const char *msg; };
    struct ru23	{ int val; const char *msg; };
    struct ru24	{ int val; const char *msg; };
    struct ru25	{ int val; const char *msg; };
    struct ru26	{ int val; const char *msg; };
    struct ru27	{ int val; const char *msg; };
    struct ru28	{ int val; const char *msg; };
    struct ru29	{ int val; const char *msg; };
    struct ru30	{ int val; const char *msg; };
    struct ru31	{ int val; const char *msg; };
    struct ru32	{ int val; const char *msg; };
    struct ru33	{ int val; const char *msg; };
    struct ru34	{ int val; const char *msg; };
    struct ru35	{ int val; const char *msg; };
    struct ru36	{ int val; const char *msg; };
    struct ru37	{ int val; const char *msg; };
    struct ru38	{ int val; const char *msg; };
    struct ru39	{ int val; const char *msg; };
    struct ru40	{ int val; const char *msg; };
    struct ru41	{ int val; const char *msg; };
    struct ru42	{ int val; const char *msg; };
    struct ru43	{ int val; const char *msg; };
    struct ru44	{ int val; const char *msg; };
    struct ru45	{ int val; const char *msg; };
    struct ru46	{ int val; const char *msg; };
    struct ru47	{ int val; const char *msg; };
    struct ru48	{ int val; const char *msg; };
    struct ru49	{ int val; const char *msg; };
    struct ru50	{ int val; const char *msg; };
public:
static void view1() {
struct ru1 poems[] = {
        {1,"В начале сотворил Бог небо и землю."},
        {2,"Земля же была безвидна и пуста, и тьма над бездною, и Дух Божий носился над водою."},
        {3,"И сказал Бог: да будет свет. И стал свет."},
        {4,"И увидел Бог свет, что он хорош, и отделил Бог свет от тьмы."},
        {5,"И назвал Бог свет днем, а тьму ночью. И был вечер, и было утро: день один."},
        {6,"И сказал Бог: да будет твердь посреди воды, и да отделяет она воду от воды."},
        {7,"И создал Бог твердь, и отделил воду, которая под твердью, от воды, которая над твердью. И стало так."},
        {8,"И назвал Бог твердь небом. И был вечер, и было утро: день второй."},
        {9,"И сказал Бог: да соберется вода, которая под небом, в одно место, и да явится суша. И стало так."},
        {10,"И назвал Бог сушу землею, а собрание вод назвал морями. И увидел Бог, что это хорошо."},
        {11,"И сказал Бог: да произрастит земля зелень, траву, сеющую семя, дерево плодовитое, приносящее по роду своему плод, в котором семя его на земле. И стало так."},
        {12,"И произвела земля зелень, траву, сеющую семя по роду ее, и дерево, приносящее плод, в котором семя его по роду его. И увидел Бог, что это хорошо."},
        {13,"И был вечер, и было утро: день третий."},
        {14,"И сказал Бог: да будут светила на тверди небесной для отделения дня от ночи, и для знамений, и времен, и дней, и годов;"},
        {15,"и да будут они светильниками на тверди небесной, чтобы светить на землю. И стало так."},
        {16,"И создал Бог два светила великие: светило большее, для управления днем, и светило меньшее, для управления ночью, и звезды;"},
        {17,"и поставил их Бог на тверди небесной, чтобы светить на землю,"},
        {18,"и управлять днем и ночью, и отделять свет от тьмы. И увидел Бог, что это хорошо."},
        {19,"И был вечер, и было утро: день четвёртый."},
        {20,"И сказал Бог: да произведет вода пресмыкающихся, душу живую; и птицы да полетят над землею, по тверди небесной."},
        {21,"И сотворил Бог рыб больших и всякую душу животных пресмыкающихся, которых произвела вода, по роду их, и всякую птицу пернатую по роду ее. И увидел Бог, что это хорошо."},
        {22,"И благословил их Бог, говоря: плодитесь и размножайтесь, и наполняйте воды в морях, и птицы да размножаются на земле."},
        {23,"И был вечер, и было утро: день пятый."},
        {24,"И сказал Бог: да произведет земля душу живую по роду ее, скотов, и гадов, и зверей земных по роду их. И стало так."},
        {25,"И создал Бог зверей земных по роду их, и скот по роду его, и всех гадов земных по роду их. И увидел Бог, что это хорошо."},
        {26,"И сказал Бог: сотворим человека по образу Нашему и по подобию Нашему, и да владычествуют они над рыбами морскими, и над птицами небесными, и над скотом, и над всею землею, и над всеми гадами, пресмыкающимися по земле."},
        {27,"И сотворил Бог человека по образу Своему, по образу Божию сотворил его; мужчину и женщину сотворил их."},
        {28,"И благословил их Бог, и сказал им Бог: плодитесь и размножайтесь, и наполняйте землю, и обладайте ею, и владычествуйте над рыбами морскими, и над птицами небесными, и над всяким животным, пресмыкающимся по земле."},
        {29,"И сказал Бог: вот, Я дал вам всякую траву, сеющую семя, какая есть на всей земле, и всякое дерево, у которого плод древесный, сеющий семя; - вам сие будет в пищу;"},
        {30,"А всем зверям земным, и всем птицам небесным, и всякому пресмыкающемуся по земле, в котором душа живая, дал Я всю зелень травную в пищу. И стало так."},
        {31,"И увидел Бог все, что Он создал, и вот, хорошо весьма. И был вечер, и было утро: день шестой."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%d. %s\n", poems[i].val, poems[i].msg);}
}

static void view2() {
struct ru2 poems[] = {
        {1,"Так совершены небо и земля и все воинство их."},
        {2,"И совершил Бог к седьмому дню дела Свои, которые Он делал, и почил в день седьмый от всех дел Своих, которые делал."},
        {3,"И благословил Бог седьмой день, и освятил его, ибо в оный почил от всех дел Своих, которые Бог творил и созидал."},
        {4,"Вот происхождение неба и земли, при сотворении их, в то время, когда Господь Бог создал землю и небо,"},
        {5,"и всякий полевой кустарник, которого еще не было на земле, и всякую полевую траву, которая еще не росла, ибо Господь Бог не посылал дождя на землю, и не было человека для возделывания земли,"},
        {6,"но пар поднимался с земли и орошал все лице земли."},
        {7,"И создал Господь Бог человека из праха земного, и вдунул в лице его дыхание жизни, и стал человек душею живою."},
        {8,"И насадил Господь Бог рай в Едеме на востоке, и поместил там человека, которого создал."},
        {9,"И произрастил Господь Бог из земли всякое дерево, приятное на вид и хорошее для пищи, и дерево жизни посреди рая, и дерево познания добра и зла."},
        {10,"Из Едема выходила река для орошения рая; и потом разделялась на четыре реки."},
        {11,"Имя одной Фисон: она обтекает всю землю Хавила, ту, где золото;"},
        {12,"и золото той земли хорошее; там бдолах и камень оникс."},
        {13,"Имя второй реки Гихон: она обтекает всю землю Куш."},
        {14,"Имя третьей реки Хиддекель: она протекает пред Ассириею. Четвертая река Евфрат."},
        {15,"И взял Господь Бог человека, и поселил его в саду Едемском, чтобы возделывать его и хранить его."},
        {16,"И заповедал Господь Бог человеку, говоря: от всякого дерева в саду ты будешь есть,"},
        {17,"а от дерева познания добра и зла не ешь от него, ибо в день, в который ты вкусишь от него, смертью умрешь."},
        {18,"И сказал Господь Бог: не хорошо быть человеку одному; сотворим ему помощника, соответственного ему."},
        {19,"Господь Бог образовал из земли всех животных полевых и всех птиц небесных, и привел их к человеку, чтобы видеть, как он назовет их, и чтобы, как наречет человек всякую душу живую, так и было имя ей."},
        {20,"И нарек человек имена всем скотам и птицам небесным и всем зверям полевым; но для человека не нашлось помощника, подобного ему."},
        {21,"И навел Господь Бог на человека крепкий сон; и, когда он уснул, взял одно из ребр его, и закрыл то место плотию."},
        {22,"И создал Господь Бог из ребра, взятого у человека, жену, и привел ее к человеку."},
        {23,"И сказал человек: вот, это кость от костей моих и плоть от плоти моей; она будет называться женою, ибо взята от мужа."},
        {24,"Потому оставит человек отца своего и мать свою и прилепится к жене своей; и будут двое одна плоть."},
        {25,"И были оба наги, Адам и жена его, и не стыдились."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%d. %s\n", poems[i].val, poems[i].msg);}
}

static void view3() {
struct ru3 poems[] = {
        {1,"Змей был хитрее всех зверей полевых, которых создал Господь Бог. И сказал змей жене: подлинно ли сказал Бог: не ешьте ни от какого дерева в раю?"},
        {2,"И сказала жена змею: плоды с дерев мы можем есть,"},
        {3,"только плодов дерева, которое среди рая, сказал Бог, не ешьте их и не прикасайтесь к ним, чтобы вам не умереть."},
        {4,"И сказал змей жене: нет, не умрете,"},
        {5,"но знает Бог, что в день, в который вы вкусите их, откроются глаза ваши, и вы будете, как боги, знающие добро и зло."},
        {6,"И увидела жена, что дерево хорошо для пищи, и что оно приятно для глаз и вожделенно, потому что дает знание; и взяла плодов его и ела; и дала также мужу своему, и он ел."},
        {7,"И открылись глаза у них обоих, и узнали они, что наги, и сшили смоковные листья, и сделали себе опоясания."},
        {8,"И услышали голос Господа Бога, ходящего в раю во время прохлады дня; и скрылся Адам и жена его от лица Господа Бога между деревьями рая."},
        {9,"И воззвал Господь Бог к Адаму и сказал ему: где ты?"},
        {10,"Он сказал: голос Твой я услышал в раю, и убоялся, потому что я наг, и скрылся."},
        {11,"И сказал Господь Бог: кто сказал тебе, что ты наг? не ел ли ты от дерева, с которого Я запретил тебе есть?"},
        {12,"Адам сказал: жена, которую Ты мне дал, она дала мне от дерева, и я ел."},
        {13,"И сказал Господь Бог жене: что ты это сделала? Жена сказала: змей обольстил меня, и я ела."},
        {14,"И сказал Господь Бог змею: за то, что ты сделал это, проклят ты пред всеми скотами и пред всеми зверями полевыми; ты будешь ходить на чреве твоем, и будешь есть прах во все дни жизни твоей;"},
        {15,"и вражду положу между тобою и между женою, и между семенем твоим и между семенем ее; оно будет поражать тебя в голову, а ты будешь жалить его в пяту."},
        {16,"Жене сказал: умножая умножу скорбь твою в беременности твоей; в болезни будешь рождать детей; и к мужу твоему влечение твое, и он будет господствовать над тобою."},
        {17,"Адаму же сказал: за то, что ты послушал голоса жены твоей и ел от дерева, о котором Я заповедал тебе, сказав: не ешь от него, проклята земля за тебя; со скорбью будешь питаться от нее во все дни жизни твоей;"},
        {18,"терния и волчцы произрастит она тебе; и будешь питаться полевою травою;"},
        {19,"в поте лица твоего будешь есть хлеб, доколе не возвратишься в землю, из которой ты взят, ибо прах ты и в прах возвратишься."},
        {20,"И нарек Адам имя жене своей: Ева, ибо она стала матерью всех живущих."},
        {21,"И сделал Господь Бог Адаму и жене его одежды кожаные и одел их."},
        {22,"И сказал Господь Бог: вот, Адам стал как один из Нас, зная добро и зло; и теперь как бы не простер он руки своей, и не взял также от дерева жизни, и не вкусил, и не стал жить вечно."},
        {23,"И выслал его Господь Бог из сада Едемского, чтобы возделывать землю, из которой он взят."},
        {24,"И изгнал Адама, и поставил на востоке у сада Едемского Херувима и пламенный меч обращающийся, чтобы охранять путь к дереву жизни."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%d. %s\n", poems[i].val, poems[i].msg);}
}

//static void view3() {
//struct ru3 poems[] = {
//};
//size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%d. %s\n", poems[i].val, poems[i].msg);}
//}

};