#include <map>
#include <string>
class Bible37
{
	struct ur1	{ int val; const char *msg; };
	struct ur2	{ int val; const char *msg; };
public:
static void view1() {
struct ur1 poems[] = {
	{1, "1  دارا بادشاہ کی سلطنت کے دُوسرے برس کے چھٹے مہینے کی پہلی تاریح کو یہُوداہ کے ناظم زرُبابل بن سیالتی ایل اور سردار کاہن یُشوع بن یہُو صدق کو حجی بنی کی معرفت خُداوند کا کلام پُہنچا۔ "},
	{2, "2  کہ ربُ الافواج یُوں فرماتا ہے کہ یہ لوگ کہتے ہیں ابھی خُداوند کے گھر کی تعمیر کا وقت نہیں آیا۔ "},
	{3, "3  تب خُداوند کا کلام حجی نبی کی معرفت پُہنچا۔ "},
	{4, "4  کہ کیا تمہارے لے مُسقف گھروں میں رہنے کا وقت ہے جب کہ یہ گھر ویران پڑا ہے؟۔ "},
	{5, "5  اور اب ربُ الافواج یُوں فرماتا ہے کہ تُم اپنی روش پر غور کرو۔ "},
	{6, "6  تُم نے بہت سا بویا پر تھوڑا کاٹا۔ تُم کھاتے ہو پر آسودہ نہیں ہوتے۔تُم پیتے ہو پر پیاس نہیں بُجھتی۔ تُم کپڑے پہنتے ہو پر گر نہیں ہوتےاور مزدور اپنی مزدوری سورا خُدا رتھیلی میں جمع کرتا ہے۔ "},
	{7, "7  ربُ الافواج یُوں فرماتا ہے کہ اپنی روش پر غور کرو۔ "},
	{8, "8  پہاڑوں سے لکڑی لا کر یہ گھر تعمیر کرو اور میں اس سے خُوش ہوں گا اور میری تمجید ہو گی خُداوند فرماتا ہے۔ "},
	{9, "9  تُم نے بُہت کی اُمید رکھی اور دیکھو تھوڑا ملا اور جب تُم اُسے اپنے گھر میں لاے تو میں نے اُسے اُڑادیا ۔ ربُ الافواج یُوں فرماتا ہے کیوں؟ اس لے کہ میرا گھر ویران ہے اور تُم میں سے ہر ایک اپنے گھر کو دوڑا چلا جاتا ہے۔(10 ) اس لے نہ آسمان سے اوس گرتی ہے اور نہ زمین اپنا حاصل دیتی ۔ "},
	{10, "11  اور میں نے خوش سالی کو طلب کیا کہ مُلک اور پہاڑوں پر اور اناج اور نئی مے اور تیل اور زمین کی سب پیداوار پر اور انسان وحیوان پر اور ہاتھ کی ساری محنت پر آئے۔ "},
	{11, "12  تب زرُبابل بن سیالتی ایل اور سردار کاہن یُشوع بن یہُو صدق اور لوگوں کا سب بقیہ خُداوند اپنے خُدا کے کلام اور اُس کے بھیجے ہُوے حجی نبی کی باتوں کے شنوا ہُوے اور لوگ خُداوند کے حُضور ترسان ہوئے۔ "},
	{12, "13  تب خُداوند کے پیغمبر حجی نے خُداوند کا پیغام اُن لوگوں کو سُنایا کہ خُداوند فرماتا ہے میں تمہارے ساتھ ہُوں ۔ "},
	{13, "14  پھر خُداوند نے یہُوداہ کے ناظم زُربابل بن سیالتی ایل کی اور سردار کاہن یشوع بن یُہو صدق کی اور لوگوں کے بقیہ کی رُوح کو ترغیب دی۔ پس وہ آکر ربُ الافواج اپنے خُدا کے گھر کی تعمیر میں مُشغول ہوئے۔ "},
	{14, "15  اور یہ واقعہ دارا بادشاہ کی سلطنت کے دُوسرے برس کے چھٹے مہینے کی چوربیسویں تاریخ کا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ur2 poems[] = {
	{1, "1  ساتویں مہینے کی اکیسویں تاریخ کو خُداوند کا کلام حجی نبی کی معرفت پُہنچا۔ "},
	{2, "2  کہ یہُوداہ کے ناظم زربابل بن سیالتی ایل سردار کاہن یُشوع بن یہُوصدق اور لوگوںکے بقیہ سے یُوں کہہ۔ "},
	{3, "3  کہ تُم میں سے کس نے اس ہیکل کی پہلی رونق کو دیکھا؟ اور اب کیسی دکھائی دیتی ہے؟ کیا یہ تُمہاری نظر میں ناچیز نہیں ہے؟۔ "},
	{4, "4  لیکن اے زربابل حوصلہ رکھ خُداوند فرماتا ہے اور اے سردار کاہن یُشوع بن یُہو صدق حوصلہ رکھ اور اے مُلک کے سب لوگو حُوصلہ رکھو خُداوند فرماتا ہے اور کام کرو کیونکہ میں تُمہارے ساتھ ہُوں ربُ الافواج فرماتا ہے۔ "},
	{5, "5  مصر سے نکلتے وقت میں نےتُم سے جو عہد کیا تھا اُس کے مُطابق میری وہ رُوح تُمہارے ساتھ رہتی ہے ہمت نہ ہارو۔ "},
	{6, "6  کیونکہ ربُ الافواج یُوں فرماتا ہے کہ میں تھوڑی دیر میں پھر ایک بار آسمان و زمین اور بحرو بر کو ہلادوں گا۔ "},
	{7, "7  میں سب قوموں کو ہلا دوں گا اور اُن کی مرغوب چیزیں آئیں گی اور میں اس گھر کو جلال سے معمور کروں گا ربُ الافواج فرماتا ہے۔ "},
	{8, "8  چاندی میری ہے اور سونا میرا ہے ربُ الافواج فرماتا ہے ۔ "},
	{9, "9  اس پچھلے گھر کی رونق پہلے گھر کی رونق سے زیادہ ہوگی ربُ الافواج فرماتا ہے اور میں اس مکان میں سلامتی بخُشوں گا ربُ الافواج فرماتا ہے۔ (10 ) اور دارابادشاہ کی سلطنت کے دُوسرے سال کے نویں مہینے کی چوبیسویں تاریخ کو خُداوند کا کلام حجی نبی کی معرفت پُہنچا۔ "},
	{10, "11  کہ ربُ الافواج یُوں فرماتا ہے کہ شریعت کی بابت کاہنوں سے دریافت کر۔ "},
	{11, "12  کہ اگر کوئی پاک گوشت کو اپنے لباس کے دامن میں لے جاتا ہو اور اُس کادامن روٹی یا دال یا مے یا تیل یا کسی طرح کے کھانے کی چیز کو چُھو جائے تو کیا پاک ہو جائیں گی؟ کاہنوں نے جواب دیا ہرگز نہیں۔ "},
	{12, "13  پھر حجی نے پوچھا کہ اگر کوئی کسی مُردہ کو چھُو نے سے ناپاک ہو گیا ہو اور ان میں سے کسی چیز کو چھوے تو کیا وہ چیز ناپاک ہو جائیں گی؟ کاہنوں نے جواب دیا ضُرور ناپاک ہو جائیں گی۔ "},
	{13, "14  پھر حجی نے کہا خُداوند فرماتا ہے میری نظر میں ان لوگوں اور اس قوم اور ان کے اعمال کا یہی حال ہے اور جو کچھ اس جگہ گُزرانتےہیں ناپاک ہے۔ "},
	{14, "15  پس اب اور آیندہ کو اُس وقت کا خیال رکھو جبکہ ابھی خُداوند کی ہیکل کا پتھر پر پتھر نہ رکھا گیا تھا۔ "},
	{15, "16  اُس تمام زمانہ میں جب کوئی بیس پیمانوں کی آس رکھتا تو دس ہی ملتے تھے اور جب کوئی مے کے حوض سے پچاس پیمانے نکالنے جاتا تو بیس ہی نکلتے تھے۔ "},
	{16, "17  اور میں نے تُم کو تمہارے سب کاموں میںبادسموم اور گیروئی اور اولوں سے مارا پر تُم میری طرف رجوع نہ لاے خُداوند فرماتاہے۔ "},
	{17, "18  اب اور آیندہ اس کا خیال رکھو۔ آج خُداوند کی ہیکل کی بُنیاد کے ڈالے جانے یعنی نویں مہینے کی چوبیسویں تاریخ سے اس کا خیال رکھو۔ "},
	{18, "19  کیا اس وقت بیج کھتے میں ہے؟ ابھی تو تاک اور انجیر اور انار اور زیتون میں پھل نہیں لگا۔ آج ہی سے میں آپ کو برکت دُوں گا ۔(20 ) پھر اسی مہینے کی چوبیسویں تاریخ کو خُداوند کا کلام حجی نبی پر نازل ہوا۔ "},
	{19, "21  کہ یہُوداہ کے ناظم زربابل سے کہہ دے کہ میں آسمان اور زمین کو ہلاوں گا۔ "},
	{20, "22  اور سلطنتوں کے تخت اُلٹ دُوں گا اور قوموں کی سلطنتوں کی توانائی بیست کردوں گا اور رتھوں کو سواروں سمیت اُلٹ دوں گا اور گھوڑے اور اُن کے سوار گر جائیں گے اور ہر شخص اپنے بھائی کی تلوار سے قتل ہوگا ۔ "},
	{21, "23  ربُ الافواج فرماتا ہے اے میرے خادم زربابل بن سیالتی ایل اُسی روز میں تُجھے لُوں گا خُداوند فرماتا ہے اور نگین ٹھہراوں گا کیونکہ میں نے تجھے برگُزیدہ کیا ربُ الافواج فرماتا ہے۔+ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};