#include <map>
#include <string>
class Bible52
{
	struct ur1	{ int val; const char *msg; };
	struct ur2	{ int val; const char *msg; };
	struct ur3	{ int val; const char *msg; };
	struct ur4	{ int val; const char *msg; };
	struct ur5	{ int val; const char *msg; };
public:
static void view1() {
struct ur1 poems[] = {
	{1, "1  پَولُس اور سِلوانُس اور تِیمُتھِیُس کی طرف سے تھِسّلُنیکِیوں کی کلِیسیا کے نام جو خُدا باپ خُدا اور خُداوند یِسُوع مسِیح میں ہے فضل اور اِطمینان تُمہیں حاصِل ہوتا رہے۔ "},
	{2, "2  تُم سب کے بارے میں ہم خُدا کا شُکر ہمیشہ بجا لاتے ہیں اور اپنی دُعاؤں میں تُمہیں یاد کرتے ہیں۔ "},
	{3, "3  اور اپنے خُدا اور باپ کے حُضُور تُمہارے اِیمان کے کام اور محبّت کی محنت اور اُس اُمِید کے صبر کو بِلاناغہ یاد کرتے ہیں جو ہمارے خُداوند یِسُوع مسِیح کی بابت ہے۔ "},
	{4, "4  اور اَے بھائِیو! خُدا کے پیارو! ہم کو معلُوم ہے کہ تُم برگُزِیدہ ہو۔ "},
	{5, "5  اِس لِئے کہ ہماری خُوشخَبری تُمہارے پاس نہ فقط لفظی طَور پر پہُہنچی بلکہ قُدرت اور رُوحُ القدُس اور پُورے اِعتِقاد کے ساتھ بھی چُنانچہ تُم جانتے ہو کہ ہم تُمہاری خاطِر تُم میں کَیسے بن گئے تھے۔ "},
	{6, "6  اور تُم کلام کو بڑی مُصِیبت میں رُوحُ القدُس کی خُوشخَبری کے ساتھ قُبُول کر کے ہماری اور خُداوند کی مانِند بنے۔ "},
	{7, "7  یہاں تک کہ مکِدُنیہ اور اخیہ کے سب اِیمانداروں کے لِئے نمُونہ بنے۔ "},
	{8, "8  کِیُونکہ تُمہارے ہاں سے نہ فقط مکِدُنیہ اور اخیہ میں خُدا کے کلام کا چرچا پھَیلا ہے بلکہ تُمہارا اِیمان جو خُدا پر ہے ہر جگہ اَیسا مشہُور ہو گیا ہے کہ ہمارے کہنے کی کُچھ حاجت نہِیں۔ "},
	{9, "9  اِس لِئے کہ وہ آپ ہمارا ذِکر کرتے ہیں کہ تُمہارے پاس ہمارا آنا کَیسا ہُؤا اور تُم بُتوں سے پھِر کر خُدا کی طرف رُجُوع ہُوئے تاکہ زِندہ اور حقِیقی خُدا کی بندگی کرو۔ "},
	{10, "10  اور اُس کے بَیٹے کے آسمان پر سے آنے کے مُنتظِر ہو جِسے اُس نے مُردوں میں سے جِلایا یعنی یِسُوع مسِیح کے جو ہم کو آنے والے غضب سے بَچاتا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ur2 poems[] = {
	{1, "1  اَے بھائِیو! تُم آپ جانتے ہو کہ ہمارا تُمہارے پاس آنا بے فائِدہ نہ ہُؤا۔ "},
	{2, "2  بلکہ تُم کو معلُوم ہی ہے کہ باوُجُود پیشتر فِلپّی میں دُکھ اُٹھانے اور بے عِزّت ہونے کے ہم کو اپنے خُدا میں یہ دِلیری حاصِل ہُوئی کہ خُدا کی خُوشخَبری بڑی جانفشانی سے تُمہیں سُنائیں۔ "},
	{3, "3  کِیُونکہ ہماری نصِیحت نہ گُمراہی سے ہے نہ ناپاکی سے نہ فریب کے ساتھ۔ "},
	{4, "4  بلکہ جَیسے خُدا نے ہم کو مقبُول کر کے خُوشخَبری ہمارے سُپُرد کی وَیسے ہی ہم بیان کرتے ہیں۔ آدمِیوں کو نہِیں بلکہ خُدا کو خُوش کرنے کے لِئے جو ہمارے دِلوں کو آزماتا ہے۔ "},
	{5, "5  کِیُونکہ تُم کو معلُوم ہی ہے کہ نہ کبھی ہمارے کلام میں خُوشامد پائی گئی نہ وہ لالچ کا پردہ بنا۔ خُدا اِس کا گواہ ہے۔ "},
	{6, "6  اور ہم آدمِیوں سے عِزّت نہِیں چاہتے تھے نہ تُم سے نہ اَوروں سے۔ اگرچہ مسِیح کے رَسُول ہونے کے باعِث تُم پر بوجھ ڈال سکتے تھے۔ "},
	{7, "7  بلکہ جِس طرح ماں اپنے بچّوں کو پالتی ہے اُسی طرح ہم تُمہارے درمیان نرمی کے ساتھ رہے۔ "},
	{8, "8  اور اُسی طرح ہم تُمہارے بہُت مُشتاق ہوکر نہ فقط خُدا کی خُوشخَبری بلکہ اپنی جان تک بھی تُمہیں دے دینے کو راضی تھے۔ اِس واسطے کہ تُم ہمارے پیارے ہو گئے تھے۔ "},
	{9, "9  کِیُونکہ اَے بھائِیو! تُم کو ہماری محنت اور مُشقّت یاد ہوگی کہ ہم نے تُم میں سے کِسی پر بوجھ نہ ڈالنے کی غرض سے رات دِن محنت مزدُوری کر کے تُمہیں خُدا کی خُوشخَبری کی منادِی کی۔ "},
	{10, "10  تُم بھی گواہ ہو اور خُدا بھی کہ تُم سے جو اِیمان لائے ہو ہم کَیسی پاکیزگی اور راستبازی اور بے عَیبی کے ساتھ پیش آئے۔ "},
	{11, "11  چُنانچہ تُم جانتے ہو کہ جِس طرح باپ اپنے بچّوں کے ساتھ کرتا ہے اُسی طرح ہم بھی تُم میں سے ہر ایک کو نصِیحت کرتے اور دِلاسا دیتے اور سَمَجھاتے رہے۔ "},
	{12, "12  تاکہ تُمہارا چال چلن خُدا کے لائِق ہو جو تُمہیں اپنی بادشاہی اور جلال میں بُلاتا ہے۔ "},
	{13, "13  اِس واسطے ہم بھی بِلاناغہ خُدا کا شُکر کرتے ہیں کہ جب خُدا کا پَیغام ہماری معرفت تُمہارے پاس پہُنچا تو تُم نے اُسے آدمِیوں کا کلام سَمَجھ کر نہِیں بلکہ (جَیسا حقِیقت میں ہے) خُدا کا کلام جان کر قُبُول کِیا اور وہ تُم میں جو اِیمان لائے ہو تاثِیر بھی کر رہا ہے۔ "},
	{14, "14  اِس لِئے کہ تُم اَے بھائِیو! خُدا کی اُن کلِیسیاؤں کی مانِند بن گئے جو یہُودِیہ میں مسِیح یِسُوع میں ہیں کِیُونکہ تُم نے بھی اپنی قَوم والوں سے وُہی تکلِیفیں اُٹھائیں جو اُنہوں نے یہُودِیوں سے۔ "},
	{15, "15  جِنہوں نے خُداوند یِسُوع کو اور نبِیوں کو بھی مار ڈالا اور ہم کو ستا ستا کر نِکال دِیا۔ وہ خُدا کو پسند نہِیں آتے اور سب آدمِیوں کے مُخالِف ہیں۔ "},
	{16, "16  اور وہ ہمیں غَیرقَوموں کو اُن کی نِجات کے لِئے کلام سُنانے سے منع کرتے ہیں تاکہ اُن کے گُناہوں کا پَیمانہ ہمیشہ بھرتا رہے لیکِن اُن پر اِنتہا کا غضب آگیا۔ "},
	{17, "17  اَے بھائِیو! جب ہم تھوڑے عرصہ کے لِئے ظاہِر میں نہ کہ دِل سے تُم سے جُدا ہو گئے تو ہم نے کمال آرزُو سے تُمہاری صُورت دیکھنے کی اَور بھی زِیادہ کوشِش کی۔ "},
	{18, "18  اِس واسطے ہم نے (یعنی مُجھ پَولُس نے) ایک دفعہ نہِیں بلکہ دو دفعہ تُمہارے پاس آنا چاہا مگر شَیطان نے ہمیں روکے رکھّا۔ "},
	{19, "19  بھلا ہماری اُمِید اور خُوشی اور فخر کا تاج کیا ہے؟ کیا وہ ہمارے خُداوند یِسُوع کے سامنے اُس کے آنے کے وقت تُم ہی نہ ہوگے؟ "},
	{20, "20  ہمارا جلال اور خُوشی تُم ہی تو ہو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ur3 poems[] = {
	{1, "1  اِس واسطے جب ہم زِیادہ برداشت نہ کر سکے تو اتھینے میں اکیلے رہ جانا منظُور کِیا۔ "},
	{2, "2  اور ہم نے تِیمُتھیُس کو جو ہمارا بھائِی اور مسِیح کی خُوشخَبری میں خُدا کا خادِم ہے اِس لِئے بھیجا کہ وہ تُمہیں مضبُوط کرے اور تُمہارے اِیمان کے بارے میں تُمہیں نصِیحت کرے۔ "},
	{3, "3  کہ اِن مُصِبتوں کے سبب سے کوئی نہ گھبرائے کِیُونکہ تُم جانتے ہو کہ ہم اِن ہی کے لِئے مُقرّر ہُوئے ہیں۔ "},
	{4, "4  بلکہ پہلے بھی جب ہم تُمہارے پاس تھے تو تُم سے کہا کرتے تھے کہ ہمیں مُصِیبت اُٹھانا ہوگا چُنانچہ اَیسا ہی ہُؤا اور تُمہیں معلُوم بھی ہے۔ "},
	{5, "5  اِس واسطے جب مَیں اَور زِیادہ برداشت نہ کرسکا تو تُمہارے اِیمان کا حال دریافت کرنے کو بھیجا۔ کہِیں اَیسا نہ ہُؤا ہوکہ آزمانے والے نے تُمہیں آزمایا ہو اور ہماری محنت بے فائِدہ گئی ہو۔ "},
	{6, "6  مگر اَب جو تِیمُتھیُس نے تُمہارے پاس سے ہمارے پاس آ کر تُمہارے اِیمان اور محبّت کی اور اِس بات کی خُوشخَبری دی کہ تُم ہمارا ذِکرِ خَیر ہمیشہ کرتے ہو اور ہمارے دیکھنے کے اَیسے مُشتاق ہو جَیسے کہ ہم تُمہارے۔ "},
	{7, "7  اِس لِئے اَے بھائِیو! ہم نے اپنی ساری اِحتیاج اور مُصِیبت میں تُمہارے اِیمان کے سبب سے تُمہارے بارے میں تسلّی پائی۔ "},
	{8, "8  کِیُونکہ اَب اگر تُم خُداوند میں قائِم ہو تو ہم زِندہ ہیں۔ "},
	{9, "9  تُمہارے باعِث اپنے خُدا کے سامنے ہمیں جِس قدر خُوشی حاصِل ہے اُس کے بدلہ میں کِس طرح تُمہاری بابت خُدا کا شُکر ادا کریں؟ "},
	{10, "10  ہم رات دِن بہُت ہی دُعا کرتے رہتے ہیں کہ تُمہاری صُورت دیکھیں اور تُمہارے اِیمان کی کمی پُوری کریں۔ "},
	{11, "11  اب ہمارا خُدا اور باپ خُود اور ہمارا خُداوند یِسُوع تُمہاری طرف ہماری رہبری کرے۔ "},
	{12, "12  اور خُداوند اَیسا کرے کہ جِس طرح ہم کو تُم سے محبّت ہے اُسی طرح تُمہاری محبّت بھی آپس میں اور سب آدمِیوں کے ساتھ زِیادہ ہو اور بڑھے۔ "},
	{13, "13  تاکہ وہ تُمہارے دِلوں کو اَیسا مضبُوط کر دے کہ جب ہمارا خُداوند یِسُوع اپنے سب مُقدّسوں کے ساتھ آئے تو وہ ہمارے خُدا اور باپ کے سامنے پاکیزگی میں بے عَیب ٹھہریں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ur4 poems[] = {
	{1, "1  غرض اَے بھائِیو! ہم تُم سے دَرخواست کرتے ہیں اور خُداوند یِسُوع میں تُمہیں نصِیحت کرتے ہیں کہ جِس طرح تُم نے ہم سے مُناسِب چال چلنے اور خُدا کو خُوش کرنے کی تعلِیم پائی اور جِس طرح تُم چلتے بھی ہو اُسی طرح اَور ترقّی کرتے جاؤ۔ "},
	{2, "2  کِیُونکہ تُم جانتے ہو کہ ہم نے تُم کو خُداوند یِسُوع کی طرف سے کیا کیا حُکم پہُنچائے۔ "},
	{3, "3  چُنانچہ خُدا کی مرضی یہ ہے کہ تُم پاک بنو یعنی حرامکاری سے بچے رہو۔ "},
	{4, "4  اور ہر ایک تُم میں سے پاکیزگی اور عِزّت کے ساتھ اپنے ظرف کو حاصِل کرنا جانے۔ "},
	{5, "5  نہ شہوت کے جوش سے اُن قَوموں کی مانِند جو خُدا کو نہِیں جانتیں۔ "},
	{6, "6  اور کوئی شَخص اپنے بھائِی کے ساتھ اِس امر میں زِیادتی اور دغا نہ کرے کِیُونکہ خُداوند اِن سب کاموں کا بدلہ لینے والا ہے چُنانچہ ہم نے پہلے بھی تُم کو تنبِیہ کر کے جتا دِیا تھا۔ "},
	{7, "7  اِس لِئے کہ خُدا نے ہم کو ناپاکی کے لِئے نہِیں بلکہ پاکیزگی کے لِئے بُلایا۔ "},
	{8, "8  پَس جو نہِیں مانتا وہ آدمِی کو نہِیں بلکہ خُدا کو نہِیں مانتا جو تُم کو اپنا پاک رُوح دیتا ہے۔ "},
	{9, "9  مگر برادرانہ محبّت کی بابت تُمہیں کُچھ لِکھنے کی حاجت نہِیں کِیُونکہ تُم آپس میں محبّت کرنے کی خُدا سے تعلِیم پا چُکے ہو۔ "},
	{10, "10  اور تمام مکِدُنیہ کے سب بھائِیوں کے ساتھ اَیسا ہی کرتے ہو لیکِن اَے بھائِیو! ہم تُمہیں نصِیحت کرتے ہیں کہ ترقّی کرتے جاؤ۔ "},
	{11, "11  اور جِس طرح ہم نے تُم کو حُکم دِیا چُپ چاپ رہنے اور اپنا کاروبار کرنے اور اپنے ہاتھوں سے محنت کرنے کی ہِمّت کرو۔ "},
	{12, "12  تاکہ باہِر والوں کے ساتھ شایستگی سے برتاؤ کرو اور کِسی چِیز کے محُتاج نہ ہو۔ "},
	{13, "13  اَے بھائِیو! ہم نہِیں چاہتے کہ جو سوتے ہیں اُن کی بابت تُم ناواقِف رہو تاکہ اَوروں کی مانِند جو نااُمِید ہیں غم نہ کرو۔ "},
	{14, "14  کِیُونکہ جب ہمیں یہ یقِین ہے کہ یِسُوع مر گیا اور جی اُٹھا تو اُسی طرح خُدا اُن کو بھی جو سو گئے ہیں یِسُوع کے وسِیلہ سے اُسی کے ساتھ لے آئے گا۔ "},
	{15, "15  چُنانچہ ہم تُم سے خُداوند کے کلام کے مُطابِق کہتے ہیں کہ ہم جو زِندہ ہیں اور خُداوند کے آنے تک باقی رہیں گے سوئے ہُوؤں سے ہرگِز آگے نہ بڑھیں گے۔ "},
	{16, "16  کِیُونکہ خُداوند خُود آسمان سے للکار اور مُقّرب فرِشتہ کی آواز اور خُدا کے نرسِنگے کے ساتھ اُتر آئے گا اور پہلے تو وہ جو مسِیح میں مُوئے جی اُٹھیں گے۔ "},
	{17, "17  پھِر ہم جو زِندہ باقی ہوں گے اُن کے ساتھ بادلوں پر اُٹھائے جائیں گے تاکہ ہوا میں خُداوند کا اِستقبال کریں اور اِس طرح ہمیشہ خُداوند کے ساتھ رہیں گے۔ "},
	{18, "18  پَس تُم اِن باتوں سے ایک دُوسرے کو تسلّی دِیا کرو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ur5 poems[] = {
	{1, "1  مگر اَے بھائِیو! اِس کی کُچھ حاجت نہِیں کہ وقتوں اور مَوقعوں کی بابت تُم کو کُچھ لِکھا جائے۔ "},
	{2, "2  اِس واسطے کہ تُم آپ خُوب جانتے ہو کہ خُداوند کا دِن اِس طرح آنے والا ہے جِس طرح رات کو چَور آتا ہے۔ "},
	{3, "3  جِس وقت لوگ کہتے ہوں گے کہ سَلامتی اور امن ہے اُس وقت اُن پر اِس طرح ناگہان ہلاکت آئے گی جِس طرح حامِلہ کو درد لگتے ہیں اور وہ ہرگِز نہ بچیں گے۔ "},
	{4, "4  لیکِن تُم اَے بھائِیو! تارِیکی میں نہِیں ہو کہ وہ دِن چَور کی طرح تُم پر آ پڑے۔ "},
	{5, "5  کِیُونکہ تُم سب نُور کے فرزند اور دِن کے فرزند ہو۔ ہم نہ رات کے ہیں نہ تارِیکی کے۔ "},
	{6, "6  پَس اَوروں کی طرح سو نہ رہیں بلکہ جاگتے اور ہوشیار رہیں۔ "},
	{7, "7  کِیُونکہ جو سوتے ہیں رات ہی کو سوتے ہیں اور جو متوالے ہوتے ہیں رات ہی کو متوالے ہوتے ہیں۔ "},
	{8, "8  مگر ہم جو دِن کے ہیں اِیمان اور محبّت کا بکتر لگا کر اور نِجات کی اُمِید کو خُود پہن کر ہوشیار رہیں۔ "},
	{9, "9  کِیُونکہ خُدا نے ہمیں غضب کے لِئے نہِیں بلکہ اِس لِئے مُقرّر کِیا کہ ہم اپنے خُداوند یِسُوع مسِیح کے وسِیلہ سے نِجات حاصِل کریں۔ "},
	{10, "10  وہ ہماری خاطِر اِس لِئے مُؤا کہ ہم جاگتے ہوں یا سوتے ہوں سب مِل کر اُسی کے ساتھ جِئیں۔ "},
	{11, "11  پَس تُم ایک دُوسرے کو تسلّی دو اور ایک دُوسرے کی ترقّی کا باعِث بنو۔ چُنانچہ تُم اَیسا کرتے بھی ہو۔ "},
	{12, "12  اور اَے بھائِیو! ہم تُم سے دَرخواست کرتے ہیں کہ جو تُم میں محنت کرتے اور خُداوند میں تُمہارے پیشوا ہیں اور تُم کو نصِیحت کرتے ہیں اُنہِیں مانو۔ "},
	{13, "13  اور اُن کے کام کے سبب سے محبّت کے ساتھ اُن کی بڑی عِزّت کرو۔ آپس میں میل مِلاپ رکھّو۔ "},
	{14, "14  اور اَے بھائِیو! ہم تُمہیں نصِیحت کرتے ہیں کہ بے قائِدہ چلنے والوں کو سَمَجھاؤ۔ کم ہِمّتوں کو دِلاسا دو۔ کمزوروں کو سنبھالو۔ سب کے ساتھ تحمُّل سے پیش آؤ۔ "},
	{15, "15  خَبردار! کوئی کِسی سے بدی کے عوض بدی نہ کرے بلکہ ہر وقت نیکی کرنے کے درپَے رہو۔ آپس میں بھی اور سب سے۔ "},
	{16, "16  ہر وقت خُوش رہو۔ "},
	{17, "17  بِلاناغہ دُعا کرو۔ "},
	{18, "18  ہر ایک بات میں شُکرگُذاری کرو کِیُونکہ مسِیح یِسُوع میں تُمہاری بابت خُدا کی یہی مرضی ہے۔ "},
	{19, "19  رُوح کو نہ بُجھاؤ۔ "},
	{20, "20  نبُوّتوں کی حقارت نہ کرو۔ "},
	{21, "21  سب باتوں کو آزماؤ۔ جو اچھّی ہو اُسے پکڑے رہو۔ "},
	{22, "22  ہر قِسم کی بدی سے بچے رہو۔ "},
	{23, "23  خُدا جو اِطمینان کا چشمہ ہے آپ ہی تُم کو بالکُل پاک کرے اور تُمہاری رُوح اور جان اور بَدَن ہمارے خُداوند یِسُوع مسِیح کے آنے تک پُورے پُورے اور بے عَیب محفُوظ رہیں۔ "},
	{24, "24  تُمہارا بُلانے والا سَچّا ہے۔ وہ اَیسا ہی کرے گا۔ "},
	{25, "25  اَے بھائِیو! ہمارے واسطے دُعا کرو۔ "},
	{26, "26  پاک بوسہ کے ساتھ سب بھائِیوں کو سَلام کرو۔ "},
	{27, "27  مَیں تُمہیں خُداوند کی قَسم دیتا ہُوں کہ یہ خط سب بھائِیوں کو سُنایا جائے۔ "},
	{28, "28  ہمارے خُداوند یِسُوع مسِیح کا فضل تُم پر ہوتا رہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};