#include <map>
#include <string>
class Bible19
{
	struct ur1	{ int val; const char *msg; };
	struct ur2	{ int val; const char *msg; };
	struct ur3	{ int val; const char *msg; };
	struct ur4	{ int val; const char *msg; };
	struct ur5	{ int val; const char *msg; };
	struct ur6	{ int val; const char *msg; };
	struct ur7	{ int val; const char *msg; };
	struct ur8	{ int val; const char *msg; };
	struct ur9	{ int val; const char *msg; };
	struct ur10	{ int val; const char *msg; };
	struct ur11	{ int val; const char *msg; };
	struct ur12	{ int val; const char *msg; };
	struct ur13	{ int val; const char *msg; };
	struct ur14	{ int val; const char *msg; };
	struct ur15	{ int val; const char *msg; };
	struct ur16	{ int val; const char *msg; };
	struct ur17	{ int val; const char *msg; };
	struct ur18	{ int val; const char *msg; };
	struct ur19	{ int val; const char *msg; };
	struct ur20	{ int val; const char *msg; };
	struct ur21	{ int val; const char *msg; };
	struct ur22	{ int val; const char *msg; };
	struct ur23	{ int val; const char *msg; };
	struct ur24	{ int val; const char *msg; };
	struct ur25	{ int val; const char *msg; };
	struct ur26	{ int val; const char *msg; };
	struct ur27	{ int val; const char *msg; };
	struct ur28	{ int val; const char *msg; };
	struct ur29	{ int val; const char *msg; };
	struct ur30	{ int val; const char *msg; };
	struct ur31	{ int val; const char *msg; };
	struct ur32	{ int val; const char *msg; };
	struct ur33	{ int val; const char *msg; };
	struct ur34	{ int val; const char *msg; };
	struct ur35	{ int val; const char *msg; };
	struct ur36	{ int val; const char *msg; };
	struct ur37	{ int val; const char *msg; };
	struct ur38	{ int val; const char *msg; };
	struct ur39	{ int val; const char *msg; };
	struct ur40	{ int val; const char *msg; };
	struct ur41	{ int val; const char *msg; };
	struct ur42	{ int val; const char *msg; };
	struct ur43	{ int val; const char *msg; };
	struct ur44	{ int val; const char *msg; };
	struct ur45	{ int val; const char *msg; };
	struct ur46	{ int val; const char *msg; };
	struct ur47	{ int val; const char *msg; };
	struct ur48	{ int val; const char *msg; };
	struct ur49	{ int val; const char *msg; };
	struct ur50	{ int val; const char *msg; };
	struct ur51	{ int val; const char *msg; };
	struct ur52	{ int val; const char *msg; };
	struct ur53	{ int val; const char *msg; };
	struct ur54	{ int val; const char *msg; };
	struct ur55	{ int val; const char *msg; };
	struct ur56	{ int val; const char *msg; };
	struct ur57	{ int val; const char *msg; };
	struct ur58	{ int val; const char *msg; };
	struct ur59	{ int val; const char *msg; };
	struct ur60	{ int val; const char *msg; };
	struct ur61	{ int val; const char *msg; };
	struct ur62	{ int val; const char *msg; };
	struct ur63	{ int val; const char *msg; };
	struct ur64	{ int val; const char *msg; };
	struct ur65	{ int val; const char *msg; };
	struct ur66	{ int val; const char *msg; };
	struct ur67	{ int val; const char *msg; };
	struct ur68	{ int val; const char *msg; };
	struct ur69	{ int val; const char *msg; };
	struct ur70	{ int val; const char *msg; };
	struct ur71	{ int val; const char *msg; };
	struct ur72	{ int val; const char *msg; };
	struct ur73	{ int val; const char *msg; };
	struct ur74	{ int val; const char *msg; };
	struct ur75	{ int val; const char *msg; };
	struct ur76	{ int val; const char *msg; };
	struct ur77	{ int val; const char *msg; };
	struct ur78	{ int val; const char *msg; };
	struct ur79	{ int val; const char *msg; };
	struct ur80	{ int val; const char *msg; };
	struct ur81	{ int val; const char *msg; };
	struct ur82	{ int val; const char *msg; };
	struct ur83	{ int val; const char *msg; };
	struct ur84	{ int val; const char *msg; };
	struct ur85	{ int val; const char *msg; };
	struct ur86	{ int val; const char *msg; };
	struct ur87	{ int val; const char *msg; };
	struct ur88	{ int val; const char *msg; };
	struct ur89	{ int val; const char *msg; };
	struct ur90	{ int val; const char *msg; };
	struct ur91	{ int val; const char *msg; };
	struct ur92	{ int val; const char *msg; };
	struct ur93	{ int val; const char *msg; };
	struct ur94	{ int val; const char *msg; };
	struct ur95	{ int val; const char *msg; };
	struct ur96	{ int val; const char *msg; };
	struct ur97	{ int val; const char *msg; };
	struct ur98	{ int val; const char *msg; };
	struct ur99	{ int val; const char *msg; };
	struct ur100	{ int val; const char *msg; };
	struct ur101	{ int val; const char *msg; };
	struct ur102	{ int val; const char *msg; };
	struct ur103	{ int val; const char *msg; };
	struct ur104	{ int val; const char *msg; };
	struct ur105	{ int val; const char *msg; };
	struct ur106	{ int val; const char *msg; };
	struct ur107	{ int val; const char *msg; };
	struct ur108	{ int val; const char *msg; };
	struct ur109	{ int val; const char *msg; };
	struct ur110	{ int val; const char *msg; };
	struct ur111	{ int val; const char *msg; };
	struct ur112	{ int val; const char *msg; };
	struct ur113	{ int val; const char *msg; };
	struct ur114	{ int val; const char *msg; };
	struct ur115	{ int val; const char *msg; };
	struct ur116	{ int val; const char *msg; };
	struct ur117	{ int val; const char *msg; };
	struct ur118	{ int val; const char *msg; };
	struct ur119	{ int val; const char *msg; };
	struct ur120	{ int val; const char *msg; };
	struct ur121	{ int val; const char *msg; };
	struct ur122	{ int val; const char *msg; };
	struct ur123	{ int val; const char *msg; };
	struct ur124	{ int val; const char *msg; };
	struct ur125	{ int val; const char *msg; };
	struct ur126	{ int val; const char *msg; };
	struct ur127	{ int val; const char *msg; };
	struct ur128	{ int val; const char *msg; };
	struct ur129	{ int val; const char *msg; };
	struct ur130	{ int val; const char *msg; };
	struct ur131	{ int val; const char *msg; };
	struct ur132	{ int val; const char *msg; };
	struct ur133	{ int val; const char *msg; };
	struct ur134	{ int val; const char *msg; };
	struct ur135	{ int val; const char *msg; };
	struct ur136	{ int val; const char *msg; };
	struct ur137	{ int val; const char *msg; };
	struct ur138	{ int val; const char *msg; };
	struct ur139	{ int val; const char *msg; };
	struct ur140	{ int val; const char *msg; };
	struct ur141	{ int val; const char *msg; };
	struct ur142	{ int val; const char *msg; };
	struct ur143	{ int val; const char *msg; };
	struct ur144	{ int val; const char *msg; };
	struct ur145	{ int val; const char *msg; };
	struct ur146	{ int val; const char *msg; };
	struct ur147	{ int val; const char *msg; };
	struct ur148	{ int val; const char *msg; };
	struct ur149	{ int val; const char *msg; };
	struct ur150	{ int val; const char *msg; };
public:
static void view1() {
struct ur1 poems[] = {
	{1, "1  مُبارک ہے وہ آدمی جو شریروں کی صلاح پر نہیں چلتا اور خطا کاروں کی راہ میں کھڑا نہیں ہوتا اور ٹھٹھا بازوں کی مجلس میں نہیں بیٹھتا۔ "},
	{2, "2  بلکہ خُداوند کی شریعت میں اُس کی خوشنودی ہے اور اُسی کی شریعت پر دِن رات اُس کا دِھیان رہتا ہے۔ "},
	{3, "3  وہ اُس درخت کی مانند ہوگا جو پانی کی ندیوں کے پاس لگایا گیا ہے۔ جو اپنے وقت پر پھلتا ہے اور جسکا پتا بھی نہیں مُرجھاتا۔ سو جو کچھ وہ کرئے بارور ہوگا۔ "},
	{4, "4  شِریر ایسے نہیں بلکہ وہ بُھوسے کی مانند ہیں جسے ہوا اُڑا لے جاتی ہے۔ "},
	{5, "5  اِس لئے شِریر عدالت میں قائم نہ رہینگے نہ خطا کار صادقوں کی جماعت میں۔ "},
	{6, "6  کیونکہ خُداوند صادقوں کی راہ جانتا ہے پر شِریر وں کی راہ نابُود ہو جائیگی ۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ur2 poems[] = {
	{1, "1  قومیں کس لئے طیش میں ہیں اور لوگ کیوں باطل خیال باندھے ۔ "},
	{2, "2  خُداوند اور اُس کے مسیح کے خلاف زمیں کے بادشاہ صف آرائی کرکے اور حاکم آپس میں مشورہ کرکے کہتے ہیں۔ "},
	{3, "3  آؤ ہم اُن کے بندھن توڑ ڈالیں اور اُن کی رسیاں اپنے اُوپر سے اُتار پھینکیں۔ "},
	{4, "4  وہ جو آسمان پر تخت نشین ہے ہنسیگا۔خُداوند اُن کا مضحکہ اُڑائےگا۔ "},
	{5, "5  تب وہ اپنے غضب میں اُن سے کلام کرئےگا اور اپنے قہر شدید میں اُن کو پریشان کردیگا۔ "},
	{6, "6  میں تو اپنے بادشاہ کو اپنے کوہ ِمقدس صِیون پر بٹھا چُکا ہوں۔ "},
	{7, "7  میں اُس فرمان کو بیان کرونگا۔ خُداوند نے مجھ سے کہا تُو میرا بیٹا ہے۔ آج تُو مجھ سے پیدا ہوا۔ "},
	{8, "8  مجھ مانگ اور میں قوموں کو تیری میراث کے لئے اور زمین کے اِنتہائی حصے تیرے ملکیت کے لئے تجھے بخشونگا۔ "},
	{9, "9  تُو اُن کو لوہے کے عصا سے توڑیگا۔ کمہار کے برتن کی طرح تُو اُن کو چکنا چُور کر ڈالیگا۔ "},
	{10, "10  پس اب اَے بادشاہو! دانشمند بنو۔ اِے زمین کے عدالت کرنے والو تربیت پاؤ۔ "},
	{11, "11  ڈرتے ہوئے خُداوند کی عبادت کرو۔ کانپتے ہوئے خوشی مناؤ۔ "},
	{12, "12  بیٹے کو چُومو۔ ایسا نہ ہو کہ وہ قہر میں آئے اور تُم راستہ میں ہلاک ہو جاؤ کیونکہ اُس کا غضب جلد بھڑکنے کو ہے۔ مُبارک ہیں وہ سب جن کا تُوکل اُس پر ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ur3 poems[] = {
	{1, "1  اِے خُداوند میرے ستانے والے کتنے بڑھ گئے! وہ جو میرے خلاف اُٹھتے ہیں بہت ہیں۔ "},
	{2, "2  بہت سے میری جان کے بارے میں کہتے ہیں کہ خُدا کی طرف سے اُس کی کمک نہ ہو گی۔ (سلاہ) "},
	{3, "3  لیکن تُو اَے خُداوند! ہر طرف میری سِپر ہے۔ میرا فخر اور سرفراز کرنے والا۔ "},
	{4, "4  میں بلند آواز سے خُداوند کے حضُور فریاد کرتا ہوں اور وہ اپنے کوہِ مُقدس پر سے مجھے جواب دیتا ہے۔ (سلاہ): "},
	{5, "5  میں لیٹ کر سو گیا۔ میں جاگ اُٹھا کیونکہ خُداوند مجھے سبنھالتا ہے۔ "},
	{6, "6  میں اُن دس ہزار آدمیوں سے نہیں ڈرنے کا جو گرد اگرد میرے خِلاف صف بستہ ہیں۔ "},
	{7, "7  اُٹھ اَے خُداوند! اَے میرے خُدا! مجھے بچالے! کیونکہ تُونے میرے سب دُشمنوں کو جبڑے پر مارا ہے۔ تُو نے شِریروں کے دانت توڑ ڈالے ہیں۔ "},
	{8, "8  نجات خُداوند کی طرف سے ہے۔ تیرے لوگوں پر تیری برکت ہو! (سلاہ) "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ur4 poems[] = {
	{1, "1  جب میں پُکاروں تو مجھے جواب دے۔ اَے میری صداقت کے خُدا! تنگی میں تُو نے مجھے کُشادگی بخشی۔ مجھ پر رحم کر اور میری دُعا سُن لے۔ "},
	{2, "2  اَے بنی آدم! کب تک میری عزت کے بدلے رُسوائی ہو گی؟ تُم کب تک بطالت سے محبت رکھو گے اور جُھوٹ کے درپے رہوگے؟(سلاہ): "},
	{3, "3  جان رکھو کہ خُداوند نے دیندار کو اپنے لئے الگ کر رکھا ہے۔ جب میں خُداوند کو پُکارونگا تو وہ سُن لیگا۔ "},
	{4, "4  تھرتھراؤ اور گُناہ نہ کرو۔ اپنے اپنے بستر پر دِل میں سوچو اور خاموش رہو۔ (سلاہ) "},
	{5, "5  صداقت کی قربانیاں گذرانو اور خُداوند پر تُوکل کرو۔ "},
	{6, "6  بہت سے کہتے ہیں کون ہم کو کچھ بھلائی دِکھائیگا؟ اَے خُداوند تُو اپنے چہرہ کانُور ہم پر جلوہ گر فرما۔ "},
	{7, "7  تُو نے میرے دِل کو اُس سے زیادہ خُوشی بخشی ہے جو اُ ن کو غلّا اور مَے کی فراوانی سے ہوتی تھی۔ "},
	{8, "8  میں سلامتی سے لیٹ جاؤنگا اور سورہونگا کیونکہ اَے خُداوند! فقط تُو ہی مجھے مطمئن رکھتا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ur5 poems[] = {
	{1, "1  اَے خُداوند میری باتوں پر کان لگا! میری آہوں پر توجُّہ کر! "},
	{2, "2  اَے میرے بادشاہ! اَے میرے خُدا! میری فریاد کی آواز کی طرف مُتوجّہ ہو کیونکہ میں تجھ ہی سے دُعا کرتا ہوں۔ "},
	{3, "3  اَے خُداوند! تُو صُبح کو میری آواز سُنیگا۔ میں سویرے ہی تجھ سے دُعا کرکے انتظار کرونگا۔ "},
	{4, "4  کیونکہ تُو ایسا خُدا نہیں جو شرارت سے خُوش ہو۔ بدی تیرے ساتھ نہیں رہ سکتی۔ "},
	{5, "5  گھمنڈی تیرے حضُور کھڑے نہ ہونگے۔ تجھے سب بدکرداروں سے نفرت ہے۔ "},
	{6, "6  تُواُن کو جو جُھوٹ بولتے ہیں ہلاکے کریگا۔ خُداوند کو خُونخوار اور دغا باز آدمی سے کراہیت ہے۔ "},
	{7, "7  لیکن میں تیری شفقت کر کثرت سے تیرے گھر میں آؤنگا۔ میں تیرا رُعب مان کر تیری مُقدس ہَیکل کی طرف رُخ کرکے سجدہ کرونگا۔ "},
	{8, "8  اَے خُداوند! میرے دُشمنوں کے سبب سے مجھے اپنی صداقت میں چَلا۔ میرے آگے آگے اپنی راہ کو صاف کردے۔ "},
	{9, "9  کیونکہ اُن کے مُنہ میں ذرا سچائی نہیں۔ اُن کا باطن محض شرارت ہے۔ اُن کا گلا کھُلی قبر ہے۔ وہ اپنی زبان سے خُوشامد کرتے ہیں۔ "},
	{10, "10  اَے خُدا! تُو اُن کو مجُرم ٹھہرا۔ وہ اپنے ہی مشوروں سے تباہ ہوں۔ اُن کو اُن کے گناہوں کی کثرت کے سبب سے خارج کردے کیونکہ اُنہوں نے تجھ سے سرکشی کی ہے۔ "},
	{11, "11  لیکن وہ سب جو تجھ پر بھروسا رکھتے ہیں شادمان ہوں۔ وہ سدا خُوشی سے لکاریں کیونکہ تُو اُن کی حمایت کرتا ہے اور جو تیرے نام سے محبت رکھتے ہیں تجھ میں شاد رہیں۔ "},
	{12, "12  کیونکہ تُو صادق کو برکت بخشیگا۔ اَے خُداوند! تُو اُسے کرم سے سِپر کی طرح ڈھانک لیگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ur6 poems[] = {
	{1, "1  اَے خُداوند! تُو مجھے اپنے قہر میں نہ جھڑک اور اپنے غیظ وغضب میں مجھے تنبیہ نہ دے۔ "},
	{2, "2  اَے خُداوند! مجھ پر رحم کر کیونکہ میں پژ مُردہ ہو گیا ہوں۔ اَے خُداوند مجھے شفا دے کیونکہ میری ہڈیوں میں بے قراری ہے۔ "},
	{3, "3  میری جان بھی نہایت بے قرار ہے اور تُواے خُداوند! کب تک؟ "},
	{4, "4  لَوٹ اے خُداوند! میری جان کو چھُڑا۔ اپنی شفقت کی خاطر مجھے بچا لے۔ "},
	{5, "5  کیونکہ موت کے بعد تیری یاد نہیں ہوتی قبر میں کون تیری شکرگذاری کریگا؟ "},
	{6, "6  میں کراہتے کراہتے تھک گیا۔ میں اپنا پلنگ آنسوؤوں سے بھگوتا ہوں۔ ہررات میرا بستر تیرتا ہے۔ "},
	{7, "7  میری آنکھ غم کے مارے بیٹھی جاتی ہے اور میرے سب مخالفوں کے سبب سے دُھندلانے لگی۔ "},
	{8, "8  اے سب بدکردارو! میرے پاس سے دُور ہو کیونکہ خُداوند نے میرے رونے کی آواز سُن لی ہے۔ "},
	{9, "9  خُداوند نے میری مِنت سُن لی۔ خُداوند میری دُعا قبول کریگا۔ "},
	{10, "10  میرے سب دُشمن شرمندہ اور نہایت بے قرار ہونگے ۔ وہ لَوٹ جائینگے۔ وہ وفعتہً شرمندہ ہونگے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct ur7 poems[] = {
	{1, "1  اے خُداوند میرے خُدا! میرا توکل تجھ پر ہے۔ سب پیچھا کرنے والوں سے مجھے بچا اور چھُڑا۔ "},
	{2, "2  ایسا نہ ہو کہ وہ شیرببر کی طرح میری جان کو پھاڑے۔ وہ اُسے ٹکڑے ٹکڑے کردے اور کوئی چھُڑانے والا نہ ہو۔ "},
	{3, "3  اے خُداوند میرے خُدا! اگر مَیں نے نہ کِیا ہو۔ اگر میرے ہاتھوں سے بدی ہوئی ہو۔ "},
	{4, "4  اگر مَیں نے اپنے میل رکھنے والے سے بھلائی کے بدلے بُرائی کی ہو۔ (بلکہ میں نے تو اُسے جو ناحق میرا مُخالف تھا بچایا ہے) "},
	{5, "5  تو دُشمن میری جان کا پیچھا کرکے اُسے آ پکڑے بلکہ وہ میری زندگی کو پامال کرکے مٹی میں اور میری عزت کو خاک میں مِلادے۔(سِلاہ): "},
	{6, "6  اے خُداوند! اپنے قہر میں اُٹھ۔ میرےمخالفوں کے غضب کے مقابلہ میں تُو کھڑا ہو جا اور میرے لئے جاگ۔ تُو نے اِنصاف کا حکم تو دیدیا ہے۔ "},
	{7, "7  تیرے چوگرد قوموں کا اجتماع ہو اور تُوا ُنکے اُوپر عالم ِ بالا کو لَوٹ جا۔ "},
	{8, "8  خُداوند قوموں کا اِنصاف کرتا ہے۔ اے خُداوند! اُس صداقت و راستی کے مطابق جو مجھ میں ہے میری عدالت کر۔ "},
	{9, "9  کاش کہ شریروں کی بدی کا خاتمہ ہو جائے پر صادق کو تُو قیام بخش کیونکہ خُدای ِ صادق دِلوں اور گُردوں کو جانچتا ہے۔ "},
	{10, "10  میری سپِر خُدا کے ہاتھ میں ہے جو راست دِلوں کو بچاتا ہے۔ "},
	{11, "11  خُدا صادق مُنصف ہے بلکہ ایسا خُدا جو ہر روز قہر کرتا ہے۔ "},
	{12, "12  اگر آدمی باز نہ آئے تو وہ اپنی تلوار تیز کریگا۔ اُس نے اپنی کمان پر چِلّہ چڑھا کر اُسے تیار کر لِیا ہے۔ "},
	{13, "13  اُس نے اُس کے لئے موت کے ہتھیار بھی تیار کِئے ہیں۔ وہ اپنے تِیروں کی آتشی بناتا ہے۔ "},
	{14, "14  دیکھو اُسے بدی کا دردِ زہ لگا ہے! بلکہ وہ شرارت سے باروار ہوا ور اُس سے جھوٹ پیدا ہوا۔ "},
	{15, "15  اُس نے گڑھا کھود کر اُسے گہرا کِیا اور اُس خندق میں جو اُس نے بنائی تھی خُود گِرا۔ "},
	{16, "16  اُس کی شرارت اُلٹی اُسی کے سر پر آئیگی۔اُس کا ظلم اُسی کی کھوپڑی پر نازل ہوگا۔ "},
	{17, "17  خُداوند کی صداقت کے مطابق میں اُس کا شکرکرونگا اور خُداوند تعالیٰ کے نام کی تعریف گاؤنگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct ur8 poems[] = {
	{1, "1  اے خُداوند ہمارے رب! تیرا نام تمام زمین پر کیسا بزرگ ہے! تُو نے اپنا جلال آسمان پر قائم کیا ہے۔ "},
	{2, "2  تُونے اپنے مخالفوں کے سبب سے بچوں اور شیر خواروں کے منہ سے قدرت کو قائم کیا تاکہ تُو دشمن اور اِنتقام لینے والے کو خاموش کردے۔ "},
	{3, "3  جب میں تیرے آسمان پر جو تیری دستکاری ہے اور چاند اور ستاروں پر جن کو تُو نے مقرر کیا غور کرتا ہوں۔ "},
	{4, "4  تو پھر انسان کیا ہے کہ تُو اُسے یاد رکھے اور آدم زاد کیا ہے کہ تُو اُس کی خبر لے؟ "},
	{5, "5  کیونکہ تُو نے اُسے خُدا سے کچھ ہی کمتر بنایا ہے اور جلال اور شوکت سے اُسے تاجدار کرتا ہے۔ "},
	{6, "6  تُو نے اُسے اپنی دستکاری پر تسلط بخشا ہے۔ تُو نے سب کچھ اُس کے قدموں کے نیچے کر دیا ہے۔ "},
	{7, "7  سب بھیڑ بکریاں گائے بَیل بلکہ سب جنگلی جانور "},
	{8, "8  ہوا کے پرندے اور سمندر کی مچھلیاں اور جو کچھ سمندروں کے راستوں میں چلتا پھرتا ہے۔ "},
	{9, "9  اے خُداوند ہمارے رب ! تیرا نام تمام زمین پر کیسا بزرگ ہے! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct ur9 poems[] = {
	{1, "1  میں اپنے پورے دِل سے خُداوند کی شکر گذاری کرونگا۔ میں تیرے سب عجیب کاموں کا بیان کرونگا۔ "},
	{2, "2  میں تجھ میں خوشی مناؤنگا اور مسرور ہونگا۔ اے حق تعالیٰ میں تیری ستایش کرونگا۔ "},
	{3, "3  جب میرے دشمن پیچھے ہٹتے ہیں تو تیری حضُوری کے سبب سے لغزش کھاتے اور ہلاک ہوجاتے ہیں۔ "},
	{4, "4  کیونکہ تُو نے میرے حق کی اور میرے معاملہ کی تائید کی ہے۔ تُو نے تخت پر بیٹھ کر صداقت سے اِنصاف کیا۔ "},
	{5, "5  تُو نے قوموں کو جھڑکا۔ تُو نے شریروں کو ہلاک کیا ہے۔ تُو نے اُنکا نام ابدالآباد کے لئے مِٹاڈالا ہے۔ "},
	{6, "6  دشمن تمام ہوئے۔ وہ ہمیشہ کے لئے برباد ہوگئے اور جن شہروں کو تُو نے ڈھادیا اُنکی یاد گار تک مِٹ گئی۔ "},
	{7, "7  اُس نے انصاف کے لئے اپنا تخت تیار کیا ہے "},
	{8, "8  اور وہی صداقت سے جہان کی عدالت کریگا۔ وہ راستی سے قوموں کا اِنصاف کریگا۔ "},
	{9, "9  خُداوند مظلوموں کے لئے اُونچا بُرج ہوگا۔ مصیبت کے ایام میں اُونچا بُرج "},
	{10, "10  اور وہ جو تیرا نام جانتے ہیں تجھ پر توکل کرینگے کیونکہ اَے خُداوند! تُو نے اپنے طالبوں کر ترک نہیں کیا ہے۔ "},
	{11, "11  خُداوند کے درمیان اُس کے کاموں کا بیان کرو "},
	{12, "12  کیونکہ خُون کی پُرسِش کرنے والا اُن کو یاد رکھتا ہے۔وہ غریبوں کی فریاد کو نہیں بھولتا۔ "},
	{13, "13  اَے خُداوند مجھ پر رحم کر! تُو جو موت کے پھاٹکوں سے مجھے اُٹھاتا ہے۔ میرے اُس دُکھ کو دیکھ جو میرے نفرت کرنے والوں کی طرف سے ہے۔ "},
	{14, "14  تاکہ میں تیری کامل ستایش کا اظہار کروں۔ صیُّون کی بیٹی کے پھاٹکوں پر میں تیری نجات سے شادمان ہونگا۔ "},
	{15, "15  قومیں خُود اُس گڑھے میں گِری ہیں جسے اُنہوں نے کھودا تھا۔ جو جال اُنہوں نے لگایاتھا اُس میں اُن ہی کا پاؤں پھنسا۔ "},
	{16, "16  خُداوند کی شہرت پھیل گءی۔ اُس نے اِنصاف کیا ہے۔ شریر اپنے ہی ہاتھ کے کاموں میں پھنس گیا ہے۔ (ہِگایون سِلاہ) "},
	{17, "17  شریر پاتال میں جائینگے۔ یعنی وہ سب قومیں جو خُدا کو بھول جاتی ہیں۔ "},
	{18, "18  کیونکہ مسکین سدا بُھولے بسرے نہ رہینگے۔ نہ غربیوں کی اُمید ہمیشہ کے لئے ٹوٹیگی۔ "},
	{19, "19  اُٹھ اَے خُداوند! اِنسان غالب نہ ہونے پائے۔ قوموں کی عدالت تیرے حضور ہو۔ "},
	{20, "20  اَے خُداوند! اُنکو خوف دِلا۔ قومیں اپنے آپ کو بشر ہی جانیں۔ (سِلاہ) "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct ur10 poems[] = {
	{1, "1  اَے خُداوند! تُو کیوں دُور کھڑا رہتا ہے؟ مصیبت کے وقت تُو کیوں چھپ جاتا ہے؟ "},
	{2, "2  شریر کے غُرور کے سبب سے غریب کا تُندی سے پیچھا کیا جاتا ہے۔ جو منصُوبے اُنہوں نے باندھے ہیں وہ اُن ہی میں گرفتار ہو جائیں۔ "},
	{3, "3  کیونکہ شریر اپنی نفسانی خواہش پر فخر کرتا ہے اور لالچی خُداوند کر ترک کرتا بلکہ اُس کی اِہانت کرتا ہے۔ "},
	{4, "4  شریر اپنے تکبُر میں کہتا ہے کہ وہ باز پُرس نہیں کریگا۔ اُس کا خیال سراسریہی ہے کہ کوئی خُدا نہیں۔ "},
	{5, "5  اُس کی راہیں ہمیشہ اُستوار ہیں تیرے احکام اُس کی نظر سے بعیدوبلند ہیں۔ وہ اپنے سب مخالفوں پر پھُنکارتا ہے۔ "},
	{6, "6  وہ اپنے دِل میں کہتا ہے میں جنبش نہیں کھانے کا۔ پشت درپشت مجھ پر کبھی مصیبت نہ آئیگی۔ "},
	{7, "7  اُس کا مُنہ لعنت ودغا اور ظُلم سے پُر ہے۔ شرارت اور بدی اُس کی زبان پر ہیں۔ "},
	{8, "8  وہ دیہات کی کمینگاہوں میں بیٹھتا ہے۔ وہ پوشیدہ مقاموں میں بے گُناہ کو قتل کرتا ہے اُس کی آنکھیں بیکس کی گھات میں لگی رہتی ہیں۔ "},
	{9, "9  وہ پوشیدہ مقام میں شیرببر کی طرح دبک کر بیٹھتا ہے۔ وہ غریب کو پکڑنے کو گھات لگائے رہتا ہے۔ وہ غریب کو اپنے جال میں پھنسا کر پکڑ لیتا ہے۔ "},
	{10, "10  وہ دبکتا ہے۔ وہ جُھک جاتا ہے اور بیکس اُس کے پہلوانوں کے ہاتھ سے مارے جاتے ہیں۔ "},
	{11, "11  وہ اپنے دِل میں کہتا ہے خُدا بھُول گیا ہے۔ وہ اپنا مُنہ چھپاتا ہے۔ وہ ہرگز نہیں دیکھے گا۔ "},
	{12, "12  اُٹھ اَے خُداوند! اَے خُدا اپنا ہاتھ بلند کر! غریبوں کو نہ بھُول۔ "},
	{13, "13  شریر کس لئے خُدا کی اِہانت کرتا ہے اور اپنے دِل میں کہتا ہے کہ تُو باز پُرس نہ کریگا؟ "},
	{14, "14  تُو نے دیکھ لیا ہے کیونکہ تُو شرارت اور بغُض دیکھتا ہے تاکہ اپنے ہاتھ سے بدلہ دے۔ بیکس اپنے آپ کو تیرے سُپرد کرتا ہے تُو ہی یتیم کا مددگار رہا ہے۔ "},
	{15, "15  شریر کا بازو توڑ دے۔ اور بدکار کی شرارت کو جب تک نابُود نہ ہو ڈھونڈ ڈھونڈ کر نکال۔ "},
	{16, "16  خُداوند ابدلآباد بادشاہ ہے۔ قومیں اُکے ملک میں سے نابُود ہوگئیں۔ "},
	{17, "17  اَے خُداوند! تُو نے حلیموں کا مُدعا سُن لیا ہے۔ تُو اُنکے دِل کو تیار کریگا۔ تُوکان لگا کر سُنیگا۔ "},
	{18, "18  کہ یتیم اور مظُلوم کا اِنصاف کرے تاکہ انسان جو خاک سے ہے پھر نہ ڈرائے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct ur11 poems[] = {
	{1, "1  میرا توکل خُداوند پر ہے۔ تُم کیونکر میری جان سے کہتے ہو کہ چڑیا کی طرح اپنے پہاڑ پر اُڑ جا؟ "},
	{2, "2  کیونکہ دیکھو! شریر کمان کھینچتے ہیں۔ وہ تِیر کو چلّے پر رکھتے ہیں تاکہ اندھیرے میں راست دِلوں پر چلائیں۔ "},
	{3, "3  اگر بنیاد ہی اُکھاڑ دی جائے تو صادق کیا کرسکتا ہے؟ "},
	{4, "4  خُداوند اپنی مُقدس ہیکل میں ہے۔ خُداوند کا تخت آسمان پر ہے۔ اُس کی آنکھیں بنی آدم کو دیکھتی اور اُس کی پلکیں اُنکو جانچتی ہیں۔ "},
	{5, "5  خُداوند صادِق کو پرکھتا ہ پر شریر اور ظُلم دوست سے اُس کی رُوح کو نفرت ہے۔ "},
	{6, "6  وہ شریروں پر پھندے برسائیگا۔ آگ اور گندھک اور لُو اُنکے پیالے کا حصہ ہوگا۔ "},
	{7, "7  کیونکہ خُداوند صادق ہے۔ وہ صداقت کو پسند کرتا ہے۔ راستباز اُس کا دیدار حاصل کرینگے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct ur12 poems[] = {
	{1, "1  اَے خُداوند! بچالے کیونکہ کوئی دیندار نہیں رہا اور امانت دار لوگ بنی آدم میں سے مِٹ گئے۔ "},
	{2, "2  وہ اپنے اپنے ہمسایہ سے جھوٹ بولتے ہیں۔ وہ خوشامدی لبوں سے دورنگی باتیں کرتے ہیں۔ "},
	{3, "3  خُداوند سب خُوشامدی لبوں کو اور بڑے بول بولنے والی زبان کو کاٹ ڈالیگا۔ "},
	{4, "4  وہ کہتے ہیں ہم اپنی زبان سے جیتیں گے۔ ہمارے ہونٹ ہمارے ہی ہیں۔ ہمارا مالک کون ہے؟ "},
	{5, "5  غربیوں کی تباہی اور مسکینوں کی آہ کے سبب سے خُداوند فرماتا ہے کہ اب میں اُٹھونگا اور جس پر وہ پھُنکارتے ہیں اُسے امن وامان میں رکھونگا۔ "},
	{6, "6  خُداوند کا کلام ِ پاک ہے۔ اُس چاندی کی مانند جو بھٹّی میں مٹّی پر تائی گئی اور سات بار صاف کی گئی ہو۔ "},
	{7, "7  تُو ہی اُن کو اِس پشت سے ہمیشہ تک بچائے رکھے گا۔ "},
	{8, "8  جب بنی آدم میں پاجی پن کی قدر ہوتی ہے تو شریر ہر طرف چلے پھرتے ہیں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct ur13 poems[] = {
	{1, "1  اَے خُداوند کب تک؟ کیا تُو ہمیشہ مجھے بھولا رہیگا؟ تُو کب تک اپنا چہرہ مجھ سے چھپائے رکھے گا؟ "},
	{2, "2  کب تک میں جی ہی جی میں منصُوبہ باندھتا رہوں اور سارے دِن اپنے دِل میں غم کیا کروں؟ کب تک میرا دُشمن مجھ پر سر بلند رہیگا؟ "},
	{3, "3  اَے خُداوند میرے خُدا! میری طرف توجہ کر اور مجھے جواب دے۔ میری آنکھیں روشن کر۔ ایسانہ ہو کہ مجھے موت کی نیند آجائے۔ "},
	{4, "4  ایسا نہ ہو کہ میرا دُشمن کہے کہ میں اِس پر غالب آگیا۔ نہ ہو کہ جب میں جُنبش کھاؤں تو میرے مخالف خُوش ہوں۔ "},
	{5, "5  لیکن میں نے تو تیری رحمت پر توکل کیا ہے۔ میرا دِل تیری نجات سے خُوش ہوگا۔ "},
	{6, "6  میں خُداوند کا گیت گاؤنگا کیونکہ اُس نے مجھ پر احسان کیا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct ur14 poems[] = {
	{1, "1  احمق نے اپنے دِل میں کہا ہے کہ کوئی خُدا نہیں۔وہ بگڑ گئے۔ اُنہوں نے نفرت انگیز کام کئِے ہیں۔ کوئی نیکو کار نہیں۔ "},
	{2, "2  خُداوند نے آسمان پر سے بنی آدم پر نگاہ کی تاکہ دیکھے کہ کوئی دانشمند کوئی خُدا کا طالب ہے یا نہیں۔ "},
	{3, "3  وہ سب کے سب گمراہ ہوئے۔ وہ باہم نجس ہو گئے۔ کوئی نیکو کار نہیں۔ ایک بھی نہیں۔ "},
	{4, "4  کیا اُن سب بدکرداروں کو کچھ علم نہیں جو میرے لوگوں کو ایسے کھا جاتے ہیں جیسے رُوٹی اور خُداوند کا نام نہیں لیتے؟ "},
	{5, "5  وہاں اُن پر بڑا خوف چھا گیا کیونکہ خُدا صادق پشت کے ساتھ ہے۔ "},
	{6, "6  تم غریب کی مشورت کی ہنسی اُڑاتے ہو۔ اِس لئے کہ خُداوند اُس کی پناہ ہے۔ "},
	{7, "7  کاش کہ اسرائیل کی نجات صیُّون میں سے ہوتی! جب خُداوند اپنے لوگوں کو اسیری سے لوٹا لائیگا تو یعقوب خُوش اور اسرائیل شادمان ہوگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct ur15 poems[] = {
	{1, "1  اَے خُداوند تیرے خیمہ میں کون رہیگا؟ تیرے کوہِ مقدس پر کون سکونت کریگا؟ "},
	{2, "2  وہ جو راستی سے چلتا اور صداقت کا کام کرتا اور دِل سے سچ بولتا ہے۔ "},
	{3, "3  وہ جو اپنی زبان سے بہتان نہیں باندھتا۔ اور اپنے دوست سے بدی نہیں کرتا اور اپنے ہمسایہ کی بدنامی نہیں سُنتا "},
	{4, "4  وہ جس کی نظر میں رذیل آدمی حقیرہے پر جو خُداوند سے ڈرتے ہیں اُن کی عزت کرتا ہے۔ وہ جو قسم کھا کر بدلتا نہیں خواہ نقصان ہی اُٹھائے۔ "},
	{5, "5  وہ جو اپنا روپیہ سُود پر نہیں دیتا اور بے گناہ کے خلاف رشوت نہیں لیتا۔ ایسے کام کرنے والے کبھی جنبش نہ کھائے گا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct ur16 poems[] = {
	{1, "1  اَے خُدا! میری حفاظت کر کیونکہ میں تجھ ہی میں پناہ لیتا ہوں۔ "},
	{2, "2  میں نے خُداوند سے کہا ہے تُو ہی رب ہے۔ تیرے سوا میری بھلائی نہیں۔ "},
	{3, "3  زمین کے مقدس لوگ وہ برگزیدہ ہیں جن میں میری پوری خوشنودی ہے۔ "},
	{4, "4  غیر معبودوں کے پیچھے دوڑنے والوں کا غم بڑھ جائیگا۔ میں اُنکے سے خُون والے تپاون نہیں تپاؤنگا۔ "},
	{5, "5  خُداوند ہی میری میراث اور میرے پیالے کا حصہ ہے۔ تُو میرے بخرے کا محافظ ہے۔ "},
	{6, "6  جریب میرے لئے دِلپسند جگہوں میں پڑی بلکہ میری میراث خوب ہے! "},
	{7, "7  میں خُداوند کی حمد کرونگا جس میں مجھے نصیحت دی ہے۔ بلکہ میرا دِل رات کو میری تربیت کرتا ہے۔ "},
	{8, "8  میں نے خُداوند کو ہمیشہ اپنے سامنے رکھا ہے۔ چونکہ وہ میرے دہنے ہاتھ ہے اِس لئے مجھے جنبش نہ ہوگی۔ "},
	{9, "9  اِسی سبب سے میرا دِل خُوش اور میری رُوح شادمان ہے۔ میرا جسم بھی امن وامان میں رہےگا۔ "},
	{10, "10  کیونکہ تُو نہ میری جان کو پاتال میں رہنے دیگا نہ اپنے مُقدس کو سٹرنے دیگا۔ "},
	{11, "11  تُو مجھے زندگی کی راہ دِکھائیگا ۔ تیرے حضُور میں کامل شادمانی ہے۔ تیرے دہنے ہاتھ میں دائمی خُوشی ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct ur17 poems[] = {
	{1, "1  اَے خُداوند! حق کو سُن۔ میری فریاد پر تُوجہ کر۔ میری دُعا پر جو بے ریالبوں سے نکلتی ہے کان لگا ۔ "},
	{2, "2  میرا فیصلہ تیرے حضُور سے صادر ہو تیری آنکھیں راستی کو دیکھیں۔ "},
	{3, "3  تُو نے میرے دِل کو آزما لیا ہے۔ تُو نے رات کو میری نگرانی کی۔ تُو نے مجھے پرکھا اور کچھ کھوٹ نہ پایا۔ میں نے ٹھان لیا ہے کہ میرا مُنہ خطا نہ کرے۔ "},
	{4, "4  انسانی کاموں میں تیرے لبوں کے کلام کی مدد سے میں ظالموں کی راہوں سے باز رہاہوں۔ "},
	{5, "5  میرے قدم تیر راستوں پر قائم رہے ہیں۔ میرے پاؤں پھسلے نہیں۔ "},
	{6, "6  اَے خُدا! میں نے تجھ سے دُعا کی ہے کیونکہ تُو مجھے جواب دیگا۔ میری طرف کان جھُکا اور میری عرض سُن لے۔ "},
	{7, "7  تُو جو اپنے دہنے ہاتھ سے اپنے توکل کرنے والوں کو اُ نکے مخالفوں سے بچاتا ہے اپنی عجیب شفقت دِکھا! "},
	{8, "8  مجھے آنکھ کی پُتلی کی طرح محفوظ رکھ۔ مجھے اپنے پروں کے سایہ میں چھپا لے۔ "},
	{9, "9  اُن شریروں سے جو مجھ پر ظلم کرتے ہیں میرے جانی دُشمنوں سے جو مجھے گھیرے ہوئے ہیں۔ "},
	{10, "10  اُنہوں نے اپنے دِلوں کو سخت کیا ہے۔ وہ اپنے مُنہ سے بڑا بول بولتے ہیں۔ "},
	{11, "11  اُنہوں نے قدم قدم پر ہمکو گھیرا ہے۔ وہ تاک لگائے ہیں کہ ہمکو زمین پر پٹک دیں۔ "},
	{12, "12  وہ اُس ببر کی مانند ہے جو پھاڑنے پر حِریص ہو۔ وہ گویا جواب ببر ہے جو پوشیدہ جگہوں میں دبکا ہوا ہے۔ "},
	{13, "13  اُٹھ اَے خُداوند! اُس کا سامنا کر۔ اُسے پٹک دے۔ اپنی تلوار سے میری جان کو شریر سے بچالے۔ "},
	{14, "14  اپنے ہاتھ سے اَے خُداوند!مجھے لوگوں سے بچا۔ یعنی دُنیا کے لوگوں سے جنکا بخرہ اِسی زندگی میں ہے اور جنکا پیٹ تُو اپنے ذخیرہ سے بھرتا ہے۔ اُنکی اَولاد بھی حسبِ مُراد ہے۔ وہ اپنا باقی مال اپنے بچوں کے لئے چھوڑ جاتے ہیں۔ "},
	{15, "15  پر میں تو صداقت میں تیرا دیدار حاصل کُرونگا۔ میں جب جاگونگا تو تیری شباہت سے سیر ہونگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct ur18 poems[] = {
	{1, "1  اَے خُداوند! اَے میری قوت! میں تجھ سے محبت رکھتا ہوں۔ "},
	{2, "2  خُداوند میری چٹان اور میرا قلعہ اور میرا چھُڑانے والا ہے۔ میرا خُدا۔ میری چٹان جس پر میں بھروسا رکھونگا۔ میری سِپر اور میری نجات کا سینگ۔ میرا اُونچا بُرج۔ "},
	{3, "3  میں خُداوند کو جو ستائش کے لائق ہے پُکارُونگا۔ یوں میں اپنے دشمنوں سے بچایا جاؤنگا۔ "},
	{4, "4  موت کی رسیوں سے مجھے گھیر لیا بے دینی کے سیلابوں نے مجھے ڈریا۔ "},
	{5, "5  پاتال کی رسیاں میرے چُوگرد تھیں موت کے پھندے مجھ پر آپڑے تھے۔ "},
	{6, "6  اپنی مصیبت میں مَیں نے خُداوند کو پُکارا اور اپنے خُدا سے فریاد کی۔ اُس نے اپنی ہیکل میں سے میری آواز سُنی اور میری فریاد جو اُس کے حضُور تھی اُس کے کان میں پہنچی۔ "},
	{7, "7  تب زمین مل گئی اور کانپ اُٹھی۔ پہاڑوں کی بنیادوں نے جنبش کھائی اور ہل گئیں اِس لئے کہ وہ غضبناک ہوا۔ "},
	{8, "8  اُس کے نتھنوں سے دُھواں اُٹھا اور اُس کے مُنہ سے آگ نکلکر بھسم کرنے لگی۔ کوئلے اُس سے دہک اُٹھے۔ "},
	{9, "9  اُس نے آسمانوں کو بھی جھکا دِیا اور نیچے اُتر آیا اور اُس کے پاؤں تلے گہری تاریکی تھی۔ "},
	{10, "10  وہ کروبی پر سوار ہو کر اُڑا۔ بلکہ وہ تیزی سے ہوا کے باؤزوں پر اُڑا۔ "},
	{11, "11  اُس نے ظلمت یعنی ابر کی تاریکی اور آسمان کے دلدار بادلوں کو اپنے چُوگرد اپنے چھپنے کی جگہ اور اپنا شامیانہ بنایا۔ "},
	{12, "12  اُسکی حضُوری کی جھلک سے اُس کے دلدار بادل پھٹ گئے۔ اولے اور انگارے۔ "},
	{13, "13  اور خُداوند آسمان میں گرجا۔ حق تعالیٰ نے اپنی آواز سُنائی اولے اور انگارے۔ "},
	{14, "14  اُس نے اپنے تِیر چلا کر اُنکو پراگندہ کیا۔ بلکہ تابڑ توڑ بجلی سے اُن کو شکست دی۔ "},
	{15, "15  تب تیری ڈانٹ سے اَے خُداوند! تیرے نتھنوں کے دم کے جھوکے سے پانی تھاہ دِکھائی دینے لگی اور جہان کی بنیادیں نمودار ہوئیں۔ "},
	{16, "16  اُس نے اُوپر سے ہاتھ بڑھا کر مجھے تھام لیا اور مجھے بہت پانی میں سے کھینچ کر باہرنکالا۔ "},
	{17, "17  اُس نے میرے زور اور دُشمن اور میرے عداوت رکھنے والوں سے مجھے چھُڑا لیا کیونکہ وہ میرے لئے نہایت زبردست تھے۔ "},
	{18, "18  وہ میری مصیبت کے دِن مجھ پر آپڑےپر خُداوند میرا سہارا تھا۔ "},
	{19, "19  وہ مجھے کُشادہ جگہ میں نکال بھی لایا۔ اُس نے مجھے چھُڑایا۔ اِس لئے کہ وہ مجھے سے خُوش تھا۔ "},
	{20, "20  خُداوند نے میری راستی کے موافق مجھے جزا دی اور میرے ہاتھوں کی پاکیزگی کے مطابق مجھے بدلہ دِیا۔ "},
	{21, "21  کیونکہ میں خُداوند کی راہوں پر چلتا رہا۔ اور شرارت سے اپنے خُدا سے الگ نہ ہوا۔ "},
	{22, "22  کیونکہ اُس کے سب فیصلے میرے سامنے رہے اور میں اُس کے آئین سے برگشتہ نہ ہوا۔ "},
	{23, "23  میں اُ سکے حضُور کامل بھی رہا اور اپنے کو اپنی بدکاری سے باز رکھا۔ "},
	{24, "24  خُداوند نے مجھے میری راستی کے موافق اور میرے ہاتھوں کے پاکیزگی کے مطابق جو اُس کے سامنے تھی بدلہ دِیا۔ "},
	{25, "25  رحم دِل کے ساتھ تُو رحیم ہوگا۔ اور کامل آدمی کے ساتھ کامل۔ "},
	{26, "26  نیکو کار کے ساتھ نیک ہوگا۔ اور کجرو کے ساتھ ٹیڑھا۔ "},
	{27, "27  کیونکہ تُو مصیبت زدہ لوگوں کو بچائیگا لیکن مغروروں کی آنکھوں کی نیچا کریگا۔ "},
	{28, "28  اِس لئے کہ تُو میرے چراغ کو روشن کریگا۔ خُداوند میرا خُدا میرے اندھیرے کو اُجالا کردیگا۔ "},
	{29, "29  کیونکہ تیری بدولت میں فوج پر دھاوا کرتا ہوں اور اپنے خُدا کی بدولت دیوار پھاندجاتا ہوں۔ "},
	{30, "30  لیکن خُدا کی راہ کامل ہے۔ خُداوند کا کلام تایا ہوا۔ وہ اُن سب کی سِپر ہے جو اُس پر بھروسا رکھتے ہیں۔ "},
	{31, "31  کیونکہ خُداوند کے سِوا اور کون چٹان ہے؟ "},
	{32, "32  خُدا ہی مجھے قوت سے کمر بستہ کرتا ہے اور میری راہ کا مل کرتا ہے۔ "},
	{33, "33  وہی میرے پاؤں ہرنیوں کے سے بنا دیتا ہے اور مجھے میری اونچی جگہوں میں قائم کرتا ہے۔ "},
	{34, "34  وہ میرے ہاتھوں کو جنگ کرتا سکھاتا ہے یہاں تک کہ میرے بازو پیتل کی کمان کو جھکا دیتے ہیں۔ "},
	{35, "35  تُو نے مجھ کو اپنی نجات کی سِپر بخشی اور تیرے دہنے ہاتھ نے مجھے سنبھالا اور تیری نرمی نے مجھے بزرگ بنایا ہے۔ "},
	{36, "36  تُو نے میرے نیچے میری قدم کُشادہ کر دِئے۔ اور میرے پاؤں نہیں پھسلے۔ "},
	{37, "37  میں اپنے دُشمنوں کا پیچھا کرکے اُن کو جالونگا اور جب تک وہ فنا نہ ہو جائیں واپس نہیں آؤنگا۔ "},
	{38, "38  میں اُن کو ایسا چھیدونگا کہ وہ اُٹھ نہ سکینگے۔ وہ میرے پاؤں کے نیچے گر پڑینگے۔ "},
	{39, "39  کیونکہ تُو نے لڑائی کے لئے مجھے قوت سے کمربستہ کیا اور میرے مخالفوں کو میرے سامنے زیر کیا۔ "},
	{40, "40  تُو نے میرے دُشمنوں کی پشت میری طرف پھیر دی تاکہ میں اپنے عداوت رکھنے والوں کو کاٹ ڈالوں۔ "},
	{41, "41  اُنہوں نے دُہائی دی پر کوئی نہ تھا جو بچائے۔ خُداوند کو بھی پُکارا پر اُس نے اُن کو جواب نہ دِیا۔ "},
	{42, "42  تب میں نے اُن کو کوٹ کوٹ کر ہوا میں اُڑتی ہوئی گرد کی مانند کر دِیا۔ مَیں نے اُن کو گلی کوچوں کی کیچڑ کی طرح نکال پھینکا۔ "},
	{43, "43  تُو نے مجھے قوم کے جھگڑوں سے بھی چھُڑایا۔ تُو نے مجھے قوموں کا سردار بنایا ہے۔ جس قوم سے مَیں واقف بھی نہیں وہ میری مُطیع ہوگی۔ "},
	{44, "44  میرا نام سُنتے ہی وہ میری فرمانبرداری کرینگے۔ پردیسی میرے تابع ہو جائینگے۔ "},
	{45, "45  پردیسی مُرجھا جائینگے اور اپنے قلعوں سے تھرتھراتے ہوئے نکلینگے۔ "},
	{46, "46  خُداوند زندہ ہے۔ میری چٹان مُبارک ہو۔ اور میرا نجات دینے والا خُدا ممتاز ہو! "},
	{47, "47  وہی خُدا جو میرا نتقام لیتا ہے اور اُمتوں کو میرےسامنے زیر کرتا ہے۔ "},
	{48, "48  وہ مجھے میرے دُشمنوں سے چھُڑاتا ہے بلکہ تُو مجھے میرے مخالفوں پر سرفراز کرتا ہے تُو مجھے تُند خُو آدمی سے رہائی دیتا ہے۔ "},
	{49, "49  اِس لدیتا ہے۔ "},
	{50, "50  وہ اپنے بادشاہ کو بڑی نجات عنایت کرتا ہے اور اپنے ممسوح داؤد اور اُس کی نسل پر ہمیشہ شفقت کرتا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct ur19 poems[] = {
	{1, "1  آسمان خُدا کا جلال ظاہر کرتا ہے اور فضا اُس کی دستکاری دکھاتی ہے۔ "},
	{2, "2  دِن سے دِن بات کرتا ہے اور رات کو رات حکمت سکھاتی ہے۔ "},
	{3, "3  نہ بولنا ہے نہ کلام۔ نہ اُن کی آواز سنائی دیتی ہے۔ "},
	{4, "4  اُنکا سُر ساری زمین پر اور اُن کا کلام دُنیا کی اِنتہا تک پہنچا ہے ۔ اُس نے آفتاب کے لئے اُن میں خیمہ لگایا ہے "},
	{5, "5  جو دُلہے کی مانند اپنے خلوت خانہ سے نکلتا ہے اور پہلوان کی طرح اپنی دوڑ میں دوڑنے کو خوش ہے۔ "},
	{6, "6  وہ آسمان کی اِنتہا سے نکلتا ہے اور اُس کی گشت اُس کے کناروں تک ہوتی ہے اور اُس کی حرارت سے کوئی چیز بے بہر نہیں۔ "},
	{7, "7  خُداوند کی شریعت کامل ہے۔ وہ جان کو بحال کرتی ہے۔ خُداوند کی شہادت برحق ہے۔ نادان کو دانش بخشتی ہے۔ "},
	{8, "8  خُداوند کے قوانین راست ہیں۔ وہ دِل کو فرحت پہنچاتے ہیں۔ خُداوند کا حکم بے عیب ہے۔ وہ آنکھوں کو روشن کرتا ہے۔ "},
	{9, "9  خُداوند کا خُوف پاک ہے۔ وہ ابد تک قائم رہتا ہے۔ خُداوند کے احکام برحق اور بالکل راست ہیں۔ "},
	{10, "10  وہ سونے سے بلکہ بہت کُندن سے زیادہ پسندیدہ ہیں۔ وہ شہد سے بلکہ چھّتے کے ٹپکوں سے بھی شیرین ہیں۔ "},
	{11, "11  نیز اُن سے تیرے بندے کو آگاہی ملتی ہے۔ اُن کو ماننے کا اجر بڑا ہے۔ "},
	{12, "12  کون اپنی بھول چُوک کو جان سکتا ہے؟ تُو مجھے پوشیدہ عیبوں سے پاک کر۔ "},
	{13, "13  تُو اپنے بندے کو بے باکی کے گناہوں سے بھی باز رکھ۔ وہ مجھ پر غالب نہ آئیں تو مَیں کامل ہونگا۔ اور بڑے گناہ سے بچا رہونگا۔ "},
	{14, "14  میرے مُنہ کا کلام اور میرے دِل کا خیال تیرے حضُور مقبول ٹھہرے۔ اَے خُداوند! اَے میرے چٹان اور میرے فدیہ دینے والے! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct ur20 poems[] = {
	{1, "1  مصیبت کے دِن خُداوند تیری سُنے۔ یعقوب کے خُدا کا نام تجھے بلندی پر قا ئم کرم کرے! "},
	{2, "2  وہ مقدِس سے تیرے لئے کمک بھیجے اور صیُّون سے تجھے تقویت بخشے! "},
	{3, "3  وہ تیرے سب ہدیوں کو یاد رکھے اور تیرے سوختنی قربانی کو قبول کرے! (سِلاہ) "},
	{4, "4  وہ تیرے دِل کی آرزُو برلا ئے اور تیری سب مشورت پُوری کرے! "},
	{5, "5  ہم تیری نجات پر شادیانہ بجا ئینگے اور اپنے خُدا کے نام پر جھنڈے کھڑے کرینگے۔ خُداوند تیری تمام درخواستیں پُوری کرے! "},
	{6, "6  اب میں جان گیا کہ خُداوند اپنے ممسوح کو بچا لیتا ہے۔ وہ اپنے دہنے ہاتھ کی نجات بخش قوت سے اپنے مُقدس آسمان پر سے اُسے جواب دیگا۔ "},
	{7, "7  کسی کو رتھوں کا اور کسی کو گھوڑوں کا بھروسا ہے پر ہم تو خُداوند اپنے خُدا ہی کا نام لینگے۔ "},
	{8, "8  وہ تو جھکے اور گِر پڑے پر ہم اُٹھے اور سیدھے کھڑے ہیں۔ "},
	{9, "9  اَے خُداوند! بچالے۔ جس دِن ہم پُکاریں تو بادشاہ ہمیں جواب دے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct ur21 poems[] = {
	{1, "1  اَے خُداوند! تیری قوت سے بادشاہ خُوش ہوگا اور تیری نجات سے اُسے نہایت شادمانی ہوگی۔ "},
	{2, "2  تُو نے اُس کے دِل کی آرزُو پُوری کی ہے اور اُس کے مُنہ کی درخواست کو نامنظور نہیں کیا۔ (سِلاہ) "},
	{3, "3  کیونکہ تُو اُسے عمدہ برکتیں بخشنے میں پیش قدمی کرتا اور خالص سونے کا تاج اُس کے سر پر رکھتا ہے۔ "},
	{4, "4  اُس نے تجھ سے زندگی چاہی اور تُو نے بخشی۔ بلکہ عمر کی درازی ہمیشہ کے لئے۔ "},
	{5, "5  تیری نجات کے سبب سے اُس کی شوکت عظیم ہے۔ تُو اُسے حشمت وجلال سے آراستہ کرتا ہے۔ "},
	{6, "6  کیونکہ تُو ہمیشہ کے لئے اُسے برکتوں سے مالا مال کرتا ہے اور اپنے حضُور اُسے خُوش وخُرم رکھتا ہے۔ "},
	{7, "7  کیونکہ بادشاہ کا تُوکل خُداوند پر ہے اور حق تعالیٰ کی شفقت کی بدولت اُسے ہرگز جنبش نہ ہوگی۔ "},
	{8, "8  تیرا ہاتھ تیرے سب دُشمنوں کو ڈھونڈنِکالیگا۔ تیرادہنا ہاتھ تجھ سے کینہ رکھنے والوں کا پتہ لگالیگا۔ "},
	{9, "9  تُو اپنے قہر کے وقت اُن کو جلتے تنورکی مانند کردیگا۔ خُداوند اپنے غضب میں اُن کو نگل جائیگا اور آگ اُن کو کھا جائیگی۔ "},
	{10, "10  تُو اُن کے پھل کو زمین پر سے نابُود کردیگا اور اُن کی نسل کو بنی آدم میں سے۔ "},
	{11, "11  کیونکہ اُنہوں نے تجھ سے بدی کرنا چاہا۔ اُنہوں نے ایسا منصُوبہ باندھا جِسے وہ پُورا نہیں کرسکتے۔ کیونکہ تُو اُنکا مُنہ پھیردیگا۔ تُو اُنکے مُقابلہ میں اپنے چِلّے چڑھائیگا۔ "},
	{12, "12  اَے خُداوند! تُو اپنی ہی قوت میں سربلند ہو! اور ہم گا کر تیری قُدرت کی ستائش کرینگے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct ur22 poems[] = {
	{1, "1  اَے میرے خُدا! اَے خُدا! تُو نے مجھے کیوں چھوڑ دِیا؟ تُو میری مدد اور میرے نالہ وفریاد سے کیوں دُور رہتا ہے؟ "},
	{2, "2  اَے میرے خُدا! مَیں دِن کو پُکارتا ہوں پر تُو جواب نہیں دیتا اور رات کو بھی اور خاموش نہیں ہوتا۔ "},
	{3, "3  لیکن تُو قدوس ہے۔ تُو جو اسرائیل کی حمدوثنا پر تخت نشین ہے۔ "},
	{4, "4  ہمارے باپ دادا نے تجھ پر تُوکل کیا۔ اُنہوں نے تُوکل کیا اور تُو نے اُن کو چھُڑایا۔ "},
	{5, "5  اُنہوں نے تجھ سے فریاد کی اور رہائی پائی۔ اُنہوں نے تجھ پر تُوکل کیا اور شرمندہ نہ ہوئے۔ "},
	{6, "6  پر مَیں تو کیڑا ہوں۔ انسان نہیں۔ آدمیوں میں انگشت نُما ہوں اور لوگوں میں حقیر۔ "},
	{7, "7  وہ سب جو مجھے دیکھتے ہیں میرا مضحکہ اُڑاتے ہیں۔ وہ مُنہ چِڑاتے۔ وہ سر ہلا ہلا کرکہتے ہیں۔ "},
	{8, "8  اپنے کو خُداوند کے سپُرد کردے۔ وہی اُسے چھُڑائے ۔ جبکہ وہ اُس سے خُوش ہے تُو وہی اُسے چھُڑائے۔ "},
	{9, "9  پر تُو ہی مجھے پیٹ سے باہر لایا۔ جب مَیں شیر خوار ہی تھا تُو نے مجھے تُوکل کرنا سکھایا۔ "},
	{10, "10  مَیں پیدائش ہی سے تجھ پر چھوڑا گیا۔ میری ماں کے پیٹ ہی سے تُو میرا خُدا ہے۔ "},
	{11, "11  مجھ سے دُور نہ رہ کیونکہ مصیبت قریب ہے۔ اِس لئےکہ کوئی مددگار نہیں۔ "},
	{12, "12  بہت سے سانڈوں نے مجھے گھیر لیا ہے۔ بسن کے زور آور سانڈ مجھے گھیرے ہوئے ہیں۔ "},
	{13, "13  وہ پھاڑنے اور گرجنے والے ببر کی طرح مجھ پر اپنا مُنہ پسارے ہوئے ہیں۔ "},
	{14, "14  مَیں پانی کی طرح بہ گیا۔ میری سب ہڈیاں اُکھڑ گئیں میرا دِل موم کی مانند ہوگیا۔ وہ میرے سینہ میں پگھل گیا۔ "},
	{15, "15  میری قُوت ٹھیکرے کی مانند خُشک ہوگئی اور میری زبان میرے تالُو سے چپک گئی اور تُو نے مجھے موت کی خاک میں مِلادیا ۔ "},
	{16, "17  میں اپنی سب ہڈیاں گِن سکتا ہوں۔ وہ مجھے تاکتے اور گُھورتے ہیں۔ "},
	{17, "18  وہ میرے کپڑے آپس میں بانٹتے ہیں اور میری پوشاک پر قُرعہ ڈالتے ہیں۔ "},
	{18, "19  لیکن تُو اَے خُداوند! دُور نہ رہ۔ اَے میرے چارہ ساز! میری مدد کے لئے جلدی کر۔ "},
	{19, "20  میری جان کو تلوار سے بچا۔ میری جان کو کتُّے کے قابُو سے۔ "},
	{20, "21  مجھے ببر کے مُنہ سے بچا۔ بلکہ تُو نے سانڈوں کے سینگوں میں سے مجھے چھُڑایا ہے۔ "},
	{21, "22  مَیں اپنے بھائیوں سے تیرے نام کا اِظہار کُرونگا۔ جماعت میں تیری ستائش کُرونگا۔ "},
	{22, "23  اَے خُداوند سے ڈرنے والو! اُس کی ستائش کرو۔ اَے یعقوب کی اَولاد ! سب اُس کی تمجید کرو اور اَے اسرائیل کی نسل! سب اُس کا ڈر مانو۔ "},
	{23, "24  کیونکہ اُس نے نہ تو مصیبت زدہ کی مُصیبت کو حقیر جانا نہ اُس سے نفرت کی۔ نہ اُس سے اپنا مُنہ چھپایا۔ بلکہ جب اُس نے خُدا سے فریاد کی تو اُس نے سُن لی۔ "},
	{24, "25  بڑے مجمع میں میری ثنا خوانی کا باعث تُو ہی ہے۔ میں اُس سے ڈرنے والوں کے رُوبُرو اپنی نذریں ادا کُرونگا ۔ "},
	{25, "26  حلِیم کھائینگے اور سیر ہونگے۔ خُداوند کے طالب اُس کی ستائش کرینگے۔ تُمہارا دِل ابد تک زندہ رہے! "},
	{26, "27  ساری دُنیا خُداوند کو یاد کریگی اور اُس کی طرف رجوع لائیگی اور قوموں کے سب گھرانے تیرے حضُور سجدہ کرینگے۔ "},
	{27, "28  کیونکہ سلطنت خُداوند کی ہے۔ وہی قوموں پر حاکم ہے۔ "},
	{28, "29  دُنیا کے سب آسُودہ حال لوگ کھائینگے اور سجدہ کرینگے۔ وہ سب جو خاک میں مِل جاتے ہیں اُس کے حضُور جھکینگے ۔ بلکہ وہ بھی جو اپنی جان کو جیتا نہیں رکھ سکتا۔ "},
	{29, "30  ایک نسل اُس کی بندگی کریگی۔ دُوسری پُشت کو خُداوند کی خبر دی جائیگی۔ "},
	{30, "31  وہ آئینگے اور اُس کی صداقت کو ایک قوم پر جو پیدا ہوگی یہ کہکر ظاہر کرینگے کہ اُس نے یہ کام کِیا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view23() {
struct ur23 poems[] = {
	{1, "1  خُداوند میرا چوپان ہے۔ مجھے کمی نہ ہوگی۔ "},
	{2, "2  وہ مجھے ہری ہری چراگاہوں میں بِٹھاتا ہے۔ وہ مجھے راحت کے چشموں کے پاس لے جاتا ہے۔ "},
	{3, "3  وہ میری جان کو بحال کرتا ہے۔وہ مجھے اپنے نام کی خاطر صداقت کی راہوں پر لے چلتا ہے۔ "},
	{4, "4  بلکہ خواہ مُوت کے سایہ کی وادی میں سے میرا گُذر ہو میں کسی بلا سے نہیں ڈرونگا کیونکہ تُو میرے ساتھ ہے تیرے عصا اور تیری لاٹھی سے مجھے تسلی ہے۔ "},
	{5, "5  تُو میرے دُشمنوں کے رُوبُرو میرے آگے دستر خوان بچھاتا ہے۔ تُو نے میرے سر پر تیل ملا ہے۔ میرا پیالہ لبریز ہوتا ہے۔ "},
	{6, "6  یقیناً بھلائی اور رحمت عُمر بھر میرے ساتھ ساتھ رہینگی اور میں ہمیشہ خُداوند کے گھر میں سکونت کرونگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view24() {
struct ur24 poems[] = {
	{1, "1  زمین اور اُس کی معمُوری خُداوند ہی کی ہے۔جہاں اور اُس کے باشندے بھی۔ "},
	{2, "2  کیونکہ اُس نے سمُندروں پر اُس کی بُنیاد رکھی اور سَیلابوں پر اُسے قائم کیا۔ "},
	{3, "3  خُداوند کے پہاڑ پر کون چڑھیگا اور اُس کے مقدس مقام پر کون کھڑا ہوگا؟ "},
	{4, "4  وہی جس کے ہاتھ صاف ہیں اور جسکا دِل پاک ہے۔ جس نے بطالت پر دِل نہیں لگایا اور مکر سے قسم نہیں کھائی۔ "},
	{5, "5  ہاں اپنے نجات دینے والے خُدا کی طرف سے صداقت۔ "},
	{6, "6  یہی اُس کی طالبوں کی پُشت ہے۔ یہی تیرے دیدار کے خواہاں ہیں۔یعنی یعقوب۔ (سِلاہ) "},
	{7, "7  اَے پھاٹکو! اپنے سر بلند کرو۔ اَے ابدی دروازو! اُونچے ہو جاؤ اور جلال کا بادشاہ داخل ہوگا۔ "},
	{8, "8  یہ جلال کا بادشادہ کون ہے؟ خُداوند جو قوی اور قادر ہے۔ خُداوند جو جنگ میں زورآور ہے۔ "},
	{9, "9  اَے پھاٹکو! اپنے سربلند کرو۔ اَے ابدی دروازو! اُ ن کو بلند کرو اور جلال کا بادشاہ داخل ہوگا۔ "},
	{10, "10  یہ جلال کا بادشاہ کون ہے؟ لشکروں کاخُداوند۔ وہی جلال کا بادشاہ ہے۔ (سِلاہ) "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view25() {
struct ur25 poems[] = {
	{1, "1  اَے خُداوند! مَیں اپنی جان تیری طرف اُٹھاتا ہوں۔ "},
	{2, "2  اَے میرے خُدا! میں نے تجھ پر تُوکل کیا۔ مجھے شرمندہ ہونے دے۔ میرے دُشمن مجھ پر شادیانہ نہ بجائیں۔ "},
	{3, "3  بلکہ جو تیرے منتظر ہیں اُن میں سے کوئی شرمندہ نہ ہوگا۔ پر جو ناحق بے وفائی کرتے ہیں وہی شرمندہ ہونگے۔ "},
	{4, "4  اَے خُداوند! اپنی راہیں مجھے دِکھا اپنے راستے مجھے بتادے۔ "},
	{5, "5  مجھے اپنی سچائی پر چلا اور تعلیم دے۔ کیونکہ تُو میرا نجات دینے والا خُدا ہے۔ مَیں دِن بھر تیرا ہی منتظر رہتا ہوں۔ "},
	{6, "6  اَے خُداوند اپنی رحمتوں اور شفقتوں کو یاد فرما کیونکہ وہ ازل سے ہیں۔ "},
	{7, "7  میری جوانی کی خطاؤں اور میرے گناہوں کو یاد نہ کر۔ اَے خُداوند! اپنی نیکی کی خاطر اپنی شفقت کے مُطابق مجھے یاد فرما۔ "},
	{8, "8  خُداوند نیک اور راست ہے۔ اِ س لئے وہ گنہگاروں کو راہ ِ حق کی تعلیم دیگا۔ "},
	{9, "9  وہ حلیموں کو اپنی راہ بتائیگا۔ "},
	{10, "10  جو خُداوند کے عہد اور اُس کی شہادتوں کو مانتے ہیں۔ اُن کے لئے اُس کی سب راہیں شفقت اور سچائی ہیں۔ "},
	{11, "11  اَے خُداوند! اپنے نام کی خاطر میری بدکاری مُعاف کردے کیونکہ وہ بڑی ہے۔ "},
	{12, "12  وہ کون ہے جو خُداوند سے ڈرتا ہے؟ خُداوند اُس کو اُسی راہ کی تعلیم دیگا جو اُسے پسند ہے۔ "},
	{13, "13  اُس کی جان راحت میں رہےگی۔ اور اُس کی نسل زمین کی وارث ہوگی۔ "},
	{14, "14  خُداوند کے راز کو وہی جانتے ہیں جو اُس سے ڈرتے ہیں اور وہ اپنا عہد اُن کو بتائیگا۔ "},
	{15, "15  میری آنکھیں ہمیشہ خُداوند کی طرف لگی رہتی ہیں کیونکہ وہی میرا پاؤں دام سے چھُڑائیگا۔ "},
	{16, "16  میری طرف مُتوجہ ہو اور مجھ پر رحم کر کیونکہ مَیں بیکس اور مُصیبت زدہ ہوں۔ "},
	{17, "17  میرے دِل کے دُکھ بڑھ گئے۔ تُو مجھے میری تکلیفوں سے رہائی دے۔ "},
	{18, "18  تُو میری مُصیبت اور جانفشانی کو دیکھ اور میرے سب گُناہ مُعاف فرما۔ "},
	{19, "19  میرے دُشمنوں کو دیکھ کیونکہ وہ بہت ہیں اور اُن کو مجھ سے سخت عداوت ہے۔ "},
	{20, "20  میری جان کی حفاظت کر اور مجھے چھُڑا۔ مجھے شرمندہ نہ ہونے دے کیونکہ میرا تُوکل تجھ ہی پر ہے۔ "},
	{21, "21  دیانت داری اور راستبازی مجھے سلامت رکھیں۔ کیونکہ مجھے تیری ہی آس ہے۔ "},
	{22, "22  اَے خُدا! اسرائیل کو اُس کے سب دُکھوں سے چھُڑالے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view26() {
struct ur26 poems[] = {
	{1, "1  اَے خُداوند میرا انصاف کر کیونکہ مَیں راستی سے چلتا رہاہوں۔ اور مَیں نے خُداوند پر بے لغزش تُوکل کِیا ہے۔ "},
	{2, "2  اور خُداوند! مجھے جانچ اور آزما۔ میرے دِل ودماغ کو پرکھ۔ "},
	{3, "3  کیونکہ تیری شفقت میری آنکھوں کے سامنے ہے اور مَیں تیری سچائی کی راہ پر چلتا رہا ہوں۔ "},
	{4, "4  میں بیہودہ لوگوں کے ساتھ نہیں بیٹھا۔ مَیں ریاکاروں کے ساتھ کہیں نہیں جاؤنگا۔ "},
	{5, "5  بدکرداروں کی جماعت سے مجھے نفرت ہے۔ مَیں شریروں کے ساتھ نہیں بیٹھونگا۔ "},
	{6, "6  مَیں بے گُناہی میں اپنے ہاتھ دھوؤنگا اور اَے خُداوند! مَیں تیرے مذبح کا طواف کرُونگا۔ "},
	{7, "7  تاکہ شکرگذاری کی آواز بلند کرُوں۔ اَے خُداوند! میں تیری سکونت گاہ اور تیرے جلال کے خیمہ کو عزیز رکھتا ہوں۔ "},
	{8, "9  میری جان کو گنہگاروں کے ساتھ اور میری زندگی کو خُونی آدمیوں کے ساتھ نہ ملا۔ "},
	{9, "10  جن کے ساتھوں میں شرارت ہے اور جن کا دہنا ہاتھ رشوتوں سے بھرا ہے۔ "},
	{10, "11  پر میں تو راستی سے چلتا رہونگا۔ مجھے چھُڑالے اور مجھ پر رحم کر۔ "},
	{11, "12  میرا پاؤں ہموار جگہ پر قائم ہے۔ میں جماعتوں میں خُداوند کو مُبارک کہونگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view27() {
struct ur27 poems[] = {
	{1, "1  خُداوند میری روشنی اور میری نجات ہے۔ مجھے کس کی دہشت؟ خُداوند میری زندگی کا پُشتہ ہے۔ مجھے کس کی ہیبت؟ "},
	{2, "2  جب شریر یعنی میرے مخالف اور میرے دُشمن میراگوشت کھانے کو مجھ پر چڑھ آئے تو وہ ٹھوکر کھا کر گِر پڑے۔ "},
	{3, "3  خواہ میرے خلاف لشکر خیمہ زن ہو میرا دِل نہیں ڈریگا۔ خواہ میرے مُقابلہ میں جنگ برپا ہو تَو بھی مَیں خاطر جمع رہونگا۔ "},
	{4, "4  مَیں نے خُداوند سے ایک درخواست کی ہے۔ مَیں اِسی کا طالب رہونگا کہ مَیں عُمر بھر خُداوند کے گھر میں رہوں تاکہ خُداوند کے جمال کو دیکھُوں اور اُس کی ہیکل میں اِستفسار کیا کرُوں۔ "},
	{5, "5  کیونکہ مُصیبت کے دِن وہ مجھے اپنے شامیانہ میں پوشیدہ رکھےگا وہ مجھے اپنے خیمہ کے پردہ میں چھپالیگا۔ وہ مجھے چٹان پر چڑھادیگا۔ "},
	{6, "6  اب مَیں اپنے چاروں طرف کے دُشمنوں پر سرفراز کیا جاؤنگا۔ مَیں اُس کے خیمہ میں خُوشی کی قربانیاں گذرانونگا۔ میں گاؤنگا۔ مَیں خُداوند کی مدح سرائی کرُونگا۔ "},
	{7, "7  اَے خُداوند! میری آواز سُن۔ مَیں پُکارتا ہوں۔ مجھ پر رحم کر اور مجھے جواب دے۔ "},
	{8, "8  جب تُو نے فرمایا کہ میرے دیدار کے طالب ہو تو میرے دِل نے تجھ سے کہا۔ اَے خُداوند مَیں تیرے دیدار کا طالب رہونگا۔ "},
	{9, "9  مجھ سے رُو پوش نہ ہو۔ اپنے بندہ کو قہر سے نہ نکال۔ تُو میرا مددگار رہا ہے۔ نہ مجھے ترک کر نہ مجھے چھوڑا اَے میرے نجات دینے والے خُدا! "},
	{10, "10  جب میرا باپ اور میری ماں مجھے چھوڑدیں۔تو خُداوند مجھے سنبھال لیگا۔ "},
	{11, "11  اَے خُداوند مجھے اپنی راہ بتا اور میرے دُشمنوں کے سبب سے مجھے ہموار راستہ پر چلا۔ "},
	{12, "12  مجھے میرے مخالفوں کی مرضی پر نہ چھوڑ کیونکہ جھُوٹے گواہ اور بے رحمی سے پھُنکارنے والے میرے خلاف اُٹھے ہیں۔ "},
	{13, "13  اگر مُجھے یقین نہ ہوتاکہ زندوں کی زمین میں خُداوند کے احسان کو دیکھونگا تو مجھے غش آجاتا۔ "},
	{14, "14  خُداوند کی آس رکھ۔ مضُبوط ہو اور تیرا دِل قوی ہو۔ ہاں خُداوند ہی کی آس رکھ۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view28() {
struct ur28 poems[] = {
	{1, "1  اَے خُداوند! مَیں تجھ ہی کو پُکارونگا۔ اَے میری چٹان! تُو میری طرف سے کان بندنہ کر۔ ایسا نہ ہو کہ اگر تُو میری طرف سے خاموش رہے تو مَیں اُن کی مانند بن جاؤں جو پاتال میں جاتے ہیں۔ "},
	{2, "2  جب مَیں تجھ سے فریاد کروں اور اپنے ہاتھ تیری مُقدس ہیکل کی طرف اُٹھاؤں تو میری مِنت کی آواز کو سُن لے۔ "},
	{3, "3  مجھے اُن شریروں اور بدکرداروں کے ساتھ گھسیٹ نہ لیجا جو اپنے ہمسایوں سے صُلح کی باتیں کرتے ہیں مگر اُن کے دِلوں میں بدی ہے۔ "},
	{4, "4  اُن کے افعال واعمال کی بُرائی کے مُوافق اُن کو بدلہ دے۔ اُن کے ہاتھوں کے کاموں کے مُطابق اُن سے سلُوک کر۔ اُ ن کے کِئے کا عوض اُن کو دے۔ "},
	{5, "5  وہ خُداوند کے کاموں اور اُس کی دستکاری پر دھیان نہیں کرتے۔ اِس لئے وہ اُن کو گِرا دیگااور پھر نہیں اُٹھائیگا۔ "},
	{6, "6  خُداوند مُبارک ہو۔ اِس لئے کہ اُس نے میری مِنت کی آواز سُن لی۔ "},
	{7, "7  خُداوند میری قوت اور میری سِپر ہے۔ میرے دِل نے اُس پر تُوکل کیا ہے اور مجھے مدد ملی ہے۔ اِسی لئے میرا دِل نہایت شادمان ہے اور میں گیت گا کر اُس کی ستائش کرونگا۔ "},
	{8, "8  خُداوند اُن کی قوت ہے۔ وہ اپنے ممسوح کے لئے نجات کا قلعہ ہے۔ "},
	{9, "9  اپنی اُمت کو بچا اور اپنی میراث کو برکت دے۔ اُن کی پاسبانی کر اور اُن کو ہمیشہ تک سنبھالے رہ۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view29() {
struct ur29 poems[] = {
	{1, "1  اَے فرشتگان خُداوند کی۔ خُداوند ہی کی تمجیدوتعظیم کرو۔ "},
	{2, "2  خُداوند کی ایسی تمجید کرو جو اُس کے نام کے شایاں ہے۔ پاک آرایش کے ساتھ خُداوند کو سجدہ کرو۔ "},
	{3, "3  خُداوند کی آواز بادلوں پر ہے۔ خُدایِ ذوالجلال گرجتا ہے۔ خُداوند دلدار بادلوں پر ہے۔ "},
	{4, "4  خُداوند کی آواز میں قدرت ہے۔ خُداوند کی آواز میں جلال ہے۔ "},
	{5, "5  خُداوند کی آواز دیوداروں کو توڑ ڈالتی ہے۔ بلکہ خُداوند لُبنان کے دیوداروں کو ٹکڑے ٹکڑے کر دیتا ہے۔ "},
	{6, "6  وہ اُن کو بچھڑے کی مانند۔ لُبنان اور سریُون کو جنگلی بچھڑے کی مانند کُداتا ہے۔ "},
	{7, "7  خُداوند کی آواز آگ کے شعلوں کو چیرتی ہے۔ "},
	{8, "8  خُداوند کی آواز بیابان کو ہلا دیتی ہے۔ خُداوند قادِس کے بیابان کو ہلا ڈالتا ہے۔ "},
	{9, "9  خُداوند کی آواز سے ہرنیوں کے حمل گِر جاتے ہیں۔ اور وہ جنگلوں کے بے برگ کر دیتی ہے۔ اُس کی ہیکل میں ہر ایک جلال ہی جلال پُکارتا ہے۔ "},
	{10, "10  خُداوند طوفان کے وقت تخت نشین تھا۔ بلکہ خُداوند ہمیشہ تک تخت نشین ہے۔ "},
	{11, "11  خُداوند اپنی اُمت کو زور بخشیگا۔ خُداوند اپنی اُمت کو سلامتی کی برکت دیگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view30() {
struct ur30 poems[] = {
	{1, "1  اَے خُداوند! مَیں تیری تمجید کرونگا کیونکہ تُو نے مجھے سرفراز کیا ہے۔ اور میرے دُشمنوں کو مجھ پر خُوش ہونے نہ دِیا۔ "},
	{2, "2  اَے خُداوند میرے خُدا! مَیں نے تجھ سے فریاد کی اور تُو نے مجھے شفا بخشی۔ "},
	{3, "3  اَے خُداوند! تُو میری جان کو پاتال سے نکال لایا ہے۔ تُو نے مجھے زندہ رکھا ہے کہ گور میں نہ جاؤں۔ "},
	{4, "4  خُدا کی ستائش کرو اَے اُس کے مُقدسو! اور اُس کے قُدس کو یاد کرکے شُکر گذاری کرو۔ "},
	{5, "5  کیونکہ اُس کا قہر دم بھر کا ہے۔ اُس کا کرم عُمر بھر کا۔ رات کو شاید رونا پڑے پر صُبح کو خُوشی کی نوبت آتی ہے۔ "},
	{6, "6  مَیں نے اپنی اقبال مندی کے وقت یہ کہا تھا کہ مجھے کبھی جنبش نہ ہوگی۔ "},
	{7, "7  اَے خُداوند! تُو نے اپنے کرم سے میرے پہاڑ کو قائم رکھا تھا۔ جب تُو نے اپنا چہرہ چھپایا تو مَیں گھبرا اُٹھا۔ "},
	{8, "8  اَے خُداوند! مَیں نے تجھ سے فریاد کی۔ مَیں نے خُداوند سے مَنت کی۔ "},
	{9, "9  جب مَیں گور میں جاؤں تو میری مَوت سے کیا فائدہ؟ کیا خاک تیری ستائش کریگی؟ کیا وہ تیری سچائی کو بیان کریگی؟ "},
	{10, "10  سُن لے اَے خُداوند! اور مجھ پر رحم کر۔ اَے خُداوند! تُو میرا مدد گار ہو۔ "},
	{11, "11  تُو نے میرے ماتم کو ناچ سے بدل دیا۔ تُو نے میرا ٹاٹ اُتار ڈالا اور مجھے خُوشی سے کمربستہ کیا۔ "},
	{12, "12  تاکہ میری رُوح تیری مدح سرائی کرے اور چُپ نہ رہے۔اَے خُداوند میرے خُدا! مَیں ہمیشہ تیرا شکر کرتا رہونگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view31() {
struct ur31 poems[] = {
	{1, "1  اَے خُداوند! میرا تُوکل تجھ پر ہے۔ مجھے کبھی شرمندہ نہ ہونے دے۔ اپنی صداقت کی خاطر مجھے رہائی دے۔ "},
	{2, "2  اپنا کان میری طرف جھکا۔ جلد مجھے چھُڑا۔ تُو میرے لئے مضُبوط چٹان میرے بچانے کو پناہ گاہ ہو۔ "},
	{3, "3  کیونکہ تُو ہی میری چٹان اور میرا قلعہ ہے۔ اِس لئے اپنے نام کی خاطر میری رہبری اور رُہنمائی کر۔ "},
	{4, "4  مجھے اُس جال سے نکال لے جو اُنہوں نے چھپکر میرے لئے بچھایا ہے۔ کیونکہ تُو ہی میرا محکم قلعہ ہے۔ "},
	{5, "5  مَیں اپنی رُوح تیرے ہاتھ میں سَونپتا ہوں۔ اَے خُداوند! سچائی کے خُدا! تُو نے میرا فدیہ دیا ہے۔ "},
	{6, "6  مجھے اُن سے نفرت ہے جو جھُوٹے معبودوں کو مانتے ہیں۔ میرا تُوکل تو خُداوند ہی پر ہے۔ "},
	{7, "7  میں تیری رحمت سے خُوش وخُرم رہونگا کیونکہ تُو نے میرا دُکھ دیکھ لیا ہے۔ تُو میری جان کی مُصیبتوں سے واقف ہے۔ "},
	{8, "8  تُو نے مجھے دُشمن کے ہاتھ میں اسِیر نہیں چھوڑا۔ تُو نے میرے پاؤں کُشادہ جگہ میں رکھے ہیں۔ "},
	{9, "9  اَے خُداوند! مجھ پر رحم کر کیونکہ مَیں مُصیبت میں ہوں۔ میری آنکھ بلکہ میری جان اور میرا جسم سب رنج کے مارے گھُلے جاتے ہیں۔ "},
	{10, "10  کیونکہ میری جان غم میں اور میری عُمر کراہنے میں فنا ہوئی ۔ میرا زور میری بدکاری کے باعث سے جاتا رہا اور میری ہڈیاں گھُل گئیں۔ "},
	{11, "11  مَیں اپنے سب مخالفوں کے سبب سے اپنے ہمسایوں کے لئے ازبس انگُشت نُما اور اپنے جان پہچانوں کے لئے خَوف کا باعث ہوں۔ جنہوں نے مجھ کو باہر دیکھا مجھ سے دُور بھاگے۔ "},
	{12, "12  مَیں مردہ کی مانند دِل سے بھُلا دِیا گیا ہوں۔ مَیں ٹوٹے برتن کی مانند ہوں۔ "},
	{13, "13  کیونکہ مَیں نے بہتوں سے اپنی بدنامی سُنی ہے۔ ہر طرف خَوف ہی خَوف ہے۔ جب اُنہوں نے مل کر میری خلاف مشورہ کیا۔ تو میری جان لینے کا منُصوبہ باندھا۔ "},
	{14, "14  لیکن اَے خُداوند! میرا تُوکل تجھ پر ہے۔ مَیں نے کہا تُو میرا خُدا ہے۔ "},
	{15, "15  میرے ایّام تیرےہاتھ میں ہیں۔ مجھے میرے دُشمنوں اور ستانے والوں کے ہاتھ چھُڑا۔ "},
	{16, "16  اپنے چہرے کو اپنے بندہ پر جلوہ گر فرما۔ اپنی شفقت سے مجھے بچالے۔ "},
	{17, "17  اَے خُداوند! مجھے شرمندہ نہ ہونے دے کیونکہ مَیں نے تجھ سے دُعا کی ہے۔ شریر شرمندہ ہو جائیں اور پاتال میں خاموش ہوں۔ "},
	{18, "18  جھُوٹے ہونٹ بند ہو جائیں جو صادقوں کے خلاف غُرور اور حقارت سے تکبُر کی باتیں بولتے ہیں۔ "},
	{19, "19  آہ! تُو نے اپنے ڈرنے والوں کے لئے کیسی بڑی نعمت رکھ چھوڑی ہے۔ جسے تُو نے بنی آدم کے سامنے اپنے تُوکل کرنے والوں کے لئے تیار کیا۔ "},
	{20, "20  تُو اُن کو اِنسان کی بندشوں سے اپنی حضُوری کےپردہ میں چھپالیگا۔ تُو اُن کو زبان کے جھگڑوں سے شامیانہ میں پوشیدہ رکھیگا۔ "},
	{21, "21  خُداوند مُبارک ہو۔ کیونکہ اُس نے مجھ کو مُحکم شہر میں اپنی عجیب شفقت دکھائی۔ "},
	{22, "22  مَیں نے تو جلد بازی سے کہا تھا کہ مَیں تیرے سامنے سے کاٹ ڈالا گیا۔ تُو بھی جب مَیں نے تجھ سے فریاد کی تو تُونے میری مِنت کی آواز سُن لی۔ "},
	{23, "23  خُداوند سے محبت رکھو اَے اُس کے سب مقدسو! خُداوند ایمانداروں کو سلامت رکھتا ہے۔ اور مغروروں کو خُوب ہی بدلہ دیتا ہے۔ "},
	{24, "24  اَے خُداوند پر آس رکھنے والو! سب مضُبوط ہو اور تُمہارا دِل قوی رہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view32() {
struct ur32 poems[] = {
	{1, "1  مُبارک ہے وہ جس کی خطا بخشی گئی اور جسکا گُناہ ڈھانکاگیا۔ "},
	{2, "2  مُبارک ہے وہ آدمی جس کی بدکاری کو خُداوند حساب میں نہیں لاتا۔ اور جس کے دِل میں مکر نہیں۔ "},
	{3, "3  جب مَیں خاموش رہا تو دِن بھر کے کراہنے سے میری ہڈیاں گھُل گئیں۔ "},
	{4, "4  کیونکہ تیرا ہاتھ رات دِن مجھ پر بھاری تھا میری تراوت گرمیوں کی خشکی سے بدل گئی۔ (سِلاہ) "},
	{5, "5  مَیں نے تیرے حضُور اپنے گُناہ کو مان لیا اور اپنی بدکاری کو نہ چھپایا۔ مَیں نے کہا میں خُداوند کے حضُور اپنی خطاؤں کا اِقرار کرونگا اور تُو نے میرے گُناہ کی بدی کو مُعاف کیا۔ (سِلاہ) "},
	{6, "6  اِسی لئے ہر دیندار تجھ سے ایسے وقت میں دُعا کرے جب تُومل سکتا ہے۔ یقیناً جب سَیلاب آئے تو اُس تک نہیں پہنچیگا۔ "},
	{7, "7  تُو میرے چھپنے کی جگہ ہے۔ تُو مجھے دُکھ سے بچائے رکھیگا۔ تُو مجھے رہائی کے نغموں سے گھیرلیگا۔ (سِلاہ) "},
	{8, "8  مَیں تجھے تعلیم دُونگا اور جس راہ پر تجھے چلنا ہوگا تجھے بتاؤنگا۔ مَیں تجھے صلاح دُونگا۔ میری نظر تجھ پر ہوگی۔ "},
	{9, "9  تُم گھوڑے یا خچّر کی مانند نہ بنو جن میں سمجھ نہیں۔ جن کو قابُو میں رکھنے کا ساز دہانہ اور لگام ہے ورنہ وہ تیرے پاس آنے کے بھی نہیں۔ "},
	{10, "10  شریر پر بہت سی مُصیبتیں آئینگی پر جس کا تُوکل خُداوند پر ہے رحمت اُسے گھیرے رہیگی۔ "},
	{11, "11  اَے صادقو! خُداوند میں خُوش وخُرم رہو اور اَے راست دِلو! خُوشی سے للکارو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view33() {
struct ur33 poems[] = {
	{1, "1  اَے صادقو! خُداوند میں شادمان رہو۔ حمد کرنا راست بازوں کو زیبا ہے۔ "},
	{2, "2  سِتارکے ساتھ خُداوند کا شُکر کرو۔ دس تار کی بربط کے ساتھ اُس کی ستایش کرو۔ "},
	{3, "3  اُس کے لئے نیا گیت گاؤ۔ بلند آواز کے ساتھ اچھی طرح بجاؤ ۔ "},
	{4, "4  کیونکہ خُداوند کا کلام راست ہے اور اُس کے سب کام باوفا ہیں۔ "},
	{5, "5  وہ صداقت اور اِنصاف کو پسند کرتا ہے۔ زمین خُداوند کی شفقت سے معمور ہے۔ "},
	{6, "6  آسمان خُداوند کے کلام سے اور اُس کا سارا لشکر اُس کے مُنہ کے دم سے بنا۔ "},
	{7, "7  وہ سُمندر کا پانی تُو دے کی مانند جمع کرتا ہے۔ وہ گہرے سُمندروں کو مخزنوں میں رکھتا ہے۔ "},
	{8, "8  ساری زمین خُداوند سے ڈرے۔ جہان کے سب باشندے اُس کا خَوف رکھیں۔ "},
	{9, "9  کیونکہ اُس نے حُکم دِیا اور واقع ہوا۔ "},
	{10, "10  خُداوند قوموں کی مشورت کوباطل کر دیتا ہے۔ وہ اُمتوں کے منصُوبوںہ کو ناچیز بنا دیتا ہے۔ "},
	{11, "11  خُداوند کی مصلحت ابد تک قائم رہیگی۔ اور اُس کے دِل کے خیال نسل در نسل۔ "},
	{12, "12  مُبارک ہے وہ قوم جس کا خُداخُداوند ہے اور وہ اُمت جس کو اُس نے اپنی ہی میراث کے لئے برگزیدہ کیا۔ "},
	{13, "13  خُداوند آسمان پر سے دیکھتا ہے۔ سب بنی آدم پر اُس کی نگاہ ہے۔ "},
	{14, "14  اپنی سکونت گاہ سے وہ زمین کے سب باشندوں کو دیکھتا ہے۔ "},
	{15, "15  وہی ہے جو اُن سب کے دلوں کو بناتا اور اُن کے سب کاموں کا خیال رکھتا ہے۔ "},
	{16, "16  کسی بادشاہ کو فوج کی کثرت نہ بچائیگی اور کسی زبردست آدمی کو اُس کی بڑی طاقت رہائی نہ دیگی۔ "},
	{17, "17  بچ نکلنے کے لئے گھوڑا بیکار ہے۔ وہ اپنی شہزوری سے کسی کو نہ بچائیگا۔ "},
	{18, "18  ویکھو! خُداوند کی نگاہ اُن پر ہے جو اُس سے ڈرتے ہیں۔ جو اُس کی شفقت کے اُمیدوار ہیں۔ "},
	{19, "19  تاکہ اُن کی جان مَوت سے بچائے اور قحط میں اُن کو جیتا رکھے۔ "},
	{20, "20  ہماری جان کو خُداوند کی آس ہے۔ وہی ہماری کمک اور ہماری سِپر ہے۔ "},
	{21, "21  ہمارا دِل اُس میں شادمان رہیگاکیونکہ ہم نے اُس کے پاک نام پر تُوکل کیا ہے۔ "},
	{22, "22  اَے خُداوند! جیسی تجھ پر ہماری آس ہے۔ ویسی ہی تیری رحمت ہم پر ہو! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view34() {
struct ur34 poems[] = {
	{1, "1  مَیں ہر وقت خُداوند کو مُبارک کہونگا۔ اُس کی ستایش ہمیشہ میری زبان پر رہیگی۔ "},
	{2, "2  میری رُوح خُداوند پر فخر کریگی۔ حلیم یہ سُن کر خُوش ہونگے۔ "},
	{3, "3  میرے ساتھ خُداوند کی بڑائی کرو۔ ہم مل کر اُس کے نام کی تمجید کریں۔ "},
	{4, "4  مَیں خُداوند کا طالب ہوا۔ اُس نے مجھے جواب دِیا اور میری ساری دہشت سے مجھے رہائی بخشی۔ "},
	{5, "5  اُنہوں نے اُس کی طرف نظر کی اور مُنور ہوگئےاور اُن کے مُنہ پر کبھی شرمندگی نہ آئیگی۔ "},
	{6, "6  اِس غریب نے دُہائی دی۔ خُداوند نے اِس کی سُنی اور اِسے اِس کے سب دُکھوں سے بچالیا۔ "},
	{7, "7  خُداوند سے ڈرنے والوں کی چاروں طرف اُس کا فرشتہ خیمہ زن ہوتا ہے۔ اور اُن کو بچاتا ہے۔ "},
	{8, "8  آزما کر دیکھو کہ خُداوند کیسا مہربان ہے۔ مُبارک ہے وہ آدمی جو اُس پر توکّل کرتا ہے۔ "},
	{9, "9  خُداوند سے ڈرو اَے اُس کے مقدسو! کیونکہ جو اُس سے ڈرتے ہیں اُن کو کچھ کمی نہیں۔ "},
	{10, "10  شیرببر کے بچے تو حاجتمند اور بھُوکے ہوتے ہیں پر خُداوند کے طالب کسی نعمت کے محتاج نہ ہونگے۔ "},
	{11, "11  اَے بچو! آؤ میری سُنو۔ میں تم کو خُدا ترسی سکھاؤنگا۔ "},
	{12, "12  وہ کون آدمی ہے جو زندگی کا مُشتاق ہے اور بڑی عمر چاہتا ہے تاکہ بھلائی دیکھے؟ "},
	{13, "13  اپنی زبان کو بدی سے باز رکھ اور اپنے ہونٹوں کی دغا کی بات سے۔ "},
	{14, "14  بدی کو چھوڑ اور نیکی کر۔ صُلح کا طالب ہو اور اُسی کی پیروی کر۔ "},
	{15, "15  خُداوند کی نگاہ صادقوں پر ہے اور اُس کے کان اُن کی فریاد پر لگے رہتے ہیں۔ "},
	{16, "16  خُداوند کا چہرہ بدکاروں کے خلاف ہے تاکہ اُنکی یاد زمین پر سے مِٹا دے۔ "},
	{17, "17  صادِق چلّائے اور خُداوند سے سُنا اور اُن کو اُس کے سب دُکھوں سے چھڑایا "},
	{18, "18  خُداوند شکستہ دلوں کے نزدیک ہے اور خستہ جانوں کو بچاتا ہے۔ "},
	{19, "19  صادق کی مُصیبتیں بہت ہیں لیکن خُداوند اُس کو اُن سے سے رہائی بخشتا ہے ۔ "},
	{20, "20  وہ اُس کی سب ہڈیوں کو محفوظ رکھتا ہے۔اُن میں سے ایک بھی توڑی نہیں جاتی۔ "},
	{21, "21  بدی شریر کو ہلاک کر دے گی اور صادق سے عداوت رکھنے والے مجرم ٹھہرینگے۔ "},
	{22, "22  خُداوند اپنے بندوں کی جان کا فدیہ دیتا ہے اور جو اُس پر توکل کرتے ہیں اُن میں سے کوئی مجرم نہ ٹھہریگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view35() {
struct ur35 poems[] = {
	{1, "1  اَے خُداوند! جو مجھ سے جھگڑتے ہیں تُو اُن سے جھگڑ۔ جو مجھ سے لڑتے ہیں تُو اُن سے لڑ۔ "},
	{2, "2  ڈھال اور سپر لیکر میری کمک کے لئے کھڑا ہو۔ "},
	{3, "3  بھالا بھی نکال اور میرا پیچھا کرنے والوں کا راستہ بند کردے۔ میری جان سے کہہ میں تیری نجات ہوں۔ "},
	{4, "4  جو میری جان کے خواہاں ہیں وہ شرمندہ اور رسوا ہوں۔ جومیرے نُقصان کا منصوبہ باندھتے ہیں وہ پسپا اور پریشان ہوں۔ "},
	{5, "5  وہ ایسے ہوجائیں جیسے ہوا کے آگے بھُوسا اور خُداوند کا فرشتہ اُن کو ہانکتا رہے۔ "},
	{6, "6  اُنکی راہ اندھیری اور پھسلنی ہوجائے اور خُداوند کا فرشتہ اُن کو رگیدتا جائے۔ "},
	{7, "7  کیونکہ اُنہوں نے بے سبب میرے لئے گڑھے میں جال بچھایا اور ناحق میری جان کے لئے گڑھا کھودا ہے۔ "},
	{8, "8  اُس پر ناگہان تباہی آپڑے اور جس جال کو اُس نے بچھایا ہے اُس میں آپ ہی پھنسے اور اُسی ہلاکت میں گرفتار ہو۔ "},
	{9, "9  لیکن میری جان خُداوند میں خُوش رہیگی اور اُس کی نجات سے شادمان ہوگی۔ "},
	{10, "10  میری سب ہڈیاں کہینگی اَے خُداوند! تجھ سا کون ہے جو غریب کو اُس کے ہاتھ سے جو اُس سے زور آور ہے اور مسکین ومحتاج کو غارتگر سے چھڑاتا ہے؟ "},
	{11, "11  جھوٹے گواہ اُٹھتے ہیں اور جو باتیں میں نہیں جانتا وہ مجھ سے پوچھتے ہیں۔ "},
	{12, "12  وہ مجھ سے نیکی کے بدلے بدی کرتے ہیں۔ یہاں تک کہ میری جان بیکس ہوجاتی ہے۔ "},
	{13, "13  لیکن میں نے تو اُن کی بیماری میں جب وہ بیمار تھے ٹاٹ اوڑھا اور روزے رکھ رکھ کر اپنی جان کو دُکھ دیا اور میری دُعا میرے ہی سینہ میں واپس آئی۔ "},
	{14, "14  میں نے تو ایسا کیا گویا وہ میرا دوست یا میرابھائی تھا۔ میں نے سر جھکا کر غم کیا جیسے کوئی اپنی مان کے لئے ماتم کرتا ہو۔ "},
	{15, "15  پر جب میں لنگڑانے لگا تو وہ خُوش ہو کر اکٹھے ہوگئے۔ کمینے میرے خلاف اکٹھے ہوئے اور مجھے معلوم نہ تھا۔ اُنہوں نے مجھے پھاڑا اور باز نہ آئے۔ "},
	{16, "16  ضیافتوں کے بدتمیز مسخروں کی طرح اُنہوں نے مجھ پر دانت پیسے۔ "},
	{17, "17  اَے خُداوند! تُو کب تک دیکھتا رہیگا؟ میری جان کو اُن کی غارتگری سے۔ میری جان کو شیروں سے چھڑا۔ "},
	{18, "18  میں بڑے مجمع میں تیری شکرگذاری کرونگا۔ میں بہت سے لوگوں میں تیری ستایش کرونگا۔ "},
	{19, "19  جو ناحق میرے دُشمن ہیں مجھ پر شادیانہ نہ بجائیں اور جو مجھ سے بے سبب عداوت رکھتے ہیں چشمک زنی نہ کریں۔ "},
	{20, "20  کیونکہ وہ سلامتی کی باتیں نہیں کرتے۔ بلکہ مُلک کے امن پسند لوگوں کے خلاف مکر کے منصوبے باندھتے ہیں۔ "},
	{21, "21  یہاں تک کہ اُنہوں نے خوب مُنہ پھاڑا اور کہا اہا ہاہا! ہم نے اپنی آنکھ سے دیکھ لیا ہے۔ "},
	{22, "22  اَے خُداوند! تُو نے خُود یہ دیکھا ہے۔ خاموش نہ رہ۔ اَے خُداوند! مجھ سے دُور نہ رہ۔ "},
	{23, "23  اُٹھ! میرے انصاف کے لئے جاگ اور میرے معاملہ کے لئے اَے میرے خُدا! اَے میرے خُداوند! "},
	{24, "24  اپنی صداقت کے مطابق میری عدالت کر۔ اَے خُداوند میرے خُدا! اور اُن کو مجھ پر شادیانہ بجانے نہ دے۔ "},
	{25, "25  وہ اپنے دِل میں یہ نہ کہنے پائیں اہا! ہم تو یہی چاہتے تھے۔ وہ یہ نہ کس کہ ہم اُسے نگل گئے۔ "},
	{26, "26  جو میرے نُقصان سے خُوش ہوتے ہیں وہ باہم شرمندہ اور پریشان ہوں۔ وہ میرے مقابلہ میں تکبر کرتے ہیں وہ شرمندگی اور رسوائی سے مُلبس ہوں۔ "},
	{27, "27  جو میرے سچے معاملہ کی تائید کرتے ہیں وہ خُوشی سے للکاریں اور شاد ہوں۔ وہ سدا یہ کہیں خُداوند کی تمجید ہو۔ جس کی خوشنودی اپنے بندہ کی اقبالمندی میں ہے۔ "},
	{28, "28  تب میری زبان سے تیری صداقت کا ذکرہوگا اور دِن بھر تیری تعریف ہوگی۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view36() {
struct ur36 poems[] = {
	{1, "1  شریر کی بدی سے میرے دِل میں خیال آتا ہےکہ خُدا کا خوف اُس کے پیش نظر نہیں۔ "},
	{2, "2  کیونکہ وہ اپنے آپ کو اپنی نظر میں اِس خیال سے تسلی دیتا ہے کہ اُس کی بدی نہ تو فاش ہوگی نہ مکروہ سمجھی جائیگی۔ "},
	{3, "3  اُس کے مُنہ میں بدی اور فریب کی باتیں ہیں۔ وہ دانش اور نیکی سے دست بردار ہوگیا ہے۔ "},
	{4, "4  وہ اپنے بستر پر بدی کے منصوبے باندھتا ہے۔ وہ ایسی راہ اختیار کرتا ہے جو اچھی نہیں وہ بدی سے نفرت نہیں کرتا۔ "},
	{5, "5  اَے خُداوند! آسمان میں تیری شفقت ہے۔ تیری وفاداری افلاک تک بلند ہے۔ "},
	{6, "6  تیری صداقت خُدا کے پہاڑوں کی مانند ہے تیرے احکام نہایت عمیق ہیں۔ اَے خُداوند! تُو انسان اور حیوان دونوں کو محفوظ رکھتا ہے۔ "},
	{7, "7  اَے خُدا! تیرے شفقت کیا ہی بیش قیمت ہے بنی آدم تیرے بازوؤں کے سایہ میں پناہ لیتے ہیں۔ "},
	{8, "8  وہ تیرے گھر کی نعمتوں سے خوب آسودہ ہونگے۔ تُو اُن کی اپنی خوشنودی کے دریا میں سے پلائیگا۔ "},
	{9, "9  کیونکہ زندگی کا چشمہ تیرے پاس ہے۔ تیرے نور کی بدولت ہم روشنی دیکھینگے۔ "},
	{10, "10  تیرے پہچاننے والوں پر تیری شفقت دائمی ہو اور راست دلوں پر تیری صداقت۔ "},
	{11, "11  مغرور آدمی مجھ پر لات نہ اُٹھانے پائے اور شریر کا ہاتھ مجھے ہانک نہ دے۔ "},
	{12, "12  بدکردار وہاں گرے پڑے ہیں۔ وہ گرا دِئے گئے ہیں اور پھر اُٹھ نہ سکینگے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view37() {
struct ur37 poems[] = {
	{1, "1  تُو بدکرداروں کے سبب سے بیزار نہ ہواور بدی کرنے والوں پر رشک نہ کر۔ "},
	{2, "2  کیونکہ وہ گھاس کی طرح جلد کاٹ ڈالے جائینگے اور سبزہ کی طرح مُرجھا جائینگے۔ "},
	{3, "3  خُداوند پر تُوکل کر اور نیکی کر۔ ملک میں آباد رہ اور اُس کی وفاداری سے پرورش پا۔ "},
	{4, "4  خُداوند میں مسرور رہ اور وہ تیرے دل کی مرادیں پُوری کریگا۔ "},
	{5, "5  اپنی راہ خُداوند پر چھوڑ دے اور اُس پر تُوکل کر۔ وہی سب کچھ کریگا۔ "},
	{6, "6  وہ تیری راستبازی کو نُور کی طرح اور تیرے حق کو دوپہر کی طرح روشن کریگا۔ "},
	{7, "7  خُداوند میں مطمئن رہ اور صبر سے اُس کی آس رکھ۔ اُس آدمی کے سبب سے جو اپنی راہ میں کامیاب ہوتا اور بُرے منصوبوں کو انجام دیتا ہے بیزار نہ ہو۔ "},
	{8, "8  قہر سے باز آ اور غضب کو چھوڑ دے بیزار نہ ہو۔ اِس سے بُرائی ہی نکلتی ہے۔ "},
	{9, "9  کیونکہ بدکردار کاٹ ڈالے جائینگے لیکن جنکو خُداوند کی آس ہے ملک کے وارث ہونگے۔ "},
	{10, "10  کیونکہ تھوڑی دیر میں شریر نابُود ہوجائیگا۔ تُو اُس کی جگہ کو غور سے دیکھیگا پروہ نہ ہوگا۔ "},
	{11, "11  لیکن حلیم ملک کے وارث ہونگے اور سلامتی کی فراوانی سے شادمان رہینگے۔ "},
	{12, "12  شریر راست باز کے خلاف بندشیں باندھتا ہے اور اُس پر دانت پیستا ہے۔ "},
	{13, "13  خُداوند اُس پر ہنسیگا کیونکہ وہ دیکھتا ہے کہ اُس کا دِن آتا ہے۔ "},
	{14, "14  شریروں نے تلوار نکالی اور کمان کھینچی ہے تاکہ غریب اور محتاج کو گرا دیں اور راست رُو کو قتل کریں۔ "},
	{15, "15  اُن کی تلواراُن ہی کے دل کو چھیدیگی اور اُن کی کمانیں توڑی جائینگی۔ "},
	{16, "16  صادِق کا تھوڑا سا مال بہت سے شریروں کی دولت سے بہتر ہے "},
	{17, "17  کیونکہ شریروں کے بازو توڑے جائینگے لیکن خُداوند صاوقوں کو سنبھالتا ہے۔ "},
	{18, "18  کامل لوگوں کے ایام کو خُداوند جانتا ہے۔ اُن کی میراث ہمیشہ کے لئے ہوگی۔ "},
	{19, "19  وہ آفت کے وقت شرمندہ ہونگے اور کال کے دنوں میں آسودہ رہینگے۔ "},
	{20, "20  لیکن شریر ہلاک ہونگے۔ خُداوند کے دُشمن چراگاہوں کی سرسبزی کی مانند ہونگے۔ وہ فنا ہوجائینگے۔ وہ دھوئیں کی طرح جاتے رہینگے۔ "},
	{21, "21  شریر قرض لیتا ہے اور ادا نہیں کرتا لیکن صادق رحم کرتا ہے اور دیتا ہے۔ "},
	{22, "22  کیونکہ جنکو وہ برکت دیتا ہے وہ زمین کے وارث ہونگے اور جن پر وہ لعنت کرتا ہے وہ کاٹ ڈالے جائینگے ۔ "},
	{23, "23  انسان کی روشیں خُداوند کی طرف سے قائم ہیں اور وہ اُس کی راہ سے خُوش ہے۔ "},
	{24, "24  اگر وہ گر بھی جائے تو پڑا نہ رہیگا کیونکہ خُداوند اُسے اپنے ہاتھ سے سنبھالتا ہے۔ "},
	{25, "25  میں جوان تھا اور اب بوڑھا ہوں تُو بھی میں نے صادق کو بیکس اور اُس کی اولاد کو ٹکڑے مانگتے نہیں دیکھا۔ "},
	{26, "26  وہ دِن بھر رحم کرتا ہے اور قرض دیتا ہے اور اُس کی اولاد کو برکت ملتی ہے۔ "},
	{27, "27  بدی کو چھوڑ دے اور نیکی کر اور ہمیشہ تک آباد رہ۔ "},
	{28, "28  کیونکہ خُداوند انصاف کو پسند کرتا ہے اور اپنے مقدسوں کو ترک نہیں کرتا۔ وہ ہمیشہ کے لئے محفوظ ہیں۔ پر شریروں کو نسل کاٹ ڈالی جائینگی۔ "},
	{29, "29  صادق زمین کے وارث ہونگے اور اُس میں ہمیشہ بسے رہینگے۔ "},
	{30, "30  صادق کے منہ سے دانائی نکلتی ہے اور اُس کی زبان سے انصاف کی باتیں۔ "},
	{31, "31  اُس کے خُدا کی شریعت اُس کے دِل میں ہے۔ وہ اپنی روش میں پھسلیگا نہیں "},
	{32, "32  شریر صادق کی تاک میں رہتا ہے اور اُسے قتل کرنا چاہتا ہے۔ "},
	{33, "33  خُداوند اُسے اُس کے ہاتھ میں نہیں چھوڑیگا اور جب اُس کی عدالت ہو تو اُسے مجرم نہ ٹھہرائیگا۔ "},
	{34, "34  خُداوند کی آس رکھ اور اُسی کی راہ پر چلتا رہ اور وہ تجھے سرفراز کر کے زمین کا وارث بنائیگا۔ جب شریر کاٹ ڈالے جائینگے تو تُو دیکھیگا۔ "},
	{35, "35  میں نے شریر کو بڑے اِقتدار میں اور ایسا پھیلتے دیکھا جیسے کوئی ہرا درخت اپنی اصلی زمین میں پھیلتا ہے۔ "},
	{36, "36  لیکن جب کوئی اُدھر سے گُذرا اور دیکھا تو وہ تھا ہی نہیں بلکہ میں نے اُسے ڈھونڈا پر وہ نہ ملا۔ "},
	{37, "37  کامل آدمی پر نگاہ کر اور راستباز کو دیکھ کیونکہ صُلح دوست آدمی کے لئے اجر ہے۔ "},
	{38, "38  لیکن خطا کار اِکٹھے مرمٹینگے۔ شریروں کا انجام ہلاکت ہے۔ "},
	{39, "39  لیکن صادقوں کی نجات خُداوند کی طرف سے ہے مُصیبت کے وقت وہ اُن کا محکم قلعہ ہے "},
	{40, "40  اور خُداوند اُن کی مدد کرتا اور اُن کو بچاتا ہے وہ اُن کو شریروں سے چھڑاتا اور بچالیتا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view38() {
struct ur38 poems[] = {
	{1, "1  اَے خُداوند اپنے قہر میں مجھے چھڑک نہ دے اور اپنے غضب میں مجھے تنینہ نہ کر۔ "},
	{2, "2  کیونکہ تیرے تِیر مجھ میں لگے ہیں۔ اور تیرا ہاتھ مجھ پر بھاری ہے۔ "},
	{3, "3  تیرے قہر کے سبب سے میری جسم میں صحت نہیں اور میرے گناہ کے باعث میری ہڈیوں کو آرام نہیں۔ "},
	{4, "4  کیونکہ میری بدی میرے سرسے گذرگئی اور وہ بڑے بوجھ کی مانندمیرے لئے نہایت بھاری ہے۔ "},
	{5, "5  میری حماقت کے سبب سے میرے زخموں سے بدبُو آتی ہے۔ وہ سٹر گئے ہیں۔ "},
	{6, "6  میں پُر درد اور بہت جھکا ہوا ہوں۔ میں دن بھر ماتم کرتا پھرتا ہوں۔ "},
	{7, "7  کیونکہ میری کمر میں سوزش ہی سوزش ہے اور میرے جسم میں کچھ صحت نہیں۔ "},
	{8, "8  میں نحیف اور نہایت کچلا ہوا ہوں۔ اور دِل کی بے چینی کے سبب سے کراہتا رہا۔ "},
	{9, "9  اَے خُداوند! میری ساری تمنا تیرے سامنے ہے اور میرا کراہنا تجھ سے چِھپا نہیں۔ "},
	{10, "10  میرا دِل دھڑکتا ہے۔ میری طاقت گھٹی جاتی ہے۔ میری آنکھوں کی روشنی بھی مجھ سے جاتی رہی۔ "},
	{11, "11  میرے عزیز اور دوست میری بلا میں الگ ہوگئے اور میرے رشتہ دار دُور جا کھڑے ہوئے۔ "},
	{12, "12  میری جان کے خواہاں میرے لئے جال بچھاتے ہیں اور میری نُقصان کے طالب شرارت کی باتیں بولتے اور دِن بھر مکرو فریب کے منصوبے باندھتے ہیں۔ "},
	{13, "13  پر میں بہرے کی مانند سُنتا ہی نہیں۔ میں گونگے کی مانند مُنہ نہیں کھولتا۔ "},
	{14, "14  بلکہ میں اُس آدمی کی مانند ہوں جسے سُنائی نہیں دیتا اور جس کے مُنہ میں ملامت کی باتیں نہیں۔ "},
	{15, "15  کیونکہ اَے خُداوند! مجھے تجھ سے اُمید ہے۔ اَے خُداوند میرے خُدا! تُو جواب دیگا۔ "},
	{16, "16  کیونکہ میں نے کہا کہ کہیں وہ مجھ پر شادیانہ نہ بجائیں۔ جب میرا پاؤں پھسلتا ہے تو وہ میرے خلاف تکبر کرتے ہیں۔ "},
	{17, "17  کیونکہ میں گرنے ہی کو ہوں اور میرا غم برابر میرے سامنے ہے۔ "},
	{18, "18  اِس لئے کہ میں اپنی بدی کو ظاہر کرونگا اور اپنے گناہ کے باعث غمگین رہونگا۔ "},
	{19, "19  لیکن میرے دُشمن چست اور زبردست ہیں اور مجھ سے ناحق عداوت رکھنے والے بہت ہوگئے ہیں۔ "},
	{20, "20  جو نیکی کے بدلے بدی کرتے ہیں وہ بھی میرے مخالف ہیں کیونکہ میں نیکی کی پیروی کرتا ہوں۔ "},
	{21, "21  اَے خُداوند! مجھے چھوڑ نہ دے۔ اَے خُدا! مجھ سے دُور نہ ہو۔ "},
	{22, "22  اَے خُداوند! اَے میری نجات! میری مدد کے لئے جلدی کر "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view39() {
struct ur39 poems[] = {
	{1, "2  میں گونگا بن کر خاموش رہا اور نیکی کی طرف سے بھی خاموشی اِختیار کی اور میرا غم بڑھ گیا۔ "},
	{2, "3  میرا دِل اندر ہی اندر جل رہا تھا۔ سوچتے سوچتے آگ بھڑک اُٹھی۔ تب میں اپنی زبان سے کہنے لگا۔ "},
	{3, "4  اَے خُداوند! ایسا کہ کہ میں اپنے انجام سے واقف ہو جاؤں اور اِس سے بھی کہ میری عمر کی میعاد کیا ہے۔ میں جان لوں کہ کیسا فانی ہوں۔ "},
	{4, "5  دیکھ! تُو نے میری عمر بالشت بھر کی رکھی ہے اور میری زندگی تیرے حضور بے حقیقت ہے یقیناً ہر انسان بہترین حالت میں بھی بالکل بے ثبات ہے(سلاہ)۔ "},
	{5, "6  درحقیقت انسان سایہ کی طرح چلتا پھرتا ہے۔ یقیناً وہ فضول گھبراتے ہیں۔ وہ ذخیرہ کرتا ہے اور یہ نہیں جانتا کہ اُسے کون لیگا۔ "},
	{6, "7  اَے خُداوند! اب میں کس بات کے لئے ٹھہراہوں؟ میری اُمید تجھ ہی سے ہے۔ "},
	{7, "8  مجھ کو میری سب خطاؤں سے رہائی دے۔ احمقوں کو مجھ پر انگشت نمائی نہ کرنے دے۔ "},
	{8, "9  میں گونگا بنا۔ میں نے مُنہ نہ کھولا۔ کیونکہ تُو ہی نے یہ کیا ہے۔ "},
	{9, "10  مجھ سے اپنی بلا دُور کردے۔ میں تو تیرے ہاتھ کی مار سے فنا ہوا جاتا ہوں۔ "},
	{10, "11  جب تُو انسان کو بدی پر ملامت کرکے تنبیہ کرتا ہے تو اُس کے حُسن کو پتنگے کی طرح فنا کردیتا ہے۔ یقیناً ہر انسان بے ثبات ہے (سلاہ)۔ "},
	{11, "12  اَے خُداوند! میری دُعا سُن اور میری فریادپر کان لگا۔ میری آنسوؤں کو دیکھ کر خاموش نہ رہ کیونکہ میں تیرے حضور پردیسی اور مُسافر ہوں۔ جیسے میرے سب باپ دادا تھے۔ "},
	{12, "13  آہ! مجھ سے نظر ہٹا لے تاکہ تازہ دم ہو جاؤں۔ اِس سے پہلے کہ رحلت کروں اور نابُود ہو جاؤں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view40() {
struct ur40 poems[] = {
	{1, "1  میں نے صبر سے خُداوند پر آس رکھی۔ اُس نے میری طرف مائل ہو کر میری فریاد سُنی۔ "},
	{2, "2  اُس نے مجھے ہولناک گڑھے اور دلدل کی کیچڑ میں سے نکالا اور اُس نے میرے پاؤں چٹان پر رکھے اور میری روش قائم کی۔ "},
	{3, "3  اُس نے ہمارے خُدا کی ستایش کا نیا گیت میرے مُنہ میں ڈالا۔ بہتیرے دیکھینگے اور ڈرینگے اور خُداوند پر تُوکل کرینگے۔ "},
	{4, "4  مُبارک ہے وہ آدمی جو خُداوند پر تُوکل کرتا ہے اور مغروروں اور دروغ دوستوں کی طرف مائل نہیں ہوتا۔ "},
	{5, "5  اَے خُداوند میرے خُدا! جو عجیب کام تُو نے کِئے اور تیرے خیال جو ہماری طرف ہیں وہ بہت سے ہیں۔ میں اُن کو تیرےحضور ترتیب نہیں دے سکتا اگر میں اُن کا ذکر اور بیان کرنا چاہوں تو وہ شمارسے باہر ہیں۔ "},
	{6, "6  قُر بانی اور نذر کو تُو پسند نہیں کرتا۔ تُو نے میرے کان کھول دِئے ہیں۔ سوختنی قُربانی اور خطا کی قُربانی تُو نے طلب نہیں کی۔ "},
	{7, "7  تب میں نے کہا دیکھ! میں آیا ہوں۔ کتاب کے طُومار میں میری بابت لکھا ہے۔ "},
	{8, "8  اَے میرے خُدا! میری خُوشی تیری مرضی پُوری کرنے میں ہے بلکہ تیری شریعت میرے دِل میں ہے۔ "},
	{9, "9  میں نے بڑے مجمع می صداقت کی بشارت دی ہے دیکھ! میں اپنا مُنہ بند نہیں کُرونگا۔ اَے خُداوند! تُو جانتا ہے۔ "},
	{10, "10  میں نے تیری صداقت اپنے دِل میں چھپا نہیں رکھی۔ میں نے تیری شفقت اور سچائی بڑے مجمع سے نہیں چھپائی ۔ "},
	{11, "11  اَے خُداوند! تُو مجھ پر رحم کرنے میں دریغ نہ کر۔ تیری شفقت اور سچائی برابر میری حفاظت کریں۔ "},
	{12, "12  کیونکہ بے شمار بُرائیوں نے مجھے گھیر لیا ہے۔ میری بدی نے مجھے آپکڑا ہے۔ ایسا کہ میں آنکھ نہیں اُٹھا سکتا۔ وہ میری سر کے بالوں سے بھی زیادہ ہیں۔ سو میرا جی چھوٹ گیا۔ "},
	{13, "13  اَے خُداوند! مہربانی کر کے مجھے چھڑا۔ اَے خُداوند! میری مدد کے لئے جلدی کر۔ "},
	{14, "14  جو میری جان کو ہلاک کرنے کے درپے ہیں وہ سب شرمندہ اور خجل ہوں۔ جو میری نقصان سے خُوش ہیں۔ وہ پسپا اور رُسوا ہوں۔ "},
	{15, "15  جو مجھ پر اہاہاہا کرتے ہیں وہ اپنی رُسوائی کے سبب سے تباہ ہو جائیں۔ "},
	{16, "16  تیرے سب طالب تجھ میں خُوش وخُرم ہوں۔ تیری نجات کےعاشق ہمیشہ کہا کریں خُداوند کی تمجید ہو! "},
	{17, "17  پر میں مسکین اور محتاج ہوں۔ خُداوند میری فکر کرتا ہے۔ میرا مدد گار اور چھڑانے والا تُو ہی ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view41() {
struct ur41 poems[] = {
	{1, "1  مُبارک ہے و ہ جو غریب کا خیال رکھتاہے۔خُداوند مُصیبت کے دِن اُسے چھڑائیگا۔ "},
	{2, "2  خُداوند اُسے محفوظ اُور جِیتا رکھیگا اور وہ زمین پر مُبارِک ہو گا۔تُو اُسے اُس کے دُشمنوں کی مرضی پر نہ چھوڑ۔ "},
	{3, "3  خُداوند اُسے بیماری کےبِستر پر سنبھالے گا۔ تُواُسکی بیماری میں اُس کے پورے بِستر کو ٹھیک کرتا ہے۔ "},
	{4, "4  میں نے کہا اَے خُداوند! مُجھ پر رحم کر ۔میری جان کو شِفا دے کیونکہ میں تیرا گنہگار ہوں۔ "},
	{5, "5  میرے دُشمن یہ کہکر میری بُرائی کرتے ہیں۔کہ وہ کب مرَے گا اور اُس کا نام کب مِٹیگا؟ "},
	{6, "6  جب وہ مُجھ سے مِلنے کو آتا ہے تو جُھوٹی باتیں بکتا ہے۔ اُسکا دِل اپنے اندر بدی سمیٹتا ہے۔ وہ باہر جاکر اُسی کا ذِکر کرتا ہے۔ "},
	{7, "7  مُجھ سے عداوت رکھنے والے سب میری غِیبت کرتے ہیں۔ وہ میرے خِلاف میرے نُقصان کے منصوبے باندھتے ہیں۔ "},
	{8, "8  وہ کہتے ہیں اِسے تو بُرا روگ لگ گیا ہے ۔ اَب جو وہ پڑا ہے تو پھراُٹھنے کا نہیں۔ "},
	{9, "9  بلکہ میرے دِلی دُوست نےجِس پر مُجھے بھروسہ تھا اور جو میری روٹی کھاتا تھامُجھ پر لات اُٹھائی ہے۔ "},
	{10, "10  پر تو اَے خُداوند !مُجھ پررحم کر کے مُجھے اُٹھا کھڑا کر تاکہ میں اُن کو بدلہ دوں۔ "},
	{11, "11  اِس سے میں جان گیا کہ تو مُجھ سے خوش ہے۔ کہ میرا دُشمن مُجھ پر فتح نہیں پاتا۔ "},
	{12, "12  مُجھ تو تُو ہی میری راستی میں قیام بخشتا ہے اور مُجھے ہمیشہ اپنے حضور قائم رکھتا ہے۔ "},
	{13, "13  خُدا وند اِسرائیل کا خُدا ازل سے ابد تک مُبارِک ہو! آمین ثُم آمین۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view42() {
struct ur42 poems[] = {
	{1, "1  جیسے ہرنی پانی کے نالوں کو ترستی ہےویسے ہی اُے خُدا!میری روح تیرے لِئے ترستی ہے۔ "},
	{2, "2  میری روح خُدا کی ۔ زِندہ خُدا کی پیاسی ہے۔میں کب جاکر خُدا کے حضور حاضر ہوں گا؟ "},
	{3, "3  میرے آنسُو دِن رات میری خوراک ہیں۔ جِس حال کہ وہ مُجھ سے برابر کہتے ہیں تیرا خُدا کہاں ہے؟ "},
	{4, "4  اِن باتوں کو یاد کر کے میرا دِل بھر آتا ہے کہ میں کس طرح بھیِڑ یعنی عیِد منانے والی جماعت کے ہمراہ خُوشی اور حمد کرتا ہُوا اُن کو خُدا کے گھر میں لے جاتا تھا۔ "},
	{5, "5  اَے میری جان ! تو کیوں گری جاتی ہے؟ تو اندر ہی اندر بے چیُن ہے؟خُدا سے اُمیدرکھ کیونکہ اُسکے نجات بخش دِیدارکی خاطرِ میَں پھِر اُس کی ستائش کروں گا ۔ "},
	{6, "6  اُے میرےخدُا!میری جان میر ے اندرگری جاتی ہے۔ اِسےلیےمیں تجھےیرُدن کی سر زمین سے اورحرمون اورکوہِ مصِفارپرسے یادکرتاہوُں۔ "},
	{7, "7  تیرے آ بشاروں کی آوازسےگہراؤ گہراؤ کو پُکارتا ہے۔تیری سب موجیں اور لہریں مُجھ پر سے گُزر گیئں۔ "},
	{8, "8  تو بھی دِن کو خُداوند اپنی شفقت دِکھائے گا۔ اور رات کو میں اُس کا گیت گاؤُنگا بلکہ اپنی حیات کے خُدا سے دُعا کرونگا۔ "},
	{9, "9  میں خُدا سے جو میری چِٹان ہےکہونگا تُو مُجھے کیوں بھول گیا؟ میں دُشمن کے ظلم کے سبب سے کیوں ماتم کرتا پِھرتا ہوں؟ "},
	{10, "10  میرے مُخالفوں کی ملامت گویا میری ہڈِیوں میں تلوار ہے۔ کیونکہ وہ مُجھ سے برابر کہتے ہیں تیرا خُدا کہاں ہے ؟ "},
	{11, "11  اَے میری جان!تُو کیوں گِری جاتی ہے؟تُو اندر ہی اندر کیوں بے چین ہے؟ خُدا سے اُمید رکھ کیونکہ وہ میرے چہرے کی رونق اور میرا خُدا ہے۔ میں پِھر اُس کی ستائش کروں گا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view43() {
struct ur43 poems[] = {
	{1, "1  اَے خُدامیرا اِنصاف کراوربے دِین قُوم کے مُقابلہ میں میری وکالت کر اور دغاباز اور بے اِنصاف آدمی سے مجھےُچھُڑا۔ "},
	{2, "2  کیونکہ تُوہی میر ی قُوت کاخُدا ہے۔تُونے کیوںمجھےترک کر دیا؟ "},
	{3, "3  مٔیں دُشمن کےظُلم کے سبب سے کیوں ماتم کرتا پھرِتا ہوںٖ؟ "},
	{4, "4  تب میں خُدا کے مذبح کے پاس جاؤں گا۔ خُدا کے حضور جو میری کمال خُوشی ہے۔ اَے خُدا! میرے خُدا! میں سِتار بجا کر تیری سِتائش کروُنگا۔ "},
	{5, "5  اَے میری جان تو کیوں گرِی جاتی ہے ؟تُو اندر ہی اندر کیوں بے چَین ہے؟ خُدا سے اُمید رکھ کیونکہ وہ میرے چہرے کی رَونق اور میرا خُدا ہے میں پھرِ اُسکی سِتائش کرونگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view44() {
struct ur44 poems[] = {
	{1, "1  اَے خُدا ! ہم نے اپنے کانوں سے سُنا ۔ ہمارے باپ دادا نے ہم سے بیان کیا۔ کہ تو نے اُنکے دِنوں میں قدیم زمانہ میں کیا کیا کام کئے۔ "},
	{2, "2  تو نے قوموں کو اپنے ہاتھ سے نِکالدیااور ا،ن کو بسایا۔تُو نے اُمتوں کو تباہ کیا اور اِن کو چاروں طرف پھیلایا۔ "},
	{3, "3  کیونکہ نہ تو یہ اپنی تلوار سے اِس مُلک پر قابض ہوئے اور نہ اِنکے بازُو نے اِنکو بچایا۔ بلکہ تیرے دہنے ہاتھ اور تیرے بازُو اور تیرے چہرے کے نُور نے اِنکو فتح بخشی کیونکہ تو اِن سے خوشنود تھا۔ "},
	{4, "4  اَے خُدا! تُو میرا بادشاہ ہے۔ یعقُوب کے حق میں نجات کا حُکم صادر فرما۔ "},
	{5, "5  تیری بدولت ہم اپنے مُخالفُوں کو گرِا دینگے۔ تیرے نام سے ہم اپنے خِلاف اُٹھنے والوں کو پامال کرینگے۔ "},
	{6, "6  کیونکہ نہ تو میَں اپنی کمان پر بھروسا کروںگااور نہ میری تلوار مجھے بچائے گی۔ "},
	{7, "7  لیکن تو نے ہمکو ہمارے مُخالِفوں سے بچایا ہے ۔ اور ہم سے عداوت رکھنے والوں کو شرمندہ کیا۔ "},
	{8, "8  ہم دِن بھر خُدا پر فخر کرتے رہے ہیں۔ اور ہمیشہ ہم تیرے ہی نام کا شُکریہ ادا کرتے رہینگے۔ "},
	{9, "9  لیکن تُو نے اَب ہم کو ترک کر دِیا اور ہم کو رُسوا کیا ۔ اور ہمارے لشکروں کے ساتھ نہیں جاتا ۔ "},
	{10, "10  تُو ہم کو مُخالفوں کے آگے پسپا کرتا ہے۔ اور ہم سے عداوت رکھنے والے لوُٹ مار کرتے ہیں۔ "},
	{11, "11  تو نے ہم کو ذبح ہونے والی بھیڑوں کی مانند کر دیا اور قوموں کے درمیان ہم کو پرگندا کیا ۔ "},
	{12, "12  تُو اپنے لوگوں کو مفت بیچ ڈالتا ہے۔ اور اُن کی قیمت سے تیری دُولت نہیں بڑھتی۔ "},
	{13, "13  تُو ہم کو ہمارے پڑوسیوں کی ملامت کا نشانہ اور ہمارےا ٓس پاس کے لوگوں کے تمسخُر اور مذاق کا باعث بناتا ہے۔ "},
	{14, "14  تُو ہمکو قوموں کے درمیان ضربُ المثل اور اُمتوں میں سَر ہِلانے کا باعث ٹھہراتا ہے ۔ "},
	{15, "15  میری رُسوائی دِن بھر میرے سامنے رہتی ہے اور میرے مُنہ پر شرمِندگی چھا گئی ۔ "},
	{16, "16  ملامت کرنے والے اور کُفر بکنے والے کی باتوں کے سبب سے اور مُخالِف اور اِنتقام لینے والے کے باعث۔ "},
	{17, "17  یہ سب کچھ ہم پر بیتا تو بھی ہم تُجھ کو نہیں بھولے نہ تیرے عہد سے بے وفائی کی ۔ "},
	{18, "18  نہ ہمارے دِل برگشتہ ہوئے نہ ہمارے قدم تیری راہ سے مُڑے ۔ "},
	{19, "19  جو تُو نے ہم کو گیِدڑوں کی جگہ میں خوُب کُچلا اور موت کے سایہ میں ہمکو چھپایا۔ "},
	{20, "20  اگر ہم اپنے خُدا کے نام کو بھُولے یہ ہم نے کسی اجنبی معبُود کے آگے اپنے ہاتھ پھیلائے ہوں ۔ "},
	{21, "21  تو کیا خُدا اِسے دریافت نہ کر لے گا ؟ کیونکہ وہ دِلوں کے بھید جانتا ہے۔ "},
	{22, "22  بلکہ ہم تو دِن بھر تیری خاطر جان سے مارے جاتے ہیں اور گویا ذبح ہونے والی بھیڑیں سمجھے جاتے ہیں۔ "},
	{23, "23  اَے خُداوند! جاگ تُو کیوں سوتا ہے؟ اُٹھ ہمیشہ کے لئے ہمکو ترک نہ کر۔ "},
	{24, "24  تُو اپنا مُنہ کیوں چھُپاتا ہے اور ہماری مُصیبت اور ہماری مظلومی کو بھُولتا ہے؟ "},
	{25, "25  کیونکہ ہماری جان خاک میں مِل گئی۔ ہمارا جِسم مٹی ہو گیا۔ "},
	{26, "26  ہماری مدد کے لئے اُٹھ ۔ اور اپنی شفقت کی خاطر ہمارا فدِیہ دے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view45() {
struct ur45 poems[] = {
	{1, "1  میرے دِل میں ایک نفیِس مضمُون جُوش مار رہا ہے۔ میَں وہی مضامیِن سُناؤں گا جو میَں نے بادشاہ کے حق میں قلمبند کِئے ہیں۔ میری زُبان ماہرِ کاتِب کا قلم ہے۔ "},
	{2, "2  تُو بنی آدم میں سب سے حِسین ہے ۔ تیرے ہونٹوں میں لطافت بھری ہے۔ اِس لئے خُدا نے تجھے ہمیشہ کے لئِے مُبارِک کیا۔ "},
	{3, "3  اَے زبردست ! تُو اپنی تلوار کو جو تیری حشمت و شوکت ہے اپنی کمر سے حمائِل کر۔ "},
	{4, "4  اور سچائی اور حِلم اور صداقت کی خاطر اپنی شان و شُوکت میں اِقبالمندی سے سوار ہو اور تیرا دہنا ہاتھ تجھے مُہیب کام دِکھائے گا۔ "},
	{5, "5  تیرے تیِر تیز ہیں ۔ وہ بادشاہ کے دُشمنوں کے دِلوں میں لگے ہیں۔ اُمتیں تیرے سامنے زیر ہوتی ہیں۔ "},
	{6, "6  اَے خُدا! تیرا تخت ابُدالآباد ہے۔ تیری سلطنت کا عصَا راستی کا عصا ہے۔ "},
	{7, "7  تُو نے صداقت سے محبت رکھی اور بدی سے نفرت اِسی لئے خُدا تیرے خُدا نے شادمانی کے تیل سے تُجھکو تیرے ہمسروں سے زیادہ مسح کیا ہے۔ "},
	{8, "8  تیرے ہر لِباس سے مُر اور عود اور تج کی خوُشبو آتی ہے۔ ہاتھی دانت کے محلوں میں سے تاردار سازوں نے تجھے خوُش کیا ہے۔ "},
	{9, "9  تیری مُعُزز خواتیِن میں شہزادیاں ہیں۔ ملِکہ تیرے دہنے ہاتھ اوفیِر کے سونے سے آراستہ کھڑی ہے۔ "},
	{10, "10  اَے بیٹی! سُن ۔غور کر اور کان لگا ۔ اپنی قوم اور اپنے باپ کے گھر کوبھول جا۔ "},
	{11, "11  اور بادشاہ تیرے حُسن کا مُشتاق ہو گا۔ کیونکہ وہ تیرا خُداوند ہے اُسے سِجدہ کر۔ "},
	{12, "12  اور صُور کی بیٹی ہدیہ لے کر حاضر ہو گی۔ قَوم کے دَولتمند تیری رضا جوئی کریں گے۔ "},
	{13, "13  بادشاہ کی بیٹی محل میں سرتاپا حُسن افروز ہے۔اُسکا لِباس زربفت کا ہے۔ "},
	{14, "14  وہ بِیل بوٹے دار لِباس میں بادشاہ کے حضورپہنچائی جائیگی۔ اُسکی کنواری سُہیلیاں جو اُس کے پیچھے پیچھے چلتی ہیں تیرے سامنے حاضر کی جائینگی۔ "},
	{15, "15  وہ اُن کو خُوشی اور خُرمی سے لے آئینگے وہ بادشاہ کے محل میں داخل ہوں گی ۔ "},
	{16, "16  تیرے بیٹے تیرے باپ دادا کے جانشیِن ہونگے ۔ جِنکو تُو تمام رُویِ زمین پر سردار مُقرر کریگا۔ "},
	{17, "17  میں تیرے نام کی یاد کو نسل در نسل قائم رکھوں گا۔ اِسلئے اُمتیں ابُدالاآباد تیری شُکر گُزاری کریں گی۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view46() {
struct ur46 poems[] = {
	{1, "1  خُدا ہماری پناہ اور قوت ہے۔ مُصیِبت میں مُستعِد مدد گار۔ "},
	{2, "2  اِسلئے ہم کو کچھ خُوف نہیں خواہ زمین اُ لٹ جاۓ۔اور پہاڑسمُنُدر کی تہ میں ڈال ِدۓجاہیں۔ "},
	{3, "3  خواہ اُس کا پانی شور مچاۓاورموُجزن ہو اورپہاڑ اُسکی طُغیانی سے ہل جائیں۔ "},
	{4, "4  ایک ایسا دریا ہے جس کی شاخو ں سے خُد ا کے شہر کو یعنی حق تعا لی کے مقُد س مسکن کو فرحت ہو تی ہے۔ "},
	{5, "5  خُدا اُس میں ہے۔ اُسے کبھی جبُنشِ نہ ہو گی ۔ خُدا صُبح سویرے اُسکی کمک کر ے گا ۔ "},
	{6, "6  قُو میں جھُنجلا ؑئیں۔سلطنتوں نے جُنبشِ کھائی ۔وہ بو ل اُٹھا۔ زمین پِگھل گئی۔ "},
	{7, "7  لشکروں کا خُداوند ہمارے ساتھ ہے۔ یعقُوب کا خُدا ہماری پناہ ہے۔ "},
	{8, "8  آؤ! خُداوند کے کاموںکو دیکھیں کہ اُس نے زمین پر کیا کیا ویرانیاں کی ہیں۔ "},
	{9, "9  وہ زمین کی انتہا تک جنگ موقوف کرتا ہے۔ وہ کمان کو توڑتا اور نیزے کے ٹُکڑے کر ڈالتا ہے۔ وہ رتھوں کو آگ سے جلا دیتا ہے۔ "},
	{10, "10  خاموش ہو جاؤ اور جان لو کہ میں خُدا ہوں ۔ میَں قوموں کے دِرمیان سر بلنَد ہونگا۔ "},
	{11, "11  لشکروں کا خُدا وند ہمارے ساتھ ہے۔ یعقُوب کا خُدا ہماری پناہ ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view47() {
struct ur47 poems[] = {
	{1, "1  اَے سب اُمتو! تالیاں بجاؤ۔ خُدا کے لئے خُوشی کی آواز سے للکارو۔ "},
	{2, "2  کیونکہ خُداوند تعالٰی مُہیب ہے۔وہ تمام رُویِ زمین کا شہنشاہ ہے۔ "},
	{3, "3  وہ اُمتوں کو ہمارے سامنے زیر کرے گا۔اور قومیں ہمارے قدموں تلے ہو جائینگی "},
	{4, "4  وہ ہمارے لئے ہماری میِراث کو چُنے گا ۔ جو اُس کے محبوب یعقُوب کی حشمت ہے۔ "},
	{5, "5  خُدا نے بلند آواز کے ساتھ ۔ خُداوند نے نرسِنگے کی آواز کے ساتھ صعود فرمایا۔ "},
	{6, "6  مداح سرائی کرو۔ خُدا کی مداح سرائی کرو۔ مداح سرائی کرو۔ ہمارے بادشاہ کی مداح سرائی کرو۔ "},
	{7, "7  کیونکہ خُدا ساری زمین کا بادشاہ ہے۔ عقل سے مداح سرائی کرو۔ "},
	{8, "8  خُدا قوموں پر سلطنت کرتا ہے ۔ خُدا اپنےمُقدس تخت پر بیٹھا ہے ۔ "},
	{9, "9  اُمتوں کے سردار آکٹھے ہوئے ہیں۔ تاکہ ابرہام کے خُدا کی اُمت بن جائیں ۔ کیونکہ زمین کی سپِریں خُدا کی ہیں۔ وہ نہایت بلند ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view48() {
struct ur48 poems[] = {
	{1, "1  ہما رے خُدا کے شہر میں ۔ اپنے کوِہ مقُدس پر خُدا وند بُزرگ اور بے ستا ُیش کے لالٔق ہے۔ "},
	{2, "2  شِمال کی جانب کوہِ صیُون جو بڑے بادشاہ کا شہر ہے۔ وہ بلندی میں خوشنما اور تمام زمین کا فخر ہے۔ "},
	{3, "3  اُس کے محؑلوں میں خُدا پناہ مانا جاتاہے۔ "},
	{4, "4  کیونکہ دیکھو!بادشاہ اکھٹے ؑ ہوےٗ۔ وہ مل کرگزُرے ۔ "},
	{5, "5  وہ یکھ کر دنگ ہو گےؑ۔وہ گھبرا کر بھا گے۔ "},
	{6, "6  وہاں کپکپی نے اُنکو ٓاوبایااوراَیسےدردنے جَیسادردِزہِ۔ "},
	{7, "7  توُُ پوُربی ہوا سے ترسِیس کے جہازوں کو توڑڈالتاہے۔ "},
	{8, "8  لشکروں کے شہر خُداوند کے شہر میں یعنی اپنے خُداکے شہر میں جیِسا ہم نے سنا تھا وَیسا ہی ہم نے دیکھا ۔خُداہمیشہ اُسے بر قراررکھے گا۔ "},
	{9, "9  اَے خُدا تیری ہیکل کے اندرہم نے تیر ی شفقت پر غور َ کیا ہے۔ "},
	{10, "10  اَے خُدا !جیسا تیرا نام ہے ۔ وُیسی ہی تیری سِتایش زمین کی اِنتہا تک ہے ۔تیرادہناہاتھ صداقت سے معُمور ہے ۔ "},
	{11, "11  تیرے کے سبب سے کوُہ صیُون زشادمان ہو یہوُادہ کی بیٹیاں خو شی مناُ ٔ ئیں ! "},
	{12, "12  صیُون کے گِرد پھرو اوراُسکا طواف کرو۔ اُسکے بُرجوں کو گِنو۔ "},
	{13, "13  اُسکی شہر پناہ کو خُو ب دیکھ لو۔ اُسکے محلؑوں پر غورکرو۔تاکہ تمُ ٓانے والی نسل کو اُسکی خبرردے سکو "},
	{14, "14  کیونکہ یہی خُدا ابداُ لاہماراخُداہے۔یہی موت تک ہمارا ہادی رہیگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view49() {
struct ur49 poems[] = {
	{1, "1  اَے سب اُمتو!یہ سنو۔ اَے جہان کے سب باشِندو کان لگاؤ۔ "},
	{2, "2  کیا ادنٰی کیا اعلیٰ۔ کیا امیر کیا فقیِر۔ "},
	{3, "3  میرے مُنہ سے حِکمت کی باتیں نِکلینگی اور میرے دِل کا خیال پُر خِرد ہو گا۔ "},
	{4, "4  میَں تمثِیل کی طرف کان لگاؤنگا۔میَں اپنا مُعمؑا سِتار بیان کرونگا۔ "},
	{5, "5  میَں مُصیبت کے دِنوں میں کیوں ڈروں جب میرا تعاقب کرنے والی بدی مجھے گھیرے ہو؟ "},
	{6, "6  جو اَپنی دولت پر بھروسہ رکھتے اور اپنے مال کی کثرت پر فخر کرتے ہیں۔ "},
	{7, "7  اُن میں سے کوئی کسی طرح اپنے بھائی کا فدیہ نہیں دے سکتا نہ خُدا کو اُسکا مُعاوضہ دے سکتا ہے۔ "},
	{8, "8  (کیونکہ اُنکی جان کا فدیہ گِراں بہا ہے۔ وہ ابدتک ادا نہ ہو گا)۔ "},
	{9, "9  تاکہ وہ ابدتک جِیتا رہے اور قبر کو نہ دیکھے ۔ "},
	{10, "10  کیونکہ وہ دیکھتاہے کہ دانشِمند مر جاتے ہیں۔ بیوُقُوفو حَیوان خصلت باہم ہلاک ہوتے ہیں۔اور اپنی دولت اوروں کے لئے چھوڑ جاتے ہیں۔ "},
	{11, "11  اُنکا دلی خیال یہ ہے کہ اُنکے گھر ہمیشہ تک اور اُنکے مسکن پُشت در پُشت بنے رہیں گے۔وہ اپنی زمین اپنے ہی نام سے نامزد کرتے ہیں "},
	{12, "12  پر اِنسان عزت کی حالت میں قائم نہیں رہتا۔ وہ جانوروں کی مانند ہے جو فنا ہو جاتے ہیں۔ "},
	{13, "13  اُن کا یہ طریق اُن کی حماقت ہے۔ تُو بھی اُن کےلوگ اُنکی باتوں کو پسندکرتے ہیں۔ "},
	{14, "14  وہ گویا پاتال کار یوڑٹھرائےگئے َموت اُ ن کی پا سبان ہوگی۔دِیانت دار صُبح کو اُن پر مُسلط ہوگا اور اُن کا لُقمہ ہو کر بے ٹھِکا نا ہو گا ۔ "},
	{15, "15  لیکن خُدا میری جان کو پا تال کے اِ ختیار سے چُھرا لیے گا کیونکہ وُہی مجھُے قُبو ل کرے گا۔ "},
	{16, "16  جب کو ئی مال دار ہو جائے ۔ جب اُس کے گھر کی حشمت بڑھے تو تُو خو ف نہ کر "},
	{17, "17  کیونکہ وہ مر کر کچھُ ساتھ نہ لے جائے گا َ۔ اُسکی حشمت اُس کے ساتھ نہ جائے گی ۔ "},
	{18, "18  خواہ جیتے جی وہ اپنی جان مبارک کہتا رہا ہو ۔ اور جب تُو اپنا بھلا کرتا ہے۔ تو لو گ تعرُ یف کر تے ہیں۔) "},
	{19, "19  تُو بھی وہ اپنے با پ دادا کی گر دہ سے جاملے گا ۔ وہ روشنی کو ہر گز نہ دیکھےگے۔ "},
	{20, "20  آ دمی جو عزت کی حالت میں رہتا ہےپر خِرد نہیں رکھتا جانوروں کی مانِند ہے جو فنا ہو جاتے ہیں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view50() {
struct ur50 poems[] = {
	{1, "1  رَب خُداوند خُدا نے کلام کیا اور مشرِق سے مغرِب تک دُنیا کو بُلایا۔ "},
	{2, "2  صِیوُن سے جو حُسن کا کمال ہے خُدا جلوہ گر ہؤا ہے۔ "},
	{3, "3  ہمارا خُدا آئیگا اور خاموش نہیں رہے گاآگ اُس کے آگے آگے بھسم کرتی جائیگی اور اُس کے چاروں طرف بڑی آندھی چلیگی۔ "},
	{4, "4  اپنی اُمت کی عدالت کرنے کے لئے وہ آسمان و زمین کو طلب کرے گا۔ "},
	{5, "5  کہ میرے مُقدسوں کو میرے حضور جمع کرو جنہوں نے قُربانی کے ذریعہ سے میرے ساتھ عہد باندھا ہے۔ "},
	{6, "6  اور آ سمان اُس کی صداقت بیان کریں گےکیونکہ خُدا آپ ہی اِنصاف کرنے والا ہے۔ "},
	{7, "7  اَے میری اُمت سُن ۔ میِں کلام کروں گا اور اَے اِسرائیل ! میَں تُجھ پر گواہی دُونگاخُدا۔ تیرا خُدا میَں ہی ہوں۔ "},
	{8, "8  میَں تجھے تیری قُربانیوں کے سبب سے ملامت نہین کرونگا اور تیری سوختنی قُربانیاں برابر میرے سامنے رہتی ہیں۔ "},
	{9, "9  نہ میَں تیرے گھر سے بیَل لونگا نہ تیرے باڑے سے بکرے "},
	{10, "10  کیونکہ جنگل کا ایک ایک جانور اور ہزاروں پہاڑوں کے چوَپائے میرے ہی ہیں۔ "},
	{11, "11  میَں پہاڑوں کے سب پرِندوں کو جانتا ہوں اور مَیدان کے درِندے میرے ہی ہیں۔ "},
	{12, "12  اگر میَں بھوکا ہوتا تو تجھ سے نہ کہتا کیونکہ دُنیا اور اُس کی معُموری میری ہی ہے۔ "},
	{13, "13  کیا میَں سانڈوں کا گوشت کھاؤں گا یا بکروں کا خُون پیِونگا؟ "},
	{14, "14  خُدا کے لئِے شِکرگُزاری کی قُربانی گُزارن اور حق لعا تی کے لئے اپنی منُتیں پُوری کر "},
	{15, "15  اور کے مصُیبت کے دِن فر یاد کر۔ مُیں تجھے چھڑُاؤنگا اور تُو میر ی تمجِید کر گا ۔ "},
	{16, "16  لیکن خُدا شریر سے کہتا ہے تجھے میرے آئین بیان کر نے سے کیا واسطہ اور تُو میرے عہد کو اپنی زبان پر کیو ں لاتا ہے ۔ "},
	{17, "17  جبُکہ تجھے تر بیت سے عداوت ہے ۔اور میر ی باتوں کو پیٹھ پیچھے پھیک دیتا ہے ۔ "},
	{18, "18  تُو چور کو دیکھ کر اُس سے ملِ گیا ۔اور اپنی زانیوں کا شریک رہا ہے ۔ "},
	{19, "19  تیر ے منہ سے بدی نکلتی ہے ۔ اور تیری زُبان فریب گھڑتی ہے ۔ "},
	{20, "20  تُو بیٹھا بیٹھا اپنے بھُائی کی غِیبت کرتا ہے۔ اور اپنی ماں کے بیٹے پر تُہمت لگا تا ہے ۔ "},
	{21, "21  تُو نے یہ کام کئے میں خامو ش رہا۔ تُو نے گمُا ن کیا کہ میں بِالکل تجھ سا ہوں ۔ لیکن میں نے ملا مت کر کے اِن کو تیری آنکھو ں کے سامنے تر بیب دوُگا ۔ "},
	{22, "22  اَب اَے خُدا کو بھو لنے والو! اَسے سوچ لو۔ اَیسا نہ ہو کہ تُم کو پھاڑ ڈالوں اور کوئی چھُڑانے والانہ ہو ۔ "},
	{23, "23  جوُ شکر گُزاری کی قربانی گُزرانتاہے وہ میر ی تمجید کرتا ہے اور جو اپنا چال چلن دُرست رکھتا ہے اُسکو مَیں خُداکی نجا ت دِ کھا و ٔ نگا ۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view51() {
struct ur51 poems[] = {
	{1, "1  اَے خُدا ! اپنی شفقت کے ُمُطابق مجھ پر رحم کر۔اپنی رحمت کی کژت کے مطُابق میر ی خطائیں مِٹادے "},
	{2, "2  میری بدی کو مجھُ سے دھو ڈال اور میرے گُنا ہ سے مجھُے پاک کر۔ "},
	{3, "3  کیونکہ مَیں اپنی خطاؤںکو مانتا ہُوں ۔ اور میر ا گُناہ ہمیشہ میر ے سا منے ہے ۔ "},
	{4, "4  مِیں نے فقط تیر ا ہی گنا ہ کیا ہے ۔ اور وہ کا م کیا ہے جو تیر ی نظر میں برُا ہے ۔ تاکہ تُو اپنی با تو ں میں راست ٹھہرے ۔ اور اپنی عدالت میں بے عیَب رہے ۔ "},
	{5, "5  دیکھ ! میں نے بدی میں کی صُورت پکڑی اور گناُ ہ کی حالت میں ماں کے پیٹ میں پڑا ۔ "},
	{6, "6  دیکھ تُو باطنِ کی سچائی پسند کرتا ہے ۔ اور باطِن میں مجھے ہی دانائی سکھاِ ئے گا۔ "},
	{7, "7  زُوفے سے مُجھے صاف کر تُو مُیں ہو نگا۔ مجھے دھو اور بر ف سے زیادہ سفید ہُو گا ۔ "},
	{8, "8  مُجھے خوشی اور خُر می کی خبر سُنا تاکہ وہ ہڈیاں جو تونے توڑڈالی ہیں شادمان ہو ں ۔ "},
	{9, "9  میر ے گناہو ں کی طرف سے اپنا منہ پھیر ے ۔ اور میر ی سب بدکاریاں مِٹا ڈال ۔ "},
	{10, "10  اَے خُدا ! میر ے اندرپاک دل پید ا کر اور میر ے باطنِ میں ازسر ِ نو مسُتقیمِ روُح ڈال ۔ "},
	{11, "11  مجھے ُ اپنے حضور سے خارج نہ کر ۔ اور اپنی روُح کو مجھ سے جُدا نہ کر ۔ "},
	{12, "12  اُپنی نجات کی شادمانی مجھے پھر عنایت کر اور مسُتعدرُوح سے مجھے سنبھال ۔ "},
	{13, "13  تب میَں خطاکاروں کو تیری راہیں سَکھاؤ نگا اور گہُنگار تیر ی طرف رُجوع کرینگے ۔ "},
	{14, "14  اُے خُدا !اُے میرے نجات بخش خُدامجھے خُو ن کے جُرم سے چُھڑا۔ تو میر ی زبان تیری صداقت کا گیت گا یئگی۔ "},
	{15, "15  اَے خُداوند !میرے ہونٹوں کو کھول دےتو میرے منُہ سے تیری سِتائش نِکلیگی۔ "},
	{16, "16  کیونکہ قُربانی میں تیری خُوشنو ُدی نہیں ورنہ میُں دیتا ۔ سو ختنی قُربانی سے تجھے کُچھ خُشی نہیں۔ "},
	{17, "17  شکِستہ روُح خُدا کی قُربانی ہے۔ اَے خُدا تُو شِکستہ اور خستہ دِل ھقِیر نہ جانیگا۔ "},
	{18, "18  اپنے کرم سے صِیوُن کے ساتھ بھلائی کر۔ یروشلیم کی فصِیل کو تعمیر کر۔ "},
	{19, "19  تب تُو صداقت کی قُربانیوں اور سوختنی قُرنانی اور پوُری سوختنی قُربانی سے خُوش ہو گا اور وہ تیرے مذبح پر بچھڑے چڑھائینگے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view52() {
struct ur52 poems[] = {
	{1, "1  اَے زبردست ! تُو شرارت پر کیوں ٖفخر کرتا ہے؟ خُدا کی شفقت دائمی ہے۔ "},
	{2, "2  تیری زُبان محض شرارت اِیجاد کرتی ہے ۔ اَے داغا باز! وہ تیز اُسترے کی مانند ہے۔ "},
	{3, "3  تُو بدی کو نیکی سے زیادہ پسند کرتا ہے اور جھوٹ کو صداقت کی بات سے ۔ "},
	{4, "4  اَے داغا باز زُبان!تُو مُہلک باتوں کو پسند کرتی ہے۔ "},
	{5, "5  خُداوند بھی تجھے ہمیشہ کے لئے ہلاک کر ڈالے گا۔ وہ تجھے پکڑ کر تیرے خیمہ سے نِکال پھینکے گا۔ اور زِندوں کی زمین سے تجھے اُکھاڑ پھینکے گا۔ "},
	{6, "6  صادق بھی اِس بات کو دیکھ کر ڈر جائیں گے اور اِس پر ہنسیں گے۔ "},
	{7, "7  کہ دیکھ یہ وہی آدمی ہے جِس نے خُدا کو اپنی پناہ گاہ نہ بنایا بلکہ اپنے مال کی فراوانی پر بھروسہ کیااور شرارت میں پکا ہو گیا۔ "},
	{8, "8  لیکِن میَں تو خُدا کے گھر میں زیتُون کے ہرے درخت کی مانند ہوں ۔ میرا توکل ابدلاآباد خُدا کی شفقت پر ہے۔ "},
	{9, "9  میَں ہمیشہ تیری شُکر گُزاری کرتا رہوں گا کیونکہ تو ہی نے یہ کیا ہےاور مجھے تیرے ہی نام کی آس ہو گی کیونکہ وہ تیرے مُقدسوں کے نزدیک خُوب ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view53() {
struct ur53 poems[] = {
	{1, "1  احمق نے اپنے دِل میں کہا ہے کہ کوئی خُدا نہیں۔وہ بِگڑ گئے۔ اُنہوں نے نفرت انگیز بدی کی۔ کوئی نیکوکار نہیں۔ "},
	{2, "2  خُدا نے آسمان پر سے بنی آدم پر نِگاہ کی تاکہ دیکھے کوئی دانِشمند۔ کوئی خُدا کا طالب ہے یا نہیں۔ "},
	{3, "3  وہ سب کے سب پھِر گئےہیں۔ وہ باہم نِجس ہو گئے۔ کوئی نیکوکار نہیں۔ ایک بھی نہیں۔ "},
	{4, "4  کیا اُن سب بدکاروں کو کُچھ علم نہیں جو میرے لوگوں کو ایسے کھاتے ہیں جیسے روٹی اور خُدا کا نام بھی نہیں لیتے؟ "},
	{5, "5  وہاں اُن پر بڑا خُوف چھا گیاگوخُوف کی کوئی بات نہ تھی کیونکہ خُدا نے اُن کی ہڈیاں جو تیرے خلاف خیمہ زن تھے بکھیر دیں تُو نے اُن کو شرمِندہ کر دِیا۔اِس لئے کہ خُدا نے اُن کو رد کر دیاہے۔ "},
	{6, "6  کاشکہ اِسرائیل کی نِجات صیُون میں سے ہوتی! جب خُدا اپنے لوگوں کو اِسیری سے لُوٹالائیگا تو یعقُوب خُوش اور اِسرائیل شادمان ہو گا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view54() {
struct ur54 poems[] = {
	{1, "1  اَے خُدا اپنے نام کے وسیِلہ سے مجھے بچا اور اپنی قُدرت سے میرا اِنصاف کر "},
	{2, "2  اَے خُدا! میری دُعا سُن لے۔ میرے مُنہ کی باتوں پر کان لگا ۔ کیونکہ بیَگانے میرے خلاف اُٹھے ہیں اور تُند خُو میری جان کےخواہاں ہوئے ہیں۔اُنہوں نے خُدا کو اپنے رُوبرو نہیں رکھا۔ "},
	{3, "4  دیکھو! خُدا میرا مدد گار ہےخُداوند میری جان کو سنبھالنے والوںمیں ہے۔ "},
	{4, "5  وہ بُرائی کو میرے دُشمنوں ہی پر لُوٹا دیگا۔تُو اپنی سچائی کی ُرو سے اُن کو فنا کر۔ "},
	{5, "6  میَں تیرے حضور رضا کی قُربانی چڑھاؤں گا۔اَے خُداوند! میَں تیرے نام کی شُکرگزاری کرُونگاکیونکہ وہ خُوب ہے۔ "},
	{6, "7  کیونکہ اُس نے مُجھے سب مُصیبتوں سے چھُڑایا ہےاور میری آنکھ نے میرے دُشمنوں کو دیکھ لِیا ہے۔ Print this page "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view55() {
struct ur55 poems[] = {
	{1, "1  اَے خُدا! میری دُعا پر کان لگااور میری منِت سے مُنہ نہ پھیر۔ "},
	{2, "2  میری طرف مُتوجِہ ہو اور مجھے جواب دے۔ میَں غم سے بَیقرار ہو کر کراہتا ہوں۔ "},
	{3, "3  دُشمن کے آوازہ سے اور شریر کے ظلُم کے باعث کیونکہ وہ مجھ پر بدی لادتے اور قہر میں مجھے ستاتے ہیں۔ "},
	{4, "4  میرا دِل مجھ میں بیتاب ہے اور مات کا ہَول مجھ پر چھا گیا ہے۔ "},
	{5, "5  خُوف اور کپکپی مجھ پر طاری ہے۔ ہیبَت نے مجھے دبا لیِا ہے۔ "},
	{6, "6  اور میَں نے کہا کاشکہ کبُوتر کی طرح میرے پر ہوتے تو میَں اُڑ جاتا اور آرام پاتا!۔ "},
	{7, "7  پھِر تو میں دُور نِکل جاتا اور بیابان میں بسیرا کرتا۔ "},
	{8, "8  میَں آندھی کے جھوکے اور طُوفان سے کِسی پناہ کی جگہ میں بھاگ جاتا۔ "},
	{9, "9  اَے خُداوند! اُنکو ہلاک کر اور اُن کی زُبان میں تفرقہ ڈال کیونکہ میَں نے شہر میں ظُلم اور جھگڑا دیکھا ہے۔ "},
	{10, "10  دِن رات وہ اُسکی فصیِل پر گشت لگاتے ہیں۔ بدی اور فساد اُسکے اندرہیں۔ "},
	{11, "11  شرارت اُس کے بیچ میں بسی ہوئی ہے۔ستِم اور فریب اُسکے کوچوں سے دُور نہیں ہوتے۔ "},
	{12, "12  جِس نے مجھے ملامت کی وہ دُشمن نہ تھا ورنہ میَں اُس کو برداشت کر لیتا اور جِس نے میرے خلاف تکبُر کیا وہ مجھ سے عداوت رکھنے والا نہ تھا نہیں تو میَں اُس سے چھِپ جاتا۔ "},
	{13, "13  بلکہ وہ تو تُو ہی تھا جو میرا ہمسر میرا رفیِق اور دِلی دوست تھا۔ "},
	{14, "14  ہماری باہمی گفُتگو شیرین تھی اور ہُجُوم کے ساتھ خُدا کے گھر میں پھرتے تھے۔ "},
	{15, "15  اُنکو مَوت اچانک آدبائے۔ وہ جیتے جی پاتال میں اُتر جائیں کیونکہ شرارت اُنکے مسکنوں میں اور اُنکے اندر ہے۔ "},
	{16, "16  پر میَں تو خُدا کو پُکاروں گا اور خُداوند مجھے بچا لے گا۔ "},
	{17, "17  صُبح و شام اور دوپہر کو میَں فریاد کرونگا اور کراہتا رہونگا اور وہ میری آواز سُن لیگا۔ "},
	{18, "18  اُس نے اُس لڑائی سے جو میرے خلاف تھی میری جان کو سلامت چھُڑا لیا۔ کیونکہ مجھ سے جھگڑا کرنے والے بہت تھے۔ "},
	{19, "19  خُدا جو قدیم سے ہے سُن لے گا اور اُنکو جواب دیگا۔ یہ وہ ہیں جِنکے لئے اِنقلاب نہیں اور جو خُدا سے نہیں ڈرتے ۔ "},
	{20, "20  اُس شخص اَیسوں پر ہاتھ بڑھایا ہے جو اُس سے صُلح رکھتے تھے۔ اُس نے اپنے عہد کو توڑ دِیا ہے۔ "},
	{21, "21  اُسکا مُنہ مکھن کی ماننِد چِکنا تھا پر اُس کے دِل میں جنگ تھی۔اُسکی باتیں تیل سے زیادہ مُلائم پر ننگی تلواریں تھیں۔ "},
	{22, "22  اپنا بوجھ خُداوند پر ڈالدے۔ وہ تھے سنبھالے لیگا۔ وہ صادق کو کبھی جُنبش نہ کھانے دیگا۔ "},
	{23, "23  لیکن اَے خُدا! تُو اُنکو ہلاکت کے گڑھے میں اُتاریگا۔ خُونی اور دغا باز اپنی آدھی عُمر تک جیِتے نہ رہینگے پر میَں تجھ پر توکُل کرونگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view56() {
struct ur56 poems[] = {
	{1, "1  اَے خُدا مجھُ پر رحم فرما کیونکہ اِنسان مجھُے نکلنا چاہتا ہے ۔ وہ دِن پھر لڑکر مجھُے ستاتا ہے ۔ "},
	{2, "2  میر ے دُشمن دِن بھر مجھے نگلنا چا ہتے ہیں ۔ کیو نکہ جوُ غُرور کر کے مجھُ سے لڑ تے ہیں ۔ "},
	{3, "3  جِسں وقت مجھے ڈر لگے گا۔ میَں تجھ پر تُو کل کرُوں گا ۔ "},
	{4, "4  میر ا فخر خُدا پر اور اُسکے کلام پر ہے ۔ میرا تُو کل خُدا پر ہے ۔ میں ڈر نے کا نہیں ۔بشر میرا کیا کر سکتا ہے ؟ "},
	{5, "5  وہ ِن بھر میر ی باتوں کو مر وڑ تے رہتے ہیں ۔ اُن کے خیال سراسر یہی ہیں کہ سے بدی کر یں ۔ "},
	{6, "6  وہ اکٹھے ہو کر چھپ جاتے ہیں ۔ وہ میر ے نقش قدم کو دیکھتے بھالتے ہیں ۔ کیو نکہ وہ میری جان کی گھات میں ہیں ۔ "},
	{7, "7  کیا وہ بدکار ی کر کے بچ جائے گے ؟ اَے خُدا قہر میں اُمتوں کو گرا دے ۔ "},
	{8, "8  میر ی آورگی کا حساب رکھتا ہے ۔ میر ے آنسُووںکو میر ے اپنے مشکِیزہ میں رکھ لے ۔ کیا وہ تیر ی کتا ب میں مند رج نہیں ہیں ؟ "},
	{9, "9  تب تُو جسں دِ ن میں فریاد کر وُں گا میر ے دُشمن پسپا ہو نگے مجھُے یہ معُلوم ہے کہ خُدا میر ی طر ف ہے ۔ "},
	{10, "10  میرا فخر خُدا پر اور اُس کے کلا م پر ہے ۔ "},
	{11, "11  میرا تُوکل خُدا پر ہے ۔میَں ڈر نے کا نہیں ۔ا نسان میر ا کیا کر سکتا ہے ؟ "},
	{12, "12  اَے خُدا !تیری مِنتیں مجھ پر ہیں۔میَں تیر ے حضُور شُکر گُزاری کی قُر بانیا ں گُزرانُو ں گا ۔ "},
	{13, "13  کیو نکہ تُو نے میر ی جان کو مو ت سے چُھڑایا۔کیا تُو نے میر ے پاوؑں کو پِھسلنے سے نہیں بچایا تاکہ میں خُدا کے سامنے زِ ندوں کے نُور میں چُلو ں ؟ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view57() {
struct ur57 poems[] = {
	{1, "1  مجھُ پر رحم کر اَ ے خُدا ! مجھُ پر رحم کر کیو نکہ میر ی جان تیر ی پناہ لیتی ہے میَں تیر ے َپر وں کے سا یہ میں پناہ لُو ں گا ۔ جِب تک یہ آفتیں گُزر نہ جائیں "},
	{2, "2  میں خُدا تعالی سے فر یا د کرُوں گا ۔ خُدا سے جو میر ے لئے سب کچھ کر تا ہے۔ "},
	{3, "3  وہ میر ی نجا ت کے لئے آسمان سے بھیجےگا ۔ جب وہ مجھے نگِلنا چا ہتا ہے ۔ ملا مت کر تا ہو ۔ خُدا اپنی شفقت اور سچائی کو بھیجے گا۔ "},
	{4, "4  میر ی جان ببر و ں کے درمیان ہے ۔ میِں آ تش مزاج لوگو ں میں پڑا ہوں یعنی اَیسے لو گو ں میں جِنکے دانت بر چھیا ں اور تِیر ہیں ۔ جنِکی زبا ِن تیز تلو ار ہے ۔ "},
	{5, "5  اَے خُدا تُو آسما ن پر سر فراز ہو ! تیر ا جلا ل سار ی زمین پر ہو ! "},
	{6, "6  اُنہو ں نے میر ے پاؤں کے لئے جال لگا یا ہے ۔ میر ی جان عا جز آ گئی ۔ اُنہو ں نے میر ے آ گے گڑ ھا کھو دا ۔ وہ خُو د میں گرِ پڑ ے "},
	{7, "7  میرا د ل قائم ہے ۔ اَے خُدا میر ا دل قا ئم ہے ۔ میں گا وؑ ں گا ۔ بلکہ میں مدح سر ائی کرُو ں گا۔ "},
	{8, "8  اَے میر ی شو کت !بیِدار ہو ۔ اَے بر بط اور سِتار جاگو ۔ میَں خُود صُبح سو یر ے جاگ اُٹھو ں گا ۔ "},
	{9, "9  اَے خُداوند ! میںِ لوگو ں میں تیر ا شُکر کرؤں گا ۔میں اُمتو ں میں تیر ی مد ح سُر ائی کرُؤں گا ۔ "},
	{10, "10  کیو نکہ تیر ی شفقت آسما ن کے اور تیر ی افلا ک کے بر ابر بلند ہے ۔ "},
	{11, "11  اَے خُدا تُو آسما ن پر سر فراز ہو! تیر ا جلال سا ر ی زمین پر ہو! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view58() {
struct ur58 poems[] = {
	{1, "1  اَے بُزرُگو ! کیا تم در حقیِقت راستگوئی کرتے ہو؟اَے بنی آدم! کیا تُم ٹھیک عدالت کرتے ہو؟ "},
	{2, "2  بلکہ تُم تو دِل ہی دِل میں شرارت کرتے ہو اور زمین پر اپنے ہاتھوں سے ظلُم پَیمائی کرتے ہو۔ "},
	{3, "3  شریرپیدایش ہی سے کجروی اِختیار کرتے ہیں ۔ وہ پیدا ہوتے ہیں جھُوٹ بولکر گُمراہ ہو جاتے ہیں۔ "},
	{4, "4  اُنکا زہر سانپ کا زہر ہے۔ وہ بہرے افعی کی مانِند ہیں جو کان بند کرلیتا ہے۔ "},
	{5, "5  جو منتر پڑھنے والوں کی آواز ہی نہیں سُنتا خُواہ وہ کِتنی ہی ہوشیاری سے منتر پڑھیں۔ "},
	{6, "6  اَے خُدا ! تُو اُنکے دانت اُن کے مُنہ میں توڑ دے ۔ اَے خُدا وند ! ببر کے بچوں کی ڈاڑھیں توڑ ڈال ۔ "},
	{7, "7  وہ گُھلکر بہتے پانی کی ماننِد ہو جائیں۔ جب وہ اپنے تیر چلائیں تو گویا کُندپیَکان ہوں۔ "},
	{8, "8  وہ اَیسے ہو جائیں جَیسے گھونگا گلکر فنا ہو جاتا ہےاور جَیسے عورت کا اسقاط جِس نے سورج کودیکھا ہی نہیں۔ "},
	{9, "9  اِس سے پہلے کہ تمہاری ہانڈیوں کانٹوں کی آنچ لگے وہ ہرے اور جلتے دونوں کو یکساں بگولے سے اُڑا لے جائیگا۔ "},
	{10, "10  صادِق اِنتقام کو دیکھ کر خُوش ہو گا۔وہ شریر کے خُون سے اپنے پاؤں تر کرے گا۔ "},
	{11, "11  تب لوگ کہینگے یقِیناصادِق کے لئے اجر ہے۔بے شک خُدا ہے جو زمین پر عدالت کرتا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view59() {
struct ur59 poems[] = {
	{1, "1  اَ ے میر ے خُدا ! مجھےُ میر ے دُشمنو ں سے چھڑ ُا۔ مجھے میر ے خلا ِ ف اُٹھنے والوں پر سر فراز کر ۔ "},
	{2, "2  مجُھے بد کرداروں سے چُھڑا اور خُونخوار آ دمیو ں سے مجُھے بچا ۔ "},
	{3, "3  کیو نکہ دیکھ ! وہ میر ی جان کی گھا ت میں ہیں ۔اَے خُداوند !میر ی خطا یا میرے گنُاہ کے بغَیر زبردست لوگ میرے خِلاف اِکٹھے ہوتے ہیں ۔ "},
	{4, "4  وہ مجھ بے قصُور پر دوڑ دوڑ کر تیار ہوتے ہیں میری کُمک کے لئے جاگ اور دیکھ! "},
	{5, "5  اَے خُداوند لشکروں کے خُدا۔ اِسرائیل کے خُدا! سب قوموں کے مُحاسبہ کے لئے اُٹھ ۔کسی دغا باز خطاکار پر رحم نہ کر۔ "},
	{6, "6  وہ شام کو لوٹتے اور کتُے کی طرح بھَونکتے ہیں اور شہر کے گِرد پھیرتے ہیں ۔ "},
	{7, "7  دیکھ !وہ اپنے مُنہ سے ڈکارتے ہیں۔ اُن کے لبوں کے اندر تلواریں ہیں۔ کیونکہ وہ کہتے ہیں کون سُنتا کے؟ "},
	{8, "8  پر اَے خُداوند! تُو اُن پر ہنسے گا۔ تُو تمام قوموں کو ٹھٹھوں میں اُڑائے گا۔ "},
	{9, "9  اَے میری قوت! مجھے تیری ہی آس ہو گی کیونکہ خُدا میرا اُنچا بُرج ہے ۔ "},
	{10, "10  میرا خُدا شفقت سے میرا پیشرو ہوگا۔خُدا مُجھے میرے دُشمنوں کی پستی دیکھائے گا۔ "},
	{11, "11  اُن کو قتل نہ کر مبادا میرے لوگ بھول جائیں۔ اَے خُداوند! اَے ہماری سِپر اپنی قُدرت سے اُن کو پراگندہ کر کے پست کر دے۔ "},
	{12, "12  وہ اپنے مُنہ کے گناہ اور اپنے ہونٹوں کی باتوں اور اپنی لعن طعن اور جھوٹ بولنے کے باعث اپنے غرور میں پکڑے جائیں۔ "},
	{13, "13  قہَر میں اُن کو فنا کر دے۔ فنا کر دے تاکہ وہ نابود ہو جائیں اور وہ زمین کی انتہا تک جان لیں ۔ کہ خُدا یعقُوب پر حُکمران ہے۔ "},
	{14, "14  پھِر شام کو وہ لوٹے اور کُتے کی طرح بھونکیں اور شہر کے گِرد پھیریں۔ "},
	{15, "15  وہ کھانے کی تلاش میں مارے مارے پھیریں اور اگر آسودہ نہ ہوں تو ساری رات ٹھہرے رہیں۔ "},
	{16, "16  لیکن میں تیری قُدرت کا گیت گاؤنگا بلکہ صُبح کو بُلند آواز سے تیری شفقت کا گیت گاؤنگا کیونکہ تو میرا اُنچا بُرج ہے اور مُصیبت کے دِن میری پناہ گاہ۔ "},
	{17, "17  اَے میری قوت! میَں تیری مدح سرائی کروں گاکیونکہ خُدا میرا شفیق خُدا میرا اُونچا بُرج ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view60() {
struct ur60 poems[] = {
	{1, "1  اَے خُدا ! تُو نے ہمیں رد کیا تُو نے ہمیں شِکستہ حال کر دیا۔ تُو ناراض رہا ۔ ہمیں پھر بحال کر۔ "},
	{2, "2  تُو نے زمین کو لرزا دیا۔ تُو نے اُسے پھاڑ ڈالا ہے۔ اُسکے رخنے بند کر دے کیونکہ وہ لرزان ہے۔ "},
	{3, "3  تُو نے اپنے لوگوں کو سختیاں دکھائیِں ۔تُو نے ہم کو لڑکھڑا دینے والی مے پِلائی۔ "},
	{4, "4  جو تجھ سے ڈرتے ہیں تُو نے اُنکو جھنڈا دیا ہے۔ تاکہ وہ حق کی خاطر بُلند کیا جائے ۔ "},
	{5, "5  اپنے دہنے ہاتھ سے بچا اور ہمیں جواب دے تاکہ تیرے محبوب بچائے جائیں ۔ "},
	{6, "6  خُدا نے اپنی قُدوُسیت میں فرمایا ہے میَں خُوشی کروں گا۔ میَں سِکم کو تقسیم کروں گا اور سُکات کی وادی کو بانٹونگا۔ "},
	{7, "7  جِلعاؔد میرا ہے منؔسیّ بھی میرا ہے۔اِفرائیمؔ میرے سر کا خود ہے یہوؔداہ میرا عصا ہے۔ "},
	{8, "8  موآؔب میری چلپچی ہے۔ ادوؔم پر میَں جوتا پھینُکونگا۔اَے فِلستیؔن ! میرے سبب سے للکار۔ "},
	{9, "9  مجھے اُس محُکم شہر میں کون پہُنچائگا؟ کوَن مجھے ادوؔم تک لے گیا ہے؟ "},
	{10, "11  مُخالِف کے مُقابلہ میں ہماری کمک کر کیونکہ اِنسانی مدد عبث ہے۔ "},
	{11, "12  خُدا کی مدد سے ہم بُہادری کریں گے۔ کیونکہ وہی ہمارے مُخالِفوں کو پامال کریگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view61() {
struct ur61 poems[] = {
	{1, "2  میَں اپنی افسُردہ دِلی میں زمین کی انتہا سے تجھے پُکارونگا۔ تُو مجھے اُس چٹان پر لے چل جو مجھ سے اُونچی ہے۔ "},
	{2, "3  کیونکہ تُو میری پناہ راہ ہے اور دُشمن سے بچنے کے لئے اُونچا بُرج۔ "},
	{3, "5  کیونکہ اَے خُدا تُو نے میری منّتیں قبول کی ہیں۔تُو نے مجھے اُن لوگوں کی سی مِیراث بخشی ہے جو تیرے نام سے ڈرتے ہیں۔ "},
	{4, "6  تُو بادشاہ کی عُمر دراز کرے گا ۔ اُسکی عُمر بُہت سی پُشتوں کے برابر ہو گی۔ "},
	{5, "7  وہ خُدا کے حضُور ہمیشہ قائم رہے گا۔ تُو شفقت اور سچّائی کو اُسکی حِفاظت کے لئے مُہیا کر۔ یوں میَں ہمیشہ تیری مدح سرائی کرونگا تاکہ روزانہ اپنی منّتیں پوری کروں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view62() {
struct ur62 poems[] = {
	{1, "1  میری جان کو خُدا ہی کی آس ہے۔میری نِجات اُسی سے ہے۔ "},
	{2, "2  وُہی اکیلا میری چٹان اور میری نجات ہے۔ وہی میرا اُنچا بُرج ہے۔ مجھے زیادہ جُنبش نہ ہو گی۔ "},
	{3, "3  تُم کب تک اَیسے شخص پر حملہ کرتے رہو گےجو جھُکی ہوئی دیوار اور ہِلتی ہوئی باڑ کی مانِند ہے تاکہ سب مِل کر اُسے قتل کرو؟ "},
	{4, "4  وہ اُسکو اُسکے مرتبہ سے گِرا دینے ہی کا مشورہ کرتے رہتے ہیں۔وہ جھوٹ سے خُوش ہوتے ہیں۔ وہ اپنے مُنہ سے تو برکت دیتے ہیں پر دِل میں لعنت کرتے ہیں۔ "},
	{5, "5  اَے میری جان خُدا ہی کی آس رکھ کیونکہ اُسی سے مجھے اُمید ہے۔ "},
	{6, "6  وہی اکیلامیری چٹان اور میری نجات ہے۔ وہی میرا اُونچا بُرج ہے مجھے جُنبش نہ ہو گی۔ "},
	{7, "7  میری نجات اور میری شوکت خُدا کی طرف سے ہے۔ خُدا ہی میری قوت کی چٹان اور میری پناہ ہے۔ "},
	{8, "8  اَے لوگو! ہر وقت اُس پر توکُل کرو۔اپنے دِل کا حال اُسکے سامنے کھول دو۔ خُدا ہماری پناہ گاہ ہے۔ "},
	{9, "9  یقِیناً ادنٰی لوگ بے ثبات اور اعلیٰ آدمی چھوٹے۔ وہ ترازُو میں ہلکے نِکلینگے۔ وہ سب کے سب بے ثباتی سے بھی ہیچ ہیں۔ "},
	{10, "10  ظلُم پر تکیہ نہ کرو۔ لوُٹ مار کرنے پر نہ پھوُلو۔اگر مال بڑھ جائے تو اُس پر دِل نہ لگاؤ۔ "},
	{11, "11  خُدا نے ایک بار فرمایا میَں نے دو بار سُنا کہ قُدرت خُدا ہی کی ہے۔ "},
	{12, "12  شفقت بھی اَے خُداوند! تیری ہی ہے کیونکہ تو ہر شخص کو اُسکے عمل کے مُطابِق بدلہ دیتا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view63() {
struct ur63 poems[] = {
	{1, "1  اَے خُدا ! تُو میرا خُدا ہے۔ میَں دِل سے تیرا طالِب ہونگا۔خُشک اور پیاسی اور میرا جِسم تیرا مُشتاق ہے۔ "},
	{2, "2  اِس طرح میَں نے مقدِس میں تجھ پر نِگاہ کی تاکہ تیری قُدرت اور حشمت کو دیکھُوں "},
	{3, "3  کیونکہ تیری شفقت زندگی سے بہتر ہے۔میرے ہونٹ تیری تعریف کریں گے۔ "},
	{4, "4  اِسی طرح میَں عُمر بھر تجھے مُبارِک کہونگا۔ اور تیرا نام لے کر اپنے ہاتھ اُٹھایا کروں گا۔ "},
	{5, "5  میری جان گویا گُودے اور چربی سے سیر ہو گی۔ اور میرا مُنہ مسرُور لبوں سے تیری تعریف کریگا۔ "},
	{6, "6  جب میَں بِستر پر تجھے یاد کرُونگا اور رات کے ایک ایک پہر میں تجھ پر دھیان کروُنگا۔ "},
	{7, "7  اِسلئے کہ تُو میرا مدد گار رہا ہے اور میَں تیرے پروں کے سایہ میں خُوشی مناؤنگا۔ "},
	{8, "8  میری جان کو تیری ہی دُھن ہے۔تیرا دہنا ہاتھ مجھے سنبھالتا ہے۔ "},
	{9, "9  پر جو میری جان کی ہلاکت کے دَرپے ہیں وہ زمین کے اسفل میں چلے جائینگے۔ "},
	{10, "10  وہ تلوار کے حوالہ ہونگے۔ وہ گیِدڑوں کا لُقمہ بنینگے۔ "},
	{11, "11  لیکن بادشاہ خُدا میں شادمان ہوگا۔ جواُسکی قسم کھاتا ہے وہ فخر کریگا کیونکہ جھُوٹ بولنے والوں کا مُنہ بند کردِیا جائیگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view64() {
struct ur64 poems[] = {
	{1, "1  اَے خُدا! میری فریاد کی آواز سُن لے۔میری جان کو دُشمن کے خُوف سے بچائے رکھ۔ "},
	{2, "2  شرِیروں کے خُفیہ مشورہ سے اور بدکاروں کے ہنگاموں سے مجھے چھُپالے "},
	{3, "3  جِنہوں نے اپنی زُبان تلوار کی تیز کی اور تلخ باتوں کے تیروں کا نِشانہ لیا ہے۔ "},
	{4, "4  تاکہ اُنکو خُفیہ مقاموں میں کامِل آدمی پرچلائیں ۔وہ ُن کو ناگہان اُس پر چلاتے ہیں اور ڈرتے نہیں۔ "},
	{5, "5  وہ بُرے کام کا مُصمّم اِرادہ کرتے ہیں۔وہ پھندے لگانے کی صلاح کرتے ہیں۔وہ کہتے ہیں ہم کو کوَن دیکھیگا؟ "},
	{6, "6  وہ شرارتوں کو کھوج کھوج کر نِکالتے ہیں۔وہ کہتےہیں ہم نے خُوب کھوج لگایا۔اُن میں سے ہر ایک کا باطِن اور دِل عمِیق ہے۔ "},
	{7, "7  لیکن خُدا اُن پر تیر چلائیگا۔وہ ناگہان تیِرسے زخمی ہو جائینگے۔ "},
	{8, "8  اور اُن ہی کی زُبان اُنکو تباہ کریگی۔جِتنے اُنکو دیکھینگے سب سر ہلائینگے۔ "},
	{9, "9  اور سب لوگ ڈر جائینگے اور خُدا کے کام کا بیان کرینگے اور اُسکے طریِق عمل کو بخوُبی سمجھ لینگے۔ "},
	{10, "10  صادق خُداوند میں شادمان ہوگا اور اُس پر توکُل کریگا اور جِتنے راست دِل ہیں سب فخر کرینگے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view65() {
struct ur65 poems[] = {
	{1, "1  اَے خُدا! صِیوُؔن میں تعریف تیری مُنتظر ہے۔ اور تیرے لئے منّت پُوری کی جائیگی۔ "},
	{2, "2  اَے دُعا کے سُننے والے! سب بشر تیرے پاس ٓئینگے۔ "},
	{3, "3  بد اعمال مجھ پر غالب آجاتے ہیں پر ہماری خطاؤں کا کفّارہ تُو ہی دیگا۔ "},
	{4, "4  مُبارِک ہے وہ آدی جِسے تُو برگزِیُدہ کرتا اور اپنے پاس آنے دیتا ہے۔تاکہ وہ تیری بارگاہوں میں رہےہم تیرے گھر کی خُوبی سے یعنی تیری مُقّدس ہیَکل سے آسودہ ہونگے۔ "},
	{5, "5  اَے ہمارے نجات دینے والے خُدا! تُوجو زمین کے سب کناروں کا اور سُمندر پر دُور دُور رہنے والوں کا تکیہ ہے؟ خوُفناک باتوں کے ذریعہ سے تُو ہمیں صداقت سے جواب دیگا۔ "},
	{6, "6  تُو قُدرت سے کمر بستہ ہو کر اپنی قُوت سے پہاڑوں کو اِستحکام بخشتا ہے۔ "},
	{7, "7  تُو سُمندر کے اور اُسکی مَوجوں کے شور کواور اُمتوں کے ہنگامہ کو مَوقوُف کرےدیتا ہے۔ "},
	{8, "8  زمین کی اِنتہا کے رہنے والے تیرے معُجزوں سے ڈرتے ہیں۔تُو مطلعِ صُبح کو اور شام کو شادمانی بخشتا ہے۔ "},
	{9, "9  تُو زمین پر تُوجہ کر کے اُسے سیراب کرتا ہے۔ تُو اُسے خُوب مالامال کر دیتا ہے۔ خُدا کا دریا پانی سے بھرا ہے۔جب تُو زمین کو یوں تیار کر لیتا ہےتو اُنکے لِئے اناج مُہیا کرتا ہے۔ "},
	{10, "10  تُو اُسکی ریگھاریوں کو خُوب سیراب کرتا اور اُسکی مینڈوں کو بِٹھا دیتا ہے۔ تُو اُسے بارِش سے نرم کرتا ہے اور اُسکی پَیداوار میں برکت دیتا ہے۔ "},
	{11, "11  تُو سال اپنے لُطف کا تاج پہنانا ہے۔اور تیری راہوں سے رَوغن ٹپکتا ہے۔ "},
	{12, "12  وہ بِیابان کی چراگاہوں پر ٹپکتا ہے اور پہاڑیاں خُوشی سے کمر بستہ ہیں۔ "},
	{13, "13  چراگاہوں میں جھُنڈ پھیلے ہُوئے ہیں۔وادیاں اناج سے ڈھکی ہُوئی ہیں۔وہ خُوشی کے مارے للکارتی اور گاتی ہیں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view66() {
struct ur66 poems[] = {
	{1, "1  اَے ساری زمین! خُدا کے حضور خُوشی کا نعرہ مار۔ "},
	{2, "2  اُسکے نام کے جلال کا گیت گاؤ۔ سِتایش کرتے ہوئے اُسکی تمجیِد کرو۔ "},
	{3, "3  خُدا سے کہو تیرے کام کیا ہی مُہیب ہیں! تیری بڑی قُدرت کے باعث تیرے دُشمن عاجزِّی کرینگے۔ "},
	{4, "4  ساری زمین تجھے سِجدہ کرے گی اور تیرے حضور گائیگی۔ وہ تیرے نام کے گیت گائیں گے۔ "},
	{5, "5  آؤ اور خُدا کے کاموں کو دیکھو۔بنی آدم کے ساتھ وہ سُلوُک میں مُہیِب ہے۔ "},
	{6, "6  اُس نے سُمندرکو خُشک زمین بنا دیا۔ وہ دریا میں سے پیَدل گُذر گئے۔وہاں ہم نے اُس میں خُوشی منائی۔ "},
	{7, "7  وہ اپنی قُدرت سے ابدتک سلطنت کرے گا۔اُسکی آنکھیں قُوموں کو دیکھتی رہتی ہیں۔سرکش لوگ تکبُر نہ کریں۔ "},
	{8, "8  اَے لوگو! ہمارے خُدا کو مُبارک کہو اور اُسکی تعریف میں آ واز بُلند کرو۔ "},
	{9, "9  وہی ہماری جان کو زِندہ رکھتا ہےاور ہمارے پاؤں کو پھسلنے نہیں دیتا۔ "},
	{10, "10  کیونکہ اَے خُدا! تُو نے ہمیں آزما لیا ہے۔تُو نے ہمیں اِیسا تایا جَیسے چاندی تائی جاتی ہے۔ "},
	{11, "11  تُو نے ہمیں جال میں پھنسایا اور ہماری کمر پر بھاری بوجھ رکھا۔ "},
	{12, "12  تُو نے سواروں کو ہمارے سروں پر سے گُذارا۔ہم آگ میں سے اور پانی میں سے ہو کر گُذرے لیکن تُو ہمکو فراوانی کی جگہ میں نِکال لایا۔ "},
	{13, "13  میَں سوختنی قُربانیاں لیکر تیرے گھر میں داخل ہونگا۔اور اپنی منّتیں تیرے حضور ادا کرونگا۔ "},
	{14, "14  جو مُصیِبتکے وقت میرے لبوں سے نِکلیں اور میَں نے اپنے مُنہ سے مانیں۔ "},
	{15, "15  میَں موٹے موٹے جانوروں کی سوختنی قُربانیاں مینڈھوں کی خوُشبو کے ساتھ چڑھاؤنگا۔میَں بَیل اور بکرے گُذرانونگا۔ "},
	{16, "16  اَے خُدا سے ڈرنے والو! سب آؤ۔ سنو اور میَں بتاؤن گا کہ اُس نے میری جان کے لئے کیا کیا کیِا ہے۔ "},
	{17, "17  میَں نے اپنے مُنہ سے اُسکو پُکارا۔ اُس کی تمجید میری زُبان سے ہوئی۔ "},
	{18, "18  اگر میَں بدی کو اپنے دِل میں رکھتا تُو خُداوند میری نہ سُنتا۔ "},
	{19, "19  لیکن خُدا نے یقیناً سُن لیا ہے۔ اُس نے میری دُعا کی آواز پر کان لگایا ہے۔ "},
	{20, "20  خُدا مُبارِک ہو جِس نے نہ تو میری دُعا کو ردّ کیا اور نہ اپنی شفقت کو مجھ سے باز رکھا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view67() {
struct ur67 poems[] = {
	{1, "1  خُدا ہم پر رحم کرے اور ہمکو برکت بخشے اور اپنے چہرے کو ہم پر جلوہ گر فرمائے۔ "},
	{2, "2  تاکہ تیری راہ زمین پر ظاہر ہو جائے اور تیری نجات سب قُوموں پر۔ "},
	{3, "3  اَے خُدا لوگ تیری تعریف کریں۔ سب لوگ تیری تعریف کریں۔ "},
	{4, "4  اُمتیں خُوش ہوں اور خُوشی سے للکاریں کیونکہ تو راستی سے لوگوں کی عدالت کرے گا اور زمین کی اُمتوں ہر حکومت کرے گا۔ "},
	{5, "5  اَے خُدا! لوگ تیری تعریف کریں۔ سب لوگ تیری تعریف کریں۔ "},
	{6, "6  زمین نے اپنی پیداوار دےدی۔ خُدا یعنی ہمارا خُدا ہم کو برکت دے گا۔ "},
	{7, "7  خُدا ہم کو برکت دے گا اور زمین کی انتہا تک سب لوگ اُس کا ڈر مانینگے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view68() {
struct ur68 poems[] = {
	{1, "1  خُدا اُٹھے۔ اُسکے دُشمن پراگندہ ہوں۔ اُس سے عداوت رکھنے والے اُسکے سامنے سے بھاگ جائیں۔ "},
	{2, "2  جَیسے دُھواں اُڑ جاتا ہے وَیسے ہی تُو اُن کو اُڑا دے۔ جَیسے موم آگ کے ساتھ پِگھل جاتا ہے وَیسے ہی شریر خُدا کے حضور فنا ہو جائیں ۔ "},
	{3, "3  لیکن صادِق خُوشی منائیں۔وہ خُدا کے حضور شادمان ہوںبلکہ وہ خُوشی سے پھولے نہ سمائیں۔ "},
	{4, "4  خُدا کے لئے گاؤ۔ اُسکے نام کی مدح سرائی کرو۔ صحرا کے سوار کے لئے شاہراہ تیار کرو۔اُس کا نام یاہؔ ہے اور تم اُسکے حضور شادمان ہو۔ "},
	{5, "5  خُدا اپنے مُقدس مکان میں یتیموں کا باپ اور بیواؤں کا دادرس ہے۔ "},
	{6, "6  خُدا تنہا کو خاندان بخشتا ہے۔وہ قیدیوں کو آزاد کر کے اِقبالمند کرتا ہے۔لیکن سر کش خُشک زمین میں رہتے ہیں۔ "},
	{7, "7  اَے خُدا! جب تُو اپنے لوگوں کے آگے آگے چلا۔ جب تو بیابان میں سے گُذرا "},
	{8, "8  تو زمین کانپ اُٹھی۔ خُدا کے حضور آسمان گِر پڑے۔ بلکہ کوہ سیناؔ بھی خُدا کے حضور۔ اِسرائؔیل کے خُدا کے حضور کانپ اُٹھا۔ "},
	{9, "9  اَے خُدا تُو نے خُوب مینہ برسایا۔ تُو نے خُشک میراث کو تازگی بخشی۔ "},
	{10, "10  تیرے لوگ اُس میں بسنے لگے۔ اَے خُدا تُو نے اپنے فیض سے غریبوں کے لئے اُسے تیار کیا۔ "},
	{11, "11  خُدا وند حُکم دیتا ہے۔خُشخبری دینے والیاں فوج کی فوج ہیں۔ "},
	{12, "12  لشکروں کے بادشاہ بھاگتے ہں۔ وہ بھاگ جاتے ہیں اور عورت گھر میں بیٹھی بیٹھی لوُٹ کا مال بانٹتی ہے۔ "},
	{13, "13  جب تُم بھیڑ سالوں میں پڑے رہتے ہو تو اُس کبوتر کی مانِند ہو گے جِس کے بازو گویا چاندی سے اور پَر خالِص سونے سے منڈھے ہوں۔ "},
	{14, "14  جب قادرِمُطلق نے بادشاہ کو اُس میں پراگندہ کیا تو ایسا حال ہو گیا گویا سلموؔن پر برف پڑ رہی تھی۔ "},
	{15, "15  بسن کا پہاڑ خُدا کا پہاڑ ہے۔بسن کا پہاڑ اُونچا پہاڑ ہے۔ "},
	{16, "16  اَے اُونچے پہاڑو!تُم اُس پہاڑ کو کیوں تاکتے ہوجِسے خُدا نے اپنی سکُونت کے لئے پسند کیا؟بلکہ خُدا اُس میں ابدتک رہیگا۔ "},
	{17, "17  خُدا کے رتھ بیِس ہزار بلکہ ہزار با ہزار ہیں۔خُداوند جیسے کوہِ سینا میں ویسا ہی اُنکے درمیان مقدِس میں ہے۔ "},
	{18, "18  تُو نے عالِم بالا کو صعُود فرمایا۔ تُو قَیدیِوں کو ساتھ لے گیا۔ تجھے لوگوں سے بلکہ سرکشوں سے بھی ہدۓ مِلے تاکہ خُداوند خُدا اُنکے ساتھ رہے۔ "},
	{19, "19  خُداوند مُبارِک ہو جوہر روز ہمارا بوجھ اُٹھاتا ہے۔ وہی ہمارا نجات دینے والا خُدا ہے۔ "},
	{20, "20  خُدا ہمارے لئے چُھڑانے والا خُدا ہے۔ اور موت سے بچنے کی راہیں بھی خُداوند خُدا کی ہیں۔ "},
	{21, "21  لیکن خُداوند اپنے دُشمنوں کے سر کو اور مُتواتِر گُناہ کرنے والے کی بالدار کھوپڑی کو چیر ڈالیگا۔ "},
	{22, "22  خُداوند نے فرمایا میَں اُنکو بسؔن سے نِکال لاؤنگا۔میَں اُن کو سُمندر کی تہ سے نِکال لاؤںگا۔ "},
	{23, "23  تاکہ تُو اپنا پاؤں خُون سے تر کرے۔ اور تیرے دُشمن تیرے کُتّوں کے مُنہ کا نوالہ بنیں۔ "},
	{24, "24  اَے خُدا! لوگوں نے تیری آمد دیکھی مقدِس میں میرے خُدا میرے بادشاہ کی آمد۔ "},
	{25, "25  گانے والے آگے آگے اور بجانے والے پیِچھے پیِچھے چلے۔ دف بجانے والی جوان لڑکیاں بیِچ میں۔ "},
	{26, "26  تُم جو اِسرائؔیل کے چشمہ سے ہو خُداوند کو مُبارِک کہو۔ہاں مجمع میں خُدا کو مُبارِک کہو۔ "},
	{27, "27  وہاں چھوٹا بِنیمؔیں اُنکا حاکم ہے۔ یہؔوُدا کے اُمرا اور اُنکے مُشِیر ۔ زبوُلؔوُن کے اُمرا اور نفؔتالی کے اُمرا ہیں۔ "},
	{28, "28  تیرے خُدا نے تیری پایداری کا حُکم دِیا ہے۔اَے خُدا! جو کچھ تُو نے ہمارے لئے کیِا اُسے پایداری بخش۔ "},
	{29, "29  تیری ہَیکل کے سبب سے جو یروشلم میں ہے بادشاہ تیرے پاس ہدئے لائینگے۔ "},
	{30, "30  تُو نیستان کے جنگلی جانوروں کو دھمکا دے۔ سانڈوں کے غول کو اور قوموں کے بچھڑوں کو جو چاندی کے سِکوں کو پامال کرتا ہے۔اُس نے جنگجُو قوموں کو پراگندہ کر دِیا ہے۔ "},
	{31, "31  اُمرا مِصر سے آئینگے۔ کوُشُؔ خُدا کی طرف اپنے ہاتھ بڑھانے میں جلدی کریگا۔ "},
	{32, "32  اَے زمین کی مملکتو! خُدا کے لئے گاؤ۔ خُداوند کی مدح سرائی کرو۔ "},
	{33, "33  اُسی کی جو قدِیم فلکُ الافلاک پر سوار ہے۔ دیکھو! وہ اپنی آواز بُلند کرتا ہے اُسکی آواز میں قُدرت ہے۔ "},
	{34, "34  خُدا کی تعظیم کرو۔ اُسکی حشمت اِسرائیل میں ہے اور اُسکی قُدرت افلاک پر۔ "},
	{35, "35  اَے خُدا !تُو اپنے مقدِسوں میں مُہیب ہے۔ اِسرائیل کا خُدا ہی اپنے لوگوں کو زور اور توانائی بخشتا ہے۔ خُدا مُبارِک ہو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view69() {
struct ur69 poems[] = {
	{1, "1  اَے خُدا مجھکو بچا لے۔ کیونکہ پانی میری جان تک آ بہنچا ہے۔ "},
	{2, "2  میَں گہری دلدل میں دھسا جاتا ہوں جہاں کھڑا نہیں رہا جاتا۔ میَں گہرے پانی میں آپڑا ہوُں جہاں سَیلاب میرے سر پر سے گُذرتے ہیں۔ "},
	{3, "3  میَں چِلاّتے چِلاّتے تھک گیا۔ میرا گلا سُوکھ گیا۔میری آنکھیں اپنے خُدا کے اِنتظار میں پتھرا گئیِں۔ "},
	{4, "4  مجھ سے بے سبب عداوت رکھنے والے میرے سر کے بالوں سے زیادہ ہیں۔ میری ہلاکت کے خواہاں اور نا حق دُشمن زبردست ہیں پس جو میَں نے چھینا نہیں مجھے دینا پڑا۔ "},
	{5, "5  اَے خُدا! تُو میری حماقت سے واقِف ہےاور میرے گُناہ تجھ سے پوشیِدہ نہیں ہیں۔ "},
	{6, "6  اَے خُداوند لشکروں کے خُدا! تیری آس رکھنے والے میرے سبب سے شرمِندہ نہ ہوں۔اَے اِسرؔائیل کے خُدا! تیرے طالب میرے سبب سے رُسوا نہ ہوں۔ "},
	{7, "7  کیونکہ تیرے نام کی خاطر میَں نے ملامت اُٹھائی ہے۔ شرمِندگی میرے مُنہ پر چھا گئی ہے۔ "},
	{8, "8  میَں اپنے بھائیوں کے نزدیک بیَگانہ بنا ہوں اور اپنی ماں کے فرزندوں کے نزدیک اجنبی "},
	{9, "9  کیونکہ تیرے گھر کی غیرت مجھے کھا گئی اور تجھکو ملامت کرنے کی ملامتیں مجھ پر آپڑیں۔ "},
	{10, "10  میرے روزہ رکھنے سے میری جان نے زاری کی اور یہ بھی ملامت کا باعث ہؤا۔ "},
	{11, "11  تُو اُنکے لئے ضربُ المثل ٹھہرا۔ "},
	{12, "12  پھاٹک پر بیَٹھنے والوں میں میرا ہی ذِکر رہتا ہے۔اور میَں نشہ بازوں کا گیت ہوں۔ "},
	{13, "13  لیکن اَے خُدا تیری خُوشنودی کے وقت میری دُعا تجھ سے ہے۔ اَے خُدا ! اپنی شفقت کی فراوانی سے اپنی نجات کی سچّائی میں جواب دے۔ "},
	{14, "14  مجھے دلدل میں سے نِکال لے اور دھسنے نہ دے۔ مجھ سے عداوت رکھنے والوں اور گہرے پانی سے مجھے بچالے۔ "},
	{15, "15  میَں سیَلاب میں ڈوب نہ جاؤں اور گہراؤ مجھے نِگل نہ لے۔اور پاتال مجھ پر اپنا مُنہ بند نہ کر لے۔ "},
	{16, "16  اَے خُدا! مجھے جواب دے کیونکہ تیری شفقت خُوب ہے۔ اپنی رحمتوں کی کثرت کے مُطابِق میری طرف مُتوجِّہ ہو۔ "},
	{17, "17  اپنے بندہ سے روپوشی نہ کر کیونکہ میں مُصیبت میں ہوں۔جلد مجھے جواب دے۔ "},
	{18, "18  میری جان کے آس پاس آکر اُسے چھُڑالے۔ میرے دُشمنوں کے رُوبروُ میرا فِدیہ دے۔ "},
	{19, "19  تُو میری ملامت اور شرمندگی اور رُسوائی سے واقف ہے۔ میرے دُشمن سب کے سب تیرے سامنے ہیں۔ "},
	{20, "20  ملامت نے میرا دِل توڑ دِیا۔ میَں بُہت اُداس ہوُں اور میَں اِسی انتظار میں رہا کہ کوئی ترس کھائے پر کوئے نہ تھا اور تسلی دینے والوں کا مُنتظِر رہا پر کوئی نہ مِلا۔ "},
	{21, "21  اُنہوں نے مجھے کھانے کو اِندراین بھی دِیا اور میری پیاس بُجھانے کو اُنہوں نے مجھے سِرکہ پِلایا۔۔ "},
	{22, "22  اُنکا دستر خوان اُنکے لئے پھندا ہو جائے۔ اور جب وہ امن سے ہوں تو جال بن جائے۔ "},
	{23, "23  اُنکی آنکھیں تاریک ہو جائیں تاکہ وہ دیکھ نہ سکیں اور اُن کی کمریں ہمیشہ کانپتی رہیں۔ "},
	{24, "24  اپنا غضب اُن پر اُنڈیل دے اور تیرا شدید قہر اُن پر آپڑے۔ "},
	{25, "25  اُنکا مسکن اُجڑ جائے۔ اُنکے خیموں میں کوئی نہ بسے۔ "},
	{26, "26  کیونکہ وہ اُسکو جِسے تُو نے مارا ہے ستاتے ہیں۔ اور جِنکو تُو نے زخمی کیا ہے اُنکے دُکھ کا چرچا کرتے ہیں۔ "},
	{27, "27  اُنکے گُناہ پر گُناہ بڑھا اور وہ تیری صداقت میں داخل نہ ہوں۔ "},
	{28, "28  اُنکے نام کِتابِ حیات سے مِٹا دِئے جائیں۔ اور صادِقوں کے ساتھ مندرج نہ ہوں۔ "},
	{29, "29  لیکن میَں تو غریب اور غمگین ہوُں اَے خُدا! تیری نجات مجھے سبُلند کرے۔ "},
	{30, "30  میَں گیت گا کر خُدا کے نام کی تعریف کرونگا اور شُکر گُذاری کے ساتھ اُسکی تمجید کرونگا۔ "},
	{31, "31  یہ خُداوند کوبَیل سے زیادہ پسند ہوگا بلکہ سیِنگ اور کھُر والے بچھڑے سے زیادہ۔ "},
	{32, "32  حلیم اِسے دیکھکر خُوش ہوئے ہیں۔ اَے خُدا کے طالِبو! تُمہارے دِل زندہ رہیں۔ "},
	{33, "33  کیونکہ خُداوند مُحتاجوں کی سُنتا ہے اور اپنے قَیدیوں کو حقیر نہیں جانتا۔ "},
	{34, "34  آسمان اور زمین اُسکی تعریف کریں اور سُمندر اور جو کچھ اُن میں چلتا پھرتا ہے ۔ "},
	{35, "35  کیونکہ خُدا صِیؔوُن کو بچائیگااور یہوُؔداہ کے شہروں کو بنائیگا اور وہاں بسینگے اور اُسکے وارِث ہونگے۔ "},
	{36, "36  اُسکے بندوں کی نسل بھی اُسکی مالِک ہوگی اور اُسکے نام سے مُحبت رکھنے والے اُس میں بسینگے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view70() {
struct ur70 poems[] = {
	{1, "1  اَے خُدا!مجھے چھُڑانے کے لئے ۔ اَے خُداوند! میری مدد کے لئے جلدی کر۔ "},
	{2, "2  جو میری جان کو ہلاک کرنے کے درپے ہیں وہ سب شرمِندہ اور خجل ہوں۔ جو میرے نُقصان سے خُوش ہیں وہ پسپا اور رُسوا ہو۔ "},
	{3, "3  اہا ہا ہا کرنے والے اپنی رُسوائی کی وجہ سے پسپا ہوں۔ "},
	{4, "4  تیرے سب طالب تجھ میں خُوش و خُرّم ہوں تیری نجات کے عاشق ہمیشہ کہا کریں خُدا کی تمجید ہو۔ "},
	{5, "5  مر میَں غریب اور محتاج ہُوں۔ اَے خُدا! میرے پاس جلد آ میرا مددگار اور چھُڑانے والا تُو ہی ہے۔ اَے خُدا دیر نہ کر!۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view71() {
struct ur71 poems[] = {
	{1, "1  اَے خُداوند تُو ہی میری پناہ ہے۔ مجھے کبھی شرمندہ نہ ہونے دے۔ "},
	{2, "2  اپنی صداقت میں مجھے رہائی دے اور چھُڑا۔میری طرف کان لگا اور مجھے بچا لے۔ "},
	{3, "3  تُو میرے لئے سُکونت کی چٹان ہو جہاں میَں برابر جاسکوں۔تُو نے بچانے کا حُکم دیدیا ہے۔کیونکہ میری چٹان اور میرا قلعہ تُو ہی ہے۔ "},
	{4, "4  اَے میرے خُدا! مُجھے شریر کے ہاتھ سے ناراستاور بے درد آدمی کے ہاتھ سے چھُڑا۔ "},
	{5, "5  کیونکہ اَے خُدا وند! تُو ہی میری اُمید ہے۔لڑکپن سے میرا توکُل تجھ پر ہے۔ "},
	{6, "6  تُو پَیدایش ہی سے مجھے سنبھالتا آیا ہے۔تُو میری ماں کے بطن ہی سے میرا شفیق رہا ہے۔ سو میَں سدا تیری سِتایش کرتا رہوں گا۔ "},
	{7, "7  میَں بہتوں کے لئے حَیرت کا باعث ہوُں۔ لیکن تُو میری مُحکم پناہ گاہ ہے۔ "},
	{8, "8  میرا مُنہ تیری سِتایش سے اور تیری تعظیم سے دِن بھر پُر رہیگا۔ "},
	{9, "9  بُڑھاپے کے وقت مجھے ترک نہ کر ۔ میری ضعیفی میں مُجھے چھوڑ نہ دے۔ کیونکہ میرے دُشمن میرے بارے میں باتیں کرتے ہیں اور جو میری گھات میں ہیں وہ آپس میں مشورہ کرتے ہین۔ "},
	{10, "11  اور کہتے ہیں کہ خُدا نے اُسے چھوڑ دیا ہے۔ اُسکا پیچھا کرو اور پکڑ لو کیونکہ چھُڑانے والا کوئی نہیں۔ "},
	{11, "12  اَے خُدا مجھ سے دور نہ رہ! اَے خُدا! میری مدد کے لئے جلدی کر۔ "},
	{12, "13  میری جان کے مُخالِف شرمندہ اور فنا ہو جائیں۔ میرا نُقصان چاہنے والے ملامت اور رُسوائی سے مُلبس ہوں۔ "},
	{13, "14  لیکن میَں ہمیشہ اُمید رکھوُنگا اور تیری تعریف اَور بھی زیادہ کیا کرونگا۔ "},
	{14, "15  میرا مُنہ تیری صداقت کا اور تیری نجات کا بیان دِن بھر کریگا۔ کیونکہ مجھے اُنکا شُمار معلوم نہیں۔ "},
	{15, "16  میَں خُداوند خُدا کی قُدرت کے کاموں کا اظہار کروُنگا۔ میَں صِرف تیری ہی صداقت کا ذِکر کروُنگا۔ "},
	{16, "17  اَے خُدا! تُو مجھے بچپن سے سِکھاتا آیا ہے اور میَں اب تک تیرے عجائب کا بیان کرتا رہا ہوں۔ "},
	{17, "18  اَے خُدا! جب میَں بُڈّھا اور سر سفید ہو جاؤں تو مجھے ترک نہ کرنا جب تک کہ میَں تیری قدرت آیندہ پُشت پر اور تیرا زور ہر آنے والے پر ظاہر نہ کردوں۔ "},
	{18, "19  اَے خُدا! تیری صداقت بھی بہت بلند ہے۔اَے خُدا! تیری مانِند کوَن ہےجِس نے بڑے بڑے کام کئے ہیں؟ "},
	{19, "20  تُو جِس نے ہمکو بہت اور سخت تکلیفیں دِکھائی ہیں پھر ہمکو زندہ کرےگا۔ اور زمین کے اسفل سے ہمیں پھر اُوپر لے اُئیگا۔ "},
	{20, "21  تُو میری عظمت کو بڑھا اور پھر کر مجھے تسلی دے۔ "},
	{21, "22  اَے میرے خُدا! میَں بربط پر تیری ہاں تیری سچّائی کی حمد کروُنگا۔ اَے اِسراؔئیل کے قُدوس! میَں سِتار کے ساتھ مدح سرائی کرونگا۔ "},
	{22, "23  جب میَں تیری مدح سرائی کرونگا تو میرے ہونٹ نہایت شادمان ہونگے اور میری جان بھی جِسکا تو نے فدیہ دیا ہے۔ "},
	{23, "24  اور میری زُبان دِن بھر تیری صداقت کا ذِکر کریگی کیونکہ میرا نُقصان چاہنے والے شرمِندہ اور پشیمان ہوئے ہیں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view72() {
struct ur72 poems[] = {
	{1, "1  اَے خُدا! بادشاہ کو اپنے احکام اور شاہزادہ کو اپنی صداقت عطا فرما۔ "},
	{2, "2  وہ صداقت سے تیرے لوگوں کی اور اِنصاف سے تیرے غریبوں کی عدالت کریگا۔ "},
	{3, "3  اِن لوگوں کے لئے پہاڑوں سے سلامتی کے اور پہاڑیوں سے صداقت کے پھل پیَدا ہونگے۔ "},
	{4, "4  وہ اِن لوگوں کے غریبوں کی عدالت کریگا۔ وہ مُحتاجوں کی اوُلاد کو بچائیگا۔ اور ظالِم کو ٹُکڑے ٹُکڑے کر ڈالے گا۔ "},
	{5, "5  جب تک سورج اور چاند قائم ہیں لوگ نسل در نسل تجھ سے ڈرتے رہینگے۔ "},
	{6, "6  وہ کٹی ہوئی گھاس پر مینہ کی مانِند اور زمین کو سیراب کرنے والی بارش کی طرح نازل ہوگا۔ "},
	{7, "7  اُسکے ایّامیں صادق برومند ہونگے اور جب تک چاند قائم ہے خوب امن رہیگا۔ "},
	{8, "8  اُسکی سلطنت سُمندر سے سُمندر تک اور دریایِ فرؔات سے زمین کی انتہا تک ہو گی۔ "},
	{9, "9  بیابان کے رہنے والے اُسکے آگے جھُکینگے اور اُسکے دُشمن خاک چاٹینگے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view73() {
struct ur73 poems[] = {
	{1, "1  بَیشک خُدا اِسرائیل پر یعنی پاک دِلوں پر مہربان ہے۔ "},
	{2, "2  لیکن میرے پاؤں تو پھِسلنے کو تھے۔میرے قدم قریباًٍ لغزِش کھا چُکے تھے۔ "},
	{3, "3  کیونکہ میَں شریروں کی اقبالمندی دیکھتا تو مغروروں پر حسد کرتا تھا۔اِسلئِے کہ اُنکی موت مین جان کنی نہیں بلکہ اُنکی موت بنی رہتی ہے۔ "},
	{4, "5  وہ اور آدمیوں کی طرح مُصیبت میں نہیں پڑتے نہ اَور لوگوں کی طرح اُن پر آفت آتی ہے۔ "},
	{5, "6  اِسلئِے غرور اُن کے گلے کا ہار ہے۔گویا وہ ظُلم سے مُلبس ہیں۔ "},
	{6, "7  اُنکی آنکھیں چربی سے اُبھری ہوُئی ہیں۔ اُنکے خیالات حدّ سے بڑھ گئے ہیں۔ "},
	{7, "8  وہ ٹھٹھا مارتے اور شرارت سے ظُلم کی باتیں کرتے ہیں۔ وہ بڑا بول بولتے ہیں۔ "},
	{8, "9  اُنکے مُنہ آسمان پر ہیں۔ اُنکی زُبانیں زمین کی سیر کرتیں ہیں۔ "},
	{9, "10  اِسلئے اُسکے لوگ اِس طرف رجُوعُ ہوتے ہیں اور جی بھر کر پیتے ہیں۔ "},
	{10, "11  وہ کہتے ہیں خُدا کو کیَسے معلوُم ہے؟ کیا حق تعالیٰ کو کُچھ علم ہے؟ "},
	{11, "12  اِن شریروں کو دیکھو! یہ سدا چَین سے رہتے ہوئے دولَت بڑھاتے ہیں۔ "},
	{12, "13  یقیناً میَں نے عبث اپنے دِل کو صاف اور اپنے ہاتھوں کو پاک کیا۔ "},
	{13, "14  کیونکہ مجھ پر دِن بھر آفت رہتی ہے اور میَں ہر صُبح تنبِیہ پاتا ہوُں۔ "},
	{14, "15  اگر میَں کہتا کہ یوُں کہوُنگا تو تیرے فرزندوں کی نسل سے بے وفائی کرتا۔ "},
	{15, "16  جب میَں سوچنے لگا کہ اِسے کیسے سمجھوُں تو یہ میری نظر میں دُشوار تھا۔ "},
	{16, "17  جب تک کہ میَں نے خُدا کے مقدِس میں جاکر اُنکے انجام کو نہ سوچا۔ "},
	{17, "18  یقیناً تُو اُنکو پھِسلنی جہگوں میں رکھتا ہے۔ اور ہلاکت کی طرف دھکیل دیتا ہے۔ "},
	{18, "19  وہ دم بھر میں کیَسے اُجڑ گئے! وہ حادثَوں سے بالکُل فنا ہو گئے۔ "},
	{19, "20  جَیسے جاگ اُٹھنے والا خواب کو وَیسے ہی تُو اَے خُداوند! جاگ کر اُنکی صُورت کو ناچیز جانیگا۔ "},
	{20, "21  کیونکہ میرا دِل رنجیدہ ہوا اور میرا جِگر چھِد گیا تھا۔ "},
	{21, "22  میَں بے عقل اور جاہل تھا۔ میَں تیرے سامنےجانور کی مانِند تھا۔ تُو بھی میَں برابر تیرے ساتھ ہوں۔تُو نے میرا دہنا ہاتھ پکڑ رکھا ہے۔ "},
	{22, "24  تُو اپنی مصلحت سے میری رہنمائی کریگا اور آخر کار مجھے جلال میں قبول فرمائے گا۔ "},
	{23, "25  آسمان پر تیرے سِوا میرا کون ہے؟ اور زمین پر تیرے سِوا میَں کِسی کا مُشتاق نہیں۔ "},
	{24, "26  گو میرا جسم اور میرا دِل زائل ہو جائیں تو بھی خُدا ہمیشہ میرے دِل کی قُوت اور بخرہ ہے۔ "},
	{25, "27  کیونکہ دیکھ! وہ جو تجھ سے دور ہیں فنا ہو جائینگے۔تُو نے اُن سب کو جہنوں نے تجھ سے بیوفائی کی ہلاک کردیا ہے۔ "},
	{26, "28  لیکن میرے لئے یہی بھلا ہے کہ خُدا کی نزدیکی حاصل کرُوں۔ میَں نے خُدا وند خُدا کو اپنی پناہگاہ بنالِیا ہے۔ تاکہ تیرے سب کاموں کو بیان کروُں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view74() {
struct ur74 poems[] = {
	{1, "1  اَے خُدا تُو نے ہم کو ہمیشہ کے لئے کیوں ترک کر دیا ؟ تیری چراگاہ کی بھیڑوں پر تیرا قہر کیوں بھڑک رہا ہے؟ "},
	{2, "2  اپنی جماعت کو جِسے تُو نے قدیم سے خریدا ہے جِسکا تُو نے فِدیہ دیا تاکہ تیری میراث کا قبیلہ ہو اور کوہِ صیِؔون کو جِس پر تُو نے سکونت کی ہے یاد کر۔ "},
	{3, "3  اپنے قدم دائمی کھنڈروں کی طرف بڑھا یعنی اۃُن سب خرابیوں کی طرف جو دُشمن نے مقدِس میں کی ہٰں۔ "},
	{4, "4  تیرے مجمع میں تیرے مخالِف گرجتَے ہیں نِشان کے لئے اُنہوں نے اپنے ہی جھنڈے کھڑے کئے ہیں۔ "},
	{5, "5  وہ اُن آدمیوں کی مانند ہیں جو گُنجان درختوں پر کُلہاڑے چلاتے ہیں۔ "},
	{6, "6  اور اب وہ اُسکی ساری نقش کاری کو کُلہاڑی اور ہتھوڑوں سے بِالکُل توڑ ڈالتے ہیں۔ "},
	{7, "7  اُنہوں نے تیرے مقدِس میں آگ لگا دی ہے۔ اور تیرے نام کے مسکن کو زمین تک مِسمار کر کے ناپاک کیا ہے۔ "},
	{8, "8  اُنہوں نے اپنے دِل میں کہا ہے ہم اُن کو بِالکُل ویران کر ڈالیں اُنہوں نے اِس مُلک میں خُدا کے سب عبادت خانوں کو جلا دیا ہے۔ "},
	{9, "9  ہمارے نِشان نظر نہیں آتے اور کوئے نبی نہیں رہا اور ہم میں کوئی نہیں جانتا کہ یہ حال کب تک رہے گا۔ "},
	{10, "10  اَے خُدا! مُخالف کب تک طعنہ زنی کرتا رہیگا؟ کیا دُشمن ہمیشہ تیرے نام پر کُفر بکتا رہے گا؟ "},
	{11, "11  تُو اپنا ہاتھ کیوں روکتا ہےب؟ اپنا دہنا ہاتھ بغل سے نِکال اور فنا کر۔ "},
	{12, "12  خُدا قدیم سے میرا بادشاہ ہے جو زمین پر نجات بخشتا ہے۔ "},
	{13, "13  تُو نے اپنی قُدرت سے سمُندر کے دو حصے کر دیے۔تُو پانی میں اژدہاؤں کے سر کُچلتا ہے ۔ "},
	{14, "14  تُو نے لِویوتان کے سر کے ٹُکڑے کئے۔اور اُسے بیابان کے رہنے والوں کی خُوراک بنایا۔ "},
	{15, "15  تُو نے چشمے اور سیلاب جاری کئے۔ تُو نے بڑے بڑے دریاؤں کو خُشک کر ڈالا۔ "},
	{16, "16  دِن تیرا ہے ۔ رات بھی تیری ہے۔نُور اور آفتاب کو تو ہی نے تیار کیا۔ "},
	{17, "17  زمین کی تمام حدُود تُو ہی نے ٹھہرائی ہیں۔گرمی اور سردی کے موسم تُو ہی نے بنائے۔ "},
	{18, "18  اَے خُداوند ! اِسے یاد رکھ کہ دُشمن نے طعنہ زنی کی ہے۔اور بیوُقُوف قَوم نے تیرے نام کی تکفیر کی ہے۔ "},
	{19, "19  اپنی فاختہ کی جان کو جنگلی جانور کے حوالہ نہ کر اپنے غریبوں کی جان کو ہمیشہ کے لئے بھول نہ جا۔ "},
	{20, "20  اپنے عہد کا خیال فرما۔ کیونکہ زمین کے تاریک مُقام ظُلم کے مسکنوں سے بھرے ہیں۔ "},
	{21, "21  مظلُوم شرمندہ ہو کر نہ لوٹےَ۔غریب اور مُحتاج تیرے نام کی تعریف کریں۔ "},
	{22, "22  اُٹھ اَے خُدا! آپ ہی اپنی وکالت کر۔ یاد کر کہ احمق دِن بھر تجھ پر کیَسی طعنہ زنی کرتا ہے ۔ "},
	{23, "23  اپنے دُشمنوں کی آواز کو بھول نہ جا۔ تیرے مُخالفوں کا ہنگامہ برپا ہوتا رہتا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view75() {
struct ur75 poems[] = {
	{1, "1  اَے خُدا ! ہم تیرا شُکر کرتے ہیں۔ ہم تیرا شُکر کرتے ہیں کیونکہ تیرا نام نزدیک ہے۔ لوگ تیرے عجیب کاموں کا ذِکر کرتے ہیں۔ "},
	{2, "2  جب میرا معُیّن وقت آئے گا تو میں راستی سے عدالت کروں گا۔ "},
	{3, "3  زمین اور اُسکے سب باشِندے گُداز ہو گئے ہیں۔ میَں نے اُسکے سُتو نوں کو قا ئم کر دیا ہے ۔ "},
	{4, "4  میَں نے مغرُور ں سے کہا غُر ور نہ کر و اور شرِ یرو ں سے کہ سینگ اُو نچا نہ کر و۔ "},
	{5, "5  اپنا سِینگ اوُنچا نہ کرو۔ گردن کشی سے بات نہ کرو ۔ "},
	{6, "6  کیو نکہ سر فر ازی نہ تو مشرِ ق سے نہ مغُر ب سے اور نہ جنُو ب سے آتی ہے ۔ "},
	{7, "7  بلکہ خُدا ہی عدا لت کر نے والا ہے ۔ وہ کِسی کو پِست کرتا ہے اور کسی کو سر فر ازی بخشتا ہے ۔ "},
	{8, "8  کیو نکہ خُدا وند کے ہا تھ میں پیالہ ہے اور مےَ جھا گ والی ہے ۔ وہ ملِی ہو ئی شر اب سے بھر ا ہے ۔ اور خُدا وند اُسی میں سے اُنڈ یلتا ہے ۔ بِیشک اُسکی تلچھٹ زمین کے سب شِر یر نچوڑ نچو ڑ کر پیئں گے ۔ "},
	{9, "9  لیکن مَیَں تُو ہمیشہ ذِ کر کر تا رہوُ ںگا میں یعقُو ب کے خُدا کی مداح سر ائی کر و ں گا "},
	{10, "10  اور میں شِر یر و ں کے سب سینگ کاٹ ڈالوں گا ۔ لیکن صا دقُو ں کے سینگ اونچے کئے جائے گے ۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view76() {
struct ur76 poems[] = {
	{1, "1  خُدا یُہو داہ میں مشہو ُر ہے ۔ اُسکا نام اِسر ائیل میں بزُرگ ہے ۔ "},
	{2, "2  سالم میں اُسکا خیمہ ۔ اور صِیون اُس کا مسکن ۔ "},
	{3, "3  وہاں اُس نے برِق کمان کو اور ڈھال اور تلوار اور سامان ِ جنگ کو توڑ ڈالا۔ "},
	{4, "4  تُو جلالی ہے اور شِکار کے پہاڑوں سے شاندار ہے۔ "},
	{5, "5  مضبوُط دِل لُٹ گئے۔وہ گہری نیند میں پڑے ہیں۔اور زبردست لوگوں میں سے کسی کا ہاتھ کام نہیں آیا ۔ "},
	{6, "6  اَے یعقُؔوب کے خُدا! تیری جھڑکی سے رتھ گھوڑے دونوں پر موت کی نیند طاری ہے۔ "},
	{7, "7  فقط تجھ سے ڈرنا چاہیئے اور تیرے قہر کے وقت کَون تیرے حضور کھڑا رہ سکتا ہے؟ "},
	{8, "8  تُو نے آسمان پر سے فیصلہ سُنایا۔ زمین ڈر کر چُپ ہو گئی ۔ "},
	{9, "9  جب خُدا عدالت کرنے کو اُٹھا تاکہ زمین کے سب حلیموں کو بچا لے ۔ "},
	{10, "10  بے شک اِنسان کا غضب تیری ستایش کا باعث ہو گا اور تُو غضب کے بقیہّ سے کمر بستہ ہو گا۔ "},
	{11, "11  خُداوند اپنے خُدا کے لئے منّت مانو اور پوری کرو اور سب جو اُس کے گِرد ہیں وہ اُسی کے لئے جِس سے ڈرنا واجب ہے ہدئے لائیں۔ "},
	{12, "12  وہ اُمرا کی روح کو قبض کریگا۔ وہ زمین کے بادشاہوں کے لئے مُہیب ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view77() {
struct ur77 poems[] = {
	{1, "1  میَں بلند آواز سے خُدا کے حضور فریاد کروں گا۔خُدا ہی کے حضور بلند آواز سے وہ میری طرف کان لگائے گا۔ "},
	{2, "2  اپنی مُصیبت کے دِن میَں نے خُدا کو ڈھونڈا۔ میرے ہاتھ رات کو پھِسلے رہےاور ڈھیلے نہ ہوئے۔میری جان کو تسکین نہ ہوئی۔ "},
	{3, "3  میَں خُدا کو یاد کرتا ہُوں اور بے چین ہُوں۔ میَں واویلا کرتا ہوں اور میری جان نڈھال ہے۔ "},
	{4, "4  تُو میری آنکھیں کھُلی رکھتا ہے۔میَں ایسا بیتاب ہُوں کہ بول نہیں سکتا۔ "},
	{5, "5  میَں گزشتہ ایاّم پر یعنی قدیم زمانہ کے برسوں پر سوچتا رہا۔ "},
	{6, "6  مجھے رات اپنا گیت یاد آتا ہے۔میَں اپنے دِل ہی میں سوچتا ہوں۔میری روح بڑی تفتیش میں لگی ہے۔ "},
	{7, "7  کیا خُداوند ہمیشہ کے لئے چھوڑ دے گا؟ کیا وہ پھرکبھی مہر بان نہ ہو گا ؟ "},
	{8, "8  کیا اُسکی شفقت ہمیشہ کے لئے جاتی رہی ؟ کیا اُسکا وعد ہ ابد تک با طِل ہو گیا ۔ "},
	{9, "9  کیا خُد ا کر م کر نا بھُو ل گیا ؟ کیا اُس نے قہر سے اپنی رحمت روک لی ؟ "},
	{10, "10  پھر مَیں نے کہا یہ میر ی ہی کمز ور ی ہے ۔ مِیں تُو حق تعا لی کی قد ُر ت کے زما نہ کو یا د کرُوں گا ۔ "},
	{11, "11  مَیں خُداوند کے کا مو ں کا ذِکر کر و ُں گا ۔ کیو نکہ مجھے تیر ے قدیم ِ عجا ئب یاد آ ئے گے ۔ "},
	{12, "12  میں تیر ی سا ر ی صنعت پر دھیا ن کُر وں گا ۔ اور تیر ے کا مو ں کو سو ُچو گا ۔ "},
	{13, "13  اَ ے خُدا !تیر ی راہ مقد س میں ہیں ۔ کُو ن سا دیو تا خُدا کی ما نند بڑا ہے ؟ "},
	{14, "14  تُو نے قو مو ں کے در میا ن اپنی قُد ر ت ظاہر کی ۔ "},
	{15, "15  تُو نے اپنے ہی بازو سے اپنی قوم بنی یعقُوؔب اور بنی یوؔسف کو فدیہ دیکر چھُڑایا ہے۔ "},
	{16, "16  اَے خُدا! سُمندروں نے تجھے دیکھا ۔ سُمندر تجھے دیکھ کر ڈر گئے۔ گہراؤ بھی کانپ اُٹھے ۔ "},
	{17, "17  بدلیوں نے پانی برسایا افلاک سے آواز آئی تیرے تیر بھی چاروں طرف چلے ۔ "},
	{18, "18  بگولے میں تیرے رعد کی آواز آئی برق نے جہان کو روشن کر دیا ۔ زمین لرزی اور کانپی۔ "},
	{19, "19  تیری راہ سمُندر میں ہے۔تیرے راستے بڑے سمُندروں میں ہیں اور تیرے نقشِ قدم نا معلُوم ہیں۔ "},
	{20, "20  تُو نے موسیٰ اور ہاروؔن کے وسیلہ سے گلہّ کی طرح اپنے لوگوں کی رہنمائی کی۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view78() {
struct ur78 poems[] = {
	{1, "1  اَے میر ے لو گو ! میر ی شر یعت کو سنُو ۔ میر ے منہ کی با تو ں پر کا ن لگاوؑ۔ "},
	{2, "2  میں تمیثل میں کلا م کر وؑں گا ۔ اور قدیم معمُےکہوُ ںگا ۔ "},
	{3, "3  جنکو ہم نے سنُا اور جان لیا اور ہما رے با پ دادا نے ہم کو بتایا۔ "},
	{4, "4  اور جنکو ہم اپنی اَولاد سے پو شیدہ نہیں رکھیں گے ۔بلکہ آیند ہ پُشت کو بھی خُداوند کی تعر یف اور اُسکی قُد رت اور عجُا ئب جو اُس نے کئے بتا ئیں گے ۔ "},
	{5, "5  کیو نکہ اُس نے یعقو ؔب میں ایک شہا دت قائم کی او ر اِسر ائیل میں شِریعت مُقر ر کی جنکی با بت اُس نے ہما رے با پ دادا کو حُکم دیا ۔کہ وہ ہمار ی اولاد کو تعلیم دیں۔ "},
	{6, "6  تاکہ آیند ہ پشُت یعنی وہ فر زند جو پیدا ہو ں گے ۔اُنکو جان لیںاور وہ بڑ ے ہو کر اپنی اولاد کو سکھائیں ۔ "},
	{7, "7  کہ وہ خُدا پر آس رکھیں اور اُسکے کاموں کو بھُو ل نہ جائیں بلکہ اُس حکُمو ں پر عمل کر یں ۔ "},
	{8, "8  اور اپنے باپ دادا کی طر ح سر کش اور باغی نسل نہ بنیں۔اَیسی نسل جِس نے اپنا دِل دُرُست نہ کیا اور جِسکی روح خُدا کے حضور وفادار نہ رہی۔ "},
	{9, "9  بنی اِفرایمً مسّلح ہو کر اور کمانیں رکھتے ہیں۔ لڑائی کے دِن پھِر گئے ۔ "},
	{10, "10  اُنہوں نے خُدا کے عہد کو قائم نہ رکھا۔اور اُسکی شریعت پر چلنے سے انکار کیا ۔ "},
	{11, "11  اور اُس کے کاموں کو اور اُس کے عجائب کو جو اُس نے اُن کو دیکھائے تھے بھول گئے۔ "},
	{12, "12  اُس نے مُلکِ مصؔر میں۔ ضُعؔن کے علاقہ میں اُنکے باپ دادا کے سامنے عجیب و غریب کام کئے۔ "},
	{13, "13  اُس نے سمنُدر کے دو حصّے کر کے اُنکو پار اُتارا۔ اور پانی کو تودا کی طرح کھڑا کر دیا۔ "},
	{14, "14  اُس نے دِن کو بادل سے اُنکی رہبری کی اور رات بھر آگ کی روشنی سے۔ "},
	{15, "15  اُس نے بیابان میں چٹانوں کو چیرا اور اُنکو گویا بحر سے خوب پلایا۔ "},
	{16, "16  اُس نے چٹانوں میں سے ندیاں جاری کیں۔اور دریاؤں کی طرح پانی بہایا۔ "},
	{17, "17  تو بھی وہ اُس کے خِلاف گُناہ کرتے ہی گئے۔اور بیابان میں حق تعالیٰ سے سرکشی کرتے رہے۔ "},
	{18, "18  اور اُنہوں نے اپنی خواہش کے مطابق کھانا مانگ کر اپنے دل میں خُدا کو آزمایا۔ "},
	{19, "19  بلکہ وہ خُدا کے خلاف بکنے لگے اور کہا کیا خُدا بیابان میں دستر خوان بچھا سکتا ہے؟ "},
	{20, "20  دیکھو! اُس نے چٹان کو مارا تو پانی پھوٹ نکلا اور ندیاں بہنے لگیں۔کیا وہ روٹی بھی دے سکتا ہے؟ کیا وہ اپنے لوگوں کے لئے گوشت مُہیا کردیگا؟ "},
	{21, "21  پس خُداوند سُن کر غضبناک ہوا۔ اور یعقُؔوب کے خلاف آگ بھڑک اُٹھی اور اِسؔرائیل پر قہر ٹوٹ پڑا ۔ "},
	{22, "22  اِسلئے کہ وہ خُدا پر ایمان نہ لائے اور اُسکی نجات پر بھروسہ نہ کیا۔ "},
	{23, "23  تُو بھی اُس نے افلاک کو حکم دیا اور آسمان کے دروازے کھولے ۔ "},
	{24, "24  اور کھانے کے لئے اُن پر من برسایا اور اُن کو آسمانی خوراک بخشی۔ "},
	{25, "25  اِنسان نے فرِشتوں کی غذا کھائی اُس نے کھانا بھیج کر اُن کو آسوُدا کیا۔ "},
	{26, "26  اُس نے آسمان میں پُروا چلائی اور اپنی قُدرت سے دکھّنا بہائی ۔ "},
	{27, "27  اُس نے اُن پر گوشت کو خاک کی مانِند برسایا اور پرنِدوں کو سمُندر کی ریت کی مانند ۔ "},
	{28, "28  جِنکو اُس نے اُن کی خیمہ گاہ میں اُنکے مسکنوں کے آس پاس گِرایا ۔ "},
	{29, "29  پَس وہ کھا کر خُوب سیَر ہوئےاور اُس نے اُنکی خواہش پوری کی ۔ "},
	{30, "30  وہ اپنی خواہش سے باز نہ آئے اور اُنکا کھانا اُنکے مُنہ ہی میں تھا ۔ "},
	{31, "31  کہ خُدا کا غضب اُن پر ٹوٹ پڑا اور اُن کے سب سے موٹے تازے آدمی قتل کئے۔ اور اِسرائیلی جوانوں کو مار گِرایا۔ "},
	{32, "32  باوُجوُد اِن سب باتوں کے وہ گُناہ کرتے ہی رہے۔ اور اُسکے عجیب و غریب کاموں پر ایمان نہ لائے۔ "},
	{33, "33  اِس لئے اُس نے اُن کے دِلوں کو بطالت سے اور اُنکے برسوں کو دہشت سے تمام کر دیا۔ "},
	{34, "34  جب وہ اُنکو قتل کرنے لگا تو وہ اُسکے طالب ہوئے اور رجوع ہو کر دِل و جان سے خُدا کو ڈھوُنڈنے لگے۔ "},
	{35, "35  اور اُنکو یاد آیا کہ خُدا اُن کی چٹان ہے اور حق تعالیٰ اُنکا فدیہ دینے والا ہے ۔ "},
	{36, "36  لیکن اُنہوں نے اپنے مُنہ سے اُسکی خُوشامد کی اور اپنی زُبان سے اُس سے جھوٹ بولا۔ "},
	{37, "37  کیونکہ اُن کو دل اُسکے حضور دُرُست نہ تھا اور وہ اُسکے عہد میں وفاو دار نہ نِکلے۔ "},
	{38, "38  لیکن وہ رحیم ہو کر بدکاری معاف کرتا ہے اور ہلاک نہیں کرتا بلکہ بارہا اپنے قہر کو روک لیتا ہے۔اور اپنے پُورے غضب کو بھڑکنے نہیں دیتا ۔ "},
	{39, "39  اور اُسے یاد رہتا ہے کہ یہ محض بشر ہیں یعنی ہوا جو چلی جاتی ہے اور پھِر نہیں آتی۔ "},
	{40, "40  کِتنی بار اُنہوں نے بیابان میں اُس سے سر کشی کی اور صحرا میں اُسے آزُردہ کیا! "},
	{41, "41  اور وہ پھِر خُدا کو آزمانے لگے اور اُنہوں نے اِسرائیل کے قدوس کو ناراض کیا۔ "},
	{42, "42  اُنہوں نے اُسکے ہاتھ کو یاد نہ رکھا۔ نہ اُس دِن کو جب اُنہوں نے فِدیہ دے کر اُنکو مُخالِف سے رہائی بخشی ۔ "},
	{43, "43  اُس نے مؔصر میں اپنے نشان دیکھائے اور ضعؔن کے علاقہ میں اپنے عجائب ۔ "},
	{44, "44  اور اُنک دراؤں کو خُون بنا دیا اور وہ اپنی ندی سے پی نہ سکے۔ "},
	{45, "45  اُس نے اُن پر مچھروں کے غول بھیجے جو اُنکو کھا گئے۔ اور مینڈک جِنہوں نے اُنکو تباہ کر دیا۔ "},
	{46, "46  اُس نے اُنکی پیداوار کیِڑوں کو اور اُنکی محنت کا پھل ٹڈِیوں کو دیدیا۔ "},
	{47, "47  اُس نے اُنکی تاکوں کو اولوں سے اور اُن کے گولر کے درختوں کو پالے سے مارا۔ "},
	{48, "48  اُس نے اُن کے چوپایوں کو اولوں کے حوالہ کیا اور اُنکی بھیڑ بکریوں کو بجلی کے۔ "},
	{49, "49  اُس نے عذاب کے فرِشتوں کو فوج بھیجکر اپنے قہر کی شِدّت غَیظ و غضب اور بلا کو اُن پر نازل کیا۔ "},
	{50, "50  اُس نے اپنے قہر کے لئے راستہ بنایا اور اُنکی جان موت سے نہ بچائی بلکہ اُنکی زندگی وبا کے حوالہ کی۔ "},
	{51, "51  اُس نے مصؔر کے سب پہلوٹھوں کو یعنی حاؔم کے مسکنوں میں اُنکی قُوّت کے پھل کو مارا۔ "},
	{52, "52  لیکن وہ اپنے لوگوں کو بھیڑوں کی مانند لے چلا اور بیابان میں گلّہ کی مانند اُن کی راہنمائی کی۔ "},
	{53, "53  اور وہ اُنکو سلامت لے گیا اور وہ نہ ڈرے۔ لیکن اُن کے دُشمنوں کو سمُندر نے چھُپا لیا ۔ "},
	{54, "54  اور وہ اُن کو اپنے مقدِس کی حد تک لایا۔یعنی اُس پہاڑ تک جِسے اُسکے دہنے ہاتھ نے حاصل کیا تھا۔ "},
	{55, "55  اُس نے اُور قوموں کو اُن کے سامنے سے نِکال دیا ۔ جِنکی میراث جرِیب ڈالکر اُنکو بانٹ دی ۔ اور جِنکے خَیموں میں اِسرائیل کے قبیلوں کو بسایا۔ "},
	{56, "56  تو بھی اُنہوں نے خُدا تعالیٰ کو آزمایا اور اُسی سے سرکشی کی اور اُسکی شہادتوں کو نہ مانا۔ "},
	{57, "57  بلکہ برگشتہ ہو کر اپنے باپ دادا کی طرح بیوفائی کی اور دھوکا دینے والی کمان کی طرح ایک طرف کو جھُک گئے۔ "},
	{58, "58  کیونکہ اُنہوں نے اپنے اُونچے مقاموں کے باعث اُس کو قہر بھڑکایا۔ اور اپنی کھودی ہوئی مورتوں سے اُسے غرت دِلائی۔ "},
	{59, "59  خُدا یہ سُن کر غضب ناک ہوا اور اِسرائؔیل سے سخت نفرت کی ۔ "},
	{60, "60  سو اُس نے سیَلؔا کے مسکن کو ترک کر دیا یعنی اُس خیمہ کو جو بنی آدم کے درمیان کھڑا کیا تھا۔ "},
	{61, "61  اور اُس نے اپنی قُوت کو اسیری میں اور اپنی حشمت کو مُخالِف کے ہاتھ میں دیدیا۔ "},
	{62, "62  اُس نے اپنے لوگوں کو تلوار کے حالے کر دیا اور اپنی میراث سے غضبناک ہو گیا۔ "},
	{63, "63  آگ اُنکے جوانوں کو کھا گئی۔ اور اُنکی کنواریوں کے سُہاگ نہ گائے گئے۔ "},
	{64, "64  اُنکے کاہن تلوار سے مارے گئے اور اُنکی بیواؤں نے نوحہ کیا۔ "},
	{65, "65  تب خُداوند گویا نیند سے جاگ اُٹھا ۔ اُس زبردست آدی کی طرح جو مے کے سبب سے للکارتا ہو۔ "},
	{66, "66  اور اُس نے مُخالِفوں کو مار کر پسپا کر دیا ۔ اُس نے اُنکو ہمیشہ کے لئے رُسوا کیا ۔ "},
	{67, "67  اور اُس نے یوؔسف کے خیموں کو چھوڑ دیا۔ اور افؔرائیم کے قبیلہ کو نہ چُنا۔ بلکہ یہُوؔداہ کے کے قبیلہ کو چُنا۔ اُسی کوہِ صِیوُؔن سے جِس سے اُس کو مُحبت تھی۔ اور اپنے مقدِس کو پہاڑوں کی مانند تعمیر کیا اور زمین کی مانند جِسے اُس نے ہمیشہ کے لئے قائم کیا ہے۔ "},
	{68, "70  اُس نے اپنے بندہ داؔؤد کو بھی چُنا اور بھیڑ سالوں میں سے اُسے لے لیا۔ "},
	{69, "71  وہ اُس بچّے والی بھیڑوں کی چَوپانی سے ہٹا لایا تاکہ اُسکی قوم یعقُؔوب اور اُسکی میراث اِسراؔئیل کی گلّہ بانی کرے۔ سو اُس نے خلوصِ دل سے اُنکی پاسبانی کی اور اپنے ماہر ہاتھوں سے اُنکی راہنمائی کرتا رہا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view79() {
struct ur79 poems[] = {
	{1, "1  اَے خُدا! قومیں تیری میراث میں گھُس آئیں ہیں۔ اُنہوں نے تیری مُقدس ہیکل کو ناپاک کیا ہے۔ اُنہوں نے یرؔوشلیم کھنڈر بنا دیا ہے۔ "},
	{2, "2  اُنہوں نے تیرے بندوں کی لاشوں کو آسمان کے پرندوں کی اور تیرے مقدسوں کے گوشت کو زمین کے درِندوں کی خُوراک بنا دیا ہے۔ "},
	{3, "3  اُنہوں نے اُن کا خُون یروشلؔیم کی گِرد پانی کی طرح بہایا اور کوئی اُ ن کو دفن کرنے والا نہ تھا ۔ "},
	{4, "4  ہم اپنے پڑوسیوں کی ملامت کا نشانہ ہیں اور اپنے آس پاس کے لوگوں کے تمسخُر اور مذاق کا باعث ۔ "},
	{5, "5  اَے خُدا! کب تک؟ کیا تُو ہمیشہ کے لئے ناراض رہے گا؟ کیا تیری غیرت آگ کی طرح بھڑکتی رہیگی؟ "},
	{6, "6  اپنا قہر اُن قوموں پر جو تجھے نہیں پہچانتیں اور اُن مملکتوں پر جو تیرا نام نہیں لیتیں اُنڈیل دے۔ "},
	{7, "7  کیونکہ اُنہوں نے یعقُؔوب کو کھا لیا اور اُ سکے مسکن کو اُجاڑ دیا ۔ "},
	{8, "8  ہمارے باپ دادا کے گُناہوں کو ہمارے خلاف یاد نہ کر ۔ تیری رحمت جلد ہم تک پہنچے کیونکہ ہم بہت پست ہو گئے ہیں۔ "},
	{9, "9  اَے ہمارے نجات دینے والے خُدا! اپنے نام کے جلال کی خاطر ہماری مدد کر ۔ اپنے نام کی خاطر ہمکو چُھڑا اور ہمارے گُناہوں کا کفارہ دے۔ "},
	{10, "10  قومیں کیوں کہیں کہ اُنکا خُدا کہاں ہے؟تیرے بندوں کے بہائے ہوئے خون کا بدلہ ہماری آنکھوں کے سامنے قوموں پر واضح ہو جائے۔ "},
	{11, "11  قیدی کی آہ تیرے حضور تک پُہنچے ۔اپنی بڑی قدرت سے مرنے والوں کو بچا لے۔ "},
	{12, "12  اَے خُداوند! ہمارے پڑوسیوں کی طعنہ زنی جو وہ تجھ پر کرتے رہے ہیں اُلٹی سات گُنا اُن ہی کے دامن میں ڈال دے ۔ "},
	{13, "13  تب ہم جو تیرے لوگ اور تیری چراگاہ کی بھیڑیں ہیں ہمیشہ تیری شُکر گُزاری کریں گے۔ہم پُشت در پُشت تیری ستایش کریں گے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view80() {
struct ur80 poems[] = {
	{1, "1  اَے اِسرائیل کے چوپان ! تُو جو گلّہ کی مانند یُوؔسُف کو لے چلتا ہے کان لگا! تُو جو کُروبیوں پر بیٹھا ہے جلوہ گر ہو! "},
	{2, "2  افرؔئیم و بِنؔیمین اور منؔسّی کے سامنے اپنی قوت کو بَیدار کر اور ہمیں بچانے کو آ۔ "},
	{3, "3  اَے خُدا! ہمکو بحال کر اور اپنا چہرہ چمکا تو ہم بچ جائینگے۔ "},
	{4, "4  اَے خُداوند لشکروں کے خُدا! تُو کب تک اپنے لوگوں کی دُعا سے ناراض رہیگا؟ "},
	{5, "5  تُو نے اُن کو آنسُوؤں کی روٹی کھِلائی اور پینے کو کثرت سے آنسُو ہی دِئے۔ "},
	{6, "6  تُو ہمکو ہمارے پڑوسیوں کے لئے جھگڑے کا باعث بناتا ہے۔ اور ہمارے دُشمن آپس میں ہنستے ہیں۔ "},
	{7, "7  اَے لشکروں کے خُدا! ہمکو بحال کر اور اپنا چہرہ چمکا تو ہم بچ جائینگے۔ "},
	{8, "8  تُو مصر سے ایک تاک لایا۔ تُو نے قوموں کو خارج کر کے اُسے لگایا۔ "},
	{9, "9  تُو نے اُس کے لئے جگہ تیار کی۔ اُس نے گہری جڑ پکڑی اور زمین کو بھر دیا ۔ "},
	{10, "10  پہاڑ اُس کے سایہ میں چھُپ گئے اور اُسکی ڈالیاں خُدا کے دیوداروں کی مانند تھیں۔ "},
	{11, "11  اُس نے اپنی شاخیں سمنُدر تک پھیلائیں اور اپنی ٹہنیاں دریایِ فرؔات تک۔ "},
	{12, "12  پھر تُو نے اُسکی باڑوں کو کیوں توڑ ڈالا۔ کہ سب آنے جانے والے اُسکا پھل توڑتے ہیں؟ "},
	{13, "13  جنگلی سُواًر اُسے برباد کرتا ہے اور جنگلی جانور اُسے کھا جاتے ہیں۔ "},
	{14, "14  اَے لشکروں کے خُدا! ہم تیری منّت کرتے ہیں۔ پھر مُتوجّہ ہو۔ آسمان پر سے نگاہ کر اور دیکھ اور اِس تاک کی نِگہبانی فرما۔ "},
	{15, "15  اور اُس پودہ کی بھی جِسے تیرے دہنے ہاتھ نے لگایا ہے۔ اور اُس شاخ کی جِسے تُو نے اپنے لئے مضبوط کیا ہے۔ "},
	{16, "16  یہ آگ سے جلی ہوئی ہے۔ یہ کٹی پڑی ہے۔ وہ تیرے مُنہ کی جھڑکی سے ہلاک ہو جاتے ہیں۔ "},
	{17, "17  تیرا ہاتھ تیری دہنی طرف کے انسان پر ہو۔ اُس اِبنِ آدؔم پر جِسے تُو نے اپنے لئے مضبُوط کیا ہے۔ "},
	{18, "18  پھر ہم تجھ سے برگشتہ نہ ہونگے۔ تُو ہمکو پھِر زِندہ کر اور ہم تیرا نام لیا کرینگے۔ "},
	{19, "19  اَے خُداوند لشکروں کے خُدا! ہمکو بحال کر۔ اپنا چہرہ چمکا تو ہم بچ جائینگے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view81() {
struct ur81 poems[] = {
	{1, "1  خُدا کے حضور جو ہماری قُوت ہے بلند آواز سے گاؤ۔یعقُؔوب کے خُدا کے حضور خُوشی کا نعرہ مارو۔ "},
	{2, "2  نغمہ چھیڑو اور دف لاؤ اور دِلنواز سِتار اور بربط۔ "},
	{3, "3  نئے چاند اور پورے چاند کے وقت ہماری عید کے دن نرسِنگاہ پھُونکو۔ "},
	{4, "4  کیونکہ یہ اِسرائؔیل کے لئے آئین اور یعقُوؔب کے خُدا کا حُکم ہے۔ "},
	{5, "5  اِسکو اُس نے یُوؔسُف میں شہادت ٹھہرایا۔ جب وہ مُلکِ مصؔر کے خلاف نِکلا میَں نے اُسکا کلام سُنا جسکو میَں جانتا نہ تھا ۔ "},
	{6, "6  میَں نے اُسکے کندھے پر سے بوجھ اُتار دیا۔ اُسکے ہاتھ ٹوکری ڈھونے سے چھُوٹ گئے۔ "},
	{7, "7  تُو نے مُصیبت میں پُکارا اور میَں نے تجھے چُھڑایا۔ میَں نے رعد کے ہردہ میں سے تجھے جواب دیا میَں نے تجھے مریؔبہ کے چشمہ پر آزمایا۔ "},
	{8, "8  اَے میرے لوگو! سُنو۔ میَں تمکو آگاہ کرتا ہوں۔ اَے اِسؔرائیل! کاشکہ تُو میری سُنتا! "},
	{9, "9  تیرے درمیان کوئی غیر معبود نہ ہو اورتُو کسی غیر معبود کو سِجدہ نہ کرنا۔ "},
	{10, "10  خُداوند تیرا خُدا میں ہوں۔جو تجھے مُلکِ مصؔر سے نِکال لایا۔ تُو اپنا مُنہ خُوب کھول اور میں اُسے بھر دوں گا۔ "},
	{11, "11  پر میرے لوگوں نے میری بات نہ سُنی اور اِسراؔئیل مجھ سے رضا مند نہ ہؤا۔ "},
	{12, "12  پس میَں نے اُنکو اُنکے دِل کی بٹ پر چھوڑ دیا تاکہ وہ اپنے ہی مشوروں پر چلیں، "},
	{13, "13  کاشکہ میرے لوگ میری سُنتےاور اِسراؔئیل میری راہوں پر چلتا! "},
	{14, "14  میَں جلد اُنکے دُشمنوں کو مغلوب کردیتا۔ اور اُنکے مُخالِفوں پر اپنا ہاتھ چلاتا۔ "},
	{15, "15  خُداوند سے عداوت رکھنے والے اُسکے تابعِ ہو جاتے اور اُنکا زمانہ ہمیشہ تک بنا رہتا۔ "},
	{16, "16  وہ اِنکو اچھےّ سے اچھّا گیہُوں کھِلاتا اور میَں تجھے چٹان میں کے شہد سے سیر کرتا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view82() {
struct ur82 poems[] = {
	{1, "1  خُدا کی جماعت میں خُدا موجود ہے۔ وہ الہٰوں کے درمیان عدالت کرتا ہے۔ "},
	{2, "2  تُم کب تک بے اِنصافی سے عدالت کروگے۔ اور شریروں کی طرفداری کروگے؟ "},
	{3, "3  غریب اور یتیم کا انصاف کرو۔ غمزدہ اور مُفلِس کے ساتھ اِنصاف سے پیش آؤ۔ "},
	{4, "4  غریب اور محتاج کو بچاؤ شریروں کے ہاتھ سے اُنکو چُھڑاؤ۔ "},
	{5, "5  وہ نہ تو کچھ جانتے ہیں نہ سمجھتے ہیں۔ وہ اندھیرے میں اِدھر اُدھر چلتے ہیں۔ زمین کی سب بنیادیں ہِل گئی ہیں۔ "},
	{6, "6  میَں نے کہا کہ تُم اِلہٰ ہو اور تُم سب حق تعالیٰ کے فرزند ہو۔ "},
	{7, "7  تُو بھی تُم آدمیوں کے فرزند ہو۔ اور اُمرا میں سے کسی کی طرح گر جاؤ گے۔ "},
	{8, "8  اَے خُدا! اُٹھ۔ زمین کی عدالت کر۔ کیونکہ تُو ہی سب قوموں کا مالِک ہو گا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view83() {
struct ur83 poems[] = {
	{1, "1  اَے خُدا !خاموش نہ رہ ۔اَے خُدا چُپ چاپ نہ ہو اور خاموشی اختیار نہ کر! "},
	{2, "2  کیونکہ دیکھ تیرے دُشمن اُودھم مچاتے ہیں اور تجھ سے عداوت رکھنے والوں نے سر اُٹھایا ہے۔ "},
	{3, "3  کیونکہ وہ تیرے لوگوں کے خلاف مکاّری سے منصُوبہ باندھتے ہیں۔ اور اُنکے خلاف جو تیری پناہ میں ہیں مشورہ کرتے ہیں۔ "},
	{4, "4  اُنہوں نے کہا آؤ ہم اِنکو کاٹ ڈالیں کہ اِنکی قُوم ہی نہ رہے اور اِسراؔئیل کے نام کا پھر ذِکر نہ ہو۔ "},
	{5, "5  کیونکہ اُنہوں نے ایکا کر کے آپس میں مشورہ کیا ہے وہ تیرے خلاف عہد باندھتے ہیں۔ "},
	{6, "6  یعنی ادؔوم کے اہلِ خَیمہ اور اسمٰعیلی موآؔب اور ہاجؔری ۔ "},
	{7, "7  جؔبل اور عمّؔون اور عماؔلیِق ۔ فلِستیؔن اور صُوؔر کے باشِندے۔ "},
	{8, "8  اسُوؔر بھی ان سے مِلا ہُوا ہے۔ اُنہوں نے بنی لوُط کی کُمک کی ہے۔ "},
	{9, "9  تُو اُن سے اَیسا کر جَیسا مِدیاؔن سے اور جَیسا وادیِ قیِسُؔون میں سِیؔسر اور یابِیؔن سے کیا تھا۔ "},
	{10, "10  جو عَیؔن دور میں ہلاک ہوئے۔ وہ گویا زمین کی کھاد ہو گئے۔ "},
	{11, "11  اُنکے سرداروں کو عوریؔب اور زئیؔب کی مانند بلکہ اُنکے شاہزادوں کو زِبؔح اور ضلمؔنُع کی مانند بنا دے ۔ "},
	{12, "12  جنہوں نے کہا ہے آؤ ہم خُدا کی بستیوں پر قبضہ کرلیں۔ "},
	{13, "13  اَے میرے خُدا ! اُنکو بگولے کی گرد کی منند بنا دے اور جَیسے ہوا کے آگے ڈنٹھل۔ "},
	{14, "14  اُس آگ کی طرح جو جنگل کو جلا دیتی ہے۔ اُس شُعلہ کی طرح جو پہاڑوں میں آگ لگا دیتا ہے۔ "},
	{15, "15  تُو اِسی طرح اپنی آندھی سے اُنکا پیچھا کر اور اپنے طُوفان سے اُنکو پریشان کر دے۔ "},
	{16, "16  اَے خُداوند! اُنکے چہروں پر رُسوائی طاری کر تاکہ وہ تیرے نام کے طالب ہوں۔ "},
	{17, "17  وہ ہمیشہ شرمِندہ اور پریشان رہیں۔ بلکہ رُسوا ہو کر ہلاک ہو جائیں۔ "},
	{18, "18  تاکہ وہ جان لیں کہ تُو ہی جِسکا نام یہوؔواہ ہے تمام زمین پر بلند و بالا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view84() {
struct ur84 poems[] = {
	{1, "1  اَے لشکروں کے خُداوند ! تیرے مسکن کیا ہی دِلکش ہیں! "},
	{2, "2  میری جان خُداوند کی بارگاہوں کی مُشتاق بلکہ گُداز ہو چلی۔ میرا دِل اور میرا جِسم زِندہ خُدا کے لئے خُوشی سے للکارتے ہیں۔ "},
	{3, "3  اَے لشکروں کے خُداوند! اَے میرے بادشاہ اور میرے خُدا! تیرے مذبحوں کے پاس گَوریّا نے اپنا آشیانہ اور ابابِیل نے اپنے لئے گھونسلا بنا لیا۔ جہاں وہ اپنے بچوں کو رکھے۔ "},
	{4, "4  مُبارک ہیں وہ جو تیرے گھر میں رہتے ہیں۔ وہ سدا تیری تعریف کریں گے۔ "},
	{5, "5  مۃبارِک ہے وہ آدمی جِسکی قُوت تجھ سے ہے۔ جِسکے دِل میں صِیُون کی شاہراہیں ہیں۔ "},
	{6, "6  وہ وادیِ بُکا سے گُذر کر اُس چشموں کی جگہ بنا لیتے ہیں۔ بلکہ پہلی بارِش اُسے برکتوں سے معمور کر دیتی ہے۔ "},
	{7, "7  وہ طاقت پر طاقت پاتے ہیں۔اُن میں سے ہر ایک صِیُون میں خُدا کے حضور حاضر ہوتا ہے۔ "},
	{8, "8  اَےخُداوند لشکروں کے خُدا! میری دُعا سُن۔ اَے یعقُوب کے خُدا!کان لگا۔ "},
	{9, "9  اَے خُدا ! اَے ہماری سِپر! دیکھ اور اپنے ممسُوح کے چہرہ پر نظر کر ۔ "},
	{10, "10  کیونکہ تیری بارگاہوں میں ایک دِن ہزار سے بہتر ہے۔ میَں اپنے خُدا کے گھر کا دربان ہونا شرارت کے خَیموں میں بسنے سے زیادہ پسند کرونگا۔ "},
	{11, "11  کیونکہ خُداوند خُدا آفتاب اور سِپر ہے۔ خُداوند فضل اور جلال بخشیگا۔ وہ راست رَو سے کوئی نعَمت باز نہ رکھّیگا۔ "},
	{12, "12  اَے لشکروں کے خُداوند! مُبارِک ہے وہ آدمی جِسکا توکُل تجھ پر ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view85() {
struct ur85 poems[] = {
	{1, "1  اَے خُداوند! تُو اپنے مُلک پر مہربان رہا ہے ۔ تُو یعقُوب کو اسیری سے وآپس لایا ہے۔ "},
	{2, "2  تُو نے اپنے لوگوں کی بدکاری معُاف کردی ہے۔ تُو نے اُنکے سب گُناہ ڈھانک دِئے ہیں۔ "},
	{3, "3  تُو نے اپنے غضب بالکُل اُٹھا لیا ۔ تُو اپنے قہرِ شدید سے باز آیا ہے۔ "},
	{4, "4  اَے ہمارے نجات دینے والے خُدا! ہمکو بحال کر۔ اپنے غضب ہم سے دُور کر۔ "},
	{5, "5  کیا تُو سدا ہم سے ناراض رہیگا؟ کیا تُو اپنے قہر کو پشت در پُشت جاری رکھیگا؟ "},
	{6, "6  کیا تُو ہمکو پھر زِندہ کریگا تاکہ تیرے لوگ تجھ میں شادمان ہوں ؟ "},
	{7, "7  اَے خُداوند! تُو اپنی شفقت ہمکو دکھا اور اپنی نجات ہمکو بخش۔ "},
	{8, "8  میَں سنُونگا کہ خُداوند خُدا کیا فرماتا ہے۔ کیونکہ وہ اپنے لوگوں اور اپنے مُقدسوں سے سلامتی کی باتیں کریگا۔ پر وہ پھِر حماقت کی طرف رُجُوع نہ کریں۔ "},
	{9, "9  یقیناً اُسکی نجات اُس سے ڈرنے والوں قریب ہے تاکہ جلال ہمارے مُلک میں بسے۔ "},
	{10, "10  شفقت اور راستی باہم مِل گئی ہیں صداقت اور سلامتی نے ایک دوُسرے کا بوسہ لیا ہے۔ "},
	{11, "11  راستی زمین سے نکلتی ہے اور صداقت آسمان پر سے جھانکتی ہے۔ "},
	{12, "12  جو کچھ اچّھا ہے وہی خُداوند عطا فرمائے گا اور ہماری زمین اپنی پیداوار دیگی۔ "},
	{13, "13  صداقت اُسکے آگے آگے چلیگی اور اُسکے نقشِ قدم کو ہماری راہ بنائیگی۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view86() {
struct ur86 poems[] = {
	{1, "1  اَے خُداوند! اپنا کان جھُکا اور مجھے جواب دے۔ کیونکہ میَں مسکین اور محتاج ہُوں۔ "},
	{2, "2  میری جان کی حفاظت کر کیونکہ میَں دءندار ہوں۔ اَے میرے خُدا! اپنے بندہ کو جِسکا توکُل تجھ پر ہے بچا لے۔ "},
	{3, "3  یا رب! مجھ پر رحم کر کیونکہ میَں دن بھر تجھ سے فریاد کرتا ہوُں۔ "},
	{4, "4  یارب! اپنے بندہ کی جان کو شاد کردے۔ کیونکہ میَں اپنی جان تیری طرف اُٹھاتا ہوُں۔ "},
	{5, "5  اِسلئے کہ تُو یارب! نیک اور مُعاف کرنے کو تیار ہے۔ اور اپنے سب دُعا کرنے والوں پر شفقت میں غنی ہے۔ "},
	{6, "6  اَے خُداوند! میری دُعا پر کان لگا۔ اور میری منّت کی آواز پر توّجہ فرما۔ "},
	{7, "7  میَں اپنی مُصیبت کے دِن تجھ سے دُعا کرونگا۔کیونکہ تُو مجھے جواب دے گا۔ "},
	{8, "8  یا رب! معبُودوں میں تجھ سا کوئی نہیں اور تیری صعنتیں بے مثال ہیں۔ "},
	{9, "9  یارب! سب قومین جِنکو تُو نے بنایا آکر تیرے حضُور سجدہ کریں گی۔اور تیرے نام کی تمجید کریں گی۔ "},
	{10, "10  کیونکہ تُو بزرگ ہے اور عجیب و غریب کام کرتا ہے۔ تُو ہی واحد خُدا ہے۔ "},
	{11, "11  اَے خُداوند! مجھکو اپنی راہ کی تعلیم دے۔ میَں تیری راستی میں چلونگا۔ میرے دِل کو یکسُوئی بخش تاکہ تیرے نام کا خُوف مانوں۔ "},
	{12, "12  یارب! میرے خُدا! میں پورے دِل سے تیری تعریف کرونگا۔ میَں ابد تک تیرے نام کی تمجید کروں گا۔ "},
	{13, "13  کیونکہ مجھ پر تیری بڑی شفقت ہے اور تُو نے میری جان کو پاتال کی تہ سے نکالا ہے۔ "},
	{14, "14  اَے خُدا ! مغرور میرے خلاف اُٹھے ہیں اور تُند خُو جماعت میری جان کے پیچھے پڑی ہے اور اُنہوں نے تجھے اپنے سامنے نہیں رکھا۔ "},
	{15, "15  لیکن تُو یارب! رحیم و کریم خُدا ہے۔ قہر کرنے میں دھیما اور شفقت و راستی میں غنی۔ "},
	{16, "16  میری طرف متُوجّہ ہو اور مجھ پر رحم کر ۔ اپنے بندہ کو اپنی قُوت بخش اور اپنی لَونڈی کے بیٹے کو بچا لے ۔ "},
	{17, "17  مجھے بھلائی کا کوئی نشان دکھا۔ تاکہ مجھ سے عداوت رکھنے والے اِسے دیکھکر شرمِندہ ہوں۔ کیونکہ تو نے اَے خُداوند! میری مدد کی اور مجھے تسلی دی ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view87() {
struct ur87 poems[] = {
	{1, "1  اُسکی بُنیاد مُقدسّ پہاڑوں میں ہے۔ "},
	{2, "2  خُداوند صِیُون کے پھاٹکوں کو یعقُوؔب کے سب مسکنوں سے زیادہ عزیز رکھتا ہے۔ "},
	{3, "3  اَے خُدا کے شہر! تیری بڑی بڑی خُبیاں بیان کی جاتی ہیں۔ "},
	{4, "4  میَں رہؔب اور باؔبل کا یوں ذِکر کرونگا کہ وہ میرے جاننے والوں میں ہیں۔ فِلسؔتین اور صُوؔر اور کُوؔش کو دیکھو۔ یہ وہاں پیدا ہُؤا تھا۔ "},
	{5, "5  بلکہ صِیُوؔن کے بارے میں کہا جائیگا کہ فلاں فلاں آدمی اُس میں پیدا ہُوئے اور حق تعالیٰ خود اُسکو قیام بخشیگا۔ "},
	{6, "6  خُداوند قوموں کے شمار کے وقت درج کریگا کہ یہ شخص وہاں پیدا ہُؤا تھا۔ "},
	{7, "7  گانے والے اور ناچنے والے یہی کہینگے کہ میرے سب چشمے تجھ ہی میں ہیں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view88() {
struct ur88 poems[] = {
	{1, "1  اَے خُدا میری نجات دینے والے خُدا! میَں نے رات دِن تیرے حضور فریاد کی ہے۔ "},
	{2, "2  میری دُعا تیرے حضُور پہنچے۔ میری فریاد پر کان لگا۔ "},
	{3, "3  کیونکہ میرا دِل دُکھوں سے بھرا ہے۔اور میری جان پاتال کے نزدِیک پہنچ گئی ہے۔ "},
	{4, "4  میَں گور میں اُترنے والوں کے ساتھ گِنا جاتا ہُوں۔میَں اُس شخص کی مانند ہُوں جو بالُکل بے کس ہو۔ "},
	{5, "5  گویا مقتولوں کی مانند جو قبر میں پڑے ہیں مُردوں کے درمیان ڈال دیا گیا ہوں جِنکو تُو پھِر کبھی یاد نہیں کرتا۔ اور وہ تیرے ہاتھ سے کاٹ ڈالے گئے۔ "},
	{6, "6  تُو نے مجھے گہراؤ میں۔ اندھیری جگہ میں۔ پاتال کی تہ میں رکھا ہے۔ "},
	{7, "7  مجھ پر تیرا قہر بھاری ہے۔ تُو نے اپنی سب مُوجوں سے مجھے دُکھ دُیا ہے ۔ "},
	{8, "8  تُو نے میر ے جان پہچا نو ں کو مجھُ سے دوُر کر دیا۔ تُو نے مجھےُ اُنکے نزدیک گھَنو نا بنا دِیا ۔ "},
	{9, "9  میر ی آ نکھ دُکھ سے دُھند لا چلی ۔ اَے خُدا وند!میُں نے ہر روز تجھُ سے دُعا کی ہے ۔مَیں نے اپنے ہا تھ تیری طرف پھیلائے ہیں ۔ کیا تُو مرُدوں کو عجا ئب دِکھا ئے گا ؟ کیا جو مرگئے ہیں ۔ اُ ٹھکر تیر ی تعر یف کر ینگے ؟ کیا تیر ی شفقت کا چر چا گو ر میں ہو گا یا تیر ی وفا داری کا جہنم میں ؟ "},
	{10, "12  کیا تیر ے عجا ئب کو اندھیرے میں پہچا نینگے اور تیر ی صداقت کو فر امو شی کی سر زمین میں؟ "},
	{11, "13  پر اَے خُداوند !میں نے تیری دُہا ئی دی ہے اور صُبح کو میر ی دُعا تیر ے حُضور ُپہُنچے گی۔ "},
	{12, "14  اَے خُدا وند !تُو کیوں میری جان کو تر ک کرتا ہے ؟ تُو اپنا چہر ہ مجھ سے کیو ں چھپاتا ہے؟ "},
	{13, "15  میَں لڑکپن سے ہی مُصیبت زدہ اور قریبُ المو ُت ہو ں ۔مَیں تیرے ڈر کے ما رے حو اس با ختہ ہو گیا ۔ "},
	{14, "16  تیرا قہر شدِ ید مجھ پر آ پڑا ۔تیر ی دہشتُ نے میرا کام تما م کر دیا۔ "},
	{15, "17  اُس نے دِن بھر سیَلاب کی طرح میرا اِحاطہ کیا۔ اُس نے مجھے با لکل گھیر لیا۔ "},
	{16, "18  تُو نے دوست واحبا ب کو مجھ سے دور کیا ۔اورمیرے جان پہچا نوں کو اندھیرے میں ڈال دِیا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view89() {
struct ur89 poems[] = {
	{1, "1  میَں ہمیشہ خُداوند کی شفقت کے گیت گاؤنگا۔ میَں پُشت در پُشت اپنے مُنہ سے تیری وفاداری کا اعلان کروُنگا۔ "},
	{2, "2  کیونکہ میَں نے کہا کہ شفقت ابدتک بنی رہے گی۔ تُو اپنی وفاداری کو آسمان میں قائم رکھے گا۔ "},
	{3, "3  میَں نے اپنے برگزیدہ کے ساتھ عہد باندھا ہے۔ میَں نے اپنے بندہ داؤؔد سے قسم کھائی ہے۔ "},
	{4, "4  میَں تیری نسل کو ہمیشہ کے لئے قائم کرونگا۔ اور تیرے تخت کو پُشت در پُشت بنائے رکھونگا۔ "},
	{5, "5  اَے خُداوند! آسمان تیرے عجائب کی تعریف کریگا۔ مُقدسوں کے مجمع میں تیری وفاداری کی تعریف ہو گی۔ "},
	{6, "6  کیونکہ افلاک پر خُداوند کا نظیر کُون ہے؟ فرِشتگان میں کُون خُداوند کی مانندہے؟ "},
	{7, "7  اَیسا معبود جو مقُدسوں کی محفل میں نہایت تعظیم کے لائق ہے۔ اور اپنے سب اِرد کِرد والوں سے زیادہ مُہیب ہے۔ "},
	{8, "8  اَے خُداوند لشکروں کے خُدا! اَے یاؔہ ! تجھ سا زبردست کون ہے؟ تیری وفاداری تیرے چوگرد ہے ۔ "},
	{9, "9  سمُندر کے جُوش و خروش پر تُو حُکمرانی کرتا ہے تُو اُس کی اُٹھتی لہروں کو تھما دیتا ہے۔ "},
	{10, "10  تُو نے رہؔب کو مقُتول کی مانند ٹُکڑے ٹُکڑے کیا۔ تُو نے اپنے قوی بازو سے اپنے دُشمنوں کو پراگندہ کر دیا۔ "},
	{11, "11  آسمان تیرا ہے۔ زمین بھی تیری ہے۔ جہان اور اُس کی معموری کو تُو ہی نے قائم کیا۔ "},
	{12, "12  شمال اور جنوب کو پیدا کرنے والا تُو ہی ہے۔تبؔور اور حرؔمون تیرے نام سے خُوشی مناتے ہیں۔ "},
	{13, "13  تیرا بازو قُدرت والا ہے۔تیرا ہاتھ قوی اور تیرا دہنا ہاتھ بلند ہے۔ "},
	{14, "14  صداقت اور عدل تیرے تخت کی بنیاد ہیں۔ شفقت اور وفاداری تیرے آگے آگے چلتی ہیں ۔ "},
	{15, "15  مُبارک ہے وہ قوم جو خُوشی کی للکار کو پہچانتی ہے۔وہ اَے خُداوند! جو تیرے چہرے کے نور میں چلتے ہیں۔ "},
	{16, "16  وہ دِن بھر تیرے نام سے خُوشی مناتے ہیں۔ اور تیری صداقت سے سرفراز ہوتے ہیں۔ "},
	{17, "17  کیونکہ اُن کی قوت کی شان تُو ہی ہے۔اور تیرے کرم سے ہمارا سِینگ بلند ہو گا۔ "},
	{18, "18  کیونکہ ہماری سِپر خُداوند کی طرف سے ہے۔اور ہمارا بادشاہ اِسرائیؔل کے قدوس کی طرف سے ہے۔ "},
	{19, "19  اُس وقت تُو نے رویا میں اپنے مُقدسوں سے کلام کیا اور فرمایا کہ کیں نے ایک زبردست کو مددگار بنایا ہے۔اور قوم مین سے ایک کو چُن کر سرفراز کیا ہے۔ "},
	{20, "20  میرا بندہ داؤُد مجھے مِل گیا ہے۔ اپنے مُقّدس تیل سے میَں نے اُسے مسح کیا ہے۔ "},
	{21, "21  میرا ہاتھ اُس کے ساتھ رہے گا۔میرا بازو اُسے تقویت دے گا۔ "},
	{22, "22  دُشمن اُس پر جَبر نہ کرنے پائے گا اور شرارت کا فرزند اُسے نہ ستائیگا۔ "},
	{23, "23  میَں اُس کے مُخالفوں کو اُس کے سامنے مغلوب کروُں گا میَں اُس سے عداوت رکھنے والوں کو ماروں گا۔ "},
	{24, "24  پر میری وفداری اور شفقت اُس کے ساتھ رہینگی۔اور میرے نام سے اُ سکا سینگ بُلند ہو گا۔ "},
	{25, "25  میَں اُ س کا ہاتھ سمُندر تک بڑھاؤنگا۔اور اُ سکے دہنے ہاتھ کو دریاؤں تک۔ "},
	{26, "26  وہ مھے پُکار کر کہے گا تُو میرا باپ۔میرا خُدا اور میری نجات کی چٹان ہے۔ "},
	{27, "27  میَں اُس کو اپنا پہلوٹھا بناؤ نگا۔ اور دُنیا کا شہنشاہ۔ "},
	{28, "28  میَں اپنی شفقت کو اُسکے لئے ابدتک قائم رکھونگا۔ اور میرا عہد اُس کے ساتھ لا تبدیل رہیگا۔ "},
	{29, "29  میَں اُس کی نسل کو ہمیشہ تک قائم رکھونگا۔ اور اُ سکے تخت کو جب تک آسمان ہے۔ "},
	{30, "30  اگر اُ سکے فرزند میری شریعت کو ترک کر دیں اور میرے احکام پر نہ چلیں۔ "},
	{31, "31  اگر وہ میرے آئین کو توڑیںاور میرے فرمان کو نہ مانیں۔ "},
	{32, "32  تو میَں اُن کو چھڑی سے خطا کی اور کوڑوں سے بدکاری کی سزا دوں گا۔ "},
	{33, "33  لیکن میَں اپنی شفقت اُس پر سے ہٹا نہ لونگا۔اور اپنی وفاداری کو باطل ہونے نہ دوں گا۔ "},
	{34, "34  میَں اپنے عہد کو نہ توڑونگا۔ اور اپنے مُنہ کی بات کو نہ بدلوں گا۔ "},
	{35, "35  میَں ایک بار اپنی قدوسی کی قسم کھا چُکا ہوں۔میَں داؤد سے جھوٹ نہ بولوں گا۔ "},
	{36, "36  اُسکی نسل ہمیشہ قائم رہیگی۔اور اُس کا تخت آفتاب کی مانند میرے حضور قائم رہیگا۔ "},
	{37, "37  وہ ہمیشہ چاند کی طرح اور آسمان کے سّچے گواہ کی مانند قائم رہیگا۔ "},
	{38, "38  لیکن تُو نے تو ترک کر دیا ور چھوڑ دیا۔ تُو اپنے ممسوح سے ناراض ہؤا ہے۔ "},
	{39, "39  تُو نے اپنے خادم کے عہد کو رّد کر دیا ہے۔ تُو نے اُسکے تاج کو خاک میں مِلا دیا۔ "},
	{40, "40  تُو نے اُسکی باڑوں کو توڑ ڈالا۔ تُو نے اُس کے قلعوں کو کھنڈر بنا دیا۔ "},
	{41, "41  سب آنے جانے والے اُسے لوٹتے ہیں۔وہ اپنے پڑوسیوں کی ملامت کا نشانہ بن گیا۔ "},
	{42, "42  تُو نے اُس کے مُخالفوں کے دہنے ہاتھ کو بلند کیا۔ تُو نے اُسکے سب دُشمنوں کو خوش کیا ۔ "},
	{43, "43  بلکہ تُو اُس کی تلوار کی دھار کو موڑ دیتا ہے۔ اور لڑائی میں اُس کے بازو کو جمنے نہیں دیا۔ "},
	{44, "44  تُو نے اُس کی رونق اُڑا دی۔ اور اُسکا تخت خاک میں ملا دیا۔ "},
	{45, "45  تُو نے اُسکی جوانی کے دِن گھٹا دئے۔ تُو نے اُسے شرم آلودہ کر دیا۔ "},
	{46, "46  اَے خُداوند! کب تک ! کیا تُو ہمیشہ ک پوشیدہ رہیگا؟ تیرے قہر کی آگ کب تک بھڑکتی رہیگیَ؟ "},
	{47, "47  یاد رکھ میرا قیام ہی کیا ہے۔تُو نے کِس بطالت کے لئے بنی آدم کو پیدا کیا؟ "},
	{48, "48  وہ کونسا آدمی ہے جو جیتا ہی رہیگا۔اور موت کو نہ دیکھے گا۔ اور اپنی جان کو پاتال کے ہاتھ سے بچا لے گا۔ "},
	{49, "49  یارب! تیری وہ پہلی شفقت کیا ہوئی جِسکی بابت تُو نے داؤؔد سے اپنی وفداری کی قسم کھائی تھی؟ "},
	{50, "50  یارب! اپنے بندوں کی رُسوائی کو یاد کر میَں تو سب زبردست قوموں کی طعنہ زنی اپنے سینے میں لئے پھرتا ہوں۔ "},
	{51, "51  اَے خُداوند! تیرے دُشمنوں نے کیَسسے طعنے مارے۔ تیرے ممسوح کے قدم قدم پر کیَسی طعنہ زنی کی ہے۔ "},
	{52, "52  خُداوند ابدالاآباد مُبارک ہو! آمین ثُم آمین۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view90() {
struct ur90 poems[] = {
	{1, "1  یارب! پُشت در پُشت تُو ہماری پناہ گاہ رہا ہے۔ "},
	{2, "2  اِس سے پیشتر کہ پہاڑ پیدا ہوئے یا زمین اور دُنیا کو تُو نے بنایا۔ ازل سے ابدتک تُو ہی خُدا ہے۔ "},
	{3, "3  تُو انسان کو پھر خاک میں ملا دیتا ہے اور فرماتا ہے اَے بنی آدم! لَوٹ آؤ۔ "},
	{4, "4  کیونکہ تیری نظر میں ہزار برس اَیسے ہیں جَسے کل کا دِن جو گُذر گیا۔اور جَیسے رات کا ایک پہر۔ "},
	{5, "5  تُو اُنکو گویا سیلاب سے بہا لے جاتا ہے۔ وہ نیندد کی ایک جھپکی کی مانند ہیں۔وہ صُبح کو اُگنے والی گھاس کی مانند ہیں۔ "},
	{6, "6  وہ صُبح کو لہلہاتی اور بڑھتی ہے وہ شام کو کٹتی اور سُوکھ جاتی ہے۔ "},
	{7, "7  کیونکہ ہم تیرے قہر سے فنا ہو گئے اور تیرے غضب سے پریشان ہُوئے۔ "},
	{8, "8  تُو نے ہماری بدکاری کو اپنے سامنے رکھا۔اور ہمارے پوشیدہ گُناہوں کو اپنے چہرہ کی روشنی میں۔ "},
	{9, "9  کیونکہ ہمارے تمام دِن تیرے قہر میں گُذرے۔ ہماری عمر خیال کی طرح جاتی رہتی ہے۔ "},
	{10, "10  ہماری عمر کی میعاد ستّر برس تک ہے۔ یا قوت ہو تو اَسّی برس۔تو بھی اُنکی رونق محض مشقّت اور غم ہے۔کیونکہ وہ جلد جاتی رہتی ہے اور ہم اُڑ جاتے ہیں۔ "},
	{11, "11  تیرے قہر کی شدت کو کون جانتا ہے اور تیرے خُوف کے مُطابق غضب کو؟ "},
	{12, "12  ہمکو اپنے دِن گِننا سِکھا ۔ اَیسا کہ ہم دانا دِل حاصل کریں۔ "},
	{13, "13  اَے خُداوند! باز آ۔ کب تک؟ اور اپنے بندوں پر رحم فرما۔ "},
	{14, "14  صُبح کو اپنی شفقت سے ہمکو آسودہ کر تاکہ ہم عُمر بھر خُوش و خُرم رہیں۔ "},
	{15, "15  جِتنے دِن تُو نےہمکودُکھ دیا اور جِتنے برس ہم مُصیبت میں رہے اُتنی ہی خُوشی ہمکو عنایت کر۔ "},
	{16, "16  تیرا کلام تیرے بندوں پر اور تیرا جلال اُنکی اولاد پر ظاہر ہو۔ "},
	{17, "17  اور رب ہمارے خُدا کا کرم ہم پر سایہ کرے۔ہمارے ہاتھوں کے کام کو ہمارے لئے قیام بخش ہاں ہمارے ہاتھوں کے کام کو قیام بخش دے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view91() {
struct ur91 poems[] = {
	{1, "1  جو حق تعالیٰ کے پردہ میں رہتا ہے۔ وہ قادرِ مُطلق کے سایہ میں سکونت کریگا۔ "},
	{2, "2  میَں خُداوند کے بارے میں کہونگا وہی میری پناہ اور میرا گڑھ ہے۔وہ میرا خُدا ہے جِس پر میرا توکُل ہے۔ "},
	{3, "3  کیونکہ وہ تجھے صیاد کے پھندے سے اور مُہلک وبا سے چھوڑئیگا۔ "},
	{4, "4  وہ تجھے اپنے پروں سے چھُپا لیگا۔ اور تجھے اُس کے بازؤں کے نیچے پناہ ملے گی۔اُس کی سچّائی ڈھال اور سِپر ہے۔ "},
	{5, "5  تُو نہ رات کی ہیبت سے ڈرے گا۔نہ دِن کو اُڑنے والے تیر سے۔ "},
	{6, "6  نہ اُس وبا سے جو اندھیرے میں چلتی ہے۔نہ اُس ہلاکت سے جو دوپہر کو ویران کرتی ہے۔ "},
	{7, "7  تیرے آسپاس ایک ہزار گِر جائیں گے۔اور تیرے دہنے ہاتھ کی طرف دس ہزار لیکن وہ تیرے نزدیک نہ آئیگی۔ "},
	{8, "8  لیکن تُو اپنی آنکھوں سے نگاہ کرے گا۔اور شریروں کے انجام کو دیکھے گا۔ "},
	{9, "9  پر تُو اَے خُداوند ! میری پناہ ہے! تُو نے حق تعالیٰ کو اپنا مسکن بنا لیا ہے۔ "},
	{10, "10  تجھ پر کوئی آفت نہ آئیگی۔اور کوئی وبا تیرے خیمہ کے نزدیک نہ پہنچیگی۔ "},
	{11, "11  کیونکہ وہ تیری بابت اپنے فرِشتوں کو حُکم دے گا۔کہ تیری سب راہوں میں تیری حفاظت کریں۔ "},
	{12, "12  وہ تجھے اپنے ہاتھوں پر اُٹھا لیں گے۔تاکہ ایسا نہ ہو کہ تیرے پاؤں کو پتھر سے ٹھیس لگے۔ "},
	{13, "13  تُو شیر ببراور افعی روندیگا۔تُو جوان شیر اور اژدہا کو پامال کریگا۔ "},
	{14, "14  چوُنکہ اُس نے مجھ سے دل لگایا ہے۔اِسلئے میَں اُسے چھڑاؤنگا۔میَں اُسے سرفراز کرونگا۔ کیونکہ اُس نے میرا نام پہچانا ہے۔ "},
	{15, "15  وہ مجھے پُکاریگا اور میَں اُسے جواب دونگا۔میں مُصیبت میں اُس کے ساتھ رہوں گا۔ میَں اُسے چھُڑاؤنگااور عزت بخشونگا۔ "},
	{16, "16  میَں اُسے عمر کی درازی سے آسُودہ کرنگا۔ اور اپنی نجات اُسے دکھاؤں گا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view92() {
struct ur92 poems[] = {
	{1, "1  کیا ہی بھلا ہے خُداوند کا شُکر کرنا اور تیرے نام کی مدح سرائی کرنا اَے حق تعالیٰ! "},
	{2, "2  صُبح کو تیری شفقت کا اظہار کرنا اور رات کو تیری وفاداری کا۔ "},
	{3, "3  دس تار والے ساز اور بربط پر اور سِتار پر گونجتی آواز کے ساتھ۔کیونکہ اَے خُداوند! تُو نے اپنے کام سے خُوش کیا۔ میَں تیری صعنت کاری کے سبب سے شادیانہ بجاؤں گا۔ "},
	{4, "5  اَے خُداوند! تیری صنعتیں کیسی بڑی ہیں! تیرے خیال بہت عمیق ہیں۔ "},
	{5, "6  حیوان خصلت نہیں جانتا اور احمق اِسکو نہیں سمجھتا ہے۔ "},
	{6, "7  جب شریر گھاس طرح اُگتے ہیں اور سب بدکردار پھُولتے پھلتے ہیں تو یہ اِسی لئے ہے کہ وہ ہمیشہ کے لئے فنا ہوں۔ "},
	{7, "8  لیکن تُو اَے خُداوند! ابدُالآباد بلند ہے۔ "},
	{8, "9  کیونکہ دیکھ! اَے خُداوند! تیرے دُشمن۔ دیکھ! تیرے دُشمن ہلاک ہو جائینگے۔سب بد کردار پرگندہ کر دئے جائینگے۔ "},
	{9, "10  لیکن تُو نے میرے سینگ کو جنگلی سانڈ کے سینگ کی مانند بلند کیا ہے۔ مجھ پر تازہ تیل ملا گیا ہے۔ "},
	{10, "11  میری آنکھ نے میرے دُشمنوں کو دیکھ لیا ہے۔میرے کانوں نے مُخالف بدکاروں کا حال سُن کیا ہے۔ "},
	{11, "12  صادق کھجور کے درخت کی مانند سر سبز ہو گا۔ وہ لبنؔان کے دیودار کی طرح بڑھیگا۔ "},
	{12, "13  جو خُداوند کے گھر میں لگائے گئے ہیں وہ ہمارے خُدا کی بارگاہوں میں سر سبز ہونگے۔ "},
	{13, "14  وہ بڑھاپے میں بھی برومند ہونگے۔ وہ تروتازہ اور سرسبز رہینگے۔ "},
	{14, "15  تاکہ واضح کریں کہ خُدا راست ہے۔ وہی میری چٹان ہے اور اُس میں ناراستی نہیں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view93() {
struct ur93 poems[] = {
	{1, "1  خُداوند سطلنت کرتا ہے۔ وہ شوکت سے مُلبس ہے۔ کُداوند قدرت سے مُلبس ہے۔وہ اُس سے کمر بستہ ہے۔اِسلئے جہان قائم ہے اور اُسے جُنبش نہیں۔ "},
	{2, "2  تیرا تخت قدیم سے قائم ہے۔ تُو ازل سے ہے۔ "},
	{3, "3  سَیلابوں نے شور مچا رکھا ہے۔سَیلاب موجزن ہیں۔ "},
	{4, "4  بھروں کی ااواز سے سُمندر کی زبردست موجوں سے بھی خُداوند بُلند و قادِر ہے۔ "},
	{5, "5  تیری شہادتوں بالکُل سچّی ہیں۔ اَے خُداوند ! ابدُآلاباد کے لئے قُدُوسیِت تیرے گھر کو زیبا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view94() {
struct ur94 poems[] = {
	{1, "1  اَے خُداوند! اَے انتقام لینے والے خُداوند! اَے انتقام لینے والے خُدا! جلوہ گر ہو۔ "},
	{2, "2  اَے جہان کا انصاف کرنے والے! اُٹھ۔ مغرورں کو بدلہ دے۔ "},
	{3, "3  اَے خُداوند! شریر کب تک شریر کب تک شادیانہ بجایا کرینگے؟ "},
	{4, "4  وہ بکواس کرتے اور برا بول بولتے ہیں۔ سب بدکردار لافزنی کرتے ہیں۔ "},
	{5, "5  اَے خُداوند! وہ تیرے لوگوں کو پیسے ڈالتے ہیں اور تیری میراث کو دُکھ دیتے ہیں۔ "},
	{6, "6  وہ بیوہ اور پردیسی کو قتل کرتے اور یتیم کو مار دالتے ہیں۔ "},
	{7, "7  اور کہتے ہیں خُداوند نہیں دیکھیگا۔ اور یعقُوب کا خُدا خیال نہیں کرے گا۔ "},
	{8, "8  اَے قوم کے حیوانو! ذرا خیال کرو؟ اَے احمقو ! تمہیں کب عقل آئے گی؟ "},
	{9, "9  جِس نے کان دیا کیا وہ خُود نہیں سُنتا؟ جِس نے آنکھ بنائی کیا وہ دیکھ نہیں سکتا؟ "},
	{10, "10  کیا وہ قوموں کو تنبیہ کرتا ہے۔اور اِنسان کو دانش سِکھاتا ہے سزا نہ دیگا؟ "},
	{11, "11  خُداوند انسان کے خِیالوں کو جانتا ہے کہ وہ باطل ہیں۔ "},
	{12, "12  اَے خُداوند! مُبارِک ہے وہ آدمی جِسے تُو تنبیہ کرتا اور اپنی شریعت کی تعلیم دیتا ہے۔ "},
	{13, "13  تاکہ اُسکو مُصیبت کے دِنوں میں آرام بخشے جب تک شریر کے لئے گڑھا نہ کھودا جائے۔ "},
	{14, "14  کیونکہ خُداوند اپنے لوگون کو ترک نہیں کریگا اور وہ اپنی میراث کو نہیں چھُوڑیگا۔ "},
	{15, "15  کیونکہ عدل صداقت کی طرف رجوع کریگا اور سب راست دِل اُسکی پیَروی کرینگے۔ "},
	{16, "16  شریروں کے مُقابلہ میں کوَن میرے لئے اُٹھیگا؟ بدکرداروں کے خلاف کون میرے لئے کھڑا ہو گا؟ "},
	{17, "18  جَب میَں نے کہا میرا پاؤں پھِسل چلا تو اَے خُداوند ! تیری شفقت نے مجھے سنبھال لیا۔ "},
	{18, "19  جب میرے دِل میں فِکروں کی کثرت ہوتی ہے تو تیری تسلی میری جان کو شاد کرتی ہے۔ "},
	{19, "20  کیا شرارت کے تخت سے تجھے کچھ واسطہ ہو گا جو قانون کی آڑ میں بدی گھڑتا ہے؟ "},
	{20, "21  وہ صادق کی جان لینے کو اکٹھے ہوتے ہیں اور بے گُناہ پر قتل کا فتویٰ دیتے ہیں۔ "},
	{21, "22  لیکن خُداوند میرا اُونچا بُرج اور میرا خُدا میری پناہ کی چٹان رہا ہے۔ "},
	{22, "23  وہ اُنکی بدکاری اُن ہی پر لائیگا اور اُن کی شرارت میں اُنکو کاٹ ڈالیگا خُداوند ہمارا خُدا اُنکو کاٹ ڈالیگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view95() {
struct ur95 poems[] = {
	{1, "1  آؤ ہم خُداوند کے حضور نغمہ سرائی کریں! اپنی چٹان کے سامنے خُوشی سے للکاریں۔ "},
	{2, "2  شُکر گُزاری کرتے ہوئے اُس کے حُضور حاضر ہوُں۔مزموُر گاتے ہوئے اُس کے آگے خُوشی سے للکاریں۔ "},
	{3, "3  کیونکہ خُداوند خُدایِ عظیم ہے۔اور سب اِلہوں پر شاہِ عظیم ہے۔ "},
	{4, "4  زمین کے گہراؤ اُس کے قبضہ میں ہیں پہاڑوں کی چوٹیاں بھی اُسی کی ہیں۔ "},
	{5, "5  سُمندر اُسکا ہے۔ اُسی نے اُس کو بنایا۔ اور اُسی کے ہاتھو ں نے خُشکی کو بھی تیار کیا ۔ "},
	{6, "6  آؤ ہم جھُکیں اور سجدہ کریں! اور اپنے خالِق خُداوند کے حُضوُر گھُٹنے تیکیں۔ "},
	{7, "7  کیونکہ وہ ہمارا خُدا ہے اور ہم اُس کی چراگاہ کے لوگ اور اُس کے ہاتھ کی بھیڑیں۔کاشکہ آج کے دِن تُم اُس کی آواز سُنتے ! "},
	{8, "8  تُم اپنے دِل کو سخت نہ کرو جَیسا مرِیؔبہ میں جَیسا مسّؔاہ کے دِن بیابان میں کیا تھا۔ "},
	{9, "9  اُس وقت تمہارے باپ دادا نے مجھے آزمایا۔ اور میرا امتحان کیا اور میرے کام کو بھی دیکھا۔ "},
	{10, "10  چالیس برس تک میَں اُس نسل سے بَیزار رہا اور میَں نے کہا کہ یہ وہ لوگ ہیں جِنکے دِل آوارہ ہیں اور اُنہوں نے میری راہوں کو نہیں پہچانا۔ "},
	{11, "11  چُنانچہ میَں نے اپنے غضب میں قسم کھائی کہ یہ لوگ میرے آرام میں داخل نہ ہوں گے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view96() {
struct ur96 poems[] = {
	{1, "1  خُداوند کے حُضُور نیا گیت گاؤ۔ اَے سب اہل زمین! خُداوند کے حُضُور گاؤ۔ "},
	{2, "2  خُداوند کے حضُور گاؤ۔اُسکے نا م کومُبا رک کہو ۔روز بروز اُسکی نجا ت کی بشارت دو۔ "},
	{3, "3  قوموں میں اُسکے جلال کا سب لوگوں میں اُسکے عجائب کا بیان کرو ۔ "},
	{4, "4  کیونکہ خُداوند بُزرگ اور نہایت ستایش کے لائق ہے۔ وہ سب معبودوں سے زیادہ تعظیم کے لائق ہے۔ "},
	{5, "5  اِسلئے کہ اور قوموں کے سب معبُود محض بُت ہیں لیکن خُداوندنے آسمانوں کو بنایا۔ "},
	{6, "6  عظمت اور جلال اُسکے حُضور ہیں۔ قُسرت اور جمال اُسکے مقدس میں۔ "},
	{7, "7  اَے قوموں کے قبیلو! خُداوند کی۔ خُداوند کی تمجید و تعظیم کرو۔ "},
	{8, "8  خُداوند کی اَیسی تمجید کرو جو اُسکے نام کے شایان ہے۔ ہدیہ لاؤ اور اُسکی بارگاہوں میں آؤ۔ "},
	{9, "9  پاک آرایش کے ساتھ خُداوند کو سجدہ کرو اَے سب اہلِ زمین ! اُسکے حُضور کانپتے رہو۔ "},
	{10, "10  قوموں میں اعلان کرو کہ خُداوند سلطنت کرتا ہے۔ جہان قائم ہے اور اُسے جنبش نہیں۔ وہ راستی سے قوموں کی عدالت کریگا۔ "},
	{11, "11  آسمان خُوشی منائے اور زمین شادمان ہو۔ سُمندر اور اُسکی معمُوری شور مچائیں۔ "},
	{12, "12  میَدان اور جو کچھ اُس میں ہے باغ باغ ہوں۔ تب جنگل کے سب درخت خُوشی سے گانے لگینگے۔ "},
	{13, "13  خُداوند کے حُضُور ۔ کیونکہ وہ آرہا ہے۔ وہ زمین کی عدالت کرنے کو آ رہا ہے۔ وہ صداقت سے جہان کی اور اپنی سچّائی سے قوموں کی عدالت کریگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view97() {
struct ur97 poems[] = {
	{1, "1  خُداوند سلطنت کرتا ہے۔ زمین شادمان ہو۔ بے شُمار جزیرے خُوشی منائیں۔ "},
	{2, "2  بادل اور تاریکی اُسکے اِردگرد ہیں۔صداقت اور عدل اُسکے تخت کی بنیاد ہیں۔ "},
	{3, "3  آگ اُسکے آگے آگے چلتی ہے۔ اور چاروں طرف اُسکے مُخالفوں کو بھسم کر دیتی ہے۔ "},
	{4, "4  اُسکی بجلیوں نے جہان کو روشن کردیا۔ زمین نے دیکھا اور کانپ گئی۔ "},
	{5, "5  خُداوند کے حُضُور پہاڑ موم کی طرح پگھل گئے ۔ یعنی ساری زمین کے خُداوند کے حُضُور۔ "},
	{6, "6  آسمان اُسکی صداقت ظاہر کرتا ہے۔ سب قوموں نے اُسکا جلال دیکھا ہے۔ "},
	{7, "7  کھُدی ہوئی مورتوں کے سب پوجنے والے جو بتوں پر فخر کرتے ہیں شرمندہ ہوں۔ اَے معبودو! سب اُسکو سجدہ کرو۔ "},
	{8, "8  اَے خُداوند! صِیُوؔن نے سُنا اور خُوش ہوئی اور یہؔووُا کی بیٹیاں تیرے احکام سے شادمان ہوئیں۔ "},
	{9, "9  کیونکہ اَے خُداوند! تُو تمام زمین پر بُلندوبالا ہے تُو سب معبوُدوں سے نہایت اعلیٰ ہے۔ "},
	{10, "10  اَے خُداوند سے مُحبت رکھنے والو! بدی سے نفرت کرو وہ اپنے مُقدسوں کی جانوں کو محفوظ رکھتا ہے۔ وہ اُنکو شریروں کے ہاتھ سے چھُڑاتا ہے۔ "},
	{11, "11  صادقوں کے لئے نُور بویا گیا ہے اور راست دِلوں کے لئے خُوشی۔ "},
	{12, "12  اَے صادِقو! خُداوند میں خُوش رہو اور اُسکے پاک نام کا شُکر کرو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view98() {
struct ur98 poems[] = {
	{1, "1  خُداوند کے حُضُور نیا گیت گاؤ کیونکہ اُس نے عجیب کام کئے ہیں اُسکے دہنے ہاتھ اور اُسکے مُقدّس بازو نے اُسکے لئے فتح حاصل کی ہے۔ "},
	{2, "2  خُداوند نے اپنی نجات ظاہر کی ہے۔ اُس نے اپنی صداقت قوموں کے سامنے نمایاں کی ہے۔ "},
	{3, "3  اُس نے اِسرؔائیل کے گھرانے کے حق میں اپنی شفقت و وفاداری یاد کی ہے۔ اِنتہایِ زمین کے لوگوں نے ہمارے خُدا کی نجات دیکھی ہے۔ "},
	{4, "4  اَے تمام اہل زمین! خُداوند کے حُضُور خُوشی کا نعرہ مارو للکارو اور خُوشی سے گاؤ اور مدح سرائی کرو۔ "},
	{5, "5  خُداوند کی ستایش سِتار پر کرو۔ "},
	{6, "6  نرسِنگے اور قرنا کی آواز سے بادشاہ یعنی خُداوند کے حُضُور خُوشی کا نعرہ مارو۔ "},
	{7, "7  سُمندر اور اُسکی معمُوری شور مچائیں اور جہان اور اُسکےباشِندے ۔ "},
	{8, "8  سَیلاب تالیاں بجائیں پہاڑیاں مِلکر خُوشی سے گائیں۔ "},
	{9, "9  خُداوند کے حُضُور ۔ کیونکہ وہ زمین کی عدالت کرنے آ رہا ہے۔ وہ صداقت سے جہان کی اور راستی سے قوموں کی عدالت کریگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view99() {
struct ur99 poems[] = {
	{1, "1  خُداوند سلطنت کرتا ہے قومیں کانپیں۔ وہ کرُوبیوں پر بیٹھتا ہے ۔ زمین لرزے۔ "},
	{2, "2  خُداوند صِیُؔون میں بُزرگ ہے اور وہ سب قوموں پر بُلند و بالا ہے۔ "},
	{3, "3  وہ تیرے بزرگ اور مُہیب نام کی تعریف کریں۔ وہ قُدوُّس ہے۔ "},
	{4, "4  بادشاہ کی قوت اِنصاف پسند ہے تُو راستی کو قائم کرتا ہے۔ تُو ہی نے عدل اور صداقت کو یعقُؔوب میں رائج کیا۔ "},
	{5, "5  تُم خُداوند ہمارے خُدا کی تمجید کرو۔ اور اُسکے پاؤں کی چوکی پر سِجدہ کرہ۔ وہ قدوس ہے۔ "},
	{6, "6  اُسکے کاہنوں میں سے موؔسیٰ اور ہارُؔون نے اور اُسکا نام لینے والوں میں سے سموئیؔل نے خُداوند سے دُعا کی اور اُس نے اُنکو جواب دیا۔ "},
	{7, "7  اُس نے بادل کے ستون میں سے اُن سے کلام کیا اُنہوں نے اُسکی شہادتوں کو اور اُس آئین کو جو اُس نے اُنکو دیا تھا مانا۔ "},
	{8, "8  اَے خُداوند ہمارے خُدا! تُو اُنکو جواب دیتا تھا۔ تُو وہ خُدا ہے جو اُنکو مُعاف کرتا رہا۔ اگرچہ تُو نے اُنکے اعمال کا بدلہ دیا۔ "},
	{9, "9  تُم خُداوند ہمارے خُدا کی تمجید کرو اور اُسکے مُقدس پہاڑ پر سجدہ کرو۔ کیونکہ خُداوند ہمارا خپدا قُدوُّس ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view100() {
struct ur100 poems[] = {
	{1, "1  اَے اہلِ زمین! سب خُداوند کے حُضُور خُوشی کا نعرہ مارو۔ "},
	{2, "2  خُوشی سے خُداوند کی عبادت کرو۔ گاتے ہوئے اُسکے حُضُور حاضر ہو۔ "},
	{3, "3  جان رکھو کہ خُداوند ہی خُدا ہے۔ اُسی نے ہمکو بنایا اور ہم اُسی کے ہیں۔ ہم اُسکے لوگ اور اُسکی چراگاہ کی بھیڑیں ہیں۔ "},
	{4, "4  شُکر گُذاری کرتے ہوئے اُسکے پھاٹکوں میں اور حمد کرتے ہوئے اُسکی بارگاہوں میں داخل ہو۔ اُسکا شُکر کرو اور اُسکے نام کو مُبارِک کہو۔ "},
	{5, "5  کیونکہ خُداوند بھلا ہے۔ اُسکی شفقت ابدی ہے وہ اُسکی وفاداری پُشت در پُشت رہتی ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view101() {
struct ur101 poems[] = {
	{1, "1  میَں شفقت اور عدل کا گیت گاؤں گا۔اَے خُداوقند ! میَں تیری مدح سرائی کرونگا۔ "},
	{2, "2  میَں عقلمندی سے کامل راہ پر چلونگا۔ تُو میرے پاس کب آئے گا؟ گھر میں میری روِش خُلوصِ دل سے ہو گی ۔ "},
	{3, "3  میَن کِسی خباثت کو مدِنظر نہیں رکھونگا۔ مجھے کج رفتاروں کے کام سے نفرت ہے۔ اُسکو مجھ سے کچھ سروکار نہ ہوگا۔ "},
	{4, "4  کج دِلی مجھ سے دور ہو جائیگی۔ میَں کسی بُرائی سے آشنا نہ ہونگا۔ "},
	{5, "5  جو در پردہ اپنے ہمسایہ کی غیبت کرے میَں اُسے ہلاک کر ڈالونگا۔ میَں بُلند نظر اور مغرور دِل کی برداشت نہ کرونگا۔ "},
	{6, "6  مُلک کے ایمانداروں پر میری نگاہ ہو گی تاکہ وہ میرے ساتھ رہیں۔ جو کامل راہ پر چلتا ہے وہی میری خدمت کریگا۔ "},
	{7, "7  دغا باز میرے گھر میں رہنے نہ پائے گا۔دروغگو کو میرے رُوبروُ قیام نہ ہو گا۔ "},
	{8, "8  میَں ہر صُبح مُلک کے سب شریروں کو ہلاک کیا کرونگا تاکہ خُداوند کے شہر سے بدکاروں کا کاٹ ڈالوں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view102() {
struct ur102 poems[] = {
	{1, "1  اَے خُداوند! میری دُعا سُن اور میری فریاد تیرے حُضُور پہنچے۔ "},
	{2, "2  میری مُصیبت کے دِن مجھ سے روپوش نہ ہو۔ اپنا کان میری طرف جھُکا جِس دِن میں فریاد کروں مجھے جلد جواب دے۔ "},
	{3, "3  کیونکہ میرے دِن دھوئیں کی طرح اُڑ جاتے ہیں۔ اور میری ہڈیاں ایندھن کی طرح جل گئیں۔ "},
	{4, "4  میرا دِل گھاس کی طرح جھُلسکر سُوکھ گیا۔ کیونکہ میَں اپنی روٹی کھانا بھول جاتا ہوں۔ "},
	{5, "5  کراہتے کراہتے میری ہڈیاں میرے گوشت سے جالگیں۔ "},
	{6, "6  میَں جنگلی حواصِل کی مانند ہُوں۔ میَں ویرانے کا اُلوّ بن گیا۔ "},
	{7, "7  میَں بیَخواب اور اُس گورے کی مانند ہو گیا ہُوں جو چھت پر اکیلا ہو۔ "},
	{8, "8  میرے دُشمن مجھے دِن بھر ملامت کرتے ہیں۔ میرے مُخالِف دیوانہ ہو کر مجھ پر لعنت کرتے ہیں۔ "},
	{9, "9  کیونکہ میَں نے روٹی کی طرح راکھ کھائی اور آنسُو مِلا کر پانی پیا۔ "},
	{10, "10  یہ تیرے غضب اور قہر کے سبب سے ہے کیونکہ تُو نے مجھے اُٹھایا اور پھر پٹک دیا۔ "},
	{11, "11  میرے دِن ڈھکنے والے سایہ کی مانند ہیں۔ اور میَں گھاس کی طرح مُرجھا گیا ہوں، "},
	{12, "12  لیکن تُو اَے خُداوند! ابدتک رہیگا۔ اور تیری یادگار پُشت در پُشت رہیگی۔ "},
	{13, "13  تُو اُٹھیگا اور صِیوُؔن پر رحم کریگا۔ کیونکہ اُس پر ترس کھانے کا وقت ہے ہاں اُس کا مُعیِن وقت آ گیا ہے۔ "},
	{14, "14  اِسلئے کہ تیرے بندے اُسکے پتھروں کو چاہتے اور اُسکی خاک پر ترس کھاتے ہیں۔ "},
	{15, "15  اور قوموں کو خُداوند کے نام کا اور زمین کے سب بادشاہوں کو تیرے جلال کا خُوف ہو گا۔ "},
	{16, "16  کیونکہ خُداوندنے صِیُوؔن کو بنایا ہے۔ وہ اپنے جلال میں ظاہر ہُؤا ہے۔ "},
	{17, "17  اُس نے بے کسوں کی دُعا پر توجّہُ کی اور اُن کی دُعا کو حقیر نہ جانا۔ "},
	{18, "18  یہ آیندہ پُشت کے لئے لِکھا جائیگا۔اور ایک قوم پیدا ہو گی جو خُداوند کی ستایش کریگی۔ "},
	{19, "19  کیونکہ اُس نے اپنے مقدِس پر سے نگاہ کی ۔ خُداوند نے آسمان پر سے زمین پر نطر کی۔ "},
	{20, "20  تاکہ اسیر کا کراہنا سُنے اور مرنے والوں کو چھُڑالے۔ "},
	{21, "21  تاکہ لوگ صِیُؔون میں خُداوند کے نام کا اظہار اور یروشؔلیم میں اُس کی تعریف کریں۔ "},
	{22, "22  جب خُداوند کی عبادت کے لئے قومیں اور مملکتیں مِلکر جمع ہوں۔ "},
	{23, "23  اُس نے راہ میں میرا زور گھٹا دیا ۔ اُس نے میری عمر کوتاہ کر دی۔ "},
	{24, "24  میَں نے کہا اَے خُدا! مجھے آدھی عمر میں نہ اُٹھا تیرے برس پُشت در پُشت ہیں۔ "},
	{25, "25  تُو نے قدیم سے زمین کی بنیاد ڈالی۔ آسمان تیرے ہاتھ کی صعنت ہے۔ "},
	{26, "26  وہ نیست ہو جائینگے پر تُو باقی رہیگا۔ بلکہ وہ سب پوشاک کی مانند پُرانے ہو جائینگے تُو اُنکو لِباس کی مانند بدلیگا اور وہ بدل جائینگے۔ "},
	{27, "27  پر تُو لا تبدیل ہے۔ اور تیرے برس لااِنتہا ہونگے۔ "},
	{28, "28  تیرے بندوں پرزند برقرار رہینگے اور اُنکی نسل تیرے حُضُور قائم رہیگی۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view103() {
struct ur103 poems[] = {
	{1, "1  اَے میری جان ! خُداوند کو مُبارِک کہہ اور جو کچھ مجھ میں ہے اُسکے قُدوُّس نام کو مُبارِک کہے۔اَے میری جان! خُداوند کو مُبارِک کہہ اور اُس کی کِسی نعمت کو فراموش نہ کر "},
	{2, "3  وہ تیری ساری بدکاری بخشتا ہے۔ وہ تجھے تمام بیماریوں سے شِفا دیتا ہے۔ "},
	{3, "4  وہ تیری جان ہلاکت سے بچاتا ہے۔ وہ تیرے سر پر شفقت و رحمت کا تاج رکھتا ہے۔ "},
	{4, "5  وہ تجھے عُمر بھر اچھی اچھی چیزوں سے آسوُدہ کرتا ہے۔تُو عقاب کی مانند از سِر نَوجوان ہوتا ہے۔ "},
	{5, "6  خُداوند سب مظلوموں کے لئے صداقت اور عدل کے کام کرتا ہے۔ "},
	{6, "7  اُس نے اپنی راہیں مُوؔسیٰ پر اور اپنے کام بنی اِسرائؔیل پر ظاہر کئے ۔ "},
	{7, "8  خُداوند رحیم اور کریم ہے۔ قہر کرنے میں دھیما اور شفقت میں غنی۔ "},
	{8, "9  وہ سدا جھڑکتا نہ رہیگا۔ وہ ہمیشہ غضبناک نہ رہیگا۔ "},
	{9, "10  اُس نے ہمارے گُناہوں کے مُوافق ہم سے سُلوک نہیں کیا اور ہماری بدکاریوں کے مُطابق ہمکو بدلہ نہیں دیا۔ "},
	{10, "11  کیونکہ جِس قدر آسمان زمین سے بلند ہے اُسی قدر اُسکی شفقت اُن پر ہے جو اُس سے ڈرتے ہیں۔ "},
	{11, "12  جَیسے پُورب پچھّم سے دوُر ہے ویسے ہی اُس نے ہماری خطائیں ہم سے دوُر کر دیں۔ "},
	{12, "13  جَیسے باپ اپنے بیٹوں پر ترس کھاتا ہے وَیسے ہی خُداوند اُن پر جو اُس سے ڈرتے ہیں ترس کھاتاہے۔ "},
	{13, "14  کیونکہ وہ ہماری سِرشت سے واقف ہے۔ اُسے یاد ہے کہ ہم خاک ہیں۔ "},
	{14, "15  اِنسان کی عُمر تو گھاس کی مانند ہے۔ وہ جنگلی پھُول کی طرح کھِلتا ہے۔ "},
	{15, "16  کہ ہوا اُس پر چلی اور وہ نہیں اور اُسکی جگہ اُسے پھر نہ دیکھیگی۔ "},
	{16, "17  لیکن خُداوند کی شفقت اُس سے ڈرنے والوں پر ازل سے ابدتک اور اُسکی صداقت نسل در نسل ہے۔ "},
	{17, "18  یعنی اُن پر جو اُسکے عہد پر قائم رہتے ہیں۔اور اُسکے قوانین پر عمل کرنا یاد رکھتے ہیں۔ "},
	{18, "19  خُداوند نے اپنا تخت آسمان پر قائم کیا ہے۔اور اُسکی سلطنت سب پر مُسلّط ہے۔ "},
	{19, "20  اَے خُداوند کے فرِشتو! اُسکو مُبارِک کہہ۔ تُم جو زور میں بڑھکر ہو اور اُسکے کلام کی آواز سُنکر اُس پر عمل کرتے ہو۔ "},
	{20, "21  اَے خُداوند کے لشکرو! سب اُسکو مُبارِک کہو۔تُم جو اُسکے خادِم ہو اور اُسکی مرضی بجا لاتے ہو۔ "},
	{21, "22  اَے خُداوند کی مخلوقات ! سب اُسکو مُبارِک کہو۔ تُم جو اُسکے تسلُّط کے سب مقاموں میں ہو۔اَے میری جان ! تُو خُداوند کو مُبارِک کہو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view104() {
struct ur104 poems[] = {
	{1, "1  اَے میری جان ! خُداوند کو مُبارِک کہہ۔اَے خُداوند میرے خُدا! تُو نہایت بزرگ ہے۔ تُو حشمت اور جلال سے مُلبس ہے۔ "},
	{2, "2  تُو نُور کو پوشاک کی طرح پہنتا ہے اور آسمان کو بیابان کی طرح تانتا ہے۔ "},
	{3, "3  تُو اپنے بالا خانوں کے شہتیر پانی پر ٹِکاتا ہے۔ تُو بادلوں کو اپنے رتھ بناتا ہے۔ تُو ہوا کے بازوؤں پر سیر کرتا ہے۔ "},
	{4, "4  تُو اپنے فرشتوں کو ہوائیں اور اپنے خادموں کو آگ کے شعلے بناتا ہے۔ "},
	{5, "5  تُو نے زمین کو اُس کی بنیاد پر قائم کیا تاکہ وہ کبھی جنبُش نہ کھائے ۔ "},
	{6, "6  تُو نے اُسکو سُمندر سے چھُپایا جَیسے لباس سے ۔ پانی پہاڑوں سے بھی بلند تھا۔ "},
	{7, "7  وہ تیری جھڑکی سے بھاگا۔ اور تیری گرج کی آواز سے جلدی جلدی چلا۔ "},
	{8, "8  اُس جگہ پہنچ گیا جو تُو نے اُسکے لئے تیار کی تھی۔ پہاڑ اُبھر آئے ۔ وادیاں بیٹھ گئیں۔ "},
	{9, "9  تُو نے حد باندھ دی تاکہ وہ آگے نہ بڑھ سکے اور پھِر لُوٹ کر زمین کو نہ چِھپائے ۔ "},
	{10, "10  وہ وادیوں میں چشمے جاری کرتا ہے جو پہاڑوں میں بہتے ہیں ۔ "},
	{11, "11  سب جنگلی جانور اُن سے پیتے ہیں۔گور حر اپنی پیاس بُجھاتے ہیں۔ "},
	{12, "12  اُنکے آس پاس ہوا کے پرندے بسیرا کرتے اور ڈالیوں میں چہچہاتے ہیں۔ "},
	{13, "13  وہ اپنے بالاخانوں سے پہاڑوں کو سیراب کرتا ہے۔تیری سعنتوں کے پھل سے زمین آسوُدہ ہے۔ "},
	{14, "14  وہ چوپایوں کے لئے گھاس اُگاتا ہے۔ اور انسان کے کام کے لئے سبزہ تاکہ زمین سے خُوراک پیدا کرے۔ "},
	{15, "15  اور مَے جو انسان کے دِل کو خُوش کرتی ہے۔اور روغن جو اُسکے چہرہ کو چمکاتا ہے اور روٹی جو آدمی کے دِل کو توانائی بخشتی ہے۔ "},
	{16, "16  خُداوند کے درخت شاداب رہتے ہیں یعنی لُبنان کے دیودار جو اُس نے اُگائے۔ "},
	{17, "17  جہاں پرندے اپنے گھونسلے بناتے ہیں صنوبر کے درختوں میں لقلق کا بسیرا ہے۔ "},
	{18, "18  اُونچے پہاڑ جنگلی بکروں کے لئے ہیں چٹانیں سافانوں کی پناہ کی جگہ ہیں۔ "},
	{19, "19  اُس نے چاند کو زمانوں کے امتیاز کے لئے مقرر کیا ۔آفتاب اپنے غروب کی جگہ جانتا ہے۔ "},
	{20, "20  تُو اندھیرا کر دیتا ہے تو رات ہو جاتی ہے جِس میں سب جنگلی جانور نِکل آتے ہیں۔ "},
	{21, "21  جوان شیر اپنے شِکار کی تلاش میں گرجَتے ہیں اور خُدا سے اپنی خُوراک مانگتے ہیں۔ "},
	{22, "22  آفتاب نکلتے ہی وہ چل دیتے ہیں۔ اور جاکر اپنی مانوں میں پڑ رہتے ہیں۔ "},
	{23, "23  انسان اپنے کام کے لئے اور شام تک اپنی محنت کرنے کے لئے نکلتا ہے۔ "},
	{24, "24  اَے خُداوند! تیری صعنتیں کیسی بے شُمار ہیں! تُو نے سب کچھ حکمت سے بنایا۔ زمین تیری مخلوقات سے معمور ہیں ۔ "},
	{25, "25  دیکھو یہ بڑا اور چوڑا سُمندر جِس میں بے شُمار رینگنے والے جاندار ہیں۔یعنی چھوٹے اور بڑے جانور ۔ "},
	{26, "26  جہاز اِسی میں چلتے ہیں اِسی میں لویاتان ہے جِسے تُو نے اِس میں کھیلنے کو پیدا کیا ۔ "},
	{27, "27  اِن سب کو تیرا ہی آسرا ہے تاکہ تُو اُنکو وقت پر خُوراک دے۔ "},
	{28, "28  جو کچھ تُو دیتا ہے یہ لے لیتے ہیں۔تُو اپنی مُٹھی کھولتا ہے اور یہ اچھی چیزوں سے سیر ہوتے ہیں۔ "},
	{29, "29  تُو اپنا چہرہ چھِپا لیتا ہے اور یہ پریشان ہو جاتے ہیں تُو اُنکا دم روک لیتا ہے اور یہ مر جاتے ہیں اور پھر مٹی میں مل جاتے ہیں۔ "},
	{30, "30  تُو اپنی رُوح بھیجتا ہے اور یہ پیدا ہوتے ہیں۔ اور تُو رویِ زمین کو نیا بنا دیتا ہے۔ "},
	{31, "31  خُداوند کا جلال ابدتک رہے خُداوند اپنی صعنتوں سے خُوش ہو۔ "},
	{32, "32  وہ زمین پر نگاہ کرتا ہے اور وہ کانپ جاتی ہے۔ وہ پہاڑوں کو چُھوتا ہے اور اُن سے دھواں نکلنے لگتا ہے۔ "},
	{33, "33  میں عُمر بھر خُداوند کی تعریف گاؤنگا۔جب تک میرا وُجوُد ہے اپنے خُدا کی مدح سرائی کرونگا۔ "},
	{34, "34  میرا دھیان اُسے پسند آئے۔میَں خُداوند میں شادمان رہونگا۔ "},
	{35, "35  گُنہگار زمین پر سے فنا ہو جائیں اور شریر باقی نہ رہیں! اَے میری جان! خُداوند کو مُبارِک کہہ۔ خُداوند کی حمد کرو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view105() {
struct ur105 poems[] = {
	{1, "1  خُداوند کا شُکر کرو۔ اُسکے نام سے دُعا کرو۔ قوموں میں اُسکے کاموں کو بیان کرو۔ "},
	{2, "2  اُسکی تعریف میں گاؤ اُسکی مدح سرائی کرو۔ اُسکے تمام عجائب کا چرچا کرو۔ "},
	{3, "3  اُسکے مُقدس نام پر فخر کرو۔خُداوند کے طالبوں کے دِل شادمان ہوں۔ "},
	{4, "4  خُداوند اور اُسکی قوت کے طالب ہو۔ ہمیشہ اُسکے دیدار کے طالب رہو۔ "},
	{5, "5  اُن عجائب کاموں کو جو اُس نے کئے ۔اُس کے عجائب اور مُنہ کے احکام کو یاد رکھو۔ "},
	{6, "6  اَے اُس کے بندے ابرؔہام کی نسل! اَے بنی یعقُؔوب اُسکے برگزیدو! "},
	{7, "7  وہی خُداوند ہمارا خُدا ہے۔ اُسکے احکام تمام زمین پر ہیں۔ "},
	{8, "8  اُس نے اپنے عہد کو ہمیشہ یاد رکھا۔یعنی اُس کلام کو جو اُس نے ہزار پُشتوں کے لئے فرمایا۔ "},
	{9, "9  اُسی عہد کو جو اُس نے ابرؔہام سے باندھا۔اور اُس قسم کو جو اُس نے اضحاق سے کھائی۔ "},
	{10, "10  اور اُسی کو اُس نے یعقُؔوب کے لئے آئین یعنی اِسراؔئیل کے لئے ابدی عہد ٹھہرایا۔ "},
	{11, "11  اور کہا کہ میَں کنعؔان کا مُلک تجھے دوں گا۔ کہ تمہارا مورُوثِی حِصّہ ہو۔ "},
	{12, "12  اُس وقت وہ شُمار میں تھوڑے تھے بلکہ بُہت تھوڑے اور اُس مُلک میں مُسافر تھے۔ "},
	{13, "13  اور وہ ایک قوم سے دُوسری قوم میں اور ایک سلطنت سے دُوسری سلطنت میں پھرتے رہے۔ "},
	{14, "14  اُس نے کسی آدمی کو اُن پر ظُلم نہ کرنے دیا۔بلکہ اُن کی خاطر اُس نے بادشاہوں کو دھمکایا۔ "},
	{15, "15  اور کہا میرے ممسُوحوں کو ہاتھ نہ لگاؤ۔اور میرے نبیوں کو کوئی نُقصان نہ پہنچاؤ۔ "},
	{16, "16  پھِر اُس نے فرمایا کہ اُس مُلک پر قحط نازل ہو اور اُس نے روٹی کا سہارا بالکُل توڑ دیا۔ "},
	{17, "17  اُس نے اُن سے پہلے ایک آدمی کو بھیجا۔ یُوؔسُف غُلامی میں بیچِا گیا۔ "},
	{18, "18  اُنہوں نے اُس کے پاؤں کو بَیڑیوں سے دُکھ دیا۔وہ لوہے کی زنجیروں میں جکڑا رہا۔ "},
	{19, "19  جب تک اُس کا سُخن پورا نہ ہوا۔ خُداوند کا کلام اُسے آزماتا رہا ۔ "},
	{20, "20  بادشاہ نے حُکم دے کر اُسے چُھڑایا۔ ہاں قوموں کے پرمانروا نے اُسے آزاد کیا۔ "},
	{21, "21  اُس نے اُسکو اپنے گھر کا مخُتار بنایا۔اور اپنی ساری مُلکیت پر حاکم بنایا ۔ "},
	{22, "22  تاکہ اُس کے اُمرا کو جب چاہے قید کرے اور اُسکے بزرگوں کو دانِش سِکھائے۔ "},
	{23, "23  اِسراؔئیل بھی مِصر میں آیااور یعقُؔوب حام کی سر زمین میں مُسافِر رہا۔ "},
	{24, "24  اور خُدا نے اپنے لوگوں کو خُوب بڑھایا۔ اور اُنکو اُنکے مُخالِفوں سے زیادہ قوی کیا۔ "},
	{25, "25  اُس نے اُنکے دِل کو برگشتہ کیا تاکہ اُس کی قوم سے عداوت رکھیں۔ اور اُس کے بندوں سے دغا بازی کریں۔ "},
	{26, "26  اُس نے اپنے بندہ موؔسیٰ کو اور اپنے برگزیدہ ہاروؔن کو بھیجا۔ "},
	{27, "27  اُس نے اُنکے درمیان معُجزات اور حاؔم کی سر زمین میں عجائب دِکھائے۔ "},
	{28, "28  اُس نے تاریکی بھیج کر اندھیرا کر دیا اور اُنہوں نے اُسکی باتوں سے سر کشی کی۔ "},
	{29, "29  اُس نے اُنکی ندیوں کو لہُو بنا دیا۔ اور اُنکی مچھلیاں مار ڈالیں۔ "},
	{30, "30  اُنکے مُلک اور بادشاہوں کے بالاخانوں میں مینڈک ہی مینڈک بھر گئے۔ "},
	{31, "31  اُس نے حُکم دیا اور مچھروں کے غول آئے۔ اور اُنکی سب حدوُد میں جوئیں آگئیں۔ "},
	{32, "33  اُس نے اُنکے انگور اور انجیر کے درکتوں کو بھی برباد کر ڈالا اور اُنکی حدوُد کے پیڑ توڑ ڈاکے۔ "},
	{33, "34  اُس نے حُکم دیا تو بے شُمار ٹِڈیّاں اور کیڑے آگئے۔ "},
	{34, "35  اور اُن کے مُلک کے تمام نباتات چٹ کر گئے۔اور اُنکی زمین کی پیداوار کھا گئے۔ "},
	{35, "36  اُس نے اُنکے مُلک کے سب پہلوٹھوں کو بھی مار ڈالاجو اُنکی پوری قوت کے پہلے پھل تھے۔ "},
	{36, "37  اور اِسرائؔیل کو چاندی اور سونے کے ساتھ نکال لایا۔اور اُسکے قبیلوں میں ایک بھی کمزور آدمی نہ تھا۔ "},
	{37, "38  اُنکے چلے جانے سے مصِؔر خُوش ہو گیا۔کیونکہ اُنکا خُوف مِصریوں پر چھا گیا تھا۔ "},
	{38, "39  اُس نے بادل کو سایبان ہونے کے لئے پھِیلا دیا اور رات کو روشنی کے لئے آگ دی۔ "},
	{39, "40  اُنکے مانگنے پر اُس نے بٹیریں بھیجیں۔اور اُنکو آسمانی روٹی سے سیر کیا۔ "},
	{40, "41  اُس نے چٹان کو چیرا اورپانی پھوٹ نکلا اور خُشک زمین پر بدی کی طرح بہنے لگا۔ "},
	{41, "42  کیونکہ اُس نے اپنے پاک قول کو اور اپنے بندہ ابرؔہام کو یاد کیا۔ "},
	{42, "43  اور وہ اپنی قوم کو شادمانی کے ساتھ اور اپنے برگزیدوں کو گیت گاتے ہُوئے نکال لایا۔ "},
	{43, "44  اور اُس نے اُنکو قوموں کے مُلک دئے اور اُنہوں نے اُمتّوں کی مھنت کے پھل پر قبضہ کیا ۔ "},
	{44, "45  تاکہ وہ اُسکے آئین پر چلیں اور اُسکی شریعت کو مانیں خُداوند کی حمد کرو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view106() {
struct ur106 poems[] = {
	{1, "1  خُداوند کی حمد کرو۔خُداوند کا شُکر کرو کیونکہ وہ بھلا ہے۔اور اُسکی شفقت ابدی ہے۔ "},
	{2, "2  کَون خُداوند کی قُدرت کے کاموں کو بیان کر سکتا ہے۔یا اُسکی پُوری ستایش سُنا سکتا ہے؟ "},
	{3, "3  مُبارِک ہیں وہ جو عدل کرتے ہیں اور وہ جو ہر وقت صداقت کے کام کرتا ہے۔ "},
	{4, "4  اِے خُداوند! اُس کرم سے جو تُو اپنے لوگون پر کرتا ہے مجھے یاد کر۔ اپنی نجات مجھے عنایت فرما۔ "},
	{5, "5  تاکہ میَن تیرے برگزیدوں کی اقبالمندی دیکھوں اور تیری قوم کی شادمانی سے شاد رہوں۔اور تیری میراث کے لوگوں کے ساتھ فخر کروں۔ "},
	{6, "6  ہم نے اور ہمارے باپ دادا نے گُناہ کیا ۔ ہم نے بدکاری کی ۔ ہم نے شرارت کے کام کئے ۔ "},
	{7, "7  ہمارے باپ دادا مِصر میں تیرے عجائب نہ سمجھے۔اُنہوں نے تیری شفقت کی کثرت کو یاد نہ کیا ۔ بلکہ سُمندر پر یعنی بحرِ قُلؔزم پر باغی ہوئے۔ "},
	{8, "8  تو بھی اُس نے اُنکو اپنے نام کی خؒاطر بچایا۔تاکہ اپنی قُدرت ظاہر کرے۔ "},
	{9, "9  اُس نے بحرِ قُلؔزم کو ڈانٹا اور وہ سُوکھ گیا۔وہ اُنکو گہراؤ میں سے ایسے نکال لے گیا جَیسے بیابان مین سے۔ "},
	{10, "10  اور اُس نے اُنکو عداوت رکھنے والے کے ہاتھ سے بچایا۔اور دُشمن کے ہاتھ سے چُھڑایا۔ "},
	{11, "11  سُمندر نے اُنکے مُخالِفوں کو چِھپا لیا۔ اُن میں سے ایک بھی نہ بچا۔ "},
	{12, "12  تب اُنہوں نے اُسکے قول کا یقین کیا اور اُسکی مدح سرائی کرنے لگے۔ "},
	{13, "13  پھر وہ جلد اُسکے کاموں کو بھُل گئے اور اُسکی مشورت کا انتظار نہ کیا۔ "},
	{14, "14  بلکہ بیابان میں بڑی حِرص کی۔ اور صحرا میں خُدا کو آزمایا۔ "},
	{15, "15  سو اُس نے اُنکی مُراد تو پُوری کردی۔پر اُنکی جان کو سُکھا دیا۔ "},
	{16, "16  اُنہوں نے خیمہ گاہ میں موُؔسیٰ پر اور خُداوند کے مُقدس مرد ہارُؔون پر حسد کیا۔ "},
	{17, "17  سو زمین پھٹی اور داتن کو نگل گئی اور ابیؔرام کی جماعت کو کھا گئی۔ "},
	{18, "18  اور اُنکے جتَھےمیں آگ بھڑک اُٹھی اور شعُلوں نے شریروں کو بھسم کر دیا۔ "},
	{19, "19  اُنہوں نے حورؔب میں ایک بچھڑا بنایا اور ڈھالی ہُوئی مُورت کو سجدہ کیا۔ "},
	{20, "20  یُوں اُنہوں نے خُدا کے جلال کو گھاس کھانے بیَل کی شکل سے بدل دیا۔ "},
	{21, "21  وہ اپنے مُنّجی خُدا کو بھول گئے۔ جِس نے مصر میں بڑے بڑے کام کئے۔ "},
	{22, "22  اور حؔام کی سرزمین میں عجائب اور بحرِقُؔلزم پر دہشت انگیز کام کئے۔ "},
	{23, "23  اِسلئے اُس نے فرمایامیَں اُنکو ہلاک کر ڈالتا اگر میرا برگزیدہ مؔوُسیٰ میرے حُضُور بیچ میں نہ آتا کہ میرے قہر کو ٹال دے تا نہ ہو کہ میَں اُن کو ہلاک کروں۔ "},
	{24, "24  اور اُنہوں نے اُس سُہانے مُلک کو حقیر جانااور اُس کے قول کا یقین نہ کیا۔ "},
	{25, "25  بلکہ وہ اپنے ڈیروں میں بُڑبڑائے اور خُداوند کی بات نہ مانی۔ "},
	{26, "26  تب اُس نے اُن کے خلاف قسم کھائی کہ میَں اُن کو بیابان مین پست کروں گا۔ "},
	{27, "27  اور اُنکی نسل کو قوموں کے درمیان گِرا دوُنگا۔ اور اُنکو مُلک مُلک مین تتِر بتر کرونگا۔ "},
	{28, "28  وہ بعؔل فغُور کو پاُجنے لگے۔ اور بتوں کی قُربانیا ں کھانے لگے۔ "},
	{29, "29  یُوں اُنہوں نے اپنے اعمال سے اُسکو خشمناک کیا اور وبا اُن میں پھوٹ نکلی۔ "},
	{30, "30  تب فنِؔیحاس اُٹھا اور بیچ میں آیا اور وبا رُک گئی۔ "},
	{31, "31  اور یہ کام اُسکے حق میں پُشت در پُشت ہمیشہ کے لئے راستبازی گِنا گیا۔ "},
	{32, "32  اِسلئے کہ اُنہوں نے اُسکی روُح سے سرکشی کی اور مؔوُسیٰ بے سوچے بول اُٹھا۔ "},
	{33, "34  اُنہوں نے اُن قوموں کو ہلاک نہ کیا جَیسا خُداوند نے اُن کو حُکم دیا تھا ۔ "},
	{34, "35  بلکہ اُن قوموں کے ساتھ مل گئے اور اُن کے سے کام سیکھ گئے۔ "},
	{35, "36  اور اُنکے بتوں کی پرستیش کرنے لگے جو اُنکے لئے پھندہ بن گیا۔ "},
	{36, "37  بلکہ اُنہوں نے اپنے بیٹے بیٹیوں کو شیاطین کے لئے قُربان کیا۔ "},
	{37, "38  اور معصوموں کا یعنی اپنے بیٹے بیٹیوں کا خُون بہایا۔جِنکو اُنہوں نے کنعؔان کے بُتوں کے لئے قُربان کر دیا اور مُلک خُون سے ناپاک ہو گیا۔ "},
	{38, "39  یُوں وہ اپنے ہی کاموں سے آلودہ ہو گئے اور اپنے فعِلوں سے بیوفا بنے۔ "},
	{39, "40  اِسلئے خُداوند کا قہر اپنے لوگوں پر بھڑکا اور اُسے اپنی میراث سے نفرت ہو گئی۔ "},
	{40, "41  اور اُس نے اُنکو قوموں کے قبضہ میں کر دیا۔ اور اُن سے عداوت رکھنے والے اُن پر حُکمران ہو گئے۔ "},
	{41, "42  اُنکے دُشمنوں نے اُن پر ظُلم کیا اور وہ اُنکے محکام ہو گئے۔ "},
	{42, "43  اُس نے تو بارہا اُن کو چُھڑایا لیکن اُن کو مشورہ باغیانہ ہی رہا۔ اور وہ اپنی بدکاری کے باعث پست ہو گئے۔ "},
	{43, "44  تو بھی جب اُس نے اُنکی فریاد سُنی تو اُنکے دُکھ پر نظر کی۔ "},
	{44, "45  اور اُس نے اُنکے حق میں اپنے عہد کو یاد کیا اور اپنی شفقت کی کثرت کے مُطابق ترس کھایا۔ "},
	{45, "46  اُس نے اُنکو اسیر کرنے والوں کے دِل میں اُنکے لئے رحم ڈالا۔ "},
	{46, "47  اَے خُداوند! ہمارے خُدا! ہمکو بچا لے۔ اور ہمکو قوموں میں سے اکٹھا کر لے۔تاکہ ہم تیرے قُدوس نام کا شُکر کریں اور للکارتے ہوئے تیری ستایش کریں۔ "},
	{47, "48  خُداوند اِسراؔئیل کا خُدا ازل سے ابدتک مُبارِک ہو! اور ساری قوم کہے آمین۔ خُداوند کی حمد کرو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view107() {
struct ur107 poems[] = {
	{1, "1  خُداوند کا شُکر کرو کیونکہ بھلا ہے۔اور اپسکی شفقت ابدی ہے۔ "},
	{2, "2  خُداوند کے چُھڑائے ہُوئے یہی کہیں۔جِنکو اُس نے فدیہ دے کر مُخالِف کے ہاتھ سے چُھڑالیا۔ "},
	{3, "3  اور اُن کو مُلک مُلک سے جمع کیا۔ پُورب سے اور پّچھم سے ۔ اُتّر سے اور دکِھّن سے ۔ "},
	{4, "4  وہ بیابان میں صحرا کے راستے پر بھٹکتے پھرے۔ اُنکو بسنے کے لئے کوئی شہر نہ ملا۔ "},
	{5, "5  وہ بھوکے اور پیاسے تھےاور اُن کا دِل بیٹھا جاتا تھا۔ "},
	{6, "6  تب اپنی مُصیبت میں اُنہوں نے خُداوند سے فریاد کی۔ اور اُس نے اُنکو اُنکے دُکھوں سے رہائی بخشی۔ "},
	{7, "7  وہ اُنکو سیدھی راہ سے لے گیا۔ تاکہ بسنے کے لئے کِسی شہر میں جاپہنُچیں۔ "},
	{8, "8  کاشکہ لوگ خُداوند کی شفقت کی خاطر اور بنی آدم کے لئے اُسکے عجائب کی خاطر اُسکی ستایش کرتے! "},
	{9, "9  کیونکہ وہ ترستی جان کو سیر کرتا ہے۔اور بھوکی جان کو نعمتوں سے مالامال کرتا ہے۔ "},
	{10, "10  جو اندھیرے اور مَوت کے سایہ میں بیٹھے مُصیبت اور لوہے سے جکڑے ہوئے تھے۔ "},
	{11, "11  چونکہ اُنہوں نے خُداوند سے سرکشی کی اور حق تعالیٰ کی مشورت کو حقیر جانا۔ "},
	{12, "12  اِسلئے اُس نے اُنکا دِل مُشقّت سے عاجز کر دیا۔ وہ گِر پڑے اور کوئی مددگار نہ تھا۔ "},
	{13, "13  تب اپنی مُصیبت میں اُنہوں نے خُداوند سے فریاد کی اور اُس نے اُنکو اُنکے دُکھوں سے رہائی بخشی۔ "},
	{14, "14  وہ اُنکو اندھیرے اور موَت کے سایہ سے نکال لایا اور اُنکے بندھن توڑ ڈالے۔ "},
	{15, "15  کاشکہ لوگ خُداوند کی شفقت کی خاطر اور بنی آدم کے لئے اُسکے عجائب کی خاطر اُسکی ستایش کرتے! "},
	{16, "16  کیونکہ اُس نے پیتل کے پھاٹک توڑ دئے۔ اور لوہے کے بینڈوں کو کاٹ ڈالا۔ "},
	{17, "17  احمق اپنی خطاؤں کے سبب سے اور اپنی بدکاری کے سبب مُصیبت میں پڑتے ہیں۔ "},
	{18, "18  اُنکے جی کو ہر طرح کے کھانے سے نفرت ہو جاتی ہے۔ اور وہ موت کے پھاٹکوں کے نزدیک پہنچ جاتے ہیں۔ "},
	{19, "19  تب وہ اپنی مُصیبت میں خُدا وند سے فریاد کرتے ہیں اور وہ اُنکو اُنکے دُکھوں سے رہائی بخشتا ہے۔ "},
	{20, "20  وہ اپنا کلام نازل فرما کر اُن کو شفا دیتا ہے اور اُن کو اُنکی ہلاکت سے رہائی بخشتا ہے۔ "},
	{21, "21  کاشکہ لوگ خُداوند کی شفقت کی خاطر اور بنی آدم کے لئے اُسکے عجائب کی خاطر اُسکی ستایش کرتے! "},
	{22, "22  وہ شُکر گُزاری کی قُربانیاں گُذرانیں۔ اور گاتے ہوئے اُس کے کامون کا بیان کریں۔ "},
	{23, "23  جو لوگ جہازوں میں بحر پر جاتے ہیں اور سُمندر پر کاروبار میں لگے رہتے ہیں۔ "},
	{24, "24  وہ سُمندر میں خُداوند کے کاموں کو اور اُسکے عجائب کو دیکھتے ہیں۔ "},
	{25, "25  کیونکہ وہ حُکم دے کر طوفانی ہوا چلاتا ہے جو اُس میں لہریں اُٹھاتی ہے۔ "},
	{26, "26  وہ آسمان تک چرھتے اور گہراو میں اُترتے ہیں پریشانی سے اُنکا دِل پانی پانی ہو جاتا ہے۔ "},
	{27, "27  وہ جھومتے اور متوالے کی طرح لڑکھڑاتے اور حواس باختہ ہو جاتے ہیں۔ "},
	{28, "28  تب وہ اپنی مُصیبت میں خُداوند سے فریاد کرتے ہیں اور وہ اُنکو اُنکے دُکھوں سے رہائی بخشتا ہے۔ "},
	{29, "29  وہ آندھی کو تھما دیتا ہے اور لہریں موقوف ہو جاتی ہیں۔ "},
	{30, "30  تب وہ اُس کے تھم جانے سے خُوش ہوتے ہیں۔یُوں وہ اُن کو بندرگاہِ مقصُد تک پہنچا دیتا ہے۔ "},
	{31, "31  کاشکہ لوگ خُداوند کی ستایش کی خاطر اور بنی آدم کے لئے اُس کے عجائب کی خاطر اُسکی ستایش کرتے! "},
	{32, "32  وہ لوگوں کے مجمع میں اُس کی بڑائی کریں اور بزرگوں کی مجلس میں اُسکی حمد۔ "},
	{33, "33  وہ دریاؤں کو بیابان بنا دیتا ہے۔ اور پانی کے چشموں کو خُشک زمین ۔ "},
	{34, "34  وہ زرخیز زمین کو صحِرایِ شور کر دیتا ہے۔ اِسلئے کہ اُسکے باشندے شریر ہین۔ "},
	{35, "35  وہ بیابان کو جھیل بنا دیتا ہے۔اور خُشک زمین کو پانی کے چشمے۔ "},
	{36, "36  وہاں وہ بھوکوں کو بساتا ہے۔تاکہ بسنے کے لئے شہر تیار کریں۔ "},
	{37, "37  اور کھیت بوئیں اور تاکِستان لگائیں۔ اور پیداوار حاصِل کریں۔ "},
	{38, "38  وہ اُنکو برکت دیتا ہے اور وہ بہت بڑھتے ہیں اور وہ اُنکے چَوپایوں کو کم نہیں ہونے دیتا۔ "},
	{39, "39  پھِر ظُلم و تکلیف اور غم کے مارے وہ گھٹ جاتے اور پست ہو جاتے ہیں۔ "},
	{40, "40  وہ اُمرا پر زِلّت اُنڈیل دیتا ہے۔اور اُنکو بے راہ ویرانہ میں بھٹکاتا ہے۔ "},
	{41, "41  تَو بھی وہ مُحتاج کو مُصیبت سے نکال کر سرفراز کرتا ہے۔ اور اُس کے خاندان کو ریوڑ کی طرح بڑھاتا ہے۔ "},
	{42, "42  راستباز یہ دیکھ کر خُوش ہُوں گے اور سب بدکاروں کا مُنہ بند ہو جائیگا ۔ "},
	{43, "43  دانا اِن باتوں پر توجّہ کریگا اور وہ خُداوند کی شفقت پر غور کرینگے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view108() {
struct ur108 poems[] = {
	{1, "1  اَے خُداوند میرا دِل قائم ہے میَں گاؤنگا ور مدح سرائی کرونگا۔ "},
	{2, "2  اَے بربط اور ستار جاگو! میَں خُود بھی صُبح سویرے جاگ اُتھونگا۔ "},
	{3, "3  اِے خُداوند! میَں لوگوں میں تیرا شُکر کرونگا۔میَں اُمتوں میں تیری مدح سرائی کرونگا۔ "},
	{4, "4  کیونکہ تیری شفقت آسمان سے بُلند ہے۔اور تیری سچّائی افلاک کے برابر ہے۔ "},
	{5, "5  اَے خُدا تو آسمانوں پر سرفراز ہو۔اور تیرا جلال ساری زمین پر ہو۔ "},
	{6, "6  اپنے دہنے ہاتھ سے بچا اور ہمیں جواب دے۔ تاکہ تیرے محبُوب بچائے جائیں۔ "},
	{7, "7  خُدا نے اپنی قُدوُّسیت میں یہ فرمایا میَں خُوشی کروُنگا۔ میَں سِکمؔ کو تقسیم کرونگا اور سُکاّؔت کی وادی کو بانٹونگا۔ "},
	{8, "8  جلعاد میرا ہے منسّؔی میرا ہے۔افراؔئیِم میرے سر کا خود ہے یہُوؔداہ میرا عصا ہے۔ "},
	{9, "9  موآؔب میرا چلپچی ہے۔ ادوؔم پر میں جُوتا پھینکونگا۔ میَں فلستین پر للکارونگا۔ "},
	{10, "10  مجھے اُس فصیلدار شہر میں کون پہنچائیگا؟ کون مجھے ادوؔم تک لے گیا ہے؟ "},
	{11, "11  اَے خُدا! کیا تُو نے ہمیں ردّ نہیں کر دیا؟ اَے خُدا! تُو ہمارے لشکروں کے ساتھ نہیں جاتا۔ "},
	{12, "12  مُخالِف کے مُقابلہ میں ہماری کُمک کر کیونکہ انسانی مدد عبث ہے۔ "},
	{13, "13  خُدا کی بدولت ہم دلاِوری کرینگے کیونکہ وہی ہمارے مُخالِفوں کو پامال کریگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view109() {
struct ur109 poems[] = {
	{1, "1  اَے خُدا! میرے محموُد! خاموش نہ رہ۔ "},
	{2, "2  کیونکہ شریروں اور دغابازوں نے میرے خلاف مُنہ کھولا ہے۔اُنہوں نے جھُوٹی زُبان سے مجھ سے باتیں کی ہیں۔ "},
	{3, "3  اُنہوں نے عداوت کی باتوں سے مجھے گھیر لیا۔ اور بے سبب مجھ سے لڑے ہیں۔ "},
	{4, "4  وہ میری مُحبت کے سبب سے میرے مُخالِف ہیں لیکن میَں تو بس دُعا کرتا ہوں۔ "},
	{5, "5  اُنہوں نے نیکی کے بدلے مجھ سے بدی کی ہے۔ اور میری مُحبت کے بدلے عداوت۔ "},
	{6, "6  تُو کسی شریر آدمی کو اُس پر مُقرر کر دے اور کوئی مُخالِف اُسکے دہنے ہاتھ کھڑا رہے۔ "},
	{7, "7  جب اُسکی عدالت ہو تو وہ مجرم ٹھہرائے اوراُسکی دُعا بھی گُناہ گنی جائے۔ "},
	{8, "8  اُسکی عُمر کوتاہ ہو جائے اور اُس کا منصب کوئی دوُسرا لے لے۔ "},
	{9, "9  اُسکے بچے یتیم ہو جائیں اور اُسکی بیوی بیوہ ہو جائے۔ "},
	{10, "10  اُس کے بچے آوارہ ہو کر بھیک مانگیں۔اُنکو اپنے ویران مُقاموں سے دوُر جاکر ٹُکڑے مانگنا پڑے۔ "},
	{11, "11  قرض خواہ اُس کا سب کچھ چھین لے۔اور پردیسی اُسکی کمائے لوٹ لیں۔ "},
	{12, "12  کوئی نہ ہو جو اُس پر شفقت کرے نہ کوئی اُس کے یتیم بچوں پر ترس کھائے۔ "},
	{13, "13  اُسکی نسل کٹ جائے اور دوسری پُشت میں اُنکا نام مٹا دیا جائے۔ "},
	{14, "14  اُسکے باپ دادا کی بدی خُداوند کے حُضور یاد رہے۔اور اُس کی ماں کا گُناہ مِٹایا نہ جائے۔ "},
	{15, "15  وہ برابر خُداوند کے سامنے رہیں۔تاکہ وہ زمین پر سے اُنکا ذِکر مٹا دے۔ "},
	{16, "16  اِسلئے کہ اُس نے رحم کرنا یاد نہ رکھا پر غریب اور محتاج اور شکستہ دل کو ستایا تاکہ اُنکو مار ڈالے۔ "},
	{17, "17  بلکہ لعنت کرنا اُسے پسند تھا۔ سو وہی اُس پر آ پڑی اور دُعا دینا اُسے مرغوب نہ تھا سو وہ اُس سے دور رہی۔ "},
	{18, "18  اُس نے لعنت کو اپنی پوشاک کی طرح پہنا اور وہ پانی کی طرح اُس کے باطن میں اور تیل کی طرح اُس کی ہڈیوں میں سما گئی ۔ "},
	{19, "19  وہ اُس کے لئے اُس پاشاک کی مانند ہو جِسے وہ پہنتا ہے۔ اور اُس کے پٹکے کی جگہ جِس سے وہ اپنی کمر کسے رہتا ہے۔ "},
	{20, "20  خُداوند کی طرف سے میرے مُخالِفوں کا اور میری جان کو بُرا کہنے والوں کا یہی بدلہ ہے۔ "},
	{21, "21  لیکن اَے مالک خُداوند ! اپنے نام کی خاطر مجھ پر احسان کر ۔ مجھے چھُڑا کیونکہ تیری شفقت خوب ہے۔ "},
	{22, "22  اِسلئے کہ میں غریب اور محتاج ہوں اور میرا دِل میرے پہلو میں زخمی ہے۔ "},
	{23, "23  میں ڈھلتے سایہ کی طرح جاتا رہا۔ میں ٹِّڈی کی طرح اُڑا دیا گیا۔ "},
	{24, "24  فاقہ کرتے کرتے میر گھُٹنے کمزور ہو گئے۔ اور چکنائی کی کمی سے میر جسم سوُکھ گیا۔ "},
	{25, "25  میَں اُنکی ملامت کا نشانہ بن گیا ہوں جب وہ مجھے دیکھتے ہیں تو سر ہلاتے ہیں۔ "},
	{26, "26  اَے خُداوند ! میرے خُدا! میری مدد کر۔ اپنی شفقت کے مُطابق مجھے بچا لے۔ "},
	{27, "27  تاکہ وہ جان لیں کہ اِس میں تیرا ہاتھ ہےاور تُو ہی نے اَے خُداوند !یہ کیا ہے ۔ ۰28)وہ لعنت کرتے رہیں۔پر تُوبر کت دے وہ جب اٹُھے گے۔تو شر منِد ہ ہو نگے پر تیر ا بندہ شادمان ہوگا۔ "},
	{28, "29  میرے مُخالف ذلت سے ملُبس ہو جائیں اوراپنی ہی شرمندگی کوچادر کی طرح اوڑھ لیں۔ "},
	{29, "30  میَں اپنےمُنہ سے خُداوند کا شُکر کر وُنگا۔بلکہ بڑی بھیڑمیںاُسکی حمد کرؤنگا ۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view110() {
struct ur110 poems[] = {
	{1, "1  یٔہوواہ نے میرے خُداوند سے کہا تُومیرے دہنے ہاتھ بیٹھ جب تک کہ میں تیر ے دُشمنوں کو تیرے پاؤں کی چو کی نہ کر دوُں۔ "},
	{2, "2  خُداوند تیرے زور کا عصا صیُون سے بھیجیگا۔ تُو اپنے دُشمنو ں میں حُکمر ا نی کر ۔ "},
	{3, "3  لشکر کشی کے دن تیر ے لوگ خُوشی سے اپنے آپ کو پیش کر تے ہیں ۔تیر ے جوان پاک آرایش میں ہیں۔ اور صُبح کے بطن سے شبنم کی مانند ۔ "},
	{4, "4  خُداوند نے قسم کھائی ہے اور پھریگا نہیں کہ تُو مِلکِ صدؔق کے طور پر ابدتک کاہن ہے ۔ "},
	{5, "5  خُداوند تیرے دہنے ہاتھ پر اپنے قہر کے دن بادشاہوں کو چھید ڈالیگا۔ "},
	{6, "6  وہ قوموں میں عدالت کریگا۔ اور لاشوں کے ڈھیر لگا دیگا۔ اور بہت سے مُلکوں میں سروں کو کُچلے گا۔ "},
	{7, "7  وہ راہ میں ندی کا پانی پئیگا اِسلئے وہ سر کو بُلند کریگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view111() {
struct ur111 poems[] = {
	{1, "1  خُداوند کی حمد کرو میَں راستبازوں کی مجلس میں اور جماعت میں اپنے سارے دل سے خُداوند کا شُکر کرُنگا۔ "},
	{2, "2  خُداوند کے کام عظیم ہیں۔ جو اُن میں مسرور ہیں اُن کی تفتیش میں رہتے ہیں۔ "},
	{3, "3  اُسکے کام جلالی اور پُر حشمت ہین اور اُسکی صداقت ابدتک قائم ہے۔ "},
	{4, "4  اُس نے اپنے عجائب کی یادگار قائم کی ہے۔ خُداوند رحیم و کریم ہے۔ "},
	{5, "5  وہ اُن کو جو اُس سے ڈرتے ہیں خُوراک دیتا ہے۔ وہ اپنے عہد کو ہمیشہ یاد رکھیگا۔ "},
	{6, "6  اُس نے قوموں کی میراث اپنے لوگوں کو دیکر اپنے کاموں کا زور اُنکو دکھایا۔ "},
	{7, "7  اُسکے ہاتھوں کے کام برحق اور پُر عدل ہیں۔ اُسکے تمام قوانین راست ہیں۔ "},
	{8, "8  وہ ابُدالآباد قائم رہیں گے۔ وہ سچّائی اور راستی سے بنائے گئے ہیں۔ "},
	{9, "9  اُس نے اپنے لوگوں کے لئے فدیہ دیا اُس نے اپنا عہد ہمیشہ کے لئے ٹھہرایا ہے۔ اُس کا نام قُدوُّس اور مُہیب ہے۔ "},
	{10, "10  خُداوند کا خُوف دانائی کا شروع ہے۔ اُس کے مُطابق عمل کرنے والے دانشمند ہیں۔ اُسکی ستایش ابدتک قائم ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view112() {
struct ur112 poems[] = {
	{1, "1  خُداوند کی حمد کرو۔ مُبارک ہے وہ آدمی جو خُداوند سے ڈرتا ہے۔ اور اُسکے حُکموں میں خوُب مسرور رہتا ہے۔ "},
	{2, "2  اُسکی نسل زمین پر زورآور ہو گی۔ راستبازوں کی اولاد مُبارِک ہو گی۔ "},
	{3, "3  ما ل و دولت اُسکے گھر میں ہے۔ اور اُسکی صداقت ابد تک قائم ہے۔ "},
	{4, "4  راستبازوں کے لئے تاریکی میں نُور چمکتا ہے۔وہ رحیم و کریم اور صادق ہے۔ "},
	{5, "5  رحمدل اور قرض دینے والا آدمی سعادتمند ہے۔ وہ اپنا کاروبار راستی سے کریگا۔ "},
	{6, "6  اُسے کبھی جُنبش نہ ہو گی۔ صادق کی یادگار ہمیشہ رہیگی۔ "},
	{7, "7  وہ بُری خبر سے نہ ڈریگا۔ خُداوند پر توکل کرنے سے اُسکا دل قائم ہے۔ "},
	{8, "8  اُسکا دِل برقرار ہے۔ وہ ڈرنے کا نہیں۔ یہاں تک کہ وہ اپنے مُخالفوں کو دیکھ لیگا۔ "},
	{9, "9  اُس نے بانٹا اور محتاجوں کو دیا۔ اُسکی صداقت ہمیشہ قائم رہیگی۔ اُسکا سینگ عزت کے ساتھ بُلند کیا جائیگا۔ "},
	{10, "10  شریر یہ دیکھیگا اور کُڑھیگا۔ وہ دانت پیسیگا اور گھُلیگا۔ شریر کی مُراد نابود ہو گی۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view113() {
struct ur113 poems[] = {
	{1, "2  لِيَكُنِ اسْمُ الرَّبِّ مُبَارَكاً مِنَ الآنَ وَإِلَى الأَبَدِ. "},
	{2, "3  مِنْ مَشْرِقِ الشَّمْسِ إِلَى مَغْرِبِهَا اسْمُ الرَّبِّ مُسَبَّحٌ. "},
	{3, "4  الرَّبُّ عَالٍ فَوْقَ كُلِّ الأُمَمِ. فَوْقَ السَّمَاوَاتِ مَجْدُهُ. "},
	{4, "5  مَنْ مِثْلُ الرَّبِّ إِلَهِنَا السَّاكِنِ فِي الأَعَالِي "},
	{5, "6  النَّاظِرِ الأَسَافِلَ فِي السَّمَاوَاتِ وَفِي الأَرْضِ "},
	{6, "7  الْمُقِيمِ الْمَِسْكِينَ مِنَ التُّرَابِ الرَّافِعِ الْبَائِسَ مِنَ الْمَزْبَلَةِ "},
	{7, "8  لِيُجْلِسَهُ مَعَ أَشْرَافٍ مَعَ أَشْرَافِ شَعْبِهِ. "},
	{8, "9  الْمُسْكِنِ الْعَاقِرَِ فِي بَيْتٍ أُمَّ أَوْلاَدٍ فَرْحَانَةً! هَلِّلُويَا. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view114() {
struct ur114 poems[] = {
	{1, "1  جب اِسراؔئیل مصؔر سے نکل آیا یعنی یعؔقوُب کا گھرانا اجنبی زُبان قوم میں سے "},
	{2, "2  تو یہوُؔداہ اُسکا مقدِس اور اِسرائؔیل اُسکی مملکت ٹھہرا۔ "},
	{3, "3  یہ دیکھتے ہی سُمندر بھاگا۔ یؔردن پیچھے ہٹ گیا۔ "},
	{4, "4  پہاڑ مینڈھوں کی طرح اُچھلے پہاڑیاں بھیڑ کے بچوں کی طرح کوُدیں۔ "},
	{5, "5  اَے سُمندر! تجھے کیا ہُؤا کہ تُو بھاگتا ہے؟ اَے یرؔدن! تجھے کیا ہُؤا کہ تُو پیچھے ہٹتا ہے؟ "},
	{6, "6  اَے پہاڑو! تمکو کیا ہُؤا کہ تُم مینڈھوں کی طرح اُچھلتے ہو؟ اَے پہاڑیو! تمکو کیا ہُؤا کہ تُم بھیڑ کے بچّوں کی طرح کودتی ہو؟ "},
	{7, "7  اَے زمین تُو رب کے حُضُور ۔ یعقُؔوب کے خُدا کے حُضُور تھرتھرا ۔ "},
	{8, "8  جو چٹان کو جھیل اور چقماق کو پانی کا چشمہ بنا دیتا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view115() {
struct ur115 poems[] = {
	{1, "1  ہمکو نہیں! اَے خُداوند! ہمکو نہیں بلکہ تُو اپنے ہی نام کو اپنی شفقت اور سچّائی کی خاطر جلال بخش۔ "},
	{2, "2  قومیں کیوں کہیں اب اُنکا خُدا کہاں ہے؟ "},
	{3, "3  ہمارا خُدا تو آسمان پر ہے۔ اُس نے جو کچھ چاہا وہی کیا۔ "},
	{4, "4  اُنکے بُت چاندی اور سونا ہیں یعنی آدمی کی دستکاری۔ "},
	{5, "5  اُنکے مُنہ ہیں پر وہ بولتے نہیں۔ آنکھیں ہیں پر وہ دیکھتے نہیں۔ "},
	{6, "6  اُنکے کان ہیں پر وہ بولتے نہیں ناک ہے پر وہ سُونگھتے نہیں۔ "},
	{7, "7  اُنکے ہاتھ ہیں پر وہ چھُوتے نہیں پاؤں ہیں پر وہ چلتے نہیں اور ۔ اور اُن کے گلے سے آواز نہیں نکلتی۔ "},
	{8, "8  اُنکے بنانے والے اُن ہی کی مانند ہو جائینگے۔بلکہ وہ سب جو اُن پر بھروسہ رکھتے ہیں۔ "},
	{9, "9  اَے اِسرائیؔل ! خُداوند پر توکل کر وُہی اُنکی کُمک اور اُنکی سِپر ہے۔ "},
	{10, "10  اَے ہاروؔن کے گھرانے! خُداوند پر توکل کرو وہی اُنکی کُمک اور اُنکی سِپر ہے۔ "},
	{11, "11  اَے خُداوند سے ڈرنے والو! خُداوند پر توکل کرو۔وہی اُنکی کُمک اور اُنکی سِپر ہے۔ "},
	{12, "12  خُداوند نے ہمکو یاد رکھا۔ وہ برکت دیگا۔ وہ اِسرائؔیل کے گھرانے کو برکت دیگا۔ وہ ہاروؔن کے گھرانے کو برکت دیگا۔ "},
	{13, "13  جو خُداوند سے ڈرتے ہیں کیا چھوٹے کیا بڑے وہ اُ سب کو برکت دیگا۔ "},
	{14, "14  خُداوند تمکو بڑھائے تمکو اور تمہاری اولاد کو۔ "},
	{15, "15  تُم خُداوند کی طرف سے مُبارِک ہو جِس نے آسمان اور زمین کو بنایا۔ "},
	{16, "16  آسمان تو خُداوند کا آسمان ہے لیکن زمین اُس نے بنی آدم کو دی ہے ۔ "},
	{17, "17  مُردے خُداوند کی ستایش نہیں کرتے نہ وہ جو خاموشی کے عالم میں اُتر جاتے ہیں لیکن ہم اب سے ابدتک خُداوند کو مُبارِک کہینگے۔ خُداوند کی حمد کرو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view116() {
struct ur116 poems[] = {
	{1, "1  میَں خُداوند سے مُحبت رکھتا ہوں۔کیونکہ اُس نے میری فریاد سُنی اور میری منّت سُنی ہے۔ "},
	{2, "2  چُونکہ اُس نے میری طرف کان لگایا۔ اِسلئے میں عُمر بھر اُس سے دُعا کروں گا۔ "},
	{3, "3  مَوت کی رسیوں نے مجھے جکڑ لیا اور پاتال کے درد مجھ پر آ پڑے۔ میَں دُکھ اور غم میں گرفتار ہُؤا۔ "},
	{4, "4  تب میَں نے خُداوند سے دُعا کی۔ کہ اَے خُداوند ! میَں تیری مِنّت کرتا ہُوں میری جان کو رہائی بخش۔ "},
	{5, "5  خُداوند صادق اور کریم ہے۔ ہمارا خُدا رحیم ہے۔ "},
	{6, "6  خُداوند سادہ لوگوں کی حفاظت کرتا ہے۔میَں پست ہو گیا تھا اُسی نے بچا لیا۔ "},
	{7, "7  اَے میری جان ! پھر مُطمئِن ہو کیونکہ خُداوند نے تجھ پر احسان کیا ہے۔ "},
	{8, "8  اِسلئے کہ تُو نے میری جان کو موت سے میری آنکھوں کو آنسُو بہانے سے اور میری پاؤں کو پھسلنے سے بچایا ہے۔ "},
	{9, "9  میَں زِندوں کی زمین میں خُداوند کے حُضُور چلتا رہونگا۔ "},
	{10, "10  میَں ایمان رکھتا ہوں۔ اِسلئے یہ کہونگا۔ میَں بڑی مُصیبت میں تھا۔ "},
	{11, "11  میَں نے جلد بازی سے کہہ دیا کہ سب آدمی جھوٹے ہیں۔ "},
	{12, "12  خُداوند کی سب نعمتیں جو مجھے ملیں میَں اُنکے عوض میں اُسے کیا دُوں ؟ "},
	{13, "13  میَں نجات کا پیالہ اُٹھاکر خُداوند سے دُعا کرونگا۔ "},
	{14, "14  میَں خُداوند کے حُضُور اپنی مِنتّیں اُسکی ساری قوم کے سامنے پُوری کرونگا۔ "},
	{15, "15  خُداوند کی نگاہ میں اُسکے مُقدسوں کی موت گِراں قدر ہے۔ "},
	{16, "16  آہ! اَے خُداوند! میَں تیرا بندہ ہوں۔ میَں تیرا بندہ تیری لونڈی کا بیٹا ہوں۔ تُو نے میرے بندھن کھولے ہیں۔ "},
	{17, "17  میَں تیرے حُضُور شُکر گُذاری کی قُربانی چڑھاؤنگا۔اور خُداوند سے دُعا کرونگا۔ "},
	{18, "18  میَں خُداوند کے حُضُور اپنی مِنتّیں اُسکی ساری قوم کے سامنے پُوری کرونگا۔ "},
	{19, "19  خُداوند کے گھر کی بارگاہوں میں تیرے اندر اَے یرؔوشلم ! خُداوند کی حمد کرو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view117() {
struct ur117 poems[] = {
	{1, "1  اَے قومو! سب خُداوند کی حمد کرو۔ اَے اُمتو! سب اُس کی ستایش کرو۔ "},
	{2, "2  کیونکہ ہم پر اُسکی بڑی شفقت ہے اور خُداوند کی سچّائی ابدی ہے۔ خُداوند کی حمد کرو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view118() {
struct ur118 poems[] = {
	{1, "1  خُداوند کا شُکر کرو کیونکہ وہ بھلا ہے۔ اور اُسکی شفقت ابدی ہے۔ "},
	{2, "2  اِسرؔائیل اب کہے اُسکی شفقت ابدی ہے۔ "},
	{3, "3  ہارؔون کا گھرانا اب کہے اُسکی شفقت ابدی ہے۔ "},
	{4, "4  خُداوند سے ڈرنے والے اب کہین اُسکی شفقت ابدی ہے۔ "},
	{5, "5  میَں نے مُصیبت میں خُداوند سے دُعاکی۔ خُداوند نے مجھے جواب دیا اور کُشادگی بخشی۔ "},
	{6, "6  خُداوند میری طرف ہے میں نہیں ڈرنے کا اِنسان میرا کیا کر سکتا ہے؟ "},
	{7, "7  خُداوند میری طرف میرے مددگاروں میں ہے۔اِسلئے میں اپنے عداوت رکھنے والوں کو دیکھ لُونگا۔ "},
	{8, "8  خُداوند پر توکل کرنا اِنسان پر بھروسہ رکھنے سے بہتر ہے۔ "},
	{9, "9  خُداوند پر توکل کرنا اُمرا پر بھروسا رکھنے سے بہتر ہے۔ "},
	{10, "10  سب قوموں نے مجھے گھیر لیا میَں خُداوند کے نام سے اُنکو کاٹ ڈالُونگا۔ "},
	{11, "11  اُنہوں نے مجھے گھیر لیا ۔ بے شک گھیر لیا میَں خُداوند کے نام سے اُنکو کاٹ ڈالونگا۔ "},
	{12, "12  اُنہوں نے شہد کی مکھیوں کی طرح مجھے گھیر لیا۔ وہ کانٹوں کی آگ کی طرح بُجھ گئے۔ میَں خُداوند کے نام سے اُنکو کاٹ ڈالونگا۔ "},
	{13, "13  تُو نے مجھے زور سے دھکیل دیا کہ گِر پڑوں لیکن خُداوند نے میری مدد کی۔ "},
	{14, "14  خُداوند میری قوت اور میرا گیت ہے۔ وہی میری نجات ہُؤا۔ "},
	{15, "15  صادِقوں کے خیموں میں شادمانی اور نجات کی راگنی ہے۔ خُداوند کا دہنا ہاتھ دلاوری کرتا ہے۔ "},
	{16, "16  خُداوند کا دہنا ہاتھ بُلند ہُؤا ہے۔ خُداوند کا دہنا ہاتھ دِلاوری کرتا ہے۔ "},
	{17, "17  میَں مرونگا نہیں بلکہ جِیتا رُہونگا۔ اور خُداوند کے کاموں کا بیان کرونگا۔ "},
	{18, "18  خُداوند نے مجھے سخت تنبیہ تو کی لیکن موت کے حالہ نہیں کیا۔ "},
	{19, "19  صداقت کے پھاٹکوں کو میرے لئے کھول دو۔ میَں اُن سے داخل ہو کر خُداوند کا شُکر کرونگا۔ "},
	{20, "20  خُداوند کا پھاٹک یہی ہے صادق اُس سے داخل ہونگے۔ "},
	{21, "21  میَں تیرا شُکر کرونگا کیونکہ تُو نے مجھے جواب دیا اور خود میری نجات بنا۔ "},
	{22, "22  جِس پتھر کو معماروں نے ردّ کیا وہی کونے کے سِرے کا پتھر ہو گیا۔ "},
	{23, "23  یہ خُداوند کی طرف سے ہُؤا اور ہماری نظر میں عجیب ہے۔ "},
	{24, "24  یہ وہی دِن ہے جِسے خُداوند نے مُقرر کیا ہم اِس میں شادمان ہونگے اور خوشی منائیں گے۔ "},
	{25, "25  آہ !اَے خُداوند !بچالے ۔آہ!اَے خُداوند !خُوشحالی بخش۔ "},
	{26, "26  مُبا رک ہے وہ جو خُداوند کے نام سے آتاہے۔ہم نے تمُکو خُداوند کے گھر سے دُعا دی ہے ۔ "},
	{27, "27  یہؤواہ ہی خُداہےاور اُسی نے ہمکو نُور بخشا ہے ۔قرُبانی کو مذبح کے سینگو ں سے رسیٔوں سے باندھو ۔ "},
	{28, "28  تُو میرا خُدا ہے ۔میَں تیر ا شُکر کرؤںگا ۔تُو میراخُداہے ۔میَں تیری تمجید کرؤنگا۔ "},
	{29, "29  خُداوند کا شُکر کرو کیونکہ وہ بھلا ہے اور اُسکی شفقت ابدی ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view119() {
struct ur119 poems[] = {
	{1, "1  مُبارک ہیں وہ جو کاہل رفتار ہیں جو خُداوند کی شریعت پر عمل کرتے ہیں۔ "},
	{2, "2  مُبارک ہیں وہ جواُسکی شہادتو ں کومانتے ہیں ۔اور پورے دل سے اُس کے طا لِب ہیں۔ "},
	{3, "3  اُن سے نا راستی نہیں ہوتی ۔ وہ اُ سکی راہوں پر چلتے ہیں۔ "},
	{4, "4  تُو نے اپنے قوانین دِۓ ہیں ۔تاکہ ہم دِل لگا کر اُنکو مانیں ۔ "},
	{5, "5  کاشکہ تیر ے آ ئین ماننے کے لئےمیری روشیں دُرست ہو جائیں ! "},
	{6, "6  جب میَں تیر ے سب احکام کا لحِا ظ رکھُو ُنگا تو شرمنِدہ ہو نگا ۔ "},
	{7, "7  جب میں تیری صد اقت کے احکا م سیکھ لُو ُ نگا ۔تُو سچے دِل سے تیرا شُکر ادا کُرونگا۔ "},
	{8, "8  مجھے بالکل ترک نہ کر دے ۔ "},
	{9, "9  جوان اپنی روش کس طر ح پا ک رکھے؟تیرے کلام کے مطُا بق اُس پر نگا ہ رکھنے سے ۔ "},
	{10, "10  مَیں پُو رے دِل سے طالب ہوا ُہوُں ۔ مجھے اپنے فر مان سے بھٹکنےنہ دے ۔ "},
	{11, "11  میَں؟ نے تیرے کلا م کو اپنے دِل میں رکھ لیا ہے ۔ تا کہ میں تیرے خلاف گُناہ نہ کروُں۔ "},
	{12, "12  اَے خُداوند ! تُو مبارک ہے ۔ مجھے اپنے آ ئین سِکھا۔ "},
	{13, "13  مَیں نے اپنے لبو ں سے تیرے فرمودہ کلام کو بیان کیا۔ "},
	{14, "14  مجھے تیری شہادتوں کے کی راہ سے شادمانی ہُؤئی جَیسی ہر طرح کی دولت سے ہوتی ہے۔ "},
	{15, "15  میَں تیرے قوانین پر غور کرونگا۔ اور تیری راہوں کا لحاظ رکھونگا۔ "},
	{16, "16  میَں تیرے آئین میں مسرور رہونگا۔ میَں تیرے کلام کو نہ بھولونگا۔ "},
	{17, "17  اپنے بندہ پر احسان کر تاکہ میَں جیتا رہوں۔ اور تیرے کلام کو مانتا رہوں۔ "},
	{18, "18  میری آنکھیں کھول دے تاکہ میں تیری شریعت کے عجائب دیکھوں۔ "},
	{19, "19  میَں زمین پر مُسافر ہوں۔ اپنے فرمان مجھ سے پوشیدہ نہ رکھ۔ "},
	{20, "20  میرا دل تیرے احکام کے اشتیاق میں ہر وقت تڑپتا رہتا ہے۔ "},
	{21, "21  تُو نے اُن معلان مغروروں کو جھڑک دیا۔ جو تیرے فرمان سے بھٹکے رہتے ہیں۔ "},
	{22, "22  ملامت اور حقارت کو مجھ سے دور کر دےکیونکہ میَں نے تیری شہادتیں مانی ہیں۔ "},
	{23, "23  اُمرا بھی بیٹھکر میرے خلاف باتیں کرتے ہیں ۔ لیکن تیرا بندہ تیرے آئین پر دھیان لگائے رہا۔ "},
	{24, "24  تیری شہادتیں مجھے مرغوب اور میری مُشیر ہیں۔ "},
	{25, "25  میری جان خاک میں مِل گئی۔تُو اپنے کلام کے مُطابق مجھے زندہ کر ۔ "},
	{26, "26  میَں نے اپنی رَوشوں کا اظہار کیا اور تُو نے مجھے جواب دیا۔ مجھے اپنے آئین کی تعلیم دے۔ "},
	{27, "27  اپنے قوانین کی راہ مجھے سمجھا دے۔ اور میَں تیرے عجائب پر دھیان کرونگا۔ "},
	{28, "28  غم کے مارے میری جان گھُلی جاتی ہے۔ اپنے کلام کے مُطابق مجھے تقویت دے۔ "},
	{29, "29  جھوٹ کی راہ سے مجھے دور رکھ۔ اور مجھے شریعت عنایت فرما۔ "},
	{30, "30  میَں نے وفاداری کی راہ اختیار کی ہے۔ میَں نے تیرے احکام اپنے سامنے رکھے ہیں۔ "},
	{31, "31  میَں تیری شہادتوں سے لِپٹا ہُؤا ہوں۔ اَے خُداوند! مجھے شرمندہ نہ ہونے دے۔ "},
	{32, "32  جب تُو میرا حوصلہ بڑھائیگا۔ تو میَں تیرے فرمان کی راہ میں دوڑونگا۔ "},
	{33, "33  اَے خُداوند مجھے اپنے آئین کی راہ بتا۔اور میَں آخر تک اُس پر چلوں گا۔ "},
	{34, "34  مجھے فہم عطا کر اور میَں تیری شریعت پر چلونگا۔ بلکہ میَں پُورے دِل سے اُسکو مانونگا۔ "},
	{35, "35  مجھے اپنے فرمان کی راہ پر چلا۔ میونکہ اِس میں میری خُوشی ہے۔ "},
	{36, "36  میرے دِل کو اپنی شہا دتو ں کی طرف رجوُع دِلا نہ کہ لالچ کی طرف ۔ "},
	{37, "37  میری آنکھو ں کو بظُلا ن پر نظر کرنے سے با ز رکھ اور مجھے اپنی راہوں میں زندہ کر ۔ "},
	{38, "38  اپنے بندہ کے لئے اپنا وہ قول پورا کر۔ جِس سے تیرا خُوف پیدا ہوتا ہے۔ "},
	{39, "39  میری ملامت کو جِس سے میَں ڈرتا ہوں دور کردے۔ کیونکہ تیرے احکام بھلے ہیں۔ "},
	{40, "40  دیکھ! میَں تیرے قوانین کا مُشتاق رہا ہُوں۔ مجھے اپنی صداقت سے زندہ کر۔ "},
	{41, "41  اَے خُداوند! تیرے قول کے مطابق تیرے شفقت اور تیری نجات مجھے نصیب ہوں۔ "},
	{42, "42  تب میں اپنے ملامت کرنے والے کو جواب دے سکونگا۔ کیونکہ میَں تیرے کلام پر بھروسا رکھتا ہوں۔ "},
	{43, "43  اور حق بات کو میرے مُنہ سے ہرگز جُدا نہ ہونے دے کیونکہ میرا اعتماد تیرے احکام پر ہے۔ "},
	{44, "44  پس میں ابدلآباد تیری شریعت کو مانتا رہونگا۔ "},
	{45, "45  اور میَں آزادی سے چلونگا۔ کیونکہ میَں تیرے قوانین کا الب رہو ہوں۔ "},
	{46, "46  میَں بادشاہوں کے سامنے تیری شہادتوں کا بیان کرونگا۔ اور شرمندہ نہ ہونگا۔ "},
	{47, "47  تیرے فرمان مجھے عزیز ہے اُٹھاونگا۔ اور تیرے آئین پر دھیان کرونگا۔ "},
	{48, "49  جو کلام تُو نے اپنے بندہ سے کیا اُسے یاد کر کیونکہ تُو نے مجھے اُمید دِلائی ہے۔ "},
	{49, "50  میری مُصیبت میں یہی میری تسلی ہے۔ کہ تیرے کلام نے مجھے زندہ کیاہے۔ "},
	{50, "51  مغروروں نے مجھے بہت ٹھٹھوں میں اُڑایا۔ تو بھی میں نے تیری شریعت سے کنارہ نہیں کیا۔ "},
	{51, "52  اَے خُداوند! میَں تیرے قدیم احکام کو یاد کرتا اور اطمنان پاتا ہوں۔ "},
	{52, "53  اُن شریروں کے سبب سے جو تیری شریعت کو ترک کرتے ہیں۔ میَں سخت طیش میں آ گیا ہوں۔ "},
	{53, "54  میرے مسافر خانہ میں تیرے آئین میرا گیت رہے ہیں۔ "},
	{54, "55  اَے خُداوند! رات کو میَں نے تیرا نام یاد کیا ہے۔ اور تیری شریعت پر عمل کیا ہے۔ "},
	{55, "56  یہ میرے واسطے اِس لئے ہُؤا۔ کہ میَں نے تیرے قوانین کو مانا۔ "},
	{56, "57  خُداوند میرا بخرہ ہے۔ میَں نے کہا ہے میَں تیری باتیں مانونگا۔ "},
	{57, "58  میَں پورے دل سے تیرے کرم کا خواہاں ہؤا۔ اپنے کلام کے مطابق مجھ پر رحم کر ۔ "},
	{58, "59  میَں نے اپنی راہوں پر غور کیا اور تیری شہادتوں کی طرف امنے قدم موڑے۔ "},
	{59, "60  میَں نے تیرے فرمان ماننے ہیں۔ جلدی کی اور دیر نہ لگائی۔ "},
	{60, "61  شریروں کی رسیوں نے مجھے جکڑ لیا۔ پر میَں تیری شریعت کو نہ بھولا۔ "},
	{61, "62  تیری صداقت کے لئے مَیں آ دھی رات کو تیرا شُکر کرنے کو اُٹھو نگا ۔ "},
	{62, "63  مُیں اُن سب کا ساتھی ہُوں جو تجھ سے ڈر تے ہیں ۔ اور اُن کا جو تیر ے قو انین کو مانتے ہیں ۔ "},
	{63, "64  اَے خُدا زمین تیر ی شفقت سے معمور ہے ۔ مجھےُ آ ئین سکھا ۔ "},
	{64, "65  اَے خُداوند ! تُو نے اپنے کلا م کے مطابق اپنے بندہ کے ساتھ بھلائی کی ہے ۔ "},
	{65, "66  مجھے صحیح اِمتیا ز اور دانش سکِھا کیونکہ میَں تیرے فرمان پر ایمان لا یا ہوں "},
	{66, "67  میَں مُصیبت اُٹھانے سے پہلے گمر ُاہ تھا ۔ پر اب تیر ے کلام کو مانتا ہوں۔ "},
	{67, "68  تُو بھلا ہے اور بھلا ئی کرتا ہے۔مجھے اپنے آ ئین سکھا ۔ "},
	{68, "69  مغُروروں نے مجھ پر بُہتان با ند ھا ہے ۔میَں پُو رے دِل سے تیرے قو انین کو ماُنو نگا ۔ "},
	{69, "70  اُن کے دِل چکنا ئی سے فر بہ ہو گئے ۔لیکن میَں تیری شریعت میں مُسرُور ہوُں "},
	{70, "71  اچھا ہو اُاکے میں نے مصیبت اُٹھا ئی تا کہ تیرے مُنہ کی شر یعت میرے لئے سونے چاندی کے ہزاروں سکُوں سے بہتر ہے ۔ "},
	{71, "73  تیرے ہاتھو ں نے مجھے بنا یا اور تر تیب دی ۔ "},
	{72, "74  تجھُ ڈر نے واے مجھے دیکھکر خُوش ہونگے۔ اِس لئے کہ مجھے تیرے کلام پر اعتماد ہے ۔ "},
	{73, "75  اَے خُداوند ! میں تیرے احکام کی صداقت کو جانتا ہو ں اور کہ وفاداری ہی سےتو نے مجھے دُکھ میں ڈالا ۔ "},
	{74, "76  اُس کلام کے مُطابق جو تُو نے اپنے بندوں سے کیا تیری شفقت میری تسلی کا باعث ہو۔ "},
	{75, "77  تیری رحمت مجھے نصیب ہو تاکہ میَں زندہ رہوں۔ کیونکہ تیری شریعت میری خُشنودی ہے۔ "},
	{76, "78  مغرور شرمندہ ہوں کیونکہ اُنہوں نے ناحق مجھے گِرایا۔ لیکن میَں تیرے قوانین پر دھیان کرونگا۔ "},
	{77, "79  تجھ سے ڈرنے والے میری طرف رجوع ہوں تو وہ تیری شہادتوں کو جان لیں گے۔ "},
	{78, "80  میرادل تیرے آئین ماننے میں کامل رہے تاکہ میَں شرمندگی نہ اُٹھاؤں۔ "},
	{79, "81  میری جان تیری نجات کے لئے بیتاب ہے۔ لیکن مجھے تیرے کلام پر اعتماد ہے۔ "},
	{80, "82  تیرے کلام کے انتظار میں میری آنکھیں رہ گئیں۔ میَں یہی کہتا رہا کہ تُو مجھے کب تسلی دیگا؟ "},
	{81, "83  میَں اُس مشکیزہ کی مانند ہو گیا جو دھوئیں میں ہو۔ تو بھی میَں تیرے آئین کو نہیں بھولتا۔ "},
	{82, "84  تیرے بندہ کے دِن ہی کتنے ہیں؟ تُو میرے ستانے والوں پر کب فتح دیگا؟ "},
	{83, "85  مغروروں نے جو تیری شریعت کے پیرونہیں میرے لئے کھودے ہیں۔ "},
	{84, "86  تیرے سب فرمان برحق ہیں۔ وہ ناحق مجھے ستاتے ہیں ۔ تُو میری مدد کر۔ "},
	{85, "87  اُنہوں نے مجھے زمین پر سے فنا کر ہی ڈالا تھا۔ لیکن میں نے تیرے قوانین کو ترک نہ کیا۔ "},
	{86, "88  تُو مجھے اپنی شفقت کے مُطابق زندہ کر۔ تو میَں تیرے مُنہ کی شہادت کو مانونگا۔ "},
	{87, "89  اَے خُداوند ! تیرا کلام آسمان پر ابدتک قائم ہے۔ "},
	{88, "90  تیری وفاداری پُشت در پُشت ہے۔ تُو نے زمین کو قیام بخشا اور وہ قائم ہے۔ "},
	{89, "91  وہ آج تیرے احکام کے مُطابق قائم ہیں۔ کیونکہ سب چیزیں تیری خدمت گُذار ہیں۔ "},
	{90, "92  اگر تیری شریعت میری خُوشنودی نہ ہوتی تو میَں اپنی مُصیبت میں ہلاک ہو جاتا۔ "},
	{91, "93  میَں تیرے قوانین کو کبھی نہیں بھولوں گا۔ کیونکہ تُو نے اُن ہی کے وسیلہ سے مجھے زندہ کیا۔ "},
	{92, "94  میَں تیرا ہی ہوں ۔ مجھے بچا لے۔ کیونکہ میَں تیرے قوانین کا طالب رہا ہوں ۔ "},
	{93, "95  شریر مجھے ہلاک کرنے کو گھات لگا رہے لیکن میَں تیری شہادتوں پر غور کرونگا۔ "},
	{94, "96  میَں نے دیکھا کہ ہر کمال کی انتہا ہے۔ لیکن تیرا حُکم نہایت وسیع ہے۔ "},
	{95, "97  آہ! میَں تیری شریعت سے کَیسی مُحبت رکھتا ہوں۔ مجھے دِن بھر اُسی کا دھیان رہتا ہے۔ "},
	{96, "98  تیرے فرمان مجھے میرے دُشمنوں سے زیادہ دانشور بناتے ہیں۔ کیونکہ وہ ہمیشہ میرے ساتھ ہیں۔ "},
	{97, "99  میَں اپنے سب اُستادوں سے عقلمند ہوں۔ کیونکہ تیری شہادتوں پر میر ادھیان رہتا ہے۔ "},
	{98, "100  میَں عُمر رسیدہ لوگوں سے زیادہ سمجھ رکھتا ہوں۔ کیونکہ میَں نے تیرے قوانین کو مانا ہے۔ (101) میَں نے ہر بُری راہ سے اپنے قدم روک رکھے ہیں۔ تاکہ تیری شریعت پر عمل کروں۔ (102)میَں نے تیرے احکام سے کنارہ نہیں کیا۔ کیونکہ تُو نے مجھے تعلیم دی ہے۔ (103) تیری باتیں میرے لئے کیسی شرین ہیں! وہ میرے مُنہ کو شہد سے بھی میٹھی معلوم ہوتی ہیں۔ (104) تیرے قوانین سے مجھے فہم حاصل ہوتا ہے۔اِسلئے مجھے ہر جھوٹی راہ سے نفرت ہے۔ (105)تیرا کلام میرے قدموں کے لئے چراغ اور میری راہ کے لئے روشنی ہے۔ (106) میَں نے قسم کھائی ہے اور اِس پر قائم ہوں۔ کہ تیری صداقت کے احکام پر عمل کروں۔ (107)میَں بڑی مُصیبت میں ہوں اَے خُداوند! اپنے کلام کے مُطابق مجھے زندہ کر۔(108)اَے خُداوند میرے مُنہ سے رضا کی قُربانیاں قبول فرما۔ اور مجھے اپنے احکام کی تعلیم دے۔(109) میری جان ہمیشہ ہٹھیلی پر ہے۔ تو بھی میَں تیری شریعت کو نہیں بھولتا۔ (110) شریروں نے میرے لئے پھندہ لگایا ہے۔ تو بھی میَں تیرے قوانین سے نہیں بھٹکتا۔ (111) میَں نے تیری شہادتوں کو اپنی میراث بنایا ہے۔ کیونکہ اُس سے میرے دِل کو شادمانی ہوتی ہے۔ (112) میَں نے ہمیشہ کے لئے آخر تک تیرے آئین ماننے پر دل لگایا ہے۔ (113) مجھے دو دلوں سے نفرت ہے۔ پر تیری شریعت سے مُحبت رکھتا ہوں۔ (114) تُو میرے چھِپنے کی جگہ اور میری سِپر ہے۔ مجھے تیرے کلام پر اعتماد ہے۔ (115)اَے بدکردارو! مجھ سے دور ہو جاؤ۔ تاکہ میں اپنے خُداوند کے فرمان پر عمل کروں۔ (116)تُو اپنے کلام کے مُطابق مجھے سنبھال تاکہ زندہ رہوں۔ اور مجھے اپنے اعتماد سے شرمندگی نہ اُٹھانے دے۔ (117)مجھے سنبھال اور میَں سلامت رہونگا اور ہمیشہ تیرے آئین کا لحاظ رکھونگا۔ (118) تُو نے اُن سب کو حقیر جانا ہے جو تیرے آئین سے بھٹک جاتے ہیں۔ کیونکہ اُنکی دغا بازی عبث ہے۔ (119) تُو زمین کے سب شریروں کو میَل کی طرح چھانٹ دیتا ہے۔ اِسلئے میَں تیری شہادتوں کو عزیز رکھتا ہوں۔ (120)میرا جِسم تیرے خُوف سے کانپتا ہے۔اور میَں تیرے احکام سے ڈرتا ہوں۔ (121) میَں نے عدل اور انصاف کیا ہے۔ مجھے اُنکے حوالے نہ کر جو ظُلم کرتے ہیں۔ (122) بھلائی کے لئے اپنے بندہ کا ضامن ہو۔ مغرُور مجھ پر ظُلم نہ کریں۔ (123) تیری نجات اور تیری صداقت کے کلام کے انتظار میں میری آنکھیں رہ گئیں۔ (124) اپنے بندہ سے اپنی شفقت کے مُطابق سلوُک کر اور مجھے اپنے آئین سیکھا۔ (125)میَں تیرا بندہ ہوں مجھے فہم عطا کر۔تاکہ تیری شہادتوں کو سمجھ لوں۔ (126) اب وقت آ گیا ہے کہ خُداوند کام کرے کیونکہ اُنہوں نے تیری شریعت کو باطل کردیا ہے۔ (127) اِسلئے میَں تیرے سب قوانین کو برحق جانتا ہوں۔ اور ہر جھوٹی راہ سے مجھے نفرت ہے۔ (129) تیری شہادتیں عجیب ہیں اِسلئے میرا دل اُنکو مانتا ہے۔ (130) تیری باتوں کی تشریح نور بخشتی ہے۔ وہ سادہ دِلوں کو عقکمند بناتی ہے۔ (131) میَں خوب مُنہ کھول کر ہانپتا رہا۔ کیونکہ میَں تیرے فرمان کا مُشتاق تھا۔ (132) میری طرف توجہ کر اور مجھ پر رحم فرما۔ جَیسا تیرے نام سے مُحبت رکھنے والوں کا حق ہے۔ (133) اپنے کلام میں میری رہنمائی کر۔ کوئی بدکاری مجھ پر تسلط نہ پائے۔ (134) اِنسان کے ظُلم سے مجھے چھُڑالے۔ تو تیرے قوانین پر عمل کرونگا۔(135)اپنا چہرہ اپنے بندہ پر جلوہ گر فرما۔ اور مجھے اپنے آئین سکھا۔ (136)میری آنکھوں سے پانی کے چشمے جاری ہیں۔ اِسلئے کہ لوگ تیری شریعت کو نہیں مانتے۔ (137)اَے خُداوند !تُوصادق ہے۔ اور تیرے احکام برحق ہیں۔ (138) تُو نے صداقت اور کمال وفاداری سے اپنی شہادتوں کو ظاہر فرمایا ہے۔ (139) میری غیرت مجھے کھا گئی کیونکہ میرے مُخالِف تیری باتیں بھول گئے۔ (140) تیرا کلام بالکل خالص ہے اِس لئے تیرے بندہ کو اُس سے مُحبت ہے۔ (141) میَں ادنٰی اور حقیر ہوں تو بھی میَں تیرے قوانین کو نہیں بھولتا۔ (142)تیری صداقت ابدی صداقت ہے۔ اور تیری شریعت برحق ہے،(143) میَں تکلیف اور عذاب میں مُبتلا ہوں۔ تُو بھی تیرے فرمان میری خُوشنودی ہیں۔ (144) تیری شہادتیں ہمیشہ راست ہیں۔ مجھے فہم عطا کر تو میَں زندہ رہونگا۔ (145) میَں پُورے دِل سے دُعا کعتا ہوں۔ اَے خُداوند! مجھے جواب دے ۔ میَں تیرے آئین پر عمل کرونگا۔ (146) میَں نے تجھ سے دُعا کی ہے۔ مجھے بچالے۔ اور میَں تیری شہادتوں کو مانونگا۔ (147)میَں نے پو پھٹنے سے پہلے فریاد کی مجھے تیرے کلام پر اعتماد ہے۔ (148) میری آنکھیں رات کے ہر پہر سے پہلے کھُل گئیں تاکہ تیرے کلام پر دھیان کروں۔ (149) اپنی شفقت کے مُطابق میری فریاد سُن ۔ اَے خُداوند! اپنے احکام کے مُطابق مجھے زندہ کر ۔(150) جو شرارت کے درپے رہتے ہیں وہ نزدیک آگئے ۔ وہ تیری شریعت سے دور ہیں۔(151) اَے خُداوند ! تُو نزدیک ہے اور تیرے سب فرمان برحق ہیں ۔(152) تیری شہادتوں سے مجھے قدیم سے معلوم ہُؤا کہ تُو نے اُنکو ہمیشہ کے لئے قائم کیا ہے۔ (153) میری مُصیبت کا خیال کر اور مجھے چھُڑا کیونکہ میَں تیری شریعت کو نہیں بھولتا۔ (154) میری وکالت کر اور فدیہ دے۔ اپنے کلام کے مُطابق مجھے زندہ کر۔ (155) نجات شریروں سے دور ہے کیونکہ وہ تیرے آئین کے طالب نہیں ہیں۔ (156) اَے خُداوند ! تیری رحمت بڑی ہے اپنے احکام کے مُطابق مجھے زندہ کر۔ (157) میرے ستانے والے اور مُخالف بہت ہیں۔ تو بھی میَں نے تیری شہادتوں سے کنارہ نہ کیا۔ (158)میَں دغابازوں کو دیکھکر بول ہُؤا۔ کیونکہ وہ تیرے کلام کو نہیں مانتے۔ (159) خیال فرما کہ مجھے تیرے قوانین سے کَیسی مُحبت ہے۔ اَے خُداوند ! اپنی شفقت کے مُطابق مجھے زندہ کر۔(160) تیرے کلام کا خلاصہ سچّائی ہے۔ تیری صداقت کے کُل احکام ابدی ہیں۔(161) اُمرا نے مجھے بے سبب ستایا ہے۔لیکن میرے دِل میں تیری باتوں کا خوف ہے۔ (162)میَں بڑی لُوٹ پانے والے کی مانند تیرے کلام سے خوش ہوں۔ (163) مجھے جھوٹ سے نفرت اور کراہیت ہے۔ لیکن تیری شریعت سے مُحبت ہے۔(164) میَں تیری صداقت کے احکام کے سبب سے دِن مین سات بار تیری ستایش کرتا ہوں۔ (165) تیری شریعت سے مُحبت رکھنے والے مُطمئن ہیں۔ اُنکے لئے ٹھوکر کھانتے کا کوئے موقع نہیں۔(166) اَے خُداوند! میَں تیری نجات کا اُمیدوار رہو ہوں۔ اور تیرے فرمان بجا لایا ہوں۔ (167) میری جان نے تیری شہادتیں مانی ہیں اور وہ مجھے نہایت عزیز ہیں۔ (168) میَں نے تیرے قوانین اور شہادتوں کو مانا ہے۔ کیونکہ میری سب روشیں تیرے سامنے ہں۔ (169)اَے خُداوند! میری فریاد تیرے حُضُور پہنچے اپنے کلام کے مُطابق مجھے فہم عطا کر۔ (170)میری اِلتجا تیرے حُضُور پہنچے اپنے کلام کے مُطابق مجھے چُھڑا ۔(171) میرے لبوں ست تیری ستایش ہو کیونکہ تُو مجھے اپنے آئین سکھاتا ہے۔ (172) میری زُبان تیرے کلام کا گیت گائے۔ کیونکہ تیرے سب فرمان برحق ہیں ۔(173) تیرا ہاتھ میری مدد کو تیار رہے کیونکہ میَں نے تیرے قوانین اختیار کئے ہیں ۔(174) اَے خُداوند! میَں تیری نجات کا مُشتاق رہا ہوں۔ اور تیری شریعت میری خُوشنودی ہے ۔(157) میری جان زندہ رہے تو وہ تیری ستایش کرے گی۔ اور تیرے احکام میری مدد کریں۔(176) میَں کھوئی ہوئی بھیڑ کی مانند بھٹک گیا ہوں اپنے بندہ کو تلاش کر کیونکہ میَں تیرے فرمان کو نہیں بھولتا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view120() {
struct ur120 poems[] = {
	{1, "1  میَں نے مُصیبت میں خُداوند سے دُعا کی اور اُس نے مجھے جواب دیا ۔ "},
	{2, "2  جھوٹے ہونٹوں اور دغاباز زُبان سے اَے خُداوند ! میری جان کو چُھڑا۔ "},
	{3, "3  اَے دغاباز زُبان! تجھے کیا دیا جائے اور تجھ سے اور کیا کِیا جائے ؟ "},
	{4, "4  زبردست کے تیز تیر جھاؤ کے انگاروں کے ساتھ۔ "},
	{5, "5  مجھ پر افسوس کہ میَں مسؔک میں بستا او ر قیدؔار کے خیموں میں رہتا ہوں۔ "},
	{6, "6  صُلح کے دُشمن کے ساتھ رہتے ہُوئے مجھے بڑی مُدت ہو گئی ۔ "},
	{7, "7  میَں تو صُلح دوست ہوں پر جب بولتا ہوں تو وہ جنگ پر آمادہ ہو جاتے ہیں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view121() {
struct ur121 poems[] = {
	{1, "2  میری کُمک خُداوند سے ہے جِس نے آسمان اور زمین کو بنایا ۔ "},
	{2, "3  وہ تیرے پاؤں کو پھسلنے نہ دیگا۔ تیرا مُحافظ اُنگھنے کانہیں۔ "},
	{3, "4  دیکھ! اِسرؔائیل کو مُحافظ نہ اُنگھیگا نہ سوئیگا۔ "},
	{4, "5  خُداوند تیرا مُحافظ ہے خُداوند تیرے دہنے ہاتھ پر تیرا سائبان ہے۔ "},
	{5, "6  نہ آفتاب دِن کو تجھے ضرر پہنچائیگا نہ ماہتاب رات کو۔ "},
	{6, "7  خُداوند ہر بلا سے تجھے محفوظ رکھے گا۔ اور تیری جان کو محفوظ رکھیگا۔ "},
	{7, "8  خُداوند تیری آمدورفت میں اب سے ہمیشہ تک تیری حفاظت کریگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view122() {
struct ur122 poems[] = {
	{1, "1  میَں خُوش ہؤا جب وہ مجھے کہنے لگے آؤ خُداوند کے گھر چلیں۔ "},
	{2, "2  اَے یروشؔلیم ! ہمارے قدم تیرے پھاٹکوں کے اندر ہیں "},
	{3, "3  اَے یروشؔلیم ! تُو ایسے شہر کی مانند ہے جو گُنجان بنا ہو۔ "},
	{4, "4  جہاں قبیلے یعنی خُداوند کے قبیلے اِسرؔائیل کی شہادت کے لئے خُداوند کے نام کا شُکر کرنے کو جاتے ہیں۔ "},
	{5, "5  کیونکہ وہاں عدالت کے تخت یعنی داؤؔد کے خاندان کے تخت قائم ہیں۔ "},
	{6, "6  یروشؔلیم کی سلامتی کی دُعا کرو۔ وہ جو تجھ سے مُحبت رکھتا ہے اقبالند ہونگے۔ "},
	{7, "7  تیری فصیل کے اندر سلامتی اور تیرے محلّوں میں اِقبالمندی ہو۔ "},
	{8, "8  میَں اپنے بھائیوں اور دُوستوں کی خاطر اب کہونگا تجھ میں سلامتی رہے۔ "},
	{9, "9  خُداوند اپنے خُدا کے گھر کی خاطر میَں تیری بھلائی کا طالب رہونگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view123() {
struct ur123 poems[] = {
	{1, "1  تُو جو آسمان پر تخت نشین ہے مَں اپنی آنکھیں تیری طرف اُٹھاؤنگا۔ "},
	{2, "2  دیکھ جِس طرح غلامُوں کی آنکھیں اپنے آقا کے ہاتھ کی طرف اور لونڈی کی آنکھیں اپنی بی بی کے ہاتھ کی طرف لگی رہتی ہیں۔ اُسی طرح ہماری آنکھیں خُداوند اپنے خُدا کی طرف لگی ہیں۔ جب تک وہ ہم پر رحم نہ کرے ۔ "},
	{3, "3  ہم پر رحم کر۔ اَے خُداوند! ہم پر رحم کر۔ کیونکہ ہم ذلِت اُٹھاتے اُٹھاتے تنگ آ گئے ۔ "},
	{4, "4  آسوُدہ حالوں کے تمسخُر اور مغروروں کی حقارت سے ہماری جان سیر ہو گئی۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view124() {
struct ur124 poems[] = {
	{1, "1  اب اِسرائؔیل یوں کہے اگر خپداوند ہماری طرف نہ ہوتا۔ "},
	{2, "2  اگر خُداوند اُس وقت ہماری طرف نہ ہوتا۔ جب لوگ ہمارے خلاف اُٹھے۔ "},
	{3, "3  تو جب اُنکا قہر ہم پر بھڑکا تھا۔ وہ ہم کو جیتا ہی نِگل جاتے۔ "},
	{4, "4  اُس وقت پانی ہمکو ڈبو دیتا۔ اور سِلاب ہماری جان پر سے گُذر جاتا۔ "},
	{5, "5  اُس وقت مُوجزن پانی ہماری جان پر سے گُذر جاتا۔ "},
	{6, "6  خُداوند مُبارِک ہو۔ جِس نے ہمیں اُنکے دانت کا شِکار نہ ہونے دیا۔ "},
	{7, "7  ہماری جان چڑیا کی مانند چڑیماروں کے جال سے بچ نکلی۔ جال تو ٹوٹ گیا اور ہم بچ نکلے۔ "},
	{8, "8  ہماری مدد خُداوند کے نام سے ہے۔ جِس نے آسمان اور زمین کو بنایا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view125() {
struct ur125 poems[] = {
	{1, "1  جو خُداوند پر توکل کرتے ہیں وہ کوہِ صِیؔوُن کی مانند ہیں جو اٹل بلکہ ہمیشہ قائم ہیں۔ "},
	{2, "2  جَیسے یروشؔلیم پہاڑوں سے گھِرا ہے ویسے ہی اب سے ابدتک خُداوند اپنے لوگوں کو گھیرے رہیگا۔ "},
	{3, "3  کیونکہ شرارت کو عصا صادِقوں کی میراث پر قائم نہ ہوگا۔ تاکہ صادق بدکاری کی طرف اپنے ہاتھ نہ بڑھائیں۔ "},
	{4, "4  اَے خُداوند! بھلوں کے ساتھ بھلائی کر۔اور اُن کے ساتھ بھی جو راست دِل ہیں۔ "},
	{5, "5  لیکن جو اپنی ٹیڑھی راہوں کی طرف مُڑتے ہیں اُنکو خُداوند بدکرداروں کے ساتھ نکال لے جائیگا۔ اِسرؔئیل کی سلامتی ہو! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view126() {
struct ur126 poems[] = {
	{1, "1  جب خُداوند صیِوُؔن کے اسیروں کو واپس لایا تو ہم خواب دیکھنے والے کی مانند تھے۔ "},
	{2, "2  اُس وقت ہمارے مُنہ میں ہنسی اور ہماری زُبان پر راگنی تھی۔تب قوموں میں یہ چرچا ہونے لگا کہ خُداوند نے اُنکے لئے بڑے بڑے کام کئے ہیں۔ "},
	{3, "3  خُداوند نے ہمارے لئے بڑے بڑے کام کئے ہیں۔ اور ہم شادمان ہیں۔ "},
	{4, "4  اَے خُداوند! جنُوب کی ندیوں کی طرح ہمارے اسیروں کو وآپس لا۔ "},
	{5, "5  جو آنسوُؤں کے ساتھ بوتے ہیں وہ خُوشی کے ساتھ کاٹینگے۔ "},
	{6, "6  جو روتا ہُؤا بیج بونے جاتا ہے وہ اپنے پولے لئے ہُوئے شادمان لُوٹیگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view127() {
struct ur127 poems[] = {
	{1, "1  اگر خُداوند ہی گھر نہ بنائے تو بنانے والے کی محنت عبث ہے۔ اگر خُداوند ہی شہر کی حفاظت نہ کرے تو نگہبان کا جاگنا عبث ہے۔ "},
	{2, "2  تمہارے لئے سویرے اُٹھنا اور دیر میں آرام کرنا اور مُشقت کی روٹی کھانا عبث ہے۔ کیونکہ وہ اپنے محبوب کو تو نیند میں ہ دیدیتا ہے۔ "},
	{3, "3  دیکھو! اولاد خُداوند کی طرف سے میراث ہے۔ اور پیٹ کا پھل اُس کی طرف سے اجر ہے۔ "},
	{4, "4  جوانی کے فرزند ایسے ہیں جیَسے زبردست کے ہاتھ میں تیر۔ "},
	{5, "5  خُوش نصیب ہے وہ آدمی جِسکا تر کش اُس نے بھرا ہے۔ جب وہ اپنے دُشمنوں سے پھاٹک پر باتیں کرینگے تو شرمندہ نہ ہونگے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view128() {
struct ur128 poems[] = {
	{1, "1  مُبارک ہے ہر ایک جو خُداوند سے ڈرتا ہے اور اُسکی راہوں پر چلتا ہے۔ "},
	{2, "2  تُو اپنے ہاتھوں کی کمائی کھائے گا۔ تُو مُبارک اور سعادتمند ہو گا۔ "},
	{3, "3  تیری بیوی تیرے گھر کے اندر میوہ دار تاک کی مانند ہو گی۔ اور تیری اولاد تیرے دستر خوان پر زیتون کے پودوں کی امنند ۔ "},
	{4, "4  دیکھو! اَیسی برکت اُس آدمی کو مِلیگی۔ جو خُداوند سے ڈرتا ہے۔ "},
	{5, "5  خُداوند صیِوُؔن میں سے تجھکو برکت دے اور عُمر بھر یروشؔلیم کی بھلائی دیکھے۔ "},
	{6, "6  بلکہ تُو اپنے بچوں کے بچے دیکھے گا۔ اِسرائؔیل کی سلامتی ہو! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view129() {
struct ur129 poems[] = {
	{1, "1  اِسرائؔیل اب یوں کہے اُنہوں نے میرے جوانی سے اب تک بار بار مجھے ستایا۔ "},
	{2, "2  ہاں اُنہوں نے میری جوانی سے اب تک بار بار مجھے ستایا۔ تو بھی وہ مجھ پر غالب نہ آئے ۔ "},
	{3, "3  ہلواہوں نے میری پیٹھ پر ہل چلائے اور لمبی لمبی ریگھاریاں بنائیں۔ "},
	{4, "4  خُداوند صادق ہے۔ اُس نے شریروں کی رسیاں کاٹ ڈالیں۔ "},
	{5, "5  صیِوُؔن سے نفرت رکھنے والے سب شرمندہ اور پسپا ہوں۔ "},
	{6, "6  وہ چھت پر کی گھاس کی مانند ہوں۔ جو بڑھنے سے پہلےہی سوکھ جاتی ہے۔ "},
	{7, "7  جِس سے فصل کاٹنے والے اپنی مُٹھی کو اور پولے باندھنے والا اپنے دامن کو نہیں بھرتا۔ "},
	{8, "8  نہ آنے جانے والے یہ کہتے ہیں کہ تُم پر خُداوند کی برکت ہو۔ ہم خُداوند کے نام سے تم کو دُعا دیتے ہیں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view130() {
struct ur130 poems[] = {
	{1, "1  اَے خُداوند! میَں نے گہراؤ میں سے تیرے حُضُور فریاد کی ہے۔ "},
	{2, "2  اَے خُداوند میری آواز سُن لے۔ میری التجا کی آواز پر تیرے کان لگے رہیں۔ "},
	{3, "3  اَے خُداوند! اگر تُو بدکاری کو حساب میں لائے تو اَے خُداوند ! کون قائم رہ سکیگا؟ "},
	{4, "4  پر مغفرت تیرے ہاتھ میں ہے۔ تاکہ لوگ تجھ سے ڈریں۔ "},
	{5, "5  میں خُداوند کا انتطار کرتا ہوں۔ میری جان مُنتظر ہے۔ اور مجھے اُسکے کلام پر اعتماد ہے۔ "},
	{6, "6  صُبح کا انتظار کرنے والوں سے زیادہ ۔ ہاں صُبح کا انتظار کرنے والوں سے کہیں زیادہ میری جان خُداوند کی مُنتظر ہے۔ "},
	{7, "7  اَے اِسراؔئیل ! خُداوند پر اعتماد کر کیونکہ خُداوند کے ہاتھ میں شفقت ہے۔ اُسی کے ہاتھ میں فدیہ کی کثرت ہے۔ "},
	{8, "8  اور وہی اِسرائؔیل کا فدیہ دیکر اُسکو ساری بدکاری سے چُھڑائیگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view131() {
struct ur131 poems[] = {
	{1, "1  اَے خُداوند! میرا دِل مغرور نہیں اور میَں بُلند نظر نہیں ہوں نہ مجھے بڑے بڑے معُاملوں سے سروکار ہے۔ نہ اُن باتوں سے جو میری سمجھ سے باہر ہیں۔ "},
	{2, "2  یقیناًمیَں نے اپنے دِل کو تسکین دیکر مطمئن کر دیا ہے۔ میرا دِل مجھ میں دودھ چُھڑائے بچے کی مانند ہے۔ ہاں جَیسے دودھ چُھڑایا ہُؤا بچا ماں کی گود میں۔ "},
	{3, "3  اَے اِسرائؔیل ! اب سے ابد تک خُداوند پر اعتماد کر۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view132() {
struct ur132 poems[] = {
	{1, "1  اَے خُداوند داؤؔد کی خاطر اُسکی سب مُصیبتوں کو یاد کر ۔ "},
	{2, "2  کہ اُس نے کِس طرح خُداوند سے قسم کھائی اور یعقؔوُب کے قادر کے حُضُور منّت مانی ۔ "},
	{3, "3  کہ یقیناً میَں نہ اپنے گھر میں داخل ہونگا۔ نہ اپنے پلنگ پر جاؤنگا۔ "},
	{4, "4  اور نہ اپنی آنکھوں میں نیند نہ اپنی پلکوں میں جھپکی آنے دونگا۔ "},
	{5, "5  جب تک خُداوند کے لئے کوئی جگہ اور یعقؔوُب کے قادر کے لئے کوئی مسکن نہ ہو۔ "},
	{6, "6  دیکھو ہم نے اِسکی خبر اِفرؔاتا میں سُنی۔ ہمیں یہ جنگل کے میدان میں ملی۔ "},
	{7, "7  ہم اُسکے مسکنوں میں داخل ہونگے ہم اُس کے پاؤں کی چوکی کے سامنے سِجدہ کرینگے۔ "},
	{8, "8  اُٹھ اَے خُداوند!اپنی آرام گاہ میں داخل ہو تُو اور تیری قدرت کا صُندوق۔ "},
	{9, "9  تیرے کاہن صداقت سے مُلبس ہوں۔ اور تیرے مُقدّس خُوشی کے نعرے ماریں۔ "},
	{10, "10  اپنے بندہ داؤد کی خاطر اپنے ممسوح کی دُعا نا منظور نہ کر ۔ "},
	{11, "11  خُداوند نے سچّائی کے ساتھ داؤؔد سے قسم کھائی ہے۔ اور اُس سے پھرنے کا نہیں۔ کہ میں تیری اولاد میں سے کسی کو تیرے تخت پر بٹھاؤنگا۔ "},
	{12, "12  اگر تیرے فرزند میرے عہد اور میری شہادت پر جو میَں اُنکو سِکھاؤنگا عمل کریں۔ تو اُنکے فرزند بھی ہمیشہ تیرے تخت پر بیٹھینگے۔ "},
	{13, "13  کیونکہ خُداوند نے صیِؔوُن کو چُنا ہے۔ اُس نے اُسے اپنے مسکن کے لئے پسند کیا ہے۔ "},
	{14, "14  یہ ہمیشہ کے لئے میری آرام گاہ ہے۔ میَں یہیں رہونگا کیونکہ میَں نے اِسے پسند کیا ہے۔ "},
	{15, "15  میَں اِس کے رِزق میں خوب برکت دونگا۔ میَں اِسکے غریبوں کو روٹی سے سیر کرونگا۔ "},
	{16, "16  اِسکے کاہن کو بھی میَں نجات سے مُلبس کرونگا۔ اور اُسکے مُقدّس بُلند آواز سے خُوشی کے نعرے ماریں گے۔ "},
	{17, "17  وہیں میَں داؤؔد کے لئے ایک سینگ نکالونگا۔ میَں نے اپنے ممسُوح کے لئے چراغ تیار کیا ہے۔ "},
	{18, "18  میَں اُسکے دُشمنوں کو شرمندگی کا لباس پہناؤنگا۔ لیکن اُس پر اُسی کا تاج رونق افروز ہوگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view133() {
struct ur133 poems[] = {
	{1, "1  دیکھو ! کیسی اچھی اور خُوشی کی بات ہے کہ بھائی باہم مِل کر رہیں۔ "},
	{2, "2  یہ اُس بَیش قیمت تیل کی مانند ہے جو سر پر لفگایا گیا اور بہتا ہوا داڑھی پر آگیا بلکہ اُسکے پیراہن کے دامن تک جاپہنچا۔ "},
	{3, "3  یا حرمؔون کی اوس کی مانند ہے جو صیِوُؔن کے پہاڑوں پر پڑتی ہے۔ کیونکہ وہیں خُداوند نے برکت کا یعنی ہمیشہ کی زندگی کا حکم فرمایا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view134() {
struct ur134 poems[] = {
	{1, "1  اَے خُداوند کے بندو! آؤ سب خُداوند کو مُبارِک کہو۔ تُم جو رات کو خُداوند کے گھر میں کھڑے رہتے ہو! "},
	{2, "2  مقدِس کی طرف اپنے ہاتھ اُٹھاؤ اور خُداوند کو مُبارِک کہو۔ "},
	{3, "3  خُداوند جِس نے آسمان اور زمین کو بنایا صیِوُؔن میں سے تجھے برکت بخشے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view135() {
struct ur135 poems[] = {
	{1, "1  خُداوند کی حمد کرو۔ خُداوند کے نام کی حمد کرو۔ اَے خُداوند کے بندو! اُسکی حمد کرو۔ "},
	{2, "2  تُم جو زمین کے گھر میں ہمارے خُداوند کے گھر کی بارگاہوں میں کھڑے رہتے ہو۔ "},
	{3, "3  خُداوند کی حمد کرو کیونکہ خُداوند بھلا ہے اُسکے نام کی مدح سرائی کرو کہ یہ دِل پسند ہے۔ "},
	{4, "4  کیونکہ خُداوند نے یعقُؔوب کو اپنے لئے اور اِسرائؔیل کو اپنی خاص ملکیت کے لئے چُن لیا ہے۔ "},
	{5, "5  اِسلئے کہ میں جانتا ہوں کہ خُداوند بُزرگ ہے۔ اور ہمارا رب سب معبودوں سے بالا تر ہے۔ "},
	{6, "6  آسمان اور زمین میں ۔ سُمندر اور گہراؤ میں خُداوند نے جو کچھ چاہا وُہی کیا۔ "},
	{7, "7  وہ زمین کی انتہا سے بخارات اُٹھاتا ہے۔ وہ بارِش کے لئے بجلیاں بناتا ہے اور اپنے مخزنوں سے اندھی نکالتا ہے۔ "},
	{8, "8  اُسی نے مصر کے پہلوٹھوں کو مارا۔ کیا اِنسان کے کیا حیوان کے ۔ "},
	{9, "9  اَے مصؔر ! اُسی نے تجھ میں فرعؔون اور اُسکے سب خادموں پر نشان اور عجائب ظاہر کئے ۔ "},
	{10, "10  اُس نے بہت سی قوموں کو مارا اور زبردست بادشاہوں کو قتل کیا۔ "},
	{11, "11  اموریوں کے باشاہ سیحؔون کو اور بؔسن کے بادشاہ عوؔج کو اور کنعؔان کی سب مملکتوں کو ۔ "},
	{12, "12  اور اُنکی زمین میراث کر دی۔ یعنی امنی قوم اِسرائؔیل کی میراث ۔ "},
	{13, "13  اَے خُداوند! تیرا نام ابدی ہے اور تیری یادگار اَے خُداوند پُشت در پُشت قائم ہے۔ "},
	{14, "14  کیونکہ خُداوند اپنی قوم کی عدالت کریگا۔ اور اپنے بندوں پر ترس کھائے گا۔ "},
	{15, "15  قوموں کے بت چاندی اور سونا ہیں۔ یعنی آدمی کی دستکاری۔ "},
	{16, "16  اُنکے مُنہ ہیں پر وہ بولتے نہیں۔ آنکھیں ہیں پر وہ دیکھتے نہیں۔اُنکے کان ہیں پر وہ سُنتے نہیں۔ اور اُنکے مُنہ میں سانس نہیں ۔ "},
	{17, "18  اُنکے بنانے والے اُن ہی کی مانند ہو جائینگے۔۔ بلکہ وہ سب جو اُن پر بھروسہ رکھتے ہیں۔ "},
	{18, "19  اَے اِسرئؔیل کے گھرانے! خُداوند کو مُبارِک کہو۔ اَے ہارؔون کے گھرانے! خُداوند کو مُبارِک کہو۔ "},
	{19, "20  اَے لاوی کے گھرانے! خُداوند کو مُبرِک کہو۔ اَے خُداوند سے ڈرنےوالو! خُداوند کو مُبارِک کہو۔ "},
	{20, "21  صیِوُؔن میں خُداوند مُبارِک ہو۔ وہ یروشلؔیم میں سکونت کرتا ہے۔ خُداوند کی حمد کرو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view136() {
struct ur136 poems[] = {
	{1, "1  خُداوند کا شُکر کرو کیونکہ وہ بھلا ہے۔ کہ اُسکی شفقت ابدی ہے۔ "},
	{2, "2  اِلہٰوں کے خُدا کا شُکر کرو۔ کہ اُسکی شفقت ابدی ہے۔ "},
	{3, "3  مالِکوں کے مالِک کا شُکر کرو کہ اُسکی شفقت ابدی ہے۔ "},
	{4, "4  اُسکا جو اکیلا بڑے بڑے عجیب کام کرتا ہے۔ کہ اُسکی شفقت ابدی ہے۔ "},
	{5, "5  اُسی کا جِس نے دانائی سے آسمان بنایا کہ اُسکی شفقت ابدی ہے۔ "},
	{6, "6  اُسی کا جِس نے زمین کو پانی پر پھیلایا۔ کہ اُسکی شفقت ابدی ہے۔ "},
	{7, "7  اُسی کا جِس نے بڑے بڑے نیّر بنائے کہ اُسکی شفقت ابدی ہے۔ "},
	{8, "8  دِن کو حکومت کرنے کے لئے آفتاب کہ اُسکی شفقت ابدی ہے۔ "},
	{9, "9  رات کو حکومت کرنے کے لئے مہتاب اور ستارے کہ اُسکی شفقت ابدی ہے۔ "},
	{10, "10  اُسی کا ج،س نے مصؔر کے پہلوٹھوں کو مارا۔ کہ اُسکی شفقت ابدی ہے۔ "},
	{11, "11  اور اِسرائؔیل کو اُن میں سے نِکال لایا۔ کہ اُسکی شفقت ابدی ہے۔ "},
	{12, "12  قوی ہاتھ اور بلند بازو سے کہ اُسکی شفقت ابدی ہے۔ "},
	{13, "13  اُسی کا جِس نے بحرِ قُلزؔم کو دو حصّے کر دیا کہ اُسکی شفقت ابدی ہے۔ "},
	{14, "14  اور اِسرائؔیل کو اُس میں سے پار کیا کہ اُسکی شفقت ابدی ہے۔ "},
	{15, "15  لیکن فرعؔون اور اُسکے لشکر کو بحرِ قُلزؔم میں ڈالدیا۔ کہ اُسکی شفقت ابدی ہے۔ "},
	{16, "16  اُسی کا جو بیابان میں اپنے لوگوں کا راہنما ہُؤا۔ کہ اُسکی شفقت ابدی ہے۔ "},
	{17, "17  اُسی کا جِس نے بڑے بڑے بادشاہوں کو مارا کہ اُسکی شفقت ابدی ہے۔ "},
	{18, "18  اور نامور بادشاہوں کو قتل کیا کہ اُسکی شفقت ابدی ہے۔ "},
	{19, "19  اموریوں کے بادشاہ سیحؔون کہ اُسکی شفقت ابدی ہے۔ "},
	{20, "20  اور بسؔن کے بادشاہ عوؔج کو کہ اُسکی شفقت ابدی ہے۔ "},
	{21, "21  اور اُنکی زمین میراث کر دی کہ اُسکی شفقت ابدی ہے۔ "},
	{22, "22  یعنی اپنے بندہ اِسرائؔیل کی میراث کہ اُسکی شفقت ابدی ہے۔ "},
	{23, "23  جِس نے ہماری پستی میں ہمکو یاد کیا کہ اُسکی شفقت ابدی ہے۔ "},
	{24, "24  اور ہمارے مخالفوں سے ہمکو چُھڑایا کہ اُسکی شفقت ابدی ہے۔ "},
	{25, "25  جو سب بشر کہ روزی دیتا ہے۔ کہ اُسکی شفقت ابدی ہے۔ "},
	{26, "26  آسمان کے خُدا کا شُکر کرو کیونکہ اُسکی شفقت ابدی ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view137() {
struct ur137 poems[] = {
	{1, "1  ہم بابل کی ندیوں پر بیٹھے اور صیِؔوُن کو یاد کر کے روئے۔ "},
	{2, "2  وہاں بَید کے درختوں پر اُنکے وسط میں ہم نے اپنی سِتاروں کو ٹانگ دیا۔ "},
	{3, "3  کیونکہ وہاں ہمکو اسیر کرنے والوں نے گیت گانے کا حُکم دیا۔ اور تباہ کرنے والوں نے خُوشی کا اور کہا صیِوُؔن کے گیتوں میں سے ہمکو کوئی گیت سُناؤ ۔ "},
	{4, "4  ہم پردیس میں خُداوند کو گیت کیَسے گائیں؟ "},
	{5, "5  اَے یروشؔلیم ! اگر میں تجھے بھُولوُں تو میرا دہنا ہاتھ اپنا ہُنر بھوُل جائے۔ "},
	{6, "6  اگر میَں تجھے یاد نہ رکھوں اگر میَں یروشؔلیم کو اپنی بڑی سے بڑی خُوشی پر ترجیح نہ دوں تو میری زُبان میرے تالو سے چپ جائے۔ "},
	{7, "7  اَے خُداوند! یروشؔلیم کے دِن کو بنی ادوؔم کے خلاف یاد کر جو کہتے تھے اِسے ڈھادو۔ اِسے بنیاد تک ڈھا دو۔ "},
	{8, "8  اَے بابل کی بیٹی! جو ہلاک ہونے والی ہے۔ وہ مُبارِک ہو گا جو تجھے اُس سُلوُک کا جو تُو نے ہم سے کیا بدلہ دے۔ "},
	{9, "9  وہ مُبارک ہو گا جو تیرے بچوں کو لے کر چٹان پر پٹک دے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view138() {
struct ur138 poems[] = {
	{1, "1  میَں پورے دِل سے تیرا شُکر کروُنگا۔ معبودوں کے سامنے تیری مدح سرائی کرونگا۔ "},
	{2, "2  میَں تیری مُقدس ہیکل کی طرف رُخ کر کے سجدہ کرونگا اور تیری شفقت اور سچّائی کی خاطر تیرے نام کا شُکر کرونگا۔ کیونکہ تُو نے اپنے کلام کو اپنے ہر نام سے زیادہ عظمت دی ہے۔ "},
	{3, "3  جِس دن میَں نے تجھ سے دُعا کی تُو نے مجھے جواب دیا۔ اور میری جان کو تقویت دیکر میرا حوصلہ بڑھایا۔ "},
	{4, "4  اَے خُداوند ! زمین کے سب بادشاہ تیرا شُکر کرینگے۔ کیونکہ اُنہوں نے تیرے مُنہ کا کلام سُنا ہے۔ "},
	{5, "5  بلکہ وہ خُداوند کی راہوں کا گیت گائینگے۔ کیونکہ خُداوند کا جلال بڑا ہے۔ "},
	{6, "6  کیونکہ خُداوند اگرچہ بُلند و بالا ہے تو بھی خاکساروں کا خیال رکھتا ہے۔ لیکن مغرور کو دور ہی سے پہچان لیتا ہے۔ "},
	{7, "7  خواہ میں دُکھ میں سے گُذروں تُو مجھے تازہ دم کریگا۔ تُو میرے دُشمنوں کے کے قہر کے خلاف ہاتھ بڑھائیگا۔ اور تیرا دہنا ہاتھ مجھے بچا لیگا۔ "},
	{8, "8  خُداوند میرے لئے سب کُچھ کریگا۔ اَے خُداوند! تیری شفقت ابدی ہے۔ اپنی دستکاری کو ترک نہ کر۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view139() {
struct ur139 poems[] = {
	{1, "1  اَے خُداوند ! تُو نے مجھے جانچ لیا اور پہچان لیا۔ "},
	{2, "2  تُو میرا اُٹھنا بیٹھنا جانتا ہے۔ تُو میرے خیال کو دور سے سمجھ لیتا ہے۔ "},
	{3, "3  تُو میرے راستہ کی اور میری خوابگاہ کی چھان بین کرتا ہے۔ اور میری سب روشوں سے واقف ہے۔ "},
	{4, "4  دیکھ! میری زُبان پر کوئی ایسی بات نہیں جِسے تُو اَے خُداوند! پُورے طور پر نہ جانتا ہو۔ "},
	{5, "5  تُو نے مجھے آگے پیچھے سے گھیر رکھا ہے۔اور تیرا ہاتھ مجھ پر ہے۔ "},
	{6, "6  یہ عرفان میرے لئے نہایت عجیب ہے۔ یہ بُلند ہے میَں اِس تک پہنچ نہیں سکتا۔ "},
	{7, "7  میَں تیری روح سے بچ کر کہاں جاؤں۔ یا تیری حُضُوری سے کدھر بھاگُوں؟ "},
	{8, "8  اگر آسمان پر چڑھ جاؤں تو تُو وہاں ہے۔ اگر میَں پاتال میں بستر بچھاؤں تو دیکھ! تو وہاں بھی ہے۔ "},
	{9, "9  اگر میَں صُبح کے پر لگا کر سُمندر کی اِنتہا میں بسوں۔ "},
	{10, "10  تو وہاں بھی تیرا ہاتھ میری راہنمائی کریگا۔ اور تیرا دہنا ہاتھ مجھے سنبھالیگا۔ "},
	{11, "11  اگر میَں کہوں کہ یقیناً تاریکی مجھے چِھپا لیگی اور میری چاروں طرف کا اُجالا رات بن جائیگا۔ "},
	{12, "12  تو اندھیرا بھی تجھ سے چِھپا نہیں سکتا۔ بلکہ رات بھی دِن کی مانند روشن ہے۔ اندھیرا اور اُجالا دونوں یکسان ہیں۔ "},
	{13, "13  کیونکہ میرے دِلکو تُو ہی نے بنایا ۔ میری ماں کے پیٹ میں تُو ہی نے مجھے صورت بخشی ۔ "},
	{14, "14  میَں تیرا شُکر کروُنگا کیونکہ میَں عجیب و غریب طور سے بنا ہوُں۔ تیرے کام حیرت انگیز ہیں۔ میرا دِل اِسے خوب جانتا ہے۔ "},
	{15, "15  جب میَں پوشیدہ میں بن رہا تھا اور زمین کے اسفل میں عجیب طور سے مرتب ہو رہا تھا تو میرا قالب تجھ سےچھِپا نہ تھا۔ "},
	{16, "16  تیری آنکھوں نے میرے بے ترتیب مادّے کو دیکھا اور جو ایام میرے لئے مقرر تھے وہ سب تیری کتاب میں لکھے تھے۔جبکہ ایک بھی وجود میں نہ آیا تھا۔ "},
	{17, "17  اَے خُدا! تیرا خیال میرے لئے کیسے بَیش بہا ہیں۔ اُنکا مجموعہ کیَسا بڑا ہے؟ "},
	{18, "18  اگر میَں اُنکو گِنوں تو وہ شُمار میں ریت سے بھی زیادہ ہیں۔ جاگ اُٹھتے ہی تجھے اپنے ساتھ پاتا ہوں۔ "},
	{19, "19  اَے خُدا!کاشک تُو شریر کو قتل کرے۔ اِسلئے اَے خونخوارو! میرے پاس سے دوُر ہو جاؤ ۔ "},
	{20, "20  کیونکہ وہ شرارت سے تیرے خلاف باتیں کرتے ہیں۔ اور تیرے دُشمن تیرا نام بے فائدہ لیتے ہیں۔ "},
	{21, "21  اَے خُداوند! کیا میَں تجھ سے عداوت رکھنے والوں کے سے عداوت نہیں رکھتا اور کیا میں تیرے مُکالفوں سے بیزار نہیں ہوُں؟ "},
	{22, "22  مجھے اُن سے پوری عداوت ہے۔ میَں اُنکو اپنے دُشمن سمجھتا ہوں۔ "},
	{23, "23  اَے خُدا! تُو مجھے جانچ اور میرے دِل کو پہچان۔ مجھے آزما اور میرے خیالوں کوجان لے۔ "},
	{24, "24  اور دیکھ کہ مجھ میں کوئی بُری روِش تو نہیں اور مجھکو ابدی راہ میں لے چل۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view140() {
struct ur140 poems[] = {
	{1, "1  اَے خُداوند! مجھے بُرے آدمی سے رہائی بخش۔ مجھے تُند خُو آدمی سے محفوظ رکھ۔ "},
	{2, "2  جو دِل میں شرارت کے منصوبے باندھتے ہیں وہ ہمیشہ مِلکر جنگ کے لئے جمع ہو جاتے ہیں۔ "},
	{3, "3  اُنہوں نے اپنی زُبان سانپ کی طرح تیز کر رکھی ہے۔ اُنکے ہونٹوں کے نیچے افعی کا زہر ہے۔ "},
	{4, "4  اَے خُداوند! مجھے شریر کے ہاتھ سے بچا۔ مجھے تُند خُو آدمی سے محفوظ رکھ۔ "},
	{5, "5  مغروروں نے میرے لئے پھندے اور رسیوں کو چھِپایا ہے۔ اُنہوں نے راہ کے کنارے جال لگایا ہے۔ اُنہوں نے میرے لئے دام بچھا رکھے ہیں۔ "},
	{6, "6  میَں نے خُداوند سے کہا میرا خُدا تُو ہی ہے۔ اَے خُداوند میری التجا کی آواز پر کان لگا۔ "},
	{7, "7  اَے خُداوند میرے مالک ! میری نجات کی قوت تُو نے جنگ کے دِن میرے سر پر سایہ کیا ہے۔ "},
	{8, "8  اَے خُداوند ! شریر کی مُراد پُوری نہ کر۔ اُسکے بُرے منصوبہ کو انجام نہ دے تاکہ وہ ڈینگ نہ مارے۔ "},
	{9, "9  مجھے گھیرنے والوں کے مُنہ کی شرارت اُن ہی کے سر پر پڑے ۔ "},
	{10, "10  اُن پر انگارے گریں۔ وہ آگ میں ڈالے جائیں اور ایسے گڑھوں میں کہ پھر نہ اُٹھیں۔ "},
	{11, "11  بد زُبان آدمی کو زمین پر قیام نہ ہو گا۔ آفت تُند خُو آدمی کو رگید کر ہلاک کریگی۔ "},
	{12, "12  میَں جانتا ہوں کہ خُداوند مُصیبت زدہ کے معاملہ کی اور محتاج کے حق کی تائید کریگا۔ "},
	{13, "13  یقیناً صادِق تیرے نام کا شُکر کرینگے۔ اور راستباز تیرے حُضُور میں رہینگے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view141() {
struct ur141 poems[] = {
	{1, "1  اَے خُداوند میَں نے تیری دُہائی دی ہے۔ میری طرف جلد آ۔ جب میَں تجھ سے دُعا کروں تُو میری آواز پر کان لگا۔ "},
	{2, "2  میری دُعا تیرے حُضُور بخور کی مانند ہو۔ اور میرا ہاتھ اُٹھانا شام کی قُربانی کی مانند ۔ "},
	{3, "3  اَے خُداوند! میرے مُنہ پر پہرا بٹھا۔ میرے لبوں کے دروازہ کی نگہبانی کر۔ "},
	{4, "4  میرے دِل کو کِسی بُری بات کی طرف مائل نہ ہونے دے کہ بدکاروں کے ساتھ ملکر شرارت کے کاموں میں مصروف ہو جائے اور مجھے اُنکے نفیس کھانوں سے باز رکھ۔ "},
	{5, "5  صادِق مجھے مارے تو مہربانی ہو گی۔ وہ مجھے تنبیہ کرے تو گویا سر پر روغن ہو گا۔ میرا سر اِس سے اِنکار نہ کرے۔ کیونکہ اُنکی شرارت میں بھی میَں دُعا کرتا رہونگا۔ "},
	{6, "6  اُنکے حاکم چٹان کے کناروں پر سے گِرا دئے گئے ہیں۔ اور وہ میری باتیں سُنینگے کیونکہ وہ شیرین ہیں۔ "},
	{7, "7  جَیسے ہل چلا کر زمین کو توڑتا ہے ویسے ہی ہماری ہڈیاں پاتال کے مُنہ پر بکھری پڑی ہیں۔ "},
	{8, "8  کیونکہ اَے مالک خُداوند ! میری آنکھیں تیری طرف ہیں۔ میرا توکل تجھ پر ہے۔ میری جان کو بے کس نہ چھوڑ۔ "},
	{9, "9  مجھے اُس پھندے سے جو اُنہوں نے میرے لئے لگایا ہے اور بدکرداروں کے دام سے بچا۔ "},
	{10, "10  شریر آپ اپنے جال میں پھنسیں اور میَں سلامت بچ نِکلوں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view142() {
struct ur142 poems[] = {
	{1, "1  میَں اپنی آواز بلند کر کے خُداوند سے فریاد کرتا ہوں۔ میَں اپنی ہی آواز سے خُداوند سے منّت کرتا ہوں۔ "},
	{2, "2  میَں اُسکے حُضُور فریاد کرتا ہوں۔ میَں اپنا دُکھ اُسکے حُضُور بیان کرتا ہوں۔ "},
	{3, "3  جب مجھ میں میری جان نڈھال تھی تُو میری راہ سے واقف تھا۔ جِس راہ پر میَں چلتا ہوں اُس میں اُنہوں نے میرے لئے پھندا لگایا ہے۔ "},
	{4, "4  دہنی طرف نگاہ کر اور دیکھ مجھے کوئے نہیں پہچانتا۔ میرے لئے کہیں پناہ نہ رہی۔ کسی کو میری جان فکر نہیں۔ "},
	{5, "5  اَے خُداوند! میَں نے تجھ سے فریاد کی ۔ میَں نے کہا تُو میری پناہ ہے اور زندوں کی زمین میں میرا بخرہ۔ "},
	{6, "6  میری فریاد پر توجہ کر کیونکہ میَں نہایت پست ہو گیا ہوں۔ میرے ستانے والوں سے مجھے رہائی بخش کیونکہ وہ مجھ سے زور آور ہیں۔ "},
	{7, "7  میری میری جان کو قید سے نِکال تاکہ تیرے نام کا شُکر کروں۔ صادق میرے گِرد جمع ہونگے۔ کیونکہ تُو مجھ پر احسان کریگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view143() {
struct ur143 poems[] = {
	{1, "1  اَے خُداوند! میری دُعا سُن۔ میری التجا پر کان لگا۔ اپنی وفاداری اور صداقت میں مجھے جواب دے۔ "},
	{2, "2  اور اپنے بندہ کو عدالت میں نہ لا۔ کیونکہ تیری نظر میں کوئی آدمی راستباز نہیں ٹھہرسکتا۔ "},
	{3, "3  اِسلئے کہ دُشمن نے میری جان کو ستایا ہے۔ اُس نے میری زندگی کو خاک میں ملا دیا۔ اور مجھے اندھیری جگہوں میں اُنکی مانند بسایا ہے جِنکو مرے مُدّت ہو گئی ہو۔ "},
	{4, "4  اِسی سبب سے مجھ میں میری جان نڈھال ہے۔ اور میرا دِل مجھ میں بیَکل ہے۔ "},
	{5, "5  میَں گُذشتہ زمانوں کو یاد کرتا ہوں۔ اور تیرے سب کاموں پر غور کرتا ہوں۔ اور تیری دستکاری پر دھیان کرتا ہوں۔ "},
	{6, "6  میَں اپنے ہاتھ تیری طرف پھیلاتا ہوں۔ میری جان خُشک زمین کی مانند تیری پیاسی ہے۔ "},
	{7, "7  اَے خُداوند! جلد مجھے جواب دے۔ میری روح گُداز ہو چلی۔ اپنا چہرہ مجھ سے نہ چھِپا۔ایسا نہ ہو کہ میَں قبر میں اُترنے والوں کی مانند ہو جاؤں۔ "},
	{8, "8  صُبح کو مجھے اپنی شفقت کی خبر دے۔ کیونکہ میرا توکل تجھ پر ہے۔ مجھے وہ راہ بتا جِس پر میَں چلوں۔ کیونکہ میَں اپنا دِل تیری ہی طرف لگاتا ہوں۔ "},
	{9, "9  اَے خُداوند! مجھے میرے دُشمنوں سے رہائی بخش کیونکہ میَں پناہ کے لئےتیرے پاس بھاگ آیا ہوں۔ "},
	{10, "10  مجھے سِکھا کہ تیری مرضی پر چلوں اِسلئے کہ تُو میرا خُدا ہے۔ تیری نیک روح مجھے راستی کے مُلک میں لے چلے۔ "},
	{11, "11  اَے خُداوند! اپنے نام کی خاطر مجھے زندہ کر۔ اپنی صداقت میں میری جان کو مُصیبت سے نکال۔ "},
	{12, "12  اپنی شفقت سے میرے دُشمنوں کو کاٹ ڈال اور میری جان کے سب دُکھ دینے والوں کو ہلاک کر دے۔ کیونکہ میَں تیرا بندہ ہوں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view144() {
struct ur144 poems[] = {
	{1, "1  خُداوند میری چٹان مُبارِک ہو۔جو میرے ہاتھوں کو جنگ کرنا۔ اور میری اُنگلیوں کو لڑنا سِکھاتا ہے۔ "},
	{2, "2  وہ مجھ پر شفقت کرنے والا اور میرا قلعہ ہے۔ میرا اُونچا بُرج اور میرا چُھڑانے والا۔ وہ میری سِپر اور میری پناہ گاہ ہے۔ جو میرے لوگوں کو میرے تابع کرتا ہے۔ "},
	{3, "3  اَے خُداوند ! اِنسان کیا ہے کہ تُو اُسے یاد رکھے؟ اور آدم زاد کیا ہے کہ تو اُسکا خیال کرے؟ "},
	{4, "4  اِنسان بُطلان کی مانند ہے۔ اُسکے دِن ڈھلتے سایہ کی مانند ہیں۔ "},
	{5, "5  اَے خُداوند! آسمانوں کو جھُکا کر اُتر آ۔ پہاڑوں کو چُھو تو اُن سے دھواں اُٹھیگا۔ "},
	{6, "6  بجلی گِرا کر اُنکو پراگندہ کردے۔ اپنے تیِر چلا کر اُنکو شکست دے۔ "},
	{7, "7  اُوپر سے ہاتھ بڑھا۔ مجھے رہائی دے اور بڑے سَیلاب یعنی پر دیسیوں کے ہاتھ سے چُھڑا۔ "},
	{8, "8  جِنکے مُنہ سے بطالت نکلتی رہتی ہے۔اور جِنکا دہنا ہاتھ جھوٹ کا دہنا ہاتھ ہے۔ "},
	{9, "9  اَے خُدا میَں تیرے لئے نیا گیت گاؤنگا۔ دس تار والی بربط پر میَں تیری مدح سرائی کرونگا۔ "},
	{10, "10  وہی بادشاہوں کو نجات بخشتا ہے۔ اور اپنے بندہ داؤؔد کو مہلک تلوار سے بچاتا ہے۔ "},
	{11, "11  مجھے بچا اور پردیسیوں کے ہاتھ سے چُھڑا جِنکے مُنہ سے بطالت نکلتی رہتی ہے۔ اور جِنکا دہنا ہاتھ جھوٹ کا دہنا ہاتھ ہے۔ "},
	{12, "12  جب میرے بیٹے جوانی میں قد آور پُدوں کی مانند ہوں۔ اور ہماری بیٹیاں محّل کے کونے کے لئے تراشے ہوئے پتھروں کی مانند ہوں۔ "},
	{13, "13  جب ہمارے کھتّے بھرے ہوں جِن سے ہر قسم کی جِنس مِل سکے۔ اور ہماری بھیڑ بکریوں ہمارے کُوچوں میں ہزاروں اور لاکھوں بچے دیں۔ "},
	{14, "14  جب ہمارے بیَل خُوب لدے ہوں جب نہ رختہ ہو نہ خروج اور نہ ہمارے کوچوں میں واویلا ہو۔ "},
	{15, "15  مُبارِک ہے وہ قوم جِسکا یہ حال ہے۔ مُبارِک ہے وہ قوم جِسکا خُدا خُداوند ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view145() {
struct ur145 poems[] = {
	{1, "1  اَے میرے خُدا!اَے بادشاہ ! میَں تیری تمجید کرونگا۔ اور ابدالآباد تیرے نام کو مُبارِک کہونگا۔ "},
	{2, "2  میَں ہر روز تجھے مُبارِک کہونگا۔ اور ابدلآباد تیرے نام کی ستایش کرونگا۔ "},
	{3, "3  خُداوند بُزرگ اور بیحَد ستایش کے لائق ہے۔اُسکی بُزرگی اِدراک سے باہر ہے۔ "},
	{4, "4  ایک پُشت دُوسری پُشت سے تیرے کاموں کی تعریف اور تیری قُدرت کے کاموں کا بیان کریگی۔ "},
	{5, "5  میَں تیری عظمت کی جلالی شان پر اور تیرے عجائب پر غور کرونگا۔ "},
	{6, "6  اور لوگ تیری قُدرت کے ہولناک کاموں کا ذِکر کرینگے۔ اور میَں تیری بزُرگی بیان کرونگا۔ "},
	{7, "7  وہ تیرے بڑے احسان کی یادگار کا بیان کرینگے۔ اور تیری صداقت کا گیت گائینگے۔ "},
	{8, "8  خُداوند رحیم و کریم ہے۔ وہ قہر کرنے میں دھیما اور شفقت میں غنی ہے۔ "},
	{9, "9  خُداوند سب پر مہربان ہے۔ اور اُسکی رحمت اُسکی ساری مخلوق پر ہے۔ "},
	{10, "10  اَے خُداوند! تیری ساری مخلوق تیرا شُکر کریگی۔ اور تیرے مُقّدس تجھے مُبارِک کہیں گے۔ "},
	{11, "11  اور تیری سلطنت کے جلال کا بیان اور تیری قُدرت کا چرچا کریں گے۔ "},
	{12, "12  تاکہ بنی آدم پر اُسکی قُدرت کے کاموں کو اور اُسکی سلطنت کے جلال کی شان کو ظاہر کریں۔ "},
	{13, "13  تیری سلطنت ابدی سلطنت ہے۔ اور تیری حکومت پُشت در پُشت۔ "},
	{14, "14  خُداوند گِرتے ہوئے کو سنبھالتا اور جھُکے ہوئے کو اُٹھا کھڑا کرتا ہے۔ "},
	{15, "15  سب آنکھیں تجھ پر لگیں ہیں۔ تُو اُنکو وقت پر اُنکی خوراک دیتا ہے۔ "},
	{16, "16  تُو اپنی مُٹھّی کھولتا ہے۔ اور ہر جاندار کی خواہش پوری کرتا ہے۔ "},
	{17, "17  خُداوند اپنی سب راہوں میں صادق اور اپنے سب کاموں میں رحیم ہے۔ "},
	{18, "18  خُداوند اُن سب کے قریب ہے جو اُس سے دُعا کرتے ہیں۔ یعنی اُن سب کے جو سچّائی سے دُعا کرتے ہیں۔ "},
	{19, "19  جو اُس سے ڈرتے ہیں وہ اُنکی مرُاد پوری کرے گا۔ اور اُنکی فریاد سُنیگا اور اُنکو بچا لیگا۔ "},
	{20, "20  خُداوند اپنے سب مُحبت رکھنے والوں کی حفاظت کریگا۔ لیکن سب شریروں کو ہلاک کر ڈالیگا۔ "},
	{21, "21  میرے مُنہ سے خُداوند کی ستایش ہو گی۔ اور ہر بشر اُسکے پاک نام کو ابُدالآبادمُبارِک کہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view146() {
struct ur146 poems[] = {
	{1, "1  خُداوند کی حمد کرو! اَے میری جان خُداوند کی حمد کر! "},
	{2, "2  میَں عُمر بھر خُداوند کی حمد کرونگا۔جب تک میرا وجود ہے میَں اپنے خُداوند کی مدح سرائی کرونگا۔ "},
	{3, "3  نہ اُمرا پر بھروسہ کرو نہ آدم ذاد پر۔ وہ بچا نہیں سکتا۔ "},
	{4, "4  اُسکا دم نکل جاتا ہے تو وہ مٹی میں مِل جاتا ہے۔ اُسی دِن اُسکے منصوبے فنا ہو جاتے ہیں ۔ "},
	{5, "5  خُوش نصیب ہے وہ جِسکا مددگار یعقُؔوب کا خُدا ہے۔ اور جِسکی اُمید خُداوند اُسکے خُدا سے ہے۔ "},
	{6, "6  جِس نے آسمان اور زمین اور سُمندر کو اور جو کچھ اُن میں ہے بنایا۔ وہ سچّائی کو ہمیشہ قائم رکھتا ہے۔ "},
	{7, "7  جو مظلوُموں کا انصاف کرتا ہے۔ جو بھوکوں کو کھانا دیتا ہے۔ خُداوند قیدیوں کو آزاد کرتا ہے۔ "},
	{8, "8  خُداوند اندھوں کی آنکھیں کھولتا ہے۔ خُداوند جھُکے کو اُٹھا کھڑا کرتا ہے۔ خُداوند صادقوں سے مُحبت رکھتا ہے۔ "},
	{9, "9  خُداوند پردیسیوں کی حفاظت کرتا ہے۔ وہ یتیم اور بیوہ کو سنبھالتا ہے۔ لیکن شریروں کی راہ ٹیڑھی کر دیتا ہے۔ "},
	{10, "10  خُداوند ابد تک سلطنت کریگا۔ اَے صیِوُؔن! تیرا خُدا پُشت در پُشت ۔خُداوند کی حمد کرو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view147() {
struct ur147 poems[] = {
	{1, "1  خُداوند کی حمد کرو۔ کیونکہ خُدا کی مدح سرائی کرنا بھلا ہے۔ اِسلئے کہ یہ دِل پسند اور ستایش زیبا ہے۔ "},
	{2, "2  خُداوند یروشؔلیم کو تعمیر کرتا ہے۔ وہ اِسراؔئیل کے جلاوطنوں کو جمع کرتا ہے۔ "},
	{3, "3  وہ شکستہ دِلوں کو شفا دیتا ہے۔ اور اُنکے زخم باندھتا ہے۔ "},
	{4, "4  وہ سِتاروں کو شُمار کرتا ہے۔ اور اُن سب کے نام رکھتا ہے۔ "},
	{5, "5  ہمارا خُداوند بزرُگ اور قُدرت میں عظیم ہے۔ اُسکے فہم کی انتہا نہیں۔ "},
	{6, "6  خُداوند حلیموں کو سنبھالتا ہے۔ وہ شریروں کو خاک میں مِلا دیتا ہے ۔ "},
	{7, "7  خُداوند کے حُضُور شُکر گُزاری کا گیت گاؤ۔ ستِار پر ہمارے خُدا کی مدح سرائی کرو۔ "},
	{8, "8  جو آسمان کو بادلوں سے مُلبس کرتا ہے۔ جو زمین کے لئے مینہ تیار کرتا ہے۔ جو پہاڑوں پر گھاس اُگھاتا ہے۔ "},
	{9, "9  جو حیوانات کو خُوراک دیتا ہے۔اور کوّے کے بچوں کو جو کائیں کائیں کرتے ہیں۔ گھوڑے کے زور میں اُسکی خُوشنودی نہیں۔ نہ آدمی کی ٹانگھوں سے اُسے کوئی خوشی ہے۔ "},
	{10, "11  خُداوند اُن سے خوش ہے جو اُس سے ڈرتے ہیں۔ اور اُن سے جو اُسکی شفقت کے اُمیدوار ہیں۔ "},
	{11, "12  اَے یروشؔلیم ! خُداوند کی ستایش کر۔ اَے صیِؔوُن ! اپنے خُدا کی ستایش کر۔ "},
	{12, "13  کیونکہ اُس نے تیرے پھاٹکوں کے بینڈوں کو مضبوط کیا ہے۔ اُس نے تیرے اندر تیری اوُلاد کو برکت دی ہے۔ "},
	{13, "14  وہ تیری حُدوُد میں امن رکھتا ہے۔ وہ تجھے اچھے سے اچھے گیہوُں سے آسودہ کرتا ہے۔ "},
	{14, "15  وہ اپنا حُکم زمین پر بھیجتا ہے۔ اُسکا کلام نہایت تیز رَو ہے۔ "},
	{15, "16  وہ برف کو اُون کی مانند گِراتا ہے۔ اور پالے کا راکھ کی مانند بکھیرتا ہے۔ "},
	{16, "17  وہ یخ کو لُقموں کی مانند پھینکتا ہے۔ اُسکی ٹھنڈ کون سہ سکتا ہے؟ "},
	{17, "18  وہ اپنا کلام نازل کر کے اُنکو پگھلا دیتا ہے۔ وہ ہوا چلاتا ہے اور پانی بہنے لگتا ہے۔ "},
	{18, "19  وہ اپنا کلام یعقُؔوب پر ظاہر کرتا ہے اور اپنے آئین و احکام اِسرائیؔل پر۔ "},
	{19, "20  اُس نے کسی اور قوم سے اَیسا سُلوُک نہیں کیا۔ اور اُسکے احکام کو اُنہوں نے نہیں جانا ۔ خُداوند کی حمد کرو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view148() {
struct ur148 poems[] = {
	{1, "1  خُداوند کی حمد کرو۔ آسمان پر سے خُداوند کی حمد کرو۔ بُلندیوں پر اُسکی حمد کرو۔ "},
	{2, "2  اَے اُسکے فرِشتو! سب اُسکی حمد کرو۔ اَے اُسکے لشکرو! سب اُسکی حمد کرو۔ "},
	{3, "3  اَے سورج ! اَے چاند! اُسکی حمد کرو۔ اَے نُورانی ستِارو! سب اُسکی حمد کرو۔ "},
	{4, "4  اَے افلاک الاافلاک! اُسکی حمد کرو۔ اور تُو بھی اَے فضا پر کے پانی۔ "},
	{5, "5  یہ سب خُداوند کے نام کی حمد کریں۔کیونکہ اُس نے حُکم دیا اور یہ پیدا ہو گئے۔ "},
	{6, "6  اُس نے اِن کو ابدُالآباد کے لئے قائم کیا ہے۔ اُس نے اٹل قانون مقرر کیا ہے۔ "},
	{7, "7  زمین پر سے خُداوند کی حمد کرو۔ اَے اژدھاؤ اور سر گہرے سُمندرو! "},
	{8, "8  اَے آگ اور اولو! اَے برف اور کُہر! اَے طوفانی ہوا! جو اُسکے کلام کی تعمیل کرتی ہے۔ "},
	{9, "9  اَے پہاڑو اور سب ٹیلو! اَے میوہ دار درختو اور سب دیودارو! "},
	{10, "10  اَے جانورو اور سب چَوپایو!اَے رینگنے والو اور پرندو! "},
	{11, "11  اَے زمین کے بادشاہو اور سب اُمتّو! اَے اُمرا اور زمین کے سب حاکمو! "},
	{12, "12  اَے نوجوانو اور کنواریو! اَے بُڈّھواور بچو! "},
	{13, "13  یہ سب خُداوند کے نام کی حمد کریں۔ کیونکہ صرف اُسی کا نام ممتاز ہے۔ اُسکا جلال زمین و آسمان سے بُلند ہے۔ "},
	{14, "14  اور اُس نے اپنے سب مُقدسوں یعنی اپنی مُقرب قوم بنی اِسرائؔیل کے فخر کے لئے اپنی قوم کا سینگ بلند کیا۔ خُداوند کی حمد کرو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view149() {
struct ur149 poems[] = {
	{1, "1  خُداوند کی حمد کرو۔ خُداوند کے حُضُور نیا گیت گاؤ۔ اور مُقدسوں کے مجمع میں اُسکی مدح سرائی کرو۔ "},
	{2, "2  اِسرائؔیل اپنے خالق میں شادمان رہے۔ فرزندانِ صیِوُؔن اپنے بادشاہ کے سبب سے شادمان ہوں۔ "},
	{3, "3  وہ ناچتے ہوئے اُسکے نام کی ستایش کریں۔ وہ دف اور ستاِر پر اُسکی مدح سرائی کریں۔ "},
	{4, "4  کیونکہ خُداوند اپنے لوگوں سے خُوشنود رہتا ہے۔ وہ حلیموں کو نجات سے زینت بخشیگا۔ "},
	{5, "5  مُقدس لوگ جلال پر فخر کریں۔ وہ اپنے بِستروں پر خُوشی سے نغمہ سرائی کریں۔ "},
	{6, "6  اُنکے مُنہ میں خُدا کی تمجید اور ہاتھ میں دو دھاری تلوار ہو۔ "},
	{7, "7  تاکہ قوموں سے انتقام لیں اور اُمتوں کو سزا دیں۔ "},
	{8, "8  اُنے بادشاہوں کا زنجیروں سے جکڑیں اور اُنکے سرداروں کو لوہے کی بَیڑیاں پہنائیں۔ "},
	{9, "9  تاکہ اُنکو وہ سزا دیں جو مرقوم ہے۔ اُسکے سب مُقدسوں کو یہ شرف حاصل ہے۔ خُداوند کی حمد کرو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view150() {
struct ur150 poems[] = {
	{1, "1  خُداوند کی حمد کرو۔ تُم خُداوند کے مقدس میں اُسکی حمد کرو۔ اُسکی قُدرت کے فلک پر اُسکی حمد کرو۔ "},
	{2, "2  اُسکی قُدرت کے کاموں کے سبب سے اُسکی حمد کرو۔ اُسکی بڑی عظمت کے مُطابق اُسکی حمد کرو۔ "},
	{3, "3  نرسنگے کی آواز کے ساتھ اُسکی ھمد کرو۔ بربط اور ستِار پر اُسکی حمد کرو۔ "},
	{4, "4  دف بجاتے اور ناچتے ہوئے اُسکی حمد کرو۔ تاردار سازوں اور بانسلی کے ساتھ اُسکی حمد کرو۔ "},
	{5, "5  بُلند آواز جھانجھ کے ساتھ اُسکی حمد کرو۔ زور سے جھنجھناتی جھانجھ کے ساتھ اُسکی حمد کرو۔ "},
	{6, "6  ہر مُتنفِّس خُداوند کی حمد کرے۔ خُداوند کی حمد کرو۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};