#include <map>
#include <string>
class Bible38
{
	struct ur1	{ int val; const char *msg; };
	struct ur2	{ int val; const char *msg; };
	struct ur3	{ int val; const char *msg; };
	struct ur4	{ int val; const char *msg; };
	struct ur5	{ int val; const char *msg; };
	struct ur6	{ int val; const char *msg; };
	struct ur7	{ int val; const char *msg; };
	struct ur8	{ int val; const char *msg; };
	struct ur9	{ int val; const char *msg; };
	struct ur10	{ int val; const char *msg; };
	struct ur11	{ int val; const char *msg; };
	struct ur12	{ int val; const char *msg; };
	struct ur13	{ int val; const char *msg; };
	struct ur14	{ int val; const char *msg; };
public:
static void view1() {
struct ur1 poems[] = {
	{1, "1  دارا کے دوسرے برس کے آٹھویںمہینے میں خدا وند کا کلام زکریاہ نبی بن برکیاہ بن عرو پر نازل ہُوا۔ "},
	{2, "2  کہ خداوند تمہارے باپ دادا سے سخت ناراض رہا۔ "},
	{3, "3  اس لے تو اُن سے کہہ ربُ الاافوج یوں فرماتا ہے کہ تم میری طرف رجوع ہُو رب الافواج کا فرمان ہے تو میں تمہاری طرف رجوع ہوں گا ربُ الا فواج فرماتا ہے ۔ "},
	{4, "4  تُم اپنے باپ دادا کی مانند نہ بنو جن سے اگلے نبیوں نے بآواز بلند کہا ربُ الافواج یُوں فرماتا ہے کہ تُم اپنی بُری روش اور بداعمالی سے باز آو پر اُنہوں نے نہ سُنا اور مجھے نہ مانا خُداوند فرماتا ہے۔ "},
	{5, "5  تمہارے باپ دادا کہاں ہیں؟ کیا انبیا ہمیشہ زندہ رہتے ہیں؟۔ "},
	{6, "6  لیکن میرا کلام اور میرے آئین جو میں نے اپنے خدمت گزار نبیوں کو فرماے تھے کیا وہ تُمہارے باپ دادا پر پُورے نہیں ہُوے؟ چُنانچہ اُنہوں نے رجوع لا کر کہا کہ رب الافواج نے اپنے ارادہ کے مطابق ہماری عادات اور ہمارے اعمال کا بدلہ دیا ہے۔ "},
	{7, "7  داراکے دُوسرے برس اور گیارھویں مہنیے یعنی ماہ سباط کی چوبیسویں تاریخ کو خدا وندکا کلام زکریاہ نبی بن برکیاہ بن عد وپر نازل ہوا۔ "},
	{8, "8  کہ میں نے رات کو رویا میں دیکھا کہ ایک شخص سُرنگ گھوڑے پر سوار مہندی کے درختوں کے درمیان نشیب میں کھڑا تھا اور اُس کے پیچھےسُرنگ اورکُمیت اور نقرہ گھوڑے تھے۔ "},
	{9, "9  تب میں نے یہ کہا اے میرے آقا یہ کیا ہیں؟ اس پر فرشتے نے جو مُجھ سے گفتگو کرتا تھا کہا میں تجھے دیکھاوں گا کہ یہ کیا ہیں۔ (10 ) اور جو شخص مہندی کے درختوں کے درمیان کھڑا تھا کہنے لگا یہ وہ ہیں جن کو خداوند نے بھیجا ہے کہ ساری دُنیا میں سیر کریں۔ "},
	{10, "11  اور اُنہوں نے خداوند کے فرشتہ سے جو مہندی کے درختوں کے درمیان کھڑا تھا کہا ہم نے ساری دُنیا کی سیر کی ہے اور دیکھا کہ ساری زمین میں امن و امان ہے۔ "},
	{11, "12  پھر خدا وند کے فرشتے نے کہا اے رب الافواج تُو یروشیلم اور یُہوداہ کے شہروں پر جن سے تُو ستر برس سے ناراض ہے کب تک رحم نہ کرے گا؟۔ "},
	{12, "13  اور خداوند نے اُس فرشہ کو جو مُجھ سے گفتگو کرتا تھا مُلائم اور تسلی بخش جواب دیا۔ "},
	{13, "14  تب اُس فرشہ نے جو مجھ سے گفتگو کرتا تھا مجھ سے کہا بُلند آواز سے کہہ رُب الافواج یُوں فرماتا ہے کہ مُجھے یروشیلم اور صیون کے لے بڑی غیرت ہے۔ "},
	{14, "15  اور میں اُن قوموں سے جو آرام میں ہیں نہایت ناراض ہوں کیونکہ جب میں تھوڑا ناراض تھا تُو اُنہوں نے اُس آفت کو بُہت زیادہ کر دیا۔ "},
	{15, "16  اس لے خداوند یوں فرماتا ہے کہ میں رحمت کے ساتھ یروشیلم کو واپس آیا ہوں۔ اُس میں میرا مسکن تعمیر کیا جاے گا ربُ الافواج فرماتا ہے اور یروشیلم پر پھر کھینچا جاے گا۔ "},
	{16, "17  پھر بُلند آواز سے کہہ ربُ الافواج ی؃وں فرماتا ہے کہ میرے شہر دوبارہ خُوشحالی سے معمُور ہوں گے کیونکہ خُداوند پھر ڈیون کو تسلی بخشے گا اور یروشیلم کو قبول فرماے گا۔ "},
	{17, "18  پھر میں نے آنکھ اُٹھا کر نگاہ کی اور کیا دیکھتا ہُوں کہ چار سینگ ہیں۔ "},
	{18, "19  اور میں نے اُس فرشتہ سے جو مجھ سے گفتگو کرتا تھا پوھا کہ یہ کیا ہیں؟ اُس نے مجھے جواب دیا یہ وہ سینگ ہیں جنہوں نے یُہوداہ اور اسرائیل اور یروشیلم کو پراگندہ کیا ہے۔(20 ) پھر خداوند نے مُجھے چار کاریگر دکھاے۔ "},
	{19, "21  تب میں نے کہا یہ کیوں آے ہیں؟ اُس نے جواب دیا یہ وہ سینگ ہیں جنہوں نے یہُوداہ کو ایسا پراگندہ کیا کہ کوئی سر نہ اُٹھا سکا لیکن یہ اس لے آے کہ اُن کو ڈرائیں اور اُن قوموں کے سینگوں کو پست کریں جنہوں نے یہُوداہ کے مُلک کو پراگندہ کرنے کے لے سینگ اُٹھایا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ur2 poems[] = {
	{1, "1  پھر میں نے آنکھ اُٹھا کر نگاہ کی اور کیا دیکھتا ہوں کہ ایک شخص جریب ہاتھ میں لے کھڑا ہے۔ "},
	{2, "2  اور میں نے پوچھا اور تُو کہاں جاتا ہے؟ اُس نے مجھے جواب دیایروشیلم کی پیمائش کو تا کہ دیکھو کہ اُس کی چوڑائی اور لمبائی کتنی ہے۔ "},
	{3, "3  اور دیکھو وہ فرشتہ مجھ سے گفتگو کرتا تھا روانہ ہوا اور دوسرا فرشتہ اُس کے پاس آیا ۔ "},
	{4, "4  اور اُس سے کہا دوڑ اور اس جوان سے کہہ کہ یروشیلم انسان و حیوان کی کثرت کے باعث بے فصیل بستیوں کی مانند آباد ہو گا۔ "},
	{5, "5  کیونکہ خُداوند فرماتا ہے میں اُس کے لے چاروں طرف آتشی دیوار ہُوں گا اور اُس کے اندر اُس کی شوکت۔ "},
	{6, "6  سُنو! خداوند فرماتا ہے شمال کی سرزمین سے جہاں تُم آسمان کی چاروں ہواوں کی مانند پراگندہ کے گے نکل بھاگو خُداوند فرماتا ہے ۔ "},
	{7, "7  اے صیون تُو جو دُختر بابل کے ساتھ بستی ہے نکل بھاگ۔ "},
	{8, "8  کیونکہ ربُ الافواج جس نے مُجھے اپنے جلال کی خاطر اُن قوموں کے پاس بھیجا ہے جنہوں نے تُم کو غارت کیا یُوں فرماتا ہے کہ جو کوئی تُم کو چھوتا ہے۔ "},
	{9, "9  کیونکہ دیکھ میں اُن پر اپنا ہاتھ ہلاوں گا اور وہ اپنے غُلاموں کے لے لُوٹ ہوں گے۔ تب تُم جانو گے کہ رب ُ الافواج نے مُجھے بھیجا ہے۔(10 ) اے دُختر صیون تُو گا اور خوشی کر کیونکہ دیکھ میں آ کر تیرے اندر سکُونت کُروں گا خُداوند فرماتا ہے۔ "},
	{10, "11  اور اُس وقت بہت سی قومیں خُداوند کے ساتھ میل کریں گی اور میری اُمت ہوں گی اور میں تیرے اندر سکُونت کُروں گا۔ تب تُو جانے گی کہ ربُ الافواج نے مُجھے تیرے پاس بھیجا ہے۔ "},
	{11, "12  اور خُدا وند یہُوداہ کو مُلک مُقدس میں اپنی میراث کا بخرہ ٹھہراے گا اور یروشیلم کو قبول فرماے گا۔ "},
	{12, "13  اے نبی آدم خُدا وند کے حضُور خاموش رہو کیونکہ وہ اپنے مُقدس مسکن اُٹھا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ur3 poems[] = {
	{1, "1  اور اُس نے مجھے یہ دکھایا کہ سردار کاہن یشوع خُداوند کے فرشہ کے سامنے کھڑا ہے اور شیطان اُس کے دہنے ہاتھ استادہ ہے تاکہ اُس کا مقابلہ کرے۔ "},
	{2, "2  اور خُداوند نے شیطان سے کہا اے شیطان ! خُداوند تُجھے ملامت کرے۔ ہاں وُہ خُدا وند جس نے یروشیلم کو قبول کیا ہے تُجھے ملامت کرے۔ کیا یہ وُہ لُکٹی نہیں جو آگ سے نکالی گی ہے۔ "},
	{3, "3  اور یشوع میلے کپڑے پہنے فرشتہ کے سامنے کھڑا تھا۔ "},
	{4, "4  پھر اُس نے اُن سے جو اس کے سامنے کھڑے تھے کہا اس کے میلے کپڑے اُتار دواور اُس سے کہا دیکھ میں نے تیری بدکرداری تُجھ سے دُور کی اور میں تُجھے نفیس پوشاک پہناوں گا۔ "},
	{5, "5  اور اُس نے کہا کہ اُس کے سر پر صاف عمامہ رکھو تب اُنہوں نے اُس کے سر پر صاف عمامہ رکھا اور پوشاک پہنائی اور خُدا وند کا فرشتہ اُس کے پاس کھڑا رہا۔ "},
	{6, "6  اور خُداوند کے فرشتہ نے یُشوع سے تاکید کر کے کہا۔ "},
	{7, "7  ربُ الافواج یُوں فرماتا ہے کہ تُو میری راہوں پر چلے اور میرے احکام پر عمل کرے تو میرے گھر پر حکُومت کرے گا اور میرے بارگاہوں کا نگہبان ہوگااور میں تُجھے ان میں جو یہاں کھڑے ہیں آنے جانے کی اجازت دُوں گا۔ "},
	{8, "8  اب اے یشوع سردار کاہن سُن تُو اور تیرے رفیق جو تیرے سامنے بیٹھے ہیں۔ وہ اس بات کا ایماہیں کہ میں اپنے بندہ یعنی شاخ کو لانے والا ہُوں ۔ "},
	{9, "9  کیونکہ اُس پتھر کو جو میں نے یُشوع کے سامنے رکھا ہے دیکھ اُس پر سات آنکھیں ہیں۔ دیکھ میں اس پر کندہ کروں گا ربُ الافواج فرماتا ہے اور میں اس مُلک کی بدکرداری کو ایک ہی دن میں دُور گا۔(10 ) ربُ الافواج فرماتا ہے اُسی روز تُم میں سے ہر ایک اپنے ہمسایہ کو تاک اور انجیر کے نیچے بُلاے گا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ur4 poems[] = {
	{1, "1  اور وہ فرشتہ جو مجھ سے باتیں کرتا تھا پھر آیا اور اُس نے گویا مُجھے نیند سے جگا دیا۔ "},
	{2, "2  اور پوچھا اور تُو کیا دیکھتا ہے ؟ اور میں نے کہا کہ میں ایک سونے کا شمعدان دیکھتا ہُوں جس کے سر پر ایک کٹورا ہے اور اُس کے اُوپر سات چراغ ہیں اور اُن ساتوں چراغوں پر اُن کی سات سات نلیاں ۔ "},
	{3, "3  اور اُس کے پاس زیتُون کے دو درخت ہیں ایک تو کٹورے کی دہنی طرف اور دُوسرا بائیں طرف ۔ "},
	{4, "4  اور میں نے اُس فرشتہ سے جو مُجھ سے کلام کرتا تھا پوچھا اے میرے آقا یہ کیا ہیں؟۔ "},
	{5, "5  تب اُس فرشتہ نے جو مُجھ سے کلام کرتا تھا کہا کیا تُو نہیں جانتا یہ کیا ہیں؟ میں نے کہا نہیں اے میرے آقا ۔ "},
	{6, "6  تب اُس نے مُجھے جواب دیا کہ یہ زرُبابل کے لئے خُدا وند کا کلام ہے کہ نہ تو زور سے اور نہ تُو توانائی سے بلکہ میری رُوح سے ربُ الافواج فرماتا ہے۔ "},
	{7, "7  اے بڑے پہاڑ تُو کیا ہے؟ تُو زربابل کے سامنے میدان ہو جاے گا اور جب وہ چوٹی کا پتھر نکال لاے گا تو لوگ پُکاریں گے کہ اُس پر فضل ہو۔ فضل ہو ۔ "},
	{8, "8  پھر خُدا وند کا کلام مجھ پر نازل ہوا۔ "},
	{9, "9  کہ زربابل کے ہاتھوں نےاُس گھر کی نیو ڈالی اور اُسی کے ہاتھ اسے تمام بھی کریں گے۔تب تُو جانے گا کہ ربُ الافواج نے مُجھے تُمہارے پاس بھیجا ہے۔(10 ) کیونکہ کون ہے جس نے چھوٹی چیزوں کے دن کی تحقیر کی ہے؟ کیونکہ خُداوند کی وہ سات آنکھیں جو ساری زمین کی سیر کرتی ہیں خوشی سے اُس ساہول کو دیکھتی ہیں جو زربابل کے ہاتھ میں ہے۔ "},
	{10, "11  تب میں نے اُس سے پوچھا کہ یہ دونوں زیتون کے درخت جو شمعدان کے دہنے بائیں ہیں کیا ہیں؟ ۔ "},
	{11, "12  اور میں نے دُوبارہ اُس سے پوچھا کہ زیتون کی یہ دو شاخیں کیا ہیں جو سونے کی دو نلیوں کے مُتصل ہیں جن کی راہ سے سُنہلا تیل نکلا چلا جاتا ہے؟۔ "},
	{12, "13  اُس نے مجھے جواب دیا کیا تُو نہیں جانتا یہ کیا ہیں؟ میں نے کہا نہیں اے میرے آقا ۔ "},
	{13, "14  اُس نے کہا یہ وہ مُمسوح ہیں جو ربُ العالمین کے حضور کھڑے رہتے ہیں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ur5 poems[] = {
	{1, "2  اُس نے مُجھ سے پوچھا تُو کیا دیکھتا ہے؟ میں نے جواب دیا ایک اُڑتا ہُوا طُومار دیکھتا ہُوں جس کی لمبائی بیس ہاتھ اور چوڑائی دس ہاتھ ہے۔ "},
	{2, "3  پھر اُس نے مُجھ سے کہا یہ وہ لعنت ہے جو تمام مُلک پر نازل ہونے کو ہے اور اس کے مطابق ہر ایک چور اور جُھوٹی قسم کھانے والا یہاں سے کاٹ ڈالا جاے گا۔ "},
	{3, "4  ربُ الافواج فرماتا ہے میں اُسے بھیجتا ہُوں اور وہ چور کے گھر میں اور اُس کے گھر میں جو میرے نام کی جُھوٹی قسم کھاتا ہے گُھسے گا اور اُس کے گھر میں رہے گا اور اُسے اُس کی لکڑی اور پتھر سمیت برباد کرے گا۔ "},
	{4, "5  اور وہ فرشتہ مُجھ سے کلام کرتا تھا نکلا اور اُس نے مُجھ سے کہا کہ اب تُو آنکھ اُٹھا کر دیکھ کیا نکل رہا ہے۔ "},
	{5, "6  میں نے پوچھا یہ کیا ہے؟ اُس نے جواب دیا یہ ایک ایفہ نکل رہا ہے اور اُس نے کہا کہ تمام ملک میں یہی اُن کی شبہیہ ہے۔ "},
	{6, "7  اور سیسے کا ایک گول سر پوش اُٹھایا گیا اور ایک عورت ایفہ میں بیٹھی نظر آئی۔ "},
	{7, "8  اور اُس نے کہا یہ ایک شرارت ہے اور اُس نے اُس کوایفہ میں نیچے دبا کر سیسے کے اُس سر پوش کو ایفہ کے نُبہ پر رکھ دیا۔ "},
	{8, "9  پھر میں نے آنکھ اُٹھا کر نگاہ کی اور کیا دیکھتا ہوں کہ دو عورتیں نکل آئیں اور ہُوا اُن کے بازووں میں بھری تھی کیونکہ اُن کے لقلق کے سے بازُو تھے اور وہ ایفہ کو آسمان و زمین کے درمیان اُٹھالے گیئں۔(10 ) تب میں نے اُس فرشتہ سے جو مُجھ سے کلام کرتا تھا پُوچھا کہ یہ ایفہ کو کہاں لے جاتی ہیں؟۔ "},
	{9, "11  اُس نےمُجھے جواب دیا سنعار کے مُلک کو تاکہ اس کے لے گھر بنائیں اور جب وہ تیار ہو تو یہ اپنی جگہ میں رکھی جائے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ur6 poems[] = {
	{1, "1  تب میں نے پھر آنکھ اُٹھا کر نگاہ کی تو کیا دیکھتا ہُوں کہ دو پہاڑوں کے درمیان سے چاررتھ نکلے اور وہ پہاڑ پیتل کے تھے ۔ "},
	{2, "2  پہلے رےھ کے گھوڑے سُرنگ ۔ دُوسرے کے مُشکی ۔ "},
	{3, "3  تیسرے کے نُقرہ اور چوتھے کے ابلق تھے۔ "},
	{4, "4  تب میں نے اُس فرشتہ سے جو مُجھ سے کلام کرتا تھا پُوچھا اے میرے آقا یہ کیا ہیں؟۔ "},
	{5, "5  اور فرشتہ نے مُجھے جواب دیا یہ آسمان کی چار ہوائیں ہیں جو رب العالمین کے حضور سے نکلی ہیں۔ "},
	{6, "6  اور مُشکی گھوڑوں والارتھ شمالی مُلک کو نکلا چلا جاتا ہے اورنُقرہ گھوڑوں والا اُس کے پیچھے اور ابلق گھوڑوں والا جُنوبی مُلک کو۔ "},
	{7, "7  اور سُرنگ گھوڑوں والا بھی نکلا اور اُنہوں نے چاہا کہ دنیا کی سیر کریں اور اُس نے اُن سے کہا جاو دُنیا کی سیر کرو اور اُنہوں نے دُنیا کی سیر کی۔ "},
	{8, "8  تُب اُس نے بُلند آوازسے مُجھ سے کہا دیکھ جو شمالی مُلک کو گئے ہیں اُنہوں نے وہاں میرا جی ٹھنڈا کیا ۔ "},
	{9, "9  پھر خُداوند کا کلام مُجھ پر نازل ہوا۔ (10 ) کہ تُو آج ہی خلدی اور طُوبیاہ اور یدعیاہ کے پاس جا جو بابل کے اسیروں کی طرف سے آ کر یُوسیاہ بن صفنیاہ کے گھر میں اُترےہیں۔ "},
	{10, "11  اور اُن سے سونا چاندی لے کر تاج بنا اور یشوع بن یہُوصدق سردار کاہن کو پہنا۔ "},
	{11, "12  اور اُس سے کہہ کہ کہ ربُ الافواج یُوں فرماتا ہے کہ دیکھ وہ شخص جس کا نام شاخ ہے اُس کے زیر سایہ خُوش حالی ہو گئی اور وہ خُداوند کی ہیکل کو تعمیر کرے گا۔ "},
	{12, "13  ہاں وُہی خُداوند کی ہیکل کو بناے گا اور وہ صاحب شُوکت ہو گا اور تخت نشین ہو کر حکومت کرے گا اور اُس کے ساتھ کاہن بھی تخت نشین ہو گا اور دونوں میں صُلح و سلامتی کی مشورت ہو گی۔ "},
	{13, "14  اور یہ تاج حیلم اور طُور بیاہ اور یدعیاہ اور حین بن صفنیاہ کے لے خُداوند کی ہیکل میں یاد گار ہو گا۔ "},
	{14, "15  اور وہ جو دُور ہیں آ کر خُداوند کی ہیکل کو تعمیر کریں گے۔ تب تُم جانو گے کہ رب الافواج نے مُجھے تُمہارے پاس بھیجا ہے اور اگر تُم دل سے خُداوند اپنے خُدا کی فرمانبرداری کرو گے تو یہ باتیں پُوری ہوں گی۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct ur7 poems[] = {
	{1, "1  دارا بادشاہ کی سلطنت کے چوتھے برس کے نویں مہینے یعنی کسلیو مہینے کی چوتھی تاریخ کوخُداوند کا کلام زکریاہ پر نازل ہُوا۔ "},
	{2, "2  اور بیت ایل کے باشندوں نے شراضراور رجم ملک اور اُس کے لوگوں کو بھیجا کہ خُداوند سے درخواست کریں ۔ "},
	{3, "3  اور ربُ الافواج کے گھر کے کاہنوں اور نبیوں سے پُوچھیں کہ کیا میں پانچویں مہنیے میں گوشہ نشین ہو کر ماتم کُروں جیسا کہ میں نے سالہا سال سے کیا ہے؟۔ "},
	{4, "4  تب ربُ الافواج کا کلام مُجھ پر نازل ہُوا ۔ "},
	{5, "5  کہ مملکت کے سب لوگوں اور کاہنوں سے کہہ کہ جب تُم نے پانچویں اور ساتویں مہینے میں ان ستر برس تک روزہ رکھا اور ماتم کیا تو کیا کیا کبھی میرے لے خاص میرے ہی لے روزہ رکھا تھا؟۔ "},
	{6, "6  اور جب تُم کھاتے پیتے تھے تو اپنے ہی لے نہ کھاتے پیتے تھے؟۔ "},
	{7, "7  کیا یہ وہی کلام نہیں جو خُداوند نے گذشتہ نبیوں کی معرفت فرمایا جب یروشیلم آباد اور آسودہ حال تھا اور اُس کی نواحی کے شہر اور جنُوب کی سر زمین اور میدان آباد تھے؟۔ "},
	{8, "8  پھر خُداوند کا کلام زکریاہ پر نازل ہوا ۔ "},
	{9, "9  کہ ربُالافواج نے یُوں فرماں تھا کہ راستی سے عدالت کرو اور ہر شخص اپنے بھائی پر کرم اور رحم کیا کرے۔(10 ) اور بیوہ اعر یتیم اور مُسافر اور مسکین پر ظلم نہ کرو اور تُم میں سے کوئی اپنے بھائی کے خلاف دل میں بُرا منصوبہ نہ باندھے۔ "},
	{10, "11  لیکن وہ شنوانہ ہُوے بلکہ اُنہوں نے گردن کشی کی اور اپنے کانوں کو بند کیا تاکہ نہ سُنیں ۔ "},
	{11, "12  اور اُنہوں نے اپنے دلوں کو الماس کی مانند سخت کیا تاکہ شریعت اور اُس کلام کو سُنیں جو ربُ الافواج نے گزشتہ نبیوں پر اپنی رُوح کی معرفت نازل فرمایا تھا اس لے ربُ الافواج کی طرف سے قہر شدید نازل ہُوا۔ "},
	{12, "13  اور ربُالافواج نے فرمایا تھا جس طرح میں نے پُکار کر کہا اور وہ شنوا نہ ہُوے اُسی طرح وہ پُکاریں گے اور میں نہیں سُنوں گا۔ "},
	{13, "14  بلکہ اُن کو سب قوموں میں جن سے وہ ناواقف ہیں پراگندہ کروں گا۔ یُوں اُن کے بعد مُلک ویراب ہُوا یہاں تک کسی نے اُس میں آمدورفت نہ کی کیونکہ اُنہوں نے اُس دلکشا مُلک کو ویران کر دیا ۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct ur8 poems[] = {
	{1, "1  پھر ربپالافواج کا کلام مُجھ پر نازل ہُوا ۔ "},
	{2, "2  کہ ربُ الافواج یُوں فرماتا ہے کہ مُجھے صیون کے لے بڑی غیرت ہے بلکہ میں غیرت سے سخت غضبناک ہُوا۔ "},
	{3, "3  خُداوند یوں فرماتا ہے کہ میں صیوں میں واپس آیا ہُوا اور یروشیلم میں سکُونت کُروں گا اور یروشیلم کا نا شہر صدق ہو گااور ربُ الافواج کا پہاڑ کوہ مُقدس کہلاے گا۔ "},
	{4, "4  ربُ الافواج یوں فرماتا ہے کہ یروشیلم کے کوچوں میں عُمر رسید مرد وزن بُڑھاپے کے سبب سے ہاتھ میں عصا لے ہُوے پھر بیٹھے ہوں گے۔ "},
	{5, "5  اور شہر کے کُوچے کھیلنے والے لڑکے لڑکیوں سے معمور ہُوں گے۔ "},
	{6, "6  اور ربُ الافواج یُوں فرماتا ہے کہ اگرچہ اُن ایام میں یہ امر ان لوگوں کے بقیہ کی نظر میں حیرت افزا ہو تُو بھی کیا میری نظر میں حیرت افزا ہو گا ؟ رب ُالافواج فرماتا ہے ۔ "},
	{7, "7  ربُ الافواج یُوں فرماتا ہے دیکھ میں اپنے لوگوں کو مشرقی اور مغربی مُمالک سے چُھڑالُوں گا؟ ۔ "},
	{8, "8  اور میں اُن کو واپس لاوں گا اور وہ یروشیلم میں سکُونت کریں گے اور وہ میرے لوگ ہوں گے اور میں راستی و صداقت سے اُن کا خُدا ہوں گا۔ "},
	{9, "9  ربُ الافواج یُوں فرماتا ہے کہ اے لوگو اپنے ہاتھوں کو مُضبوط کُرو ۔ تُم جو اُس وقت یہ کلام سُنتے ہو جو ربُ ا لافواج کے گھر یعنی ہیکل کی تعمیر کے لے بُنیاد ڈالتے وقت نبیوں کی معرفت نازل ہُوا۔(10 ) کیونکہ اُن دنوں سے پہلے نہ انسا ن کے لے مُزدوری تھی اور نہ حیوان کا کرایہ تھا اور دُشمن کے سبب سے آنے جانے والے محفوظ نہ تھے کیونکہ میں نے سب لوگوں میں نفاق ڈال د یا ۔ "},
	{10, "11  لیکن اب میں ان کوگوں کے بقیہ کے ساتھ پہلے کی طرح پیش نہ آوں گا ربُ الافواج فرماتا ہے ۔ "},
	{11, "12  بلکہ زراعت آسانی سے ہو گی۔ تاکہ اپنا پھل دے گی اور زیمن اپنا حاصل اور آسما ن سے اوس پڑے گی اور میں ان لوگوں کے بقیہ کو ان سب برکتوں کا وارث بناوں گا۔ "},
	{12, "13  اے بنی یہوداہ اور اے بنی اسرائیل جس طرح تُم دُوسری قوموں میں لعنت تھے اُسی طرح میں تُم کو چھڑاوں گا اور تُم برکت ہوں گے۔ ہراساں نہ ہو بلکہ تُمہارے ہاتھ مضبوط ہوں ۔ "},
	{13, "14  کیونکہ ربُ الافواج یُوں فرماتا ہے کہ جس طرح میں قصد کیا تھا کہ تُم پر آفت لاوں جب تمہارے باپ دادا نے مُجھے غضبناک کیا اور میں اپنے ارادہ سے باز نہ رہا ربُ الافواج فرماتا ہے ۔ "},
	{14, "15  اُسی طرح میں نے اب ارادہ کیا ہے کہ یروشیلم اور یہُوداہ کے گھرانے سے نیکی کُروں۔ پس تُم ہراساں نہ ہو۔ "},
	{15, "16  پر لازم ہے کہ تُم ان باتوں پر عمل کرو۔ تم سب اپنے پڑوسیوں سے سچ بولو اور اپنے پھاٹکوں میں راستی سے عدالت کروتا کہ سلامتی ہو۔ "},
	{16, "17  اور تُم میں سے کوئی اپنے بھائی کے خلاف دل میں بُرا مُنصوبہ نہ باندھے اور جُھوٹی قسم کو عزیز نہ رکھے کیونکہ میں ان سب باتوں سے نفرت رکھتا ہُوں خُداوند فرماتا ہے۔ "},
	{17, "18  پھر ربُ الافواج کا کلام مُجھ پر نازل ہُوا ۔ "},
	{18, "19  کہ ربُ الافواج یُوں فرماتا ہے کہ چوتھے اور پانچویں اور ساتویں اور دسویں مہنیے کا روزہ بنی یہوداہ کے لے خُوشی اور خُرمی کا دن اور شادمانی کی عید ہوگا۔ اس لے تُم سچائی اور سلامتی کو عزیز رکھو۔(20 ) ربُ الافواج یُوں فرماتا ہے کہ پھر قومیں اور بڑے بڑے شہروں کے باشندے آئیں گے۔ "},
	{19, "21  اور ایک شہر کے باشندے دُوسرے شہر میں جا کر کہیں گے چلو ہم جلد خُداوند سے درخواست کریں اور رُب الافواج کے طالب ہوں ۔ میں بھی چلتا ہوں۔ "},
	{20, "22  بُہت سے اُمتیں اور زبردست قُومیں ربُ الافواج کی طالب ہوں گی اور خُداوند سے درخواست کرنے کو یروشیلم میں آئیں گی۔ "},
	{21, "23  ربُ الافواج یُوں فرماتا ہے کہ اُن ایام میں مُختلف اہل لُغت میں سے دس آدمی ہاتھ بڑھا کر ایک یُہودی کا دامن پکڑیں گے ار کہیں گے کہ ہم تُمہارے ساتھ جائیں گے کیونکہ ہم نے سُا ہے کہ خُدا تُمہارے ساتھ ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct ur9 poems[] = {
	{1, "1  بنی آدم اورخُصوصا کُل قبائل اسرائیل کی آنکھیں خُداوند پر لگی ہیں۔ خُداوند کی طرف سے سرزمین حدراک اور دمش کے خلاف بارنبوت ۔ "},
	{2, "2  اور جماعت کے خلاف جو اُن سے مُتصل ہے اور صُوروصیدا لے خلاف جو اپنی بظر میں بُہت دانش مند ہیں۔ "},
	{3, "3  صُور نے اپنے لے مُضبوط قلعہ بنایا اور مٹی کی طرح چاندی کے تُودے لگاے اور گلیوں کی کیچ کی طرح سونے کے ڈھیر ۔ "},
	{4, "4  دیکھو خُداوند اُسے خارج کر دے گا اور اُس کے فخر کو سُمندر میں ڈال دے گا اور آگ اُس کو کھا جاے گی۔ "},
	{5, "5  اقلون دیکھ کر ڈر جاے گا۔ غزہ بھی سخت درد میں مُبتلا ہوگا۔ عقرون بھی کیونکہ اُس کی آس ٹوٹ گئی اور غزہ سے بادشاہی جاتی رہے گی اور اسقلون بے چراغ ہوجاے گا۔ "},
	{6, "6  اور ایک اجنبی زادہ اشدود میں تخت نشین ہوگا اور میں فلتیوں کا فخر مٹاوں گا۔ "},
	{7, "7  اور میں اُس کے خون کو اُس کے مُنہ سے اور اُس کی مکروہات اُس کے دانتوں سے نکال ڈالوں گا اور وہ بھی ہمارے خُدا کے لے بویہ ہوگا اور وہ یُہوداہ میں سردار ہوگا اور عقرونی یُبوسیوں کی مانند ہوں گے۔ "},
	{8, "8  اور میں مُخالف فوج کے مُوابل اپنے گھر کی چاروں طرف خیمہ زن ہوں گا تاکہ کوئی اُس میں سے آمدورفت نہ کر سکے۔ پھر کوئی ظالم اُن کے درمیان سے نہ گُزرے گا کیونکہ اب میں نے اپنی آنکھوں سے دیکھ لیا ہے۔ "},
	{9, "9  اے بنت صیون تُو نہایت شاد مان ہو۔اے دُختر یروشیلم خُوب للکار کیونکہ دیکھ تیرا بادشاہ تیرے پاس آتا ہے۔ وہ صادق ہے اور نجات اُس کے ہاتھ میں ہے وہ حلیم ہے اور گدھے پر بلکہ جو ان گدھے پر سوار ہے۔ (10 ) اور میں افرئیم سے رتھ اور یروشیلم سے گھوڑے کاٹ ڈالوں گا اور جنگی کمان توڑ ڈالی جاے گی اور وہ قوموں کو صُلح کا مُثردہ دے گا اور اُس کی سلطنت سُمندر سے سُمندر تک اور دریای فرات سے انتہای زمین تک ہو گی۔ "},
	{10, "11  اور تیری بابت یُوں ہے کہ تیرے عہد کے خُون کے سبب سے میں تیرے اسیروں کو اندھے کُنوئیں سے نکال لایا۔ "},
	{11, "12  میں آج بتاتا ہُوں کہ تُجھ کو دو چند اجروں گا اے اُمیدوار اسیرو قلعہ میں واپس آؤ۔ "},
	{12, "13  کیونکہ میں نے یہُوداہ کو کمان کی طرح جُھکایا اور افرائیم کو تیر کی طرح لگایا اور اے صیون میں تیرے فرزندوں کو یُونان کے فرزندوں کے خلاف برا نگخیتہ کروں گا اور تُجھے پہلوان کی تلوار کی مانند بناوں گا۔ "},
	{13, "14  اور خہداوند کے اوُپر دکھائی دے گا اور اُس کے تیر بجلی کی طرح نکیں گے ہاں خُداوند نر سنگا پُھونکے گا اور جُنوبی بگولوں کے ساتھ خُروج کرے گا۔ "},
	{14, "15  اور ربُ الافواج اُن کی حمایت کرے گا اور وہ دُشمنوں کو نگیں گے اور فلاخن کے پتھروں کو پایمال کریں گے اور پی کر متوالوں کی مانند شور مچائیں گے اور کٹوروں اور مذبح کے کونوں کی مانند معمور ہوں گے۔ "},
	{15, "16  اور خُداوند اُن کا خُدا اس روز اُن کو اپنی بھیڑوں کی طرح بچالے گا کیونکہ وہ تاج کے جواہر کی مانند ہوں گے جو اُس کے مُلک میں سرفراز ہوں گے۔ "},
	{16, "17  کیونکہ اُن کی خوش حالی عظیم اور اُن کا جمال خُوب ہے!نوجوان غلہ سے بڑھیں گے اور لڑکیاں نئی مےنشوونما پائیں گی۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct ur10 poems[] = {
	{1, "1  پچھلی برسات کی بارش کے لے خُداوند سے دُعا کرو۔ خُداوند سے جو بجلی چمکاتا ہے۔ وہ بارش بیھجے گا اور میدان میں سب کے لے گھاس اُگاے گا۔ "},
	{2, "2  کیونکہ ترافیم نے بطالت کی باتیں کہی ہیں اور غیب بینوں نے بطالت دیکھی اور جُھوٹے خواب بیان کے ہیں ۔ اُن کی تسلی بے حقیقت ہے اس لے وہ بھیڑوں کی مانند بھٹک گے۔ اُنہوں نے دُکھ پایا کیونکہ اُن کا کوئی چرواہانہ تھا۔ "},
	{3, "3  میرا غضب چرواہوں پر بھڑکاہے اور میں پیشواوں کو سزا دُوں گا تُو بھی ربُ الافواج نے اپنے گلہ یعنی بنی یہُوداہ پر نظر کی ہے اور اُن کو گویا اپنا خُوب صُورت جنگی گھوڑا بناے گا ۔ "},
	{4, "4  اُن ہی میں سے کونے کا پتھر اور کُھونٹی اور جنگی کمان اور سب حاکم نکلیں گے۔ "},
	{5, "5  اور پہلوانوں کی طرح لڑائی میں دُشمنوں کو گلیوں کی کیچ کی مانند لتاڑیں گے اور وہ لڑیں گے کیونکہ خُداوند اُن کے ساتھ ہے اور سوا رسراسیمہ ہو جائیں گے۔ "},
	{6, "6  اور میں یہُوداہ کے گھرانے کی تقویت کُروں گا اور یُوسف کے گھرانے کو ریائی بخشوں گا اور اُن کو واپس لا ؤں گا کیونکہ میں اُن پر رحم کرتا ہُوں اور وہ ایسے ہوں گے گویا میں نے اُن کو کبھی ترک نہیں کیا تھا کیونکہ میں خُداوند اُن کا خُدا ہوں اور اُن کی سُنوں گا۔ "},
	{7, "7  اور بنی افرائیم پہلوانوں کی مانند ہوں گے اور اُن کے دل گویا مے سے مُسرور ہوں گے بلکہ اُن کی اُولادبھی دیکھے گی اور شاد مانی کرے گی ۔ اُن کے دل خُدا وند سے خُوش ہوں گے۔ "},
	{8, "8  میں سیٹی بجا کر اُن کو فراہم کروں گا کیونکہ میں نے اُن کا فدیہ دیا ہے اور وہ بُہت ہو جائین گے جیسے پہلے تھے۔ "},
	{9, "9  اگرچہ میں نے اُن قوموں میں پراگندہ کیا تو بھی وہ اُن دُور کےمُلکوں میں مُجھے یاد کریں گےاور اپنے بال بچوں سمیت زندہ رہیں گے اور واپس آئیں گے۔(10 میں اُن کومُلک مصر سے واپس لاوں گا اور اسُور سے جمع کُروں گا اور جلعاد اور لُبنان کی سرزمین میں پُہنچاوُں گا۔ یہاں تک کہ اُن کے لے گُنجایش نہ ہوگی۔ "},
	{10, "11  اور وہ مُصیبت کے سُمندر سے گزر جائےگا اور اُس کی لہروں کو مارے گا اور دریای نیل تہ تک سُوکھ جائے گا اور اسور کا تکبر ٹوٹ جاےئےگا اور مصر کا عصا جاتا رہے گا۔ "},
	{11, "12  اور میں اُن کو خُداوند میں تقویت بخشُوں گا اور وہ اُس کا نام لے کر ادھر اُدھر چلیں گے خُداوند فرماتا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct ur11 poems[] = {
	{1, "1  اے لبنان تُو اپنے دروازوں کو کھول دے تاکہ آگ تیرے دیوداروں کو کھا جائے ۔ "},
	{2, "2  اے سروکے درخت نوحہ کر کیونکہ دیودار گر گیا اور شاندار عازت ہوگے۔ اےبسنی بلُوط کے درختو!فغان کرو کیونکہ دُشوار گزار جنگل صاف ہو گیا۔ "},
	{3, "3  چرواہوں کے نوحہ کی آواز آتی ہے کیونکہ اُن کی حشمت غارت ہوئی۔ جوان ببروں کی گرج سُنائی دیتی ہے کیونکہ یردن کا جنگل برباد ہو گیا۔ "},
	{4, "4  خُداوند میرا خُدا یُوں فرماتا ہے کہ جو بھیڑیں ذبح ہو رہی ہیں اُن کو چرا۔ "},
	{5, "5  جن کے مالک اُن کو ذبح کرتے ہیں اور جن کے بیچنے والے کہتے ہیں خُداوند کا شُکر ہو کہ ہم مالدار ہُوے اور اُن کے چرواہے اُن پر رحم نہیں کرتے۔ "},
	{6, "6  کیونکہ خُداوند فرماتا ہے میں مُلک کے باشندوں پر پھر رحم نہیں کُروں گا بلکہ ہر شخص کو اُس کے ہمسایہ اور اُس کے بادشاہ کے حوالہ کروں گا اور وہ ملک کو تباہ کریں گے اور میں اُن کو اُن کے ہاتھ سے نہیں چھڑاوں گا ۔ "},
	{7, "7  پس میں نے ان بھیڑوں کو جو ذبح ہو رہی تھیں یعنی گلہ کے مسکینوں کو چریا اور میں نے دو لاٹھیاں لیں ایک کا نام فضل رکھا اور دُوسری کا اتحاد اور گلہ چرایا۔ "},
	{8, "8  اور میں نے ایک مہنیے میں تین چرواہوں کو ہلاک کیا کیونکہ میری جان ان سے بیزار تھی اور اُن کے دل میں مُجھ سے کراہیت تھی۔ "},
	{9, "9  تب میں نے کہا اب میں تُم کو نہ چراوں گا۔ مرنے والا مر جائے اور ہلاک ہونے والا ہلاک ہواور باقی ایک دُوسرے کا گوشت کھائیں۔ (10 ) تب میں نے فضل نامی لاٹھی کو لیا اور اُسے کاٹ ڈالا کہ اپنے عہد کو جو میں نے سب لوگوں سے باندھا تھا منسوخ کُروں۔ "},
	{10, "11  اور وہ اُسی دن مُنسوخ ہو گیا۔ تب گلہ کے مسکینوں نے جو میری سُنتے تھے معلوم کیا کہ یہ خُداوند کا کلام ہے۔ "},
	{11, "12  اور میں نے اُن سے کہا کہ اگر تمہاری نظر میں ٹھیک ہو تو میرے مُزدُوری مُجھے دو نہیں تو مت دو اور اُنہوں نے میری مُزدوری کے لے تیس رُوپے تول کر دے۔ "},
	{12, "13  اور خُداوند نے مُجھے حکم دیا کہ اُسے کُمہار کے سامنے پھنک دے یعنی اس بڑی قمیت کو جو اُنہوں نے نے میرے لے ٹھہرا ئی اور میں نے یہ تیس رُوپے لے کر خُداوند کے گھر میں کُمہار کے سامنے پھینک دے۔ "},
	{13, "14  تب میں نے دوسری لاٹھی یعنی اتحاد کو کاٹ ڈالا تاکہ اُس برادری کو جو یہُوداہ اور اسرائیل میں ہے موقوف کرُوں۔ "},
	{14, "15  اور خُدا وند نے مُجھے فرمایا کہ تُو پھر نادان چرواہے کا سامان لے۔ "},
	{15, "16  کیونکہ دیکھ میں مُلک میں ایسا چوہان برپا کُروں گا جو ہلاک ہونے والے کی خبر گیری اور بھٹکے ہوے کی تلاش اور زخمی کا علاج نہ کرے گا اور تندرست کو نہ چرائے گا پر موٹوں کا گوشت کھاے گا اور اُن کے کھروں کو توڑ ڈالے گا۔ "},
	{16, "17  اُس نابکار چرواہے پر افسوس جو گلہ کو چھوڑ جاتا ہے ! تکوار اُس کے بازو اور اور اُس کی دہنی آنکھ پر آپڑے گی۔ اُس کا بازو بالکل سُوکھ جاے گا اور اُس کی دہنی آنکھ پھوٹ جاے گی۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct ur12 poems[] = {
	{1, "1  اسرائیل کی بابت خُداوند کی طرف سے بارنُبوت خُداوند جو آسمان کو تانتا اور زمین کی بُنیاد ڈالتا اور انسان کے اندر اُس کی رُوح پیدا کرتا ہے اور یُوں فرماتا ہے۔ "},
	{2, "2  دیکھو میں یروشیلم کو اردگرد کے سب لوگوں کے لے لڑ کھڑااہٹ کا پیالہ بناوں گا اور یروشیلم کے مُحاصرہ کے وقت یہُوداہ کا بھی یہی حال ہوگا۔ "},
	{3, "3  اور میں اُس روز یروشیلم کو سب قوموں کے لے ایک بھاری پتھر بنا دوں گا اور اُسے اُٹھائیں گے سب گھایل ہوں گے اور دُنیا کی سب قومیں اُس کے مُقابل جمع ہوں گی۔ "},
	{4, "4  خُداوند فرماتا ہے میں اُس روز ہر گھوڑے کو حیرت زدہ اور اُس کے سوار کو دیوانہ کر دوں گا لیکن یہُوداہ کے گھرانے پر نگاہ رکھوں گا اور قوموں کے سب گھوڑوں کو اندھا کردوں گا۔ "},
	{5, "5  تب یہُوداہ کے فرما نروادل میں کہیں گے کہ یروشیلم کے باشندے اپنے خُدا ربُ الافواج کے سبب سے ہماری توانائی ہیں۔ "},
	{6, "6  میں اُس روز یہُوداہ کے فرما نرواوں کو لکڑیوں میں جلتی انگیٹھی اور پُولوں میں مشعل کی مانند بناوں گا اور وہ دہنے بائیں اور اردگرد کی سب قوموں کو کھا جائیں گے اور اہل یروشیلم پھر اپنے مقام پر یروشیلم ہی میں آباد ہوں گے۔ "},
	{7, "7  اور خُداوند یہُوداہ کے خیموں کو پہلے رہائی بخشے گا تاکہ داود کا گھرانا اور یروشیلم کے باشندے یہُوداہ کے خلاف فخر نہ کریں۔ "},
	{8, "8  اُس روز خُداوند یروشیلم کے باشندوں کی حمایت کرے گا اور اُن میں کاسب سے کمزور اُس روز داود کی مانند ہوگا اور داود کا گھرانا خُداکی مانند یعنی خُداوند کے فرشتہ کی مانند جو اُن کے آگے چلتا ہو۔ "},
	{9, "9  اور میں اُس روز یروشیلم کی سب مُخالف قوموں کی ہلاکت کا قصد کُروں گا۔(10 ) اور میں داود کے گھرانے اور یروشیلم کے باشندوں پر فضل اور مُناجات کی رُوح نازل کُروں گا اور وہ اُس پر جس کو اُنہوں نے چھیدا ہے نظر کریں گے اور اُس کے لے ماتم کریں گے جیسا کوئی اپنے اکلوتے کے لے کرتا ہے اور اُس کے لے تلخ کام ہوں گے جیسے کوئی اپنے پہلوٹھے کے کے ہوتا ہے۔ "},
	{10, "11  اور اُس روز یروشیلم میں بڑا ماتم ہوگا۔یدرمون کے ماتم کی مانند جو مجدون کی وادی میں ہوا۔ "},
	{11, "12  اور تمام مُلک ماتم کرے گا۔ ہرایک گھرانا الگ۔ داود کا گھرانا الگ اور اُن کی بیویاں الگ۔ ناتن کا گھرانا الگ اور اُن کی بیویاں الگ۔ "},
	{12, "13  لاوی کا گھرانا الگ اور اُن کی بیویاں الگ۔ سمعی کا گھرانا الگ اور اُن کی بیویاں الگ۔ "},
	{13, "14  باقی سب گھرانے الگ الگ اور اُن کی بیویاں الگ الگ۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct ur13 poems[] = {
	{1, "1  اُس روز گُنا اور ناپاکی دھونے کو داود کے گھرانے اور یروشیلم کے باشندوں کے لے ایک سوتا پھوٹ نکلے گا۔ "},
	{2, "2  اور ربُ الافواج فرماتا ہے میں اُسی روز مُلک سے بتوں کا نام مٹادوں گا اور اُن کو پھر کوئی یاد نہ کرے گا اور میں نبیوں کو اور ناپاک رُوح کو مُلک سے خارج کردوں گا۔ "},
	{3, "3  اور جب کوئی نبُوت کرے گا تُو اُس کے ماں باپ جن سے وہ پیدا ہوا اُس سے کہیں گے تُو زندہ نہ رہے گا کیونکہ تُو خُداوند کا نام لے کر جھوٹ بولتا ہے اور جب وہ نبوت کرے گا تو اُس کے ماں باپ جن سے وہ پیدا ہوا اُسے چھید ڈالیں گے۔ "},
	{4, "4  اور اُس روز نبیوں میں سے ہر ایک نبوت کرتے وقت اپنی رویا سے شرمندہ ہوگا اور کبھی فریب دینے کو پشیمن چادر نہ اوڑھیں گے۔ "},
	{5, "5  بلکہ ہر ایک کہے گا کہ میں نبی نہیں کسان ہوں کیونکہ میں لڑکپن ہی سے غُلام رہا ہوں۔ "},
	{6, "6  اور جب کوئی اُس سے پوچھے گا کہ تیرے چھاتی پر یہ زخم کیسے ہیں ؟ تو وہ جواب دے گا یہ وہ زخم ہیں جو میرے دوستوں کے گھر میں لگے۔ "},
	{7, "7  ربُ الافواج فرماتا ہے اے تکوار تُو میرے چرواہے یعنی اُس انسان پر جو میرا رفیق ہے بیدار ہو۔ چرواہے کو مار کہ گلہ پراگندہ ہو جاے اور میں چھوٹوں پر ہاتھ چلاوں گا۔ "},
	{8, "8  اور خُداوند فرماتا ہے سارے مُلک میں دو تہائی قتل کئے جائیں گے اور مریں گے لیکن ایک تہائی بچ رہیں گے۔ "},
	{9, "9  میں اس تہائی کو آگ میں ڈال کر چاندی کی طرح صاف کُروں گا اور سونے کی طرح تاوُں گا۔ وہ مُجھ سے دُعا کریں گے اور میں اُن کی سُنوں گا ۔ میں کُہوں گا یہ میرے لوگ ہیں اور وہ کہیں گے خُداوند ہی ہمارا خُداہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct ur14 poems[] = {
	{1, "1  دیکھ خُداوند کا دن آتا ہے جب تیرا مال لوٹ کر تیرے اندر بانٹا جاے گا۔ "},
	{2, "2  کیونکہ میں سب قوموں کو فراہم کرو گا کہ یروشیلم سے جنگ کریں اور شہر لے لیا جاے گا اور گھر لُوٹے جائیں گے اور عورتیں بے حُرمت کی جائیں گی اور آدھا شہر اسیری میں جاے گا لیکن باقی لوگ شہر میں ہی رہیں گے۔ "},
	{3, "3  تب خُداوند خروج کرے گا اور اُن وقموں سے لڑے گا جیسے جنگ دن کے لڑاکرتا تھا۔ "},
	{4, "4  اور اُس روز وہ کوہ زیتوں پر یروشیلم کے مشرق میں واقع ہے کھڑا ہو گا اور کوہ زیتون بیچ سے پھٹ جاے گا اور اُس کے مشرق سے مغرب تک ایک بڑی وادی ہو جاے گی کیونکہ آدھا پہاڑ شمال کو سر کر جاے گا اور آدھا جنوب کو ۔ "},
	{5, "5  اور تُم میرے پہاڑوں کی وادی سے ہو کر بھاگو گے کیونکہ پہاڑوں کی وادی آضل تک ہو گی۔ جس طرح تم شاہ یہُوداہ عُزیاہ کے ایام میں زلزلہ سے بھاگے تھے اُسی طرح بھاگو گے کیونکہ خُداوند میرا خُدا آے گا اور سب قُدسی تیرے ساتھ ۔ "},
	{6, "6  اور اُس روز روشنی نہ ہو گی اور اجرام فلک چُھپ جائیں گے۔ "},
	{7, "7  پر ایک دن ایسا آے گا جو خُداوند کو ہی معلوم ہے ۔ وہ نہ دن ہو گا اور نہ رات لیکن شام کے وقت روشنی ہو گی۔ "},
	{8, "8  اور اُس روز یروشیلم سے آب حیات جاری ہوگا جس کا آدھا بحر مشرق کی طرف بہے گا اور آدھا بحر مغرب کی طرف۔ گرمی سردی میں جاری رہے گا۔ "},
	{9, "9  اور خُداوند ساری دُنیا کا بادشاہ ہو گا۔ اُس روز ایک ہی خُداوند ہو گا اور اُس کا نام واحد ہو گا۔(10 ) اور یروشیلم کے جُنوب میں تمام مُلک جبع سے رمون تک میدان کی مانند ہو جاے گا پر یروشیلم بُلند ہو گا اور بنیمین کے پھاٹک سے پہلے پھاٹک کے مقام یعنی کونے کے پھاٹک تک اور حنب ایل کے بُرج سے بادشاہ کے انگوری حوضوں تک اپنے مقام پر آباد ہو گا۔ "},
	{10, "11  اور لوگ اس میں سکونت کریں گے اور پھر لعنت مُطلق نہ ہو گی بلکہ یروشیلم امن و امان سے آباد رہے گا۔ "},
	{11, "12  اور خُداوند یروشیلم سے جنگ کرنے والی سب قوموں پر یہ عزاب نازل کرے گا کہ کھڑے کھڑے اُن کا گوشت سوکھ جاے گا اور اُن کی آنکھیں چشم جانوں میں گل جائیں گی اور اُن کی زُبان اُن کے مُنہ میں سڑ جاے گی۔ "},
	{12, "13  اور اُس روز خُداوند کی طرف سے اُن کے درمیان بڑی ہل چل ہوگی اور ایک دُوسرے کا ہاتھ پکڑیں گے اور ایک دُوسرے کے خلاف ہاتھ اُٹھاے گا۔ "},
	{13, "14  اور یہُوداہ بھی یروشیلم کے پاس لڑے گا اور اردگرد کی سب قوموں کا مال یعنی سونا چاندی اور لباس بڑی کثرت سے فراہم کیا جاے گا۔ "},
	{14, "15  اور گھوڑوں خچروں اُونٹوں گدھوں اور سب حیوانوں پر بھی جو اُن لشکر گاہوں میں ہوں گے وہی عزاب نازل ہوگا۔ "},
	{15, "16  اور یروشیلم سے لڑنے والی قوموں میں سے جو بچ رہیں گی سال بسال بادشاہ ربُ لافواج کو سجدہ کرنے اور عید خیام منانے کو آئیں گے۔ "},
	{16, "17  اور دُنیا کے اُن تمام قبائل پر جو بادشاہ ربُ الافواج کے حُضور سجدہ کرنے کو یروشیلم میں نہ آئیں گے منیہ نہ برسے گا۔ "},
	{17, "18  اور اگر قبائل مصر جن پر بارش نہیں ہوتی نہ آئیں تو اُن پر وُہی عزاب نازل ہو گا جس کوخُداوند اُن غیر قوموں پر نازل کرے گا جو عید خیام منانے کو نہ آئیں گی۔ "},
	{18, "19  اہل مصر اور اُن سب قوموں کی جو عید خیام منانے کو نہ جائیں یہی سزا ہو گی۔(20 ) اُس روز گھوڑوں کو گھنٹیوں پر مرقوم ہوگا خُداوند کے لے مُقدس اور خُداوند کے گھر کی دیگیں مزبح کے پیالوں کی مانند مُقدس ہوں گی۔ "},
	{19, "21  بلکہ یروشیلم اور یہُوداہ میں کی سب دیگیں ربُ الافواج کے لے مُقدس ہوں گی اور سب ذبیحے گزراننے والے آئیں گے اور اُن کو لے کر اُن میں پکائیں گے اور اُس روز پھر کوئی کنعانی ربُ ا لافواج کے گھر نہ ہو گا۔ + "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};