#include <map>
#include <string>
class Bible36
{
	struct ur1	{ int val; const char *msg; };
	struct ur2	{ int val; const char *msg; };
	struct ur3	{ int val; const char *msg; };
public:
static void view1() {
struct ur1 poems[] = {
	{1, "1  خُداوند کا کلام جو شاہ یہُوداہیُوں سیاہ بن آمونکے ایام میں صفنیاہ بن کوشی بن جدلیاہ بن امریاہ بن حزقیاہ پر نازل ہُوا۔ "},
	{2, "2  خُداوند فرماتا ہے میں روی زمین سے سب کچھ بالکل نیست کُروں گا۔ "},
	{3, "3  انسان اور حیوان کو نیست کُروں گا۔ ہوا کے پرندوں اور سُمندر کی مچھلیوں کو اور شریروں اور اُن کے بُتوں کو نیست کُروں گا اور انسان کو رُوی زمین سے فنا کُروں گا خُداوند فرماتا ہے۔ "},
	{4, "4  میں یہُوداہ پر اور یروشیلم کے سب باشندوں پر ہاتھ چلاوں گا اور اس مکان میں سے بعل کے بقیہ کو اور کماریم کے نام کو پُجاریوں سمیت نیست کُروں گا۔ "},
	{5, "5  اور اُن کو بھی جو کوٹھوں پر چڑھ کر اجرام فلک کی پرستش کرتے ہیں اور اُن کو جو خُداوند کی عبادت کا عہد کرتے ہیں لیکن ملکوں کی قسم کھاتےہیں۔ "},
	{6, "6  اور اُن کو بھی جو خُداوند سے برگشتہ ہو کر نہ اُس کے طالب ہوئے اور نہ اُنہوں نے اس سے مشورت لی۔ "},
	{7, "7  تم خُدا خُداوند کے حُضرو خاموش رہو کیونکہ خُداوند کا دن نزدیک ہے اور اُس نے ذبیحہ تیار کیا ہے اور اپنے مہمانوں کو مُخصوص کیا ہے۔ "},
	{8, "8  اور خُداوند کے ذبیحہ کے دن یُوں ہو گا کہ میں اُمرا اور شاہزادوں کو اور اُن سب کو جو اجنبیوں کی پوشاک پہنتے ہیں سزادُوں گا۔ "},
	{9, "9  میں اُسی روز اُن سب کو جو لوگوں کے گھروں میں گھس کر اپنے آقا کے گھر کو لُوٹ اور مُکرسے بھرتے ہیں سزادوں گا۔ (10 ) اورخُداوند فرماتا ہے اُسی روز مچھلی پھاٹک سے رونے کی آواز اور مشنہ سے ماتم کی اور ٹیلوں پر سے بڑے غوغا کی صدا اُٹھے گی۔ "},
	{10, "11  اے مکتیس کے رہنے والو! ماتم کرو کیونکہ سب سوداگر مارے گئے۔ جوچاندی سے لدے تھے سب ہلاک ہُوئے۔ "},
	{11, "12  پھر میں چراغ لے کر یروشیلم میں تلاش کُروں گا اور جتنے اپنی تلچھٹ پر جم گئے ہیں اور دل میں کہتے ہیں کہ خُداوند سزا و جزا نہ دے گا اُن کو سزا دُوں گا ۔ "},
	{12, "13  تب اُن کا مال لُٹ جاے گا اور اُن کے گھر اُجڑ جائیں گے۔ وہ گھر تو بنائیں گے پر اُن میں بودوباش نہ کریں گے اور تاکستان لگائیں گے پر اُن کی مے نہ پیں گے۔ "},
	{13, "14  خُداوند کا روز عظیم قریب ہے ہاں وہ نزدیک آ گیا۔ وہ آ پُہنچا! سُنو خُداوند کے دن کا شور! زبردست آدمی پُھوٹ پھوٹ کر روئے گا۔ "},
	{14, "15  وہ دن قہر کا دن ہے ۔ دُکھ اور رنج کا دن۔ ویرانی اور خرابی کا دن۔ تاریکی اور اُداسی کا دن۔ ابر اور تیرگی کا دن ۔ "},
	{15, "16  حصوںشہر وں اور اُونچے بُرجوں کے خلاف نر سنگے اور جنگی للکار کا دن۔ "},
	{16, "17  اور میں بنی آدم پر مُصبیت لاوں گا یہاں تک کہ وہ اندھوں کی مانند چلیں گے کیونکہ وہ خُداوند کے گُہنگار ہوئے۔ اُن کا خُون دُھول کی طرح گرایا جائے گا اور اُن کا گوشت نجاست کی مانند۔ "},
	{17, "18  خُداوند کے قہر کے دن اُن کا سونا چاندی اُن کو بچا نہ سکے گا بلکہ تمام مُلک کو اُس کی غیرت کی آگ کھا جاے گی کیونکہ وہ ایک لخت مُلک کے سب باشندوں کو تمام کر ڈالے گا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ur2 poems[] = {
	{1, "1  اے بے حیا قوم جمع ہو! جمع ہو !۔ "},
	{2, "2  اس سے پہلے کے تقدیر الہی ظاہر ہو اور وہ دن بُھس کی مانند جاتا رہے اور اور خُداوند کا قہر شدید تم پر نازل ہو اور اُس کے غضب کا دن تم پر آ پُہنچے۔ "},
	{3, "3  اے مُلک کے سب حلیم لوگو جو خُداوند کے احکام پر چلتے ہو اُس کے طالب ہو! راستبازی کو ڈھونڈو۔ فروتنی کی تلاش کرو۔ شاید خُداوند کے غضب کے دن تم کو پناہ ملے۔ "},
	{4, "4  کیونکہ غزہ متروک ہو گا اور اسقلون ویران کیا جائے گا اور اشدود دوپہر کو خارج کر دیا جائے گا اور عقرون کی بیخ کنی کی جائے گی۔ "},
	{5, "5  سُمندر کے رہنے والوں یعنی کر یتیوں کی قوم پر افسوس ! اے کنعان فلتیوں کی سرزمین ! خُداوند کا کلام تیرے خلاف ہے۔ میں تجھے نیست و نابود کروں گایہاں تک کہ کوئی بسنے والا نہ رہے۔ "},
	{6, "6  اور سمندر کے ساحل چراگاہیں ہوں گے جن میں چرواہوں کی جھونپڑیاں اور بھیڑ خانے ہوں گے۔ "},
	{7, "7  اور وہی ساحل یہُوداہ کے گھرانے کے بقیہ کے لے ہوں گئے۔ وہ اُن میں چرایا کریں گے۔ وہ شام کے وقت اسقلون کے مکانوں میں لیٹا کریں گے کیونکہ خُداوند اُن کا خُدا اُن پر پھر نظر کرے گا اور اُن کی اسیری کو موقوف کرے گا۔ "},
	{8, "8  میں نے موآب کی ملامت اور نبی عمون کی لعن طعن سُنی ہے۔ اُنہوں نے میری قوم کو ملامت کی اور اُن کی حدود کو دبالیا ہے۔ "},
	{9, "9  اس لے ربُ الافوج اسرائیل کا خُدا فرماتا ہے مُجھے اپنی حیات کی قسم ! یقینا موآب سدوم کی مانند ہوگا اور نبی عمون عمورہ کی مانند ۔ وہ پُرخار و نمکزار اور ابدالاآباد برباد رہیں گے۔ میرے لوگوں کا بقیہ اُن کو غارت کرے گا اور میری قوم کے باقی لوگ اُن کے وارث ہوں گئے۔(10 ) یہ سب اُن کے تکبر کے سبب اُن پر آے گا کیونکہ اُنہوں نے ربُ الافواج کے لوگوں کو ملامت کی اور اُن پر زیادتی کی۔ "},
	{10, "11  خُداوند اُن کے لے ہیبت ناک ہوگا اور زمین کے تمام معبُودوں کو لاغر کر دے گا اور بحری مُمالک کے سب باشندے اپنی اپنی جگہ میں اُس کی پرستش کریں گے۔ "},
	{11, "12  اے کُوش کے باشندو! تم بھی میری تلوار سے مارے جاؤگے۔ "},
	{12, "13  اور وہ شمال کی طرف اپنا ہاتھ بڑھائے گا اور اسور کو نیست کرے گا اور نینوہ کو ویران اور بیابان کی مانند خُشک کر دے گا۔ "},
	{13, "14  اور جنگلی جانور اُس میں لیٹیں گے اور ہر قسم کے حیوان حواصل اور خُارپُشت اُس کے ستونوں کے سروں پر مقام کریں گے۔ اُن کی آواز اس کے جھروکوں میں ہو گی۔ اس کی دہلیز میں ویرانی ہو گی کیونکہ دیوار کا کام کُھلا چھوڑا گیا ہے۔ "},
	{14, "15  یہ وہ شادمان شہر ہے جو بے فکر تھا۔ جس نے دل میں کہا میں ہُوں اور میرے سوا کوئی دُوسرا نہیں۔ وہ کیسا ویران ہُوا ! حیوانوں کے بٹیھنے کی جگہ! ہر ایک جو اُدھر سے گُزرئے گا سسُکا رئےگا اور ہاتھ ہلائےگا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ur3 poems[] = {
	{1, "1  اس سر کش و ناپاک و ظالم شہر پر افسوس!۔ "},
	{2, "2  اس نے کلام کو نہ سُنا۔ وہ ترتیب پزیر نہ ہوا۔ اس نے خُداوند پر توکل نہ کیا اور اپنے خُدا کی قُربت کی آرزو نہ کی۔ "},
	{3, "3  اس کے اُمرا اس میں گرجنے والے ببر ہیں۔ اس کے قاضی بھیڑے ہیں جو شام کو نکلتے ہیں اور صبح تک کُچھ نہیں چھوڑتے۔ "},
	{4, "4  اُس کے نبی لاف زن اور دغاباز ہیں۔ اس کے کاہنوں نے پاک کو نا پاک ٹھہرایا اور اُنہوں نے شریعت کو مروڑا ہے۔ "},
	{5, "5  خُداوند جو صادق ہے اس کے اندر ہے۔ وہ بے انصافی نہ کرے گا۔ وہ ہر صبح بلاناغہ اپنی عدالت ظاہر کرتا ہے مگر بے انصاف آدمی شرم کو نہیں جانتا۔ "},
	{6, "6  میں نے قوموں کو کاٹ ڈالا۔ اُن کے برج برباد کئے گئے۔میں نے اُن کے کوچوں کو ویران کیا یہاں تک کہ اُن میں کوئی نہیں چلتا ۔ اُن کے شہراُجاڑ ہوئے اور اُن میں کوئی انسان نہیں ۔ کوئی باشندہ نہیں۔ "},
	{7, "7  میں نے کہا کہ فقط مُجھ سے ڈر اور تربیت پزیر ہوتا کہ اس کی بستی کاٹی نہ جائے اُس سب کے مُطابق جو میں نے اس کے حق میں ٹھہرایا تھا لیکن اُنہوں نے عمدا اپنی روش کو بگاڑا۔ "},
	{8, "8  پس خُداند فرماتا ہے میرے مُنتظر رہو جب کہ میں لوٹ کے لے نہ اُٹھوں کیونکہ میں نے ٹھان لیا ہے کہ قوموں کو جمع کرو اور مملکتوں کو اکٹھا کُروں تاکہ اپنے غضب یعنی تمام قہر شدید کو اُن پر نازل کُروں کیونکہ میری غیرت کی آگ ساری زمین کو کھا جائے گی۔ "},
	{9, "9  اور میں اُس وقت لوگوں کے ہونٹ پاک کر دُوں گا تاکہ وہ سب خُداوند سے دُعا کریں اور ایک دل ہو کر اُس کی عبادت کریں۔ (10 ) کُوش کی نہروں کے پار سے میرے عابد یعنی میری پراگندہ قوم میرے لے ہدیہ لاے گی۔ "},
	{10, "11  اُسی روز تو اپنے سب اعمال کے سبب سے جن سے تو میری گہنگار ہوئی شرمندہ نہ ہوگئی کیونکہ میں اس وقت تیرے درمیان سے تےرے مُتکبر لوگوں کو نکال دُوں گا اور پھر تو میرے لوہ مُقدس پر تکبر نہ کرے گی۔ "},
	{11, "12  اور میں تجھ میں ایک مظلوم اور مسکین بقیہ چھوڑ دوں گا اور وہ خُداوند کے نام پر توکل کریں گے۔ "},
	{12, "13  اسرائیل کے باقی لوگ نہ بدی کریں گے نہ جھوٹ بولیں گے اور نہ اُن کے مُنہ میں دغا کی باتیں پائی جائیں گی بلکہ وہ کھائیں گے اور لیٹ رہیں گے اور کوئی ان کو نہ ڈرائے گا۔ "},
	{13, "14  اے بنت صیون نغمہ سرائی کر!اے اسرائیل! للکار۔ اے دختر یروشیلم! پُورے دل سے خُوشی منا اور شادمان ہو۔ "},
	{14, "15  خُداوند نے تیری سزا کو دُور کر دیا اُس نے تیرے دشمنوں کو نکال دیا خُداونداسرائیل کا بادشاہ تیرے اندر ہے۔توپھر مُصیبت کو نہ دیکھے گی۔ "},
	{15, "16  اس روز یروشیلم سے کہا جاے گا ہراسان نہ ہو! اے صیون تیرے ہاتھ ڈھیلے نہ ہوں۔ "},
	{16, "17  خُداوند تیرا خُدا جو تُجھ میں ہے قادرہے۔ وہی بچا لے گا۔وہ تیرے سبب سے شادمان ہو کر خُوشی کرے گا۔ وہ اپنی محبت میں مسرور رہے گا۔ وہ گاتے ہوئے تیرے لے شادمانی کرے گا۔ "},
	{17, "18  میں تیرے لے ان لوگوں کو جوعیدوں سے محروم ہونے کے سبب غمگین اور ملامت سے زیر بار ہیں جمع کروں گا۔ "},
	{18, "19  دیکھ میں اس وقت تیرے سب ستانے والوں کو سزا دوں گا اور لنگڑوں کو رہائی دوں گا اور جو ہانک دے گئے ان کو اکٹھا کروں گا اور جو تمام جہان میں رسوا ہوئےان کو ستودہ اور نامور کروں گا۔(20 ) اس وقت میں تم کو جمع کر کے مُلک میں لاوں گا کیونکہ جب تمہارے جین حیات ہی میں تمہاری اسیری کو موقوف کروں گا توتم کو زمین کی سب قوموں کے درمیان نامور اور ستودہ کروں گا خُداوند فرماتا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};