#include <map>
#include <string>
class Bible59
{
	struct ur1	{ int val; const char *msg; };
	struct ur2	{ int val; const char *msg; };
	struct ur3	{ int val; const char *msg; };
	struct ur4	{ int val; const char *msg; };
	struct ur5	{ int val; const char *msg; };
public:
static void view1() {
struct ur1 poems[] = {
	{1, "1  خُدا کے اور خُداوند یِسُوع مسِیح کے بندہ یَعقُوب کی طرف سے اُن بارہ قبِیلوں کو جو جا بجا رہتے ہیں سَلام پہُنچے۔ "},
	{2, "2  اَے میرے بھائِیو! جب تُم طرح طرح کی آزمایشوں میں پڑو۔ "},
	{3, "3  تو اِس کو یہ جان کر کمال خُوشی کی بات سَمَجھنا کہ تُمہارے اِیمان کی آزمایش صبر پَیدا کرتی ہے۔ "},
	{4, "4  اور صبر کو اپنا پُورا کام کرنے دو تاکہ تُم پُورے اور کامِل ہو جاؤ اور تُم میں کِسی بات کی کمی نہ رہے۔ "},
	{5, "5  لیکِن اگر تُم میں سے کِسی میں حِکمت کی کم ہو تو خُدا سے مانگے جو بغَیر ملامت کِئے سب کو فَیّاضی کے ساتھ دیتا ہے۔ اُس کو دی جائے گی۔ "},
	{6, "6  مگر اِیمان سے مانگے اور کُچھ شک نہ کرے کِیُونکہ شک کرنے والا سَمَندَر کی لہر کی مانِند ہوتا ہے جو ہوا سے بہُتی اور اُچھلتی ہے۔ "},
	{7, "7  اَیسا آدمِی یہ نہ سَمَجھے کہ مُجھے خُداوند سے کُچھ مِلے گا۔ "},
	{8, "8  وہ شَخص دو دِلا ہے اور اپنی سب باتوں میں بے قیام ہے۔ "},
	{9, "9  ادنٰے بھائِی اپنے اعلٰے مرتبہ پر فخر کرے۔ "},
	{10, "10  اور دَولتمند اپنی ادنٰے حالت پر اِس لِئے کہ گھاس کے پھُول کی طرح جاتا رہے گا۔ "},
	{11, "11  کِیُونکہ سُورج نِکلتے ہی سخت دھُوپ پڑتی اور گھاس کو سُکھا دیتی ہے اور اُس کا پھُول گِر جاتا ہے اور اُس کی خُوبصُورتی جاتی رہتی ہے۔ اِسی طرح دَولتمند بھی اپنی راہ پر چلتے چلتے خاک میں مِل جائے گا۔ "},
	{12, "12  مُبارک وہ شَخص ہے جو آزمایش کی برداشت کرتا ہے کِیُونکہ جب مقبُول ٹھہرا تو زِندگی کا وہ تاج حاصِل کرے گا جِس کا خُداوند نے اپنے محبّت کرنے والوں سے وعدہ کِیا ہے۔ "},
	{13, "13  جب کوئی آزمایا جائے تو یہ نہ کہے کہ میری آزمایش خُدا کی طرف سے ہوتی ہے کِیُونکہ نہ تو خُدا بدی سے آزمایا جا سکتا ہے اور نہ وہ کِسی کو آزماتا ہے۔ "},
	{14, "14  ہاں ہر شَخص اپنی ہی خواہِشوں میں کھِنچ کر اور پھنس کر آزمایا جاتا ہے۔ "},
	{15, "15  پھِر خواہِش حامِلہ ہوکر گُناہ کو جنتی ہے اور گُناہ جب بڑھ چُکا تو مَوت پَیدا کرتا ہے۔ "},
	{16, "16  اَے میرے پیارے بھائِیو! فریب نہ کھانا۔ "},
	{17, "17  ہر اچھّی بخشِش اور ہر کامِل اِنعام اُوپر سے ہے اور نوروں کے باپ کی طرف سے مِلتا ہے جِس میں نہ کوئی تبدیلی ہوسکتی ہے اور نہ گردِش کے سبب سے اُس پر سایہ پڑتا ہے۔ "},
	{18, "18  اُس نے اپنی مرضی سے ہمیں کلامِ حق کے وسِیلہ سے پَیدا کِیا تاکہ اُس کی مخلُوقات میں سے ہم ایک طرح کے پہلے پھَل ہوں۔ "},
	{19, "19  اَے میرے پیارے بھائِیو! یہ بات تُم جانتے ہو۔ پَس ہر آدمِی سُننے میں تیز اور بولنے میں دِھیرا اور قہر میں دھِیما ہو۔ "},
	{20, "20  کِیُونکہ اِنسان کا قہر خُدا کی راستبازی کا کام نہِیں کرتا۔ "},
	{21, "21  اِس لِئے ساری نِجاست اور بدی کے فُضلہ کو دُور کر کے اُس کلام کو حلِیمی سے قُبُول کر لو جو دِل میں بویا گیا اور تُمہاری رُوحوں کو نِجات دے سکتا ہے۔ "},
	{22, "22  لیکِن کلام پر عمل کرنے والے بنو نہ محض سُننے والے جو اپنے آپ کو دھوکہ دیتے ہیں۔ "},
	{23, "23  کِیُونکہ جو کوئی کلام کا سُننے والا ہو اور اُس پر عمل کرنے والا نہ ہو وہ اُس شَخص کی مانِند ہے جو اپنی قُدرتی صُورت آئِینہ میں دیکھتا ہے۔ "},
	{24, "24  اِس لِئے کہ وہ اپنے آپ کو دیکھ کر چلا جاتا اور فوراً بھُول جاتا ہے کہ مَیں کَیسا تھا۔ "},
	{25, "25  لیکِن جو شَخص آزادی کی کامِل شَرِیعَت پر غور سے نظر کرتا رہتا ہے وہ اپنے کام میں اِس لِئے بَرکَت پائے گا کہ سُن کر بھُولتا نہِیں بلکہ عمل کرتا ہے۔ "},
	{26, "26  اگر کوئی اپنے آپ کو دِیندار سَمَجھے اور اپنی زبان کو لگام نہ دے بلکہ اپنے دِل کو دھوکا دے تو اُس کی دِینداری باطِل ہے۔ "},
	{27, "27  ہمارے خُدا اور باپ کے نزدِیک خالِص اور بے عَیب دِینداری یہ ہے کہ یتِیموں اور بیواؤں کی مُصِیبت کے وقت اُن کی خَبر لیں اور اپنے آپ کو دُنیا سے بے داغ رکھّیں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ur2 poems[] = {
	{1, "1  اَے میرے بھائِیو! ہمارے خُداوند ذُوالجلال یِسُوع مسِیح کا اِیمان تُم میں طرفداری کے ساتھ نہ ہو۔ "},
	{2, "2  کِیُونکہ اگر ایک شَخص تو سونے کی انگُوٹھی اور عُمدہ پوشاک پہنے ہُوئے تُمہاری جماعت میں آئے اور ایک غرِیب آدمِی مَیلے کُچیلے کپڑے پہنے ہُوئے آئے۔ "},
	{3, "3  اور تُم اُس عُمدہ پوشاک والے کا لِحاظ کر کے کہو کہ تُو یہاں اچھّی جگہ بَیٹھ اور اُس غرِیب شَخص سے کہو کہ تُو وہاں کھڑا رہ یا میرے پاؤں کی چَوکی کے پاس بَیٹھ۔ "},
	{4, "4  تو کیا تُم نے آپس میں طرفداری نہ کی اور بدنِیّت مُنصِف نہ بنے؟ "},
	{5, "5  اَے میرے پیارے بھائِیو! سُنوُ، کیا خُدا نے اِس جہان کے غرِیبوں کو اِیمان میں دَولتمند اور اُس بادشاہی کے وارِث ہونے کے لِئے برگُزِیدہ نہِیں کِیا جِس کا اُس نے اپنے محبّت کرنے والوں سے وعدہ کِیا ہے؟ "},
	{6, "6  لیکِن تُم نے غرِیب آدمِی کی بے عِزّتی کی۔ کیا دَولتمند تُم پر ظُلم نہِیں کرتے اور وُہی تُمہیں عدالتوں میں گھسِیٹ کر نہِیں لے جاتے؟ "},
	{7, "7  کیا وہ اُس بُزُرگ نام پر کُفر نہِیں بکتے جِس سے تُم نامزد ہو؟ "},
	{8, "8  تَو ابھی اگر تُم اِس نوِشتہ کے مُطابِق کہ اپنے پڑوسِی سے اپنی مانِند محبّت رکھ اُس بادشاہی شَرِیعَت کو پُورا کرتے ہو تو اچھّا کرتے ہو۔ "},
	{9, "9  لیکِن اگر تُم طرفداری کرتے ہو تو گُناہ کرتے ہو اور شَرِیعَت تُم کو قُصُوروار ٹھہراتی ہے۔ "},
	{10, "10  کِیُونکہ جِس نے ساری شَرِیعَت پر عمل کِیا اور ایک ہی بات میں خطا کی وہ سب باتوں میں قُصُوروار ٹھہرا۔ "},
	{11, "11  اِس لِئے کہ جِس نے یہ فرمایا کہ زِنا نہ کر اُسی نے یہ بھی فرمایا کہ خُون نہ کر۔ پَس اگر تُو نے زِنا تو نہ کِیا مگر خُون کِیا تو بھی تُو شَرِیعَت کا عُدُول کرنے والا ٹھہرا۔ "},
	{12, "12  تُم اُن لوگوں کی طرح کلام بھی کرو اور کام بھی کرو جِن کا آزادی کی شَرِیعَت کے مُوافِق اِنصاف ہوگا۔ "},
	{13, "13  کِیُونکہ جِس نے رحم نہِیں کِیا اُس کا اِنصاف بغَیر رحم کے ہوگا۔ رحم اِنصاف پر غالِب آتا ہے۔ "},
	{14, "14  اَے میرے بھائِیو! اگر کوئی کہے کہ مَیں اِیماندار ہُوں مگر عمل نہ کرتا ہو تو کیا فائِدہ؟ کیا اَیسا اِیمان اُسے نِجات دے سکتا ہے؟ "},
	{15, "15  اگر کوئی بھائِی یا بہن ننگی ہو اور اُن کو روزانہ روٹی کی کمی ہو۔ "},
	{16, "16  اور تُم میں سے کوئی اُن سے کہے کہ سَلامتی کے ساتھ جاؤ۔ گرم اور سیر رہو مگر جو چِیزیں تن کے لِئے درکار ہیں وہ اُنہِیں نہ دے تو کیا فائِدہ؟ "},
	{17, "17  اِسی طرح اِیمان بھی اگر اُس کے ساتھ اعمال نہ ہوں تو اپنی ذات سے مُردہ ہے۔ "},
	{18, "18  بلکہ کوئی کہہ سکتا ہے کہ تُو تو اِیماندار ہے اور مَیں عمل کرنے والا ہُوں۔ تُو اپنا اِیمان بغَیر اعمال کے تو مُجھے دِکھا اور میں اپنا اِیمان اعمال سے تُجھے دِکھاؤں گا۔ "},
	{19, "19  تُو اِس بات پر اِیمان رکھتا ہے کہ خُدا ایک ہی ہے۔ خَیر، اچھّا کرتا ہے۔ شیاطِین بھی اِیمان رکھتے اور تھَر تھَراتے ہیں۔ "},
	{20, "20  مگر اَے نِکمّے آدمِی! کیا تُو یہ بھی نہِیں جانتا کہ اِیمان بغَیر اعمال کے بےکار ہے؟ "},
	{21, "21  جب ہمارے باپ ابرہام نے اپنے بَیٹے اِضحاق کو قُربان گاہ پر قُربان کِیا تو کیا وہ اعمال سے راستباز نہ ٹھہرا؟ "},
	{22, "22  پَس تُو نے دیکھ لِیا کہ اِیمان نے اُس کے اعمال کے ساتھ مِل کر اثر کِیا اور اعمال سے اِیمان کامِل ہُؤا۔ "},
	{23, "23  اور یہ نوِشتہ پُورا ہُؤا کہ ابرہام خُدا پر اِیمان لایا اور یہ اُس کے لِئے راستبازی گِنا گیا اور وہ خُدا کا دوست کہلایا۔ "},
	{24, "24  پَس تُم نے دیکھ لِیا کہ اِنسان صِرف اِیمان سے نہِیں بلکہ اعمال سے راستباز ٹھہرتا ہے۔ "},
	{25, "25  اِسی طرح راحب فاحِشہ بھی جب اُس نے قاصِدوں کو اپنے گھر میں اُتارا اور دُوسری راہ سے رُخصت کِیا تو کیا اعمال سے راستباز نہ ٹھہری؟ "},
	{26, "26  غرض جَیسے بَدَن بغَیر رُوح کے مُردہ ہے وَیسے ہی اِیمان بھی بغَیر اعمال کے مُردہ ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ur3 poems[] = {
	{1, "1  اَے میرے بھائِیو! تُم میں سے بہُت سے اُستاد نہ بنیں گے کِیُونکہ جانتے ہو کہ ہم جو اُستاد ہیں زِیادہ سزا پائیں گے۔ "},
	{2, "2  اِس لِئے کہ ہم سب کے سب اکثر خطا کرتے ہیں۔ کامِل شَخص وہ ہے جو باتوں میں خطا نہ کرے۔ وہ سارے بَدَن کو بھی قابُو میں رکھ سکتا ہے۔ "},
	{3, "3  جب ہم اپنے قابُو کرنے کے لِئے گھوڑوں کے مُنہ میں لگام دے دیتے ہیں تو اُن کے سارے بَدَن کو بھی گھُما سکتے ہیں۔ "},
	{4, "4  دیکھو، جہاز بھی اگرچہ بڑے بڑے ہوتے ہیں اور تیز ہواؤں سے چلائے جاتے ہیں تَو بھی ایک نِہایت چھوٹی سے پتوار کے ذرِیعہ سے مانجھی کی مرضی کے مُوافِق گھُمائے جاتے ہیں۔ "},
	{5, "5  اِسی طرح زبان بھی ایک چھوٹا سا عضُو ہے اور بڑی شیخی مارتا ہے۔ دیکھو، تھوڑی سے آگ سے کِتنے بڑے جنگل میں آگ لگ جاتی ہے۔ "},
	{6, "6  زبان بھی ایک آگ ہے۔ زبان ہمارے اعضا میں شرارت کا ایک عالم ہے اور سارے جِسم کو داغ لگاتی ہے اور دائرۂِ دُنیا کو آگ لگا دیتی ہے اور جہنّم کی آگ سے جلتی رہتی ہے۔ "},
	{7, "7  کِیُونکہ ہر قِسم کے چَوپائے اور پرِندے اور کِیڑے مکَوڑے اور دریائی جانور تو اِنسان کے قابُو میں آ سکتے ہیں اور آئے بھی ہیں۔ "},
	{8, "8  مگر زبان کو کوئی آدمِی قابُو میں نہِیں کر سکتا۔ وہ ایک بلا ہے جو کبھی رُکتی ہی نہِیں۔ زہرِ قاتِل سے بھری ہُوئی ہے۔ "},
	{9, "9  اِسی سے ہم خُداوند اور باپ کی حمد کرتے ہیں اور اِسی سے آدمِیوں کو جو خُدا کی صُورت پر پَیدا ہُوئے ہیں بددُعا دیتے ہیں۔ "},
	{10, "10  ایک ہی مُنہ سے مُبارکباد اور بددُعا نِکلتی ہے۔ اَے بھائِیو! اَیسا نہ ہونا چاہئے۔ "},
	{11, "11  کیا چشمہ کے ایک ہی مُنہ سے مِیٹھا اور کھاری پانی نِکلتا ہے؟ "},
	{12, "12  اَے میرے بھائِیو! کیا اِنجیر کے دَرخت میں زَیتُّون اور انگُور میں اِنجیر پَیدا ہو سکتے ہیں؟ اِسی طرح کھاری چشمہ سے مِیٹھا پانی نہِیں نِکل سکتا۔ "},
	{13, "13  تُم میں دانا اور فہِیم کَون ہے؟ جو اَیسا ہو وہ اپنے کاموں کو نیک چال چلن کے وسِیلہ سے اُس حِلم کے ساتھ ظاہِر کرے جو حِکمت سے پَیدا ہوتا ہے۔ "},
	{14, "14  لیکِن اگر تُم اپنے دِل میں سخت حسد اور تفرقے رکھتے ہو تو حق کے خِلاف نہ شیخی مارو نہ جھُوٹ بولو۔ "},
	{15, "15  یہ حِکمت وہ نہِیں جو اُوپر سے اُترتی ہے بلکہ دُنیوی اور نفسانی اور شَیطانی ہے۔ "},
	{16, "16  اِس لِئے کہ جہاں حسد اور تفرقہ ہوتا ہے وہاں فساد اور ہر طرح کا بُرا کام بھی ہوتا ہے۔ "},
	{17, "17  مگر جو حِکمت اُوپر سے آتی ہے اوّل تو وہ پاک ہوتی ہے۔ پھِر مِلنسار۔ حلیم اور تربیت پذِیر۔ رحم اور اچھّے پھَلوں سے لدی ہُوئی۔ بے طرفدار اور بے رِیا ہوتی ہے۔ "},
	{18, "18  اور صُلح کرانے والوں کے لِئے راستبازی کا پھَل صُلح کے ساتھ بویا جاتا ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ur4 poems[] = {
	{1, "1  تُم میں لڑائیاں اور جھگڑے کہاں سے آگئے؟ کیا اُن خواہِشوں سے نہِیں جو تُمہارے اعضا میں فساد کرتی ہیں؟ "},
	{2, "2  تُم خواہِش کرتے ہو اور تُمہیں مِلتا نہِیں۔ خُون اور حسد کرتے ہو اور کُچھ حاصِل نہِیں کرسکتے۔ تُم جھگڑتے اور لڑتے ہو۔ تُمہیں اِس لِئے نہِیں مِلتا کہ مانگتے نہِیں۔ "},
	{3, "3  تُم مانگتے ہو اور پاتے نہِیں اِس لِئے کہ بُری نیّت سے مانگتے ہو تاکہ اپنی عَیش و عِشرت سے خرچ کرو۔ "},
	{4, "4  اَے زِنا کرنے والیو! کیا تُمہیں نہِیں معلُوم کہ دُنیا سے دوستی رکھنا خُدا سے دُشمنی کرنا ہے؟ پَس جو کوئی دُنیا کا دوست بننا چاہتا ہے وہ اپنے آپ کو خُدا کا دُشمن بناتا ہے۔ "},
	{5, "5  کیا تُم یہ سَمَجھتے ہو کہ کِتابِ مُقدّس بے فائِدہ کہتی ہے؟ جِس رُوح کو اُس نے ہمارے اَندر بسایا ہے کیا وہ اَیسی آرزُو کرتی ہے جِس کا انجام حسد ہو؟ "},
	{6, "6  وہ تو زِیادہ تَوفِیق بخشتا ہے۔ اِسی لِئے یہ آیا ہے کہ خُدا مغرُوروں کا مُقابلہ کرتا ہے مگر فروتنوں کو تَوفِیق بخشتا ہے۔ "},
	{7, "7  پَس خُدا کے تابِع ہو جاؤ اور اِبلِیس کا مُقابلہ کرو تو وہ تُم سے بھاگ جائے گا۔ "},
	{8, "8  خُدا کے نزدِیک جاؤ تو وہ تُمہارے نزدِیک آئے گا۔ اَے گُناہگارو! اپنے ہاتھوں کو صاف کرو اور اَے دو دِلو! اپنے دِلوں کو پاک کرو۔ "},
	{9, "9  افسوس اور ماتم کرو اور روؤ۔ تُمہاری ہنسی ماتم سے بدل جائے اور تُمہاری خُوشی اُداسی سے۔ "},
	{10, "10  خُداوند کے سامنے فروتنی کرو۔ وہ تُمہیں سربُلند کرے گا۔ "},
	{11, "11  اَے بھائِیو! ایک دُوسرے کی بدگوئی نہ کرے۔ جو اپنے بھائِی کی بدگوئی کرتا یا بھائِی پر اِلزام لگاتا ہے وہ شَرِیعَت کی بدگوئی کرتا اور شَرِیعَت پر اِلزام لگاتا ہے اور اگر تُو شَرِیعَت پر اِلزام لگاتا ہے تو شَرِیعَت پر عمل کرنے والا نہِیں بلکہ اُس پر حاکِم ٹھہرا۔ "},
	{12, "12  شَرِیعَت کا دینے والا اور حاکِم تو ایک ہی ہے جو بَچانے اور ہلاک کرنے پر قادِر ہے۔ تُو کَون ہے جو اپنے پڑوسِی پر اِلزام لگاتا ہے؟ "},
	{13, "13  تُم جو یہ کہتے ہو کہ ہم آج یا کل فلاں شہر میں جا کر وہاں ایک برس ٹھہریں گے اور سَوداگری کر کے نفع اُٹھائیں گے۔ "},
	{14, "14  اور یہ جانتے نہِیں کہ کل کیا ہوگا۔ ذرا سُنو تو! تُمہاری زِندگی چِیز ہی کیا ہے؟ بُخارات کا سا حال ہے۔ ابھی نظر آئے۔ ابھی غائِب ہو گئے۔ "},
	{15, "15  یُوں کہنے کی جگہ تُمہیں یہ کہنا چاہئے کہ اگر خُداوند چاہے تو ہم زِندہ بھی رہیں گے اور یہ یا وہ کام بھی کریں گے۔ "},
	{16, "16  مگر اَب تُم اپنی شَیخی پر فخر کرتے ہو۔ اَیسا سب فخر بُرا ہے۔ "},
	{17, "17  پَس جو کوئی بھلائی کرنا جانتا ہے اور نہِیں کرتا اُس کے لِئے یہ گُناہ ہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ur5 poems[] = {
	{1, "1  اَے دَولتمندو ذرا سُنو تو! تُم اپنی مُصِیبتوں پر جو آنے والی ہیں روؤ اور واوَیلا کرو۔ "},
	{2, "2  تُمہارا مال بِگڑ گیا اور تُمہاری پوشاکوں کو کِیڑا کھا گیا۔ "},
	{3, "3  تُمہارے سونے چاندی کو زنگ لگ گیا اور وہ زنگ تُم پر گواہی دے گا اور آگ کی طرح تُمہارا گوشت کھائے گا۔ تُم نے اخِیر زمانہ میں خزانہ جمع کِیا ہے۔ "},
	{4, "4  دیکھو جِن مزدُوروں نے تُمہارے کھیت کاٹے اُن کی وہ مزدُوری جو تُم نے دغا کر کے رکھ چھوڑی چِلّاتی ہے اور فصل کاٹنے والوں کی فریاد ربّ اُلافواج کے کانوں تک پہُنچ گئی ہے۔ "},
	{5, "5  تُم نے زمِین پر عَیش و عِشرت کی اور مزے اُڑائے۔ تُم نے اپنے دِلوں کو ذبح کے دِن موٹا تازہ کِیا۔ "},
	{6, "6  تُم نے راستباز شَخص کو قُصُوروار ٹھہرایا اور قتل کِیا۔ وہ تُمہارا مُقابلہ نہِیں کرتا۔ "},
	{7, "7  پَس اَے بھائِیو! خُداوند کی آمد تک صبر کرو۔ دیکھو۔ کِسان زمِین کی قِیمتی پَیداوار کے اِنتظار میں پہلے اور پِچھلےمینہ کے برسنے تک صبر کرتا رہتا ہے۔ "},
	{8, "8  تُم بھی صبر کرو اور اپنے دِلوں کو مضبُوط رکھّو کِیُونکہ خُداوند کی آمد قرِیب ہے۔ "},
	{9, "9  اَے بھائِیو! ایک دُوسرے کی شِکایت نہ کرو تاکہ تُم سزا نہ پاؤ۔ دیکھو مُنصِف دروازہ پر کھڑا ہے۔ "},
	{10, "10  اَے بھائِیو! جِن نبِیوں نے خُداوند کے نام سے کلام کِیا اُن کو دُکھ اُٹھانے اور صبر کرنے کا نمُونہ سَمَجھو۔ "},
	{11, "11  دیکھو صبر کرنے والوں کو ہم مُبارک کہتے ہیں۔ تُم نے ایُّوب کے صبر کا حال تو سُنا ہی ہے اور خُداوند کی طرف سے جو اِس کا انجام ہُؤا اُسے بھی معلُوم کر لِیا جِس سے خُداوند کا بہُت ترس اور رحم ظاہِر ہوتا ہے۔ "},
	{12, "12  مگر اَے میرے بھائِیو! سب سے بڑھ کر یہ ہے کہ قَسم نہ کھاؤ۔ نہ آسمان کی نہ زمِین کی۔ نہ کِسی اَور چِیز کی بلکہ ہاں کی جگہ ہاں کرو اور نہِیں کی جگہ نہِیں تاکہ سزا کے لائِق نہ ٹھہرو۔ "},
	{13, "13  اگر تُم میں کوئی مُصِیبت زدہ ہو تو دُعا کرے۔ اگر خُوش ہو تو حمد کے گیت گائے۔ "},
	{14, "14  اگر تُم میں کوئی بِیمار ہو تو کلِیسیا کے بُزُرگوں کو بُلائے اور وہ خُداوند کے نام سے اُس کو تیل مل کر اُس کے لِئے دُعا کریں۔ "},
	{15, "15  جو دُعا اِیمان کے ساتھ ہوگی اُس کے باعِث بِیمار بچ جائے گا اور خُداوند اُسے اُٹھا کھڑا کرے گا اور اگر اُس نے گُناہ کِئے ہوں تو اُن کی بھی مُعافی ہو جائے گی۔ "},
	{16, "16  پَس تُم آپس میں ایک دُوسرے سے اپنے اپنے گُناہوں کا اِقرار کرو اور ایک دُوسرے کے لِئے دُعا کرو تاکہ شِفا پاؤ۔ راستباز کی دُعا کے اثر سے بہُت کُچھ ہو سکتا ہے۔ "},
	{17, "17  ایلِیاہ ہمارا ہم طبِیعت اِنسان تھا۔ اُس نے بڑے جوش سے دُعا کی مینہ نہ برسے۔ چُنانچہ ساڑھے تِین برس تک زمِین پر مینہ نہ برسا۔ "},
	{18, "18  پھِر اُس نے دُعا کی تو آسمان سے پانی برسا اور زمِین میں پَیداوار ہُوئی۔ "},
	{19, "19  اَے میرے بھائِیو! اگر تُم میں کوئی راہِ حق سے گُمراہ ہو جائے اور کوئی اُس کو پھیر لائے۔ "},
	{20, "20  تو وہ یہ جان لے کہ جو کوئی کِسی گُناہگار کو اُس کی گُمراہی سے پھیر لائے گا۔ وہ ایک جان کو مَوت سے بَچائے گا اور بہُت سے گُناہوں پر پردہ ڈالے گا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};