#include <map>
#include <string>
class Bible56
{
	struct ur1	{ int val; const char *msg; };
	struct ur2	{ int val; const char *msg; };
	struct ur3	{ int val; const char *msg; };
public:
static void view1() {
struct ur1 poems[] = {
	{1, "1  پَولُس کی طرف سے جو خُدا کا بندہ اور یِسُوع مسِیح کا رَسُول ہے۔ خُدا کے برگُزِدوں کے اِیمان اور اُس حق کی پہچان کے مُطابِق جو دِینداری کے مُوافِق ہے۔ "},
	{2, "2  اُس ہمیشہ کی زِندگی کی اُمِید پر جِس کا وعدہ ازل سے خُدا نے کِیا ہے جو جھُوٹ نہِیں بول سکتا۔ "},
	{3, "3  اور اُس نے مُناسِب وقتوں پر اپنے کلام کو اُس پیغام میں ظاہِر کیا جو ہمارے مُنّجی خُدا کے حُکم کے مُطابِق میرے سُپرد ہُؤا۔ "},
	{4, "4  اِیمان کی شِرکت کے رو سے سَچّے فرزند طِطُس کے نام، فضل اور اِطمینان خُدا باپ اور ہمارے مُنّجی یِسُوع مسِیح کی طرف سے تُجھے حاصِل ہوتا رہے۔ "},
	{5, "5  مَیں نے تُجھے کریتے میں اِس لِئے چھوڑا تھا کہ تُو باقی ماندہ باتوں کو درُست کرے اور میرے حُکم کے مُطابِق شہر بہ شہر اَیسے بُزُرگوں کو مُقرّر کرے۔ "},
	{6, "6  جو بے اِلزام اور ایک ایک بِیوی کے شوہر ہوں اور اُن کے بچّے اِیماندار اور بد چلنی اور سرکَشی کے اِلزام سے پاک ہوں۔ "},
	{7, "7  کِیُونکہ نِگہبان کو خُدا کا مُختار ہونے کی وجہ سے بے اِلزام ہونا چاہئے نہ خُودرائی ہو، نہ غُصّہ ور، نہ نشہ میں غُل مچانے والا۔ نہ مار پِیٹ کرنے والا اور نہ ناجائز نفع کا لالچی۔ "},
	{8, "8  بلکہ مُسافِر پرور۔ خیر دوست۔ مُتّقی مُنصِف مِزاج۔ پاک اور ضبط کرنے والا ہو۔ "},
	{9, "9  اور اِیمان کے کلام پر جو اِس تعلِیم کے مُوافِق ہے قائِم ہو تاکہ صحیح تعلِیم کے ساتھ نصِیحت بھی کر سکے اور مُخالِفوں کو قائِل بھی کر سکے۔ "},
	{10, "10  کِیُونکہ بہُت سے لوگ سرکش اور بہُودہ گو اور دغاباز ہیں خاص کر مختُونوں میں سے۔ "},
	{11, "11  اُن کا مُنہ بند کرنا چاہئے۔ یہ لوگ ناجائز نفع کی خاطِر ناشایستہ باتیں سِکھا کر گھر کے گھر تباہ کر دیتے ہیں۔ "},
	{12, "12  اُن ہی میں سے ایک شَخص نے کہا جو خاص اُن کا نبی تھا کہ کرُیتی ہمیشہ جھُوٹے ۔ مُوذی جانور۔ احدی کھاؤ ہوتے ہیں۔ "},
	{13, "13  یہ گواہی سَچ ہے۔ پَس اُنہِیں سخت ملامت کیا کرتا کہ اُن کا اِیمان درُست ہو جائے۔ "},
	{14, "14  اور وہ یہُودِیوں کی کہانیوں اور اُن آدمِیوں کے حُکموں پر تَوَجّہ نہ کریں جو حق سے گُمراہ ہوتے ہیں۔ "},
	{15, "15  پاک لوگوں کے لِئے سب چِیزیں پاک ہیں مگر گُناہ آلُودہ اور بے اِیمان لوگوں کے لِئے کُچھ بھی پاک نہِیں بلکہ اُن کی عقل اور دِل دونو گُناہ آلُودہ ہیں۔ "},
	{16, "16  وہ خُدا کی پہچان کا دعویٰ تو کرتے ہیں مگر اپنے کاموں سے اُس کا اِنکار کرتے ہیں کِیُونکہ وہ مکرُوہ اور نافرمان ہیں اور کِسی نیک کام کے قابِل نہِیں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ur2 poems[] = {
	{1, "1  لیکِن تُو وہ باتیں بیان کر جو صحیح تعلِیم کے مُناسِب ہیں۔ "},
	{2, "2  یعنی یہ کہ بُوڑھے مرد پرہیزگار، سنجیدہ اور مُتّقی ہوں اور اُن کا اِیمان اور محبّت اور صبر صحیح ہو۔ "},
	{3, "3  اِسی طرح بُوڑھی عَورتوں کی بھی وضع مُقدّسوں کی سی ہو۔ تہمت لگانے والی اور زِیادہ مَے پینے میں مُبتلا نہ ہوں بلکہ اچھّی باتیں سِکھانے والی ہوں۔ "},
	{4, "4  تاکہ جو اِن عَورتوں کو سِکھائیں کہ اپنے شوہروں کو پیار کریں بچّوں کو پیار کریں۔ "},
	{5, "5  اور مُتّقی اور پاکدامن اور گھر کا کاروبار کرنے والی اور مہربان ہوں اور اپنے اپنے شوہروں کے تابع رہیں تاکہ خُدا کا کلام بدنام نہ ہو۔ "},
	{6, "6  جوان آدمِیوں کو بھی اِسی طرح نصِیحت کر کے مُتّقی بنیں۔ "},
	{7, "7  سب باتوں میں اپنے آپ کو نیک کاموں کا نمُونہ بنا۔ تیری تعلِیم میں صفائی اور سنجیدگی۔ "},
	{8, "8  اور اَیسی صحت کلامی پائی جائے جو ملامت کے لائِق نہ ہو تاکہ مُخالِف ہم پر عَیب لگانے کی کوئی وجہ نہ پاکر شرمِندہ ہو جائیں۔ "},
	{9, "9  نَوکروں کو نصِیحت کر کہ اپنے مالِکوں کے تابِع رہیں اور سب باتوں میں اُنہِیں خُوش رکھّیں اور اُن کے حُکم سے کُچھ اِنکار نہ کریں۔ "},
	{10, "10  چوری چلاکی نہ کریں بلکہ ہر طرح کی دیانتداری اچھّی طرح ظاہِر کریں تاکہ اُن سے ہر بات میں ہمارے مُنّجی خُدا کی تعلِیم کو رَونق ہو۔ "},
	{11, "11  کِیُونکہ خُدا کا وہ فضل ظاہِر ہُؤا ہے جو سب آدمِیوں کی نِجات کا باعِث ہے۔ "},
	{12, "12  اور ہمیں تربِیت دیتا ہے کہ بے دِینی اور دُنیوی خواہِشوں کا اِنکار کر کے اِس موجُودہ جہان میں پرہیزگاری اور راستبازی اور دِینداری کے ساتھ زِندگی گُزاریں۔ "},
	{13, "13  اور اُس مُبارک اُمِید یعنی اپنے بزُرُگ خُدا اور مُنّجی یِسُوع مسِیح کے جلال کے ظاہِر ہونے کے مُنتظِر رہیں۔ "},
	{14, "14  جِس نے اپنے آپ کو ہمارے واسطے دے دِیا تاکہ فِدیہ ہوکر ہمیں ہر طرح کی بے دِینی سے چھُڑا لے اور پاک کر کے اپنی خاص مِلکِیت کے لِئے ایک اَیسی اُمّت بنائے جو نیک کاموں میں سرگرم ہو۔ "},
	{15, "15  پُورے اِختیّار کے ساتھ یہ باتیں کہہ اور نصِیحت دے اور ملامت کر۔ کوئی تیری حقارت نہ کرنے پائے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ur3 poems[] = {
	{1, "1  اُن کو یاد دِلا کہ حاکِموں اور اِختیّار والوں کے تابِع رہیں اور اُن کا حُکم مانیں اور ہر نیک کام کے لِئے مُستعِد رہیں۔ "},
	{2, "2  کِسی کی بدگوئی نہ کریں۔ تکراری نہ ہوں بلکہ نرم مِزاج ہوں اور سب آدمِیوں کے ساتھ کمال حلیمی سے پیش آئیں۔ "},
	{3, "3  کِیُونکہ ہم بھی پہلے نادان۔ نافرمان۔ فریب کھانے والے اور رنگ برنگ کی خواہِشوں اور عیش و عِشرت کے بندے تھے اور بد خواہی اور حسد میں زِندگی گُزارتے تھے۔ نفرت کے قائِل تھے اور آپس میں کِینہ رکھتے تھے۔ "},
	{4, "4  مگر جب ہمارے مُنّجی خُدا کی مہربانی اور اِنسان کے ساتھ اُس کی اُلفت ظاہِر ہُوئی۔ "},
	{5, "5  تو اُس نے ہم کو نِجات دی مگر راستبازی کے کاموں کے سبب سے نہِیں جو ہم نے خُود کئے بلکہ اپنی رحمت کے مُطابِق نئی پَیدایش کے غُسل اور رُوحُ القدُس کے ہمیں نیا بنانے کے وسِیلہ سے۔ "},
	{6, "6  جِسے اُس نے ہمارے مُنّجی یِسُوع مسِیح کی معرفت ہم پر اِفراط سے نازِل کِیا۔ "},
	{7, "7  تاکہ ہم اُس کے فضل سے راستباز ٹھہر کر ہمیشہ کی زِندگی کی اُمِید کے مُطابِق وارِث بنیں۔ "},
	{8, "8  یہ بات سَچ ہے اور مَیں چاہتا ہُوں کہ تُو اِن باتوں کا یقِینی طور سے دعویٰ کرے تاکہ جِنہوں نے خُدا کا یقِین کِیا ہے وہ اچھّے کاموں میں لگے رہنے کا خیال رکھّیں۔ یہ باتیں بھلی اور آدمِیوں کے واسطے فائِدہ مند ہیں۔ "},
	{9, "9  مگر بیوُقُوفی کی حُجّتوں اور نسب ناموں اور جھگڑوں اور اُن لڑائِیوں سے جو شَرِیعَت کی بابت ہوں پرہیز کر۔ اِس لِئے کہ یہ لاحاصِل اور بے فائِدہ ہیں۔ "},
	{10, "10  ایک دو بار نصِیحت کر کے بِدعتی شَخص سے کِنارہ کر۔ "},
	{11, "11  یہ جان کر کہ اَیسا شَخص برگشتہ ہوگیا ہے اور اپنے آپ کو مُجرِم ٹھہرا کر گُناہ کرتا رہتا ہے۔ "},
	{12, "12  جب مَیں تیرے پاس اَرتماس یا تخِکُس کو بھیجُوں تو میرے پاس نِیکُپلس آنے کی کوشِش کرنا کِیُونکہ مَیں نے وہِیں جاڑا کاٹنے کا قصد کر لِیا ہے۔ "},
	{13, "13  زِیناس عالمِ شرع اور اُپلّوس کو کوشِش کر کے روانہ کر دے۔ اِس طَور پر کہ اُن کو کِسی چِیز کی حاجت نہ رہے۔ "},
	{14, "14  اور ہمارے لوگ بھی ضرُورتوں کو رفع کرنے کے لِئے اچھّے کاموں میں لگے رہنا سِکھیں تاکہ بے پھَل نہ رہیں۔ "},
	{15, "15  میرے سب ساتھی تُجھے سَلام کہتے ہیں جو اِیمان کے رُو سے ہمیں عزِیز رکھتے ہیں اُن سے سَلام کہہ۔ تُم سب پر فضل ہوتا رہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};