#include <map>
#include <string>
class Bible50
{
	struct ur1	{ int val; const char *msg; };
	struct ur2	{ int val; const char *msg; };
	struct ur3	{ int val; const char *msg; };
	struct ur4	{ int val; const char *msg; };
public:
static void view1() {
struct ur1 poems[] = {
	{1, "1  مسِیح یِسُوع کے بندوں پَولُس اور تِمُتھِیُس کی طرف سے فِلپّی کے سب مُقدّسوں کے نام جو مسِیح یِسُوع میں ہیں نِگہبانوں اور خادِموں سمیت۔ "},
	{2, "2  ہمارے باپ خُدا اور خُداوند یِسُوع مسِیح کی طرف سے تُمہیں فضل اور اِطمینان حاصِل ہوتا رہے۔ "},
	{3, "3  مَیں جب کبھی تُمہیں یاد کرتا ہُوں تو اپنے خُدا کا شُکر بجا لاتا ہُوں۔ "},
	{4, "4  اور ہر ایک دُعا میں جو تُمہارے لِئے کرتا ہُوں ہمیشہ خُوشی کے ساتھ تُم سب کے لِئے دَرخواست کرتا ہُوں۔ "},
	{5, "5  اِس لِئے کہ تُم اوّل روز سے لے کر آج تک خُوشخَبری کے پھَیلانے میں شرِیک رہے ہو۔ "},
	{6, "6  اور مُجھے اِس بات کا بھروسا ہے کہ جِس نے تُم میں نیک کام شُرُوع کِیا ہے وہ اُسے یِسُوع مسِیح کے دِن تک پُورا کر دے گا۔ "},
	{7, "7  چُنانچہ واجِب ہے کہ مَیں تُم سب کی بابت اَیسا ہی خیال کرُوں کِیُونکہ تُم میرے دِل میں رہتے ہو اور میری قَید اور خُوشخَبری کی جوابدہی اور ثبُوت میں تُم سب میرے ساتھ فضل میں شرِیک ہو۔ "},
	{8, "8  خُدا میرا گواہ ہے کہ مَیں مسِیح یِسُوع کی سی اُلفت کر کے تُم سب کا مُشتاق ہُوں۔ "},
	{9, "9  اور یہ دُعا کرتا ہُوں کہ تُمہاری محبّت عِلم اور ہر طرح کی تمِیز کے ساتھ اَور بھی زِیادہ ہوتی جائے۔ "},
	{10, "10  تاکہ عُمدہ عُمدہ باتوں کو پسند کر سکو اور مسِیح کے دِن تک صاف دِل رہو اور ٹھوکر نہ کھاؤ۔ "},
	{11, "11  اور راستبازی کی پھَل سے جو یِسُوع مسِیح کے سبب سے ہے بھرے رہو تاکہ خُدا کا جلال ظاہِر ہو اور اُس کی سِتایش کی جائے۔ "},
	{12, "12  اور اَے بھائِیو! مَیں چاہتا ہُوں تُم جان لو کہ جو مُجھ پر گُذرا وہ خُوشخَبری کی ترقّی ہی کا باعِث ہُؤا۔ "},
	{13, "13  یہاں تک کہ قَیصری سِپاہیوں کی ساری پلٹن اور باقی سب لوگوں میں مشہُور ہو گیا کہ مَیں مسِیح کے واسطے قَید ہُوں۔ "},
	{14, "14  اور جو خُداوند میں بھائِی ہیں اُن میں سے اکثر میرے قَید ہونے کے سبب سے دِلیر ہو کر بے خَوف خُدا کا کلام سُنانے کی زِیادہ جُرأت کرتے ہیں۔ "},
	{15, "15  بعض تو حسد اور جھگڑے کی وجہ سے مسِیح کی منادی کرتے ہیں اور بعض نیک نِیّتی سے۔ "},
	{16, "16  ایک تو محبّت کی وجہ سے یہ جان کر مسِیح کی منادی کرتے ہیں کہ مَیں خُوشخَبری کی جواب دِہی کے واسطے مُقرّر ہُوں۔ "},
	{17, "17  مگر دُوسرے تفرقہ کی وجہ سے نہ کہ صاف دِلی سے بلکہ اِس خیال سے کہ میری قَید میں میرے لِئے مُصِیبت پَیدا کریں۔ "},
	{18, "18  پَس کیا ہُؤا؟ صِرف یہ کہ ہر طرح سے مسِیح کی منادی ہوتی ہے خواہ بہانے سے ہو خواہ سَچّائی سے اور اِس سے مَیں خُوش ہُوں اور رہُوں گا بھی۔ "},
	{19, "19  کِیُونکہ مَیں جانتا ہُوں کہ تُمہاری دُعا اور یِسُوع مسِیح کے رُوح کے اِنعام سے اِس کا انجام میری نِجات ہو گا۔ "},
	{20, "20  چُنانچہ میری دِلی آرزُو اور اُمِید یہی ہے کہ مَیں کِسی بات پر شرمِندہ نہ ہُوں بلکہ میری کمال دِلیری کے باعِث جِس طرح مسِیح کی تعظیم میرے بَدَن کے سبب سے ہمیشہ ہوتی رہی ہے اُسی طرح اَب بھی ہو گی خواہ مَیں زِندہ رہُوں خواہ مرُوں۔ "},
	{21, "21  کِیُونکہ زِندہ رہنا میرے لِئے مسِیح ہے اور مرنا نفع۔ "},
	{22, "22  لیکِن اگر میرا جِسم میں زِندہ رہنا ہی میرے کام کے لِئے مُفید ہے تو مَیں نہِیں جانتا کہ کِسے پسند کرُوں۔ "},
	{23, "23  مَیں دونوں طرف پھَنسا ہُؤا ہُوں۔ میرا جی تو یہ چاہتا ہے کہ کُوچ کر کے مسِیح کے پاس جا رہُوں کِیُونکہ یہ بہُت ہی بہُتر ہے۔ "},
	{24, "24  مگر جِسم میں رہنا تُمہاری خاطِر زِیادہ ضرُوری ہے۔ "},
	{25, "25  اور چُونکہ مُجھے اِس کا یقِین ہے اِس لِئے مَیں جانتا ہُوں کہ زِندہ رہُوں گا بلکہ تُم سب کے ساتھ رہُوں گا تاکہ تُم اِیمان میں ترقّی کرو اور اُس میں خُوش رہو۔ "},
	{26, "26  اور جو تُمہیں مُجھ پر فخر ہے وہ میرے پھِر تُمہارے پاس آنے سے مسِیح یِسُوع میں زِیادہ ہو جائے۔ "},
	{27, "27  صِرف یہ کرو کہ تُمہارا چال چلن مسِیح کی خُوشخَبری کے مُوافِق رہے تاکہ خواہ مَیں آؤُں اور تُمہیں دیکھُوں خواہ نہ آؤُں تُمہارا حال سُنُوں کہ تُم ایک رُوح میں قائِم ہو اور اِنجِیل کے اِیمان کے لِئے ایک جان ہو کر جانفشانی کرتے ہو۔ "},
	{28, "28  اور کِسی بات میں مُخالِفوں سے دہشت نہِیں کھاتے یہ اُن کے لِئے ہلاکت کا صاف نِشان ہے لیکِن تُمہاری نِجات کا اور یہ خُدا کی طرف سے ہے۔ "},
	{29, "29  کِیُونکہ مسِیح کی خاطِر تُم پر یہ فضل ہُؤا کہ نہ فقط اُس پر اِیمان لاؤ بلکہ اُس کی خاطِر دُکھ بھی سہو۔ "},
	{30, "30  اور تُم اُسی طرح جانفشانی کرتے ہو جِس طرح مُجھے کرتے دیکھا تھا اور اَب بھی سُنتے ہو کہ مَیں وَیسی ہی کرتا ہُوں۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ur2 poems[] = {
	{1, "1  پَس اگر کُچھ تسلّی مسِیح میں اور محبّت کی دِلجمعی اور رُوح کی شِراکت اور رحمدِلی و دردمندی ہے۔ "},
	{2, "2  تو میری یہ خُوشی پُوری کرو کہ یک دِل رہو۔ یکساں محبّت رکھّو۔ ایک جان ہو۔ ایک ہی خیال رکھّو۔ "},
	{3, "3  تفرقے اور بیجا فخر کے باعِث کُچھ نہ کرو بلکہ فروتنی سے ایک دُوسرے کو اپنے سے بہُتر سَمَجھے۔ "},
	{4, "4  ہر ایک اپنے ہی احوال پر نہِیں بلکہ ہر ایک دُوسروں کے احوال پر بھی نظر رکھّے۔ "},
	{5, "5  وَیسا ہی مِزاج رکھّو جَیسا مسِیح یِسُوع کا تھا۔ "},
	{6, "6  اُس نے اگرچہ خُدا کی صُورت پر تھا خُدا کے برابر ہونے کو قبضہ میں رکھنے کی چِیز نہ سَمَجھا۔ "},
	{7, "7  بلکہ اپنے آپ کو خالی کر دِیا اور خادِم کی صُورت اِختیّار کی اور اِنسانوں کے مُشابہ ہوگیا۔ "},
	{8, "8  اور اِنسانی شکل میں ظاہِر ہوکر اپنے آپ کو پَس کر دِیا اور یہاں تک فرمانبردار رہا کہ مَوت بلکہ صلِیبی مَوت گوارا کی۔ "},
	{9, "9  اِسی واسطے خُدا نے بھی اُسے بہُت سر بُلند کِیا اور اُسے وہ نام بخشا جو سب ناموں سے اعلٰی ہے۔ "},
	{10, "10  تاکہ یِسُوع کے نام پر ہر ایک گھُٹنا ٹِکے۔ خواہ آسمانِیوں کا ہو خواہ زمِینیوں کا۔ خواہ اُن کا جو زمِین کے نِیچے ہیں۔ "},
	{11, "11  اور خُدا باپ کے جلال کے لِئے ہر ایک زبان اِقرار کرے کہ یِسُوع مسِیح خُداوند ہے۔ "},
	{12, "12  پَس اَے میرے عزِیزو! جِس طرح تُم ہمیشہ سے فرمانبرداری کرتے آئے ہو اُسی طرح اَب بھی نہ صِرف میری حاضری میں بلکہ اِس سے بہُت زِیادہ میری غَیرحاضری میں ڈرتے اور کانپتے ہُوئے اپنی نِجات کا کام کِئے جاؤ۔ "},
	{13, "13  کِیُونکہ جو تُم میں نِیّت اور عمل دونوں کو اپنے نیک اِرادہ کو انجام دینے کے لِئے پَیدا کرتا ہے وہ خُدا ہے۔ "},
	{14, "14  سب کام شِکایت اور تکرار بغَیر کِیا کرو۔ "},
	{15, "15  تاکہ تُم بے عَیب اور بھولے ہوکر ٹیڑھے اور کجرَو لوگوں میں خُدا کے بے نقص فرزند بنے رہو (جِن کے درمِیان تُم دُنیا میں چراغوں کی طرح دِکھائی دیتے ہو۔ "},
	{16, "16  اور زِندگی کا کلام پیش کرتے ہو) تاکہ مسِیح کے دِن مُجھے فخر ہو کہ نہ میری دَوڑ دھُوپ بے فائِدہ ہُوئی نہ میری محنت اکارت گئی۔ "},
	{17, "17  اور اگر مُجھے تُمہارے اِیمان کی قُربانی اور خِدمت کے ساتھ اپنا خُون بھی بہانا پڑے تَو بھی خُوش ہُوں اور تُم سب کے ساتھ خُوشی کرتا ہُوں۔ "},
	{18, "18  تُم بھی اِسی طرح خُوش ہو اور میرے ساتھ خُوشی کرو۔ "},
	{19, "19  مُجھے خُداوند یِسُوع میں اُمِید ہے کہ تِیمُتھِیُس کو تُمہارے پاس جلد بھیجُوں گا تاکہ تُمہارا احوال دریافت کر کے میری بھی خاطِر جمع ہو۔ "},
	{20, "20  کِیُونکہ کوئی اَیسا ہم خیال میرے پاس نہِیں جو صاف دِلی سے تُمہارے لِئے فِکرمند ہو۔ "},
	{21, "21  سب اپنی اپنی باتوں کی فِکر میں ہیں نہ کہ یِسُوع مسِیح کی۔ "},
	{22, "22  لیکِن تُم اُس کی پُختگی سے واقِف ہو کہ جَیسے بَیٹا باپ کی خِدمت کرتا ہے اَیسے ہی اُس نے میرے ساتھ خُوشخَبری پھَیلانے میں خِدمت کی۔ "},
	{23, "23  پَس مَیں اُمِید کرتا ہُوں کہ جب اپنے حال کا انجام معلُوم کر لُوں گا تو اُسے فوراً بھیج دُوں گا۔ "},
	{24, "24  اور مُجھے خُداوند پر بھروسا ہے کہ مَیں آپ بھی جلد آؤں گا۔ "},
	{25, "25  لیکِن مَیں نے اِپفُردِتُس کو تُمہارے پاس بھیجنا ضرُور سَمَجھا۔ وہ میرا بھائِی اور ہم خِدمت اور ہم سِپاہ اور تُمہارا قاصِد اور میری حاجت رفع کرنے کے لِئے خادِم ہے۔ "},
	{26, "26  کِیُونکہ وہ تُم سب کو بہُت مُشتاق تھا اور اِس واسطے بےقرار رہتا تھا کہ تُم نے اُس کی بِیماری کا حال سُنا تھا۔ "},
	{27, "27  بیشک وہ بِیماری سے مرنے کو تھا مگر خُدا نے اُس پر رحم کِیا اور فقط اُس ہی پر نہِیں بلکہ مُجھ پر بھی تاکہ مُجھے غم پر غم نہ ہو۔ "},
	{28, "28  اِس لِئے مُجھے اُس کے بھیجنے کا اَور بھی زِیادہ خیال ہُؤا کہ تُم بھی اُس کی مُلاقات سے پھِر خُوش ہو جاؤ اور میرا بھی غم گھٹ جائے۔ "},
	{29, "29  پَس تُم اُس سے خُداوند میں کمال خُوشی کے ساتھ مِلنا اور اَیسے شَخصوں کی عِزّت کِیا کرو۔ "},
	{30, "30  اِس لِئے کہ وہ مسِیح کے کام کی خاطِر مرنے کے قرِیب ہو گیا تھا اور اُس نے جان لگا دی تاکہ جو کمی تُمہاری طرف سے میری خِدمت میں ہُوئی اُسے پُورا کرے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ur3 poems[] = {
	{1, "1  غرض میرے بھائِیو! خُداوند میں خُوش رہو۔ تُمہیں ایک ہی بات بار بار لِکھنے میں مُجھے تو کُچھ دِقّت نہِیں اور تُمہاری اِس میں حِفاظت ہے۔ "},
	{2, "2  کُتّوں سے خَبردار رہو۔ بدکاروں سے خَبردار رہو۔ کٹوانے والوں سے خَبردار رہو۔ "},
	{3, "3  کِیُونکہ مختُون تو ہم ہیں جو خُدا کے رُوح کی ہِدایت سے عِبادت کرتے ہیں اور مسِیح یِسُوع پر فخر کرتے ہیں اور جِسم کا بھروسا نہِیں کرتے۔ "},
	{4, "4  گو مَیں تو جِسم کا بھی بھروسا کر سکتا ہُوں اگر کِسی اور کو جِسم پر بھروسا کرنے کا خیال ہو تو مَیں اُس سے بھی زِیادہ کر سکتا ہُوں۔ "},
	{5, "5  آٹھویں دِن میرا ختنہ ہُؤا۔ اِسرائیل کی قَوم اور بِنیمین کے قبِیلہ کا ہُوں۔ عِبرانیوں کا عِبرانی۔ شَرِیعَت کے اعتبار سے فرِیسی ہُوں۔ "},
	{6, "6  جوش کے اعتبار سے کلِیسیا کا ستانے والا۔ شَرِیعَت کی راستبازی کے اعتبار سے بے عَیب تھا۔ "},
	{7, "7  لیکِن جِتنی چِیزیں میرے نفع کی تھِیں اُن ہی کو مَیں نے مسِیح کی خاطِر نُقصان سَمَجھ لِیا ہے۔ "},
	{8, "8  بلکہ مَیں اپنے خُداوند مسِیح یِسُوع کی پہچان کی بڑی خُوبی کے سبب سے سب چِیزوں کو نُقصان سَمَجھتا ہُوں۔ جِس کی خاطِر مَیں نے سب چِیزوں کا نُقصان اُٹھایا اور اُن کو کُوڑا سَمَجھتا ہُوں تاکہ مسِیح کو حاصِل کرُوں۔ "},
	{9, "9  اور اُس میں پایا جاؤں نہ اپنی اُس راستبازی کے ساتھ جو شَرِیعَت کی طرف سے ہے بلکہ اُس راستبازی کے ساتھ جو مسِیح پر اِیمان لانے کے سبب سے ہے اور خُدا کی طرف سے اِیمان پر مِلتی ہے۔ "},
	{10, "10  اور مَیں اُس کو اور اُس کے جی اُٹھنے کی قُدرت کو اور اُس کے ساتھ دُکھوں میں شرِیک ہونے کو معلُوم کرُوں اور اُس کی مَوت سے مُشابہُت پَیدا کرُوں۔ "},
	{11, "11  تاکہ کِسی طرح مُردوں میں سے جی اُٹھنے کے درجہ تک پہُنچُوں۔ "},
	{12, "12  یہ غرض نہِیں کہ مَیں پا چُکا یا کامِل ہو چُکا ہُوں بلکہ اُس چِیز کے پکڑنے کے لِئے دَوڑا ہُؤا جاتا ہُوں جِس کے لِئے مسِیح یِسُوع نے مُجھے پکڑا تھا۔ "},
	{13, "13  اَے بھائِیو! میرا یہ گُمان نہِیں کہ پکڑ چُکا ہُوں بلکہ صِرف یہ کرتا ہُوں کہ جو چِیزیں پِیچھے رہ گئیں اُن کو بھول کر آگے کی چِیزوں کی طرف بڑھا ہُؤا۔ "},
	{14, "14  نِشان کی طرف دَوڑا ہُؤا جاتا ہُوں تاکہ اُس اِنعام کو حاصِل کرُوں جِس کے لِئے خُدا نے مُجھے مسِیح یِسُوع میں اُوپر بُلایا ہے۔ "},
	{15, "15  پَس ہم میں سے جِتنے کامِل ہیں یہی خیال رکھّیں اور اگر کِسی بات میں تُمہارا اَور طرح کا خیال ہو تو خُدا اُس بات کو بھی تُم پر ظاہِر کر دے گا۔ "},
	{16, "16  بہرحال جہاں تک ہم پہُنچے ہیں اُسی کے مُطابِق چلیں۔ "},
	{17, "17  اَے بھائِیو! تُم سب مِل کر میری مانِند بنو اور اُن لوگوں کو پہچان رکھّو جو اِس طرح چلتے ہیں جِس کا نمُونہ تُم ہم میں پاتے ہو۔ "},
	{18, "18  کِیُونکہ بہُتیرے اَیسے ہیں جِن کا ذِکر مَیں نے تُم سے بار ہا کِیا ہے اور اَب بھی رو رو کر کہتا ہُوں کہ وہ اپنے چال چلن سے مسِیح کی صلِیب کے دُشمن ہیں۔ "},
	{19, "19  اُن کا انجام ہلاکت ہے۔ اُن کا خُدا پیٹ ہے وہ اپنی شرم کی باتوں پر فخر کرتے ہیں اور دُنیا کی چِیزوں کے خیال میں رہتے ہیں۔ "},
	{20, "20  مگر ہمارا وطن آسمان پر ہے اور ہم ایک مُنّجی یعنی خُداوند یِسُوع مسِیح کے وہاں سے آنے کے اِنتظار میں ہیں۔ "},
	{21, "21  وہ اپنی اُس قُوّت کی تاثِیر کے مُوافِق جِس سے سب چِیزیں اپنے تابِع کر سکتا ہے ہماری پست حالی کے بَدَن کی شکل بدل کر اپنے جلال کے بَدَن کی صُورت پر بنائے گا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ur4 poems[] = {
	{1, "1  اِس واسطے اَے میرے پیارے بھائِیو! جِن کا مَیں مُشتاق ہُوں جو میری خُوشی اور تاج ہو۔ اَے پیارو! خُداوند میں اِسی طرح قائِم رہو۔ "},
	{2, "2  مَیں یُوؤدیہ کو بھی نصِیحت کرتا ہُوں سُنتُخے کو بھی کہ وہ خُداوند میں یکدِل رہیں۔ "},
	{3, "3  اور اَے سَچّے ہم خِدمت! تُجھ سے بھی دَرخواست کرتا ہُوں کہ تُو اُن عَورتوں کی مدد کر کِیُونکہ اُنہوں نے میرے ساتھ خُوشخَبری پھَیلانے میں کلیمینس اور میرے اُن باقی ہم خِدمتوں سمیت جانفشانی کی جِن کے نام کِتابِ حیات میں درج ہیں۔ "},
	{4, "4  خُداوند میں ہر وقت خُوش رہو۔ پھِر کہتا ہُوں کہ خُوش رہو۔ "},
	{5, "5  تُمہاری نرم مِزاجی سب آدمِیوں پر ظاہِر ہو۔ خُداوند قرِیب ہے۔ "},
	{6, "6  کِسی بات کی فِکر نہ کرو بلکہ ہر ایک بات میں تُمہاری دَرخواستیں دُعا اور مِنّت کے وسِیلہ سے شُکرگُذاری کے ساتھ خُدا کے سامنے پیش کی جائیں۔ "},
	{7, "7  تو خُدا کا اِطمینان جو سَمَجھ سے بِالکُل باہِر ہے تُمہارے دِلوں اور خیالوں کو مسِیح یِسُوع میں محفُوظ رکھّے گا۔ "},
	{8, "8  غرض اَے بھائِیو! جِتنی باتیں سَچ ہیں اور جِتنی باتیں شرافت کی ہیں اور جِتنی باتیں واجِب ہیں اور جِتنی باتیں پاک ہیں اور جِتنی باتیں پسندِیدہ ہیں اور جِتنی باتیں دِلکش ہیں غرض جو نیکی اور تعرِیف کی باتیں ہیں اُن پر غَور کِیا کرو۔ "},
	{9, "9  جو باتیں تُم نے مُجھ سے سِیکھیں اور حاصِل کِیں اور سُنِیں اور مُجھ میں دیکھِیں اُن پر عمل کِیا کرو تو خُدا جو اِطمینان کا چشمہ ہے تُمہارے ساتھ رہے گا۔ "},
	{10, "10  مَیں خُداوند میں بہُت خُوش ہُوں کہ اَب اِتنی مُدّت کے بعد تُمہارا خیال میرے لِئے سرسبز ہُؤا۔ بیشک تُمہیں پہلے بھی اِس کا خیال تھا مگر مَوقع نہ مِلا۔ "},
	{11, "11  یہ نہِیں کہ مَیں مُحتاجی کے لِحاظ سے کہتا ہُوں کِیُونکہ مَیں نے یہ سِیکھا ہے کہ جِس حالت میں ہُوں اُسی میں راضی رہُوں۔ "},
	{12, "12  مَیں پست ہونا بھی جانتا ہُوں اور بڑھنا بھی جانتا ہُوں۔ ہر ایک بات اور سب حالتوں میں مَیں نے سیر ہونا بھُوکا رہنا اور بڑھنا گھٹنا سِیکھا ہے۔ "},
	{13, "13  جو مُجھے طاقت بخشتا ہے اُس میں مَیں سب کُچھ کر سکتا ہُوں۔ "},
	{14, "14  تَو بھی تُم نے اچھّا کِیا جو میری مُصِیبت میں شرِیک ہُوئے۔ "},
	{15, "15  اور اَے فِلِپّیو! تُم خُود بھی جانتے ہو کہ خُوشخَبری کے شُرُوع میں جب مَیں مکِدُنیہ سے روانہ ہُؤا تو تُمہارے سِوا کِسی کلِیسیا نے لینے دینے کے مُعاملہ میں میری مدد نہ کی۔ "},
	{16, "16  چُنانچہ تھِسّلُنیکے میں بھی میری اِحتیاج رفع کرنے کے لِئے تُم نے ایک دفعہ نہِیں بلکہ دو دفعہ کُچھ بھیجا تھا۔ "},
	{17, "17  یہ نہِیں کہ مَیں اِنعام چاہتا ہُوں بلکہ اَیسا پھَل چاہتا ہُوں جو تُمہارے حِساب میں زِیادہ ہو جائے۔ "},
	{18, "18  میرے پاس سب کُچھ ہے بلکہ افراط سے ہے۔ تُمہاری بھیجی ہُوئی چِیزیں اِپفُردِتُس کے ہاتھ سے لے کر مَیں آسُودہ ہو گیا ہُوں وہ خُوشبُو اور مقبُول قُربانی ہیں جو خُدا کو پسندِیدہ ہے۔ "},
	{19, "19  میرا خُدا اپنی دَولت کے مُوافِق جلال سے مسِیح یِسُوع میں تُمہاری ہر ایک اِحتیاج رفع کرے گا۔ "},
	{20, "20  ہمارے خُدا اور باپ کی ابدُالآباد تمجِید ہوتی رہے۔ آمِین۔ "},
	{21, "21  ہر ایک مُقدّس سے جو مسِیح یِسُوع میں ہے سَلام کہو۔ جو بھائِی میرے ساتھ ہیں تُمہیں سَلام کہتے ہیں۔ "},
	{22, "22  سب مُقدّس خصُوصاً قیصر کے گھر والے تُمہیں سَلام کہتے ہیں۔ "},
	{23, "23  خُداوند یِسُوع مسِیح کا فضل تُمہاری رُوح کے ساتھ رہے۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};