#include <map>
#include <string>
class Bible17
{
	struct ur1	{ int val; const char *msg; };
	struct ur2	{ int val; const char *msg; };
	struct ur3	{ int val; const char *msg; };
	struct ur4	{ int val; const char *msg; };
	struct ur5	{ int val; const char *msg; };
	struct ur6	{ int val; const char *msg; };
	struct ur7	{ int val; const char *msg; };
	struct ur8	{ int val; const char *msg; };
	struct ur9	{ int val; const char *msg; };
	struct ur10	{ int val; const char *msg; };
public:
static void view1() {
struct ur1 poems[] = {
	{1, "1  اخسویرس کے دنوں میں ایسا ہوا(یہ وہی اخسویرس ہے جو ہندوستان سے کوش تک ایک سو ستائیں صبوں پر سلطنت کرتا تھا) "},
	{2, "2  کہ ان دنوں میںجب اخسویرس بادشاہ اپنے تخت سلطنت پر جو قصر سوسن میں تھا بیٹھا۔ "},
	{3, "3  تو اس نے اپنی سلطنت کے تیسرے سال اپنے سب حاکموں اور خادموں کی ضیافت کی اور فارس اور مادی کی طاقت اور صوبوں کے امراور سردار اسکے حضور حاضر تھے۔ "},
	{4, "4  تب وہ بہت دن یعنی ایک سو اسی دن تک اپنی جلیل اقدر سلطنت کی دولت اور اپنی اعلی عظمت کی شان انکو دکھاتا رہا۔ "},
	{5, "5  جب یہ دن گذر گئے تو بادشاہ نے سب لوگوں کی کیابڑے کیاچھوٹے جو قصر سوسن موجود تھے شاہی محل کے باغ کے صحن میں سات دن ضیافت کی۔ "},
	{6, "6  وہاں سفید اور سبز اور آسمانی رنگ کے پردے تھے جو کتانی اور ارغوانی ڈوریوں سے چاندی کے حلقوں اور سنگ مرمرکے ستونوں سے بندھے تھے اور سرخ اور سفید اور زرد اور سیاہ سنگ مرمر کے فرش پر سونے اور چاندی کے تخت تھے۔ "},
	{7, "7  اور انہوں نے انکو سونے کے پیالوں میں جو مختلف شکلوں کے تھے پینے کو دیا بادشاہی مے بادشاہ کے کرم کے موافق کثرت سے پلائی۔ "},
	{8, "8  اور مے نوشی اس قاعدہ سے تھی کہ کوئی مجبور نہیں کر سکتا تھا کیونکہ بادشاہ نے اپنے محل کے سب عہدہ داروں کو تاکید فرمائی تھی کہ وہ ہر شخص کی مرضی کے مطابق کریں۔ "},
	{9, "9  اور دشتی ملکہ نے بھی اخسویرس بادشاہ کے شاہی محل میں عورتوں کی ضیافت کی۔ "},
	{10, "10  ساتویں دن جب بادشاہ کادل مے سے مسرور تھا تو اس نے ساتویں خواجہ سراؤں یعنی مہوبان اور بزتا اور خربوماہ اور بگتا اور ابگتا اور زتار اور کرکس کو جو اخسویرس بادشاہ کے حضور خدمت کرتے تھے حکم دیا۔ "},
	{11, "11  کہ وشتی ملکہ کو شاہی تاج پہنا کر بادشاہ کے حضور لائیں تاکہ اسکا جمال لوگوں اور امرا کو دکھائے کیونکہ وہ دیکھنے میں خبصورت تھی۔ "},
	{12, "12  لیکن وشتی ملکہ نے شاہی حکم پر جو خواجہ سراؤں کی معرفت ملا تھا آنے سے انکار کیا۔سو بادشاہ بہت جھلایا اور دل ہی دل میں اسکا غضب بھڑکا۔ "},
	{13, "13  تب بادشاہ نے ان دانشمندوں سے جنکو وقتوں کا امتیاز تھا پوچھا (کیونکہ بادشاہ کا دستور سب قانون دانوں اور دعل شناسوں کے ساتھ ایسا ہی تھا۔ "},
	{14, "14  اور فارس اور مادی کے ساتویں امیر یعنی کارشینا اور ستاراور ادماتا اور ترسیس اور مرس اور مرسنا اور مموکان اسکے مقرب تھے جو بادشاہ کا دیدار حاصل کرتے اور مملکت میں صدر نشین تھے۔ "},
	{15, "15  کہ قانون کے مطابق وشتی ملکہ سے کیا کرنا چاہیے کیونکہ اس نے اخسویرس بادشاہ کا حکم جو خواجہ سراؤں کی معرفت ملا نہیں مانا ہے؟۔ "},
	{16, "16  اور مموکان نے بادشاہ اور امیروں کے حضور جواب دیا کہ سشتی ملکہ نے فقط بادشاہی کا نہیں بلکہ سب امرا اور سب لوگوں کا بھی اخسویرس بادشاہ کے کل صبوں میں ہیں قصور کیا ہے۔ "},
	{17, "17  کیونکہ ملکہ کی یہ بات باہر سب عورتوں تک پہنچگی جس سے انکے شوہر انکی نظر میں ذلیل ہو جائینگے جب یہ خبر پھیلیگی کہ اخسویرس بادشاہ نے حکم دیا کہ وشتی ملکہ اسکے حضور لائی جائے پر وہ نہ آئی۔ "},
	{18, "18  اور آج کے دن فاس اور مادی کی سب بیگمیں جو ملکہ کی بات سن چکی ہیں بادشاہ کے سب امرا سے ایسا ہی کہنے لگینگی ۔یوں بہت حقارت اور طیش پیدا ہوگا۔ "},
	{19, "19  اگر بادشاہ کو منظور ہو تو اسکی طرف سےشاہی فرمان نکلے اور وہ فارسیوں اور مادیوں کے آئین میں مندرج ہو تاکہ بدلا نہ جائے کہ وشتی اخسوریرس بادشاہ کے حضور پھر کبھی نہ آئے اور بادشاہ اسکا شاہانہ رتبہ کسی اور کو جو اس سے بہتر ہے عنایت کرے۔ "},
	{20, "20  اور جب بادشاہ کا فرمان جسے وہ صادر کریگا اسکی ساری سلطنت میں (جو بڑی ہے) شہرت پائیگا تو سب بیویاں اپنے اپنے شوہر کی کیا بڑا کیا چھوٹا عزت کرینگی۔ "},
	{21, "21  یہ بات بادشاہ اور امرا کو پسند آئی اور بادشاہ نے مموکان کے کہنے کے مطابق کیا۔۔ "},
	{22, "22  کیونکہ اس نے سب شاہی صوبوں میں صوبہ صوبہ کے حروف اور قوم قوم کی بولی کے مطابق خط بھیجدئے کہ ہر مرد اپنے گھر میں حکومت کرے اور اپنی قوم کی زبان میں اسکا چرچا کرے۔( "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct ur2 poems[] = {
	{1, "1  ان باتوں کے بعد جب اخسویرس بادشاہ کا غضب ٹھنڈا ہوا تو اس نے وشتی کو اور جو کچھ اس نے کیا تھا اور جو کچھ اسکے خلاف حکم ہوا تھا یاد کیا۔ "},
	{2, "2  تب بادشاہ کے ملازم جو اسکی خدمت کرتے تھے کہنے لگے کہ بادشاہ کے لئے جوان خوبصورت کنواریاں ڈھونڈی جائیں۔ "},
	{3, "3  اور بادشاہ اپنی مملکت کے سب صوبوں میں منصبداروں کو مقرر کرے تاکہ وہ سب جوان خوبصورت کنواریوں کو قصر سوسن کے بیچ حرم سرامیں اکٹھا کرکے بادشاہ کے خواجہ سراہیجا کے سپرد کریں جو عورتوں کا محافظ ہے اور طہارت کے لئے انکا سامان انکو دیا جائے۔ "},
	{4, "4  اور جو کنواری بادشاہ کو پسند ہو وہ وشتی کی جگہ ملکہ ہو۔یہ بات بادشاہ کو پسند آئی اور اس نے ایسا ہی کیا۔ "},
	{5, "5  اور قصر سوسن میں ایک یہودی تھا جسکا نام مردکی تھا جو یائربن سمعی بن قیس کا بیٹا تھا جو بنیمینی تھا۔ "},
	{6, "6  اور یروشلم سے ان اسیروں کے ساتھ گیا تھا جو شاہ یہوداہ یکونیاہ کے ساتھ اسیری میں گئے تھے جنکو شاہ بابل بنوکدنضر اسیر کرکے لے گیا تھا۔ "},
	{7, "7  اس نے اپنے چچا کی بیٹی بدساہ یعنی آستر کو پالا تھا کیونکہ اسکے ماں باپ نہ تھے اور وہ لڑکی حسین اور خوبصورت تھی اور جب اسکے ماں باپ مرگئے تو مردکی نے اسے اپنی بیٹی کر کے پالا۔ "},
	{8, "8  سو ایسا ہوا کہ جب بادشاہ کا حکم اور فرمان سننے میں آیا اور بہت سی کنواریاں قصر سوسن میں اکٹھی ہو کر ہیجا کے سپرد ہوئیں تو آستر بھی بادشاہ کے محل میں پہنچائی گئی اور عورتوں کے محافظہیجا کے سپرد ہوئی۔ "},
	{9, "9  اور وہ لڑکی اسے پسند آئی اور اس نے اس پر مہربانی کی اور فورأ اسے شاہی محل میں سے طہارت کے لئے اسکے سامان اور کھانے کے حصے اور ایسی سات سہیلیاں جو اسکے لائق تھیں اسے دیں اور اسے اور اسکی سہیلیوں کو حرم سرا کی سب سے اچھی جگہ میں لے جا کر رکھا۔ "},
	{10, "10  آستر نے نہ اپنی قوم نہ اپنا خاندان ظاہر کیا تھا کیونکہ مردکی نے اسے تاکید کردی تھی کہ نہ بتائے۔ "},
	{11, "11  اور مردکی ہر روز حرم سرا کے صحن کے آگے پھرتا تھا تاکہ دریافت کرے کہ آستر کیسی ہے اور اسکا کیا حال ہوگا۔ "},
	{12, "12  جب ایک ایک کنواری کی باری آئی کہ عورتوں کے دستور کے مطابق بارہ مہینے کی صفائی کے بعد اخسویرس بادشاہ کے پاس جائے(کیونکہ اتنے مرکا تیل لگانے میں اور چھ مہینے عظر اور عورتوں کی صفائی کی چیزوں کے لگانے میں) "},
	{13, "13  تب اس طرح سے وہ کنواری بادشاہ کے پاس جاتی تھی کہ جو کچھ وہ چاہتی کہ حرم سرا سے بادشاہ کے محل میں لے جائے وہ اسکو دیا جاتا تھا۔ "},
	{14, "14  شام کو وہ جاتی تھی اور صبح کو لوٹکر دوسرے حرم سرا میں بادشاہ کے خواجہ سرا شعشجز کے سپرد ہو جاتی تھی جو حرموں کا محافظ تھا۔وہ بادشاہ کےپاس پھر نہیں جاتی تھی مگر جب بادشاہ اسے چاہتا تب وہ نام لیکر بلائی جاتی تھی۔ "},
	{15, "15  جب مردکی کے چچا ابییل کی بیٹی آستر کی جسے مردکی نے انی بیٹی کرکے رکھا تھا بادشاہ کے پاس جانے کی باری آئی تو جو کچھ بادشاہ کے خواجہ سرا اور عورتوں کے محافظ ہیجا نے ٹھہرایا تھا اسکے سوا اس نے اور کچھ نہ مانگا اور آستر ان سب کی جنکی نگاہ اس پر پڑی منظور نظر ہوئی۔ "},
	{16, "16  سو آستر اخسویرس بادشاہ کے پاس اسکے شاہی میں اسکی سلطنت کے ساتویں سال کے دسویں مہینے میں جو طیبت مہینہ ہے پہنچائی گئی۔ "},
	{17, "17  اور بادشاہ نے آستر کو سب عورتوں سے زیادہ پیار کیا اور وہ اسکی نظر میں ان سب کنواریوں سے زیادہ عزیز اور پسندیدہ ٹھہری پس اس نے شاہی تاج اسکے سر پر رکھدیا اور وشتی کی جگہ اسے ملکہ بنایا۔ "},
	{18, "18  اور بادشاہ نے اپنے سب امرا اور ملازموں کے لئے ایک بڑی ضیافت یعنی آستر کی ضیافت کی اور صوبوں میں معافی کی اور شاہی کرم کے مطابق انعام بانٹے۔ "},
	{19, "19  اور جب کنواریاں دوسری بار اکٹھی کی گئیں تو مردکی بادشاہ کے پھاٹک پر بیٹھا تھا۔ "},
	{20, "20  اور آستر نے نہ تو اپنے خاندان اور نہ اپنی قوم کا پتا دیا تھا جیسا مردکی نے اسے تاکید کر دی تھی اسلئے کہ آستر مردکی کا حکم ایسا ہی مانتی تھی جیسا اس وقت جب وہ اسکے ہاں پرورش پارہی تھی۔ "},
	{21, "21  ان ہی دنوں جب مردکی بادشاہ کے پھاٹک پر بیٹھا کرتا تھا بادشاہ کے خواجہ سراؤں میں سے جو دروازہ پر پہرا دیتے تھے دو شخصوں یعنی بگتان اور ترش نے بگڑ کر چاہا کہ اخسویرس بادشاہ پر ہاتھ چلایئں۔ "},
	{22, "22  یہ بات مردکی کو معلوم ہوئی اور اس نے آستر ملکہ کو بتائی اور آستر نے مردکی کا نام لیکر بادشاہ کو خبر دی۔ "},
	{23, "23  جب اس معاملہ کی تحقیقات کی گئی اور وہ بات ثابت ہوئی تو وہ دونوں ایک درخت پر لٹکا دئے گئے اور یہ بادشاہ کے سامنے تواریخ کی کتاب میں لکھ لیا گیا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct ur3 poems[] = {
	{1, "1  ان باتوں کے بعد اخسویرس بادشاہ نے اجاجی ہمداتا کے بیٹے ہامان کو ممتاز اور سرفراز کیا اور اسکی کرسی کو سب امرا سے جو اسکے ساتھ تھے برتر کیا۔ "},
	{2, "2  اور بادشاہ کے سب ملازم جو بادشاہ کے پھاٹک پر تھے ہامان کے آگے جھک کر اسکی تعظیم کرتے تھے کیونکہ بادشاہ نے اسکے بارے میں ایسا ہی حکم کیا تھا پر مردکی نہ جھکتا نہ اسکی تعظیم کرتا تھا۔ "},
	{3, "3  تب بادشاہ کے ملازموں نے جو بادشاہ کے پھاٹک پر تھے مردکی سے کہا تو کیوں بادشاہ کے حکم کو توڑتا ہے؟۔ "},
	{4, "4  جب وہ اس سے روز کہتے رہے اور اس نے انکی نہ مانی تو انہوں نے ہامان کو بتا دیا تا کہ دیکھیں کہ مردکی کی بات چلیگی یا نہیں کیونکہ اس نے ان سے کہہ دیا تھا کہ میں یہودی ہوں۔ "},
	{5, "5  جب ہامان نے دیکھا کہ مردکی نہ جھکتا نہ میری تعظیم کرتا ہے تو ہامان غصہ سے بھر گیا۔ "},
	{6, "6  لیکن فقط مردکی ہی پر ہاتھ چلانا اپنی شان سے نیچے سمجھا کیونکہ انہوں نے اسے مردکی کی قوم بتادی تھی اسلئے ہامان نے چاہا کہ مردکی کی قوم یعنی سب یہودیوں جو جو اخسویرس کی پوری مملکت میں رہتے تھے ہلاک کرے۔ "},
	{7, "7  اور اخسویریں بادشاہ کی سلطنت کے بارھویں برس کے پہلے مہینے سے جو نیسان مہیہ ہے وہ روزبرروز اور ماہ بماہ بارھویں مہینے یعنی ادار کے مہینے تک ہامان کے سامنے پوری یعنی قرعہ ڈالتے رہے۔ "},
	{8, "8  اور ہامان نے اخسویرس بادشاہ سے عرض کی کہ حضور کی مملکت کے سب صوبوں میں ایک قوم سب قوموں کے درمیان پراگندہ اور پھیلی ہوئی ہے اسکے دستور ہر قو سے نرالے ہیں اور وہ بادشاہ کے قوانین نہیں مانتے ہیں۔ سو انکو رہنے دینا بادشاہ کے لئے فائدہ مند نہیں۔ "},
	{9, "9  اگر بادشاہ کو منظور ہو تو انکو ہلاک کرنے کا حکم لکھا جائے اور یں تحصیلداروں کے ہاتھ میں شاہی خزانوں میں داخل کرنے کے لئے چاندی کے دس ہزار توڑے دونگا۔ "},
	{10, "10  وار بادشاہ نے اپنے ہاتھ سے انگوٹھی اتار کر یہوفیوں کے دشمن اجاجی ہمداتاکے بیٹے ہامان کو دی۔ "},
	{11, "11  اور بادشاہ نے ہامان سے کہا کہ وہ چاندی تجھے بخشی گئی اور وہ لوگ بھی تاکہ جو تجھے اچھا معلوم ہو ان سے کرے۔ "},
	{12, "12  تب بادشاہ کے منشی پہلے مہینے کی تیرھویں تاریخ کو بلائے گئے جو کچھ ہامان نے بادشاہ کے نوابوں اور ہر صوبہ کے حاکموں اور ہر قوم کے سرداروں کو حکم کیا اسکے مطابق لکھا گیا۔صوبہ کے حروف اور قوم قوم کی زبان میں شاہ اخسویرس کے نام سے یہ لکھا گیا اور اس پر بادشاہ کی انگوٹھی کی مہر کی گئی۔ "},
	{13, "13  اور ہرکاروں کے ہاتھ بادشاہ کے سب صوبوں میں خط بھجیے گئے کہ بارھویں مہینے یعنی ادار مہینے کی تیرھویں تاریخ کو سب یہودیوں کو کیا جوان کیا بڈھے کیا بچے کیا عورتیں ایک ہی دن میں ہلاک اور قتل کریں اور نابود کردیں اور انکا مال لوٹ لیں۔ "},
	{14, "14  اس تحریر کی ایک ایک نقل سب قوموں کے لئے شائع کی گئی کہ اس فرمان کا اعلان ہر صوبہ میں کیا جائے تاکہ اس دن کے لئے تیار ہو جائیں۔ "},
	{15, "15  بادشاہ کے حکم سے ہر کارے فورأ روانہ ہوئے اور وہ حکم قصر سوسن میں دیا گیا اور بادشاہ اور ہامان مے نوشی کرنے کو بیٹھ گئے پر سوسن شہر پریشان تھا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct ur4 poems[] = {
	{1, "1  جب مردکی کو وہ سب جو کیا گیا تھا معلوم ہوا تو مردکی نے اپنے کپڑے پھاڑے اور ٹاٹ پہنے اور سرپر راکھ ڈالکر شہر کے بیچ میں چلا گیا اور بلند اور پردرد آواز سے چلانے لگا۔ "},
	{2, "2  اور وہ بادشاہ کے پھاٹک کے سامنے بھی آیا کیونکہ ٹاٹ پہنے کوئی بادشاہ کے پھاٹک کے اندر جانے نہ پاتا تھا۔ "},
	{3, "3  اور ہر صوبہ میں جہاں کہیں بادشاہ کا حکم اور فرمان پہنچا یہودیوں کے درمیان بڑا ماتم اور روزہ اور گریہ زاری اور نوحہ شروع ہو گیا اور بہتیرے ٹاٹ پہنے راکھ میں پڑگئے۔ "},
	{4, "4  اور آستر کی سہیلیوں اور اسکے خواجہ سراؤں نے آکر اسے خبردی۔ تب ملکہ بہت غمگین ہوئی اور اس نے کپڑے بھیجے کہ مردکی کو پہنائیں اور ٹاٹ اس پر سے اتارلیں پر اس نے انکو نہ لیا۔ "},
	{5, "5  تب آستر نے بادشاہ کے خواجہ سراؤں میں سے ہتاک کو جسے اس نے آستر کے پاس حاضر رہنے کو مقرر کیا تھا بلوایا اور اسے تاکید کی مردکی کے پاس جاکر دریافت کرے کہ یہ کیا بات ہے اور کس سبب سے ہے۔ "},
	{6, "6  سوہتاک نکلکر شہر کے چوک میں جو بادشاہ کے پھاٹک کے سامنے تھا مردکی کے پاس گیا۔ "},
	{7, "7  تب مردکی نے اپنی پوری ستگذشت اور روپے کی وہ ٹھیک رقم اسے بتائی جسے ہامان نے یہودیوں کو ہلاک کرنے کے لئے بادشاہ کے خزانوں میں داخل کرنے کا وعدہ کیا تھا۔ "},
	{8, "8  اور اس فرمان کی تحریر کی ایک نقل بھی جو انکو ہلاک کرنے کے لئے سوسن میں دی گئی تھی اسے دی تاکہ اسے آستر کو دکھائے اور بتائے اور اسے تاکید کرے کہ بادشاہ کے حضور جا کر اس سے محبت کرے اور اسکے حضور اپنی قوم کے لئے درخواست کرے۔ "},
	{9, "9  چنانچہ ہتاک نے آکر آستر کو مردکی کی باتیں کہہ سنائیں۔ "},
	{10, "10  تب آستر ہتاک سے بات کرنے لگی اور اسے مردکی کے لئے یہ پیغام دیا کہ۔ "},
	{11, "11  بادشاہ کے سب ملازم اور شاہی صوبوں کے سب لوگ جانتے ہیں کہ جو کوئی مرد ہو یا عورت بے بلائے بادشاہ کی بارگاہ اندرونی میں جائے اسکے لئے بس ایک ہی قانون ہے کہ وہ مارا جائے سوا اسکے جسکے لئے بادشاہ سونے کا عصا اٹھائے تاکہ وہ جیتا رہے لیکن تیس دن ہوئے کہ میں بادشاہ کے حضور نہیں بلائی گئی۔ "},
	{12, "12  انہوں نے مردکی سے آستر کی باتیں کہیں۔ "},
	{13, "13  تب مردکی نے ان سے کہا کہ آستر کے پاس یہ جواب لے جائیں کہ تو اپنے دل میں یہ نہ سمجھ کہ سب یہودیوں میں سے تو بادشاہ کے محل میں بچی رہیگی۔ "},
	{14, "14  کیونکہ اگر تو اس وقت خاموشی اختیار کرے تو خلاصی اور نجات یہودیوں کے لئے کسی اور جگہے آئیگی پر تو اپنے باپ کے خاندان سمیت ہلاک ہو جائیگی اور کیا جانے کہ تو ایسے ہی وقت کے لئے سلطنت کو پہنچی ہے؟۔ "},
	{15, "15  تب آستر نے انکو مردکی کے پاس یہ جواب لے جانے کا حکم دیا۔ "},
	{16, "16  کہ جا اور سوسن میں جتنے یہودی موجود ہیں انکو اکٹھا کر اور تم میرے لئے روزہ رکھو اور تین روز تک دن اور رات نہ کچھ کھاؤ نہ پیو۔میں بھی اور میری سہیلیاں اسی طرح سے روزہ رکھینگی اور ایسے ہی میں بادشاہ کے حضور جاؤنگی جو آئین کے خلاف ہے اور اگر میں ہلاک ہوئی تو ہلاک ہوئی۔ "},
	{17, "17  چنانچہ مردکی روانہ اور آستر کے حکم کے مطابق کچھ کیا۔(ب "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct ur5 poems[] = {
	{1, "1  اور تیسرے دن ایسا ہوا کہ آستر شاہانہ لباس پہنکرشاہی محل کی بارگاہ اندرونی میں شاہی محل کے سامنے کھڑی ہو گئی اور بادشاہ اپنے شاہی محل میں اپنے تخت سلطنت کے مقابل کے دروازہ پر بیٹگا تھا۔ "},
	{2, "2  اور ایسا ہوا کہ جب بادشاہ نے آستر ملکہ کو بارگاہ میں کھڑی دیکھا تو وہ اسکی نظر میں مقبول ٹھہری اور بادشاہ نے وہ سنہلا عصا جو اسکے ہاتھ میں تھا آستر کی طرف بڑھایا۔سو آستر نے نزدیک جا کر عصا کی نوک کو چھوا۔ "},
	{3, "3  تب بادشاہ نے اس سے کہا آستر ملکہ !تو کیا چاہتی ہے اور کس چیز کی درخواست کرتی ہے؟آدھی سلطنت تک وہ تجھے بخشی جائیگی۔ "},
	{4, "4  آستر نے عرض کی اگر بادشاہ کو منظور ہو تو بادشاہ اس جشن میں جو میں نے اسے لئے تیار کیا ہے ہامان کو ساتھ لیکر آج تشریف لائے۔ "},
	{5, "5  بادشاہ نے فرمایا کہ ہامان کو جلد لاؤ تاکہ آستر کے کہے کے موافق کیا جائے سو بادشاہ اور ہامان اس جشن میں آئے جسکی تیاری آستر نے کی تھی۔ "},
	{6, "6  اور بادشاہ نے جشن میں مے نوشی کے وقت آستر سے پوچھا کہ تیرا کیا سوال ہے؟۔وہ منظور ہوگا۔تیری کیا درخواست ہے؟۔ آدھی سلطنت تک وہ پوری کی جائیگی۔ "},
	{7, "7  آستر نے جواب دیا میرا سوال اور میری درخواست یہ ہے۔ "},
	{8, "8  اگر میں بادشاہ کی نظر میں مقبول ہوں اور بادشاہ کو منظور ہو کہ میرا سوال قبول اور میری درخواست پوری کرے تو بادشاہ اور ہامان میرے جشن میں جو میں انکے لئے کرونگی۔ "},
	{9, "9  اس دن ہامان شادمان اور خوش ہو کر نکلا پر جب ہامان نے بادشاہ کے پھاٹک پر مردکی کو دیکھا کہ اسکے لئے نہ کھڑا ہوا نہ ہٹا تو ہامان مردکی کے خلاف غصہ سے بھر گیا۔ "},
	{10, "10  تو بھی ہامان اپنے آپ کو ضبط کے کے گھر گیا اور لوگ بھیجکر اپنے دوستوں کو اور اپنی بیوی زرش کو بلوایا۔ "},
	{11, "11  اور ہامان انکے آگے اپنی شان و شوکت اور فرزندوں کی کثرت کا قصہ کہنے لگا اور کس کس طرح بادشاہ نے اسکی ترقی کی اور اسکو امرا اور بادشاہی ملازموں سے زیادہ سرفراز کیا۔ "},
	{12, "12  ہامان نے یہ بھی کہا دیکھو آستر ملکہ نے سوا میرے کسی کو بادشاہ کے ساتھ اپنے جشن میں جو اس نے تیار کیا تھا آنے نہ دیا اور کل کے لئے بھی اس نے بادشاہ کے ساتھ مجھے دعوت دی ہے۔ "},
	{13, "13  تو بھی جب تک مردکی کی یہودی مجھے بادشاہ کے پھاٹک پر بٹھا دکھائی دیتا ہے ان باتوں سے مجھے کچھ حاصل نہیں۔ "},
	{14, "14  تب اسکی بیوی زرش اور اسکے سب دوستوں نے اس سے کہا کہ پچاس ہاتھ اونچی سولی بنائی جائے اور کل بادشاہ سے عرض کر کہ مردکی اس پر چٹھایا جائے تب خوشی خوشی بادشاہ کے ساتھ جشن میں جانا۔یہ بات ہامان کو پسند آئی اور اس نے ایک سولی بنوائی۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct ur6 poems[] = {
	{1, "1  اس رات بادشاہ کو نیند نہ آئی۔سو اس نے تواریخ کی کتابوں کے لانے کاحک دیا اور وہ بادشاہ کے حضور پڑھی گئیں۔ "},
	{2, "2  اور یہ لکھا بلا کہ مردکی نے دربانوں میں سے بادشاہ کے دو خواجہ سراؤں بگتانا اور ترش کی مخبری کی تھی جو اخسویرس بادشاہ پر ہاتھ چلانا چاہتے تھے۔ "},
	{3, "3  بادشاہ نے کہا اسکے لئے مردکی کی کیا عزت وحرمت کی گئی ہے؟باشاہ کے ملازموں نے جو اسکی خدمت کرتے تھے کہا کہ اسکے لئے کچھ نہیں کیا گیا۔ "},
	{4, "4  اور بادشاہ نے پوچھا کہ بارگاہ میں کون حاضر ہے ادھر ہامان شاہی محل کی بیرونی بارگاہ نمیں آیا ہوا تھا کہ مردکی کو اس سولی پر چڑھانے کے لئے جو اس نے اسکے لئے تیار کی تھی بادشاہ سے عرض کرے۔ "},
	{5, "5  سو بادشاہ کے ملازموں نے اس سے کہا حضور دربار گاہ میں ہامان ہامان کھڑا ہے بادشاہ نے فرمایا اسے اندر آنے دو۔ "},
	{6, "6  سو ہامان اندر آیا اور بادشاہ نے اس سے کہا جسکی تعظیم بادشاہ کرنا چاہتا ہے اس شخص سے کیا کیا جائے؟ہامان نے اپنے دل میں کہا کہ مجھ سے زیادہ بادشاہ کس کی تعظیم کرنا چاہتا ہوگا؟۔ "},
	{7, "7  سو ہامان نے بادشاہ سے کہا کہ اس شخص کے لئے جسکی تعظیم بادشاہ منظور ہو۔ "},
	{8, "8  شاہانہ لباس جسے بادشاہ پہنتا ہے اور وہ گھوڑا جو بادشاہ کی سواری کا ہے اور شاہی تاج جو اسکے سر پر رکھا جاتا ہے لایا جائے۔ "},
	{9, "9  اور وہ لباس اور وہ گھوڑا بادشاہ کے سب سے عالی نسب امرا میں سے ایک کے ہاتھ میں سپرد ہوں تاکہ اس لباس سے اس شخص کو مبلس کریں جسکی تعظیم بادشاہ کو منظور ہے اور اسے اس گھوڑے پر سوار کرکےشہر کے شارع عام میں پھر آئیں اور اسکے آگے آگے منادی کریں کہ جس شخص کی تعظیم بادشاہ کرنا چاہتا ہے اس سے ایسا ہی کیا جائیگا۔ "},
	{10, "10  تب بادشاہ نے ہامان سے کہا جلدی کر اور اپنے کہے کے مطابق وہ لباس اور گھوڑا لے اور مردکی یہودی سے جو بادشاہ کے پھاٹک پر بیٹھا ہے ایسا ہی کر جو کچھ نو نے کہا ہے اس میں کچھ بھی کمی نہ ہونے پائے۔ "},
	{11, "11  سو ہامان نے وہ لباس اور گھوڑا لیا اور مردکی کو مبلس کرکے گھوڑے پر سوار شہر کے شارع عام میں پھریا اور اسکے آگے آگے منادی کرتا گیا کہ جس شخص کی تعظیم بادشاہ کرنا چاہتا ہے اس سے ایسا ہی کیا جائیگا۔ "},
	{12, "12  اور مردکی تو پھر بادشاہ کے پھاٹک پر لوٹ آیا ہامان آزردہ اور سر ڈھانکے ہوئے جلدی جلدی اپنے گھر گیا۔ "},
	{13, "13  اور ہامان نے اپنی بیوی زرش اور اپنے سب دوستوں کو ایک ایک بات جو اس پر گذری تھی بتائی تب اسکے دانشمندوں اور اسکی بیوی زرش نے اس سے کہا اگر مردکی جسکے آگے تو پست ہونے لگا ہے یہودی نسل میں سے ہے تو تو اس پر غالب نہ ہوگا بلکہ اسکے آگے ضرور پست ہوتا جائیگا۔ "},
	{14, "14  وہ اس سے ابھی باتیں کر ہی رہے تھے کہ بادشاہ کےخواجہ سرا آگئے اور ہامان کو اس جشن میں لے جانے کی جلدی کی جسے آستر نے تیار کیا تھا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct ur7 poems[] = {
	{1, "1  سو بادشاہ اور ہامان آئے کہ آستر ملکہ کے ساتھ کھائیں پئیں۔ "},
	{2, "2  اور بادشاہ نے دوسرے دن ضیافت پر مے نوشی کے وقت آستر سے پھر پوچھا آستر ملکہ تیرا کیا سوال ہے؟وہ منظور ہوگا اور تیری کیا درخواست ہے؟ "},
	{3, "3  آدھی سلطنت تک وہ پوری کی جائیگی۔ "},
	{4, "4  آستر ملکہ نے جواب دیا اے بادشاہ اگر میں تیری نظر میں مقبول ہوں اور بادشاہ کومنظور ہو تو میرے سوال پر میری جان بخشی ہو اور میری درخواست پر میری قوم مجھے ملے۔ "},
	{5, "5  تب اخسویرس بادشاہ نے آستر ملکہ سے کہا وہ کون ہے اور کہاں ہے جس نے اپنے دل میں ایسا خیال کرنے کی جرات کی؟۔ "},
	{6, "6  آستر نے کہا وہ مخالف اور وہ دشمن یہی خبیث ہامان ہے۔تب ہامان بادشاہ لمکہ کے حضور ہراسان ہوا۔ "},
	{7, "7  اور بادشاہ غضبناک ہو کر مے نوشی سے اٹھا اور محل کے باغ میں چلا گیا اور ہامان آستر ملکہ سے اپنی جان بخشی کی درخواست کرنے کو اٹھ کھڑا ہوا کیونکہ اس نے دیکھا کہ بادشاہ نے میرے خلاف بدی کی ٹھان لی ہے۔ "},
	{8, "8  اور بادشاہ محل کے باغ سے لوٹکر مے نوشی کی جگہ آیا اور ہامان اس تخت کے اوپر جس پر آستر بیٹھی تھی پڑا تھا۔تب بادشاہ نے کہا کیایہ گھر ہی میں میرے سامنے ملکہ پر جبر کرنا چاہتا ہے؟ اس بات کا بادشاہ کے منہ سے نکلنا تھا کہ انہوں نے ہامان کا منہ ڈھانک دیا۔ "},
	{9, "9  پھر ان خواجہ سراؤں میں سے جو خدمت کرتے تھے ایک خواجہ سرا خربوناہ نے عرض کی کہ حضور! اسکے علاوہ ہامان کے گھر میں وہ پچاس ہاتھ اونچی سولی کھڑی ہے جسکو ہامان نے مردکی کے لئے تیار کیا جس نے بادشاہ کے فائدہ کی بات بتائی۔بادشاہ نے فرمایا کہ اسے اس پر ٹانگ دو۔ "},
	{10, "10  سو انہوں نے ہامان کو اسی سولی پر جو اس نے مردکی کے لئے تیار کی تھی ٹانگ دیا۔تب بادشاہ کا غصہ ٹھنڈا ہوا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct ur8 poems[] = {
	{1, "1  اسی دن اخسویرس ادشاہ نے یہودیوں کے دشمن ہامان کا گھر آستر ملکہ کو نخشا اور مردکی بادشاہ کے سامنے آیا کیونکہ آستر نے بتادیا تھا کہ اسکا اس سے کیا رشتہ تھا۔ "},
	{2, "2  اور بادشاہ نے اپنی انگوٹھی جو اس نے ہامان سے لے لی تھی اتار کر مردکی کو دی اور آستر نے مردکی کو ہامان کے گھر پر مختار بنادیا۔ "},
	{3, "3  اور آستر نے پھر بادشاہ کے حضور عرض کی اور اسکے قدموں پر گری اور آنسو بہا بہا کر اسکی منت کی کہ ہامان اجاجی کی بدخواہی اور بارش کو جو اس نے یہودیوں کے بر خلاف کی تھی باطل کردے۔ "},
	{4, "4  تب بادشاہ نے استر کی طرف سنہلا عصا بڑھایا۔سو آستر بادشاہ کے حضور اٹھ کھڑی ہوئی۔ "},
	{5, "5  اور کہنے لگی کہ اگر بادشاہ کو منظور ہوا اور میں اسکی نظر میں مقبول ہوں اور یہ بات بادشاہ کو مناسب معلوم ہو اور اسکی نگاہ میں پیاری ہوں تو ان فرمانوں کو منسوخ کرنے کو لکھا جائے جنکو اجاجی ہمداتا کے بیٹے ہامان نے ان سب یہودیوں کو ہلاک کرنے کے لئے جو بادشاہ کے سب صوبوں میں بستے ہیں تجویز کیا تھا۔ "},
	{6, "6  کیونکہ میں اس بلاکو جو میری قوم پر نازل ہوگی کیونکہ دیکھ سکتی ہوں؟ یا کیسے میں اپنے رشتہ داروں کی ہلاکت دیکھ سکتی ہوں؟۔ "},
	{7, "7  تب اخسویرس بادشاہ نے آستر ملکہ اور مردکی یہودی سے کہا کہ دیکھو میں نے ہامان کا گھر آستر کو بخشا ہے اور اسے انہوں نے سولی پر ٹانگ دیا ہے اسلئے کہ اس نے یہودیوں پر ہاتھ چلایا۔ "},
	{8, "8  تم بھی بادشاہ کے نام سے یہودیوں کو جیسا چاہتے ہو لکھو اور اس پر بادشاہ کی انگوٹھی سے مہر کرو کیونکہ جو نوشتہ بادشاہ کے نام سے لکھا جاتا ہے اور اس پر بادشاہ کی انگوٹھی سے مہر کی جاتی ہے اسے کوئی منسوخ نہیں کرسکتا۔ "},
	{9, "9  سو اسی وقت تیسرے مہینے یعنی سیوان مہینے کی تیسویں تاریخ کو بادشاہ کے منشی طلب کئے گئے اور جو کچھ مردکی نے ہندوستان سے کوش تک ایک سوستائیس صوبوں کے یہودیوں اور نوابوں اور حاکموں اور صوبوں کے امیروں کو حکم دیا وہ سب ہر صوبہ کو اسی کےحروف اور ہر قوم کو اسی کی زبان اور یہودیوں کو انکے حروف اور انکی زبان کے مطابق لکھا گیا۔ "},
	{10, "10  اور اس نے اخسویرس بادشاہ کے نام سے خط لکھے اور بادشاہ کی انگوٹھی سے ان پر مہر کی اور انکو سوار ہرکاروں کے ہاتھ روانہ کیا جو عمدہ نسل کے تیز رفتار شاہی گھوڑوں پر سوار تھے۔ "},
	{11, "11  ان میں بادشاہ نے یہودیوں کو جو ہر شہر میں تھے اجازت دی کہ اکٹھے ہو کر اپن بچانے کے لئے مقابلہ پر اڑجائیں اور اس قوم اور اس صوبہ کی ساری فوج کو جوان پر اور انکے چھوٹے بچوں اور یہودیوں پر حملہ آور ہو ہلاک اور قتل کریں اور نیست ونابود کردیں اور انکا مال لوٹ لیں۔ "},
	{12, "12  یہ اخسویرس بادشاہ کے سب صوبوں میں بارھویں مہینے یعنی ادار مہینے کی تیرھویں تاریخ کو ایک ہی دن میں ہو۔ "},
	{13, "13  اس تحریر کی ایک ایک نقل سب قوموں کے لئے شائع کی گئی کہ اسفرمان کا اعلان ہر صوبہ میں کیا جائے تاکہ یہودی اس دن اپنے دشمنوں سے اپنا انتقام لینے کو تیار ہیں۔ "},
	{14, "15  اور مردکی بادشاہ کے حضور سے آسمانی اور سفید کا شاہانہ لباس اور سونے کا ایک بڑا تاج اور کتانی اور ارغوانی خلعت پہنے نکلا اور سوسن شہر نے نعرہ مارا اور خوشی منائی۔ "},
	{15, "16  یہودیوں کو رونق اور خوشی اور شادمانی اور عزت حاصل ہوئی۔ "},
	{16, "17  اور ہر صوبہ اور ہر شہر میں جہاں کہیں بادشاہ کا حکم اور اسکا فرمان پہنچا یہودیوں کو خرمی اور شادمانی اور عید اور خوشی کا دن نصیب ہوا اور اس ملک کے لوکوں میں سے بہتیرے یہودی ہو گئے کیونکہ یہودیوں کا خوف ان پر چھایا گیا تھا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct ur9 poems[] = {
	{1, "1  اب بارھویں مہینے یعنی ادار مہینے کی تیرھویں تاریخ کو جب بادشاہ کے حکم اور فرمان پر عمل کرنے کا وقتنزدیک آیا اور اس دن یہودیوں کے دشمنوں کو ان پر غالب ہونے کی امید تھی حالانکہ برعکس اسکے یہ ہوا کہ یہودیوں نے اپنے نفرت کرنے والوں پر غلبہ پایا۔ "},
	{2, "2  تو اخسویرس بادشاہ کے سب صوبوں کے یہودی اپنے اپنے شہر میں اکٹھے ہوئے کہ ان پر جو انکا نقصان چاہتے تھے ہاتھ چلائیں اور کوئی آدمی انکا سامنا نہ کر سکا کیونکہ انکا خوف سب قوموں پر چھا گیا تھا۔ "},
	{3, "3  اور صوبوں کے سب امیروں اور نوابوں اور حاکموں اور بادشاہ کے کار گذاروں نے یہودیوں کی مدد کی اسلئے کہ مردکی کا رعب ان پر چھاگیا تھا۔ "},
	{4, "4  کیونکہ مردکی شاہی محل میں معزز تھا اور سب صوبوں میں اسکی شہرت پھیل گئی تھی اسلئے کہ یہ مرد یعنی مردکی بڑھتا چلاگیا۔ "},
	{5, "5  اور یہودیوں نے اپنے سب دشمنوں کو تلوار کی دھات سے کاٹ ڈالا اور قتل اور ہلاک کیا اور اپنے نفرت کرنے والوں سےجوچاہا کیا۔ "},
	{6, "6  اور قصر سوسن میں یہودیوں نے پانچسو آدمیوں کو قتل اور ہلاک کیا۔ "},
	{7, "7  اور پرشنداتا اور لفون اور اسپاتا۔ "},
	{8, "8  اور پورتا اور ادلیاہ اور اردتا۔ "},
	{9, "9  اور پرمشتا اور اریسی اور اردی اور ویزاتا۔ "},
	{10, "10  یعنی یہودیوں کے دشمن ہامن بن ہمداتا کے دسوں بیٹوں کو انہوں ے قتل کیا پرلوٹ پر انہوں نے ہاتھ نہ بڑھایا۔ "},
	{11, "11  اسی دن ان لوگوں کا شمار جو قصر سوسن میں قتل ہوئے بادشاہ کے حضور پہنچایا گیا۔ "},
	{12, "12  اور بادشاہ نے آستر ملکہ سے کہا یہودیوں نے قصر سوسن ہی میں پانسو آدمیوں اور ہامان کے دسوں بیٹوں کو قتل اور ہلاک کیا ہے تو بادشاہ کے باقی صوبوں میں انہوں نے کیا کچھنہ کیا ہوگا؟اب تیرا کیا سوال ہے؟وہ منظور ہوگااور تیری اور کیا درخواست ہے؟ وہ پوری کی جائیگی۔ "},
	{13, "13  آستر نے کہا اگر بادشاہ کو منظور ہو تو ان یہودیوں کو جو سوسن میں ہیں اجازت ملے کہ آج کے فرمان کے موافق کل بھی کریں اور ہامان کے دسوں بیٹے سولی پر چڑھائے جائیں۔ "},
	{14, "14  سو بادشاہ نے حکم دیا کہ ایسا ہی کیا جائے اور سوسن میں اس فرمان کا اعلان کیا گیا اور ہامان کے دسوں بیٹوں کو انہوں نے ناٹک دیان۔ "},
	{15, "15  اور وہ یہودی جو سوسن میں رہتے تھے اور مہینے کی چودھویں تاریخ کو اکٹھے ہوئے اور انہوں نے سوسن میں تین سو آدمیوں کو قتل کیا پر لوٹ کے مال کو ہاتھ نہ لگایا۔ "},
	{16, "16  اور باقی یہودی جو بادشاہ کے صوبوں میں رہتے تھے اکٹھے ہو کر اپنی اپنی جان بچانے کے لئے مقابلہ کو اڑ گئے اور اپنے دشمنوں سے آرام پایا اور اپنے نفرت کرنے والوں میں سے پچھتر ہزار کو قتل کیا پر لوٹ پر انہوں نے ہاتھ نہ بڑھایا۔ "},
	{17, "17  یہ ادار مہینے کی تیرھویں تاریخ تھی اور اسیکی چودھویں تاریخ کو انہوں نے آرام کیا اور اسے ضیافت اور خوشی کا دن ٹھہرایا۔ "},
	{18, "18  پر وہ یہودی جو سوسن میں تھے اسکی تیرھویں اور چودھویں تاریخ کو اکٹھے ہوئے اور اسکی پندرھویں تاریخ کو آرام کیا اور اسے ضیافت اور خوشی کا دن ٹھہرایا۔ "},
	{19, "19  اسلئے دیہاتی یہودی جو بے فصیل بستیوں میں رہتے ہیں ادار مہینے کی چودھویں تاریخ کو شادمانی اور ضیافت کا اور خوشی کا اور ایک دوسرے کو تحفے بھیجنے کا دن مانتے ہیں "},
	{20, "20  اور مردکی نے یہ سب احوال لکھکر ان یہودیوں کو جو اخسویرس بادشاہ کے سب صبوں میں کیا نزدیک کیا دور رہتے تھے خط بھیجے۔ "},
	{21, "21  تا کہ انکو تاکید کرے کہ وہ ادار مہینے کی چودھویں تاریخ کو اور اسی کی پندرھویں کو سال بسال۔ "},
	{22, "22  ایسے دنوں کی طرح مانیں جن میں یہودیوں کو اپنے دشمنوں سے چین ملا اور وہ مہینے انکے لئے غم سے شادمانی میں اور ماتم سے خوشی کے دن میں مبدل ہوا اسلئے وہ انکو ضیافت اور خوشی اور آپس میں تحفے بھیجنے اور غریبوں کو خیرات دینے کے دن ٹھہرائیں۔ "},
	{23, "23  یہودیوں نے جیسا شروع کیا تھا اور جیسا مردکی نے انکو لکھا تھا ویسا ہی کرنے کا ذمہ لیا۔ "},
	{24, "24  کیونکہ اجاجی ہمداتا کے بیٹے ہامان سب یہودیوں کے دشمن نے یہودیوں کے خلاف ان کو ہلاک کرنے کی تدبیرکی تھی اور اس نے پور یعنی قرعہ ڈالا تھا کہ ان کو نابود اور ہلاک کرے۔ "},
	{25, "25  پر جب وہ معاملہبادشاہ کے سامنے پیش ہوا تو اس نے خطوں کے ذریعہ سےحکم کیا کہ وہ بری تجویز جو اس نے یہودیوں کے بر خلاف کی تھی الٹی اس ہی کے سر پر پڑے اور وہ اور اس کے بیٹے سولی پر چڑھائے جائیں۔ "},
	{26, "26  اس لئے انہوں نے ان دنوں کو پور کے نام کے سبب سے پوریم کہا سو اس خط کی سب باتوں کے سبب سے اور جو کچھ انہوں نے اس معاملہ میں خود دیکھا تھا اور جو ان پر گزرا تھا اس کے سبب سے بھی "},
	{27, "27  یہودیوں نے ٹھہرا دیا اور اپنے اوپر اور اپنی نسل کے لئے اور ان سبھوں کے لئے جو ان کے ساتھ مل گئے تھے ان ذمہ لیا تاکہ بات اٹل ہو جائے کہ وہ اس خط کی تحریر کے مطابق ہر سال ان دونوں دنوں کو مقرر ہ وقت پر مانینگے۔ "},
	{28, "28  اور یہ دن پشت در پشت ہر خاندان اور صبح اور شہر میں یاد رکھے اور مانے جائیں گے ۔اور پوریم کے دن یہودیوں میں کبھی موقوف نہ ہونگے اور نہ یادگار ان کی نسل سے جاتی رہے گی۔ "},
	{29, "29  اور ابیخیل کی بیٹی آستر ملکہ اور یہودی مردکی نے پوریم کے باب کے خط پر زور دینے کے لئے پورے اخیتار سے لکھا ۔ "},
	{30, "30  اور اس نے سلامتی اور سچائی کی باتیں لکھ کر اخسویرس کی مملکت کے ایک سو ستائیں صوبوں میں سب یہودیوں کے پاس خط بھیجے۔ "},
	{31, "31  تاکہ پویم کے ان دنوں کو ان کے مقرر وقت کے لئے برقرار کرےجیسا یہودی مردکی اور آستر ملکہ نے ان کو حکم کیا تھااور جیسا انہوں نے اپنے اور اپنی نسل کے لئے روزہ رکھنے اور ماتم کرنے کے بارے میں ٹھہرایا تھا۔ "},
	{32, "32  اور آستر کے حکم سے پوریم کی ان رسموں کی تصدیق ہوئی اور یہ کتاب میں لکھ لیا گیا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct ur10 poems[] = {
	{1, "1  اور اخسویرس بادشاہ نے زمین پر اور سمندر کے جزیروں پر خراج مقرر کیا۔ "},
	{2, "2  اور اس کے زور اور اقتدار کے سب کام اور مردکی کی عظمت کا مفصل حاں جہاں تک بادشاہ نے اسے ترقی دی تھی کیا وہ مادی اور فارس کے بادشاہوں کی تواریخ کی کتاب میں قلم بند نہیں؟۔ "},
	{3, "3  کیونکہ یہودی مردکی اخسویرس بادشاہ سے دوسرے درجہ پر تھا اور سب یہودیوں میں معزز اور اپنے بھائیوں کی ساری جماعت میں مقبول تھا اور اپنی قوم کا خیر خواہ رہا اور اپنی ساری اولاد سے سلامتی کی باتیں کرتا تھا۔ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};