#include <map>
#include <string>
class Bible19
{
	struct fa1	{ int val; const char *msg; };
	struct fa2	{ int val; const char *msg; };
	struct fa3	{ int val; const char *msg; };
	struct fa4	{ int val; const char *msg; };
	struct fa5	{ int val; const char *msg; };
	struct fa6	{ int val; const char *msg; };
	struct fa7	{ int val; const char *msg; };
	struct fa8	{ int val; const char *msg; };
	struct fa9	{ int val; const char *msg; };
	struct fa10	{ int val; const char *msg; };
	struct fa11	{ int val; const char *msg; };
	struct fa12	{ int val; const char *msg; };
	struct fa13	{ int val; const char *msg; };
	struct fa14	{ int val; const char *msg; };
	struct fa15	{ int val; const char *msg; };
	struct fa16	{ int val; const char *msg; };
	struct fa17	{ int val; const char *msg; };
	struct fa18	{ int val; const char *msg; };
	struct fa19	{ int val; const char *msg; };
	struct fa20	{ int val; const char *msg; };
	struct fa21	{ int val; const char *msg; };
	struct fa22	{ int val; const char *msg; };
	struct fa23	{ int val; const char *msg; };
	struct fa24	{ int val; const char *msg; };
	struct fa25	{ int val; const char *msg; };
	struct fa26	{ int val; const char *msg; };
	struct fa27	{ int val; const char *msg; };
	struct fa28	{ int val; const char *msg; };
	struct fa29	{ int val; const char *msg; };
	struct fa30	{ int val; const char *msg; };
	struct fa31	{ int val; const char *msg; };
	struct fa32	{ int val; const char *msg; };
	struct fa33	{ int val; const char *msg; };
	struct fa34	{ int val; const char *msg; };
	struct fa35	{ int val; const char *msg; };
	struct fa36	{ int val; const char *msg; };
	struct fa37	{ int val; const char *msg; };
	struct fa38	{ int val; const char *msg; };
	struct fa39	{ int val; const char *msg; };
	struct fa40	{ int val; const char *msg; };
	struct fa41	{ int val; const char *msg; };
	struct fa42	{ int val; const char *msg; };
	struct fa43	{ int val; const char *msg; };
	struct fa44	{ int val; const char *msg; };
	struct fa45	{ int val; const char *msg; };
	struct fa46	{ int val; const char *msg; };
	struct fa47	{ int val; const char *msg; };
	struct fa48	{ int val; const char *msg; };
	struct fa49	{ int val; const char *msg; };
	struct fa50	{ int val; const char *msg; };
	struct fa51	{ int val; const char *msg; };
	struct fa52	{ int val; const char *msg; };
	struct fa53	{ int val; const char *msg; };
	struct fa54	{ int val; const char *msg; };
	struct fa55	{ int val; const char *msg; };
	struct fa56	{ int val; const char *msg; };
	struct fa57	{ int val; const char *msg; };
	struct fa58	{ int val; const char *msg; };
	struct fa59	{ int val; const char *msg; };
	struct fa60	{ int val; const char *msg; };
	struct fa61	{ int val; const char *msg; };
	struct fa62	{ int val; const char *msg; };
	struct fa63	{ int val; const char *msg; };
	struct fa64	{ int val; const char *msg; };
	struct fa65	{ int val; const char *msg; };
	struct fa66	{ int val; const char *msg; };
	struct fa67	{ int val; const char *msg; };
	struct fa68	{ int val; const char *msg; };
	struct fa69	{ int val; const char *msg; };
	struct fa70	{ int val; const char *msg; };
	struct fa71	{ int val; const char *msg; };
	struct fa72	{ int val; const char *msg; };
	struct fa73	{ int val; const char *msg; };
	struct fa74	{ int val; const char *msg; };
	struct fa75	{ int val; const char *msg; };
	struct fa76	{ int val; const char *msg; };
	struct fa77	{ int val; const char *msg; };
	struct fa78	{ int val; const char *msg; };
	struct fa79	{ int val; const char *msg; };
	struct fa80	{ int val; const char *msg; };
	struct fa81	{ int val; const char *msg; };
	struct fa82	{ int val; const char *msg; };
	struct fa83	{ int val; const char *msg; };
	struct fa84	{ int val; const char *msg; };
	struct fa85	{ int val; const char *msg; };
	struct fa86	{ int val; const char *msg; };
	struct fa87	{ int val; const char *msg; };
	struct fa88	{ int val; const char *msg; };
	struct fa89	{ int val; const char *msg; };
	struct fa90	{ int val; const char *msg; };
	struct fa91	{ int val; const char *msg; };
	struct fa92	{ int val; const char *msg; };
	struct fa93	{ int val; const char *msg; };
	struct fa94	{ int val; const char *msg; };
	struct fa95	{ int val; const char *msg; };
	struct fa96	{ int val; const char *msg; };
	struct fa97	{ int val; const char *msg; };
	struct fa98	{ int val; const char *msg; };
	struct fa99	{ int val; const char *msg; };
	struct fa100	{ int val; const char *msg; };
	struct fa101	{ int val; const char *msg; };
	struct fa102	{ int val; const char *msg; };
	struct fa103	{ int val; const char *msg; };
	struct fa104	{ int val; const char *msg; };
	struct fa105	{ int val; const char *msg; };
	struct fa106	{ int val; const char *msg; };
	struct fa107	{ int val; const char *msg; };
	struct fa108	{ int val; const char *msg; };
	struct fa109	{ int val; const char *msg; };
	struct fa110	{ int val; const char *msg; };
	struct fa111	{ int val; const char *msg; };
	struct fa112	{ int val; const char *msg; };
	struct fa113	{ int val; const char *msg; };
	struct fa114	{ int val; const char *msg; };
	struct fa115	{ int val; const char *msg; };
	struct fa116	{ int val; const char *msg; };
	struct fa117	{ int val; const char *msg; };
	struct fa118	{ int val; const char *msg; };
	struct fa119	{ int val; const char *msg; };
	struct fa120	{ int val; const char *msg; };
	struct fa121	{ int val; const char *msg; };
	struct fa122	{ int val; const char *msg; };
	struct fa123	{ int val; const char *msg; };
	struct fa124	{ int val; const char *msg; };
	struct fa125	{ int val; const char *msg; };
	struct fa126	{ int val; const char *msg; };
	struct fa127	{ int val; const char *msg; };
	struct fa128	{ int val; const char *msg; };
	struct fa129	{ int val; const char *msg; };
	struct fa130	{ int val; const char *msg; };
	struct fa131	{ int val; const char *msg; };
	struct fa132	{ int val; const char *msg; };
	struct fa133	{ int val; const char *msg; };
	struct fa134	{ int val; const char *msg; };
	struct fa135	{ int val; const char *msg; };
	struct fa136	{ int val; const char *msg; };
	struct fa137	{ int val; const char *msg; };
	struct fa138	{ int val; const char *msg; };
	struct fa139	{ int val; const char *msg; };
	struct fa140	{ int val; const char *msg; };
	struct fa141	{ int val; const char *msg; };
	struct fa142	{ int val; const char *msg; };
	struct fa143	{ int val; const char *msg; };
	struct fa144	{ int val; const char *msg; };
	struct fa145	{ int val; const char *msg; };
	struct fa146	{ int val; const char *msg; };
	struct fa147	{ int val; const char *msg; };
	struct fa148	{ int val; const char *msg; };
	struct fa149	{ int val; const char *msg; };
	struct fa150	{ int val; const char *msg; };
public:
static void view1() {
struct fa1 poems[] = {
	{1, "1  خوشابحال کسی که به مشورت شریران نرود و به راه گناهکاران نایستد، و در مجلس استهزاکنندگان ننشیند؛ "},
	{2, "2  بلکه رغبت او در شریعت خداوند است و روز و شب در شریعت او تفکر می‌کند. "},
	{3, "3  پس مثل درختی نشانده نزد نهرهای آب خواهد بود، که میوهٔٔ خود را در موسمش می‌دهد، و برگش پژمرده نمی‌گردد و هر آنچه می‌کند نیک انجام خواهد بود. "},
	{4, "4  شریران چنین نیستند، بلکه مثل کاهند که باد آن را پراکنده می‌کند. "},
	{5, "5  لهذا شریران در داوری نخواهند ایستاد و نه گناهکاران در جماعت عادلان. "},
	{6, "6  زیرا خداوند طریق عادلان را می‌داند، ولی طریق گناهکاران هلاک خواهد شد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct fa2 poems[] = {
	{1, "1  چرا امّت‌ها شورش نموده‌اند و طوائف در باطل تفکر می‌کنند؟ "},
	{2, "2  پادشاهان زمین برمی‌خیزند و سروران با هم مشورت نموده‌اند، به ضد خداوند و به ضد مسیح او؛ "},
	{3, "3  که بندهای ایشان را بگسلیم و زنجیرهای ایشان را از خود بیندازیم. "},
	{4, "4  او که بر آسمانها نشسته است می‌خندد. خداوند بر ایشان استهزا می‌کند. "},
	{5, "5  آنگاه در خشم خود بدیشان تکّلم خواهد کرد و به غضب خویش ایشان را آشفته خواهد ساخت. "},
	{6, "6  و من پادشاه خود را نصب کرده‌ام، بر کوه مقدّس خود صهیون. "},
	{7, "7  فرمان را اعلام می‌کنم، خداوند به من گفته است، تو پسر من هستی امروز تو را تولید کردم. "},
	{8, "8  از من درخواست کن و امّت‌ها را به میراث تو خواهم داد و اقصای زمین را ملک تو خواهم گردانید. "},
	{9, "9  ایشان را به عصای آهنین خواهی شکست؛ مثل کوزهٔ کوزه‌گر آنها را خرد خواهی نمود. "},
	{10, "10  و الآن ای پادشاهان تعّقل نمایید! ای داوران جهان متنبّه گردید! "},
	{11, "11  خداوند را با ترس عبادت کنید و با لرز شادی نمایید! "},
	{12, "12  پسر را ببوسید مبادا غضبناک شود و از طریق هلاک شوید، زیرا غضب او به اندکی افروخته می‌شود. خوشابحال همهٔٔ آنانی که بر او توکّل دارند. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct fa3 poems[] = {
	{1, "1  [مزمور داود وقتی که از پسر خود ابشالوم فرار کرد] ای خداوند دشمنانم چه بسیار شده‌اند.بسیاری به ضد من برمی‌خیزند. "},
	{2, "2  بسیاری برای جان من می‌گویند، بجهت او در خدا خلاصی نیست. سلاه. "},
	{3, "3  لیکن تو ای خداوند گرداگرد من سپر هستی، جلال من و فرازندهٔ سر من. "},
	{4, "4  به آواز خود نزد خداوند می‌خوانم و مرا از کوه مقدّس خود اجابت می‌نماید. سلاه. "},
	{5, "5  و امّا من خسبیده، به خواب رفتم و بیدار شدم زیرا خداوند مرا تقویّت می‌دهد. "},
	{6, "6  از کرورهای مخلوق نخواهم ترسید که گرداگرد من صف بسته‌اند. "},
	{7, "7  ای خداوند، برخیز! ای خدای من، مرا برهان! زیرا بر رخسار همهٔٔ دشمنانم زدی؛ دندانهای شریران را شکستی. "},
	{8, "8  نجات از آن خداوند است و برکت تو بر قوم تو می‌باشد. سلاه. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct fa4 poems[] = {
	{1, "1  [برای سالار مغنیان برذوات اوتار. مزمور داود] ای خدای عدالت من، چون بخوانم مرا مستجاب فرما. در تنگی مرا وسعت دادی. بر من کرم فرموده، دعای مرا بشنو. "},
	{2, "2  ای فرزندان انسان تا به کی جلال من عار خواهد بود، و بطالت را دوست داشته، دروغ را خواهید طلبید؟ سلاه. "},
	{3, "3  امّا بدانید که خداوند مرد صالح را برای خود انتخاب کرده است، و چون او را بخوانم خداوند خواهد شنید. "},
	{4, "4  خشم گیرید و گناه مورزید. در دلها بر بسترهای خود تفّکر کنید و خاموش باشید. سلاه. "},
	{5, "5  قربانی‌های عدالت را بگذرانید و بر خداوند توکل نمایید. "},
	{6, "6  بسیاری می‌گویند، کیست که به ما احسان نماید؟ ای خداوند نور چهرهٔ خویش را بر ما برافراز. "},
	{7, "7  شادمانی در دل من پدید آورده‌ای، بیشتر از وقتی که غّله و شیرهٔ ایشان افزون گردید. "},
	{8, "8  بسلامتی می‌خسبم و به خواب هم می‌روم زیرا که تو فقط ای خداوند مرا در اطمینان ساکن می‌سازی. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct fa5 poems[] = {
	{1, "1  [رای سالار مغنیان برذوات نفخه. مزمور داود] ای خداوند، به سخنان من گوش بده! در تفکر من تأمل فرما! "},
	{2, "2  ای پادشاه و خدای من، به آواز فریادم توجه کن زیرا که نزد تو دعا می‌کنم. "},
	{3, "3  ای خداوند صبحگاهان آواز مرا خواهی شنید؛ بامدادان [دعای خود را] نزد تو آراسته می‌کنم و انتظار می‌کشم. "},
	{4, "4  زیرا تو خدایی نیستی که به شرارت راغب باشی، و گناهکار نزد تو ساکن نخواهد شد. "},
	{5, "5  متکبّران در نظر تو نخواهند ایستاد. از همهٔٔ بطالتکنندگان نفرت می‌کنی. "},
	{6, "6  دروغ‌گویان را هلاک خواهی ساخت. خداوند شخص خونی و حیلهگر را مکروه می‌دارد. "},
	{7, "7  و امّا من از کثرت رحمت تو به خانه‌ات داخل خواهم شد، و از ترس تو بسوی هیکل قدس تو عبادت خواهم نمود. "},
	{8, "8  ای خداوند، به‌سبب دشمنانم مرا به عدالت خود هدایت نما و راه خود را پیش روی من راست گردان. "},
	{9, "9  زیرا در زبان ایشان راستی نیست؛ باطن ایشان محض شرارت است؛ گلوی ایشان قبر گشاده است و زبانهای خود را جلا می‌دهند. "},
	{10, "10  ای خدا، ایشان را ملزم ساز تا به‌سبب مشورتهای خود بیفتند، و به کثرت خطایای ایشان، ایشان را دور انداز زیرا که بر تو فتنه کرده‌اند، "},
	{11, "11  و همهٔ متوکّلانت شادی خواهند کرد و تا به ابد ترنّم خواهند نمود. زیرا که ملجاء ایشان تو هستی و آنانی که اسم تو را دوست می‌دارند، در تو وجد خواهند نمود. "},
	{12, "12  زیرا تو ای خداوند مرد عادل را برکت خواهی داد، او را به رضامندی مثل سپر احاطه خواهی نمود. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct fa6 poems[] = {
	{1, "1  [برای سالار مغنیان برذوات اوتار برثمانی. مزمور داود] ای خداوند، مرا در غضب خود توبیخ منما و مرا در خشم خویش تأدیب مکن! "},
	{2, "2  ای خداوند، بر من کرم فرما زیرا که پژمرده‌ام! ای خداوند، مرا شفا ده زیرا که استخوانهایم مضطرب است، "},
	{3, "3  و جان من بشدت پریشان است. پس تو ای خداوند، تا به کی؟ "},
	{4, "4  ای خداوند، رجوع کن و جانم را خلاصی ده! به رحمت خویش مرا نجات بخش! "},
	{5, "5  زیرا که در موت ذکر تو نمی‌باشد! در هاویه کیست که تو را حمد گوید؟ "},
	{6, "6  از نالهٔ خود وامانده‌ام! تمامی شب تختخواب خود را غرق می‌کنم، و بستر خویش را به اشکها تر می‌سازم! "},
	{7, "7  چشم من از غصه کاهیده شد و به‌سبب همهٔٔ دشمنانم تار گردید. "},
	{8, "8  ای همهٔٔ بدکاران از من دور شوید، زیرا خداوند آواز گریهٔٔ مرا شنیده است! "},
	{9, "9  خداوند استغاثهٔ مرا شنیده است. خداوند دعای مرا اجابت خواهد نمود. "},
	{10, "10  همهٔٔ دشمنانم به شدت خجل و پریشان خواهند شد. روبرگردانیده، ناگهان خجل خواهند گردید. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct fa7 poems[] = {
	{1, "1  [سرود داود که آن را برای خداوند سرایید به‌سبب سخنان کُوش بنیامینی] ای یهوه خدای من، در تو پناه می‌برم. از همهٔٔ تعاقب کنندگانم مرا نجات ده و برهان. "},
	{2, "2  مبادا او مثل شیر جان مرا بدرد، و خرد سازد و نجات‌دهنده‌ای نباشد. "},
	{3, "3  ای یهوه خدای من اگر این را کردم و اگر در دست من ظلمی پیدا شد، "},
	{4, "4  اگر به خیراندیش خود بدی کردم و بی‌سبب دشمن خود را تاراج نمودم، "},
	{5, "5  پس دشمنْ جانم را تعاقب کند، و آن را گرفتار سازد، و حیات مرا به زمین پایمال کند، و جلالم را در خاک ساکن سازد. سلاه. "},
	{6, "6  ای خداوند در غضب خود برخیز، به‌سبب قهر دشمنانم بلند شو و برای من بیدار شو! ای که داوری را امر فرموده‌ای! "},
	{7, "7  و مجمع امّت‌ها گرداگرد تو بیایند. و بر فوق ایشان به مقام اعلی رجوع فرما. "},
	{8, "8  خداوند امّت‌ها را داوری خواهد نمود. ای خداوند، موافق عدالتم و کمالی که در من است مرا داد بده! "},
	{9, "9  بدیِ شریران نابود شود و عادل را پایدار کن زیرا امتحان‌کنندهٔ دلها و قلوب، خدای عادل است. "},
	{10, "10  سپر من بر خدا می‌باشد که راست دلان را نجات‌دهنده است. "},
	{11, "11  خدا داور عادل است و هر روزه خدا خشمناک می‌شود. "},
	{12, "12  اگر بازگشت نکند شمشیر خود را تیز خواهد کرد؛ کمان خود را کشیده و آماده کرده است. "},
	{13, "13  و برای او آلات موت را مهیا ساخته و تیرهای خویش را شعله‌ور گردانیده است. "},
	{14, "14  اینک به بطالت آبستن شده، و به ظلم حامله گردیده، دروغ را زاییده است. "},
	{15, "15  حفره‌ای کند و آن را گود نمود، و در چاهی که ساخت خود بیفتاد. "},
	{16, "16  ظلم او برسرش خواهد برگشت و ستم او بر فرقش فرود خواهد آمد. "},
	{17, "17  خداوند را برحسب عدالتش حمد خواهم گفت و اسم خداوند تعالی را تسبیح خواهم خواند. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct fa8 poems[] = {
	{1, "1  [برای سالار مغنیان بر جتّیت. مزمور داود] ای یهوه خداوند ما، چه مجید است نام تو در تمامی زمین، که جلال خود را فوق آسمانها گذارده‌ای! "},
	{2, "2  از زبان کودکان و شیرخوارگان به‌سبب خصمانت قوّت را بنا نهادی تا دشمن و انتقام گیرنده را ساکت گردانی. "},
	{3, "3  چون به آسمان تو نگاه کنم که صنعت انگشته‌ای توست، و به ماه و ستارگانی که تو آفریده‌ای، "},
	{4, "4  پس انسان چیست که او را به یاد آوری، و بنی‌آدم که از او تفقد نمایی؟ "},
	{5, "5  او را از فرشتگان اندکی کمتر ساختی و تاج جلال و اکرام را بر سر او گذاردی. "},
	{6, "6  او را بر کارهای دست خودت مسلط نمودی، و همه‌چیز را زیر پای وی نهادی، "},
	{7, "7  گوسفندان و گاوان جمیعاً، و بهایم صحرا را نیز؛ "},
	{8, "8  مرغان هوا و ماهیان دریا را، و هر چه بر راه‌های آبها سیر می‌کند. "},
	{9, "9  ای یهوه خداوند ما، چه مجید است نام تو در تمامیِ زمین! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct fa9 poems[] = {
	{1, "1  [برای سالار مغنیان بر موت لبین. مزمور داود] خداوند را به‌ تمامی دل‌ حمد خواهم گفت‌؛ جمیع‌ عجایب‌ تو را بیان‌ خواهم كرد. "},
	{2, "2  در تو شادی و وجد خواهم نمود؛ نام تو را ای متعال خواهم سرایید. "},
	{3, "3  چون دشمنانم به عقب بازگردند، آنگاه لغزیده، از حضور تو هلاک خواهند شد. "},
	{4, "4  زیرا انصاف و داوریِ من کردی. داورِ عادل بر مسند نشسته‌ای. "},
	{5, "5  امّت‌ها را توبیخ نموده‌ای و شریران را هلاک ساخته، نام ایشان را محو کرده‌ای تا ابدالآباد. "},
	{6, "6  و امّا دشمنان نیست شده خرابه‌های ابدی گردیده‌اند؛ و شهرها را ویران ساخته‌ای، حتی ذکر آنها نابود گردید. "},
	{7, "7  لیکن خداوند نشسته است تا ابدالآباد، و تخت خویش را برای داوری برپا داشته است؛ "},
	{8, "8  و او ربع مسکون را به عدالت داوری خواهد کرد، و امّت‌ها را به راستی داد خواهد داد. "},
	{9, "9  و خداوند قلعهٔ بلند برای کوفته‌شدگان خواهد بود، قلعهٔ بلند در زمانهای تنگی. "},
	{10, "10  و آنانی که نام تو را می‌شناسند، بر تو توکل خواهند داشت، زیرا ای خداوند تو طالبان خود را هرگز ترک نکرده‌ای. "},
	{11, "11  خداوند را که بر صهیون نشسته است بسرایید؛ کارهای او را در میان قومها اعلان نمایید، "},
	{12, "12  زیرا او که انتقام گیرندهٔ خون است، ایشان را به یاد آورده، و فریاد مساکین را فراموش نکرده است. "},
	{13, "13  ای خداوند بر من کرم فرموده، به ظلمی که از خصمان خود می‌کشم نظر افکن! ای که برافرازندهٔ من از درهای موت هستی! "},
	{14, "14  تا همهٔٔ تسبیحات تو را بیان کنم در دروازه‌های دختر صهیون. در نجات تو شادی خواهم نمود. "},
	{15, "15  امّت‌ها به چاهی که کنده بودند خود افتادند؛ در دامی که نهفته بودند پای ایشان گرفتار شد. "},
	{16, "16  خداوند ْ خود را شناسانیده است و داوری کرده، و شریر از کار دست خود به دام گرفتار گردیده است. هجایون سلاه. "},
	{17, "17  شریران به هاویه خواهند برگشت و جمیع امّت‌هایی که خدا را فراموش می‌کنند، "},
	{18, "18  زیرا مسکین همیشه فراموش نخواهد شد؛ امید حلیمان تا به ابد ضایع نخواهد بود. "},
	{19, "19  برخیز ای خداوند تا انسان غالب نیاید. بر امّت‌ها به حضور تو داوری خواهد شد. "},
	{20, "20  ای خداوند ترس را بر ایشان مستولی گردان، تا امّت‌ها بدانند که انسانند. سلاه. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct fa10 poems[] = {
	{1, "1  ای خداوند چرا دور ایستاده‌ای و خود را در وقت‌های تنگی پنهان می‌کنی؟ "},
	{2, "2  از تکبّر شریران، فقیر سوخته می‌شود؛ در مشورتهایی که اندیشیده‌اند، گرفتار می‌شوند. "},
	{3, "3  زیرا که شریر به شهوات نفس خود فخر می‌کند، و آنکه می‌رباید شکر می‌گوید و خداوند را اهانت می‌کند. "},
	{4, "4  شریر در غرور خود می‌گوید، بازخواست نخواهد کرد. همهٔٔ فکرهای او اینست که خدایی نیست. "},
	{5, "5  راه‌های او همیشه استوار است. احکام تو از او بلند و بعید است. همهٔٔ دشمنان خود را به هیچ می‌شمارد. "},
	{6, "6  در دل خود گفته است، هرگز جنبش نخواهم خورد، و دُور به دُور بدی را نخواهم دید. "},
	{7, "7  دهان او از لعنت و مکر و ظلم پر است؛ زیر زبانش مشقّت و گناه است؛ "},
	{8, "8  در کمینهای دهات می‌نشیند؛ در جایهای مخفی بی‌گناه را می‌کشد؛ چشمانش برای مسکینان مراقب است؛ "},
	{9, "9  در جای مخفی مثل شیر در بیشهٔ خود کمین می‌کند؛ بجهت گرفتن مسکین کمین می‌کند؛ فقیر را به دام خود کشیده، گرفتار می‌سازد. "},
	{10, "10  پس کوفته و زبون می‌شود؛ و مساکین در زیر جباران او میافتند. "},
	{11, "11  در دل خود گفت، خدا فراموش کرده است؛ روی خود را پوشانیده و هرگز نخواهد دید. "},
	{12, "12  ای خداوند برخیز! ای خدا دست خود را برافراز و مسکینان را فراموش مکن! "},
	{13, "13  چرا شریر خدا را اهانت کرده، در دل خود می‌گوید، تو بازخواست نخواهی کرد؟ "},
	{14, "14  البته دیده‌ای زیرا که تو بر مشقّت و غم می‌نگری، تا به دست خود مکافات برسانی. مسکین امر خویش را به تو تسلیم کرده است. مددکار یتیمان تو هستی. "},
	{15, "15  بازوی گناهکار را بشکن. و امّا شریر را از شرارت او بازخواست کن تا آن را نیابی. "},
	{16, "16  خداوند پادشاه است تا ابدالآباد. امّت‌ها از زمین او هلاک خواهند شد. "},
	{17, "17  ای خداوند مسألت مسکینان را اجابت کرده‌ای، دل ایشان را استوار نموده‌ای و گوش خود را فراگرفته‌ای، "},
	{18, "18  تا یتیمان و کوفته‌شدگان را دادرسی کنی. انسانی که از زمین است، دیگر نترساند. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct fa11 poems[] = {
	{1, "1  [رای سالار مغنیان. مزمور داود] بر خداوند توکل می‌دارم. چرا به جانم می‌گویید، مثل مرغ به کوه خود بگریزید؟ "},
	{2, "2  زیرا اینک، شریران کمان را می‌کشند و تیر را به زه نهاده‌اند، تا بر راست‌دلان در تاریکی بیندازند. "},
	{3, "3  زیرا که ارکان منهدم می‌شوند و مرد عادل چه کند؟ "},
	{4, "4  خداوند در هیکل قدس خود است و کرسی خداوند در آسمان. چشمان او می‌نگرد، پلکهای وی بنی‌آدم را می‌آزماید. "},
	{5, "5  خداوند مرد عادل را امتحان می‌کند؛ و امّا از شریر و ظلم‌دوست، جان او نفرت می‌دارد. "},
	{6, "6  بر شریر دامها و آتش و کبریت خواهد بارانید، و باد سموم حصهٔ پیالهٔ ایشان خواهد بود. "},
	{7, "7  زیرا خداوند عادل است و عدالت را دوست می‌دارد، و راستان روی او را خواهند دید. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct fa12 poems[] = {
	{1, "1  [برای سالار مغنیان بر ثمانی. مزمور داود] ای خداوند نجات بده زیرا که مرد مقدّس نابود شده است و امناء از میان بنی‌آدم نایاب گردیده‌اند! "},
	{2, "2  همه به یکدیگر دروغ می‌گویند؛ به لبهای چاپلوس و دل منافق سخن می‌رانند. "},
	{3, "3  خداوند همهٔٔ لبهای چاپلوس را منقطع خواهد ساخت، و هر زبانی را که سخنان تکبرآمیز بگوید، "},
	{4, "4  که می‌گویند، به زبان خویش غالب می‌آییم. لبهای ما با ما است. کیست که بر ما خداوند باشد؟ "},
	{5, "5  خداوند می‌گوید، به‌سبب غارت مسکینان و نالهٔ فقیران، الآن برمی‌خیزم و او را در نجاتی که برای آن آه می‌کشد، برپا خواهم داشت. "},
	{6, "6  کلام خداوند کلام طاهر است، نقرهٔ مصفای در قالِ زمین که هفت مرتبه پاک شده است. "},
	{7, "7  تو ای خداوند ایشان را محافظت خواهی نمود؛ از این طبقه و تا ابدالآباد محافظت خواهی فرمود. "},
	{8, "8  شریران به هر جانب می‌خرامند، وقتی که خباثت در بنی‌آدم بلند می‌شود. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct fa13 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور داود] ای خداوند تا به کی همیشه مرا فراموش می‌کنی؟ تا به کی روی خود را از من خواهی پوشید؟ "},
	{2, "2  تا به کی در نفس خود مشورت بکنم و در دلم هرروزه غم خواهد بود؟ تا به کی دشمنم بر من سرافراشته شود؟ "},
	{3, "3  ای یهوه خدای من نظر کرده، مرا مستجاب فرما! چشمانم را روشن کن مبادا به خواب موت بخسبم. "},
	{4, "4  مبادا دشمنم گوید بر او غالب آمدم و مخالفانم از پریشانی‌ام شادی نمایند. "},
	{5, "5  و امّا من به رحمت تو توکل می‌دارم؛ دل من در نجات تو شادی خواهد کرد. "},
	{6, "6  برای خداوند سرود خواهم خواند زیرا که به من احسان نموده است. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct fa14 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور داود] احمق در دل خود می‌گوید که خدایی نیست. کارهای خود را فاسد و مکروه ساخته‌اند و نیکوکاری نیست. "},
	{2, "2  خداوند از آسمان بربنی‌آدم نظر انداخت تا ببیند که آیا فهیم و طالب خدایی هست. "},
	{3, "3  همه روگردانیده، با هم فاسد شده‌اند. نیکوکاری نیست یکی هم نی. "},
	{4, "4  آیا همهٔٔ گناهکاران بی‌معرفت هستند که قوم مرا می‌خورند، چنانکه نان می‌خورند، و خداوند را نمی‌خوانند؟ "},
	{5, "5  آنگاه ترس بر ایشان مستولی شد، زیرا خدا در طبقهٔ عادلان است. "},
	{6, "6  مشورت مسکین را خجل می‌سازید چونکه خداوند ملجای اوست. "},
	{7, "7  کاش که نجات اسرائیل از صهیون ظاهر می‌شد! چون خداوند اسیریِ قوم خویش را برگردانَدْ، یعقوب وجد خواهد نمود و اسرائیل شادمان خواهد گردید. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct fa15 poems[] = {
	{1, "1  [مزمور داود] ای خداوند کیست که در خیمهٔٔ تو فرود آید؟ و کیست که در کوه مقدّس تو ساکن گردد؟ "},
	{2, "2  آنکه بی‌عیب سالک باشد و عدالت را به جا آورد، و در دل خویش راستگو باشد؛ "},
	{3, "3  که به زبان خود غیبت ننماید؛ و به همسایهٔٔ خود بدی نکند و دربارهٔٔ اقارب خویش مذمت را قبول ننماید؛ "},
	{4, "4  که در نظر خود حقیر و خوار است و آنانی را که از خداوند می‌ترسند مکرم می‌دارد؛ و قسم به ضرر خود می‌خورد و تغییر نمی‌دهد. "},
	{5, "5  نقرهٔ خود را به سود نمی‌دهد و رشوه بر بی‌گناه نمی‌گیرد. آنکه این را به جا آوَرَد، تا ابدالآباد جنبش نخواهد خورد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct fa16 poems[] = {
	{1, "1  [مکتوم داود] ای خدا مرا محافظت فرما، زیرا برتو توکل می‌دارم. "},
	{2, "2  خداوند را گفتم، تو خداوند من هستی. نیکویی من نیست غیر از تو. "},
	{3, "3  و امّا مقدّسانی که در زمین‌اند و فاضلان، تمامی خوشی من در ایشان است. "},
	{4, "4  دردهای آنانی که عقب [خدای] دیگر می‌شتابند، بسیار خواهد شد. هدایای خونی ایشان را نخواهم ریخت، بلکه نام ایشان را به زبانم نخواهم آورد. "},
	{5, "5  خداوند نصیبِ قسمت و کاسهٔ من است. تو قرعهٔ مرا نگاه می‌داری. "},
	{6, "6  خِطّه‌های من به جایهای خوش افتاد. میراث بَهیّ به من رسیده است. "},
	{7, "7  خداوند را که مرا نصیحت نمود، متبارک می‌خوانم. شبانگاه نیز قلبم مرا تنبیه می‌کند. "},
	{8, "8  خداوند را همیشه پیش روی خود می‌دارم. چونکه به دست راست من است، جنبش نخواهم خورد. "},
	{9, "9  از این رو دلم شادی می‌کند و جلالم به وجد می‌آید؛ جسدم نیز در اطمینان ساکن خواهد شد. "},
	{10, "10  زیرا جانم را در عالم اموات ترک نخواهی کرد، و قدوس خود را نخواهی گذاشت که فساد را بیند. "},
	{11, "11  طریق حیات را به من خواهی آموخت. به حضور تو کمال خوشی است و به دست راست تو لذت‌ها تا ابدالآباد! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct fa17 poems[] = {
	{1, "1  [صلات داود] ای خداوند، عدالت را بشنو و به فریاد من توجه فرما! و دعای مرا که از لب بی‌ریا می‌آید، گوش بگیر! "},
	{2, "2  داد من از حضور تو صادر شود؛ چشمان تو راستی را ببیند. "},
	{3, "3  دل مرا آزموده‌ای، شبانگاه از آن تفقد کرده‌ای. مرا قال گذاشته‌ای و هیچ نیافته‌ای، زیرا عزیمت کردم که زبانم تجاوز نکند. "},
	{4, "4  و امّا کارهای آدمیان به کلام لبهای تو؛ خود را از راه‌های ظالم نگاه داشتم "},
	{5, "5  .5 قدمهایم به آثار تو قائم است، پس پایهایم نخواهد لغزید. "},
	{6, "6  ای خدا تو را خوانده‌ام زیرا که مرا اجابت خواهی نمود. گوش خود را به من فراگیر و سخن مرا بشنو. "},
	{7, "7  رحمتهای خود را امتیاز ده، ای که متوکلان خویش را به دست راست خود از مخالفان ایشان می‌رهانی. "},
	{8, "8  مرا مثل مردمک چشم نگاه دار؛ مرا زیر سایهٔ بال خود پنهان کن، "},
	{9, "9  از روی شریرانی که مرا خراب می‌سازند، از دشمنان جانم که مرا احاطه می‌کنند. "},
	{10, "10  دل فربهٔ خود را بسته‌اند. به زبان خویش سخنان تکبرآمیز می‌گویند. "},
	{11, "11  الآن قدمهای ما را احاطه کرده‌اند، و چشمان خود را دوخته‌اند تا ما را به زمین بیندازند. "},
	{12, "12  مَثَل او مَثَل شیری است که در دریدن حریص باشد، و مَثَل شیر ژیان که در بیشهٔ خود در کمین است. "},
	{13, "13  ای خداوند برخیز و پیش روی وی درآمده، او را بینداز و جانم را از شریر به شمشیر خود برهان، "},
	{14, "14  از آدمیان، ای خداوند، به دست خویش، از اهل جهان که نصیب ایشان در زندگانی است که شکم ایشان را به ذخایر خود پرساخته‌ای و از اولاد سیر شده، زیادی مال خود را برای اطفال خویش ترک می‌کنند. "},
	{15, "15  و امّا من روی تو را در عدالت خواهم دید، و چون بیدار شوم، از صورت تو سیر خواهم شد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct fa18 poems[] = {
	{1, "1  [برای سالار مغنیان، مزمور داود بندهٔٔ خداوند که کلام این سرود را به خداوند گفت، در روزی که خداوند او را از دست همهٔٔ دشمنانش و از دست شاؤل رهایی داد. پس گفت،] ای خداوند ! ای قوّت من! تو را محبّت می‌نمایم. "},
	{2, "2  خداوند صخرهٔ من است و ملجا و نجات‌دهندهٔٔ من. خدایم صخرهٔ من است که در او پناه می‌برم. سپر من و شاخ نجاتم و قلعهٔ بلند من. "},
	{3, "3  خداوند را که سزاوار کل حمد است، خواهم خواند. پس، از دشمنانم رهایی خواهم یافت. "},
	{4, "4  رَسَنهای موت مرا احاطه کرده، و سیلابهای شرارت مرا ترسانیده بود. "},
	{5, "5  رَسَنهای گور دور مرا گرفته بود و دامهای موت پیش روی من درآمده. "},
	{6, "6  در تنگی خود خداوند را خواندم و نزد خدای خویش استغاثه نمودم. او آواز مرا از هیکل خود شنید و استغاثهٔ من به حضورش به گوش وی رسید. "},
	{7, "7  زمین متزلزل و مرتعش شده، اساس کوه‌ها بلرزید و متزلزل گردید چونکه خشم او افروخته شد. "},
	{8, "8  دُخان از بینی او برآمد و نار از دهانش ملتهب گشت و آتشها از آن افروخته گردید. "},
	{9, "9  آسمان را خم کرده، نزول فرمود و زیر پای وی تاریکی غلیظ می‌بود. "},
	{10, "10  برکروبی سوار شده، پرواز نمود و بر بالهای باد طیران کرد. "},
	{11, "11  تاریکی را پردهٔ خود و خیمه‌ای گرداگرد خویش بساخت، تاریکی آبها و ابرهای متراکم را. "},
	{12, "12  از تابشِ پیش روی وی ابرهایش می‌شتافتند، تگرگ و آتشهای افروخته. "},
	{13, "13  و خداوند از آسمان رعد کرده، حضرت اعلی آواز خود را بداد، تگرگ و آتشهای افروخته را. "},
	{14, "14  پس تیرهای خود را فرستاده، ایشان را پراکنده ساخت، و برقها بینداخت و ایشان را پریشان نمود. "},
	{15, "15  آنگاه عمق‌های آب ظاهر شد و اساس ربع مسکون مکشوف گردید، از تنبیه تو ای خداوند، از نَفْخِهٔ باد بینی تو! "},
	{16, "16  پس، از اعلیٰ فرستاده، مرا برگرفت و از آبهای بسیار بیرون کشید. "},
	{17, "17  و مرا از دشمنان زورآورم رهایی داد و از خصمانم، زیرا که از من تواناتر بودند. "},
	{18, "18  در روز بلای من پیش رویم درآمدند، لیکن خداوند تکیه‌گاه من بود. "},
	{19, "19  و مرا بجای وسیع بیرون آورد؛ مرا نجات داد زیرا که در من رغبت می‌داشت. "},
	{20, "20  خداوند موافق عدالتم مرا جزا داد و به حسب طهارت دستم مرا مکافات رسانید. "},
	{21, "21  زیرا که راه‌های خداوند را نگاه داشته، و به خدای خویش عصیان نورزیده‌ام، "},
	{22, "22  و جمیع احکام او پیش روی من بوده است و فرائض او را از خود دور نکرده‌ام، "},
	{23, "23  و نزد او بی‌عیب بوده‌ام و خویشتن را از گناه خود نگاه داشته‌ام. "},
	{24, "24  پس خداوند مرا موافق عدالتم پاداش داده است و به حسب طهارت دستم در نظر وی. "},
	{25, "25  خویشتن را با رحیم، رحیم می‌نمایی، و با مرد کامل، خود را کامل می‌نمایی. "},
	{26, "26  خویشتن را با طاهر، طاهر می‌نمایی و با مکار، به مکر رفتار می‌کنی. "},
	{27, "27  زیرا قوم مظلوم را خواهی رهانید و چشمان متکبران را به زیر خواهی انداخت. "},
	{28, "28  زیرا که تو چراغ مرا خواهی افروخت؛ یهوه خدایم تاریکی مرا روشن خواهد گردانید. "},
	{29, "29  زیرا به مدد تو بر فوجها حمله می‌برم و به خدای خود از حصارها برمی‌جهم. "},
	{30, "30  و امّا خدا، طریق او کامل است و کلام خداوند مُصَفیٰ. او برای همهٔٔ متوکلان خود سپر است؛ "},
	{31, "31  زیرا کیست خدا غیر از یهوه؟ و کیست صخرهای غیر از خدای ما؟ "},
	{32, "32  خدایی که کمر مرا به قوّت بسته و راه‌های مرا کامل گردانیده است. "},
	{33, "33  پایهای مرا مثل آهو ساخته و مرا به مُقامهای اعلای من برپا داشته است. "},
	{34, "34  دستهای مرا برای جنگ تعلیم داده است، که کمان برنجین به بازویمن خم شد. "},
	{35, "35  سپر نجات خود را به من داده‌ای. دست راستت عمود من شده و مهربانی تو مرا بزرگ ساخته است. "},
	{36, "36  قدمهایم را زیرم وسعت دادی که پایهای من نلغزید. "},
	{37, "37  دشمنان خود را تعاقب نموده، بدیشان خواهم رسید و تا تلف نشوند بر نخواهم گشت. "},
	{38, "38  ایشان را فرو خواهم کوفت که نتوانند برخاست و زیر پاهای من خواهند افتاد. "},
	{39, "39  زیرا کمر مرا برای جنگ به قوّت بستهای و مخالفانم را زیر پایم انداخته‌ای. "},
	{40, "40  گردنهای دشمنانم را به من تسلیم کرده‌ای تا خصمان خود را نابود بسازم. "},
	{41, "41  فریاد برآوردند امّا رهاننده‌ای نبود؛ نزد خداوند، ولی ایشان را اجابت نکرد. "},
	{42, "42  ایشان را چون غبار پیش باد ساییده‌ام؛ مثل گِلِ کوچه‌ها ایشان را دور ریختهام. "},
	{43, "43  مرا از منازعه قوم رهانیده، سر امّت‌ها ساخته‌ای. قومی را که نشناخته بودم، مرا خدمت می‌نمایند. "},
	{44, "44  به مجرد شنیدن، مرا اطاعت خواهند کرد؛ فرزندان غربا نزد من تذلّل خواهند نمود. "},
	{45, "45  فرزندان غربا پژمرده می‌شوند و در قلعه‌های خود خواهند لرزید. "},
	{46, "46  خداوند زنده است و صخرهٔ من متبارک باد، و خدای نجات من متعال! "},
	{47, "47  خدایی که برای من انتقام می‌گیرد و قومها را زیر من مغلوب می‌سازد. "},
	{48, "48  مرا از دشمنانم رهانیده، برخصمانم بلند کرده‌ای و از مرد ظالم مرا خلاصی داده‌ای! "},
	{49, "49  لهذا ای خداوند تو را در میان امّت‌ها حمد خواهم گفت و به نام تو سرود خواهم خواند، "},
	{50, "50  که نجات عظیمی به پادشاه خود داده و به مسیح خویش رحمت نموده است. یعنی به داودو ذُرّیَت او تا ابدالآباد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct fa19 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور داود] آسمانْ جلال خدا را بیان می‌کند و فلکْ از عمل دستهایش خبر می‌دهد. "},
	{2, "2  روز سخن می‌راند تا روز و شب معرفت را اعلان می‌کند تا شب. "},
	{3, "3  سخن نیست و کلامی نی و آواز آنها شنیده نمی‌شود. "},
	{4, "4  قانون آنها در تمام جهان بیرون رفت و بیان آنها تا اقصای ربع مسکون. "},
	{5, "5  خیمه‌ای برای آفتاب در آنها قرار داد؛ و او مثل داماد از حجلهٔ خود بیرون می‌آید و مثل پهلوان از دویدن در میدان شادی می‌کند. "},
	{6, "6  خروجش از کرانهٔ آسمان است و مدارش تا به کرانهٔ دیگر؛ و هیچ چیز از حرارتش مستور نیست. "},
	{7, "7  شریعت خداوند کامل است و جان را برمی‌گرداند؛ شهادات خداوند امین است و جاهل را حکیم می‌گرداند. "},
	{8, "8  فرایض خداوند راست است و دل را شاد می‌سازد. امر خداوند پاک است و چشم را روشن می‌کند. "},
	{9, "9  ترس خداوند طاهر است و ثابت تا ابدالآباد. احکام خداوند حق و تماماً عدل است. "},
	{10, "10  از طلا مرغوبتر و از زرِ خالصِ بسیار. از شهد شیرینتر و از قطراتِ شانهٔ عسل. "},
	{11, "11  بندهٔٔ تو نیز از آنها متنبه می‌شود، و در حفظ آنها ثواب عظیمی است. "},
	{12, "12  کیست که سهوهای خود را بداند؟ مرا از خطایای مخفیام طاهر ساز. "},
	{13, "13  بنده‌ات را نیز از اعمال متکبرانه باز دار تا بر من مسلط نشود؛ آنگاه بی‌عیب و از گناه عظیم مبرا خواهم بود. "},
	{14, "14  سخنان زبانم و تفکر دلم منظور نظر تو باشد،ای خداوند که صخرهٔ من و نجات‌دهندهٔٔ من هستی! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct fa20 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور داود] 1 خداوند تو را در روز تنگی مستجاب فرماید. نام خدای یعقوب تو را سرافراز نماید. "},
	{2, "2  نصرت برای تو از قدس خود بفرستد و تو را از صهیون تأیید نماید. "},
	{3, "3  جمیع هدایای تو را به یاد آورد و قربانی‌های سوختنی تو را قبول فرماید. سلاه. "},
	{4, "4  موافق دل تو به تو عطا فرماید و همهٔٔ مشورتهای تو را به انجام رساند. "},
	{5, "5  به نجات تو خواهیم سرایید و به نام خدای خود، عَلَم خود را خواهیم افراشت. خداوند تمامی مسألت تو را به انجام خواهد رسانید. "},
	{6, "6  الآن دانسته‌ام که خداوند مسیح خود را می‌رهاند. از فلک قدس خود او را اجابت خواهد نمود، به قوّت نجات‌بخش دست راست خویش. "},
	{7, "7  اینان ارابه‌ها را و آنان اسبها را، امّا ما نام یهوه خدای خود را ذکر خواهیم نمود. "},
	{8, "8  ایشان خم شده، افتاده‌اند و امّا ما برخاسته، ایستاده‌ایم. "},
	{9, "9  ای خداوند نجات بده! پادشاه در روزی که بخوانیم، ما را مستجاب فرماید. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct fa21 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور داود.] ای خداوند در قوّت تو پادشاه شادی می‌کند و در نجات تو چه بسیار به وجد خواهد آمد. "},
	{2, "2  مراد دل او را به وی بخشیدی و مسألت زبانش را از او دریغ نداشتی. سلاه. "},
	{3, "3  زیرابه برکات نیکو بر مراد او سبقت جستی. تاجی از زرِ خالص برسر وی نهادی. "},
	{4, "4  حیات را از تو خواست و آن را به وی دادی، و طول ایام را تا ابدالآباد. "},
	{5, "5  جلال او به‌سبب نجات تو عظیم شده. اکرام و حشمت را بر او نهاده‌ای. "},
	{6, "6  زیرا او را مبارک ساخته‌ای تا ابدالآباد. به حضور خود او را بی‌نهایت شادمان گردانیده‌ای. "},
	{7, "7  زیرا که پادشاه بر خداوند توکل می‌دارد، و به رحمت حضرت اعلیٰ جنبش نخواهد خورد. "},
	{8, "8  دست تو همهٔٔ دشمنانت را خواهد دریافت. دست راست تو آنانی را که از تو نفرت دارند خواهد دریافت. "},
	{9, "9  در وقت غضب خود، ایشان را چون تنور آتش خواهی ساخت. خداوند ایشان را در خشم خود خواهد بلعید و آتشْ ایشان را خواهد خورد. "},
	{10, "10  ثمرهٔٔ ایشان را از زمین هلاک خواهی ساخت و ذریت ایشان را از میان بنی‌آدم. "},
	{11, "11  زیرا قصد بدی برای تو کردند و مکایدی را اندیشیدند که آن را نتوانستند بجا آوَرْد. "},
	{12, "12  زیرا که ایشان را روگردان خواهی ساخت. بر زه‌های خود تیرها را به روی ایشان نشان خواهی گرفت. "},
	{13, "13  ای خداوند در قوّت خود متعال شو. جبروت تو را ترنم و تسبیح خواهیم خواند. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct fa22 poems[] = {
	{1, "1  [برای سالار مغنیان بر غزالهٔ صبح. مزمور داود] ای خدای من، ای خدای من، چرا مرا ترک کرده‌ای و از نجات من و سخنان فریادم دور هستی؟ "},
	{2, "2  ای خدای من، در روز می‌خوانم و مرا اجابت نمی‌کنی، در شب نیز؛ ومرا خاموشی نیست. "},
	{3, "3  و امّا تو قدوس هستی، ای که بر تسبیحات اسرائیل نشسته‌ای. "},
	{4, "4  پدران ما بر تو توکل داشتند؛ بر تو توکل داشتند و ایشان را خلاصی دادی؛ "},
	{5, "5  نزد تو فریاد برآوردند و رهایی یافتند؛ بر تو توکل داشتند، پس خجل نشدند. "},
	{6, "6  و امّا من کِرم هستم و انسان نی؛ عار آدمیان هستم و حقیر شمرده شدهٔ قوم. "},
	{7, "7  هرکه مرا بیند به من استهزا می‌کند. لبهای خود را باز می‌کنند و سرهای خود را می‌جنبانند [و می‌گویند]، "},
	{8, "8  بر خداوند توکل کن پس او را خلاصی بدهد. او را برهاند چونکه به وی رغبت می‌دارد. "},
	{9, "9  زیرا که تو مرا از شکم بیرون آوردی؛ وقتی که بر آغوش مادر خود بودم مرا مطمئن ساختی. "},
	{10, "10  از رحم بر تو انداخته شدم؛ از شکم مادرم خدای من تو هستی. "},
	{11, "11  از من دور مباش زیرا تنگی نزدیک است و کسی نیست که مدد کند. "},
	{12, "12  گاوان نرِ بسیار دور مرا گرفته‌اند؛ زورمندان باشان مرا احاطه کرده‌اند. "},
	{13, "13  دهان خود را بر من باز کردند، مثل شیر درندهٔ غران. "},
	{14, "14  مثل آب ریخته شده‌ام و همهٔٔ استخوانهایم از هم گسیخته؛ دلم مثل موم گردیده، در میان احشایم گداخته شده است. "},
	{15, "15  قوّت من مثل سفال خشک شده و زبانم به کامم چسبیده؛ و مرا به خاک موت نهاده‌ای. "},
	{16, "16  زیرا سگان دور مرا گرفته‌اند؛ جماعت اشرار مرا احاطه کرده، دستها و پایهای مرا سفتهاند. "},
	{17, "17  همهٔٔ استخوانهای خود را می‌شمارم. ایشان به من چشم دوخته، می‌نگرند. "},
	{18, "18  رخت مرا در میان خود تقسیم کردند و بر لباس من قرعه انداختند. "},
	{19, "19  امّا تو ای خداوند، دور مباش! ای قوّت من، برای نصرت من شتاب کن. "},
	{20, "20  جان مرا از شمشیر خلاص کن و یگانهٔ مرا از دست سگان. "},
	{21, "21  مرا از دهان شیر خلاصی ده، ای که از میان شاخهای گاو وحشی مرا اجابت کرده‌ای. "},
	{22, "22  نام تو را به برادران خود اعلام خواهم کرد؛ در میان جماعت تو را تسبیح خواهم خواند. "},
	{23, "23  ای ترسندگان خداوند او را حمد گویید؛ تمام ذریت یعقوب او را تمجید نمایید و جمیع ذریت اسرائیل از وی بترسید. "},
	{24, "24  زیرا مسکنت مسکین را حقیر و خوار نشمرده، و روی خود را از او نپوشانیده است؛ و چون نزد وی فریاد برآورد، او را اجابت فرمود. "},
	{25, "25  تسبیح من در جماعت بزرگ از تو است. نذرهای خود را به حضور ترسندگانت ادا خواهم نمود. "},
	{26, "26  حلیمان غذا خورده، سیر خواهند شد؛ و طالبان خداوند او را تسبیح خواهند خواند؛ و دلهای شما زیست خواهد کرد تا ابدالآباد. "},
	{27, "27  جمیع کرانه‌های زمین متذکر شده، بسوی خداوند بازگشت خواهند نمود؛ و همهٔٔ قبایل امّت‌ها به حضور تو سجده خواهند کرد. "},
	{28, "28  زیرا سلطنت از آن خداوند است و او بر امّت‌ها مسلط است. "},
	{29, "29  همهٔ متموّلان زمین غذا خورده، سجده خواهند کرد؛ و به حضور وی هر که به خاک فرو می‌رود رکوع خواهد نمود؛ و کسی جان خود را زنده نخواهد ساخت. "},
	{30, "30  ذریتی او را عبادت خواهند کرد و دربارهٔٔ خداوند طبقهٔ بعد را اِخبار خواهند نمود. "},
	{31, "31  ایشان خواهند آمد و از عدالت او خبر خواهند داد قومی را که متولد خواهند شد، که او این کار کرده است. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view23() {
struct fa23 poems[] = {
	{1, "1  [مزمور داود] خداوند شبان من است؛ محتاج به هیچ چیز نخواهم بود. "},
	{2, "2  در مرتعهای سبز مرا می‌خواباند. نزد آبهای راحت مرا رهبری می‌کند. "},
	{3, "3  جان مرا برمی‌گرداند و به خاطر نام خود به راه‌های عدالت هدایتم می‌نماید. "},
	{4, "4  چون در وادی سایهٔ موت نیز راه روم از بدی نخواهم ترسید زیرا تو با من هستی؛ عصا و چوبدستی تو مرا تسلی خواهد داد. "},
	{5, "5  سفرهای برای من به حضور دشمنانم می‌گسترانی. سر مرا به روغن تدهین کرده‌ای و کاسهام لبریز شده است. "},
	{6, "6  هرآینه نیکویی و رحمت تمام ایام عمرم در پی من خواهد بود و در خانهٔ خداوند ساکن خواهم بود تا ابدالآباد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view24() {
struct fa24 poems[] = {
	{1, "1  [مزمور داود] زمین و پُری آن از آن خداوند است، ربعمسکون و ساکنان آن. "},
	{2, "2  زیرا که او اساس آن را بر دریاها نهاد و آن را بر نهرها ثابت گردانید. "},
	{3, "3  کیست که به کوه خداوند برآید؟ و کیست که به مکان قدس او ساکن شود؟ "},
	{4, "4  او که پاک دست و صافدل باشد، که جان خود را به بطالت ندهد و قسم دروغ نخورد. "},
	{5, "5  او برکت را از خداوند خواهد یافت، و عدالت را از خدای نجات خود. "},
	{6, "6  این است طبقهٔ طالبان او، طالبان روی تو ای [خدای] یعقوب. سِلاه. "},
	{7, "7  ای دروازه‌ها سرهای خود را برافرازید! ای درهای ابدی برافراشته شوید تا پادشاه جلالداخل شود! "},
	{8, "8  این پادشاه جلال کیست؟ خداوند قدیر و جبار، خداوند که در جنگ جبار است! "},
	{9, "9  ای دروازه‌ها، سرهای خود را برافرازید! ای درهای ابدی برافرازید تا پادشاه جلال داخل شود! "},
	{10, "10  این پادشاه جلال کیست؟ یَهُوَه صَبایوت پادشاه جلال اوست! سلاه. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view25() {
struct fa25 poems[] = {
	{1, "1  [مزمور داود] ای خداوند، بسوی تو جان خود را برمیافرازم. ای خدای من، بر تو توکل می‌دارم؛ "},
	{2, "2  پس مگذار که خجل بشوم و دشمنانم بر من فخر نمایند. "},
	{3, "3  بلی، هر که انتظار تو می‌کشد خجل نخواهد شد. آنانی که بی‌سبب خیانت می‌کنند خجل خواهند گردید. "},
	{4, "4  ای خداوند، طریق‌های خود را به من بیاموز و راه‌های خویش را به من تعلیم ده. "},
	{5, "5  مرا به راستیِ خود سالک گردان و مرا تعلیم ده زیرا تو خدای نجات من هستی. تمامی روز منتظر تو بوده‌ام. "},
	{6, "6  ای خداوند، احسانات و رحمتهای خود را به یاد آور چونکه آنها از ازل بوده است. "},
	{7, "7  خطایای جوانی و عصیانم را به یاد میاور. ای خداوند به رحمت خود و به خاطر نیکویی خویش مرا یاد کن. "},
	{8, "8  خداوند نیکو و عادل است، پس به گناهکاران طریق را خواهد آموخت. "},
	{9, "9  مسکینان را به انصاف رهبری خواهد کرد و به مسکینان طریق خود را تعلیم خواهد داد. "},
	{10, "10  همهٔ راه‌های خداوند رحمت و حق است برای آنانی که عهد و شهادات او را نگاه می‌دارند. "},
	{11, "11  ای خداوند به خاطر اسم خود، گناه مرا بیامرز زیرا که بزرگ است. "},
	{12, "12  کیست آن آدمی که از خداوند می‌ترسد؟ او را بطریقی که اختیار کرده است خواهد آموخت. "},
	{13, "13  جان او در نیکویی شب را بسر خواهد برد و ذریت او وارث زمین خواهند شد. "},
	{14, "14  سرّ خداوند با ترسندگان او است و عهد او تا ایشان را تعلیم دهد. "},
	{15, "15  چشمان من دائماً بسوی خداوند است زیرا که او پایهای مرا از دام بیرون می‌آورد. "},
	{16, "16  بر من ملتفت شده، رحمت بفرما زیرا که منفرد و مسکین هستم. "},
	{17, "17  تنگیهای دل من زیاد شده است. مرا از مشقتهای من بیرون آور. "},
	{18, "18  بر مسکنت و رنج من نظر افکن و جمیع خطایایم را بیامرز. "},
	{19, "19  بر دشمنانم نظر کن زیرا که بسیارند و به کینهٔ تلخ به من کینه می‌ورزند. "},
	{20, "20  جانم را حفظ کن و مرا رهایی ده تا خجل نشوم زیرا بر تو توکل دارم. "},
	{21, "21  کمال و راستی حافظ من باشند زیرا که منتظر تو هستم. "},
	{22, "22  ای خدا، اسرائیل را خلاصی ده، از جمیع مشقتهای وی. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view26() {
struct fa26 poems[] = {
	{1, "1  [مزمور داود] ای خداوند، مرا داد بده زیرا که من در کمال خود رفتار نموده‌ام و بر خداوند توکل داشته‌ام، پس نخواهم لغزید. "},
	{2, "2  ای خداوند مرا امتحان کن و مرا بیازما. باطن و قلب مرا مصفّی گردان. "},
	{3, "3  زیرا که رحمت تو در مدّ نظر من است و در راستی تو رفتار نموده‌ام؛ "},
	{4, "4  با مردان باطل ننشستهام و با منافقین داخل نخواهم شد. "},
	{5, "5  از جماعت بدکاران نفرت می‌دارم و با طالحین نخواهم نشست. "},
	{6, "6  دستهای خود را در صفا می‌شویم. مذبح تو را ای خداوند طواف خواهم نمود، "},
	{7, "7  تا آواز حمد تو را بشنوانم و عجایب تو را اخبار نمایم. "},
	{8, "8  ای خداوند محل خانهٔ تو را دوست می‌دارم و مقام سکونت جلال تو را. "},
	{9, "9  جانم را با گناهکارانجمع مکن و نه حیات مرا با مردمان خونریز، "},
	{10, "10  که در دستهای ایشان آزار است و دست راست ایشان پر از رشوه است. "},
	{11, "11  و امّا من در کمال خود سالک می‌باشم. مرا خلاصی ده و بر من رحم فرما. "},
	{12, "12  پایم در جای هموار ایستاده است. خداوند را در جماعتها متبارک خواهم خواند. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view27() {
struct fa27 poems[] = {
	{1, "1  [مزمور داود] خداوند نور من و نجات من است؛ از کِه بترسم؟ خداوند ملجای جان من است؛ از کِه هراسان شوم؟ "},
	{2, "2  چون شریران بر من نزدیک آمدند تا گوشت مرا بخورند، یعنی خصمان و دشمنانم، ایشان لغزیدند و افتادند. "},
	{3, "3  اگر لشکری بر من فرود آید، دلم نخواهد ترسید. اگر جنگ بر من برپا شود، در این نیز اطمینان خواهم داشت. "},
	{4, "4  یک چیز از خداوند خواستم و آن را خواهم طلبید، که تمام ایام عمرم در خانهٔ خداوند ساکن باشم تا جمال خداوند را مشاهده کنم و در هیکل او تفکر نمایم. "},
	{5, "5  زیرا که در روز بلا مرا در سایبان خود نهفته، در پردهٔ خیمهٔٔ خود، مرا مخفی خواهد داشت و مرا بر صخره بلند خواهد ساخت. "},
	{6, "6  و الآن سرم بر دشمنانم گرداگردم برافراشته خواهد شد. قربانی‌های شادکامی را در خیمهٔٔ او خواهم گذرانید و برای خداوند سرود و تسبیح خواهم خواند. "},
	{7, "7  ای خداوند چون به آواز خود می‌خوانم، مرا بشنو و رحمت فرموده، مرا مستجاب فرما. "},
	{8, "8  دل من به تو می‌گوید [که گفته‌ای]، روی مرا بطلبید.بلی روی تو را ای خداوند خواهم طلبید. "},
	{9, "9  روی خود را از من مپوشان و بندهٔٔ خود را در خشم برمگردان. تو مددکار من بوده‌ای. ای خدای نجاتم، مرا رد مکن و ترک منما. "},
	{10, "10  چون پدر و مادرم مرا ترک کنند، آنگاه خداوند مرا برمی‌دارد. "},
	{11, "11  ای خداوند طریق خود را به من بیاموز و به‌سبب دشمنانم مرا به راه راست هدایت فرما. "},
	{12, "12  مرا به خواهش خصمانم مسپار، زیرا که شهود کذبه و دمندگان ظلم بر من برخاستهاند. "},
	{13, "13  اگر باور نمی‌کردم که احسان خداوند را در زمین زندگان ببینم. "},
	{14, "14  برای خداوند منتظر باش و قویّ شو و دلت را تقویّت خواهد داد. بلی منتظر خداوند باش. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view28() {
struct fa28 poems[] = {
	{1, "1  [مزمور داود] ای خداوند، نزد تو فریاد برمی‌آورم.ای صخرهٔ من، از من خاموش مباش، مبادا اگر از من خاموش شوی، مثل آنانی باشم که به حفره فرو می‌روند. "},
	{2, "2  آواز تضرع مرا بشنو چون نزد تو استغاثه می‌کنم و دست خود را به محراب قدس تو برمیافرازم. "},
	{3, "3  مرا با شریران و بدکاران مکش که با همسایگان خود سخن صلح‌آمیز می‌گویند و آزار در دل ایشان است. "},
	{4, "4  آنها را به حسب کردار ایشان و موافق اعمال زشت ایشان بده آنها را مطابق عمل دست ایشان بده و رفتار ایشان را به خود ایشان رد نما. "},
	{5, "5  چونکه در اعمال خداوند و صنعت دست وی تفکر نمی‌کنند. ایشان را منهدم خواهی ساخت و بنا نخواهی نمود. "},
	{6, "6  خداوند متبارک باد زیرا که آواز تضرع مراشنیده است. "},
	{7, "7  خداوند قوّت من و سپر من است. دلم بر او توکل داشت و مدد یافته‌ام. پس دل من به وجد آمده است و به سرود خود او را حمد خواهم گفت. "},
	{8, "8  خداوند قوّت ایشان است و برای مسیح خود قلعهٔ نجات. "},
	{9, "9  قوم خود را نجات ده و میراث خود را مبارک فرما. ایشان را رعایت کن و برافراز تا ابدالآباد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view29() {
struct fa29 poems[] = {
	{1, "1  [مزمور داود] ای فرزندان خدا، خداوند را توصیف کنید. جلال و قوّت را برای خداوند توصیف نمایید. "},
	{2, "2  خداوند را به جلال اسم او تمجید نمایید. خداوند را در زینت قدوسیّت سجده کنید. "},
	{3, "3  آواز خداوند فوق آبها است. خدای جلال رعد می‌دهد. خداوند بالای آبهای بسیار است. "},
	{4, "4  آواز خداوند با قوّت است. آواز خداوند با جلال است. "},
	{5, "5  آواز خداوند سروهای آزاد را می‌شکند. خداوند سروهای آزاد لبنان را می‌شکند. "},
	{6, "6  آنها را مثل گوساله می‌جهاند. لبنان و سریون را مثل بچهٔ گاو وحشی. "},
	{7, "7  آواز خداوند زبانه‌های آتش را می‌شکافد. "},
	{8, "8  آواز خداوند صحرا را متزلزل می‌سازد. خداوند صحرای قادِشْ را متزلزل می‌سازد. "},
	{9, "9  آواز خداوند غزالها را به درد زه می‌اندازد، و جنگل را بیبرگ می‌گرداند. و در هیکل او جمیعاً جلال را ذکر می‌کنند. "},
	{10, "10  خداوند بر طوفان جلوس نموده. خداوند نشسته است پادشاه تا ابدالآباد. "},
	{11, "11  خداوند قوم خود را قوّت خواهد بخشید. خداوند قوم خود را به سلامتی مبارک خواهد نمود. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view30() {
struct fa30 poems[] = {
	{1, "1  [سرود برای متبّرک ساختن خانه. مزمور داود] ای خداوند تو را تسبیح می‌خوانم زیراکه مرا بالا کشیدی و دشمنانم را بر من مفتخر نساختی. "},
	{2, "2  ای یهوه خدای من، نزد تو استغاثه نمودم و مرا شفا دادی. "},
	{3, "3  ای خداوند جانم را از حفره برآوردی. مرا زنده ساختی تا به هاویه فرونروم. "},
	{4, "4  ای مقدّسان خداوند او را بسرایید و به ذکر قدوسیّت او حمد گویید! "},
	{5, "5  زیرا که غضب او لحظهای است و در رضامندی او زندگانی. شامگاه گریه نزیل می‌شود. صبحگاهان شادی رخ می‌نماید. "},
	{6, "6  و امّا من در کامیابی خود گفتم، جنبش نخواهم خورد تا ابدالآباد. "},
	{7, "7  ای خداوند به رضامندی خود کوه مرا در قوّت ثابت گردانیدی و چون روی خود را پوشانیدی پریشان شدم. "},
	{8, "8  ای خداوند نزد تو فریاد برمی‌آورم و نزد خداوند تضرع می‌نمایم. "},
	{9, "9  در خون من چه فایده است چون به حفره فرو روم؟ آیا خاکْ تو را حمد می‌گوید و راستی تو را اخبار می‌نماید؟ "},
	{10, "10  ای خداوند بشنو و به من کرم فرما. ای خداوند مددکار من باش. "},
	{11, "11  ماتم مرا برای من به رقص مبدل ساخته‌ای. پلاس را از من بیرون کرده و کمر مرا به شادی بستهای. "},
	{12, "12  تا جلالم ترا سرود خواند و خاموش نشود. ای یهوه خدای من، تو را حمد خواهم گفت تا ابدالآباد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view31() {
struct fa31 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور داود] ای خداوند بر تو توکل دارم؛ پسخجل نشوم تا به ابد. در عدالت خویش مرا نجات بده. "},
	{2, "2  گوش خود را به من فراگیر و مرا به زودی برهان. برایم صخرهای قوی و خانه‌ای حصین باش تا مرا خلاصی دهی. "},
	{3, "3  زیرا صخره و قلعهٔ من تو هستی. به خاطر نام خود مرا هدایت و رهبری فرما. "},
	{4, "4  مرا از دامی که برایم پنهان کرده‌اند بیرون آور. "},
	{5, "5  زیرا قلعهٔ من تو هستی. روح خود را به دست تو می‌سپارم. ای یهوه، خدای حق، تو مرا فدیه دادی. "},
	{6, "6  از آنانی که اباطیل دروغ را پیروی می‌کنند نفرت می‌کنم. و امّا من بر خداوند توکل می‌دارم. "},
	{7, "7  به رحمت تو وجد و شادی می‌کنم زیرا مشقت مرا دیده و جانم را در تنگیها شناختهای؛ "},
	{8, "8  مرا به دست دشمن اسیر نساخته‌ای؛ پایهای مرا بجای وسیع قائم گردانیده‌ای. "},
	{9, "9  ای خداوند بر من رحمت فرما زیرا در تنگی هستم. چشم من از غصه کاهیده شد، بلکه جانم و جسدم نیز. "},
	{10, "10  زیرا که حیاتم از غم و سالهایم از ناله فانی گردیده است. قوّتم از گناهم ضعیف و استخوانهایم پوسیده شد. "},
	{11, "11  نزد همهٔٔ دشمنانم عار گردیده‌ام. خصوصاً نزد همسایگان خویش؛ و باعث خوف آشنایان شده‌ام. هرکه مرا بیرون بیند از من می‌گریزد. "},
	{12, "12  مثل مرده از خاطر فراموش شده‌ام و مانند ظرفِ تلف شده گردیده‌ام. "},
	{13, "13  زیرا که بهتان را از بسیاری شنیدم و خوف گرداگرد من می‌باشد، زیرا بر من با هم مشورت می‌کنند و در قصد جانم تفکر می‌نمایند. "},
	{14, "14  و امّا من بر تو ای خداوند توکل می‌دارم وگفته‌ام خدای من تو هستی. "},
	{15, "15  وقت‌های من در دست تو می‌باشد. مرا از دست دشمنانم و جفاکنندگانم خلاصی ده. "},
	{16, "16  روی خود را بر بنده‌ات تابان ساز و مرا به رحمت خود نجات بخش. "},
	{17, "17  ای خداوند خجل نشوم چونکه تو را خوانده‌ام. شریران خجل شوند و در حفره خاموش باشند. "},
	{18, "18  لبهای دروغگو گنگ شود که به درشتی و تکبر و استهانت بر عادلان سخن می‌گوید. "},
	{19, "19  زهی عظمت احسان تو که برای ترسندگانت ذخیره کرده‌ای و برای متوکّلانت پیش بنی‌آدم ظاهر ساخته‌ای. "},
	{20, "20  ایشان را در پردهٔ روی خود از مکاید مردم خواهی پوشانید. ایشان را در خیمه‌ای از عداوت زبانها مخفی خواهی داشت. "},
	{21, "21  متبارک باد خداوند که رحمت عجیب خود را در شهر حصین به من ظاهر کرده است. "},
	{22, "22  و امّا من در حیرت خود گفتم که از نظر تو منقطع شده‌ام. لیکن چون نزد تو فریاد کردم آواز تضرع مرا شنیدی. "},
	{23, "23  ای جمیع مقدّسانِ خداوند او را دوست دارید. خداوند اُمنا را محفوظ می‌دارد و متکبران را مجازات کثیر می‌دهد. "},
	{24, "24  قوی باشید و دل شما را تقویت خواهد داد، ای همگانی که برای خداوند انتظار می‌کشید! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view32() {
struct fa32 poems[] = {
	{1, "1  [قصیدهٔ داود] خوشابحال کسی که عصیان او آمرزیده شد و گناه وی مستور گردید. "},
	{2, "2  خوشابحال کسی که خداوند به وی جرمی در حساب نیاوَرَد و در روح او حیلهای نمی‌باشد. "},
	{3, "3  هنگامی که خاموش می‌بودم، استخوانهایم پوسیده می‌شد از نعرهای که تمامی روز میزدم. "},
	{4, "4  چونکه دست تو روز و شب بر من سنگین می‌بود. رطوبتم به خشکیِ تابستان مبدل گردید، سلاه. "},
	{5, "5  به گناه خود نزد تو اعتراف کردم و جرم خود را مخفی نداشتم. گفتم، عصیان خود را نزد خداوند اقرار می‌کنم. پس تو آلایش گناهم را عفو کردی، سلاه. "},
	{6, "6  از این رو هر مقدّسی در وقت اجابت نزد تو دعا خواهد کرد. وقتی که آبهای بسیار به سَیَلان آید، هرگز بدو نخواهد رسید. "},
	{7, "7  تو ملجای من هستی مرا از تنگی حفظ خواهی کرد. مرا به سرودهای نجات احاطه خواهی نمود، سلاه. "},
	{8, "8  تو را حکمت خواهم آموخت و به راهی که باید رفت ارشاد خواهم نمود و تو را به چشم خود که بر تو است نصیحت خواهم فرمود. "},
	{9, "9  مثل اسب و قاطر بی‌فهم مباشید که آنها را برای بستن به دهنه و لگام زینت می‌دهند، والاّ نزدیک تو نخواهند آمد. "},
	{10, "10  غمهای شریر بسیار می‌باشد، امّا هر که بر خداوند توکل دارد رحمت او را احاطه خواهد کرد. "},
	{11, "11  ای صالحان در خداوند شادی و وجد کنید و ای همهٔٔ راست‌دلان ترنّم نمایید. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view33() {
struct fa33 poems[] = {
	{1, "1  ای صالحان در خداوند شادی نمایید،زیرا که تسبیح خواندن راستان را می‌شاید. "},
	{2, "2  خداوند را با بربط حمد بگویید؛ با عود ده تار او را سرود بخوانید. "},
	{3, "3  سرودی تازه برای او بسرایید؛ نیکو بنوازید با آهنگ بلند. "},
	{4, "4  زیرا کلام خداوند مستقیم است و جمیع کارهای او با امانت است. "},
	{5, "5  عدالت و انصاف را دوست می‌دارد. جهان از رحمت خداوند پر است. "},
	{6, "6  به کلام خداوند آسمانها ساخته شد و کل جنود آنها به نَفْخِهٔ دهان او. "},
	{7, "7  آبهای دریا را مثل توده جمع می‌کند و لجّه‌ها را در خزانه‌ها ذخیره می‌نماید. "},
	{8, "8  تمامیِ اهل زمین از خداوند بترسند؛ جمیع سکنهٔ ربع مسکون از او بترسند. "},
	{9, "9  زیرا که او گفت و شد؛ او امر فرمود و قایم گردید. "},
	{10, "10  خداوند مشورت امّت‌ها را باطل می‌کند؛ تدبیرهای قبائل را نیست می‌گرداند. "},
	{11, "11  مشورت خداوند قائم است تا ابدالآباد؛ تدابیر قلب او تا دهرالدّهور. "},
	{12, "12  خوشابحال امّتی که یهوه خدای ایشان است و قومی که ایشان را برای میراث خود برگزیده است. "},
	{13, "13  از آسمان خداوند نظر افکند و جمیع بنی‌آدم را نگریست. "},
	{14, "14  از مکان سکونت خویش نظر میافکند، برجمیع ساکنان جهان. "},
	{15, "15  او که دلهای ایشان را جمیعاً سرشته است و اعمال ایشان را درک نموده است. "},
	{16, "16  پادشاه به زیادتیِ لشکر خلاص نخواهد شد و جبار به بسیاری قوّت رهایی نخواهد یافت. "},
	{17, "17  اسب بجهت استخلاص باطل است و به شدت قوّت خود کسی را رهایی نخواهد داد. "},
	{18, "18  اینک چشم خداوند بر آنانی است که از او می‌ترسند، بر آنانی که انتظار رحمت او را می‌کشند. "},
	{19, "19  تا جان ایشان را از موت رهایی بخشد و ایشان را در قحط زنده نگاه دارد. "},
	{20, "20  جان ما منتظر خداوند می‌باشد. او اعانت و سپر ما است. "},
	{21, "21  زیرا که دل ما در او شادی می‌کند و در نام قدوس او توکّل می‌داریم. "},
	{22, "22  ای خداوند رحمت تو بر ما باد، چنانکه امیدوار تو بوده‌ایم. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view34() {
struct fa34 poems[] = {
	{1, "1  مزمور داود وقتی که منش خود را به حضور اَبِیمَلَک تغییر داد و از حضور او بیرون رانده شده، برفت خداوند را در هر وقت متبارک خواهمگفت. تسبیح او دائماً بر زبان من خواهد بود. "},
	{2, "2  جان من در خداوند فخر خواهد کرد. مسکینان شنیده، شادی خواهند نمود. "},
	{3, "3  خداوند را با من تکبیر نمایید. نام او را با یکدیگر برافرازیم. "},
	{4, "4  چون خداوند را طلبیدم، مرا مستجاب فرمود و مرا از جمیع ترسهایم خلاصی بخشید. "},
	{5, "5  بسوی او نظر کردند و منور گردیدند و رویهای ایشان خجل نشد. "},
	{6, "6  این مسکین فریاد کرد و خداوند او را شنید و او را از تمامیِ تنگیهایش رهایی بخشید. "},
	{7, "7  فرشتهٔ خداوند گرداگرد ترسندگان او است؛ اردو زده، ایشان را می‌رهاند. "},
	{8, "8  بچشید و ببینید که خداوند نیکو است. خوشابحال شخصی که بدو توکّل می‌دارد. "},
	{9, "9  ای مقدّسانِ خداوند از او بترسید زیرا که ترسندگان او را هیچ کمی نیست. "},
	{10, "10  شیربچگان بینوا شده، گرسنگی می‌کشند و امّا طالبان خداوند را به هیچ چیز نیکو کمی نخواهد شد. "},
	{11, "11  ای اطفال بیایید مرا بشنوید و ترس خداوند را به شما خواهم آموخت. "},
	{12, "12  کیست آن شخصی که آرزومند حیات است و طول ایام را دوست می‌دارد تا نیکویی را ببیند؟ "},
	{13, "13  زبانت را از بدی نگاه دار و لبهایت را از سخنان حیلهآمیز؛ "},
	{14, "14  از بدی اجتناب نما و نیکویی بکن؛ صلح را طلب نما و در پی آن بکوش. "},
	{15, "15  چشمان خداوند بسوی صالحان است و گوشهای وی بسوی فریاد ایشان. "},
	{16, "16  روی خداوند بسوی بدکاران است تا ذکر ایشان را از زمین منقطع سازد. "},
	{17, "17  چون [صالحان] فریاد برآوردند، خداوند ایشان را شنید و ایشان را از همهٔ تنگیهای ایشان رهایی بخشید. "},
	{18, "18  خداوند نزدیک شکستهدلان است و روح کوفتگان را نجات خواهد داد. "},
	{19, "19  زحمات مرد صالح بسیار است، امّا خداوند او را از همهٔٔ آنها خواهد رهانید. "},
	{20, "20  همهٔ استخوانهای ایشان را نگاه می‌دارد، که یکی از آنها شکسته نخواهد شد. "},
	{21, "21  شریر را شرارت هلاک خواهد کرد و از دشمنان مرد صالح مؤآخذه خواهد شد. "},
	{22, "22  خداوند جان بندگان خود را فدیه خواهد داد و از آنانی که بر وی توکّل دارند مؤآخذه نخواهد شد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view35() {
struct fa35 poems[] = {
	{1, "1  [مزمور داود] ای خداوند با خصمان من مخاصمه نما و جنگ کن با آنانی که با من جنگ می‌کنند. "},
	{2, "2  سپر و مِجَنّ را بگیر و به اعانت من برخیز، "},
	{3, "3  و نیزه را راست کن و راه را پیش روی جفاکنندگانم ببند و به جان من بگو من نجات تو هستم. "},
	{4, "4  خجل و رسوا شوند آنانی که قصد جان من دارند؛ و آنانی که بداندیش منند، برگردانیده و خجل شوند. "},
	{5, "5  مثل کاه پیش روی باد باشند و فرشتهٔ خداوند ایشان را براند. "},
	{6, "6  راه ایشان تاریکی و لغزنده باد و فرشتهٔ خداوند ایشان را تعاقب کند. "},
	{7, "7  زیرا دام خود را برای من بی‌سبب در حفره‌ای پنهان کردند که آن را برای جان من بیجهت کَنده بودند. "},
	{8, "8  هلاکت ناگهانی بدو برسد و دامی که پنهان کرد خودش را بگیرد و در آن به هلاکت گرفتار گردد. "},
	{9, "9  و امّا جان من در خداوند وجد خواهد کرد و در نجات او شادی خواهد نمود. "},
	{10, "10  همهٔٔ استخوانهایم می‌گویند، ای خداوند کیست مانند تو که مسکین را از شخصِ قویتر از او می‌رهاند و مسکین وفقیر را از تاراجکنندهٔ وی! "},
	{11, "11  شاهدان کینهور برخاستهاند. چیزهایی را که نمی‌دانستم از من می‌پرسند. "},
	{12, "12  به عوض نیکویی بدی به من می‌کنند. جان مرا بی‌کس گردانیده‌اند. "},
	{13, "13  و امّا من چون ایشان بیمار می‌بودند، پلاس می‌پوشیدم؛ جان خود را به روزه می‌رنجانیدم و دعایم به سینهام برمی‌گشت. "},
	{14, "14  مثل آنکه او دوست و برادرم می‌بود، سرگردان می‌رفتم. چون کسی که برای مادرش ماتم گیرد، از حزن خم می‌شدم. "},
	{15, "15  ولی چون افتادم شادیکنان جمع شدند. آن فرومایگان بر من جمع شدند، و کسانی که نشناخته بودم مرا دریدند و ساکت نشدند. "},
	{16, "16  مثل فاجرانی که برای نان مسخرگی می‌کنند، دندانهای خود را بر من میافشردند. "},
	{17, "17  ای خداوند تا به کی نظر خواهی کرد؟ جانم را از خرابیهای ایشان برهان و یگانهٔ مرا از شیربچگان. "},
	{18, "18  و تو را در جماعتِ بزرگ حمد خواهم گفت. ترا در میان قوم عظیم تسبیح خواهم خواند. "},
	{19, "19  تا آنانی که بی‌سبب دشمن منند، بر من فخر نکنند، و آنانی که بر من بی‌سبب بغض می‌نمایند، چشمک نزنند. "},
	{20, "20  زیرا برای سلامتیسخن نمی‌گویند و بر آنانی که در زمین آرامند، سخنان حیلهآمیز را تفکر می‌کنند. "},
	{21, "21  و دهان خود را بر من باز کرده، می‌گویند هَه‌هَه چشم ما دیده است. "},
	{22, "22  ای خداوند تو آن را دیده‌ای، پس سکوت مفرما. ای خداوند از من دور مباش. "},
	{23, "23  خویشتن را برانگیز و برای داد من بیدار شو، ای خدای من و خداوند من، برای دعوی من. "},
	{24, "24  ای یهوه خدایم مرا موافق عدل خود داد بده، مبادا بر من شادی نمایند. "},
	{25, "25  تا در دل خود نگویند، اینک مراد ما؛ تا نگویند او را بلعیده‌ایم! "},
	{26, "26  و آنانی که در بدیِ من شادند، با هم خجل و شرمنده شوند؛ و آنانی که بر من تکبر می‌کنند، به خجلت و رسوایی ملبس شوند. "},
	{27, "27  آنانی که خواهان حق منند ترنّم و شادی نمایند و دائماً گویند خداوند بزرگ است که به سلامتیِ بندهٔٔ خود رغبت دارد. "},
	{28, "28  و زبانم عدالت تو را بیان خواهد کرد و تسبیح تو را تمامیِ روز. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view36() {
struct fa36 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور داود بندهٔٔ خداوند] معصیت شریر در اندرون دل منمی‌گوید که ترس خدا در مد نظر او نیست. "},
	{2, "2  زیرا خویشتن را در نظر خود تملق می‌گوید تا گناهش ظاهر نشود و مکروه نگردد. "},
	{3, "3  سخنان زبانش شرارت و حیله است. از دانشمندی و نیکوکاری دست برداشته است. "},
	{4, "4  شرارت را بر بستر خود تفکر می‌کند. خود را به راه ناپسند قائم کرده، از بدی نفرت ندارد. "},
	{5, "5  ای خداوند رحمت تو در آسمانها است وامانت تو تا افلاک. "},
	{6, "6  عدالت تو مثل کوه‌های خداست و احکام تو لجهٔ عظیم. ای خداوند انسان و بهایم را نجات می‌دهی. "},
	{7, "7  ای خدا رحمت تو چه ارجمند است. بنی‌آدم زیر سایهٔ بالهای تو پناه می‌برند. "},
	{8, "8  از چربی خانهٔ تو شاداب می‌شوند. از نهر خوشیهای خود ایشان را می‌نوشانی. "},
	{9, "9  زیرا که نزد تو چشمهٔ حیات است و در نور تو نور را خواهیم دید. "},
	{10, "10  رحمت خود را برای عارفان خود مستدام فرما و عدالت خود را برای راست دلان. "},
	{11, "11  پای تکبر بر من نیاید و دست شریران مرا گریزان نسازد. "},
	{12, "12  در آنجا بدکرداران افتاده‌اند. ایشان انداخته شده‌اند و نمی‌توانند برخاست. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view37() {
struct fa37 poems[] = {
	{1, "1  [مزمور داود] به‌سبب شریران خویشتن را مشوشمساز و بر فتنهانگیزان حسد مبر. "},
	{2, "2  زیرا که مثل علف به زودی بریده می‌شوند و مثل علف سبز پژمرده خواهند شد. "},
	{3, "3  بر خداوند توکّل نما و نیکویی بکن. در زمین ساکن باش و از امانت پرورده شو. "},
	{4, "4  و در خداوند تمتع ببر، پس مسألت دل تو را به تو خواهد داد. "},
	{5, "5  طریق خود را به خداوند بسپار و بر وی توکّل کن که آن را انجام خواهد داد، "},
	{6, "6  و عدالت تو را مثل نور بیرون خواهد آورد و انصاف تو را مانند ظُهر. "},
	{7, "7  نزد خداوند ساکت شو و منتظر او باش و از شخص فرخنده طریق و مرد حیلهگر خود را مشوش مساز. "},
	{8, "8  از غضب برکنار شو و خشم را ترک کن. خود را مشوش مساز که البته باعث گناهخواهد شد. "},
	{9, "9  زیرا که شریران منقطع خواهند شد. و امّا منتظران خداوند وارث زمین خواهند بود. "},
	{10, "10  هان بعد از اندک زمانی شریر نخواهد بود. در مکانش تأمل خواهی کرد و نخواهد بود. "},
	{11, "11  و امّا حلیمان وارث زمین خواهند شد و از فراوانیِ سلامتی متلذذ خواهند گردید. "},
	{12, "12  شریر بر مرد عادل شورا می‌کند و دندانهای خود را بر او میافشرد. "},
	{13, "13  خداوند بر او خواهد خندید، زیرا می‌بیند که روز او می‌آید. "},
	{14, "14  شریران شمشیر را برهنه کرده و کمان را کشیده‌اند تا مسکین و فقیر را بیندازند و راستروان را مقتول سازند. "},
	{15, "15  شمشیر ایشان به دل خود ایشان فرو خواهد رفت و کمانهای ایشان شکسته خواهد شد. "},
	{16, "16  نعمتِ اندکِ یک مرد صالح بهتر است، از اندوخته‌های شریران کثیر. "},
	{17, "17  زیرا که بازوهای شریران، شکسته خواهد شد. و امّا صالحان را خداوند تأیید می‌کند. "},
	{18, "18  خداوند روزهای کاملان را می‌داند و میراث ایشان خواهد بود تا ابدالآباد. "},
	{19, "19  در زمان بلا خجل نخواهند شد، و در ایام قحط سیر خواهند بود. "},
	{20, "20  زیرا شریران هلاک می‌شوند و دشمنان خداوند مثل خرّمی مرتعها فانی خواهند شد. بلی مثل دُخان فانی خواهند گردید. "},
	{21, "21  شریر قرض می‌گیرد و وفا نمی‌کند و امّا صالح رحیم و بخشنده است. "},
	{22, "22  زیرا آنانی که از وی برکت یابند وارث زمین گردند. و امّا آنانی که ملعون ویاند، منقطع خواهند شد. "},
	{23, "23  خداوند قدمهای انسان را مستحکم می‌سازد، و در طریق‌هایش سرور می‌دارد. "},
	{24, "24  اگر چه بیفتد افکنده نخواهد شد زیرا خداوند دستشرا می‌گیرد. "},
	{25, "25  من جوان بودم و الآن پیر هستم و مرد صالح را هرگز متروک ندیده‌ام و نه نسلش را که گدای نان بشوند. "},
	{26, "26  تمامی روز رئوف است و قرض دهنده، و ذریت او مبارک خواهند بود. "},
	{27, "27  از بدی برکنار شو و نیکویی بکن. پس ساکن خواهی بود تا ابدالآباد. "},
	{28, "28  زیرا خداوند انصاف را دوست می‌دارد و مقدّسان خود را ترک نخواهد فرمود. ایشان محفوظ خواهند بود تا ابدالآباد. و امّا نسل شریر منقطع خواهد شد. "},
	{29, "29  صالحان وارث زمین خواهند بود و در آن تا به ابد سکونت خواهند نمود. "},
	{30, "30  دهان صالح حکمت را بیان می‌کند و زبان او انصاف را ذکر می‌نماید. "},
	{31, "31  شریعت خدای وی در دل اوست. پس قدمهایش نخواهد لغزید. "},
	{32, "32  شریر برای صالح کمین می‌کند و قصد قتل وی می‌دارد. "},
	{33, "33  خداوند او را در دستش ترک نخواهد کرد و چون به داوری آید بر وی فتوا نخواهد داد. "},
	{34, "34  منتظر خداوند باش و طریق او را نگاه دار تا تو را به وراثت زمین برافرازد. چون شریران منقطع شوند آن را خواهی دید. "},
	{35, "35  شریر را دیدم که ظلم پیشه بود و مثل درخت بومی سبز خود را به هر سو می‌کشید. "},
	{36, "36  امّا گذشت و اینک نیست گردید و او را جستجو کردم و یافت نشد. "},
	{37, "37  مرد کامل را ملاحظه کن و مرد راست را ببین زیرا که عاقبت آن مرد سلامتی است. "},
	{38, "38  امّا خطاکاران جمیعاً هلاک خواهند گردید و عاقبت شریران منقطع خواهد شد "},
	{39, "39  و نجات صالحان از خداوند است و در وقت تنگی او قلعهٔ ایشان خواهد بود. "},
	{40, "40  و خداوند ایشان را اعانت کرده، نجات خواهد داد. ایشان را از شریران خلاص کرده، خواهد رهانید زیرا بر او توکّل دارند. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view38() {
struct fa38 poems[] = {
	{1, "1  [مزمور داود برای تذکر] ای خداوند مرا در غضب خود توبیخ منما و در خشم خویش تأدیبم مفرما. "},
	{2, "2  زیرا که تیرهای تو در من فرو رفته و دست تو بر من فرود آمده است. "},
	{3, "3  در جسد من به‌سبب غضب تو صحتی نیست و در استخوانهایم به‌سبب خطای خودم سلامتی نی. "},
	{4, "4  زیرا گناهانم از سرم گذشته است. مثل بار گران از طاقتم سنگینتر شده. "},
	{5, "5  جراحات من متعفّن و مقروح شده است، به‌سبب حماقت من. "},
	{6, "6  به خود می‌پیچم و بی‌نهایت منحنی شده‌ام. تمامی روز ماتمکنان تردد می‌کنم. "},
	{7, "7  زیرا کمر من از سوزش پر شده است و در جسد من صحتی نیست. "},
	{8, "8  من بیحس و بی‌نهایت کوفته شده‌ام و از فغان دل خود نعره می‌زنم. "},
	{9, "9  ای خداوند تمامیِ آرزوی من در مد نظر تو است و ناله‌های من از تو مخفی نمی‌باشد. "},
	{10, "10  دل من میطپد و قوّتم از من رفته است و نور چشمانم نیز با من نیست. "},
	{11, "11  دوستان و رفیقانم از بلای من برکنار میایستند و خویشان من دور ایستاده‌اند. "},
	{12, "12  آنانی که قصد جانم دارند دام می‌گسترند و بداندیشانم سخنان فتنهانگیز می‌گویند و تمام روز حیله را تفکر می‌کنند. "},
	{13, "13  و امّا من مثل کر نمی‌شنوم؛ و مانند گُنگم که دهان خود را باز نکند. "},
	{14, "14  و مثل کسی گردیده‌ام که نمی‌شنود و کسی که در زبانش حجتی نباشد. "},
	{15, "15  زیرا که ای خداوند انتظار تو را می‌کشم. تو ای یهوه خدایم جواب خواهی داد. "},
	{16, "16  چونکه گفته‌ام مبادا بر من شادی نمایند و چون پایم بلغزد بر من تکبر کنند. "},
	{17, "17  زیرا که برای افتادن نصب شده‌ام و درد من همیشه پیش روی من است. "},
	{18, "18  زیرا گناهخود را اخبار می‌نمایم و از خطای خود غمگین هستم. "},
	{19, "19  امّا دشمنانم زنده و زورآورند و آنانی که بی‌سبب بر من بغض می‌نمایند بسیارند، "},
	{20, "20  و آنانی که به عوض نیکی به من بدی می‌رسانند. بر من عداوت می‌ورزند زیرا نیکویی را پیروی می‌کنم. "},
	{21, "21  ای خداوند مرا ترک منما. ای خدای من از من دور مباش، "},
	{22, "22  و برای اعانت من تعجیل فرما، ای خداوندی که نجات من هستی. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view39() {
struct fa39 poems[] = {
	{1, "1  [رای یَدُوتون سالار مغنیان. مزمور داود] گفتم راه‌های خود را حفظ خواهم کرد تا به زبانم خطا نورزم. دهان خود را به لجام نگاه خواهم داشت، مادامی که شریر پیش من است. "},
	{2, "2  من گنگ بودم و خاموش و از نیکویی نیز سکوت کردم و درد من به حرکت آمد. "},
	{3, "3  دلم در اندرونم گرم شد. چون تفکر می‌کردم آتش افروخته گردید. پس به زبان خود سخن گفتم. "},
	{4, "4  ای خداوند اجل مرا بر من معلوم ساز و مقدار ایامم را که چیست تا بفهمم چه قدر فانی هستم. "},
	{5, "5  اینک روزهایم را مثل یک وجب ساخته‌ای و زندگانیام در نظر تو هیچ است. یقیناً هر آدمی محض بطالت قرار داده شد، سِلاه. "},
	{6, "6  اینک، انسان در خیال رفتار می‌کند و محض بطالت مضطرب می‌گردد. ذخیره می‌کند و نمی‌داند کیست که از آن تمتع خواهد برد. "},
	{7, "7  و الآن ای خداوند برای چه منتظر باشم؟ امید من بر تو می‌باشد. "},
	{8, "8  مرا از همهٔٔ گناهانم برهان و مرا نزد جاهلان عار مگردان. "},
	{9, "9  من گنگ بودم وزبان خود را باز نکردم زیرا که تو این را کرده‌ای. "},
	{10, "10  بلای خود را از من بردار زیرا که از ضرب دست تو من تلف می‌شوم. "},
	{11, "11  چون انسان را به‌سبب گناهش به عتابها تأدیب می‌کنی، نفایس او را مثل بید می‌گذاری. یقیناً هر انسان محض بطالت است، سِلاه. "},
	{12, "12  ای خداوند دعای مرا بشنو و به فریادم گوش بده و از اشکهایم ساکت مباش، زیرا که من غریب هستم در نزد تو و نزیل هستم مثل جمیع پدران خود. "},
	{13, "13  روی [خشم] خود را از من بگردان تا فرحناک شوم قبل از آنکه رحلت کنم و نایاب گردم. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view40() {
struct fa40 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور داود] انتظار بسیار برای خداوند کشیده‌ام، و به من مایل شده، فریاد مرا شنید. "},
	{2, "2  و مرا از چاه هلاکت برآورد و از گِلِ لجن و پایهایم را بر صخره گذاشته، قدمهایم را مستحکم گردانید. "},
	{3, "3  و سرودی تازه در دهانم گذارد، یعنی حمد خدای ما را. بسیاری چون این را بینند ترسان شده، بر خداوند توکّل خواهند کرد. "},
	{4, "4  خوشابحال کسی که بر خداوند توکّل دارد و به متکبران ظالم و مرتدان دروغ مایل نشود. "},
	{5, "5  ای یَهُوَه خدای ما چه بسیار است کارهای عجیب که تو کرده‌ای و تدبیرهایی که برای ما نموده‌ای. در نزد تو آنها را تقویم نتوان کرد، اگر آنها را تقریر و بیان بکنم، از حد شمار زیاده است. "},
	{6, "6  در قربانی و هدیه رغبت نداشتی. امّا گوشهای مرا باز کردی. قربانیِ سوختنی و قربانی گناه را نخواستی. "},
	{7, "7  آنگاه گفتم، اینک، می‌آیم! در طومار کتاب دربارهٔٔ من نوشته شده است. "},
	{8, "8  در بجا آوردن ارادهٔٔ تو ای خدای من رغبت می‌دارم و شریعت تو در اندرون دل من است. "},
	{9, "9  در جماعت بزرگ به عدالت بشارت داده‌ام. اینک، لبهای خود را باز نخواهم داشت و تو ای خداوند می‌دانی. "},
	{10, "10  عدالت تو را در دل خود مخفی نداشته‌ام. امانت و نجات تو را بیان کرده‌ام. رحمت و راستیِ تو را از جماعت بزرگ پنهان نکرده‌ام. "},
	{11, "11  پس تو ای خداوند لطف خود را از من باز مدار. رحمت و راستیِ تو دائماً مرا محافظت کند. "},
	{12, "12  زیرا که بلایای بی‌شمار مرا احاطه می‌کند. گناهانم دور مرا گرفته است به حدی که نمی‌توانم دید. از مویهای سر من زیاده است و دل من مرا ترک کرده است. "},
	{13, "13  ای خداوند مرحمت فرموده، مرا نجات بده. ای خداوند به اعانت من تعجیل فرما. "},
	{14, "14  آنانی که قصد هلاکت جان من دارند، جمیعاً خجل و شرمنده شوند، و آنانی که در بدیِ من رغبت دارند، به عقب برگردانیده و رسوا گردند. "},
	{15, "15  آنانی که بر من هَه‌هَه می‌گویند، به‌سبب خجالت خویش حیران شوند. "},
	{16, "16  و امّا جمیع طالبان تو در تو وجد و شادی نمایند و آنانی که نجات تو را دوست دارند، دائماً گویند که خداوند بزرگ است. "},
	{17, "17  و امّا من مسکین و فقیر هستم و خداوند دربارهٔٔ من تفکر می‌کند. تو معاون و نجات‌دهندهٔ من هستی. ای خدای من، تأخیر مفرما. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view41() {
struct fa41 poems[] = {
	{1, "1  [رای سالار مغنیان. مزمور داود] خوشابحال کسی که برای فقیر تفکر می‌کند. خداوند او را در روز بلا خلاصی خواهد داد. "},
	{2, "2  خداوند او را محافظت خواهد کرد و زنده خواهد داشت. او در زمین مبارک خواهد بود و او را به آرزوی دشمنانش تسلیم نخواهی کرد. "},
	{3, "3  خداوند او را بر بستر بیماری تأیید خواهد نمود. تمامیِ خوابگاه او را در بیماریاش خواهی گسترانید. "},
	{4, "4  من گفتم، ای خداوند بر من رحم نما. جان مرا شفا بده زیرا به تو گناه ورزیده‌ام. "},
	{5, "5  دشمنانم دربارهٔٔ من به بدی سخن می‌گویند که کی بمیرد و نام او گُم شود. "},
	{6, "6  و اگر برای دیدن من بیاید، سخن باطل می‌گوید و دلش در خود شرارت را جمع می‌کند. چون بیرون رود آن را شایع می‌کند. "},
	{7, "7  و جمیع خصمانم با یکدیگر بر من نمّامی می‌کنند و دربارهٔٔ من بدی می‌اندیشند، "},
	{8, "8  که حادثهای مهلک بر او ریخته شده است. و حال که خوابیده است دیگر نخواهد برخاست. "},
	{9, "9  و آن دوست خالص من که بر او اعتماد می‌داشتم که نان مرا نیز می‌خورْد، پاشنهٔ خود را بر من بلند کرد. "},
	{10, "10  و امّا تو ای خداوند بر من رحم فرموده، مرا برپا بدار تا مجازات بدیشان رسانم. "},
	{11, "11  از این می‌دانم که در من رغبت داری زیرا که دشمنم بر من فخر نمی‌نماید. "},
	{12, "12  و مرا به‌سبب کمالم مستحکم نموده‌ای و مرا به حضور خویش دائماً قائِم خواهی نمود. "},
	{13, "13  یهوه خدای اسرائیل متبارک باد. از ازل تا به ابد. آمین و آمین. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view42() {
struct fa42 poems[] = {
	{1, "1  [رای سالار مغنیان. قصیدهٔ بنیقورح] چنانکه آهو برای نهرهای آب شدت اشتیاق دارد، همچنان ای خدا جان من اشتیاق شدید برای تو دارد. "},
	{2, "2  جان من تشنهٔ خداست تشنهٔ خدای حیّ، که کی بیایم و به حضور خدا حاضر شوم. "},
	{3, "3  اشکهایم روز و شب نان من می‌بود، چون تمامی روز مرا می‌گفتند، خدای تو کجاست؟ "},
	{4, "4  چون این را به یاد می‌آورم، جان خود را بر خود می‌ریزم. چگونه با جماعت می‌رفتم و ایشان را به خانهٔ خدا پیشروی می‌کردم، به آواز ترنم و تسبیح در گروه عید کنندگان. "},
	{5, "5  ای جانم چرا منحنی شده‌ای و چرا در من پریشان گشته‌ای؟ بر خدا امید دار زیرا که او را برای نجات روی او باز حمد خواهم گفت. "},
	{6, "6  ای خدای من، جانم در من منحنی شد. بنابراین تو را از زمین اُرْدُن یاد خواهم کرد، از کوه‌های حرمون و از جبل مِصْغَر. "},
	{7, "7  لجّه به لجّه ندا می‌دهد از آواز آبشارهای تو؛ جمیع خیزابها و موجهای تو بر من گذشته است. "},
	{8, "8  در روزْ خداوند رحمت خود را خواهد فرمود، و در شبْ سرود او با من خواهد بود و دعا نزد خدای حیات من. "},
	{9, "9  به خدا گفته‌ام، ای صخرهٔ من چرا مرا فراموش کرده‌ای؟ چرا به‌سبب ظلم دشمن ماتمکنان تردد بکنم؟ "},
	{10, "10  دشمنانم به کوبیدگی در استخوانهایم مرا ملامت می‌کنند، چونکه همه روزه مرا می‌گویند، خدای تو کجاست؟ "},
	{11, "11  ای جان من چرا منحنی شده و چرا در من پریشان گشته‌ای؟ بر خدا امید دار زیرا که او را بازحمد خواهم گفت، که نجات روی من و خدای من است. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view43() {
struct fa43 poems[] = {
	{1, "1  ای خدا مرا داوری کن و دعوای مرا با قوم بیرحم فیصل فرما و از مرد حیلهگر و ظالم مرا خلاصی ده. "},
	{2, "2  زیرا تو خدای قوّت من هستی. چرا مرا دور انداختی؟ چرا به‌سبب ستم دشمن ماتم کنان تردد بکنم؟ "},
	{3, "3  نور و راستیِ خود را بفرست تا مرا هدایت نمایند و مرا به کوه مقدّس تو و مسکنهای تو رسانند. "},
	{4, "4  آنگاه به مذبح خدا خواهم رفت، بسوی خدایی که سرور و خرمی من است. و تو را ای خدا، خدای من با بربط تسبیح خواهم خواند. "},
	{5, "5  ای جان من چرا منحنی شده‌ای؟ و چرا در من پریشان گشته‌ای؟ امید بر خدا دار زیرا که او را باز حمد خواهم گفت، که نجات روی من و خدای من است. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view44() {
struct fa44 poems[] = {
	{1, "1  [برای سالار مغنیان. قصیدهٔ بنیقورح] ای خدا به گوشهای خود شنیده‌ایم و پدران ما، ما را خبر داده‌اند، از کاری که در روزهای ایشان و در ایام سَلَف کرده‌ای. "},
	{2, "2  تو به دست خود امّت‌ها را بیرون کردی، امّا ایشان را غرس نمودی. قومها را تباه کردی، امّا ایشان را منتشر ساختی. "},
	{3, "3  زیرا که به شمشیر خود زمین را تسخیر نکردند و بازوی ایشانْ ایشان را نجات نداد، بلکه دست راست تو و بازو و نورِ روی تو. زیرا از ایشان خرسند بودی. "},
	{4, "4  ای خدا تو پادشاه من هستی، پس برنجات یعقوب امر فرما. "},
	{5, "5  به مدد تو دشمنان خود راخواهیم افکند و به نام تو مخالفان خویش را پایمال خواهیم ساخت. "},
	{6, "6  زیرا بر کمان خود توکّل نخواهم داشت و شمشیرم مرا خلاصی نخواهد داد. "},
	{7, "7  بلکه تو ما را از دشمنان ما خلاصی دادی و مُبْغِضان ما را خجل ساختی. "},
	{8, "8  تمامیِ روز بر خدا فخر خواهیم کرد و نام تو را تا به ابد تسبیح خواهیم خواند، سلاه. "},
	{9, "9  لیکن الآن تو ما را دور انداخته و رسوا ساخته‌ای و با لشکرهای ما بیرون نمی‌آیی. "},
	{10, "10  و ما را از پیش دشمن روگردان ساخته‌ای و خصمان ما برای خویشتن تاراج می‌کنند. "},
	{11, "11  ما را مثل گوسفندان برای خوراک تسلیم کرده‌ای و ما را در میان امّت‌ها پراکنده ساخته‌ای. "},
	{12, "12  قوم خود را بیبها فروختی و از قیمت ایشان نفع نبردی. "},
	{13, "13  ما را نزد همسایگان ما عار گردانیدی. اهانت و سخریّه نزد آنانی که گرداگرد مایند. "},
	{14, "14  ما را در میان امّت‌ها ضربالمثل ساخته‌ای، جنبانیدن سر در میان قومها؛ "},
	{15, "15  و رسوایی من همه روزه در نظر من است و خجالت رویم مرا پوشانیده است، "},
	{16, "16  از آواز ملامتگو و فحّاش، از روی دشمن و انتقام گیرنده. "},
	{17, "17  این همه بر ما واقع شد. امّا تو را فراموش نکردیم و در عهد تو خیانت نورزیدیم. "},
	{18, "18  دل ما به عقب برنگردید و پایهای ما از طریق تو انحراف نورزید. "},
	{19, "19  هرچند ما را در مکان اژدرها کوبیدی و ما را به سایهٔ موت پوشانیدی. "},
	{20, "20  نام خدای خود را هرگز فراموش نکردیم و دست خود را به خدای غیر برنیفراشتیم. "},
	{21, "21  آیا خدا این را غوررسی نخواهد کرد؟ زیرا او خفایای قلب را می‌داند. "},
	{22, "22  هر آینه به خاطر تو تمامی روز کشتهمی‌شویم و مثل گوسفندان ذبح شمرده می‌شویم. "},
	{23, "23  ای خداوند بیدار شو! چرا خوابیده‌ای؟ برخیز و ما را تا به ابد دور مینداز. "},
	{24, "24  چرا روی خود را پوشانیدی و ذلّت و تنگی ما را فراموش کردی؟ "},
	{25, "25  زیرا که جان ما به خاک خم شده است و شکم ما به زمین چسبیده. "},
	{26, "26  بجهت اعانت ما برخیز و بخاطر رحمانیّت خود ما را فدیه ده. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view45() {
struct fa45 poems[] = {
	{1, "1  [برای سالار مغنیان بر سوسنها. قصیدهٔ بنیقورح. سرود حبیبات] دل من به کلام نیکو می‌جوشد. انشاء خود را دربارهٔٔ پادشاه می‌گویم. زبان من قلم کاتب ماهر است. "},
	{2, "2  تو جمیلتر هستی از بنی‌آدم و نعمت بر لبهای تو ریخته شده است. بنابراین، خدا تو را مبارک ساخته است تا ابدالآباد. "},
	{3, "3  ای جبار شمشیر خود را بر ران خود ببند، یعنی جلال و کبریایی خویش را. "},
	{4, "4  و به کبریایی خود سوار شده، غالب شو بجهت راستی و حلم و عدالت؛ و دست راستت چیزهای ترسناک را به تو خواهد آموخت. "},
	{5, "5  به تیرهای تیزِ تو امّت‌ها زیر تو میافتند و به دل دشمنانِ پادشاه فرو می‌رود. "},
	{6, "6  ای خدا، تخت تو تا ابدالآباد است؛ عصای راستی عصای سلطنت تو است. "},
	{7, "7  عدالت را دوست و شرارت را دشمن داشتی. بنابراین، خدا، خدای تو تو را به روغن شادمانی بیشتر از رفقایت مسح کرده است. "},
	{8, "8  همهٔ رختهای تو مُرّ و عود و سلیخه است، از قصرهای عاج که به تارها تو را خوش ساختند. "},
	{9, "9  دختران پادشاهان از زناننجیب تو هستند. ملکه به دست راستت در طلای اوفیر ایستاده است. "},
	{10, "10  ای دختر بشنو و ببین و گوش خود را فرادار، و قوم خود و خانهٔ پدرت را فراموش کن، "},
	{11, "11  تا پادشاه مشتاق جمال تو بشود، زیرا او خداوند تو است پس او را عبادت نما. "},
	{12, "12  و دختر صور با ارمغانی، و دولتمندان قوم رضامندیِ تو را خواهند طلبید. "},
	{13, "13  دختر پادشاه تماماً در اندرون مجید است و رختهای او با طلا مُرَصَّع است. "},
	{14, "14  به لباس طرازدار نزد پادشاه حاضر می‌شود. باکره‌های همراهان او در عقب وی نزد تو آورده خواهند شد. "},
	{15, "15  به شادمانی و خوشی آورده می‌شوند و به قصر پادشاه داخل خواهند شد. "},
	{16, "16  به عوض پدرانت پسرانت خواهند بود و ایشان را بر تمامیِ جهان سروران خواهی ساخت. "},
	{17, "17  نام تو را در همهٔٔ دهرها ذکر خواهم کرد. پس قومها تو را حمد خواهند گفت تا ابدالآباد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view46() {
struct fa46 poems[] = {
	{1, "1  [برای سالار مغنیان. سرود بنیقورح برعلاموت] خدا ملجا و قوّت ماست، و مددکاری که در تنگیها فوراً یافت می‌شود. "},
	{2, "2  پس نخواهیم ترسید، اگر چه جهان مبدل گردد و کوه‌ها در قعر دریا به لرزش آید. "},
	{3, "3  اگر چه آبهایش آشوب کنند و به جوش آیند و کوه‌ها از سرکشیِ آن متزلزل گردند، سِلاه. "},
	{4, "4  نهری است که شعبه‌هایش شهر خدا را فرحناک می‌سازد و مسکن قدوس حضرت اعلیٰ را. "},
	{5, "5  خدا در وسط اوست پس جنبش نخواهد خورد. خدا او را اعانت خواهد کرد در طلوع صبح. "},
	{6, "6  امّت‌ها نعره زدند و مملکتها متحرکگردیدند. او آواز خود را داد. پس جهان گداخته گردید. "},
	{7, "7  یَهُوَه صبایوت با ماست، و خدای یعقوب قلعهٔ بلند ما، سِلاه. "},
	{8, "8  بیایید کارهای خداوند را نظاره کنید، که چه خرابیها در جهان پیدا نمود. "},
	{9, "9  او جنگها را تا اقصای جهان تسکین می‌دهد؛ کمان را می‌شکند و نیزه را قطع می‌کند و ارابه‌ها را به آتش می‌سوزاند. "},
	{10, "10  بازایستید و بدانید که من خدا هستم؛ در میان امّت‌ها، متعال و در جهان، متعال خواهم شد. "},
	{11, "11  یهوه صبایوت با ماست و خدای یعقوب قلعهٔ بلند ما، سِلاه. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view47() {
struct fa47 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور بنیقورح] ای جمیع امّت‌ها دستک زنید. نزد خدا به آواز شادی بانگ برآورید. "},
	{2, "2  زیرا خداوند متعال و مهیب است و بر تمامیِ جهان خدای بزرگ. "},
	{3, "3  قومها را در زیر ما مغلوب خواهد ساخت و طایفه‌ها را در زیر پایهای ما. "},
	{4, "4  میراث ما را برای ما خواهد برگزید، یعنی جلالت یعقوب را که دوست می‌دارد، سِلاه. "},
	{5, "5  خدا به آواز بلند صعود نموده است؛ خداوند به آواز کرنا. "},
	{6, "6  تسبیح بخوانید، خدا را تسبیح بخوانید. تسبیح بخوانید، پادشاه ما را تسبیح بخوانید. "},
	{7, "7  زیرا خدا پادشاه تمامیِ جهان است. به خردمندی تسبیح بخوانید. "},
	{8, "8  خدا بر امّت‌ها سلطنت می‌کند. خدا بر تخت قدس خود نشسته است. "},
	{9, "9  سروران قومها با قوم خدای ابراهیم جمع شده‌اند زیرا که سپرهای جهان از آن خداست. او بسیار متعال می‌باشد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view48() {
struct fa48 poems[] = {
	{1, "1  [سرود و مزمور بنیقورح] خداوند بزرگ است و بی‌نهایت مجید،در شهر خدای ما و در کوه مقدس خویش. "},
	{2, "2  جمیل در بلندیاش و شادی تمامی جهان است کوه صهیون، در جوانب شمال، قریهٔ پادشاه عظیم. "},
	{3, "3  خدا در قصرهای آن به ملجای بلند معروف است. "},
	{4, "4  زیرا اینک، پادشاهان جمع شدند، و با هم درگذشتند. "},
	{5, "5  ایشان چون دیدند متعجب گردیدند. و در حیرت افتاده، فرار کردند. "},
	{6, "6  لرزه بر ایشان در آنجا مستولی گردید و درد شدید مثل زنی که می‌زاید. "},
	{7, "7  تو کشتیهای ترشیش را به باد شرقی شکستی. "},
	{8, "8  چنانکه شنیده بودیم، همچنان دیده‌ایم، در شهر یهوه صبایوت، در شهر خدای ما؛ خدا آن را تا ابدالآباد مستحکم خواهد ساخت، سِلاه. "},
	{9, "9  ای خدا در رحمت تو تفکر کرده‌ایم، در اندرون هیکل تو. "},
	{10, "10  ای خدا چنانکه نام تو است، همچنان تسبیح تو نیز تا اقصای زمین. دست راست تو از عدالت پُر است. "},
	{11, "11  کوه صهیون شادی می‌کند و دختران یهودا به وجد می‌آیند، به‌سبب داوریهای تو. "},
	{12, "12  صهیون را طواف کنید و گرداگرد او بخرامید و برجهای وی را بشمارید. "},
	{13, "13  دل خود را به حصارهایش بنهید و در قصرهایش تأمل کنید تا طبقهٔ آینده را اطلاع دهید. "},
	{14, "14  زیرا این خدا، خدای ماست تا ابدالآباد و ما را تا به موت هدایت خواهد نمود. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view49() {
struct fa49 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور بنیقورح] ای تمامیِ قومها این را بشنوید! ایجمیع سَکَنهٔ ربع مسکون این را گوش گیرید! "},
	{2, "2  ای عوام و خواص! ای دولتمندان و فقیران جمیعاً! "},
	{3, "3  زبانم به حکمت سخن می‌راند و تفکر دل من فطانت است. "},
	{4, "4  گوش خود را به مَثَلی فرا می‌گیرم. معمای خویش را بر بربط می‌گشایم. "},
	{5, "5  چرا در روزهای بلا ترسان باشم، چون گناهِ پاشنه‌هایم مرا احاطه می‌کند؛ "},
	{6, "6  آنانی که بر دولت خود اعتماد دارند و بر کثرت توانگری خویش فخر می‌نمایند. "},
	{7, "7  هیچ کس هرگز برای برادر خود فدیه نخواهد داد و کفّارهٔٔ او را به خدا نخواهد بخشید. "},
	{8, "8  زیرا فدیهٔ جان ایشان گرانبهاست و ابداً بدان نمی‌توان رسید "},
	{9, "9  تا زنده بماند تا ابدالآباد و فساد را نبیند. "},
	{10, "10  زیرا می‌بیند که حکیمان میمیرند و جاهلان و ابلهان با هم هلاک می‌گردند و دولتِ خود را برای دیگران ترک می‌کنند. "},
	{11, "11  فکر دل ایشان این است که خانه‌های ایشان دائمی باشد و مسکنهای ایشان دُوربهدُور؛ و نامهای خود را بر زمینهای خود می‌نهند. "},
	{12, "12  لیکن انسان در حرمت باقی نمی‌ماند، بلکه مثل بهایم است که هلاک می‌شود. "},
	{13, "13  این طریقهٔ ایشان، جهالت ایشان است و اعقاب ایشان سخن ایشان را می‌پسندند، سلاه. "},
	{14, "14  مثل گوسفندان در هاویه رانده می‌شوند و موت ایشان را شبانی می‌کند و صبحگاهان راستان بر ایشان حکومت خواهند کرد و جمال ایشان در هاویه پوسیده خواهد شد تا مسکنی برای آن نباشد. "},
	{15, "15  لیکن خدا جان مرا ازدست هاویه نجات خواهد داد زیرا که مرا خواهد گرفت، سلاه. "},
	{16, "16  پس ترسان مباش، چون کسی دولتمند گردد و جلال خانهٔ او افزوده شود! "},
	{17, "17  زیرا چون بمیرد، چیزی از آن نخواهد برد و جلالش در عقب او فرو نخواهد رفت. "},
	{18, "18  زیرا در حیات خود، خویشتن را مبارک می‌خوانْد؛ و چون بر خود احسان می‌کنی، مردم ترا میستایند. "},
	{19, "19  لیکن به طبقهٔ پدران خود خواهد پیوست که نور را تا به ابد نخواهند دید. "},
	{20, "20  انسانی که در حرمت است و فهم ندارد، مثل بهایم است که هلاک می‌شود. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view50() {
struct fa50 poems[] = {
	{1, "1  [مزمور آساف] خدا، خدا یهوه تکلّم می‌کند و زمین را از مَطْلَع آفتاب تا به مغربش می‌خواند. "},
	{2, "2  از صهیون که کمال زیبایی است، خدا تجلّی نموده است. "},
	{3, "3  خدای ما می‌آید و سکوت نخواهد نمود. آتش پیش روی او می‌بلعد و طوفان شدید گرداگرد وی خواهد بود. "},
	{4, "4  آسمان را از بالا می‌خواند و زمین را، تا قوم خود را داوری کند، "},
	{5, "5  مقدّسانِ مرا نزد من جمع کنید، که عهد را با من به قربانی بسته‌اند. "},
	{6, "6  و آسمانها از انصاف او خبر خواهند داد، زیرا خدا خود داور است، سلاه. "},
	{7, "7  ای قوم من بشنوتا سخن گویم، و ای اسرائیل تا برایت شهادت دهم که خدا، خدای تو من هستم. "},
	{8, "8  دربارهٔٔ قربانی‌هایت تو را توبیخ نمی‌کنم و قربانی‌های سوختنیِ تو دائماً در نظر من است. "},
	{9, "9  گوسالهای از خانهٔ تو نمی‌گیرم و نه بزی از آغل تو. "},
	{10, "10  زیراکه جمیع حیوانات جنگلاز آن منند و بهایمی که بر هزاران کوه می‌باشند. "},
	{11, "11  همهٔ پرندگان کوه‌ها را می‌شناسم و وحوش صحرا نزد من حاضرند. "},
	{12, "12  اگر گرسنه می‌بودم تو را خبر نمی‌دادم، زیرا ربع مسکون و پُری آن از آن من است. "},
	{13, "13  آیا گوشت گاوان را بخورم و خون بزها را بنوشم؟ "},
	{14, "14  برای خدا قربانی تشکر را بگذران، و نذرهای خویش را به حضرت اعلی وفا نما. "},
	{15, "15  پس در روز تنگی مرا بخوان تا تو را خلاصی دهم و مرا تمجید بنمایی. "},
	{16, "16  و امّا به شریر خدا می‌گوید، ترا چه کار است که فرایض مرا بیان کنی و عهد مرا به زبان خود بیاوری؟ "},
	{17, "17  چونکه تو از تأدیب نفرت داشته‌ای و کلام مرا پشتسر خود انداخته‌ای. "},
	{18, "18  چون دزد را دیدی او را پسند کردی و نصیب تو با زناکاران است. "},
	{19, "19  دهان خود را به شرارت گشوده‌ای و زبانت حیله را اختراع می‌کند. "},
	{20, "20  نشسته‌ای تا به ضد برادر خود سخن رانی و دربارهٔٔ پسر مادر خویش غیبت گویی. "},
	{21, "21  این را کردی و من سکوت نمودم. پس گمان بردی که من مثل تو هستم. لیکن تو را توبیخ خواهم کرد. و این را پیش نظر تو به ترتیب خواهم نهاد. "},
	{22, "22  ای فراموشکنندگان خدا، در این تفکر کنید! مبادا شما را بدرم و رهاننده‌ای نباشد. "},
	{23, "23  هر که قربانی تشکر را گذراند مرا تمجید می‌کند، و آنکه طریق خود را راست سازد، نجات خدا را به وی نشان خواهم داد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view51() {
struct fa51 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور داود وقتی که ناتان نبی بعد از در آمدنش به بَتْشَبَع نزد او آمد] ای خدا به حسب رحمت خود بر منرحم فرما؛ به حسب کثرت رأفتخویش گناهانم را محو ساز. "},
	{2, "2  مرا از عصیانم به کلی شست و شو ده و از گناهم مرا طاهر کن. "},
	{3, "3  زیرا که من به معصیت خود اعتراف می‌کنم و گناهم همیشه در نظر من است. "},
	{4, "4  به تو و به تو تنها گناه ورزیده، و در نظر تو این بدی را کرده‌ام، تا در کلام خود مُصّدَق گردی و در داوری خویش مُزکّیٰ شوی. "},
	{5, "5  اینک، در معصیت سرشته شدم و مادرم در گناه به من آبستن گردید. "},
	{6, "6  اینک، به راستیِ در قلب راغب هستی. پس حکمت را در باطن من به من بیاموز. "},
	{7, "7  مرا با زوفا پاک کن تا طاهر شوم. مرا شست و شو کن تا از برف سفیدتر گردم. "},
	{8, "8  شادی و خرمی را به من بشنوان تا استخوانهایی که کوبیده‌ای به وجد آید. "},
	{9, "9  روی خود را از گناهانم بپوشان و همهٔٔ خطایای مرا محو کن. "},
	{10, "10  ای خدا دل طاهر در من بیافرین و روح مستقیم در باطنم تازه بساز. "},
	{11, "11  مرا از حضور خود مینداز، و روح قدوس خود را از من مگیر. "},
	{12, "12  شادیِ نجات خود را به من باز ده و به روح آزاد مرا تأیید فرما. "},
	{13, "13  آنگاه طریق تو را به خطاکاران تعلیم خواهم داد، و گناهکاران بسوی تو بازگشت خواهند نمود. "},
	{14, "14  مرا از خونها نجات ده! ای خدایی که خدای نجات من هستی! تا زبانم به عدالت تو ترنّم نماید. "},
	{15, "15  خداوندا لبهایم را بگشا تا زبانم تسبیح تو را اخبار نماید. "},
	{16, "16  زیرا قربانی را دوست نداشتی والا می‌دادم. قربانیِ سوختنی را پسند نکردی. "},
	{17, "17  قربانی‌های خدا روح شکسته است. خدایا دل شکسته و کوبیده را خوار نخواهی شمرد. "},
	{18, "18  به رضامندیِ خود بر صهیون احسان فرما وحصارهای اورشلیم را بنا نما. "},
	{19, "19  آنگاه از قربانی‌های عدالت و قربانی‌های سوختنیِ تمام راضی خواهی شد و گوساله‌ها بر مذبح تو خواهند گذرانید. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view52() {
struct fa52 poems[] = {
	{1, "1  [برای سالار مغنیان. قصیدهٔ داود وقتی که دوآغ ادومی آمد و شاؤل را خبر داده، گفت که، داود به خانهٔ اخیمَلَک رفت] ای جبار چرا از بدی فخر می‌کنی؟رحمت خدا همیشه باقی است. "},
	{2, "2  زبان تو شرارت را اختراع می‌کند، مثل اُستُرهٔ تیز، ای حیله ساز! "},
	{3, "3  بدی را از نیکویی بیشتر دوست می‌داری و دروغ را زیادتر از راست گویی، سلاه. "},
	{4, "4  همهٔٔ سخنان مهلک را دوست می‌داری، ای زبان حیلهباز! "},
	{5, "5  خدا نیز تو را تا به ابد هلاک خواهد کرد و تو را ربوده، از مسکن تو خواهد کَند و ریشهٔٔ تو را از زمین زندگان، سلاه. "},
	{6, "6  عادلان این را دیده، خواهند ترسید و بر او خواهند خندید، "},
	{7, "7  هان این کسی است که خدا را قلعهٔ خویش ننمود، بلکه به کثرت دولت خود توکّل کرد و از بدیِ خویش خود را زورآور ساخت. "},
	{8, "8  و امّا من مثل زیتون سبز در خانهٔ خدا هستم. به رحمت خدا توکّل می‌دارم تا ابدالآباد. "},
	{9, "9  تو را همیشه حمد خواهم گفت، زیرا تو این را کرده‌ای. و انتظار نام تو را خواهم کشید زیرا نزد مقدّسان تو نیکوست. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view53() {
struct fa53 poems[] = {
	{1, "1  [برای سالار مغنیان بر ذوات اوتار. قصیدهٔ داود] احمق در دل خود می‌گوید که خدایینیست. فاسد شده، شرارت مکروه کرده‌اند و نیکوکاری نیست. "},
	{2, "2  خدا از آسمان بر بنی‌آدم نظر انداخت تا ببیند که فهیم و طالب خدایی هست. "},
	{3, "3  همهٔ ایشان مرتد شده، با هم فاسد گردیده‌اند. نیکوکاری نیست یکی هم نی. "},
	{4, "4  آیا گناهکاران بی‌معرفت هستند که قوم مرا می‌خورند چنانکه نان می‌خورند و خدا را نمی‌خوانند؟ "},
	{5, "5  آنگاه سخت ترسان شدند، جایی که هیچ ترس نبود. زیرا خدا استخوانهای محاصره کنندهٔ تو را از هم پاشید. آنها را خجل ساخته‌ای زیرا خدا ایشان را رد نموده است. "},
	{6, "6  کاش که نجات اسرائیل از صهیون ظاهر می‌شد. وقتی که خدا اسیریِ قوم خویش را برگردانَد، یعقوب وجد خواهد نمود و اسرائیل شادی خواهد کرد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view54() {
struct fa54 poems[] = {
	{1, "1  [رای سالار مغنیان. قصیدهٔ داود بر ذوات اوتار وقتی که زیفیان نزد شاؤل آمده، گفتند آیا داود نزد ما خود را پنهان نمی‌کند] ای خدا به نام خود مرا نجات بده و بهقوّت خویش بر من داوری نما. "},
	{2, "2  ای خدا دعای مرا بشنو و سخنان زبانم را گوش بگیر. "},
	{3, "3  زیرا بیگانگان به ضد من برخاستهاند و ظالمان قصد جان من دارند؛ و خدا را در مد نظر خود نگذاشته‌اند، سِلاه. "},
	{4, "4  اینک، خدا مددکار من است.خداوند از تأیید کنندگان جان من است. "},
	{5, "5  بدی را بر دشمنان من خواهد برگردانید. به راستیِ خود ریشهٔٔ ایشان را بکَن. "},
	{6, "6  قربانی‌های تَبَرُّعی نزد تو خواهم گذرانید و نام تو را ای خداوند حمد خواهم گفت زیرا نیکوست، "},
	{7, "7  چونکه از جمیع تنگیها مرا خلاصی داده‌ای، و چشم من بر دشمنانم نگریسته است. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view55() {
struct fa55 poems[] = {
	{1, "1  [برای سالار مغنیان. قصیدهٔ داود بر ذوات اوتار] ای خدا به دعای من گوش بگیر و خود را از تضرع من پنهان مکن! "},
	{2, "2  به من گوش فراگیر و مرا مستجاب فرما! زیرا که در تفکر خود متحیرم و ناله می‌کنم "},
	{3, "3  از آواز دشمن و به‌سبب ظلم شریر، زیرا که ظلم بر من می‌اندازند وبا خشم بر من جفا می‌کنند. "},
	{4, "4  دل من در اندرونم پیچ و تاب می‌کند، و ترسهای موت بر من افتاده است. "},
	{5, "5  ترس و لرز به من در آمده است. وحشتی هولناک مرا در گرفته است. "},
	{6, "6  و گفتم کاش که مرا بالها مثل کبوتر می‌بود تا پرواز کرده، استراحت می‌یافتم. "},
	{7, "7  هرآینه بجای دور می‌پریدم، و در صحرا مأوا می‌گزیدم، سلاه. "},
	{8, "8  می‌شتافتم بسوی پناهگاهی از باد تند و از طوفان شدید. "},
	{9, "9  ای خداوند آنها را هلاک کن و زبانهایشان را تفریق نما زیرا که در شهرْ ظلم و جنگ دیده‌ام. "},
	{10, "10  روز و شب بر حصارهایش گردش می‌کنند و شرارت و مشقت در میانش می‌باشد. "},
	{11, "11  فساده‌ا در میان وی است و جور و حیله از کوچه‌هایش دور نمی‌شود. "},
	{12, "12  زیرا دشمن نبود که مرا ملامت می‌کرد والاّ تحمل می‌کردم؛ و خصم من نبود کهبر من سربلندی می‌نمود؛ والاّ خود را از وی پنهان می‌ساختم، "},
	{13, "13  بلکه تو بودی ای مرد نظیر من! ای یار خالص و دوست صدیق من! "},
	{14, "14  که با یکدیگر مشورت شیرین می‌کردیم و به خانهٔ خدا در انبوه می‌خرامیدیم. "},
	{15, "15  موت بر ایشان ناگهان آید و زنده بگور فرو روند. زیرا شرارت در مسکنهای ایشان و در میان ایشان است. "},
	{16, "16  و امّا من نزد خدا فریاد می‌کنم و خداوند مرا نجات خواهد داد. "},
	{17, "17  شامگاهان و صبح و ظهر شکایت و ناله می‌کنم و او آواز مرا خواهد شنید. "},
	{18, "18  جانم را از جنگی که بر من شده بود، بسلامتی فدیه داده است. زیرا بسیاری با من مقاومت می‌کردند. "},
	{19, "19  خدا خواهد شنید و ایشان را جواب خواهد داد، او که از ازل نشسته است، سِلاه. زیراکه در ایشان تبدیلها نیست و از خدا نمی‌ترسند. "},
	{20, "20  دست خود را بر صلحاندیشان خویش دراز کرده، و عهد خویش را شکسته است. "},
	{21, "21  سخنانِ چربِ زبانشْ نرم، لیکن دلش جنگ است. سخنانش چربتر از روغن لیکن شمشیرهای برهنه است. "},
	{22, "22  نصیب خود را به خداوند بسپار و تو را رزق خواهد داد. او تا به ابد نخواهد گذاشت که مردِ عادل جنبش خورد. "},
	{23, "23  و تو ای خدا ایشان را به چاه هلاکت فرو خواهی آورد. مردمان خونریز و حیلهساز، روزهای خود را نیمه نخواهند کرد. لیکن من بر تو توکّل خواهم داشت. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view56() {
struct fa56 poems[] = {
	{1, "1  [برای سالار مغنیان بر فاختهٔ ساکت در بلاد بعیده. مکتوم داود وقتی که فلسطینیان او را در جَتّ گرفتند] ای خدا بر من رحم فرما، زیرا که انسانمرا به شدت تعاقب می‌کند. تمامی روز جنگ کرده، مرا اذیت می‌نماید. "},
	{2, "2  خصمانم تمامیِ روز مرا به شدت تعاقب می‌کنند. زیرا که بسیاری با تکبر با من می‌جنگند. "},
	{3, "3  هنگامی که ترسان شوم، من بر تو توکّل خواهم داشت. "},
	{4, "4  در خدا کلام او را خواهم ستود. بر خدا توکّل کرده، نخواهم ترسید. انسان به من چه می‌تواند کرد؟ "},
	{5, "5  هر روزه سخنان مرا منحرف می‌سازند. همهٔ فکرهای ایشان دربارهٔٔ من برشرارت است. "},
	{6, "6  ایشان جمع شده، کمین می‌سازند. بر قدمهای من چشم دارند زیرا قصد جان من دارند. "},
	{7, "7  آیا ایشان به‌سبب شرارت خود نجات خواهند یافت؟ ای خدا امّت‌ها را در غضب خویش بینداز. "},
	{8, "8  تو آوارگیهای مرا تقریر کرده‌ای. اشکهایم را در مشک خود بگذار. آیا این در دفتر تو نیست؟ "},
	{9, "9  آنگاه در روزی که تو را بخوانم دشمنانم روخواهند گردانید. این را می‌دانم زیرا خدا با من است. "},
	{10, "10  در خدا کلام او را خواهم ستود. در خداوند کلام او را خواهم ستود. "},
	{11, "11  بر خدا توکّل دارم پس نخواهم ترسید. آدمیان به من چه می‌توانند کرد؟ "},
	{12, "12  ای خدا نذرهای تو بر مناست. قربانی‌های حمد را نزد تو خواهم گذرانید. "},
	{13, "13  زیرا که جانم را از موت رهانیده‌ای. آیا پایهایم را نیز از لغزیدن نگاه نخواهی داشت تا در نور زندگان به حضور خدا سالک باشم؟ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view57() {
struct fa57 poems[] = {
	{1, "1  [برای سالار مغنیان برلاتهلک. مکتوم داود وقتی که از حضور شاؤل به مغاره فرار کرد] ای خدا بر من رحم فرما، بر من رحم فرما! زیرا جانم در تو پناه می‌برد، و در سایهٔ بالهای تو پناه می‌برم تا این بلایا بگذرد. "},
	{2, "2  نزد خدای تعالی آواز خواهم داد، نزد خدایی که همه‌چیز را برایم تمام می‌کند. "},
	{3, "3  از آسمان فرستاده، مرا خواهد رهانید. زیرا تعاقب کنندهٔ سخت من ملامت می‌کند، سلاه. خدا رحمت و راستیِ خود را خواهد فرستاد. "},
	{4, "4  جان من در میان شیران است. در میان آتش‌افروزان می‌خوابم، یعنی آدمیانی که دندانهایشان نیزه‌ها و تیرهاست و زبان ایشان شمشیر بُرَنده است. "},
	{5, "5  ای خدا بر آسمانها متعال شو و جلال تو بر تمامیِ جهان. "},
	{6, "6  دامی برای پایهایم مهیا ساختند و جانم خم گردید. چاهی پیش رویم کندند، و خود در میانش افتادند، سلاه. "},
	{7, "7  دل من مستحکم است؛ خدایا دل من مستحکم است. سرود خواهم خواند و ترنم خواهم نمود. "},
	{8, "8  ای جلال من بیدار شو! ای بربط و عود بیدار شو! صبحگاهان من بیدار خواهم شد. "},
	{9, "9  ای خداوند تو را در میان امّت‌ها حمد خواهم گفت. تو را در میان قومها تسبیح خواهم خواند. "},
	{10, "10  زیرا رحمت تو تا آسمانها عظیم است و راستیِ تو تا افلاک. "},
	{11, "11  خدایا بر آسمانها متعال شو، و جلال تو بر تمامیِ جهان. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view58() {
struct fa58 poems[] = {
	{1, "1  [برای سالار مغنیان برلاتهلک. مکتوم داود] آیا فی‌الحقیقت به عدالتی که گنگاست سخن می‌گویید؟ و ای بنی‌آدم، آیا به راستی داوری می‌نمایید؟ "},
	{2, "2  بلکه در دل خود شرارتها به عمل می‌آورید و ظلمِ دستهای خود را در زمین از میزان درمی‌کنید. "},
	{3, "3  شریران از رَحِم منحرف هستند، از شکم مادر دروغ گفته، گمراه می‌شوند. "},
	{4, "4  ایشان را زهری است مثل زهر مار؛ مثل افعیِ کر که گوش خود را می‌بندد "},
	{5, "5  که آواز افسونگران را نمی‌شنود، هر چند به مهارت افسون می‌کند. "},
	{6, "6  ای خدا دندانهایشان را در دهانشان بشکن. ای خداوند دندانهای شیران را خرد بشکن. "},
	{7, "7  گداخته شده، مثل آب بگذرند. چون او تیرهای خود را می‌اندازد، در ساعت منقطع خواهند شد. "},
	{8, "8  مثل حلزون که گداخته شده، می‌گذرد. مثل سِقْط زن، آفتاب را نخواهند دید. "},
	{9, "9  قبل از آنکه دیگهای شما آتشِ خارها را احساس کند، آنها را چه تر و چه خشک خواهد رُفت. "},
	{10, "10  مردِ عادل چون انتقام را دید شادی خواهد نمود. پایهای خود را به خون شریر خواهد شست. "},
	{11, "11  و مردم خواهند گفت، هرآینه ثمرهای برای عادلان هست. هر آینه خدایی هست که در جهان داوری می‌کند. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view59() {
struct fa59 poems[] = {
	{1, "1  [برای سالار مغنیان بر لاتَهَلَک. مکتوم داود وقتی که شاؤل فرستاد که خانه را کشیک بکَشَند تا او را بکُشند] ای خدایم مرا از دشمنانم برهان! مرا از مقاومت کنندگانم برافراز! "},
	{2, "2  مرا از گناهکاران خلاصی ده! و از مردمان خونریز رهایی بخش! "},
	{3, "3  زیرا اینک، برای جانم کمین می‌سازند و زورآوران به ضد من جمع شده‌اند، بدون تقصیر من ای خداوند و بدون گناه من. "},
	{4, "4  بیقصورِ من می‌شتابند و خود را آماده می‌کنند. پس برای ملاقات من بیدار شو و ببین. "},
	{5, "5  امّا تو ای یهوه، خدای صبایوت، خدای اسرائیل، بیدار شده، همهٔٔ امّت‌ها را مکافات برسان و بر غدارانِ بدکار شفقت مفرما، سِلاه. "},
	{6, "6  شامگاهان برمی‌گردند و مثل سگ بانگ می‌کنند و در شهر دور می‌زنند. "},
	{7, "7  از دهان خود بدی را فرو می‌ریزند. در لبهای ایشان شمشیرهاست. زیرا می‌گویند، کیست که بشنود؟ "},
	{8, "8  و امّا تو ای خداوند، بر ایشان خواهی خندید و تمامیِ امّت‌ها را استهزا خواهی نمود. "},
	{9, "9  ای قوّت من، بسوی تو انتظار خواهم کشید زیرا خدا قلعهٔ بلند من است. "},
	{10, "10  خدای رحمت من پیش روی من خواهد رفت. خدا مرا بردشمنانم نگران خواهد ساخت. "},
	{11, "11  ایشان را به قتل مرسان. مبادا قوم من فراموش کنند. ایشان را به قوّت خود پراکنده ساخته، به زیر انداز، ای خداوند که سپر ما هستی! "},
	{12, "12  به‌سبب گناهِ زبان و سخنان لبهای خود، در تکبر خویش گرفتار شوند؛ و به عوض لعنت و دروغی که می‌گویند، "},
	{13, "13  ایشان را فانیکن، در غضب فانی کن تا نیست گردند و بدانند که خدا در یعقوب تا اقصای زمین سلطنت می‌کند. سِلاه. "},
	{14, "14  و شامگاهان برگردیده، مثل سگ بانگ زنند و در شهر گردش کنند. "},
	{15, "15  و برای خوراک پراکنده شوند و سیر نشده، شب را بسر برند. "},
	{16, "16  و امّا من قوّت تو را خواهم سرایید و بامدادان از رحمت تو ترنم خواهم نمود. زیرا قلعهٔ بلند من هستی و در روز تنگی ملجای منی. "},
	{17, "17  ای قوّت من برای تو سرود می‌خوانم، زیرا خدا قلعه بلند من است و خدای رحمت من. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view60() {
struct fa60 poems[] = {
	{1, "1  [برای سالار مغنیان بر سوسنِ شهادت. مکتوم داود برای تعلیم وقتی که با اَرَمْ نهرین و اَرَمْ صوبَه از در مقاتله بیرون آمد و یوآب برگشته، دوازده هزار نفر از ادومیان را در وادی الملح کُشت] ای خدا ما را دور انداخته، پراکنده ساخته‌ای! خشمناک بودی، بسوی ما رجوع فرما! "},
	{2, "2  زمین را متزلزل ساخته، آن را شکافتهای! شکستگیهایش را شفا ده زیرا به جنبش آمده است. "},
	{3, "3  چیزهای مشکل را به قوم خود نشان داده‌ای. بادهٔ سرگردانی به ما نوشانیده‌ای. "},
	{4, "4  عَلَمی به ترسندگان خود داده‌ای تا آن را برای راستی برافرازند، سلاه. "},
	{5, "5  تا حبیبان تو نجات یابند. به دست راست خود نجات ده و مرا مستجاب فرما. "},
	{6, "6  خدا در قدوسیت خود سخن گفته است. پس وجد خواهم نمود، شکیم را تقسیم می‌کنم و وادی سکّوت را خواهم پیمود. "},
	{7, "7  جِلْعاد از آن من است، مَنَسّی از آن من. افرایم خود سر مناست و یهودا عصای سلطنت من. "},
	{8, "8  موآب ظرف طهارت من است و بر اَدُوم کفش خود را خواهم انداخت. ای فلسطین برای من بانگ برآور! "},
	{9, "9  کیست که مرا به شهر حصین درآورد؟ و کیست که مرا به ادوم رهبری کند؟ "},
	{10, "10  مگر نه تو ای خدا که ما را دور انداخته‌ای و با لشکرهای ما ای خدا بیرون نمی‌آیی؟ "},
	{11, "11  مرا از دشمن اعانت فرما زیرا معاونت انسان باطل است. "},
	{12, "12  با خدا ظفر خواهیم یافت. زیرا اوست که دشمنان ما را پایمال خواهد کرد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view61() {
struct fa61 poems[] = {
	{1, "1  [برای سالار مغنیان برذوات اوتار. مزمور داود] ای خدا فریاد مرا بشنو و دعای مرا اجابت فرما! "},
	{2, "2  از اقصای جهان تو را خواهم خواند، هنگامی که دلم بیهوش می‌شود. مرا به صخرهای که از من بلندتر است هدایت نما. "},
	{3, "3  زیرا که تو ملجای من بوده‌ای و برج قوی از روی دشمن. "},
	{4, "4  در خیمهٔٔ تو ساکن خواهم بود تا ابدالآباد. زیر سایهٔ بالهای تو پناه خواهم برد، سلاه. "},
	{5, "5  زیرا تو ای خدا نذرهای مرا شنیده‌ای و میراث ترسندگان نام خود را به من عطا کرده‌ای. "},
	{6, "6  بر عمر پادشاه روزها خواهی افزود و سالهای او تا نسلها باقی خواهد ماند. "},
	{7, "7  به حضور خدا خواهد نشست تا ابدالآباد. رحمت و راستی را مهیا کن تا او را محافظت کنند. "},
	{8, "8  پس نام تو را تا به ابد خواهم سرایید تا هر روز نذرهای خود را وفا کنم. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view62() {
struct fa62 poems[] = {
	{1, "1  [برای یدوتون سالار مغنیان. مزمور داود] جان من فقط برای خدا خاموشمی‌شود زیرا که نجات من از جانب اوست. "},
	{2, "2  او تنها صخره و نجات من است و قلعهٔ بلند من. پس بسیار جنبش نخواهم خورد. "},
	{3, "3  تا به کی بر مردی هجوم می‌آورید تا همگی شما او را هلاک کنید مثل دیوارِ خمشده و حصارِ جنبش خورده؟ "},
	{4, "4  در این فقط مشورت می‌کنند که او را از مرتبهاش بیندازند. و دروغ را دوست می‌دارند. به زبان خود برکت می‌دهند و در دل خود لعنت می‌کنند، سلاه. "},
	{5, "5  ای جان من، فقط برای خدا خاموش شو زیرا که امید من از وی است. "},
	{6, "6  او تنها صخره و نجات من است و قلعهٔ بلند من تا جنبش نخورم. "},
	{7, "7  برخداست نجات و جلال من. صخرهٔ قوّت من و پناه من در خداست. "},
	{8, "8  ای قوم همه وقت بر او توکّل کنید و دلهای خود را به حضور وی بریزید. زیرا خدا ملجای ماست، سِلاه. "},
	{9, "9  البته بنی‌آدم بطالتاند و بنیبشر دروغ. در ترازو بالا می‌روند زیرا جمیعاً از بطالت سبکترند. "},
	{10, "10  بر ظلم توکّل مکنید و بر غارت مغرور مشوید. چون دولت افزوده شود دل در آن مبندید. "},
	{11, "11  خدا یک بار گفته است و دو بار این را شنیده‌ام که قوّت از آن خداست. "},
	{12, "12  ای خداوند رحمت نیز از آن تو است، زیرا به هر کس موافق عملش جزا خواهی داد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view63() {
struct fa63 poems[] = {
	{1, "1  [مزمور داود هنگامی که در صحرای یهودا بود] ای خدا، تو خدای من هستی. در سَحَر تو را خواهم طلبید. جان من تشنهٔ تو است و جسدم مشتاق تو در زمینِ خشکِ تشنهٔ بی‌آب. "},
	{2, "2  چنانکه در قدس بر تو نظر کردم تا قوّت و جلال تو را مشاهده کنم. "},
	{3, "3  چونکه رحمت تو از حیات نیکوتر است. پس لبهای من ترا تسبیح خواهد خواند. "},
	{4, "4  از این رو تا زنده هستم تو را متبارک خواهم خواند. و دستهای خود را به نام تو خواهم برافراشت. "},
	{5, "5  جان من سیر خواهد شد چنانکه از مغز و پیه، و زبان من به لبهای شادمانی تو را حمد خواهد گفت، "},
	{6, "6  چون تو را بر بستر خود یاد می‌آورم و در پاسهای شب در تو تفکر می‌کنم. "},
	{7, "7  زیرا تو مددکار من بوده‌ای و زیر سایهٔ بالهای تو شادی خواهم کرد. "},
	{8, "8  جان من به تو چسبیده است و دست راست تو مرا تأیید کرده است. "},
	{9, "9  و امّا آنانی که قصد جان من دارند هلاک خواهند شد و در اسفل زمین فرو خواهند رفت. "},
	{10, "10  ایشان به دم شمشیر سپرده می‌شوند و نصیب شغالها خواهند شد. "},
	{11, "11  امّا پادشاه در خدا شادی خواهد کرد و هر که بدو قسم خورَد، فخر خواهد نمود، زیرا دهان دروغ‌گویان بسته خواهد گردید. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view64() {
struct fa64 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور داود] ای خدا وقتی که تضرع می‌نمایم، آواز مرا بشنو و حیاتم را از خوف دشمن نگاهدار! "},
	{2, "2  مرا از مشاورت شریران پنهان کن و از هنگامهٔ گناهکاران. "},
	{3, "3  که زبان خود را مثل شمشیرتیز کرده‌اند و تیرهای خود، یعنی سخنان تلخ را بر زه آراسته‌اند. "},
	{4, "4  تا در کمینهای خود بر مرد کامل بیندازند. ناگهان بر او می‌اندازند و نمی‌ترسند. "},
	{5, "5  خویشتن را برای کار زشت تقویّت می‌دهند. دربارهٔٔ پنهان کردن دامها گفتگو می‌کنند. می‌گویند، کیست که ما را ببیند؟ "},
	{6, "6  کارهای بد را تدبیر می‌کنند و می‌گویند، تدبیر نیکو کرده‌ایم. و اندرون و قلب هر یک از ایشان عمیق است. "},
	{7, "7  امّا خدا تیرها بر ایشان خواهد انداخت و ناگهان جراحتهای ایشان خواهد شد، "},
	{8, "8  و زبانهای خود را برخود فرود خواهند آورد و هر که ایشان را بیند فرار خواهد کرد. "},
	{9, "9  و جمیع آدمیان خواهند ترسید و کار خدا را اعلام خواهند کرد و عمل او را درک خواهند نمود. "},
	{10, "10  و مرد صالح در خداوند شادی می‌کند و بر او توکّل می‌دارد و جمیع راست‌دلان، فخر خواهند نمود. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view65() {
struct fa65 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور و سرود داود] ای خدا، تسبیح در صهیون منتظر توست، و نذرها برای تو وفا خواهد شد. "},
	{2, "2  ای که دعا می‌شنوی، نزد تو تمامیِ بشر خواهند آمد! "},
	{3, "3  گناهان بر من غالب آمده است. تو تقصیرهای مرا کفّاره خواهی کرد. "},
	{4, "4  خوشابحال کسی که او را برگزیده و مُقَّرَب خود ساخته‌ای تا به درگاه‌های تو ساکن شود. از نیکوییِ خانهٔ تو سیر خواهیم شد و از قدوسیت هیکل تو. "},
	{5, "5  به چیزهای ترسناک در عدل، ما را جواب خواهی داد، ای خدایی که نجات ما هستی، ای که پناه تمامیِ اقصای جهان و ساکنان بعیدهٔ دریاهستی، "},
	{6, "6  و کوه‌ها را به قوّت خود مستحکم ساخته‌ای، و کمر خود را به قدرت بستهای، "},
	{7, "7  و تلاطم دریا را ساکن می‌گردانی، تلاطم امواج آن و شورش امّت‌ها را. "},
	{8, "8  ساکنان اقصای جهان از آیات تو ترسانند. مَطْلَعهای صبح و شام را شادمان می‌سازی. "},
	{9, "9  از زمین تفقد نموده، آن را سیراب می‌کنی و آن را بسیار توانگر می‌گردانی. نهر خدا از آب پر است. غلهٔ ایشان را آماده می‌کنی زیرا که بدین طور تهیه کرده‌ای. "},
	{10, "10  پشته‌هایش را سیراب می‌کنی و مرزهایش را پست می‌سازی. به بارشها آن را شاداب می‌نمایی. نباتاتش را برکت می‌دهی. "},
	{11, "11  به احسان خویش سال را تاجدار می‌سازی و راه‌های تو چربی را می‌چکاند. "},
	{12, "12  مرتعهای صحرا نیز می‌چکاند و کمر تلها به شادمانی بسته شده است. "},
	{13, "13  چمنها به گوسفندان آراسته شده است و درّه‌ها به غله پیراسته؛ از شادی بانگ می‌زنند و نیز میسرایند. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view66() {
struct fa66 poems[] = {
	{1, "1  [برای سالار مغنیان. سرود و مزمور] ای تمامیِ زمین، برای خدا بانگ شادمانی بزنید! "},
	{2, "2  جلال نام او را بسرایید، و در تسبیح او جلال او را توصیف نمایید! "},
	{3, "3  خدا را گویید، چه مَهیب است کارهای تو! از شدت قوّت تو دشمنانت نزد تو تذلل خواهند کرد! "},
	{4, "4  تمامیِ زمین تو را پرستش خواهند کرد و تو را خواهند سرایید و به نام تو ترنم خواهند نمود. سِلاه. "},
	{5, "5  بیایید کارهای خدا را مشاهده کنید. او درکارهای خود به بنی‌آدم مهیب است. "},
	{6, "6  دریا را به خشکی مبدل ساخت و مردم از نهر با پا عبور کردند. در آنجا بدو شادی نمودیم. "},
	{7, "7  در تواناییِ خود تا به ابد سلطنت می‌کند و چشمانش مراقب امّت‌ها است. فتنهانگیزانْ خویشتن را برنیفرازند، سِلاه. "},
	{8, "8  ای قومها، خدای ما را متبارک خوانید و آواز تسبیح او را بشنوانید. "},
	{9, "9  که جانهای ما را در حیات قرار می‌دهد و نمی‌گذارد که پایهای ما لغزش خورد. "},
	{10, "10  زیرا ای خدا تو ما را امتحان کرده‌ای و ما را غال گذاشته‌ای چنانکه نقره را غال می‌گذارند. "},
	{11, "11  ما را به دام درآوردی و باری گران بر پشتهای ما نهادی. "},
	{12, "12  مردمان را بر سر ما سوار گردانیدی و به آتش و آب در آمدیم. پس ما را به جای خرم بیرون آوردی. "},
	{13, "13  قربانی‌های سوختنی به خانهٔ تو خواهم آورد. نذرهای خود را به تو وفا خواهم نمود، "},
	{14, "14  که لبهای خود را بر آنها گشودم و در زمان تنگیِ خود آنها را به زبان خود آوردم. "},
	{15, "15  قربانی‌های سوختنیِ پرواری را نزد تو خواهم گذرانید. گوساله‌ها و بزها را با بخور قوچها ذبح خواهم کرد، سلاه. "},
	{16, "16  ای همهٔٔ خداترسان بیایید و بشنوید تا از آنچه او برای جان من کرده است خبر دهم. "},
	{17, "17  به دهانم نزد او آواز خود را بلند کردم و تسبیح بلند بر زبان من بود. "},
	{18, "18  اگر بدی را در دل خود منظور می‌داشتم، خداوند مرا نمی‌شنید. "},
	{19, "19  لیکن خدا مرا شنیده است و به آواز دعای من توجه فرموده. "},
	{20, "20  متبارک باد خدا که دعای مرا از خود، و رحمت خویش را از من برنگردانیده است. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view67() {
struct fa67 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور و سرود برذوات اوتار] خدا بر ما رحم کند و ما را مبارک سازد و نور روی خود را بر ما متجلی فرماید! سِلاه. "},
	{2, "2  تا راه تو در جهان معروف گردد و نجات تو به جمیع امّت‌ها. "},
	{3, "3  ای خدا قومها تو را حمد گویند. جمیع قومها تو را حمد گویند. "},
	{4, "4  امّت‌ها شادی و ترنم خواهند نمود زیرا قومها را به انصاف حکم خواهی نمود و امّت‌های جهان را هدایت خواهی کرد، سلاه. "},
	{5, "5  ای خدا قومها تو را حمد گویند. جمیع قومها تو را حمد گویند. "},
	{6, "6  آنگاه زمین محصول خود را خواهد داد و خدا خدای ما، ما را مبارک خواهد فرمود. "},
	{7, "7  خدا ما را مبارک خواهد فرمود. و تمامیِ اقصای جهان از او خواهند ترسید. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view68() {
struct fa68 poems[] = {
	{1, "1  [رای سالار مغنیان. مزمور و سرود داود] خدا برخیزد و دشمنانش پراکندهشوند! و آنانی که از او نفرت دارند از حضورش بگریزند! "},
	{2, "2  چنانکه دود پراکنده می‌شود، ایشان را پراکنده ساز، و چنانکه موم پیش آتش گداخته می‌شود، همچنان شریران به حضور خدا هلاک گردند. "},
	{3, "3  امّا صالحان شادی کنند و در حضور خدا به وجد آیند و به شادمانی خرسند شوند. "},
	{4, "4  برای خدا سرود بخوانید و به نام او ترنم نمایید و راهی درست کنید برای او که در صحراها سوار است. نام او یهوه است! به حضورش به وجد آیید! "},
	{5, "5  پدر یتیمان و داور بیوه زنان، خداست در مسکن قدسخود! "},
	{6, "6  خدا بی‌کسان را ساکن خانه می‌گرداند و اسیران را به رستگاری بیرون می‌آورد، لیکن فتنهانگیزان در زمینِ تفتیده ساکن خواهند شد. "},
	{7, "7  ای خدا هنگامی که پیش روی قوم خود بیرون رفتی، هنگامی که در صحرا خرامیدی، سلاه. "},
	{8, "8  زمین متزلزل شد و آسمان به حضور خدا بارید، این سینا نیز از حضور خدا، خدای اسرائیل. "},
	{9, "9  ای خدا باران نعمتها بارانیدی و میراثت را چون خسته بود، مستحکم گردانیدی. "},
	{10, "10  جماعت تو در آن ساکن شدند. ای خدا، به جود خویش برای مساکین تدارک دیده‌ای. "},
	{11, "11  خداوند سخن را می‌دهد. مبشرات انبوه عظیمی می‌شوند. "},
	{12, "12  ملوک لشکرها فرار کرده، منهزم می‌شوند و زنی که در خانه مانده است، غارت را تقسیم می‌کند. "},
	{13, "13  اگرچه در آغلها خوابیده بودید، لیکن مثل بالهای فاخته شده‌اید که به نقره پوشیده است و پرهایش به طلای سرخ. "},
	{14, "14  چون قادر مطلق پادشاهان را در آن پراکنده ساخت، مثل برف بر صَلْمُون درخشان گردید. "},
	{15, "15  کوه خدا، کوه باشان است، کوهی با قله‌های افراشته کوه باشان است. "},
	{16, "16  ای کوه‌های با قله‌های افراشته، چرا نگرانید بر این کوهی که خدا برای مسکن خود برگزیده است؟ هر آینه خداوند در آن تا به ابد ساکن خواهد بود. "},
	{17, "17  ارابه‌های خدا کرورها و هزارهاست. خداوند در میان آنهاست و سینا در قدس است. "},
	{18, "18  بر اعلیٰ علیین صعود کرده، و اسیران را به اسیری برده‌ای. از آدمیان بخششها گرفته‌ای. بلکه از فتنهانگیزان نیز تا یهوه خدا در ایشان مسکن گیرد. "},
	{19, "19  متبارک باد خداوندی که هر روزه متحمل بارهای ما می‌شودو خدایی که نجات ماست، سلاه. "},
	{20, "20  خدا برای ما، خدای نجات است و مَفَّرهای موت از آن خداوند یَهُوَه است. "},
	{21, "21  هر آینه خدا سردشمنان خود را خرد خواهد کوبید و کلهٔ مویدار کسی را که در گناه خود سالک باشد. "},
	{22, "22  خداوند گفت، از باشان باز خواهم آورد. از ژرفیهای دریا باز خواهم آورد. "},
	{23, "23  تا پای خود را در خون فروبری و زبان سگان تو از دشمنانت بهرهٔ خود را بیابد. "},
	{24, "24  ای خدا طریق‌های تو را دیده‌اند، یعنی طریق‌های خدا و پادشاه مرا در قدس. "},
	{25, "25  در پیش رو، مغنیان می‌خرامند و در عقب، سازندگان و در وسط دوشیزگان دفّ زن. "},
	{26, "26  خدا را در جماعتها متبارک خوانید و خداوند را از چشمهٔ اسرائیل. "},
	{27, "27  آنجاست بنیامین صغیر، حاکم ایشان و رؤسای یهودا محفل ایشان. رؤسای زبولون و رؤسای نفتالی. "},
	{28, "28  خدایت برای تو قوّت را امر فرموده است. ای خدا آنچه را که برای ما کرده‌ای، استوار گردان. "},
	{29, "29  به‌سبب هیکل تو که در اورشلیم است، پادشاهان هدایا نزد تو خواهند آورد. "},
	{30, "30  و وحش نیزار را توبیخ فرما و رمهٔ گاوان را با گوساله‌های قوم که با شمشهای نقره نزد تو گردن می‌نهند. و قومهایی که جنگ را دوست می‌دارند پراکنده ساخته است. "},
	{31, "31  سروران از مصر خواهند آمد و حبشه دستهای خود را نزد خدا بزودی دراز خواهد کرد. "},
	{32, "32  ای ممالک جهان برای خدا سرود بخوانید. برای خداوند سرود بخوانید، سلاه. "},
	{33, "33  برای او که بر فلکالافلاک قدیمی سوار است. اینک، آواز خود را می‌دهد، آوازی که پُرقوّت است. "},
	{34, "34  خدارا به قوّت توصیف نمایید. جلال وی بر اسرائیل است و قوّت او در افلاک. "},
	{35, "35  ای خدا از قدسهای خود مَهیب هستی. خدای اسرائیل قوم خود را قوّت و عظمت می‌دهد. متبارک باد خدا. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view69() {
struct fa69 poems[] = {
	{1, "1  [برای سالار مغنیان بر سوسنها. مزمور داود.] خدایا مرا نجات ده! زیرا آبها به جان من درآمده است. "},
	{2, "2  در خَلاب ژرف فرو رفته‌ام، جایی که نتوان ایستاد. به آبهای عمیق درآمده‌ام و سیل مرا می‌پوشاند. "},
	{3, "3  از فریاد خود خسته شده‌ام و گلوی من سوخته و چشمانم از انتظار خدا تار گردیده است. "},
	{4, "4  آنانی که بی‌سبب از من نفرت دارند، از مویهای سرم زیاده‌اند و دشمنانِ ناحقِ من که قصد هلاکت من دارند زورآورند. پس آنچه نگرفته بودم، رد کردم. "},
	{5, "5  ای خدا، تو حماقت مرا می‌دانی و گناهانم از تو مخفی نیست. "},
	{6, "6  ای خداوند یهوه صبایوت، منتظرین تو به‌سبب من خجل نشوند. ای خدای اسرائیل، طالبان تو به‌سبب من رسوا نگردند. "},
	{7, "7  زیرا به خاطر تو متحمل عار گردیده‌ام و رسوایی روی من، مرا پوشیده است. "},
	{8, "8  نزد برادرانم اجنبی شده‌ام و نزد پسران مادر خود غریب. "},
	{9, "9  زیرا غیرت خانهٔ تو مرا خورده است و ملامتهای ملامتکنندگان تو بر من طاری گردیده. "},
	{10, "10  روزه داشته، جان خود را مثل اشک ریختهام. و این برای من عار گردیده است. "},
	{11, "11  پلاس را لباس خود ساخته‌ام و نزد ایشان ضربالمثل گردیده‌ام. "},
	{12, "12  دروازه نشینان دربارهٔٔ من حرف می‌زنند و سرود می‌گساران گشته‌ام. "},
	{13, "13  و امّا من، ای خداوند دعای خود را در وقت اجابت نزد تو می‌کنم. ای خدا در کثرت رحمانیت خود و راستیِ نجات خود مرا مستجاب فرما. "},
	{14, "14  مرا از خَلاب خلاصی ده تا غرق نشوم و از نفرتکنندگانم و از ژرفیهای آب رستگار شوم. "},
	{15, "15  مگذار که سَیَلان آب مرا بپوشاند و ژرفی مرا ببلعد و هاویه دهان خود را بر من ببندد. "},
	{16, "16  ای خداوند مرا مستجاب فرما زیرا رحمت تو نیکوست. به کثرت رحمانیتت بر من توجه نما، "},
	{17, "17  و روی خود را از بنده‌ات مپوشان زیرا در تنگی هستم. مرا بزودی مستجاب فرما. "},
	{18, "18  به جانم نزدیک شده، آن را رستگار ساز. به‌سبب دشمنانم مرا فدیه ده. "},
	{19, "19  تو عار و خجالت و رسوایی مرا می‌دانی و جمیع خصمانم پیش نظر تواند. "},
	{20, "20  عار، دلِ مرا شکسته است و به شدت بیمار شده‌ام. انتظار مُشْفِقی کشیدم، ولی نبود و برای تسلیدهندگان، امّا نیافتم. "},
	{21, "21  مرا برای خوراک زردآب دادند و چون تشنه بودم مرا سرکه نوشانیدند. "},
	{22, "22  پس مائدهٔ ایشان پیش روی ایشان تله باد و چون مطمئن هستند، دامی باشد. "},
	{23, "23  چشمان ایشان تار گردد تا نبینند و کمرهای ایشان را دائماً لرزان گردان. "},
	{24, "24  خشم خود را بر ایشان بریز و سورت غضب تو ایشان را دریابد. "},
	{25, "25  خانه‌های ایشان مخروبه گردد و در خیمه‌های ایشان هیچ‌کس ساکن نشود. "},
	{26, "26  زیرا برکسی که تو زده‌ای جفا می‌کنند و دردهای کوفتگان تو را اعلان می‌نمایند. "},
	{27, "27  گناه بر گناه ایشان مزید کن و در عدالت تو داخل نشوند. "},
	{28, "28  از دفتر حیات محوشوند و با صالحین مرقوم نگردند. "},
	{29, "29  و امّا من، مسکین و دردمند هستم. پس ای خدا، نجات تو مرا سرافراز سازد. "},
	{30, "30  و نام خدا را با سرود تسبیح خواهم خواند و او را با حمد تعظیم خواهم نمود. "},
	{31, "31  و این پسندیدهٔ خدا خواهد بود، زیاده از گاو و گوسالهای که شاخها و سمها دارد. "},
	{32, "32  حلیمان این را دیده، شادمان شوند، و ای طالبان خدا دل شما زنده گردد، "},
	{33, "33  زیرا خداوند فقیران را مستجاب می‌کند و اسیران خود را حقیر نمی‌شمارد. "},
	{34, "34  آسمان و زمین او را تسبیح بخوانند. آبها نیز و آنچه در آنها می‌جنبد. "},
	{35, "35  زیرا خدا صهیون را نجات خواهد داد و شهرهای یهودا را بنا خواهد نمود تا در آنجا سکونت نمایند و آن را متصرف گردند. "},
	{36, "36  و ذریت بندگانش وارث آن خواهند شد و آنانی که نام او را دوست دارند، در آن ساکن خواهند گردید. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view70() {
struct fa70 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور داود بجهت یادگاری] خدایا، برای نجات من بشتاب! ای خداوند به اعانت من تعجیل فرما! "},
	{2, "2  آنانی که قصد جان من دارند، خجل و شرمنده شوند، و آنانی که در بدی من رغبت دارند، رو برگردانیده و رسوا گردند، "},
	{3, "3  و آنانی که هَه‌هَه می‌گویند، به‌سبب خجالت خویش رو برگردانیده شوند. "},
	{4, "4  و امّا جمیع طالبان تو، در تو وجد و شادی کنند، و دوست دارندگان نجات تو دائماً گویند،خدا متعال باد! "},
	{5, "5  و امّا من مسکین و فقیر هستم. خدایا برای من تعجیل کن. تو مددکار و نجات‌دهندهٔٔ من هستی. ای خداوند تأخیر منما. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view71() {
struct fa71 poems[] = {
	{1, "1  در تو ای خداوند پناه برده‌ام، پس تا به ابد خجل نخواهم شد. "},
	{2, "2  به عدالت خود مرا خلاصی ده و برهان. گوش خود را به من فراگیر و مرا نجات ده. "},
	{3, "3  برای من صخرهٔ سکونت باش تا همه وقت داخل آن شوم. تو به نجات من امر فرموده‌ای، زیرا صخره و قلعهٔ من تو هستی. "},
	{4, "4  خدایا مرا از دست شریر برهان و از کف بدکار و ظالم. "},
	{5, "5  زیرا ای خداوند یهوه، تو امید من هستی و از طفولیّتم اعتماد من بوده‌ای. "},
	{6, "6  از شکم بر تو انداخته شده‌ام. از رحم مادرم ملجای من تو بوده‌ای و تسبیح من دائماً دربارهٔٔ تو خواهد بود. "},
	{7, "7  بسیاری را آیتی عجیب شده‌ام. لیکن تو ملجای زورآور من هستی. "},
	{8, "8  دهانم از تسبیح تو پر است و از کبریاییِ تو تمامیِ روز. "},
	{9, "9  در زمان پیری مرا دور مینداز چون قوّتم زایل شود مرا ترک منما. "},
	{10, "10  زیرا دشمنانم بر من حرف می‌زنند و مترصّدان جانم با یکدیگر مشورت می‌کنند "},
	{11, "11  و می‌گویند، خدا او را ترک کرده است. پس او را تعاقب کرده، بگیرید، زیرا که رهاننده‌ای نیست. "},
	{12, "12  ای خدا از من دور مشو. خدایا به اعانت من تعجیل نما. "},
	{13, "13  خصمان جانم خجل و فانی شوند. و آنانی که برای ضرر من می‌کوشند، به عار و رسوایی ملبس گردند. "},
	{14, "14  و امّا من دائماً امیدوار خواهم بود و بر همهٔٔ تسبیح تو خواهم افزود. "},
	{15, "15  زبانم عدالت تو را بیان خواهد کرد و نجاتت راتمامیِ روز. زیرا که حد شمارهٔ آن را نمی‌دانم. "},
	{16, "16  در تواناییِ خداوند یهوه خواهم آمد و از عدالت تو و بس خبر خواهم داد. "},
	{17, "17  ای خدا از طفولیتم مرا تعلیم داده‌ای و تا الآن، عجایب تو را اعلان کرده‌ام. "},
	{18, "18  پس ای خدا، مرا تا زمان پیری و سفید مویی نیز ترک مکن، تا این طبقه را از بازوی تو خبر دهم و جمیع آیندگان را از تواناییِ تو. "},
	{19, "19  خدایا عدالت تو تا اعلیعلیین است. تو کارهای عظیم کرده‌ای. خدایا مانند تو کیست؟ "},
	{20, "20  ای که تنگیهای بسیار و سخت را به ما نشان داده‌ای، رجوع کرده، باز ما را زنده خواهی ساخت؛ و برگشته، ما را از عمق‌های زمین برخواهی آورد. "},
	{21, "21  بزرگیِ مرا مزید خواهی کرد و برگشته، مرا تسلی خواهی بخشید. "},
	{22, "22  پس من نیز تو را با بربط خواهم ستود، یعنی راستیِ تو را ای خدای من، و تو را ای قدوس اسرائیل با عود ترنم خواهم نمود. "},
	{23, "23  چون برای تو سرود می‌خوانم لبهایم بسیار شادی خواهد کرد و جانم نیز که آن را فدیه داده‌ای. "},
	{24, "24  زبانم نیز تمامیِ روز عدالت تو را ذکر خواهد کرد. زیرا آنانی که برای ضرر من می‌کوشیدند، خجل و رسوا گردیدند. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view72() {
struct fa72 poems[] = {
	{1, "1  [مزمور سلیمان] ای خدا، انصاف خود را به پادشاه ده و عدالت خویش را به پسر پادشاه! "},
	{2, "2  و او قوم تو را به عدالت داوری خواهد نمود و مساکین تو را به انصاف. "},
	{3, "3  آنگاه کوه‌ها برای قوم سلامتی را بار خواهند آورد و تلها نیز در عدالت. "},
	{4, "4  مساکین قوم را دادرسی خواهد کرد؛ و فرزندان فقیر را نجات خواهد داد؛ و ظالمان را زبون خواهدساخت. "},
	{5, "5  از تو خواهند ترسید، مادامی که آفتاب باقی است و مادامی که ماه هست تا جمیع طبقات. "},
	{6, "6  او مثل باران برعلفزارِ چیده شده فرود خواهد آمد، و مثل بارشهایی که زمین را سیراب می‌کند. "},
	{7, "7  در زمان او صالحان خواهند شکفت و وفور سلامتی خواهد بود، مادامی که ماه نیست نگردد. "},
	{8, "8  و او حکمرانی خواهد کرد از دریا تا دریا و از نهر تا اقصای جهان. "},
	{9, "9  به حضور وی صحرانشینان گردن خواهند نهاد و دشمنان او خاک را خواهند لیسید. "},
	{10, "10  پادشاهان ترشیش و جزایر هدایا خواهند آورد. پادشاهان شَبا و سَبا ارمغانها خواهند رسانید. "},
	{11, "11  جمیع سلاطین او را تعظیم خواهند کرد و جمیع امّت‌ها او را بندگی خواهند نمود. "},
	{12, "12  زیرا چون مسکین استغاثه کند، او را رهایی خواهد داد و فقیری را که رهاننده‌ای ندارد. "},
	{13, "13  بر مسکین و فقیر کَرَم خواهد فرمود و جانهای مساکین را نجات خواهد بخشید. "},
	{14, "14  جانهای ایشان را از ظلم و ستم فدیه خواهد داد و خون ایشان در نظر وی گرانبها خواهد بود. "},
	{15, "15  و او زنده خواهد ماند و از طلای شبا بدو خواهد داد. دائماً برای وی دعا خواهد کرد و تمامی روز او را مبارک خواهد خواند. "},
	{16, "16  و فراوانیِ غله در زمین بر قلهٔ کوه‌ها خواهد بود که ثمرهٔٔ آن مثل لُبنان جنبش خواهد کرد. و اهل شهرها مثل علف زمین نشو و نما خواهند کرد. "},
	{17, "17  نام او تا ابدالآباد باقی خواهد ماند. اسم او پیش آفتاب دوام خواهد کرد. آدمیان در او برای یکدیگر برکت خواهند خواست و جمیع امّت‌های زمین او را خوشحال خواهند خواند. "},
	{18, "18  متبارک باد یهوه خدا که خدای اسرائیل است.که او فقط کارهای عجیب می‌کند. "},
	{19, "19  و متبارک باد نام مجید او تا ابدالآباد. و تمامیِ زمین از جلال او پر بشود. آمین و آمین. "},
	{20, "20  دعاهای داود بن یسی تمام شد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view73() {
struct fa73 poems[] = {
	{1, "1  [مزمور آساف] هرآینه خدا برای اسرائیل نیکوست، یعنی برای آنانی که پاکدل هستند. "},
	{2, "2  و امّا من نزدیک بود که پایهایم از راه در رود و نزدیک بود که قدمهایم بلغزد. "},
	{3, "3  زیرا بر متکبران حسد بردم چون سلامتیِ شریران را دیدم. "},
	{4, "4  زیرا که در موت ایشان قیده‌ا نیست و قوّت ایشان مستحکم است. "},
	{5, "5  مثل مردم در زحمت نیستند و مثل آدمیان مبتلا نمی‌باشند. "},
	{6, "6  بنابراین گردن ایشان به تکبر آراسته است و ظلم مثل لباس ایشان را می‌پوشاند. "},
	{7, "7  چشمان ایشان از فربهی بدر آمده است و از خیالات دل خود تجاوز می‌کنند. "},
	{8, "8  استهزا می‌کنند و حرفهای بد می‌زنند و سخنان ظلمآمیز را از جای بلند می‌گویند. "},
	{9, "9  دهان خود را بر آسمانها گذارده‌اند و زبان ایشان در جهان گردش می‌کند. "},
	{10, "10  پس قوم او بدینجا برمی‌گردند و آبهای فراوان، بدیشان نوشانیده می‌شود. "},
	{11, "11  و ایشان می‌گویند، خدا چگونه بداند و آیا حضرت اعلی علم دارد؟ "},
	{12, "12  اینک، اینان شریر هستند که همیشه مطمئن بوده، در دولتمندی افزوده می‌شوند. "},
	{13, "13  یقیناً من دل خود را عبث طاهر ساخته و دستهای خود را به پاکی شستهام. "},
	{14, "14  و من تمامیِ روز مبتلا می‌شوم و تأدیب من هر بامداد حاضر است. "},
	{15, "15  اگر می‌گفتم که چنین سخن گویم، هر آینه بر طبقهٔ فرزندان تو خیانت می‌کردم. "},
	{16, "16  چون تفکر کردم که این را بفهمم، در نظر من دشوار آمد. "},
	{17, "17  تا به قدسهای خدا داخل شدم. آنگاه در آخرت ایشان تأمل کردم. "},
	{18, "18  هر آینه ایشان را در جایهای لغزنده گذارده‌ای. ایشان را به خرابیها خواهی انداخت. "},
	{19, "19  چگونه بَغْتَهًٔ به هلاکت رسیده‌اند! تباه شده، از ترسهای هولناک نیست گردیده‌اند. "},
	{20, "20  مثل خوابِ کسی چون بیدار شد، ای خداوند همچنین چون برخیزی، صورت ایشان را ناچیز خواهی شمرد. "},
	{21, "21  لیکن دل من تلخ شده بود و در اندرون خود، دل ریش شده بودم. "},
	{22, "22  و من وحشی بودم و معرفت نداشتم و مثل بهایم نزد تو گردیدم. "},
	{23, "23  ولی من دائماً با تو هستم. تو دست راست مرا تأیید کرده‌ای. "},
	{24, "24  موافق رأی خود مرا هدایت خواهی نمود و بعد از این مرا به جلال خواهی رسانید. "},
	{25, "25  کیست برای من در آسمان؟ و غیر از تو هیچ چیز را در زمین نمی‌خواهم. "},
	{26, "26  اگرچه جسد و دل من زائل گردد، لیکن صخرهٔ دلم و حصهٔ من خداست تا ابدالآباد. "},
	{27, "27  زیرا آنانی که از تو دورند هلاک خواهند شد. و آنانی را که از تو زنا می‌کنند، نابود خواهی ساخت. "},
	{28, "28  و امّا مرا نیکوست که به خدا تقّرب جویم. بر خداوند یهوه توکّل کرده‌ام تا همهٔٔ کارهای تو را بیان کنم. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view74() {
struct fa74 poems[] = {
	{1, "1  [قصیدهٔ آساف] چرا ای خدا ما را ترک کرده‌ای تا به ابد و خشم تو بر گوسفندان مرتع خود افروخته شده است؟ "},
	{2, "2  جماعت خود را که از قدیم خریده‌ای، به یاد آور و آن را که فدیه داده‌ای تا سبط میراث تو شود و این کوه صهیون را که در آن ساکن بوده‌ای. "},
	{3, "3  قدمهای خود را بسوی خرابه‌های ابدی بردار زیرا دشمن هرچه را که در قدس تو بود، خراب کرده است. "},
	{4, "4  دشمنانت در میان جماعت تو غرّش می‌کنند و عَلَمهای خود را برای علامات برپا می‌نمایند. "},
	{5, "5  و ظاهر می‌شوند چون کسانی که تبرها را بر درختان جنگل بلند می‌کنند. "},
	{6, "6  و الآن همهٔٔ نقشهای تراشیدهٔ آن را به تبرها و چکشها خرد می‌شکنند. "},
	{7, "7  قدسهای تو را آتش زده‌اند و مسکن نام تو را تا به زمین بی‌حرمت کرده‌اند. "},
	{8, "8  و در دل خود می‌گویند، آنها را تماماً خراب می‌کنیم. پس جمیع کنیسه‌های خدا را در زمین سوزانیده‌اند. "},
	{9, "9  آیات خود را نمی‌بینیم و دیگر هیچ نبی نیست. و در میان ما کسی نیست که بداند تا به کی خواهد بود. "},
	{10, "10  ای خدا، دشمن تا به کی ملامت خواهد کرد؟ و آیا خصم، تا به ابد نام تو را اهانت خواهد نمود؟ "},
	{11, "11  چرا دست خود، یعنی دست راست خویش را برگردانیده‌ای؟ آن را از گریبان خود بیرون کشیده، ایشان را فانی کن. "},
	{12, "12  و خدا از قدیم پادشاه من است. او در میان زمین نجاتها پدید می‌آورد. "},
	{13, "13  تو به قوّت خود دریا را منشق ساختی و سرهای نهنگان را در آبهاشکستی. "},
	{14, "14  سرهای لِویاتان را کوفته، و او را خوراک صحرانشینان گردانیده‌ای. "},
	{15, "15  تو چشمه‌ها و سیلها را شکافتی و نهرهای دائمی را خشک گردانیدی. "},
	{16, "16  روز از آنِ توست و شب نیز از آنِ تو. نور و آفتاب را تو برقرار نموده‌ای. "},
	{17, "17  تمامی حدود جهان را تو پایدار ساخته‌ای. تابستان و زمستان را تو ایجاد کرده‌ای. "},
	{18, "18  ای خداوند این را به یادآور که دشمن ملامت می‌کند و مردم جاهل نام تو را اهانت می‌نمایند. "},
	{19, "19  جانِ فاختهٔ خود را به جانور وحشی مسپار. جماعت مسکینان خود را تا به ابد فراموش مکن. "},
	{20, "20  عهد خود را ملاحظه فرما زیرا که ظلمات جهان از مسکنهای ظلم پراست. "},
	{21, "21  مظلومان به رسوایی برنگردند. مساکین و فقیران نام تو را حمد گویند. "},
	{22, "22  ای خدا برخیز و دعوای خود را برپا دار؛ و به یادآور که احمق تمامیِ روز تو را ملامت می‌کند. "},
	{23, "23  آواز دشمنان خود را فراموش مکن و غوغای مخالفان خود را که پیوسته بلند می‌شود. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view75() {
struct fa75 poems[] = {
	{1, "1  [برای سالار مغنیان بر لاتهلک. مزمور و سرود آساف] تو را حمد می‌گوییم! ای خدا تو را حمد می‌گوییم! زیرا نام تو نزدیک است و مردم کارهای عجیب تو را ذکر می‌کنند. "},
	{2, "2  هنگامی که به زمان معین برسم، براستی داوری خواهم کرد. "},
	{3, "3  زمین و جمیع ساکنانش گداخته شده‌اند. من ارکان آن را برقرار نموده‌ام، سِلاه. "},
	{4, "4  متکبران را گفتم، فخر مکنید! و به شریران که شاخ خود را میفرازید. "},
	{5, "5  شاخهای خود را بهبلندی میفرازید. و با گردنکشی سخنان تکبرآمیز مگویید. "},
	{6, "6  زیرا نه از مشرق و نه از مغرب، و نه از جنوب سرافرازی می‌آید. "},
	{7, "7  لیکن خدا، داور است. این را به زیر می‌اندازد و آن را سرافراز می‌نماید. "},
	{8, "8  زیرا در دست خداوند کاسهای است و بادهٔ آن پرجوش. از شراب ممزوج پر است که از آن می‌ریزد. و امّا دُرده‌ایش را جمیع شریران جهان افشرده، خواهند نوشید. "},
	{9, "9  و امّا من، تا به ابد ذکر خواهم کرد و برای خدای یعقوب ترنم خواهم نمود. "},
	{10, "10  جمیع شاخهای شریران را خواهم برید و امّا شاخهای صالحین برافراشته خواهد شد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view76() {
struct fa76 poems[] = {
	{1, "1  [برای سالار مغنیان برذوات اوتار. مزمور و سرود آساف] خدا در یهودا معروف است و نام او در اسرائیل عظیم! "},
	{2, "2  خیمهٔٔ او است در شالیم و مسکن او در صهیون. "},
	{3, "3  در آنجا، برقهای کمان را شکست. سپر و شمشیر و جنگ را، سِلاه. "},
	{4, "4  تو جلیل هستی و مجید، زیاده از کوه‌های یغما! "},
	{5, "5  قوی دلان تاراج شده‌اند و خواب ایشان را درربود و همهٔٔ مردان زورآور دست خود را نیافتند. "},
	{6, "6  از توبیخ تو ای خدای یعقوب، بر ارابه‌ها و اسبان خوابی گران مستولی گردید. "},
	{7, "7  تو مهیب هستی، تو! و در حین غضبت، کیست که به حضور تو ایستد؟ "},
	{8, "8  از آسمان داوری را شنوانیدی. پس جهان بترسید و ساکت گردید. "},
	{9, "9  چون خدا برای داوری قیام فرماید تا همهٔٔ مساکینِ جهان را خلاصی بخشد، سِلاه، "},
	{10, "10  آنگاه خشم انسان تو را حمد خواهد گفت، و باقی خشم را بر کمر خود خواهی بست. "},
	{11, "11  نذر کنید و وفا نمایید برای یهوه خدای خود. همه که گرداگرد او هستند، هدیه بگذرانند نزد او که مَهیب است. "},
	{12, "12  روح رؤسا را منقطع خواهد ساخت و برای پادشاهان جهان مهیب می‌باشد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view77() {
struct fa77 poems[] = {
	{1, "1  [برای سالار مغنیان بر یدوتون. مزمور آساف] آواز من بسوی خداست و فریاد می‌کنم؛ آواز من بسوی خداست. گوش خود را به من فرا خواهد گرفت. "},
	{2, "2  در روز تنگیِ خود خداوند را طلب کردم. در شب، دست من دراز شده، بازکشیده نگشت و جان من تسلی نپذیرفت. "},
	{3, "3  خدا را یاد می‌کنم و پریشان می‌شوم. تفکر می‌نمایم و روح من متحیر می‌گردد، سلاه. "},
	{4, "4  چشمانم را بیدار می‌داشتی. بیتاب می‌شدم و سخن نمی‌توانستم گفت. "},
	{5, "5  دربارهٔ ایام قدیم تفکر کرده‌ام. دربارهٔٔ سالهای زمانهای سلف. "},
	{6, "6  سرود شبانهٔ خود را بخاطر می‌آورم و در دل خود تفکر می‌کنم و روح من تفتیش نموده است. "},
	{7, "7  مگر خدا تا به ابد ترک خواهد کرد و دیگر هرگز راضی نخواهد شد. "},
	{8, "8  آیا رحمت او تا به ابد زایل شده است؟ و قول او باطل گردیده تا ابدالآباد؟ "},
	{9, "9  آیا خدا رأفت را فراموش کرده؟ و رحمتهای خود را در غضب مسدود ساخته است؟ سلاه. "},
	{10, "10  پس گفتم این ضعف من است. زهی سالهای دست راست حضرت اعلی! "},
	{11, "11  کارهای خداوند را ذکر خواهم نمود زیرا کار عجیب تو را که از قدیم است، به یاد خواهم آورد "},
	{12, "12  و در جمیعکارهای تو تأمل خواهم کرد و در صنعتهای تو تفکر خواهم نمود. "},
	{13, "13  ای خدا، طریق تو در قدوسیت است. کیست خدای بزرگ مثل خدا؟ "},
	{14, "14  تو خدایی هستی که کارهای عجیب می‌کنی و قوّت خویش را بر قومها معروف گردانیده‌ای. "},
	{15, "15  قوم خود را به بازوی خویش رهانیده‌ای، یعنی بنی‌یعقوب و بنی‌یوسف را. سلاه. "},
	{16, "16  آبها تو را دید، ای خدا، آبها تو را دیده، متزلزل شد. لجّه‌ها نیز سخت مضطرب گردید. "},
	{17, "17  ابرها آب بریخت و افلاک رعد بداد. تیرهای تو نیز به هر طرف روان گردید. "},
	{18, "18  صدای رَعد تو در گردباد بود و برقها ربع مسکون را روشن کرد. پس زمین مرتعش و متزلزل گردید. "},
	{19, "19  طریق تو در دریاست و راه‌های تو در آبهای فراوان و آثار تو را نتوان دانست. "},
	{20, "20  قوم خود را مثل گوسفندان راهنمایی نمودی، به دست موسی و هارون. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view78() {
struct fa78 poems[] = {
	{1, "1  [قصیدهٔ آساف] ای قوم من شریعت مرا بشنوید!گوشهای خود را به سخنان دهانم فراگیرید! "},
	{2, "2  دهان خود را به مَثَل باز خواهم کرد به چیزهایی که از بنای عالم مخفی بود، تنطق خواهم نمود، "},
	{3, "3  که آنها را شنیده و دانسته‌ایم و پدران ما برای ما بیان کرده‌اند. "},
	{4, "4  از فرزندان ایشان آنها را پنهان نخواهیم کرد. تسبیحات خداوند را برای نسل آینده بیان می‌کنیم و قوّت او و اعمال عجیبی را که او کرده است. "},
	{5, "5  زیرا که شهادتی در یعقوب برپا داشت و شریعتی در اسرائیل قرار دادو پدران ما را امر فرمود که آنها را به فرزندان خود تعلیم دهند؛ "},
	{6, "6  تا نسل آینده آنها را بدانند و فرزندانی که می‌بایست مولود شوند تا ایشان برخیزند و آنها را به فرزندان خود بیان نمایند؛ "},
	{7, "7  و ایشان به خدا توکّل نمایند و اعمال خدا را فراموش نکنند، بلکه احکام او را نگاه دارند. "},
	{8, "8  و مثل پدران خود نسلی گردنکش و فتنهانگیز نشوند، نسلی که دل خود را راست نساختند و روح ایشان بسوی خدا امین نبود. "},
	{9, "9  بنیافرایم که مسلح و کمانکش بودند، در روز جنگ رو برتافتند. "},
	{10, "10  عهد خدا را نگاه نداشتند و از سلوک به شریعت او ابا نمودند، "},
	{11, "11  و اعمال و عجایب او را فراموش کردند که آنها را بدیشان ظاهر کرده بود، "},
	{12, "12  و در نظر پدران ایشان اعمال عجیب کرده بود، در زمین مصر و در دیار صوعن. "},
	{13, "13  دریا را مُنْشَقّ ساخته، ایشان را عبور داد و آبها را مثل توده برپا نمود. "},
	{14, "14  و ایشان را در روز به ابر راهنمایی کرد و تمامیِ شب به نور آتش. "},
	{15, "15  در صحرا صخره‌ها را بشکافت و ایشان را گویا از لجّه‌های عظیم نوشانید. "},
	{16, "16  پس سیلها را از صخره بیرون آورد و آب را مثل نهرها جاری ساخت. "},
	{17, "17  و بار دیگر بر او گناه ورزیدند و بر حضرت اعلیٰ در صحرا فتنه انگیختند، "},
	{18, "18  و در دلهای خود خدا را امتحان کردند، چونکه برای شهوات خود غذا خواستند. "},
	{19, "19  و بر ضد خدا تکلم کرده، گفتند، آیا خدا می‌تواند در صحرا سفرهای حاضر کند؟ "},
	{20, "20  اینک، صخره را زد و آبها روان شد و وادیها جاری گشت. آیا می‌تواند نان را نیز بدهد. و گوشت را برای قوم خود حاضرسازد؟ "},
	{21, "21  پس خدا این را شنیده، غضبناک شد و آتش در یعقوب افروخته گشت و خشم بر اسرائیل مشتعل گردید. "},
	{22, "22  زیرا به خدا ایمان نیاوردند و به نجات او اعتماد ننمودند. "},
	{23, "23  پس ابرها را از بالا امر فرمود و درهای آسمان را گشود "},
	{24, "24  و منّ را بر ایشان بارانید تا بخورند و غلهٔ آسمان را بدیشان بخشید. "},
	{25, "25  مردمان، نان زورآوران را خوردند و آذوقهای برای ایشان فرستاد تا سیر شوند. "},
	{26, "26  باد شرقی را در آسمان وزانید و به قوّت خود، باد جنوبی را آورد، "},
	{27, "27  و گوشت را برای ایشان مثل غبار بارانید و مرغان بالدار را مثل ریگ دریا. "},
	{28, "28  و آن را در میان اُردوی ایشان فرود آورد، گرداگرد مسکنهای ایشان. "},
	{29, "29  پس خوردند و نیکو سیر شدند و موافق شهوات ایشان بدیشان داد. "},
	{30, "30  ایشان از شهوت خود دست نکشیدند. و غذا هنوز در دهان ایشان بود "},
	{31, "31  که غضب خدا بر ایشان افروخته شده؛ تنومندان ایشان را بکُشت و جوانان اسرائیل را هلاک ساخت. "},
	{32, "32  با وجود این همه، باز گناه ورزیدند و به اعمال عجیب او ایمان نیاوردند. "},
	{33, "33  بنابراین، روزهای ایشان را در بطالت تمام کرد و سالهای ایشان را درترس. "},
	{34, "34  هنگامی که ایشان را کُشت او را طلبیدند و بازگشت کرده، دربارهٔٔ خدا تفحص نمودند، "},
	{35, "35  و به یاد آوردند که خدا صخرهٔ ایشان، و خدای تعالی ولیّ ایشان است. "},
	{36, "36  امّا به دهان خود او را تملّق نمودند و به زبان خویش به او دروغ گفتند، "},
	{37, "37  زیرا که دل ایشان با او راست نبود و به عهد وی مؤتمن نبودند. "},
	{38, "38  امّا او به حسب رحمانیتش گناه ایشان را عفو نموده، ایشان را هلاک نساخت بلکه بارها غضب خود را برگردانیده، تمامیِ خشم خویش را برنینگیخت. "},
	{39, "39  و به یاد آورد که ایشان بشرند، بادی که می‌رود و بر نمی‌گردد. "},
	{40, "40  چند مرتبه در صحرا بدو فتنه انگیختند و او را در بادیه رنجانیدند. "},
	{41, "41  و برگشته، خدا را امتحان کردند و قدوس اسرائیل را اهانت نمودند، "},
	{42, "42  و قوّت او را به خاطر نداشتند، روزی که ایشان را از دشمن رهانیده بود؛ "},
	{43, "43  که چگونه آیات خود را در مصر ظاهر ساخت و معجزات خود را در دیار صوعن. "},
	{44, "44  و نهرهای ایشان را به خون مبدل نمود و روده‌ای ایشان را تا نتوانستند نوشید. "},
	{45, "45  انواع پشه‌ها در میان ایشان فرستاد که ایشان را گزیدند و غوکهایی که ایشان را تباه نمودند؛ "},
	{46, "46  و محصول ایشان را به کِرم صد پا سپرد و عمل ایشان را به ملخ داد. "},
	{47, "47  تاکستان ایشان را به تگرگ خراب کرد و درختان جُمَّیِز ایشان را به تگرگهای درشت. "},
	{48, "48  بهایم ایشان را به تگرگ سپرد و مواشی ایشان را به شعله‌های برق. "},
	{49, "49  و آتش خشم خود را بر ایشان فرستاد، غضب و غیظ و ضیق را، به فرستادن فرشتگان شریر. "},
	{50, "50  و راهی برای غضب خود مهیا ساخته، جان ایشان را از موت نگاه نداشت، بلکه جان ایشان را به وبا تسلیم نمود. "},
	{51, "51  و همهٔٔ نخستزادگان مصر را کُشت، اوایل قوّت ایشان را در خیمه‌های حام. "},
	{52, "52  و قوم خود را مثل گوسفندان کوچانید و ایشان را در صحرا مثل گله راهنمایی نمود. "},
	{53, "53  وایشان را در امنیت رهبری کرد تا نترسند و دریا دشمنان ایشان را پوشانید. "},
	{54, "54  و ایشان را به حدود مقدّس خود آورد، بدین کوهی که به دست راست خود تحصیل کرده بود. "},
	{55, "55  و امّت‌ها را از حضور ایشان راند و میراث را برای ایشان به ریسمان تقسیم کرد و اسباط اسرائیل را در خیمه‌های ایشان ساکن گردانید. "},
	{56, "56  لیکن خدای تعالی را امتحان کرده، بدو فتنه انگیختند و شهادات او را نگاه نداشتند. "},
	{57, "57  و برگشته، مثل پدران خود خیانت ورزیدند و مثل کمان خطا کننده منحرف شدند. "},
	{58, "58  و به مقامهای بلند خود خشم او را به هیجان آوردند و به بتهای خویش غیرت او را جنبش دادند. "},
	{59, "59  چون خدا این را بشنید غضبناک گردید و اسرائیل را به شدت مکروه داشت. "},
	{60, "60  پس مسکن شیلو را ترک نمود، آن خیمه‌ای را که در میان آدمیان برپا ساخته بود، "},
	{61, "61  و [تابوت] قوّت خود را به اسیری داد و جمال خویش را به دست دشمن سپرد، "},
	{62, "62  و قوم خود را به شمشیر تسلیم نمود و با میراث خود غضبناک گردید. "},
	{63, "63  جوانان ایشان را آتش سوزانید و برای دوشیزگان ایشان سرودِ نکاح نشد. "},
	{64, "64  کاهنان ایشان به دم شمشیر افتادند و بیوه‌های ایشان نوحهگری ننمودند. "},
	{65, "65  آنگاه خداوند مثل کسی که خوابیده بود بیدار شد، مثل جباری که از شراب می‌خروشد، "},
	{66, "66  و دشمنان خود را به عقب زد و ایشان را عار ابدی گردانید. "},
	{67, "67  و خیمهٔٔ یوسف را رد نموده، سبط افرایم را برنگزید. "},
	{68, "68  لیکن سبط یهودا رابرگزید و این کوه صهیون را که دوست می‌داشت. "},
	{69, "69  و قدس خود را مثل کوه‌های بلند بنا کرد، مثل جهان که آن را تا ابدالآباد بنیاد نهاد. "},
	{70, "70  و بندهٔ خود داود را برگزید و او را از آغلهای گوسفندان گرفت. "},
	{71, "71  از عقب میشهای شیرده او را آورد تا قوم او یعقوب و میراث او اسرائیل را رعایت کند. "},
	{72, "72  پس ایشان را به حسب کمال دل خود رعایت نمود و ایشان را به مهارت دستهای خویش هدایت کرد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view79() {
struct fa79 poems[] = {
	{1, "1  [مزمور آساف] ای خدا، امّت‌ها به میراث تو داخل شده، هیکل قدس تو را بیعصمت ساختند. اورشلیم را خرابه‌ها نمودند. "},
	{2, "2  لاشهای بندگانت را به مرغان هوا برای خوراک دادند و گوشت مقدّسانت را به وحوش صحرا. "},
	{3, "3  خون ایشان را گرداگرد اورشلیم مثل آب ریختند و کسی نبود که ایشان را دفن کند. "},
	{4, "4  نزد همسایگان خود عار گردیده‌ایم و نزد مجاوران خویش استهزا و سُخریّه شده‌ایم. "},
	{5, "5  تا کی ای خداوند تا به ابد خشمناک خواهی بود؟ آیا غیرت تو مثل آتش افروخته خواهد شد تا ابدالآباد؟ "},
	{6, "6  قهر خود را بر امّت‌هایی که تو را نمی‌شناسند بریز و بر ممالکی که نام تو را نمی‌خوانند! "},
	{7, "7  زیرا که یعقوب را خورده، و مسکن او را خراب کرده‌اند. "},
	{8, "8  گناهان اجداد ما را بر ما به یاد میاور. رحمتهای تو بزودی پیش روی ما آید زیرا که بسیار ذلیل شده‌ایم. "},
	{9, "9  ای خدا، ای نجات‌دهندهٔٔ ما، به خاطر جلال نام خود ما را یاری فرما و ما را نجات ده و بخاطر نام خود گناهان ما را بیامرز. "},
	{10, "10  چرا امّت‌ها گویند که خدای ایشان کجاست؟ انتقام خون بندگانت که ریخته شده است، بر امّت‌ها در نظر ما معلوم شود. "},
	{11, "11  نالهٔ اسیران به حضور تو برسد. به حسب عظمت بازوی خود آنانی را که به موت سپرده شده‌اند، برهان. "},
	{12, "12  و جزای هفت چندان به آغوش همسایگان ما رسان، برای اهانتی که به تو کرده‌اند، ای خداوند. "},
	{13, "13  پس ما که قوم تو و گوسفندان مرتع تو هستیم، تو را تا به ابد شکر خواهیم گفت و تسبیح تو را نسلاً بعد نسل ذکر خواهیم نمود. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view80() {
struct fa80 poems[] = {
	{1, "1  [برای سالار مغنیان. شهادتی بر سوسنها. مزمور آساف] ای شبانِ اسرائیل بشنو! ای که یوسف را مثل گله رعایت می‌کنی! ای که بر کروبیین جلوس نموده‌ای، تجلی فرما! "},
	{2, "2  به حضور افرایم و بنیامین و مَنَسی، توانایی خود را برانگیز و برای نجات ما بیا! "},
	{3, "3  ای خدا ما را باز آور و روی خود را روشن کن تا نجات یابیم! "},
	{4, "4  ای یهوه، خدای صبایوت، تا به کی به دعای قوم خویش غضبناک خواهی بود، "},
	{5, "5  نان ماتم را بدیشان می‌خورانی و اشکهای بیاندازه بدیشان می‌نوشانی؟ "},
	{6, "6  ما را محل منازعهٔ همسایگان ما ساخته‌ای و دشمنان ما در میان خویش استهزا می‌نمایند. "},
	{7, "7  ای خدای لشکرها ما را بازآور و روی خود را روشن کن تا نجات یابیم! "},
	{8, "8  مَوی را ازمصر بیرون آوردی. امّت‌ها را بیرون کرده، آن را غرس نمودی. "},
	{9, "9  پیش روی آن را وسعت دادی. پس ریشهٔٔ خود را نیکو زده، زمین را پر ساخت. "},
	{10, "10  کوه‌ها به سایهاش پوشانیده شد و سروهای آزاد خدا به شاخه‌هایش. "},
	{11, "11  شاخه‌های خود را تا به دریا پهن کرد و فرعهای خویش را تا به نهر. "},
	{12, "12  پس چرا دیوارهایش را شکستهای که هر راهگذری آن را می‌چیند؟ "},
	{13, "13  گرازهای جنگل آن را ویران می‌کنند و وحوش صحرا آن را می‌چرند. "},
	{14, "14  ای خدای لشکرها رجوع کرده، از آسمان نظر کن و ببین و از این مَوْ تفقد نما "},
	{15, "15  و از این نهالی که دست راست تو غرس کرده است و از آن پسری که برای خویشتن قوی ساخته‌ای! "},
	{16, "16  مثل هیزم در آتش سوخته شده و از عتاب روی تو تباه گردیده‌اند! "},
	{17, "17  دست تو بر مرد دست راست تو باشد و بر پسر آدم که او را برای خویشتن قوی ساخته‌ای. "},
	{18, "18  و ما از تو رو نخواهیم تافت. ما را حیات بده تا نام تو را بخوانیم. "},
	{19, "19  ای یهوه، خدای لشکرها ما را بازآور و روی خود را روشن ساز تا نجات یابیم. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view81() {
struct fa81 poems[] = {
	{1, "1  [برای سالار مغنیان برجتّیت. مزمور آساف.] ترنّم نمایید برای خدایی که قوّت ماست. برای خدای یعقوب آواز شادمانی دهید! "},
	{2, "2  سرود را بلند کنید و دف را بیاورید و بربط دلنواز را با رباب! "},
	{3, "3  کَرِنّا را بنوازید در اوّل ماه، در ماه تمام و در روز عید ما. "},
	{4, "4  زیرا که این فریضهای است در اسرائیل و حکمی ازخدای یعقوب. "},
	{5, "5  این را شهادتی در یوسف تعیین فرمود، چون بر زمین مصر بیرون رفت، جایی که لغتی را که نفهمیده بودم شنیدم، "},
	{6, "6  دوشِ او را از بار سنگین آزاد ساختم و دستهای او از سبد رها شد. "},
	{7, "7  در تنگی استدعا نمودی و تو را خلاصی دادم. در سِترِ رعد، تو را اجابت کردم و تو را نزد آب مَریبَه امتحان نمودم. سلاه. "},
	{8, "8  ای قوم من بشنو و تو را تأکید می‌کنم. و ای اسرائیل اگر به من گوش دهی. "},
	{9, "9  در میان تو خدای غیر نباشد و نزدِ خدای بیگانه سجده منما. "},
	{10, "10  من یَهُوَه خدای تو هستم که تو را از زمین مصر برآوردم. دهان خود را نیکو باز کن و آن را پر خواهم ساخت. "},
	{11, "11  لیکن قوم من سخن مرا نشنیدند و اسرائیل مرا ابا نمودند. "},
	{12, "12  پس ایشان را به سختیِ دلشان ترک کردم که به مشورتهای خود سلوک نمایند. "},
	{13, "13  ای کاش که قوم من به من گوش می‌گرفتند و اسرائیل در طریق‌های من سالک می‌بودند. "},
	{14, "14  آنگاه دشمنان ایشان را بزودی به زیر می‌انداختم و دست خود را برخصمان ایشان برمی‌گردانیدم. "},
	{15, "15  آنانی که از خداوند نفرت دارند بدو گردن می‌نهادند. امّا زمان ایشان باقی می‌بود تا ابدالآباد. "},
	{16, "16  ایشان را به نیکوترین گندم می‌پرورد؛ و تو را به عسل از صخره سیر می‌کردم. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view82() {
struct fa82 poems[] = {
	{1, "1  [مزمور آساف] خدا در جماعت خدا ایستاده است، در میان خدایان داوری می‌کند، "},
	{2, "2  تا به کی به بی‌انصافی داوری خواهید کرد و شریران راطرفداری خواهید نمود؟ سِلاه. "},
	{3, "3  فقیران و یتیمان را دادرسی بکنید. مظلومان و مسکینان را انصاف دهید. "},
	{4, "4  مظلومان و فقیران را برهانید و ایشان را از دست شریران خلاصی دهید. "},
	{5, "5  نمی‌دانند و نمی‌فهمند و در تاریکی راه می‌روند و جمیع اساس زمین متزلزل می‌باشد. "},
	{6, "6  من گفتم که شما خدایانید و جمیع شما فرزندان حضرت اعلی. "},
	{7, "7  لیکن مثل آدمیان خواهید مرد و چون یکی از سروران خواهید افتاد! "},
	{8, "8  ای خدا برخیز و جهان را داوری فرما زیرا که تو تمامیِ امّت‌ها را متصرف خواهی شد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view83() {
struct fa83 poems[] = {
	{1, "1  [سرود و مزمور آساف] ای خدا تو را خاموشی نباشد! ای خدا ساکت مباش و میارام! "},
	{2, "2  زیرا اینک، دشمنانت شورش می‌کنند و آنانی که از تو نفرت دارند، سر خود را برافراشتهاند. "},
	{3, "3  بر قوم تو مکاید می‌اندیشند وبر پناهآوردگان تو مشورت می‌کنند. "},
	{4, "4  و می‌گویند، بیایید ایشان را هلاک کنیم تا قومی نباشند و نام اسرائیل دیگر مذکور نشود. "},
	{5, "5  زیرا به یک دل با هم مشورت می‌کنند و بر ضد تو عهد بسته‌اند. "},
	{6, "6  خیمه‌های اَدُوم و اسماعیلیان و موآب و هاجریان. "},
	{7, "7  جَبال و عَمّون و عَمالیق و فَلَسْطین با ساکنان صور. "},
	{8, "8  آشور نیز با ایشان متفق شدند و بازویی برای بنیلوط گردیدند، سلاه. "},
	{9, "9  بدیشان عمل نما چنانکه به مدیان کردی، چنانکه به سیسرا و یابین در وادی قیشون، "},
	{10, "10  که در عَینْدوُر هلاک شدند و سرگین برای زمین گردیدند. "},
	{11, "11  سرورانِ ایشان را مثل غُراب و ذِئب گردان و جمیع امرای ایشان را مثل ذَبَحْ و صَلْمُنّاع، "},
	{12, "12  که می‌گفتند، مساکن خدا را برای خویشتن تصرف نماییم. "},
	{13, "13  ای خدای من، ایشان را چون غبارِ گردباد بساز و مانند کاه پیش روی باد. "},
	{14, "14  مثل آتشی که جنگل را می‌سوزاند و مثل شعلهای که کوه‌ها را مشتعل می‌سازد. "},
	{15, "15  همچنان ایشان را به تند باد خود بران و به طوفان خویش ایشان را آشفته گردان. "},
	{16, "16  رویهای ایشان را به ذلت پر کن تا نام تو را ای خداوند بطلبند. "},
	{17, "17  خجل و پریشان بشوند تا ابدالآباد و شرمنده و هلاک گردند. "},
	{18, "18  و بدانند تو که اسمت یهوه می‌باشد، به تنها بر تمامیِ زمین متعال هستی. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view84() {
struct fa84 poems[] = {
	{1, "1  [برای سالار مغنیان برجتّیت. مزمور بنیقورح] ای یَهُوَه صبایوت، چه دلپذیر است مسکنهای تو! "},
	{2, "2  جان من مشتاق، بلکه کاهیده شده است برای صحنهای خداوند . دلم و جسدم برای خدای حی صیحه می‌زند. "},
	{3, "3  گنجشک نیز برای خود خانه‌ای پیدا کرده است و پرستوک برای خویشتن آشیانهای تا بچه‌های خود را در آن بگذارد، در مذبحهای تو ای یهوه صبایوت که پادشاه من و خدای من هستی. "},
	{4, "4  خوشابحال آنانی که در خانهٔ تو ساکنند که تو را دائماً تسبیح می‌خوانند، سِلاه. "},
	{5, "5  خوشابحال مردمانی که قوّت ایشان در تو است و طریق‌های تو در دلهای ایشان. "},
	{6, "6  چون از وادیِ بکا عبور می‌کنند، آن را چشمه می‌سازند و بارانْ آن را بهبرکات می‌پوشاند. "},
	{7, "7  از قوّت تا قوّت می‌خرامند و هر یک از ایشان در صهیون نزد خدا حاضر می‌شوند. "},
	{8, "8  ای یهوه خدای لشکرها! دعای مرا بشنو! ای خدای یعقوب گوش خود را فراگیر! سلاه. "},
	{9, "9  ای خدایی که سپر ما هستی، ببین و به روی مسیح خود نظر انداز. "},
	{10, "10  زیرا یک روز در صحنهای تو بهتر است از هزار. ایستادن بر آستانهٔ خانهٔ خدای خود را بیشتر می‌پسندم از ساکن شدن در خیمه‌های اشرار. "},
	{11, "11  زیرا که یهوه خدا آفتاب و سپر است. خداوند فیض و جلال خواهد داد و هیچ چیز نیکو را منع نخواهد کرد از آنانی که به راستی سالک باشند. "},
	{12, "12  ای یهوه صبایوت، خوشابحال کسی که بر تو توکّل دارد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view85() {
struct fa85 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور بنیقورح] ای خداوند از زمین خود راضی شده‌ای. اسیریِ یعقوب را باز آورده‌ای. "},
	{2, "2  عصیان قوم خود را عفو کرده‌ای. تمامیِ گناهان ایشان را پوشانیده‌ای، سلاه. "},
	{3, "3  تمامیِ غضب خود را برداشته و از حدت خشم خویش رجوع کرده‌ای. "},
	{4, "4  ای خدای نجات ما، ما را برگردان و غیظ خود را از ما بردار. "},
	{5, "5  آیا تا به ابد با ما غضبناک خواهی بود؟ و خشم خویش را نسلاً بعد نسل طول خواهی داد؟ "},
	{6, "6  آیا برگشته ما را حیات نخواهی داد تا قوم تو در تو شادی نمایند؟ "},
	{7, "7  ای خداوند رحمت خود را بر ما ظاهر کن و نجات خویش را به ما عطا فرما. "},
	{8, "8  آنچه خدا یهوهمی‌گوید خواهم شنید زیرا به قوم خود و به مقدّسان خویش به سلامتی خواهد گفت تا بسوی جهالت برنگردند. "},
	{9, "9  یقیناً نجات او به ترسندگان او نزدیک است تا جلال در زمین ما ساکن شود. "},
	{10, "10  رحمت و راستی با هم ملاقات کرده‌اند. عدالت و سلامتی یکدیگر را بوسیده‌اند. "},
	{11, "11  راستی از زمین خواهد رویید و عدالت از آسمان خواهد نگریست. "},
	{12, "12  خداوند نیز چیزهای نیکو را خواهد بخشید و زمین ما محصول خود را خواهد داد. "},
	{13, "13  عدالت پیش روی او خواهد خرامید و آثار خود را طریقی خواهد ساخت. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view86() {
struct fa86 poems[] = {
	{1, "1  [دعای داود] ای خداوند گوش خود را فراگرفته، مرا مستجاب فرما زیرا مسکین و نیازمند هستم! "},
	{2, "2  جان مرا نگاه دار زیرا من متقّی هستم. ای خدای من، بندهٔٔ خود را که بر تو توکّل دارد، نجات بده. "},
	{3, "3  ای خداوند بر من کرم فرما زیرا که تمامیِ روز تو را می‌خوانم! "},
	{4, "4  جان بندهٔٔ خود را شادمان گردان زیرا ای خداوند جان خود را نزد تو برمی‌دارم. "},
	{5, "5  زیرا تو ای خداوند، نیکو و غفار هستی و بسیار رحیم برای آنانی که تو را می‌خوانند. "},
	{6, "6  ای خداوند دعای مرا اجابت فرما و به آواز تضّرع من توجه نما! "},
	{7, "7  در روز تنگی خود تو را خواهم خواند زیرا که مرا مستجاب خواهی فرمود. "},
	{8, "8  ای خداوند در میان خدایان مثل تو نیست و کاری مثل کارهای تو نی. "},
	{9, "9  ای خداوند همهٔٔ امّت‌هایی که آفریده‌ای آمده، به حضور تو سجده خواهند کرد و نام تو را تمجید خواهند نمود. "},
	{10, "10  زیرا که تو بزرگ هستی و کارهای عجیب می‌کنی. تو تنها خدا هستی. "},
	{11, "11  ای خداوند طریق خود را به من بیاموز تا در راستی تو سالک شوم. دل مرا واحد ساز تا از نام تو ترسان باشم. "},
	{12, "12  ای خداوند خدای من، تو را به تمامی دِل حمد خواهم گفت و نام تو را تمجید خواهم کرد تا ابدالآباد. "},
	{13, "13  زیرا که رحمت تو به من عظیم است و جان مرا از هاویهٔ اسفل رهانیده‌ای. "},
	{14, "14  ای خدا متکبّران بر من برخاستهاند و گروهی از ظالمان قصد جان من دارند و تو را در مد نظر خود نمی‌آورند. "},
	{15, "15  و تو ای خداوند خدای رحیم و کریم هستی. دیر غضب و پُر از رحمت و راستی. "},
	{16, "16  بسوی من التفات کن و بر من کرم فرما. قوّت خود را به بنده‌ات بده و پسر کنیز خود را نجات‌بخش. "},
	{17, "17  علامت خوبی را به من بنما تا آنانی که از من نفرت دارند آن را دیده، خجل شوند زیرا که تو ای خداوند مرا اعانت کرده و تسلّی داده‌ای. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view87() {
struct fa87 poems[] = {
	{1, "1  [مزمور و سرود بنیقورح] اساس او در کوه‌های مقدّس است "},
	{2, "2  .2 خداوند دروازه‌های صهیون را دوست می‌دارد، بیشتر از جمیع مسکنهای یعقوب. "},
	{3, "3  سخنهای مجید دربارهٔٔ تو گفته می‌شود، ای شهر خدا! سِلاه. "},
	{4, "4  رَهَبْ و بابل را از شناسندگان خود ذکر خواهم کرد. اینک، فلسطین و صور و حبش، این در آنجا متولد شده است. "},
	{5, "5  و دربارهٔٔ صهیون گفته خواهد شد که این و آن در آن متولد شده‌اند. و خود حضرت اعلی آن را استوارخواهد نمود. "},
	{6, "6  خداوند چون امّت‌ها را می‌نویسد، ثبت خواهد کرد که این در آنجا متولد شده است، سِلاه. "},
	{7, "7  مغنیان و رقصکنندگان نیز. جمیع چشمه‌های من در تو است. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view88() {
struct fa88 poems[] = {
	{1, "1  [سرود و مزمور بنیقورح برای سالار مغنیان بر مَحْلَتْ لَعَّنوتْ. قصیدهٔ هیمانِ اَزْراحی] ای یَهُوَه خدای نجات من، شب و روز نزد تو فریاد کرده‌ام. "},
	{2, "2  دعای من به حضور تو برسد، به نالهٔ من گوش خود را فراگیر. "},
	{3, "3  زیرا که جان من از بلایا پر شده است و زندگانیام به قبر نزدیک گردیده. "},
	{4, "4  از فروروندگان به هاویه شمرده شده‌ام و مثل مرد بیقوّت گشته‌ام. "},
	{5, "5  در میان مردگان منفرد شده، مثل کُشتگان که در قبر خوابیده‌اند، که ایشان را دیگر به یاد نخواهی آورد و از دست تو منقطع شده‌اند. "},
	{6, "6  مرا در هاویهٔ اسفل گذاشته‌ای، در ظلمت در ژرفیها. "},
	{7, "7  خشم تو بر من سنگین شده است و به همهٔٔ امواج خود مرا مبتلا ساخته‌ای، سِلاه. "},
	{8, "8  آشنایانم را از من دور کرده، و مرا مکروه ایشان گردانیده‌ای. محبوس شده، بیرون نمی‌توانم آمد. "},
	{9, "9  چشمانم از مذلت کاهیده شد. ای خداوند، نزد تو فریاد کرده‌ام تمامیِ روز. دستهای خود را به تو دراز کرده‌ام. "},
	{10, "10  آیا برای مردگان کاری عجیب خواهی کرد؟ مگر مردگان برخاسته، تو را حمد خواهند گفت؟ سلاه. "},
	{11, "11  آیا رحمت تو در قبر مذکور خواهد شد؟ و امانت تو در هلاکت؟ "},
	{12, "12  آیا کار عجیب تو در ظلمت اعلام می‌شود و عدالت تو در زمین فراموشی؟ "},
	{13, "13  و امّا من نزد تو ای خداوند فریاد برآورده‌ام و بامدادان دعای من در پیش تومی‌آید. "},
	{14, "14  ای خداوند چرا جان مرا ترک کرده، و روی خود را از من پنهان نموده‌ای. "},
	{15, "15  من مستمند و از طفولیت مشرف بر موت شده‌ام. ترسهای تو را متحّمل شده، متحیر گردیده‌ام. "},
	{16, "16  حدّت خشم تو بر من گذشته است و خوفهای تو مرا هلاک ساخته. "},
	{17, "17  مثل آب دور مرا گرفته است تمامیِ روز و مرا از هر سو احاطه نموده. "},
	{18, "18  یاران و دوستان را از من دور کرده‌ای و آشنایانم را در تاریکی. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view89() {
struct fa89 poems[] = {
	{1, "1  [قصیدهٔ ایتانِ ازراحی] رحمتهای خداوند را تا به ابد خواهم سرایید. امانت تو را به دهان خود نسلاً بعد نسل اعلام خواهم کرد. "},
	{2, "2  زیرا گفتم رحمت بنا خواهد شد تا ابدالآباد و امانت خویش را در افلاک پایدار خواهی ساخت. "},
	{3, "3  با برگزیدهٔ خود عهد بستهام. برای بندهٔ خویش داود قسم خورده‌ام. "},
	{4, "4  که ذریّت تو را پایدار خواهم ساخت تا ابدالآباد و تخت تو را نسلاً بعد نسل بنا خواهم نمود، سلاه. "},
	{5, "5  و آسمانها کارهای عجیب تو را ای خداوند تمجید خواهند کرد و امانت تو را در جماعت مقدّسان. "},
	{6, "6  زیرا کیست در آسمانها که با خداوند برابری تواند کرد؟ و از فرزندان زورآوران کِه را با خداوند تشبیه توان نمود؟ "},
	{7, "7  خدا بی‌نهایت مهیب است در جماعت مقدّسان و ترسناک است بر آنانی که گرداگرد او هستند. "},
	{8, "8  ای یهوه خدای لشکرها کیست ای یاه قدیر مانند تو؟ و امانت تو،تو را احاطه می‌کند. "},
	{9, "9  بر تکبر دریا تو مسلط هستی. چون امواجش بلند می‌شود، آنها را ساکن می‌گردانی. "},
	{10, "10  رهب را مثل کشته شده خرد شکستهای. به بازوی زورآور خویش دشمنانت را پراکنده نموده‌ای. "},
	{11, "11  آسمان از آن تو است و زمین نیز از آن تو. ربع مسکون و پری آن را تو بنیاد نهاده‌ای. "},
	{12, "12  شمال و جنوب را تو آفریده‌ای. تابور و حرمون به نام تو شادی می‌کنند. "},
	{13, "13  بازوی تو با قوّت است. دست تو زورآور است و دست راست تو متعال. "},
	{14, "14  عدالت و انصاف اساس تخت تو است. رحمت و راستی پیش روی تو می‌خرامند. "},
	{15, "15  خوشابحال قومی که آواز شادمانی را می‌دانند. در نور روی تو ای خداوند خواهند خرامید. "},
	{16, "16  در نام تو شادمان خواهند شد تمامیِ روز و در عدالت تو سرافراشته خواهند گردید. "},
	{17, "17  زیرا که فخر قوّت ایشان تو هستی و به رضامندیِ تو شاخ ما مرتفع خواهد شد. "},
	{18, "18  زیرا که سپر ما از آن خداوند است و پادشاه ما از آن قدوس اسرائیل. "},
	{19, "19  آنگاه در عالم رؤیا به مقدّس خود خطاب کرده، گفتی که نصرت را بر مردی زورآور نهادم و برگزیده‌ای از قوم را ممتاز کردم. "},
	{20, "20  بندهٔ خود داود را یافتم و او را به روغن مقدّس خود مسح کردم. "},
	{21, "21  که دست من با او استوار خواهد شد. بازوی من نیز او را قوی خواهد گردانید. "},
	{22, "22  دشمنی بر او ستم نخواهد کرد و هیچ پسر ظلم بدو اذیت نخواهد رسانید. "},
	{23, "23  و خصمان او را پیش روی وی خواهم گرفت و آنانی را که از او نفرت دارند مبتلا خواهم گردانید. "},
	{24, "24  و امانت ورحمت من با وی خواهد بود و در نام من شاخ او مرتفع خواهد شد. "},
	{25, "25  دست او را بر دریا مستولی خواهم ساخت و دست راست او را بر نهرها. "},
	{26, "26  او مرا خواهد خواند که تو پدر من هستی، خدای من و صخرهٔ نجات من. "},
	{27, "27  من نیز او را نخست‌زاده خود خواهم ساخت، بلندتر از پادشاهان جهان. "},
	{28, "28  رحمت خویش را برای وی نگاه خواهم داشت تا ابدالآباد و عهد من با او استوار خواهد بود. "},
	{29, "29  و ذریّت وی را باقی خواهم داشت تا ابدالآباد و تخت او را مثل روزهای آسمان. "},
	{30, "30  اگر فرزندانش شریعت مرا ترک کنند، و در احکام من سلوک ننمایند، "},
	{31, "31  اگر فرایض مرا بشکنند، و اوامر مرا نگاه ندارند، "},
	{32, "32  آنگاه معصیت ایشان را به عصا تأدیب خواهم نمود و گناه ایشان را به تازیانه‌ها. "},
	{33, "33  لیکن رحمت خود را از او برنخواهم داشت و امانت خویش را باطل نخواهم ساخت. "},
	{34, "34  عهد خود را نخواهم شکست و آنچه را از دهانم صادر شد تغییر نخواهم داد. "},
	{35, "35  یک چیز را به قدوسیت خود قسم خوردم و به داود هرگز دروغ نخواهم گفت. "},
	{36, "36  که ذریّت او باقی خواهد بود تا ابدالآباد و تخت او به حضور من مثل آفتاب، "},
	{37, "37  مثل ماه ثابت خواهد بود تا ابدالآباد و مثل شاهد امین در آسمان، سلاه. "},
	{38, "38  لیکن تو ترک کرده‌ای و دور انداخته‌ای و با مسیح خود غضبناک شده‌ای. "},
	{39, "39  عهد بندهٔ خود را باطل ساخته‌ای و تاج او را بر زمین انداخته، بیعصمت کرده‌ای. "},
	{40, "40  جمیع حصارهایش را شکسته و قلعه‌های او را خراب نموده‌ای. "},
	{41, "41  همهٔ راه گذران او را تاراج می‌کنند و او نزد همسایگانخود عار گردیده است. "},
	{42, "42  دست راست خصمان او را برافراشته، و همهٔ دشمنانش را مسرور ساخته‌ای. "},
	{43, "43  دم شمشیر او را نیز برگردانیده‌ای و او را در جنگ پایدار نساخته‌ای. "},
	{44, "44  جلال او را باطل ساخته و تخت او را به زمین انداخته‌ای. "},
	{45, "45  ایام شبابش را کوتاه کرده، و او را به خجالت پوشانیده‌ای، سلاه. "},
	{46, "46  تا به کی ای خداوند خود را تا به ابد پنهان خواهی کرد و غضب تو مثل آتش افروخته خواهد شد؟ "},
	{47, "47  به یاد آور که ایام حیاتم چه کم است. چرا تمامیِ بنی‌آدم را برای بطالت آفریده‌ای؟ "},
	{48, "48  کدام آدمی زنده است که موت را نخواهد دید؟ و جان خویش را از دست قبر خلاص خواهد ساخت؟ سلاه. "},
	{49, "49  ای خداوند رحمتهای قدیم تو کجاست که برای داود به امانت خود قسم خوردی؟ "},
	{50, "50  ای خداوند ملامت بندهٔ خود را به یاد آور که آن را از قومهای بسیار در سینه خود متحمل می‌باشم. "},
	{51, "51  که دشمنان تو ای خداوند ملامت کرده‌اند، یعنی آثار مسیح تو را ملامت نموده‌اند. "},
	{52, "52  خداوند متبارک باد تا ابدالآباد. آمین و آمین. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view90() {
struct fa90 poems[] = {
	{1, "1  [دعای موسی مرد خدا] ای خداوند مسکن ما تو بوده‌ای، در جمیع نسلها، "},
	{2, "2  قبل از آنکه کوه‌ها به وجود آید و زمین و ربع مسکون را بیافرینی. از ازل تا به ابد تو خدا هستی. "},
	{3, "3  انسان را به غباربرمی‌گردانی، و می‌گویی ای بنی‌آدم رجوع نمایید. "},
	{4, "4  زیرا که هزار سال در نظر تو مثل دیروز است که گذشته باشد و مثل پاسی از شب. "},
	{5, "5  مثل سیلاب ایشان را رُفتْهای و مثل خواب شده‌اند. بامدادان مثل گیاهی که می‌روید. "},
	{6, "6  بامدادان می‌شکُفَدْ و می‌روید. شامگاهان بریده و پژمرده می‌شود. "},
	{7, "7  زیرا که در غضب تو کاهیده می‌شویم و در خشم تو پریشان می‌گردیم. "},
	{8, "8  چونکه گناهان ما را در نظر خود گذارده‌ای و خفایای ما را در نور روی خویش. "},
	{9, "9  زیرا که تمام روزهای ما در خشم تو سپری شد و سالهای خود را مثل خیالی بسر برده‌ایم. "},
	{10, "10  ایّام عمر ما هفتاد سال است و اگر از بُنیه، هشتاد سال باشد. لیکن فخر آنها محنت و بطالت است زیرا به زودی تمام شده، پرواز می‌کنیم. "},
	{11, "11  کیست که شدت خشم تو را می‌داند و غضب تو را چنانکه از تو می‌باید ترسید؟ "},
	{12, "12  ما را تعلیم ده تا ایام خود را بشماریم تا دل خردمندی را حاصل نماییم. "},
	{13, "13  رجوع کن ای خداوند ! تا به کی؟ و بر بندگان خود شفقت فرما. "},
	{14, "14  صبحگاهان ما را از رحمت خود سیر کن تا تمامیِ عمر خود ترنم و شادی نماییم. "},
	{15, "15  ما را شادمان گردان به عوض ایّامی که ما را مبتلا ساختی و سالهایی که بدی را دیده‌ایم. "},
	{16, "16  اعمال تو بر بندگانت ظاهر بشود و کبریایی تو بر فرزندان ایشان. "},
	{17, "17  جمال خداوند خدای ما بر ما باد و عمل دستهای ما را بر ما استوار ساز! عمل دستهای ما را استوار گردان! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view91() {
struct fa91 poems[] = {
	{1, "1  آنکه در ستر حضرت اعلی نشستهاست، زیر سایهٔ قادرمطلق ساکن خواهد بود. "},
	{2, "2  دربارهٔ خداوند می‌گویم که او ملجا و قلعه من است و خدای من که بر او توکّل دارم. "},
	{3, "3  زیرا که او تو را از دام صیاد خواهد رهانید و از وبای خبیث. "},
	{4, "4  به پرهای خود تو را خواهد پوشانید و زیر بالهایش پناه خواهی گرفت. راستیِ او تو را مِجَّن و سپر خواهد بود. "},
	{5, "5  از خوفی در شب نخواهی ترسید و نه از تیری که در روز می‌پرد. "},
	{6, "6  و نه از وبایی که در تاریکی می‌خرامد و نه از طاعونی که وقت ظهر فساد می‌کند. "},
	{7, "7  هزار نفر به جانب تو خواهند افتاد و ده‌هزار به دست راست تو. لیکن نزد تو نخواهد رسید. "},
	{8, "8  فقط به چشمان خود خواهی نگریست و پاداش شریران را خواهی دید. "},
	{9, "9  زیرا گفتی تو ای خداوند ملجای من هستی و حضرت اعلی را مأوای خویش گردانیده‌ای. "},
	{10, "10  هیچ بدی بر تو واقع نخواهد شد و بلایی نزد خیمهٔ تو نخواهد رسید. "},
	{11, "11  زیرا که فرشتگان خود را دربارهٔٔ تو امر خواهد فرمود تا در تمامیِ راه‌هایت تو را حفظ نمایند. "},
	{12, "12  تو را بر دستهای خود برخواهند داشت، مبادا پای خود را به سنگ بزنی. "},
	{13, "13  بر شیر و افعی پای خواهی نهاد؛ شیربچه و اژدها را پایمال خواهی کرد. "},
	{14, "14  چونکه به من رغبت دارد او را خواهم رهانید و چونکه به اسم من عارف است او را سرافراز خواهم ساخت. "},
	{15, "15  چون مرا خواند او را اجابت خواهم کرد. من در تنگی با او خواهم بود واو را نجات داده، مُعَزَّز خواهم ساخت. "},
	{16, "16  به طول ایام او را سیر می‌گردانم و نجات خویش را بدو نشان خواهم داد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view92() {
struct fa92 poems[] = {
	{1, "1  [مزمور و سرود برای روز سَبَّت] خداوند را حمد گفتن نیکو است و به نام تو تسبیح خواندن، ای حضرت اعلیٰ. "},
	{2, "2  بامدادان رحمت تو را اعلام نمودن و در هر شب امانت تو را. "},
	{3, "3  بر ذات ده اوتار و بر رباب و به نغمه هجایون و بربط. "},
	{4, "4  زیرا که ای خداوند مرا به کارهای خودت شادمان ساخته‌ای. به‌سبب اعمال دستهای تو ترنم خواهم نمود. "},
	{5, "5  ای خداوند اعمال تو چه عظیم است و فکرهای تو بی‌نهایت عمیق. "},
	{6, "6  مرد وحشی این را نمی‌داند و جاهل در این تأمل نمی‌کند. "},
	{7, "7  وقتی که شریران مثل علف می‌رویند و جمیع بدکاران می‌شکفند، برای این است که تا به ابد هلاک گردند. "},
	{8, "8  لیکن تو ای خداوند بر اعلیٰ علیین هستی، تا ابدالآباد. "},
	{9, "9  زیرا اینک، دشمنان تو ای خداوند، هان دشمنان تو هلاک خواهند شد و جمیع بدکاران پراکنده خواهند شد. "},
	{10, "10  و امّا شاخ مرا مثل شاخ گاو وحشی بلند کرده‌ای و به روغن تازه مسح شده‌ام. "},
	{11, "11  و چشم من بر دشمنانم خواهد نگریست و گوشهای من از شریرانی که با من مقاومت می‌کنند خواهد شنید. "},
	{12, "12  عادل مثل درخت خرما خواهد شکفت و مثل سرو آزاد در لبنان نمو خواهد کرد. "},
	{13, "13  آنانی که در خانهٔ خداوند غرس شده‌اند، در صحنهای خدای ما خواهند شکفت. "},
	{14, "14  در وقت پیری نیز میوه خواهند آورد و تر و تازه و سبز خواهند بود. "},
	{15, "15  تا اعلام کنند که خداوند راست است. اوصخره من است و در وی هیچ بی‌انصافی نیست. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view93() {
struct fa93 poems[] = {
	{1, "1  خداوند سلطنت را گرفته و خود را بهجلال آراسته است. خداوند خود را آراسته و کمر خود را به قوّت بسته است. ربع مسکون نیز پایدار گردیده است و جنبش نخواهد خورد. "},
	{2, "2  تخت تو از ازل پایدار شده است و تو از قدیم هستی. "},
	{3, "3  ای خداوند سیلابها برافراشتهاند سیلابها آواز خود را برافراشتهاند. سیلابها خروش خود را برافراشتهاند. "},
	{4, "4  فوق آواز آبهای بسیار، فوق امواج زورآور دریا. خداوند در اعلی اعلیین زورآورتر است. "},
	{5, "5  شهادات تو بی‌نهایت امین است. ای خداوند، قدوسیّتْ خانهٔ تو را میزیبد تا ابدالآباد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view94() {
struct fa94 poems[] = {
	{1, "1  ای یَهُوَه خدای ذوالانتقام، ای خدای ذوالانتقام، تجلّی فرما! "},
	{2, "2  ای داور جهان متعال شو و بر متکبّران مکافات برسان! "},
	{3, "3  ای خداوند تا به کی شریران، تا به کی شریران فخر خواهند نمود؟ "},
	{4, "4  حرفها می‌زنند و سخنان ستمآمیز می‌گویند. جمیع بدکاران لاف می‌زنند. "},
	{5, "5  ای خداوند، قوم تو را می‌شکنند و میراث تو را ذلیل می‌سازند. "},
	{6, "6  بیوه زنان و غریبان را می‌کشند و یتیمان را به قتل می‌رسانند "},
	{7, "7  و می‌گویند یاه نمی‌بیند و خدای یعقوب ملاحظه نمی‌نماید. "},
	{8, "8  ای احمقان قوم بفهمید! و ای ابلهان کی تعقل خواهید نمود؟ "},
	{9, "9  او که گوش را غرس نمود، آیا نمی‌شنود؟ او که چشم را ساخت، آیا نمی‌بیند؟ "},
	{10, "10  او که امّت‌ها را تأدیب می‌کند، آیاتوبیخ نخواهد نمود، او که معرفت را به انسان می‌آموزد؟ "},
	{11, "11  خداوند فکرهای انسان را می‌داند که محض بطالت است. "},
	{12, "12  ای یاه، خوشابحال شخصی که او را تأدیب می‌نمایی و از شریعت خود او را تعلیم می‌دهی "},
	{13, "13  تا او را از روزهای بلا راحت بخشی، مادامی که حفره برای شریران کنده شود. "},
	{14, "14  زیرا خداوند قوم خود را رد نخواهد کرد و میراث خویش را ترک نخواهد نمود. "},
	{15, "15  زیرا که داوری به انصاف رجوع خواهد کرد و همهٔ راست دلان پیروی آن را خواهند نمود. "},
	{16, "16  کیست که برای من با شریران مقاومت خواهد کرد و کیست که با بدکاران مقابله خواهد نمود. "},
	{17, "17  اگر خداوند مددکار من نمی‌بود، جان من به زودی در خاموشی ساکن می‌شد. "},
	{18, "18  چون گفتم که پای من می‌لغزد، پس رحمت تو ای خداوند مرا تأیید نمود. "},
	{19, "19  در کثرت اندیشه‌های دل من، تسلیهای تو جانم را آسایش بخشید. "},
	{20, "20  آیا کرسی شرارت با تو رفاقت تواند نمود، که فساد را به قانون اختراع می‌کند؟ "},
	{21, "21  بر جان مرد صَدیق با هم جمع می‌شوند و بر خون بی‌گناه فتوا می‌دهند. "},
	{22, "22  لیکن خداوند برای من قلعه بلند است و خدایم صخره ملجای من است. "},
	{23, "23  و گناه ایشان را بر ایشان راجع خواهد کرد و ایشان را در شرارت ایشان فانی خواهد ساخت. یَهوه خدای ما ایشان را فانی خواهد نمود. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view95() {
struct fa95 poems[] = {
	{1, "1  بیایید خداوند را بسراییم و صخره نجات خود را آواز شادمانی دهیم! "},
	{2, "2  به حضور او با حمد نزدیک بشویم! و با مزامیر او را آواز شادمانی دهیم! "},
	{3, "3  زیرا که یهوه، خدای بزرگ است، "},
	{4, "4  و پادشاه عظیم بر جمیع خدایان. نشیبهای زمین در دست وی است و فرازهای کوه‌ها از آن او. "},
	{5, "5  دریا از آن اوست، او آن را بساخت؛ و دستهای وی خشکی را مصور نمود. "},
	{6, "6  بیایید عبادت و سجده نماییم و به حضور آفریننده خود خداوند زانو زنیم! "},
	{7, "7  زیرا که او خدای ما است! و ما قوم مرتع و گلهٔ دست او می‌باشیم! امروز کاش آواز او را می‌شنیدید! "},
	{8, "8  دل خود را سخت مسازید، مثل مریبا، مانند یوم مسّا در صحرا. "},
	{9, "9  چون اجداد شما مرا آزمودند و تجربه کردند و اعمال مرا دیدند. "},
	{10, "10  چهل سال از آن قوم محزون بودم و گفتم قوم گمراه دل هستند که طُرُق مرا نشناختند. "},
	{11, "11  پس در غضب خود قسم خوردم، که به آرامیِ من داخل نخواهند شد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view96() {
struct fa96 poems[] = {
	{1, "1  زمین خداوند را بسرایید! "},
	{2, "2  خداوند را بسرایید و نام او را متبارک خوانید! روز به روز نجات او را اعلام نمایید. "},
	{3, "3  در میان امّت‌ها جلال او را ذکر کنید و کارهای عجیب او را در جمیع قومها. "},
	{4, "4  زیرا خداوند عظیم است و بی‌نهایت حمید. و او مهیب است بر جمیع خدایان. "},
	{5, "5  زیراجمیع خدایانِ امّت‌ها بتهایند، لیکن یهوه آسمانها را آفرید. "},
	{6, "6  مجد و جلال به حضور وی است و قوّت و جمال در قدس وی. "},
	{7, "7  ای قبایل قوم ها خداوند را توصیف نمایید! خداوند را به جلال و قوّت توصیف نمایید! "},
	{8, "8  خداوند را به جلال اسم او توصیف نمایید! هدیه بیاورید و به صحنهای او بیایید! "},
	{9, "9  خداوند را در زینت قدوسیّت بپرستید! ای تمامی زمین از حضور وی بلرزید! "},
	{10, "10  در میان امّت‌ها گویید خداوند سلطنت گرفته است. ربع مسکون نیز پایدار شد و جنبش نخواهد خورد. قومها را به انصاف داوری خواهد نمود. "},
	{11, "11  آسمان شادی کند و زمین مسرور گردد. دریا و پری آن غرش نماید. "},
	{12, "12  صحرا و هر چه در آن است، به وجد آید. آنگاه تمام درختان جنگل ترنم خواهند نمود "},
	{13, "13  به حضور خداوند زیرا که می‌آید، زیرا که برای داوری جهان می‌آید. ربع مسکون را به انصاف داوری خواهد کرد و قومها را به امانت خود. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view97() {
struct fa97 poems[] = {
	{1, "1  خداوند سلطنت گرفته است، پس زمینشادی کند و جزیره‌های بسیار مسرور گردند. "},
	{2, "2  ابرها و ظلمتِ غلیظ گرداگرد اوست. عدل و انصاف قاعده تخت اوست. "},
	{3, "3  آتش پیش روی وی می‌رود و دشمنانِ او را به اطرافش می‌سوزاند. "},
	{4, "4  برقهایش ربع مسکون را روشن می‌سازد. زمین این را بدید و بلرزید. "},
	{5, "5  کوه‌ها از حضور خداوند مثل موم گداخته می‌شود، از حضور خداوند تمامی جهان. "},
	{6, "6  آسمانها عدالتاو را اعلام می‌کنند و جمیع قومها جلال او را می‌بینند. "},
	{7, "7  همهٔ پرستندگان بتهای تراشیده خجل می‌شوند که به بتها فخر می‌نمایند. ای جمیع خدایان او را بپرستید. "},
	{8, "8  صهیون شنید و شادمان شد و دختران یهودا مسرور گردیدند، ای خداوند به‌سبب داوریهای تو. "},
	{9, "9  زیرا که تو ای خداوند بر تمامی روی زمین متعال هستی. بر جمیع خدایان، بسیار اعلیٰ هستی. "},
	{10, "10  ای شما که خداوند را دوست می‌دارید، از بدی نفرت کنید! او حافظ جانهای مقدّسان خود است. ایشان را از دست شریران می‌رهاند. "},
	{11, "11  نور برای عادلان کاشته شده است و شادمانی برای راست‌دلان. "},
	{12, "12  ای عادلان، در خداوند شادمان باشید! و ذکر قدّوسیّت او را حمد بگویید. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view98() {
struct fa98 poems[] = {
	{1, "1  [مزمور] برای خداوند سرود تازه بسرایید زیرا کارهای عجیب کرده است. دست راست و بازوی قدّوس او، او را مظّفر ساخته است. "},
	{2, "2  خداوند نجات خود را اعلام نموده، و عدالتش را به نظر امّت‌ها مکشوف کرده است. "},
	{3, "3  رحمت و امانت خود را با خاندان اسرائیل به یاد آورد. همهٔ اقصای زمین نجات خدای ما را دیده‌اند. "},
	{4, "4  ای تمامی زمین، خداوند را آواز شادمانی دهید. بانگ زنید و ترنّم نمایید و بسرایید. "},
	{5, "5  خداوند را با بربط بسرایید! با بربط و با آواز نغمات! "},
	{6, "6  با کَرِنّاها و آواز سرنا! به حضور یهوهپادشاه آواز شادمانی دهید! "},
	{7, "7  دریا و پری آن بخروشد! ربع مسکون و ساکنان آن! "},
	{8, "8  نهرها دستک بزنند! و کوه‌ها با هم ترنّم نمایند. "},
	{9, "9  به حضور خداوند زیرا به داوری جهان می‌آید. ربع مسکون را به انصاف داوری خواهد کرد و قومها را به راستی. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view99() {
struct fa99 poems[] = {
	{1, "1  خداوند سلطنت گرفته است، پس قومها بلرزند! بر کروبییّن جلوس می‌فرماید، زمین متزلزل گردد! "},
	{2, "2  خداوند در صیهون عظیم است و او بر جمیع قومها متعال است! "},
	{3, "3  اسم عظیم و مهیب تو را حمد بگویند، که او قدّوس است. "},
	{4, "4  و قّوت پادشاه، انصاف را دوست می‌دارد. تو راستی را پایدار کرده، و انصاف و عدالت را در یعقوب به عمل آورده‌ای. "},
	{5, "5  یهوه خدای ما را تکریم نمایید و نزد قدمگاه او عبادت کنید، که او قدّوس است. "},
	{6, "6  موسی و هارون از کاهنانش و سموئیل از خوانندگان نام او. یهوه را خواندند و او ایشان را اجابت فرمود. "},
	{7, "7  در ستون ابر بدیشان سخن گفت. شهادات او و فریضهای را که بدیشان داد نگاه داشتند. "},
	{8, "8  ای یهوه خدای ما تو ایشان را اجابت فرمودی. ایشان را خدای غفور بودی. امّا از اعمال ایشان انتقام کشیدی. "},
	{9, "9  یهوه خدای ما را متعال بخوانید و نزد کوه مقدّس او عبادت کنید. زیرا یهوه خدای ما قّدوس است. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view100() {
struct fa100 poems[] = {
	{1, "1  ای تمامی روی زمین خداوند را آواز شادمانی دهید. "},
	{2, "2  خداوند را با شادی عبادت نمایید و به حضور او با ترنّم بیایید. "},
	{3, "3  بدانید که یهوه خداست؛ او ما را آفرید. ما قوم او هستیم و گوسفندان مرتع او. "},
	{4, "4  به دروازه‌های او با حمد بیایید و به صحنهای او با تسبیح! او را حمد گویید و نام او را متبارک خوانید! "},
	{5, "5  زیرا که خداوند نیکوست و رحمت او ابدی و امانت وی تا ابدالآباد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view101() {
struct fa101 poems[] = {
	{1, "1  [مزمور داود] رحمت و انصاف را خواهم سرایید.نزد تو ای خداوند، تسبیح خواهم خواند. "},
	{2, "2  در طریق کامل به خردمندی رفتار خواهم نمود. نزد من کی خواهی آمد؟ در خانهٔ خود با دل سلیم سالک خواهم شد. "},
	{3, "3  چیزی بد را پیش نظر خود نخواهم گذاشت. کار کج روان را مکروه می‌دارم، به من نخواهد چسبید. "},
	{4, "4  دل کج از من دور خواهد شد. شخص شریر را نخواهم شناخت. "},
	{5, "5  کسی را که در خُفیَه به همسایهٔ خود غیبت گوید، هلاک خواهم کرد. کسی را که چشم بلند و دل متکبر دارد تحّمل نخواهم کرد. "},
	{6, "6  چشمانم بر امنای زمین است تا با من ساکن شوند. کسی که به طریق کامل سالک باشد، خادم من خواهد بود. "},
	{7, "7  حیله گر در خانهٔ من ساکن نخواهد شد. دروغگو پیش نظر من نخواهد ماند. "},
	{8, "8  همهٔ شریران زمین را صبحگاهان هلاک خواهم کرد تا جمیع بدکاران را از شهر خداوند منقطع سازم. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view102() {
struct fa102 poems[] = {
	{1, "1  [دعای مسکین وقتی‌که پریشان حال شده، ناله خود را به حضور یهوّه می‌ریزد] ای خداوند دعای مرا بشنو، و فریاد من نزد تو برسد. "},
	{2, "2  در روز تنگیام روی خود را از من مپوشان. گوش خود را به من فراگیر، و روزی که بخوانم مرا به زودی اجابت فرما. "},
	{3, "3  زیرا روزهایم مثل دود تلف شد و استخوانهایم مثل هیزم سوخته گردید. "},
	{4, "4  دل من مثل گیاه زده شده و خشک گردیده است زیرا خوردن غذای خود را فراموش می‌کنم. "},
	{5, "5  به‌سبب آواز ناله خود، استخوانهایم به گوشت من چسبیده است. "},
	{6, "6  مانند مرغ سقّای صحرا شده، و مثل بوم خرابه‌ها گردیده‌ام. "},
	{7, "7  پاسبانی می‌کنم و مثل گنجشک بر پشتبام، منفرد گشته‌ام. "},
	{8, "8  تمامی روز دشمنانم مرا سرزنش می‌کنند و آنانی که بر من دیوانه شده‌اند مرا لعنت می‌نمایند. "},
	{9, "9  زیرا خاکستر را مثل نان خورده‌ام و مشروب خود را با اشک آمیختهام، "},
	{10, "10  به‌سبب غضب و خشم تو زیرا که مرا برافراشته و به زیر افکنده‌ای. "},
	{11, "11  روزهایم مثل سایه زوال پذیر گردیده و من مثل گیاه پژمرده شده‌ام. "},
	{12, "12  لیکن تو ای خداوند جلوس فرموده‌ای تا ابدالآباد! و ذکر تو تا جمیع نسلهاست! "},
	{13, "13  تو برخاسته، بر صهیون ترحم خواهی نمود زیرا وقتی است که بر او رأفت کنی و زمان معّین رسیده‌است. "},
	{14, "14  چونکه بندگان تو در سنگهای وی رغبت دارند و بر خاک او شفقت می‌نمایند. "},
	{15, "15  پس امّت‌ها از نام خداوند خواهند ترسید و جمیع پادشاهان جهان از کبریایی تو. "},
	{16, "16  زیرا خداوند صهیون را بنا نموده، و در جلال خود ظهور فرموده است. "},
	{17, "17  به دعای مسکینان توجه نموده، و دعای ایشان را خوار نشمرده است. "},
	{18, "18  این برای نسل آینده نوشته می‌شود تا قومی که آفریده خواهند شد خداوند را تسبیح بخوانند. "},
	{19, "19  زیرا که از بلندی قدس خود نگریسته، خداوند از آسمان بر زمین نظر افکنده است. "},
	{20, "20  تا ناله اسیران را بشنود و آنانی را که به موت سپرده شده‌اند آزاد نماید. "},
	{21, "21  تا نام خداوند را در صیهون ذکر نمایند و تسبیح او را در اورشلیم، "},
	{22, "22  هنگامی‌که قومها با هم جمع شوند و ممالک نیز تا خداوند را عبادت نمایند. "},
	{23, "23  توانایی مرا در راه ناتوان ساخت و روزهای مرا کوتاه گردانید. "},
	{24, "24  گفتم، ای خدای من مرا در نصف روزهایم برمدار. سالهای تو تا جمیع نسلها است. "},
	{25, "25  از قدیم بنیاد زمین را نهادی و آسمانها عمل دستهای تو است. "},
	{26, "26  آنها فانی می‌شوند، لیکن تو باقی هستی و جمیع آنها مثل جامه مندرس خواهند شد. و مثل ردا آنها را تبدیل خواهی کرد و مبدّل خواهند شد. "},
	{27, "27  لیکن تو همان هستی و سالهای تو تمام نخواهد گردید. "},
	{28, "28  فرزندان بندگانت باقی خواهند ماند و ذرّیت ایشان در حضور تو پایدار خواهند بود. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view103() {
struct fa103 poems[] = {
	{1, "1  [مزمور داود] ای جان من خداوند را متبارک بخوان! و هرچه در درون من است نام قدّوس او را متبارک خواند. "},
	{2, "2  ای جان من خداوند را متبارک بخوان و جمیع احسانهای او را فراموش مکن! "},
	{3, "3  که تمام گناهانت را می‌آمرزد و همهٔ مرضهای تو را شفا می‌بخشد؛ "},
	{4, "4  که حیات تو را از هاویه فدیه می‌دهد و تاج رحمت و رأفت را بر سر تو می‌نهد؛ "},
	{5, "5  که جان تو را به چیزهای نیکو سیر می‌کند تا جوانی تو مثل عقاب تازه شود. "},
	{6, "6  خداوند عدالت را به جا می‌آورد و انصاف را برای جمیع مظلومان. "},
	{7, "7  طریق‌های خویش را به موسی تعلیم داد و عملهای خود را به بنی‌اسرائیل. "},
	{8, "8  خداوند رحمان و کریم است؛ دیر غضب و بسیار رحیم. "},
	{9, "9  تا به ابد محاکمه نخواهد نمود و خشم را همیشه نگاه نخواهد داشت. "},
	{10, "10  با ما موافق گناهان ما عمل ننموده، و به ما به حسب خطایای ما جزا نداده است. "},
	{11, "11  زیرا آنقدر که آسمان از زمین بلندتر است، به همان قدر رحمت او بر ترسندگانش عظیم است. "},
	{12, "12  به اندازه‌ای که مشرق از مغرب دور است، به همان اندازه گناهان ما را از ما دور کرده است. "},
	{13, "13  چنانکه پدر بر فرزندان خود رئوف است، همچنان خداوند بر ترسندگان خود رأفت می‌نماید. "},
	{14, "14  زیرا جبلّت ما را می‌داند و یاد می‌دارد که ما خاک هستیم. "},
	{15, "15  و امّا انسان، ایّام او مثل گیاه است، مثل گل صحرا همچنان می‌شکفد. "},
	{16, "16  زیرا که باد بر آن میوزد و نابود می‌گردد و مکانش دیگر آن را نمی‌شناسد. "},
	{17, "17  لیکن رحمت خداوند بر ترسندگانش از ازل تا ابدالآباد است و عدالت او بر فرزندانِ فرزندان. "},
	{18, "18  بر آنانی که عهد او را حفظ می‌کنند و فرایض او را یاد می‌دارند تا آنها را به جا آورند. "},
	{19, "19  خداوند تخت خود را بر آسمانها استوار نموده، و سلطنت او بر همه مسلّط است. "},
	{20, "20  خداوند را متبارک خوانید، ای فرشتگان او که در قوّت زورآورید و کلام او را به جا می‌آورید و آواز کلام او را گوش می‌گیرید! "},
	{21, "21  ای جمیع لشکرهای او خداوند را متبارک خوانید! و ای خادمان او که ارادهٔ او را بجا می‌آورید! "},
	{22, "22  ای همهٔ کارهای خداوند او را متبارک خوانید! در همهٔ مکانهای سلطنت او. ای جان من خداوند را متبارک بخوان! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view104() {
struct fa104 poems[] = {
	{1, "1  ای جان من، خداوند را متبارکبخوان! ای یهوه خدای من تو بی‌نهایت عظیم هستی! به عزّت و جلال ملبّس هستی. "},
	{2, "2  خویشتن را به نور مثل ردا پوشانیده‌ای. آسمانها را مثل پرده پهن ساخته‌ای. "},
	{3, "3  آن که غرفات خود را بر آبها بنا کرده است و ابرها را مرکب خود نموده و بر بالهای باد می‌خرامد؛ "},
	{4, "4  فرشتگان خود را بادها می‌گرداند و خادمان خود را آتش مشتعل؛ "},
	{5, "5  که زمین را بر اساسش استوار کرده، تا جنبش نخورد تا ابدالآباد. "},
	{6, "6  آن را به لجّه‌ها مثل ردا پوشانیده‌ای، که آبها بر کوه‌ها ایستاده‌اند. "},
	{7, "7  از عتاب تو می‌گریزند. از آواز رعد تو پراکنده می‌شوند. "},
	{8, "8  به فراز کوه‌ها برمی‌آیند، و به همواریها فرود می‌آیند، به مکانی که برای آنهامهیّا ساخته‌ای. "},
	{9, "9  حدی برای آنها قرار داده‌ای که از آن نگذرند و برنگردند تا زمین را بپوشانند. "},
	{10, "10  که چشمه‌ها را در وادیها جاری می‌سازد تا در میان کوه‌ها روان بشوند. "},
	{11, "11  تمام حیوانات صحرا را سیراب می‌سازند تا گورخران تشنگی خود را فرو نشانند. "},
	{12, "12  بر آنها مرغان هوا ساکن می‌شوند و از میان شاخه‌ها آواز خود را می‌دهند. "},
	{13, "13  او از غرفات خود کوه‌ها را سیراب می‌کند و از ثمرات اعمال تو زمین سیر می‌شود. "},
	{14, "14  نباتات را برای بهایم می‌رویاند و سبزه‌ها را برای خدمت انسان، و نان را از زمین بیرون می‌آورد، "},
	{15, "15  و شراب را که دل انسان را شادمان می‌کند، و چهره او را به روغن شاداب می‌سازد؛ و دل انسان را به نان قوی می‌گرداند. "},
	{16, "16  درختان خداوند شادابند، یعنی سروهای آزاد لبنان که غرس کرده است، "},
	{17, "17  که در آنها مرغان آشیانهای خود را می‌گیرند و امّا صنوبر خانهٔ لقلق می‌باشد. "},
	{18, "18  کوه‌های بلند برای بزهای کوهی و صخره‌ها برای یربوع ملجاء است. "},
	{19, "19  ماه را برای موسمها ساخت و آفتاب مغرب خود را می‌داند. "},
	{20, "20  تاریکی می‌سازی و شب می‌شود که در آن همهٔ حیوانات جنگلی راه می‌روند. "},
	{21, "21  شیر بچگان برای شکار خود غرّش می‌کنند و خوراک خویش را از خدا می‌جویند. "},
	{22, "22  چون آفتاب طلوع می‌کند جمع می‌شوند و در بیشه‌های خود می‌خوابند. "},
	{23, "23  انسان برای عمل خود بیرون می‌آید و بجهت شغل خویش تا شامگاه. "},
	{24, "24  ای خداوند اعمال تو چه بسیار است! جمیع آنها را به حکمت کرده‌ای. زمین از دولت تو پر است. "},
	{25, "25  و آن دریای بزرگ و وسیعالاطراف نیز که در آن حشرات از حدّ شماره زیاده‌اند و حیوانات خرد و بزرگ. "},
	{26, "26  و در آن کشتیها راه می‌روند و آن لویاتان که بجهت بازی کردن در آن آفریده‌ای. "},
	{27, "27  جمیع اینها از تو انتظار می‌کشند تا خوراک آنها را در وقتش برسانی. "},
	{28, "28  آنچه را که به آنها می‌دهی، فرا می‌گیرند. دست خود را باز می‌کنی، پس از چیزهای نیکو سیر می‌شوند. "},
	{29, "29  روی خود را می‌پوشانی، پس مضطرب می‌گردند. روح آنها را قبض می‌کنی، پس میمیرند و به خاک خود برمی‌گردند. "},
	{30, "30  چون روح خود را می‌فرستی، آفریده می‌شوند و روی زمین را تازه می‌گردانی. "},
	{31, "31  جلال خداوند تا ابدالآباد است. خداوند از اعمال خود راضی خواهد بود. "},
	{32, "32  که به زمین نگاه می‌کند و آن می‌لرزد. کوه‌ها را لمس می‌کند، پس آتشفشان می‌شوند. "},
	{33, "33  خداوند را خواهم سرایید تا زنده می‌باشم. برای خدای خود تسبیح خواهم خواند تا وجود دارم. "},
	{34, "34  تفکّر من او را لذیذ بشود و من در خداوند شادمان خواهم بود. "},
	{35, "35  گناهکاران از زمین نابود گردند و شریران دیگر یافت نشوند. ای جان من، خداوند را متبارک بخوان! هلّلویاه! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view105() {
struct fa105 poems[] = {
	{1, "1  یهوه را حمد گویید و نام او را بخوانید. اعمال او را در میان قومها اعلام نمایید. "},
	{2, "2  او را بسرایید برای او تسبیح بخوانید. در تمام کارهای عجیب او تفکر نمایید. "},
	{3, "3  در نام قدّوس او فخر کنید. دل طالبان خداوند شادمان باشد. "},
	{4, "4  خداوند و قوّت او را بطلبید؛روی او را پیوسته طالب باشید. "},
	{5, "5  کارهای عجیب را که او کرده است به یاد آورید. آیات او و داوریهای دهان او را. "},
	{6, "6  ای ذریّت بندهٔ او ابراهیم، ای فرزندان یعقوب، برگزیده او، "},
	{7, "7  یهوه خدای ماست! داوریهای او در تمامی جهان است. "},
	{8, "8  عهد خود را یاد می‌دارد تا ابدالآباد و کلامی را که بر هزاران پشت فرموده است. "},
	{9, "9  آن عهدی را که با ابراهیم بسته و قسمی را که برای اسحاق خورده است. "},
	{10, "10  و آن را برای یعقوب فریضهای استوار ساخت و برای اسرائیل عهد جاودانی. "},
	{11, "11  و گفت که، زمین کنعان را به تو خواهم داد تا حصّه میراث شما شود. "},
	{12, "12  هنگامی که عددی معدود بودند، قلیلالعدد و غربا در آنجا، "},
	{13, "13  و از امّتی تا امّتی سرگردان می‌بودند و از یک مملکت تا قوم دیگر. "},
	{14, "14  او نگذاشت که کسی بر ایشان ظلم کند، بلکه پادشاهان را به خاطر ایشان توبیخ نمود "},
	{15, "15  که بر مسیحان من دست مگذارید و انبیای مرا ضرر مرسانید. "},
	{16, "16  پس قحطی را بر آن زمین خواند و تمامی قوام نان را شکست، "},
	{17, "17  و مردی پیش روی ایشان فرستاد، یعنی یوسف را که او را به غلامی فروختند. "},
	{18, "18  پایهای وی را به زنجیرها خستند و جان او در آهن بسته شد، "},
	{19, "19  تا وقتی که سخن او واقع شد و کلام خداوند او را امتحان نمود. "},
	{20, "20  آنگاه پادشاه فرستاده، بندهای او را گشاد و سلطان قومها او را آزاد ساخت. "},
	{21, "21  او را بر خانهٔخود حاکم قرار داد و مختار بر تمام مایملک خویش، "},
	{22, "22  تا به ارادهٔ خود سروران او را بند نماید و مشایخ او را حکمت آموزد. "},
	{23, "23  پس اسرائیل به مصر درآمدند و یعقوب در زمین حام غربت پذیرفت. "},
	{24, "24  و او قوم خود را به غایت بارور گردانید و ایشان را از دشمنان ایشان قویتر ساخت. "},
	{25, "25  لیکن دل ایشان را برگردانید تا بر قوم او کینه ورزند و بر بندگان وی حیله نمایند. "},
	{26, "26  بندهٔ خود موسی را فرستاد و هارون را که برگزیده بود. "},
	{27, "27  کلمات و آیات او را در میان ایشان اقامه کردند و عجایب او را در زمین حام. "},
	{28, "28  ظلمت را فرستاد که تاریک گردید. پس به کلام او مخالفت نورزیدند. "},
	{29, "29  آبهای ایشان را به خون مبدل ساخت و ماهیان ایشان را می‌رانید. "},
	{30, "30  زمین ایشان غوکها را به ازدحام پیدا نمود، حتّی در حرمهای پادشاهان ایشان. "},
	{31, "31  او گفت و انواع مگسها پدید آمد و پشه‌ها در همهٔ حدود ایشان. "},
	{32, "32  تگرگ را به عوض باران بارانید و آتش مشتعل را در زمین ایشان. "},
	{33, "33  موها و انجیرهای ایشان را زد و درختان محّال ایشان را بشکست. "},
	{34, "34  او گفت و ملخ پدید آمد و کرمها از حّد شماره افزون. "},
	{35, "35  و هر سهم را در زمین ایشان بخوردند و میوه‌های زمین ایشان را خوردند. "},
	{36, "36  و جمیع نخستزادگان را در زمین ایشان زد، اوایل تمامی قوّت ایشان را. "},
	{37, "37  و ایشان را با طلا و نقره بیرون آورد که در اسباط ایشان یکی ضعیف نبود. "},
	{38, "38  مصریان از بیرون رفتن ایشان شاد بودند زیرا که خوف ایشان بر آنها مستولی گردیده بود. "},
	{39, "39  ابری برای پوشش گسترانید و آتشی که شامگاه روشنایی دهد. "},
	{40, "40  سؤال کردند پس سَلْوی برای ایشان فرستاد و ایشان را از نان آسمان سیر گردانید. "},
	{41, "41  صخره را بشکافت و آب جاری شد؛ در جایهای خشک مثل نهر روان گردید. "},
	{42, "42  زیرا کلام مقدّس خود را به یاد آورد و بندهٔ خویش ابراهیم را. "},
	{43, "43  و قوم خود را با شادمانی بیرون آورد و برگزیدگان خویش را با ترنّم. "},
	{44, "44  و زمینهای امّت‌ها را بدیشان داد و زحمت قومها را وارث شدند. "},
	{45, "45  تا آنکه فرایض او را نگاه دارند و شریعت او را حفظ نمایند. هللویاه! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view106() {
struct fa106 poems[] = {
	{1, "1  هللویاه! خداوند را حمد بگویید زیرا که او نیکو است و رحمت او تا ابدالآباد! "},
	{2, "2  کیست که اعمال عظیم خداوند را بگوید و همهٔ تسبیحات او را بشنواند؟ "},
	{3, "3  خوشابحال آنانیکه انصاف را نگاه دارند و آن که عدالت را در همه وقت به عمل آورد. "},
	{4, "4  ای خداوند مرا یاد کن به رضامندییی که با قوم خود می‌داری؛ و به نجات خود از من تفقّد نما. "},
	{5, "5  تا سعادت برگزیدگان تو را ببینم و به شادمانی قوم تو مسرور شوم و با میراث تو فخر نمایم. "},
	{6, "6  با پدران خود گناه نموده‌ایم و عصیان ورزیده، شرارت کرده‌ایم. "},
	{7, "7  پدران ما کارهای عجیب تو را در مصر نفهمیدند و کثرت رحمت تو را به یاد نیاوردند، بلکه نزد دریا، یعنی بحر قلزم فتنه انگیختند. "},
	{8, "8  لیکن به خاطر اسم خود ایشان را نجات داد تا توانایی خود را اعلان نماید. "},
	{9, "9  و بحر قُلْزُم را عتاب کرد که خشک گردید. پس ایشان را در لجّه‌ها مثل بیابان رهبری فرمود. "},
	{10, "10  و ایشان را از دست دشمن نجات داد و از دست خصم رهایی بخشید. "},
	{11, "11  و آب، دشمنان ایشان را پوشانید که یکی از ایشان باقی نماند. "},
	{12, "12  آنگاه به کلام او ایمان آوردند و حمد او را سراییدند. "},
	{13, "13  لیکن اعمال او را به زودی فراموش کردند و مشورت او را انتظار نکشیدند. "},
	{14, "14  بلکه شهوتپرستی نمودند در بادیه؛ و خدا را امتحان کردند در هامون. "},
	{15, "15  و مسألت ایشان را بدیشان داد. لیکن لاغری در جانهای ایشان فرستاد. "},
	{16, "16  پس به موسی در اردو حسد بردند و به هارون، مقدّس یهوّه. "},
	{17, "17  و زمین شکافته شده، داتان را فرو برد و جماعت ابیرام را پوشانید. "},
	{18, "18  و آتش، در جماعت ایشان افروخته شده، شعلهٔ آتش شریران را سوزانید. "},
	{19, "19  گوسالهای در حوریب ساختند و بتی ریخته شده را پرستش نمودند. "},
	{20, "20  و جلال خود را تبدیل نمودند به مثال گاوی که علف می‌خورد. "},
	{21, "21  و خدای نجات دهنده خود را فراموش کردند که کارهای عظیم در مصر کرده بود، "},
	{22, "22  و اعمال عجیبه را در زمین حام و کارهای ترسناک را در بحر قلزم. "},
	{23, "23  آنگاه گفت که ایشان را هلاک بکند، اگر برگزیده اوموسی در شکاف به حضور وی نمی‌ایستاد، تا غضب او را از هلاکتِ ایشان برگرداند. "},
	{24, "24  و زمین مرغوب را خوار شمردند و به کلام وی ایمان نیاوردند. "},
	{25, "25  و در خیمه‌های خود همهمه کردند و قول خداوند را استماع ننمودند. "},
	{26, "26  له'ذا دست خود را برایشان برافراشت، که ایشان را در صحرا از پا درآوَرَدْ. "},
	{27, "27  و ذریّت ایشان را در میان امّت‌ها بیندازد و ایشان را در زمینها پراکنده کند. "},
	{28, "28  پس به بعل فغور پیوستند و قربانی‌های مردگان را خوردند. "},
	{29, "29  و به کارهای خود خشم او را به هیجان آوردند و وبا بر ایشان سخت آمد. "},
	{30, "30  آنگاه فینحاس بر پا ایستاده، داوری نمود و وبا برداشته شد. "},
	{31, "31  و این برای او به عدالت محسوب گردید، نسلاً بعد نسل تا ابدالآباد. "},
	{32, "32  و او را نزد آب مریبه غضبناک نمودند. حتی موسی را به خاطر ایشان آزاری عارض گردید. "},
	{33, "33  زیرا که روح او را تلخ ساختند، تا از لبهای خود ناسزا گفت. "},
	{34, "34  و آن قومها را هلاک نکردند، که دربارهٔ ایشان خداوند امر فرموده بود. "},
	{35, "35  بلکه خویشتن را با امّت‌ها آمیختند و کارهای ایشان را آموختند. "},
	{36, "36  و بتهای ایشان را پرستش نمودند تا آنکه برای ایشان دام گردید. "},
	{37, "37  و پسران و دختران خویش را برای دیوها قربانی گذرانیدند، "},
	{38, "38  و خون بی‌گناه را ریختند، یعنی خون پسران و دختران خود را که آن را برای بتهای کنعان ذبح کردند و زمین از خون ملوّث گردید. "},
	{39, "39  و از کارهای خود نجس شدند و در افعال خویش زناکار گردیدند. "},
	{40, "40  له'ذا خشم خداوند بر قوم خود افروخته شد و میراث خویش را مکروه داشت. "},
	{41, "41  و ایشان را به دست امّت‌ها تسلیم نمود تا آنانی که از ایشان نفرت داشتند، بر ایشان حکمرانی کردند. "},
	{42, "42  و دشمنان ایشان بر ایشان ظلم نمودند و زیر دست ایشان ذلیل گردیدند. "},
	{43, "43  بارهای بسیار ایشان را خلاصی داد. لیکن به مشورتهای خویش براو فتنه کردند و به‌سبب گناه خویش خوار گردیدند. "},
	{44, "44  با وجود این، بر تنگی ایشان نظر کرد، وقتی که فریاد ایشان را شنید. "},
	{45, "45  و به خاطر ایشان، عهد خود را به یاد آورد و در کثرت رحمت خویش بازگشت نمود. "},
	{46, "46  و ایشان را حرمت داد، در نظر جمیع اسیرکنندگان ایشان. "},
	{47, "47  ای یهوّه خدای ما، ما را نجات ده! و ما را از میان امّت‌ها جمع کن! تا نام قدّوس تو را حمد گوییم و در تسبیح تو فخر نماییم. "},
	{48, "48  یهوّه خدای اسرائیل متبارک باد از ازل تا ابدالآباد. و تمامی قوم بگویند آمین. هلّلویاه! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view107() {
struct fa107 poems[] = {
	{1, "1  خداوند را حمد بگویید زیرا که او نیکو است و رحمت او باقی است تا ابدالآباد. "},
	{2, "2  فدیه شدگان خداوند این را بگویند که ایشان را از دست دشمن فدیه داده است. "},
	{3, "3  و ایشان را از بُلدان جمع کرده، از مشرق و مغرب و از شمال و جنوب. "},
	{4, "4  در صحرا آواره شدند و دربادیهای بیطریق و شهری برای سکونت نیافتند. "},
	{5, "5  گرسنه و تشنه نیز شدند و جان ایشان در ایشان مستمند گردید. "},
	{6, "6  آنگاه در تنگی خود نزد خداوند فریاد برآوردند و ایشان را از تنگیهای ایشان رهایی بخشید، "},
	{7, "7  و ایشان را به راه مستقیم رهبری نمود، تا به شهری مسکون درآمدند. "},
	{8, "8  پس خداوند را به‌سبب رحمتش تشکّر نمایند و به‌سبب کارهای عجیب وی با بنی‌آدم. "},
	{9, "9  زیرا که جان آرزومند را سیر گردانید و جان گرسنه را از چیزهای نیکو پر ساخت، "},
	{10, "10  آنانی که در تاریکی و سایه موت نشسته بودند، که در مذلّت و آهن بسته شده بودند. "},
	{11, "11  زیرا به کلام خدا مخالفت نمودند و به نصیحت حضرت اعلی اهانت کردند. "},
	{12, "12  و او دل ایشان را به مشقّت ذلیل ساخت؛ بلغزیدند و مدد کننده‌ای نبود. "},
	{13, "13  آنگاه در تنگی خود نزد خداوند فریاد برآوردند و ایشان را از تنگیهای ایشان رهایی بخشید. "},
	{14, "14  ایشان را از تاریکی و سایه موت بیرون آورد و بندهای ایشان را بگسست. "},
	{15, "15  پس خداوند را به‌سبب رحمتش تشکّر نمایند و به‌سبب کارهای عجیب او با بنی‌آدم. "},
	{16, "16  زیرا که دروازه‌های برنجین را شکسته، و بندهای آهنین را پاره کرده است. "},
	{17, "17  احمقان به‌سبب طریق شریرانه خود و به‌سبب گناهان خویش، خود را ذلیل ساختند. "},
	{18, "18  جان ایشان هر قسم خوراک را مکروه داشت و به دروازه‌های موت نزدیک شدند. "},
	{19, "19  آنگاه در تنگی خود نزد خداوند فریاد برآوردند و ایشان را از تنگیهای ایشان رهایی بخشید. "},
	{20, "20  کلام خود را فرستاده، ایشان را شفا بخشید و ایشان را از هلاکتهای ایشان رهانید. "},
	{21, "21  پس خداوند را به‌سبب رحمتش تشکرنمایند و به‌سبب کارهای عجیب او با بنی‌آدم. "},
	{22, "22  و قربانی‌های تشکّر را بگذرانند و اعمال وی را به ترّنم ذکر کنند. "},
	{23, "23  آنانی که در کشتیها به دریا رفتند، و در آبهای کثیر شغل کردند. "},
	{24, "24  اینان کارهای خداوند را دیدند و اعمال عجیب او را در لجّه‌ها. "},
	{25, "25  او گفت پس باد تند را وزانید و امواج آن را برافراشت. "},
	{26, "26  به آسمانها بالا رفتند و به لجّه‌ها فرود شدند و جان ایشان از سختی گداخته گردید. "},
	{27, "27  سرگردان گشته، مثل مستان افتان و خیزان شدند و عقل ایشان تماماً حیران گردید. "},
	{28, "28  آنگاه در تنگی خود نزد خداوند فریاد برآوردند و ایشان را از تنگیهای ایشان رهایی بخشید. "},
	{29, "29  طوفان را به آرامی ساکت ساخت که موجهایش ساکن گردید. "},
	{30, "30  پس مسرور شدند زیرا که آسایش یافتند و ایشان را به بندرِ مرادِ ایشان رسانید. "},
	{31, "31  پس خداوند را به‌سبب رحمتش تشکّر نمایند و به‌سبب کارهای عجیب او با بنی‌آدم. "},
	{32, "32  و او را در مجمع قوم متعال بخوانند و در مجلس مشایخ او را تسبیح بگویند. "},
	{33, "33  او نهرها را به بادیه مبدّل کرد و چشمه‌های آب را به زمین تشنه. "},
	{34, "34  و زمین بارور را نیز به شورهزار، به‌سبب شرارت ساکنان آن. "},
	{35, "35  بادیه را به دریاچه آب مبدّل کرد و زمین خشک را به چشمه‌های آب. "},
	{36, "36  و گرسنگان را در آنجا ساکن ساخت تا شهری برای سکونت بنا نمودند. "},
	{37, "37  و مزرعه‌ها کاشتند و تاکستانها غرس نمودند و حاصل غلّه به عمل آوردند. "},
	{38, "38  و ایشان را برکت داد تا به غایت کثیر شدند و بهایم ایشان را نگذارد کم شوند. "},
	{39, "39  و باز کم گشتند و ذلیل شدند، از ظلم و شقاوت و حزن. "},
	{40, "40  ذلّت را بر رؤسا می‌ریزد و ایشان را در بادیهای که راه ندارد آواره می‌سازد. "},
	{41, "41  امّا مسکین را ازمشقّتش برمیافرازد و قبیله‌ها را مثل گله‌ها برایش پیدا می‌کند. "},
	{42, "42  صالحان این را دیده، شادمان می‌شوند و تمامی شرارت دهان خود را خواهد بست. "},
	{43, "43  کیست خردمند تا بدین چیزها تفکّر نماید؟ که ایشان رحمتهای خداوند را خواهند فهمید. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view108() {
struct fa108 poems[] = {
	{1, "1  [سرود و مزمور داود] ای خدا دل من مستحکم است. من خواهم سرایید و ترنّم خواهم نمود و جلال من نیز. "},
	{2, "2  ای عود و بربط بیدار شوید! من نیز در سحرگاه بیدار خواهم شد. "},
	{3, "3  ای خداوند، تو را در میان قومها حمد خواهم گفت و در میان طایفه‌ها تو را خواهم سرایید. "},
	{4, "4  زیرا که رحمت تو عظیم است، فوق آسمانها! و راستی تو تا افلاک می‌رسد! "},
	{5, "5  ای خدا، بر فوق آسمانها متعال باش و جلال تو بر تمامی زمین! "},
	{6, "6  تا محبوبان تو خلاصی یابند. به دست راست خود نجات ده و مرا اجابت فرما. "},
	{7, "7  خدا در قدّوسیت خود سخن گفته است، پس وجد خواهم نمود. شکیم را تقسیم می‌کنم و وادی سکّوت را خواهم پیمود. "},
	{8, "8  جلعاد از آن من است و منسّی از آن من. و افرایم خود سر من. و یهودا عصای سلطنت من. "},
	{9, "9  موآب ظرف شست و شوی من است، و بر ادوم نعلین خود را خواهم انداخت و بر فلسطین فخر خواهم نمود. "},
	{10, "10  کیست که مرا به شهر حصین درآورد؟ کیست که مرا به ادوم رهبری نماید؟ "},
	{11, "11  آیا نه تو ای خدا که ما را ترک کرده‌ای؟ و تو ای خدا که بالشکرهای ما بیرون نمی‌آیی؟ "},
	{12, "12  ما را بر دشمن امداد فرما، زیرا که مدد انسان باطل است. "},
	{13, "13  در خدا با شجاعت کار خواهیم کرد و او دشمنان ما را پایمال خواهد نمود. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view109() {
struct fa109 poems[] = {
	{1, "1  [برای سالار مغنیان. مزمور داود] ای خدای تسبیح من، خاموش مباش! "},
	{2, "2  زیرا که دهانِ شرارت و دهانِ فریب را بر من گشوده‌اند، و به زبان دروغ بر من سخن گفته‌اند. "},
	{3, "3  به سخنان کینه مرا احاطه کرده‌اند و بی‌سبب با من جنگ نموده‌اند. "},
	{4, "4  به عوض محبّتِ من، با من مخالفت می‌کنند، و امّا من دعا. "},
	{5, "5  و به عوض نیکویی به من بدی کرده‌اند، و به عوض محبّت، عداوت نموده. "},
	{6, "6  مردی شریر را بر او بگمار، و دشمن به دست راست او بایستد. "},
	{7, "7  هنگامی که در محاکمه بیاید، خطا کار بیرون آید و دعای او گناه بشود. "},
	{8, "8  ایّام عمرش کم شود و منصب او را دیگری ضبط نماید. "},
	{9, "9  فرزندان او یتیم بشوند و زوجه وی بیوه گردد. "},
	{10, "10  و فرزندان او آواره شده، گدایی بکنند و از خرابه‌های خود قوّت را بجویند. "},
	{11, "11  طلبکار تمامی مایملک او را ضبط نماید و اجنبیان محنت او را تاراج کنند. "},
	{12, "12  کسی نباشد که بر او رحمت کند و بر یتیمانِ وی احدی رأفت ننماید. "},
	{13, "13  ذرّیت وی منقطع گردند و در طبقه بعد نام ایشان محو شود. "},
	{14, "14  عصیان پدرانش نزد خداوند به یاد آورده شود و گناه مادرش محو نگردد. "},
	{15, "15  و آنها در مدّ نظر خداوند دائماً بماند تا یادگاری ایشان را از زمین ببُرَد. "},
	{16, "16  زیرا که رحمت نمودن را به یاد نیاوَرْد، بلکه بر فقیر و مسکین جفا کرد و بر شکسته دل تا او را به قتل رساند. "},
	{17, "17  چون که لعنت را دوست می‌داشت، بدو رسیده و چون که برکت را نمی‌خواست، از او دور شده است. "},
	{18, "18  و لعنت را مثل ردای خود در بر گرفت و مثل آب به شکمش درآمد و مثل روغن در استخوانهای وی. "},
	{19, "19  پس مثل جامهای که او را می‌پوشاند، و چون کمربندی که به آن همیشه بسته می‌شود، خواهد بود. "},
	{20, "20  این است اجرت مخالفانم از جانب خداوند و برای آنانی که بر جان من بدی می‌گویند. "},
	{21, "21  امّا تو ای یهوّه خداوند، به خاطر نام خود با من عمل نما؛ چون که رحمت تو نیکوست، مرا خلاصی ده. "},
	{22, "22  زیرا که من فقیر و مسکین هستم و دل من در اندرونم مجروح است. "},
	{23, "23  مثل سایهای که در زوال باشد، رفته‌ام و مثل ملخ رانده شده‌ام. "},
	{24, "24  زانوهایم از روزه داشتن می‌لرزد و گوشتم از فربهی کاهیده می‌شود. "},
	{25, "25  و من نزد ایشان عار گردیده‌ام. چون مرا می‌بینند سر خود را می‌جنبانند. "},
	{26, "26  ای یهوه خدای من مرا اعانت فرما، و به حسب رحمت خود مرا نجات ده، "},
	{27, "27  تا بدانند که این است دست تو، و تو ای خداوند این را کرده‌ای. "},
	{28, "28  ایشان لعنت بکنند، امّا تو برکت بده. ایشان برخیزند و خجل گردند و امّا بندهٔ تو شادمان شود. "},
	{29, "29  جفا کنندگانم به رسوایی ملبّس شوند و خجالت خویش را مثل ردا بپوشند. "},
	{30, "30  خداوند را به زبان خود بسیار تشکّر خواهم کرد و او را در جماعت کثیر حمد خواهم گفت. "},
	{31, "31  زیرا که به دست راست مسکین خواهد ایستادتا او را از آنانی که بر جان او فتوا می‌دهند برهاند. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view110() {
struct fa110 poems[] = {
	{1, "1  [مزمور داود] یهوه به خداوند من گفت، به دست راست من بنشین تا دشمنانت را پای انداز تو سازم. "},
	{2, "2  خداوند عصای قوّت تو را از صهیون خواهد فرستاد. در میان دشمنان خود حکمرانی کن. "},
	{3, "3  قوم تو در روزِ قوّتِ تو، هدایای تبرّعی می‌باشند. در زینتهای قدّوسیت، شبنمِ جوانیِ تو از رَحِم صحرگاه برای توست. "},
	{4, "4  خداوند قسم خورده است و پشیمان نخواهد شد که تو کاهن هستی تا ابدالآباد، به رتبه ملکیصدق. "},
	{5, "5  خداوند که به دست راست توست؛ در روز غضب خود پادشاهان را شکست خواهد داد. "},
	{6, "6  در میان امّت‌ها داوری خواهد کرد. از لاشها پر خواهد ساخت و سر آنها را در زمین وسیع خواهد کوبید. "},
	{7, "7  از نهرِ سرِ راه خواهد نوشید. بنابراین سر خود را بر خواهد افراشت. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view111() {
struct fa111 poems[] = {
	{1, "1  هلّلویاه! خداوند را به تمامی دل حمد خواهم گفت، در مجلس راستان و در جماعت. "},
	{2, "2  کارهای خداوند عظیم است، و همگانی که به آنها رغبت دارند در آنها تفتیش می‌کنند. "},
	{3, "3  کار او جلال و کبریایی است و عدالت وی پایدار تا ابدالآباد. "},
	{4, "4  یادگاری برای کارهای عجیب خود ساخته است. خداوند کریم و رحیم است. "},
	{5, "5  ترسندگان خود را رزقی نیکوداده است. عهد خویش را به یاد خواهد داشت تا ابدالآباد. "},
	{6, "6  قوّت اعمال خود را برای قوم خود بیان کرده است تا میراث امّت‌ها را بدیشان عطا فرماید. "},
	{7, "7  کارهای دستهایش راستی و انصاف است و جمیع فرایض وی امین. "},
	{8, "8  آنها پایدار است تا ابدالآباد. در راستی و استقامت کرده شده. "},
	{9, "9  فدیهای برای قوم خود فرستاد و عهد خویش را تا ابد امر فرمود. نام او قدّوس و مهیب است. "},
	{10, "10  ترس خداوند ابتدای حکمت است. همهٔ عاملین آنها را خردمندی نیکو است. حمد او پایدار است تا ابدالآباد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view112() {
struct fa112 poems[] = {
	{1, "1  هللویاه! خوشابحال کسی که از خداوند می‌ترسد و در وصایای او بسیار رغبت دارد. "},
	{2, "2  ذرّیتش در زمین زورآور خواهند بود. طبقه راستان مبارک خواهند شد. "},
	{3, "3  توانگری و دولت در خانهٔ او خواهد بود و عدالتش تا به ابد پایدار است. "},
	{4, "4  نور برای راستان در تاریکی طلوع می‌کند. او کریم و رحیم و عادل است. "},
	{5, "5  فرخنده است شخصی که رئوف و قرض دهنده باشد. او کارهای خود را به انصاف استوار می‌دارد. "},
	{6, "6  زیرا که تا به ابد جنبش نخواهد خورد. مرد عادل تا به ابد مذکور خواهد بود. "},
	{7, "7  از خبر بد نخواهد ترسید. دل او پایدار است و بر خداوند توکّل دارد. "},
	{8, "8  دل او استوار است و نخواهد ترسید تا آرزوی خویش را بر دشمنان خود ببیند. "},
	{9, "9  بذل نموده، به فقرا بخشیده است؛ عدالتش تا به ابد پایدار است. شاخ او با عزّت افراشته خواهد شد. "},
	{10, "10  شریر این را دیده، غضبناک خواهد شد. دندانهای خود را فشرده، گداخته خواهد گشت. آرزوی شریران زایل خواهد گردید. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view113() {
struct fa113 poems[] = {
	{1, "1  هلّلویاه! ای بندگان خداوند، تسبیح بخوانید. نام خداوند را تسبیح بخوانید. "},
	{2, "2  نام خداوند متبارک باد، از الآن و تا ابدالآباد. "},
	{3, "3  از مَطْلَع آفتاب تا مغرب آن، نام خداوند تسبیح خوانده شود. "},
	{4, "4  خداوند بر جمیع امّت‌ها متعال است و جلال وی فوق آسمانها. "},
	{5, "5  کیست مانند یهوّه خدای ما که بر اعلی علّیین نشسته است؟ "},
	{6, "6  و متواضع می‌شود تا نظر نماید بر آسمانها و بر زمین؛ "},
	{7, "7  که مسکین را از خاک برمی‌دارد و فقیر را از مزبله برمیافرازد. "},
	{8, "8  تا او را با بزرگان بنشاند، یعنی با بزرگان قوم خویش. "},
	{9, "9  زن نازاد را خانهنشین می‌سازد و مادر فرحناک فرزندان. هلّلویاه! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view114() {
struct fa114 poems[] = {
	{1, "1  اجنبی زبان، "},
	{2, "2  یهودا مَقْدَس او بود و اسرائیل محّل سلطنت وی. "},
	{3, "3  دریا این را بدید و گریخت و اردن به عقب برگشت. "},
	{4, "4  کوه‌ها مثل قوچها به جستن درآمدند و تلها مثل بره‌های گله. "},
	{5, "5  ای دریا تو را چه شد که گریختی؟ و ای اردن که به عقب برگشتی؟ "},
	{6, "6  ای کوه‌ها که مثل قوچها به جستن درآمدید و ای تلها که مثل بره‌های گله. "},
	{7, "7  ای زمیناز حضور خداوند متزلزل شو و از حضور خدای یعقوب. "},
	{8, "8  که صخره را دریاچه آب گردانید و سنگ خارا را چشمه آب. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view115() {
struct fa115 poems[] = {
	{1, "1  ما را نی، ای خداوند ! ما را نی، بلکه نام خود را جلال ده! به‌سبب رحمتت و به‌سبب راستی خویش. "},
	{2, "2  امّت‌ها چرا بگویند که خدای ایشان الآن کجاست؟ "},
	{3, "3  امّا خدای ما در آسمانهاست. آنچه را که اراده نمود، به عمل آورده است. "},
	{4, "4  بتهای ایشان نقره و طلاست، از صنعت دستهای انسان. "},
	{5, "5  آنها را دهان است و سخن نمی‌گویند. آنها را چشمهاست و نمی‌بینند. "},
	{6, "6  آنها را گوشهاست و نمی‌شنوند. آنها را بینی است و نمی‌بویند. "},
	{7, "7  دستها دارند و لمس نمی‌کنند. و پایها و راه نمی‌روند. و به گلوی خود تنطّق نمی‌نمایند. "},
	{8, "8  سازندگان آنها مثل آنها هستند، و هر که بر آنها توکّل دارد. "},
	{9, "9  ای اسرائیل بر خداوند توکّل نما. او معاون و سپر ایشان است. "},
	{10, "10  ای خاندانِ هارون بر خداوند توکّل نمایید. او معاون و سپر ایشان است. "},
	{11, "11  ای ترسندگانِ خداوند، بر خداوند توکّل نمایید. او معاون و سپر ایشان است. "},
	{12, "12  خداوند ما را به یاد آورده، برکت می‌دهد. خاندان اسرائیل را برکت خواهد داد و خاندان هارون را برکت خواهد داد. "},
	{13, "13  ترسندگان خداوند را برکت خواهد داد، چه کوچک و چه بزرگ. "},
	{14, "14  خداوند شما را ترقی خواهد داد، شما و فرزندان شما را. "},
	{15, "15  شما مبارک خداوند هستید که آسمان و زمین را آفرید. "},
	{16, "16  آسمانها، آسمانهای خداوند است و امّا زمین را به بنی‌آدم عطا فرمود. "},
	{17, "17  مردگان نیستند که یاه را تسبیح می‌خوانند؛ و نه آنانی که به خاموشی فرو می‌روند. "},
	{18, "18  لیکن ما یاه را متبارک خواهیم خواند، از الآن و تا ابدالآباد. هلّلویاه! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view116() {
struct fa116 poems[] = {
	{1, "1  خداوند را محبّت می‌نمایم زیرا که آواز من و تضّرع مرا شنیده است. "},
	{2, "2  زیرا که گوش خود را به من فرا داشته است، پس مدّت حیات خود، او را خواهم خواند. "},
	{3, "3  ریسمانهای موت مرا احاطه کرد و تنگیهای هاویه مرا دریافت، تنگی و غم پیدا کردم. "},
	{4, "4  آنگاه نام خداوند را خواندم. آه ای خداوند جان مرا رهایی ده! "},
	{5, "5  خداوند رئوف و عادل است و خدای ما رحیم است. "},
	{6, "6  خداوند ساده دلان را محافظت می‌کند. ذلیل بودم و مرا نجات داد. "},
	{7, "7  ای جان من به آرامی خود برگرد، زیرا خداوند به تو احسان نموده است. "},
	{8, "8  زیرا که جان مرا از موت خلاصی دادی و چشمانم را از اشک و پایهایم را از لغزیدن. "},
	{9, "9  به حضور خداوند سالک خواهم بود، در زمین زندگان. "},
	{10, "10  ایمان آوردم پس سخن گفتم. من بسیار مستمند شدم. "},
	{11, "11  در پریشانی خود گفتم که جمیع آدمیان دروغگویند. "},
	{12, "12  خداوند را چه ادا کنم، برای همهٔ احسانهایی که به من نموده است؟ "},
	{13, "13  پیاله نجات را خواهم گرفت و نام خداوند را خواهم خواند. "},
	{14, "14  نذرهای خود را به خداوند ادا خواهم کرد، به حضور تمامی قوم او. "},
	{15, "15  موت مقدّسان خداوند در نظر وی گرانبها است. "},
	{16, "16  آه ای خداوند، من بندهٔ تو هستم! من بندهٔ تو و پسر کنیز تو هستم. بندهای مرا گشوده‌ای! "},
	{17, "17  قربانی‌های تشکر نزد تو خواهم گذرانید و نام خداوند را خواهم خواند. "},
	{18, "18  نذرهای خود را به خداوند ادا خواهم کرد، به حضور تمامی قوم وی، "},
	{19, "19  در صحنهای خانهٔ خداوند، در اندرون تو ای اورشلیم. هلّلویاه! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view117() {
struct fa117 poems[] = {
	{1, "1  ای جمیع امّت‌ها خداوند را تسبیحبخوانید! ای تمامی قبایل! او را حمد گویید! "},
	{2, "2  زیرا که رحمت او بر ما عظیم است و راستی خداوند تا ابدالآباد. هلّلویاه! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view118() {
struct fa118 poems[] = {
	{1, "1  خداوند را حمد گویید زیرا که نیکوست و رحمت او تا ابدالآباد است. "},
	{2, "2  اسرائیل بگویند که رحمت او تا ابدالآباد است. "},
	{3, "3  خاندان هارون بگویند که رحمت او تا ابدالآباد است. "},
	{4, "4  ترسندگان خداوند بگویند که رحمت او تا ابدالآباد است. "},
	{5, "5  در تنگی یاه را خواندم. یاه مرا اجابت فرموده، در جای وسیع آورد. "},
	{6, "6  خداوند با من است، پس نخواهم ترسید. انسان به من چه تواند کرد؟ "},
	{7, "7  خداوند برایم از مددکاران من است. پس من بر نفرت کنندگان خود آرزوی خویش را خواهم دید. "},
	{8, "8  به خداوند پناه بردن بهتر است از توکّل نمودن بر آدمیان. "},
	{9, "9  به خداوند پناه بردن بهتراست از توکّل نمودن بر امیران. "},
	{10, "10  جمیع امّت‌ها مرا احاطه کردند، لیکن به نام خداوند ایشان را هلاک خواهم کرد. "},
	{11, "11  مرا احاطه کردند و دور مرا گرفتند، لیکن به نام خداوند ایشان را هلاک خواهم کرد. "},
	{12, "12  مثل زنبورها مرا احاطه کردند و مثل آتش خارها خاموش شدند. زیرا که به نام خداوند ایشان را هلاک خواهم کرد. "},
	{13, "13  بر من سخت هجوم آوردی تا بیفتم، لیکن خداوند مرا اعانت نمود. "},
	{14, "14  خداوند قوّت و سرود من است و نجات من شده است. "},
	{15, "15  آواز ترنّم و نجات در خیمه‌های عادلان است. دست راست خداوند با شجاعت عمل می‌کند. "},
	{16, "16  دست راست خداوند متعال است. دست راست خداوند با شجاعت عمل می‌کند. "},
	{17, "17  نمی‌میرم، بلکه زیست خواهم کرد و کارهای یاه را ذکر خواهم نمود. "},
	{18, "18  یاه مرا به شدت تنبیه نموده، لیکن مرا به موت نسپرده است. "},
	{19, "19  دروازه‌های عدالت را برای من بگشایید! به آنها داخل شده، یاه را حمد خواهم گفت. "},
	{20, "20  دروازه خداوند این است. عادلان بدان داخل خواهند شد. "},
	{21, "21  تو را حمد می‌گویم زیرا که مرا اجابت فرموده و نجات من شده‌ای. "},
	{22, "22  سنگی را که معماران رد کردند، همان سر زاویه شده است. "},
	{23, "23  این از جانب خداوند شده و در نظر ما عجیب است. "},
	{24, "24  این است روزی که خداوند ظاهر کرده است. درآن وجد و شادی خواهیم نمود. "},
	{25, "25  آه ای خداوند نجات ببخش! آه ای خداوند سعادتعطا فرما! "},
	{26, "26  متبارک باد او که به نام خداوند می‌آید. شما را از خانهٔ خداوند برکت می‌دهیم. "},
	{27, "27  یهوّه خدایی است که ما را روشن ساخته است. ذبیحه را به ریسمانها بر شاخهای قربانگاه ببندید. "},
	{28, "28  تو خدای من هستی تو، پس تو را حمد می‌گویم. خدای من، تو را متعال خواهم خواند. "},
	{29, "29  خداوند را حمد گویید زیرا که نیکوست و رحمت او تا ابدالآباد است. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view119() {
struct fa119 poems[] = {
	{1, "1  [ا] خوشا به حال کاملان طریق که به شریعت خداوند سالکند. "},
	{2, "2  خوشا به حال آنانی که شهادات او را حفظ می‌کنند و به تمامیِ دل او را می‌طلبند. "},
	{3, "3  کج روی نیز نمی‌کنند و به طریق‌های وی سلوک می‌نمایند. "},
	{4, "4  تو وصایای خود را امر فرموده‌ای تا آنها را تماماً نگاه داریم. "},
	{5, "5  کاش که راه‌های من مستحکم شود تا فرایض تو را حفظ کنم. "},
	{6, "6  آنگاه خجل نخواهم شد چون تمام اوامر تو را در مدّ نظر خود دارم. "},
	{7, "7  تو را به راستی دل حمد خواهم گفت چون داوریهای عدالت تو را آموخته شوم. "},
	{8, "8  فرایض تو را نگاه می‌دارم. مرا بالکلّیه ترک منما. "},
	{9, "9  [ب] به چه چیز مرد جوان راه خود را پاک می‌سازد؟ به نگاه داشتنش موافق کلام تو. "},
	{10, "10  به تمامیِ دل تو را طلبیدم. مگذار که از اوامر تو گمراه شوم. "},
	{11, "11  کلام تو را در دل خود مخفی داشتم که مبادا به تو گناه ورزم. "},
	{12, "12  ای خداوند تو متبارک هستی فرایض خود را به من بیاموز. "},
	{13, "13  به لبهای خود بیان کردم تمامیِ داوریهای دهان تو را. "},
	{14, "14  در طریق شهادات تو شادمانم. "},
	{15, "15  چنانکه در هر قسم توانگری، در وصایای تو تفکّر می‌کنم و به طریق‌های تو نگران خواهم بود. "},
	{16, "16  از فرایض تو لذّت می‌برم، پس کلام تو را فراموش نخواهم کرد. "},
	{17, "17  [ج] به بندهٔ خود احسان بنما تا زنده شوم و کلام تو را حفظ نمایم. "},
	{18, "18  چشمان مرا بگشا تا از شریعت تو چیزهای عجیب بینم. "},
	{19, "19  من در زمین غریب هستم. اوامر خود را از من مخفی مدار. "},
	{20, "20  جان من شکسته می‌شود از اشتیاق داوریهای تو در هر وقت. "},
	{21, "21  متکبران ملعون را توبیخ نمودی، که از اوامر تو گمراه می‌شوند. "},
	{22, "22  ننگ و رسوایی را از من بگردان، زیرا که شهادات تو را حفظ کرده‌ام. "},
	{23, "23  سروران نیز نشسته، به ضدّ من سخن گفتند. لیکن بندهٔ تو در فرایض تو تفکّر می‌کند. "},
	{24, "24  شهادات تو نیز ابتهاج من و مشورت دهندگان من بوده‌اند. "},
	{25, "25  [د] جان من به خاک چسبیده است. مرا موافق کلام خود زنده ساز. "},
	{26, "26  راه‌های خود را ذکر کردم و مرا اجابت نمودی. پس فرایض خویش را به من بیاموز. "},
	{27, "27  طریق وصایای خود را به من بفهمان و در کارهای عجیب تو تفکّر خواهم نمود. "},
	{28, "28  جان من از حزن گداخته می‌شود. مرا موافق کلام خود برپا بدار. "},
	{29, "29  راه دروغ را از من دور کن و شریعت خود را به من عنایت فرما. "},
	{30, "30  طریق راستی را اختیار کردم و داوریهای تو را پیش خود گذاشتم. "},
	{31, "31  به شهادات تو چسبیدم. ای خداوند مرا خجل مساز. "},
	{32, "32  در طریق اوامر تو دوان خواهم رفت، وقتی که دل مرا وسعت دادی. "},
	{33, "33  [ه] ای خداوند طریق فرایض خود را به من بیاموز. پس آنها را تا به آخر نگاه خواهم داشت. "},
	{34, "34  مرا فهم بده و شریعت تو را نگاه خواهم داشت و آن را به تمامی دل خود حفظ خواهم نمود. "},
	{35, "35  مرا در سبیل اوامر خود سالک گردان زیرا که در آن رغبت دارم. "},
	{36, "36  دل مرا به شهادات خود مایل گردان و نه به سوی طمع. "},
	{37, "37  چشمانم را از دیدن بطالت برگردان و در طریق خود مرا زنده ساز. "},
	{38, "38  کلام خود را بر بندهٔ خویش استوار کن، که به ترس تو سپرده شده است. "},
	{39, "39  ننگ مرا که از آن می‌ترسم از من دور کن زیرا که داوریهای تو نیکو است. "},
	{40, "40  هان به وصایای تو اشتیاق دارم. به حسب عدالت خود مرا زنده ساز. "},
	{41, "41  [و] ای خداوند رحمهای تو به من برسد و نجات تو به حسب کلام تو. "},
	{42, "42  تا بتوانم ملامت کنندهٔ خود را جواب دهم زیرا بر کلام تو توکّل دارم. "},
	{43, "43  و کلام راستی را از دهانم بالّکل مگیر زیرا که به داوریهای تو امیدوارم "},
	{44, "44  و شریعت تو را دائماً نگاه خواهم داشت تا ابدالآباد، "},
	{45, "45  و به آزادی راه خواهم رفت زیرا که وصایای تو را طلبیده‌ام. "},
	{46, "46  و در شهادات تو به حضور پادشاهان سخن خواهم گفت و خجل نخواهم شد، "},
	{47, "47  و از وصایای تو تلذّذ خواهم یافت که آنها را دوستمی‌دارم؛ "},
	{48, "48  و دستهای خود را به اوامر تو که دوست می‌دارم بر خواهم افراشت و در فرایض تو تفکّر خواهم نمود. "},
	{49, "49  [ز] کلام خود را با بندهٔ خویش به یاد آور که مرا بر آن امیدوار گردانیدی. "},
	{50, "50  این در مصیبتم تسلّی من است زیرا قول تو مرا زنده ساخت. "},
	{51, "51  متکبّران مرا بسیار استهزا کردند، لیکن از شریعت تو رو نگردانیدم. "},
	{52, "52  ای خداوند داوریهای تو را از قدیم به یاد آوردم و خویشتن را تسلّی دادم. "},
	{53, "53  حدّت خشمْ مرا در گرفته است، به‌سبب شریرانی که شریعت تو را ترک کرده‌اند. "},
	{54, "54  فرایض تو سرودهای من گردید، در خانهٔ غربت من. "},
	{55, "55  ای خداوند نام تو را در شب به یاد آوردم و شریعت تو را نگاه داشتم. "},
	{56, "56  این بهره من گردید، زیرا که وصایای تو را نگاه داشتم. "},
	{57, "57  [ح] خداوند نصیب من است. گفتم که کلام تو را نگاه خواهم داشت. "},
	{58, "58  رضامندیِ تو را به تمامیِ دل خود طلبیدم. به حسب کلام خود بر من رحم فرما. "},
	{59, "59  در راه‌های خود تفکّر کردم و پایهای خود را به شهادات تو مایل ساختم. "},
	{60, "60  شتابیدم و درنگ نکردم تا اوامر تو را نگاه دارم. "},
	{61, "61  ریسمانهای شریران مرا احاطه کرد، لیکن شریعت تو را فراموش نکردم. "},
	{62, "62  در نصف شب برخاستم تا تو را حمد گویم برای داوریهای عدالت تو. "},
	{63, "63  من همهٔ ترسندگانت را رفیق هستم، و آنانی را که وصایای تو را نگاه می‌دارند. "},
	{64, "64  ای خداوند زمین از رحمت تو پر است. فرایض خود را به من بیاموز. "},
	{65, "65  [ط] با بندهٔ خود احسان نمودی، ای خداوند موافق کلام خویش. "},
	{66, "66  خردمندیِ نیکو و معرفت را به من بیاموز زیرا که به اوامر تو ایمان آوردم. "},
	{67, "67  قبل از آنکه مصیبت را ببینم من گمراه شدم لیکن الآن کلام تو را نگاه داشتم. "},
	{68, "68  تو نیکو هستی و نیکویی می‌کنی. فرایض خود را به من بیاموز. "},
	{69, "69  متکبّران بر من دروغ بستند. و امّا من به تمامی دل وصایای تو را نگاه داشتم. "},
	{70, "70  دل ایشان مثل پیه فربه است. و امّا من در شریعت تو تلذّذ می‌یابم. "},
	{71, "71  مرا نیکو است که مصیبت را دیدم، تا فرایض تو را بیاموزم. "},
	{72, "72  شریعت دهان تو برای من بهتر است از هزاران طلا و نقره. "},
	{73, "73  [ی] دستهای تو مرا ساخته و آفریده است. مرا فهیم گردان تا اوامر تو را بیاموزم. "},
	{74, "74  ترسندگان تو چون مرا بینند شادمان گردند زیرا به کلام تو امیدوار هستم. "},
	{75, "75  ای خداوند دانسته‌ام که داوریهای تو عدل است، و بر حقّ مرا مصیبت داده‌ای. "},
	{76, "76  پس رحمت تو برای تسلّی من بشود، موافق کلام تو با بندهٔ خویش. "},
	{77, "77  رحمتهای تو به من برسد تا زنده شوم زیرا که شریعت تو تلذّذ من است. "},
	{78, "78  متکبّران خجل شوند زیرا به دروغ مرا اذیّت رسانیدند. و امّا من در وصایای تو تفکّر می‌کنم. "},
	{79, "79  ترسندگان تو به من رجوع کنند و آنانی که شهادات تو را می‌دانند. "},
	{80, "80  دل من در فرایض تو کامل شود، تا خجل نشوم. "},
	{81, "81  [ک] جان من برای نجات تو کاهیده می‌شود. لیکن به کلام تو امیدوار هستم. "},
	{82, "82  چشمان منبرای کلام تو تار گردیده است و می‌گویم کی مرا تسلّی خواهی داد. "},
	{83, "83  زیرا که مثل مشک در دود گردیده‌ام. لیکن فرایض تو را فراموش نکرده‌ام. "},
	{84, "84  چند است روزهای بندهٔ تو؟ و کی بر جفا کنندگانم داوری خواهی نمود؟ "},
	{85, "85  متکبّران برای من حفره‌ها زدند زیرا که موافق شریعت تو نیستند. "},
	{86, "86  تمامی اوامر تو امین است. بر من ناحق جفا کردند. پس مرا امداد فرما. "},
	{87, "87  نزدیک بود که مرا از زمین نابود سازند. امّا من وصایای تو را ترک نکردم. "},
	{88, "88  به حسب رحمت خود مرا زنده ساز تا شهادات دهان تو را نگاه دارم. "},
	{89, "89  [ل] ای خداوند کلام تو تا ابدالآباد در آسمانها پایدار است. "},
	{90, "90  امانت تو نسلاً بعد نسل است. زمین را آفریده‌ای و پایدار می‌ماند. "},
	{91, "91  برای داوریهای تو تا امروز ایستاده‌اند زیرا که همه بندهٔ تو هستند. "},
	{92, "92  اگر شریعت تو تلذّذ من نمی‌بود، هرآینه در مذلّت خود هلاک می‌شدم. "},
	{93, "93  وصایای تو را تا به ابد فراموش نخواهم کرد زیرا به آنها مرا زنده ساخته‌ای. "},
	{94, "94  من از آن تو هستم مرا نجات ده زیرا که وصایای تو را طلبیدم. "},
	{95, "95  شریران برای من انتظار کشیدند تا مرا هلاک کنند. لیکن در شهادات تو تأمّل می‌کنم. "},
	{96, "96  برای هر کمالی انتهایی دیدم، لیکن حکم تو بی‌نهایت وسیع است. "},
	{97, "97  [م] شریعت تو را چقدر دوست می‌دارم؛ تمامی روز تفکّر من است. "},
	{98, "98  اوامر تو مرا از دشمنانم حکیمتر ساخته است زیرا که همیشه نزد من می‌باشد. "},
	{99, "99  از جمیع معلمان خود فهیمترشدم زیرا که شهادات تو تفکّر من است. "},
	{100, "100  از مشایخ خردمندتر شدم زیرا که وصایای تو را نگاه داشتم. "},
	{101, "101  پایهای خود را از هر راه بد نگاه داشتم تا آن که کلام تو را حفظ کنم. "},
	{102, "102  از داوریهای تو رو برنگردانیدم، زیرا که تو مرا تعلیم دادی. "},
	{103, "103  کلام تو به مذاق من چه شیرین است و به دهانم از عسل شیرینتر. "},
	{104, "104  از وصایای تو فطانت را تحصیل کردم. بنابراین هر راه دروغ را مکروه می‌دارم. "},
	{105, "105  [ن] کلام تو برای پایهای من چراغ، و برای راه‌های من نور است. "},
	{106, "106  قسم خوردم و آن را وفا خواهم نمود که داوریهای عدالت تو را نگاه خواهم داشت. "},
	{107, "107  بسیار ذلیل شده‌ام. ای خداوند، موافق کلام خود مرا زنده ساز! "},
	{108, "108  ای خداوند هدایای تَبَرُّعی دهان مرا منظور فرما و داوریهای خود را به من بیاموز. "},
	{109, "109  جان من همیشه در کف من است، لیکن شریعت تو را فراموش نمی‌کنم. "},
	{110, "110  شریران برای من دام گذاشته‌اند، امّا از وصایای تو گمراه نشدم. "},
	{111, "111  شهادات تو را تا به ابد میراث خود ساخته‌ام زیرا که آنها شادمانی دل من است. "},
	{112, "112  دل خود را برای بجا آوردن فرایض تو مایل ساختم، تا ابدالآباد و تا نهایت. "},
	{113, "113  [س] مردمانِ دو رو را مکروه داشته‌ام، لیکن شریعت تو را دوست می‌دارم. "},
	{114, "114  ستر و سپر من تو هستی. به کلام تو انتظار می‌کشم. "},
	{115, "115  ای بدکاران، از من دور شوید! و اوامر خدای خویش را نگاه خواهم داشت. "},
	{116, "116  مرا به حسب کلامخود تأیید کن تا زنده شوم و از امید خود خجل نگردم. "},
	{117, "117  مرا تقویّت کن تا رستگار گردم و بر فرایض تو دائماً نظر نمایم. "},
	{118, "118  همهٔ کسانی را که از فرایض تو گمراه شده‌اند، حقیر شمرده‌ای زیرا که مکر ایشان دروغ است. "},
	{119, "119  جمیع شریران زمین را مثل دُرد هلاک می‌کنی. بنابراین شهادات تو را دوست می‌دارم. "},
	{120, "120  موی بدن من از خوف تو برخاسته است و از داوریهای تو ترسیدم. "},
	{121, "121  [ع] داد و عدالت را به جا آوردم. مرا به ظلمکنندگانم تسلیم منما. "},
	{122, "122  برای سعادت بندهٔ خود ضامن شو تا متکبّران بر من ظلم نکنند. "},
	{123, "123  چشمانم برای نجات تو تار شده است و برای کلام عدالت تو. "},
	{124, "124  با بندهٔ خویش موافق رحمانیّتت عمل نما و فرایض خود را به من بیاموز. "},
	{125, "125  من بندهٔ تو هستم. مرا فهیم گردان تا شهادات تو را دانسته باشم. "},
	{126, "126  وقت است که خداوند عمل کند زیرا که شریعت تو را باطل نموده‌اند. "},
	{127, "127  بنابراین، اوامر تو را دوست می‌دارم، زیادتر از طلا و زر خالص. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view120() {
struct fa120 poems[] = {
	{1, "1  [سرود درجات] نزد خداوند در تنگی خود فریاد کردم و مرا اجابت فرمود. "},
	{2, "2  ای خداوند جان مرا خلاصی ده از لب دروغ و از زبان حیلهگر. "},
	{3, "3  چه چیز به تو داده شود و چه چیز بر تو افزوده گردد، ای زبان حیلهگر؟ "},
	{4, "4  تیرهای تیز جبّاران با اخگرهای طاق! "},
	{5, "5  وای بر من که در ماشک مأوا گزیده‌ام و در خیمه‌های قیدار ساکن شده‌ام. "},
	{6, "6  چه طویل شد سکونت جان من با کسی که سلامتی را دشمن می‌دارد! "},
	{7, "7  من از اهل سلامتی هستم، لیکن چونسخن می‌گویم، ایشان آماده جنگ می‌باشند. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view121() {
struct fa121 poems[] = {
	{1, "1  [سرود درجات] چشمان خود را به سوی کوه‌ها برمیافرازم، که از آنجا اعانت من می‌آید. "},
	{2, "2  اعانت من از جانب خداوند است، که آسمان و زمین را آفرید. "},
	{3, "3  او نخواهد گذاشت که پای تو لغزش خورد. او که حافظ توست نخواهد خوابید. "},
	{4, "4  اینک، او که حافظ اسرائیل است، نمی‌خوابد و به خواب نمی‌رود. "},
	{5, "5  خداوند حافظ تو می‌باشد. خداوند به دست راستت سایه تو است. "},
	{6, "6  آفتاب در روز به تو اذّیت نخواهد رسانید و نه ماهتاب در شب. "},
	{7, "7  خداوند تو را از هر بدی نگاه می‌دارد. او جان تو را حفظ خواهد کرد. "},
	{8, "8  خداوند خروج و دخولت را نگاه خواهد داشت، از الآن و تا ابدالآباد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view122() {
struct fa122 poems[] = {
	{1, "1  [سرود درجات از داود] شادمان می‌شدم چون به من می‌گفتند، به خانهٔ خداوند برویم. "},
	{2, "2  پایهای ما خواهد ایستاد، به اندرون دروازه‌های تو، ای اورشلیم! "},
	{3, "3  ای اورشلیم که بنا شده‌ای مثل شهری که تماماً با هم پیوسته باشد، "},
	{4, "4  که بدانجا اسباط بالا می‌روند، یعنی اسباط یاه، تا شهادت باشد برای اسرائیل و تا نام یهوّه را تسبیح بخوانند. "},
	{5, "5  زیرا که در آنجا کرسیهای داوری بر پا شده است، یعنی کرسیهای خاندان داود "},
	{6, "6  .6 برای سلامتی اورشلیم مسألت کنید. آنانیکه تو را دوست می‌دارند، خجسته حال خواهند شد. "},
	{7, "7  سلامتی در باره‌های تو باشد، و رفاهیّت در قصرهای تو. "},
	{8, "8  به خاطر برادران و یاران خویش، می‌گویم که سلامتی بر تو باد. "},
	{9, "9  به خاطرخانهٔ یهوّه خدای ما، سعادت تو را خواهم طلبید. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view123() {
struct fa123 poems[] = {
	{1, "1  [سرود درجات] به سوی تو چشمان خود را برمیافرازم، ای که بر آسمانها جلوس فرموده‌ای! "},
	{2, "2  اینک، مثل چشمان غلامان به سوی آقایان خود، و مثل چشمان کنیزی به سوی خاتون خویش، همچنان چشمان ما به سوی یهوّه خدای ماست تا بر ما کرم بفرماید. "},
	{3, "3  ای خداوند بر ما کرم فرما، بر ما کرم فرما زیرا چه بسیار از اهانت پر شده‌ایم. "},
	{4, "4  چه بسیار جان ما پر شده است، از استهزای مُستَریحان و اهانت متکبّران. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view124() {
struct fa124 poems[] = {
	{1, "1  [سرود درجات از داود] اگر خداوند با ما نمی‌بود، اسرائیل الآن بگوید؛ "},
	{2, "2  اگر خداوند با ما نمی‌بود، وقتی‌که آدمیان با ما مقاومت نمودند، "},
	{3, "3  آنگاه هر آینه ما را زنده فرو می‌بردند، چون خشم ایشان بر ما افروخته بود. "},
	{4, "4  آنگاه آبها ما را غرق می‌کرد و نهرها بر جان ما می‌گذشت. "},
	{5, "5  آنگاه آبهای پر زور، از جان ما می‌گذشت. "},
	{6, "6  متبارک باد خداوند که ما را شکار برای دندانهای ایشان نساخت. "},
	{7, "7  جان ما مثل مرغ از دام صیّادان خلاص شد. دام گسسته شد و ما خلاصییافتیم. "},
	{8, "8  اعانت ما به نام یهوّه است، که آسمان و زمین را آفرید. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view125() {
struct fa125 poems[] = {
	{1, "1  [سرود درجات] آنانی که بر خداوند توکّل دارند،مثل کوه صهیوناند که جنبش نمی‌خورد و پایدار است تا ابدالآباد. "},
	{2, "2  کوه‌ها گرداگرد اورشلیم است؛ و خداوند گرداگرد قوم خود، از الآن و تا ابدالآباد است. "},
	{3, "3  زیرا که عصای شریران بر نصیب عادلان قرار نخواهد گرفت، مبادا عادلان دست خود را به گناه دراز کنند. "},
	{4, "4  ای خداوند به صالحان احسان فرما و به آنانی که راست دل می‌باشند. "},
	{5, "5  و امّا آنانی که به راه‌های کج خود مایل می‌باشند، خداوند ایشان را با بدکاران رهبری خواهد نمود. سلامتی بر اسرائیل باد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view126() {
struct fa126 poems[] = {
	{1, "1  [سرود درجات] چون خداوند اسیران صهیون را باز آورد، مثل خواب بینندگان شدیم. "},
	{2, "2  آنگاه دهان ما از خنده پر شد و زبان ما از ترنّم. آنگاه در میان امّت‌ها گفتند که خداوند با ایشان کارهای عظیم کرده است. "},
	{3, "3  خداوند برای ما کارهای عظیم کرده است که از آنها شادمان هستیم. "},
	{4, "4  ای خداوند اسیران ما را باز آور، مثل نهرها در جنوب. "},
	{5, "5  آنانی که با اشکها می‌کارند، با ترنّم درو خواهند نمود. "},
	{6, "6  آنکه با گریه بیرون می‌رود و تخم برای زراعت می‌برد، هر آینه با ترنّم خواهد برگشت و بافه‌های خویش را خواهد آورد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view127() {
struct fa127 poems[] = {
	{1, "1  [سرود درجات از سلیمان] اگر خداوند خانه را بنا نکند،بنّایانش زحمت بی‌فایده می‌کشند. اگر خداوند شهر را پاسبانی نکند، پاسبانان بی‌فایده پاسبانی می‌کنند. "},
	{2, "2  بی‌فایده است که شما صبح زود برمی‌خیزید و شب دیر می‌خوابید و نان مشقّت را می‌خورید. همچنان محبوبان خویش را خواب می‌بخشد. "},
	{3, "3  اینک، پسرانْ میراث از جانب خداوند می‌باشند و ثمرهٔ رَحِم، اجرتی از اوست. "},
	{4, "4  مثل تیرها در دست مرد زور آور، همچنان هستند پسران جوانی. "},
	{5, "5  خوشابحال کسی که ترکش خود را از ایشان پر کرده است. خجل نخواهند شد، بلکه با دشمنان، در دروازه سخن خواهند راند. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view128() {
struct fa128 poems[] = {
	{1, "1  [سرود درجات] خوشابحال هر که از خداوند می‌ترسد و بر طریق‌های او سالک می‌باشد. "},
	{2, "2  عمل دستهای خود را خواهی خورد. خوشابحال تو و سعادت با تو خواهد بود. "},
	{3, "3  زن تو مثل مو بارآور به اطراف خانهٔ تو خواهد بود و پسرانت مثل نهالهای زیتون، گرداگرد سفرهٔ تو. "},
	{4, "4  اینک، همچنین مبارک خواهد بود کسی که از خداوند می‌ترسد. "},
	{5, "5  خداوند تو را از صهیون برکت خواهد داد، و در تمام ایّام عمرت سعادت اورشلیم را خواهی دید. "},
	{6, "6  پسرانِ پسران خود را خواهی دید. سلامتی بر اسرائیل باد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view129() {
struct fa129 poems[] = {
	{1, "1  [سرود درجات] چه بسیار از طفولیّتم مرا اذیّت رسانیدند. اسرائیل الآن بگویند، "},
	{2, "2  چه بسیار از طفولیّتم مرا اذیّت رسانیدند. لیکن بر من غالب نیامدند. "},
	{3, "3  شیار کنندگان بر پشت من شیار کردند، و شیارهای خود را دراز نمودند. "},
	{4, "4  امّا خداوند عادل است و بندهای شریران را گسیخت. "},
	{5, "5  خجل و برگردانیده شوند همهٔ کسانی که از صهیون نفرت دارند. "},
	{6, "6  مثل گیاه بر پشتبامها باشند، که پیش از آن که آن را بچینند میخشکد. "},
	{7, "7  که درونده دست خود را از آن پر نمی‌کند و نه دسته بند آغوش خود را. "},
	{8, "8  و راه‌گذران نمی‌گویند برکت خداوند بر شما باد. شما را به نام خداوند مبارک می‌خوانیم. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view130() {
struct fa130 poems[] = {
	{1, "1  [سرود درجات] ای خداوند از عمق‌ها نزد تو فریاد برآوردم. "},
	{2, "2  ای خداوند! آواز مرا بشنو و گوشهای تو به آواز تضرّع من ملتفت شود. "},
	{3, "3  ای یاه، اگر گناهان را به نظر آوری، کیست ای خداوند که به حضور تو بایستد؟ "},
	{4, "4  لیکن مغفرت نزد توست تا از تو بترسند. "},
	{5, "5  منتظر خداوند هستم. جان من منتظر است و به کلام او امیدوارم. "},
	{6, "6  جان من منتظر خداوند است، زیاده از منتظران صبح؛ بلی زیاده از منتظران صبح. "},
	{7, "7  اسرائیل برای خداوند امیدوار باشند زیرا که رحمت نزد خداوند است و نزد اوست نجات فراوان. "},
	{8, "8  و او اسرائیل را فدیه خواهد داد، از جمیع گناهان وی. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view131() {
struct fa131 poems[] = {
	{1, "1  [سرود درجات از داود] ای خداوند، دل من متکبّر نیست و نه چشمانم برافراشته و خویشتن را به کارهای بزرگ مشغول نساختم، و نه به کارهایی که از عقل من بعید است. "},
	{2, "2  بلکه جان خود را آرام و ساکت ساختم، مثل بچهای از شیر باز داشته شده، نزد مادر خود. جانم در من بود، مثل بچه از شیر بازداشته شده. "},
	{3, "3  اسرائیل بر خداوند امیدوار باشند، از الآن و تا ابدالآباد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view132() {
struct fa132 poems[] = {
	{1, "1  [سرود درجات] ای خداوند برای داود به یاد آور،همهٔ مذلّتهای او را. "},
	{2, "2  چگونه برای خداوند قسم خورد و برای قادر مطلق یعقوب نذر نمود "},
	{3, "3  که به خیمهٔٔ خانهٔ خود هرگز داخل نخواهم شد، و بر بستر تختخواب خود برنخواهم آمد، "},
	{4, "4  خواب به چشمان خود نخواهم داد و نه پینکی به مژگان خویش، "},
	{5, "5  تا مکانی برای خداوند پیدا کنم و مسکنی برای قادر مطلق یعقوب. "},
	{6, "6  اینک، ذکر آن را در افراته شنیدیم و آن را در صحرای یعاریم یافتیم. "},
	{7, "7  به مسکنهای او داخل شویم و نزد قدمگاه وی پرستش نماییم. "},
	{8, "8  ای خداوند به آرامگاه خود برخیز و بیا، تو و تابوت قوّت تو. "},
	{9, "9  کاهنانِ تو به عدالت ملبّس شوند و مقّدسانت ترنّم نمایند. "},
	{10, "10  به خاطر بندهٔ خود داود، روی مسیح خود را برمگردان. "},
	{11, "11  خداوند برای داود به راستی قسم خورد و از آن برنخواهد گشت که از ثمرهٔ صُلب تو بر تخت تو خواهم گذاشت. "},
	{12, "12  اگر پسران تو عهد مرا نگاه دارند و شهاداتم را که بدیشان می‌آموزم، پسران ایشان نیز بر کرسی تو تا به ابد خواهند نشست. "},
	{13, "13  زیرا که خداوند صهیون را برگزیده است و آن را برای مسکن خویش مرغوب فرموده. "},
	{14, "14  این است آرامگاه من تا ابدالآباد. اینجا ساکن خواهم بود زیرا در این رغبت دارم. "},
	{15, "15  آذوقه آن را هرآینه برکت خواهم داد و فقیرانش را به نان سیر خواهم ساخت، "},
	{16, "16  و کاهنانش را به نجات ملبّس خواهم ساخت و مقدّسانش هرآینه ترنّم خواهند نمود. "},
	{17, "17  در آنجا شاخ داود را خواهم رویانید و چراغی برای مسیح خود آماده خواهم ساخت. "},
	{18, "18  دشمنان او را به خجالت ملبّس خواهم ساخت و تاج او بر وی شکوفه خواهد آورد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view133() {
struct fa133 poems[] = {
	{1, "1  [سرود درجات از داود] اینک، چه خوش و چه دلپسند است که برادران به یکدلی با هم ساکن شوند. "},
	{2, "2  مثل روغنِ نیکو بر سر است که به ریش فرود می‌آید، یعنی به ریش هارون که به دامن ردایش فرود می‌آید. "},
	{3, "3  و مثل شبنم حرمون است که بر کوه‌های صهیون فرود می‌آید. زیرا که در آنجا خداوند برکت خود را فرموده است، یعنی حیات را تا ابدالآباد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view134() {
struct fa134 poems[] = {
	{1, "1  [سرود درجات] هان خداوند را متبارک خوانید، ای جمیع بندگان خداوند که شبانگاه در خانهٔ خداوند میایستید! "},
	{2, "2  دستهای خود را به قدس برافرازید، و خداوند را متبارک خوانید. "},
	{3, "3  خداوند که آسمان و زمین را آفرید، تو را از صهیون برکت خواهد داد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view135() {
struct fa135 poems[] = {
	{1, "1  هلّلویاه، نام خداوند را تسبیح بخوانید! ای بندگان خداوند تسبیح بخوانید! "},
	{2, "2  ای شما که در خانهٔ خداوند میایستید، در صحنهای خانهٔ خدای ما. "},
	{3, "3  هلّلویاه، زیرا خداوند نیکو است! نام او را بسرایید زیرا که دلپسند است. "},
	{4, "4  زیرا که خداوند یعقوب را برای خود برگزید، و اسرائیل را بجهت ملکِ خاصِّ خویش. "},
	{5, "5  زیرا می‌دانم که خداوند بزرگ است و خداوند ما برتر است از جمیع خدایان. "},
	{6, "6  هر آنچه خداوند خواست آن را کرد، در آسمان و در زمین و در دریا و در همهٔ لجّه‌ها. "},
	{7, "7  ابرها را از اقصای زمین برمی‌آوَرَد و برقها را برای باران می‌سازد و بادها را از مخزنهای خویش بیرون می‌آورد. "},
	{8, "8  که نخستزادگان مصر را کشت، هم از انسان هم از بهایم. "},
	{9, "9  آیات و معجزات را در وسط تو ای مصر فرستاد، بر فرعون و بر جمیع بندگان وی. "},
	{10, "10  که امّت‌های بسیار را زد و پادشاهان عظیم را کشت. "},
	{11, "11  سیحون پادشاه اموریان و عوج پادشاه باشان وجمیع ممالک کنعان را. "},
	{12, "12  و زمین ایشان را به میراث داد، یعنی به میراث قوم خود اسرائیل. "},
	{13, "13  ای خداوند، نام توست تا ابدالآباد؛ و ای خداوند، یادگاری توست تا جمیع طبقات. "},
	{14, "14  زیرا خداوند قوم خود را داوری خواهد نمود و بر بندگان خویش شفقت خواهد فرمود. "},
	{15, "15  بتهای امّت‌ها طلا و نقره می‌باشند، عمل دستهای انسان. "},
	{16, "16  دهنها دارند و سخن نمی‌گویند؛ چشمان دارند و نمی‌بینند؛ "},
	{17, "17  گوشها دارند و نمی‌شنوند، بلکه در دهان ایشان هیچ نَفَس نیست. "},
	{18, "18  سازندگان آنها مثل آنها می‌باشند و هرکه بر آنها توکّل دارد. "},
	{19, "19  ای خاندان اسرائیل، خداوند را متبارک خوانید. ای خاندان هارون، خداوند را متبارک خوانید. "},
	{20, "20  ای خاندان لاوی، خداوند را متبارک خوانید. ای ترسندگان خداوند، خداوند را متبارک خوانید. "},
	{21, "21  خداوند از صهیون متبارک باد، که در اورشلیم ساکن است. هلّلویاه. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view136() {
struct fa136 poems[] = {
	{1, "1  خداوند را حمد گویید زیرا که نیکو است و رحمت او تا ابدالآباد است. "},
	{2, "2  خدای خدایان را حمد گویید، زیرا که رحمت او تا ابدالآباد است. "},
	{3, "3  ربّ الارباب را حمد گویید، زیرا که رحمت او تا ابدالآباد است. "},
	{4, "4  او را که تنها کارهای عجیب عظیم می‌کند، زیرا که رحمت او تا ابدالآباد است. "},
	{5, "5  او را که آسمانها را به حکمت آفرید، زیرا که رحمت او تا ابدالآباد است. "},
	{6, "6  او را که زمین را بر آبها گسترانید، زیرا که رحمت او تا ابدالآباد است. "},
	{7, "7  او را که نیّرهای بزرگ آفرید زیرا که رحمت او تا ابدالآباد است. "},
	{8, "8  آفتاب را برای سلطنت روز، زیرا که رحمت او تا ابدالآباد است. "},
	{9, "9  ماه و ستارگان را برای سلطنت شب، زیرا که رحمت او تا ابدالآباد است. "},
	{10, "10  که مصر را در نخستزادگانش زد، زیرا که رحمت او تا ابدالآباد است. "},
	{11, "11  و اسرائیل را از میان ایشان بیرون آورد، زیرا که رحمت او تا ابدالآباد است. "},
	{12, "12  با دست قویّ و بازوی دراز، زیرا که رحمت او تا ابدالآباد است. "},
	{13, "13  او را که بحر قلزم را به دو بهره تقسیم کرد، زیرا که رحمت او تا ابدالآباد است. "},
	{14, "14  و اسرائیل را از میان آن گذرانید، زیرا که رحمت او تا ابدالآباد است. "},
	{15, "15  و فرعون و لشکر او را در بحرقلزم انداخت، زیرا که رحمت او تا ابدالآباد است. "},
	{16, "16  او را که قوم خویش را در صحرا رهبری نمود، زیرا که رحمت او تاابدالآباد است. "},
	{17, "17  او را که پادشاهان بزرگ را زد، زیرا که رحمت او تا ابدالآباد است. "},
	{18, "18  و پادشاهان ناموَر را کشت، زیرا که رحمت او تا ابدالآباد است. "},
	{19, "19  سیحون پادشاه اموریان را، زیرا که رحمت او تا ابدالآباد است. "},
	{20, "20  و عوج پادشاه باشان را، زیرا که رحمت او تا ابدالآباد است. "},
	{21, "21  و زمین ایشان را به ارثیّت داد، زیرا که رحمت او تا ابدالآباد است. "},
	{22, "22  یعنی به ارثیّت بندهٔ خویش اسرائیل، زیرا که رحمت او تا ابدالآباد است. "},
	{23, "23  و ما را در مذلّت ما به یاد آورد، زیرا که رحمت او تا ابدالآباد است. "},
	{24, "24  و مارا از دشمنان ما رهایی داد، زیرا که رحمت او تا ابدالآباد است. "},
	{25, "25  که همهٔ بشر را روزی می‌دهد، زیرا که رحمت او تا ابدالآباد است. "},
	{26, "26  خدای آسمانها را حمد گویید، زیرا که رحمت او تا ابدالآباد است. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view137() {
struct fa137 poems[] = {
	{1, "1  نزد نهرهای بابل آنجا نشستیم و گریه نیز کردیم، چون صهیون را به یاد آوردیم. "},
	{2, "2  بربطهای خود را آویختیم بر درختان بید که در میان آنها بود. "},
	{3, "3  زیرا آنانی که ما را به اسیری برده بودند، در آنجا از ما سرود خواستند؛ و آنانی که ما را تاراج کرده بودند، شادمانی [خواستند] که یکی از سرودهای صهیون را برای ما بسرایید. "},
	{4, "4  چگونه سرود خداوند را، در زمین بیگانه بخوانیم؟ "},
	{5, "5  اگر تو را ای اورشلیم فراموش کنم، آنگاه دست راست من فراموش کند. "},
	{6, "6  اگر تو را به یاد نیاورم، آنگاه زبانم به کامم بچسبد، اگر اورشلیم را بر همهٔ شادمانی خود ترجیح ندهم. "},
	{7, "7  ای خداوند، روز اورشلیم را برای بنیادوم به یاد آور، که گفتند، منهدم سازید، تا بنیادش منهدم سازید! "},
	{8, "8  ای دختر بابل که خراب خواهی شد، خوشابحال آنکه به تو جزا دهد چنانکه تو به ما جزا دادی! "},
	{9, "9  خوشابحال آنکه اطفال تو را بگیرد و ایشان را به صخره‌ها بزند. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view138() {
struct fa138 poems[] = {
	{1, "1  [مزمور داود] تو را به تمامیِ دل خود حمد خواهم گفت. به حضور خدایان تو را حمد خواهم گفت. "},
	{2, "2  به سوی هیکل قدس تو عبادت خواهم کرد و نام تو را حمد خواهم گفت، به‌سبب رحمت و راستیِ تو. زیرا کلام خویش را بر تمام اسم خود تمجید نموده‌ای. "},
	{3, "3  در روزی که تو را خواندم مرا اجابت فرمودی. و مرا با قوّت در جانم شجاع ساختی. "},
	{4, "4  ای خداوند، تمام پادشاهان جهان تو را حمد خواهند گفت، چون کلام دهان تو را بشنوند. "},
	{5, "5  و طریق‌های خداوند را خواهند سرایید، زیرا که جلال خداوند عظیم است. "},
	{6, "6  زیراکه خداوند متعال است، لیکن بر فروتنان نظر می‌کند. و امّا متکبّران را از دور می‌شناسد. "},
	{7, "7  اگر چه در میان تنگی راه می‌روم، مرا زنده خواهی کرد. دست خود را بر خشم دشمنانم دراز می‌کنی و دست راستت مرا نجات خواهد داد. "},
	{8, "8  خداوند کار مرا به کمال خواهد رسانید. ای خداوند، رحمت تو تا ابدالآباد است. کارهای دست خویش را ترک منما. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view139() {
struct fa139 poems[] = {
	{1, "1  [برای سالار مغنّیان. مزمور داود] ای خداوند مرا آزموده و شناختهای. "},
	{2, "2  تو نشستن و برخاستن مرا می‌دانی و فکرهای مرا از دور فهمیده‌ای. "},
	{3, "3  راه و خوابگاه مرا تفتیش کرده‌ای و همهٔ طریق‌های مرا دانسته‌ای. "},
	{4, "4  زیرا که سخنی بر زبان من نیست، جز اینکه تو ای خداوند آن را تماماً دانسته‌ای. "},
	{5, "5  از عقب و از پیش مرا احاطه کرده‌ای و دست خویش را بر من نهاده‌ای. "},
	{6, "6  این گونه معرفت برایم زیاده عجیب است. و بلند است که بدان نمی‌توانم رسید. "},
	{7, "7  از روح تو کجا بروم؟ و از حضور تو کجا بگریزم؟ "},
	{8, "8  اگر به آسمان صعود کنم، تو آنجا هستی! و اگر در هاویه بستر بگسترانم اینک، تو آنجا هستی! "},
	{9, "9  اگر بالهای سحر را بگیرم و در اقصای دریا ساکن شوم، "},
	{10, "10  در آنجا نیز دست تو مرا رهبری خواهد نمود و دست راست تو مرا خواهد گرفت. "},
	{11, "11  و گفتم، یقیناً تاریکی مرا خواهد پوشانید. که در حال شب گرداگرد من روشنایی گردید. "},
	{12, "12  تاریکی نیز نزد تو تاریک نیست و شب مثل روز روشن است و تاریکی و روشنایی یکی است. "},
	{13, "13  زیرا که تو بر دل من مالک هستی؛ مرا در رحم مادرم نقش بستی. "},
	{14, "14  تو را حمد خواهم گفت زیرا که به طور مَهیب و عجیب ساخته شده‌ام. کارهای تو عجیب است و جان من این را نیکو می‌داند. "},
	{15, "15  استخوانهایم از تو پنهان نبود وقتی که در نهان ساخته می‌شدم و در اسفل زمین نقشبندی می‌گشتم. "},
	{16, "16  چشمان تو جنین مرا دیده‌است و در دفتر تو همهٔ اعضای من نوشته شده، در روزهایی که ساخته می‌شد، وقتی که یکی از آنها وجود نداشت. "},
	{17, "17  ای خدا، فکرهای تو نزد من چه قدر گرامی است و جمله آنها چه عظیم است! "},
	{18, "18  اگر آنها را بشمارم، از ریگ زیاده است. وقتی‌که بیدار می‌شوم هنوز نزد تو حاضر هستم. "},
	{19, "19  یقیناً ای خدا شریران را خواهی کشت. پس ای مردمان خون ریز از من دور شوید. "},
	{20, "20  زیرا سخنان مکرآمیز دربارهٔ تو می‌گویند و دشمنانت نام تو را به باطل می‌برند. "},
	{21, "21  ای خداوند آیا نفرت نمی‌دارم از آنانی که تو را نفرت می‌دارند، و آیا مخالفان تو را مکروه نمی‌شمارم؟ "},
	{22, "22  ایشان را به نفرت تام نفرت می‌دارم. ایشان را دشمنان خویشتن می‌شمارم. "},
	{23, "23  ای خدا مرا تفتیش کن و دل مرا بشناس. مرا بیازما و فکرهای مرا بدان، "},
	{24, "24  و ببین که آیا در من راه فساد است! و مرا به طریق جاودانی هدایت فرما. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view140() {
struct fa140 poems[] = {
	{1, "1  [برای سالار مغنّیان. مزمور داود] ای خداوند، مرا از مرد شریر رهایی ده و از مرد ظالم مرا محفوظ فرما! "},
	{2, "2  که در دلهای خود در شرارت تفکّر می‌کنند و تمامی روز برای جنگ جمع می‌شوند. "},
	{3, "3  دندانهای خود را مثل مار تیز می‌کنند و زهر افعی زیر لب ایشان است، سلاه. "},
	{4, "4  ای خداوند مرا از دست شریر نگاه دار، از مرد ظالم مرا محافظت فرما که تدبیر می‌کنند تا پایهای مرا بلغزانند. "},
	{5, "5  متکبّران برای من تله و ریسمانها پنهان کرده و دام به سر راه گسترده، و کمنده‌ا برای من نهاده‌اند، سلاه. "},
	{6, "6  به خداوند گفتم، تو خدای من هستی. ای خداوند، آواز تضرّع مرا بشنو! "},
	{7, "7  ای یهوّه خداوند که قوّت نجات من هستی، تو سر مرا در روز جنگ پوشانیده‌ای. "},
	{8, "8  ای خداوند، آرزوهای شریر را برایش برمیاور و تدابیر ایشان را به انجام مرسان مبادا سرافراشته شوند، سلاه. "},
	{9, "9  و امّا سرهای آنانی که مرا احاطه می‌کنند، شرارتِ لبهای ایشان، آنها را خواهد پوشانید. "},
	{10, "10  اخگرهای سوزنده را بر ایشان خواهند ریخت، ایشان را در آتش خواهند انداخت و در ژرفیها که دیگر نخواهند برخاست. "},
	{11, "11  مرد بدگو در زمین پایدار نخواهد شد. مرد ظالم را شرارت صید خواهد کرد تا او را هلاک کند. "},
	{12, "12  می‌دانم که خداوند دادرسی فقیر را خواهد کرد و داوری مسکینان را خواهد نمود. "},
	{13, "13  هر آینه عادلان نام تو را حمد خواهند گفت و راستان به حضور تو ساکن خواهند شد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view141() {
struct fa141 poems[] = {
	{1, "1  [مزمور داود] ای خداوند تو را می‌خوانم. نزد من بشتاب! و چون تو را بخوانم آواز مرا بشنو! "},
	{2, "2  دعای من به حضور تو مثل بخور آراسته شود، و برافراشتن دستهایم، مثل هدیه شام. "},
	{3, "3  ای خداوند، بر دهان من نگاهبانی فرما و در لبهایم را نگاه دار. "},
	{4, "4  دل مرا به عمل بد مایل مگردان تا مرتکب اعمال زشت با مردان بدکار نشوم. و از چیزهای لذیذ ایشان نخورم. "},
	{5, "5  مردِعادل مرا بزند و لطف خواهد بود، و مرا تأدیب نماید و روغن برای سر خواهد بود! و سر من آن را ابا نخواهد نمود زیرا که در بدیهای ایشان نیز دعای من دایم خواهد بود. "},
	{6, "6  چون داوران ایشان از سرِ صخره‌ها انداخته شوند، آنگاه سخنان مرا خواهند شنید زیرا که شیرین است. "},
	{7, "7  مثل کسی که زمین را فلاحت و شیار بکند، استخوانهای ما بر سر قبرها پراکنده می‌شود. "},
	{8, "8  زیرا که ای یهوه خداوند، چشمان من بسوی توست. و بر تو توکّل دارم. پس جان مرا تلف منما! "},
	{9, "9  مرا از دامی که برای من نهاده‌اند نگاه دار و از کمنده‌ای گناهکاران. "},
	{10, "10  شریران به دامهای خود بیفتند و من بسلامتی در بگذرم. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view142() {
struct fa142 poems[] = {
	{1, "1  [قصیده داود و دعا وقتی‌که در مغاره بود] به آواز خود نزد خداوند فریاد برمی‌آورم. به آواز خود نزد خداوند تضرّع می‌نمایم. "},
	{2, "2  ناله خود را در حضور او خواهم ریخت. تنگیهای خود را نزد او بیان خواهم کرد. "},
	{3, "3  وقتی که روح من در من مدهوش می‌شود. پس تو طریقت مرا دانسته‌ای. در راهی که می‌روم دام برای من پنهان کرده‌اند. "},
	{4, "4  به طرف راست بنگر و ببین که کسی نیست که مرا بشناسد. ملجا برای من نابود شد. کسی نیست که در فکر جان من باشد. "},
	{5, "5  نزد تو ای خداوند فریاد کردم و گفتم که تو ملجا و حصّهٔ من در زمین زندگان هستی. "},
	{6, "6  به ناله من توجّه کن زیرا که بسیار ذلیلم! مرا از جفاکنندگانم برهان، زیرا که از من زورآورترند. "},
	{7, "7  جان مرا از زندان درآور تا نام تو راحمد گویم. عادلان گرداگرد من خواهند آمد زیرا که به من احسان نموده‌ای. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view143() {
struct fa143 poems[] = {
	{1, "1  [مزمور داود] ای خداوند دعای مرا بشنو و به تضرّع من گوش بده! در امانت و عدالت خویش مرا اجابت فرما! "},
	{2, "2  و بر بندهٔ خود به محاکمه برمیا. زیرا زنده‌ای نیست که به حضور تو عادل شمرده شود. "},
	{3, "3  زیرا که دشمن بر جان من جفا کرده، حیات مرا به زمین کوبیده است و مرا در ظلمت ساکن گردانیده، مثل آنانی که مدّتی مرده باشند. "},
	{4, "4  پس روح من در من مدهوش شده، و دلم در اندرونم متحیّر گردیده است. "},
	{5, "5  ایّام قدیم را به یاد می‌آورم. در همهٔ اعمال تو تفکّر نموده، در کارهای دست تو تأمّل می‌کنم. "},
	{6, "6  دستهای خود را بسوی تو دراز می‌کنم. جان من مثلِ زمینِ خشک، تشنه تو است، سلاه. "},
	{7, "7  ای خداوند، بزودی مرا اجابت فرما زیرا روح من کاهیده شده است. روی خود را از من مپوشان، مبادا مثل فروروندگان به هاویه بشوم. "},
	{8, "8  بامدادان رحمت خود را به من بشنوان زیرا که بر تو توکّل دارم. طریقی را که برآن بروم، مرا بیاموز زیرا نزد تو جان خود را برمیافرازم. "},
	{9, "9  ای خداوند مرا از دشمنانم برهان زیرا که نزد تو پناه برده‌ام. "},
	{10, "10  مرا تعلیم ده تا ارادهٔ تو را بجا آورم زیرا خدای من تو هستی. روح مهربان تو مرا در زمین هموار هدایت بنماید. "},
	{11, "11  به خاطر نام خود ای خداوند مرا زنده ساز؛ به خاطر عدالت خویش جان مرا از تنگی برهان؛ "},
	{12, "12  و به خاطررحمت خود، دشمنانم را منقطع ساز. و همهٔ مخالفان جان مرا هلاک کن زیرا که من بندهٔ تو هستم. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view144() {
struct fa144 poems[] = {
	{1, "1  [مزمور داود] خداوند که صخره من است، متبارک باد؛ که دستهای مرا به جنگ و انگشته‌ای مرا به حرب تعلیم داد! "},
	{2, "2  رحمت من اوست و ملجای من و قلعه بلند من و رهاننده من و سپر من و آنکه بر او توکّل دارم، که قوم مرا در زیر اطاعت من می‌دارد. "},
	{3, "3  ای خداوند، آدمی چیست که او را بشناسی؟ و پسر انسان که او را به حساب بیاوری؟ "},
	{4, "4  انسان مثل نَفَسی است و روزهایش مثل سایهای است که می‌گذرد. "},
	{5, "5  ای خداوند آسمانهای خود را خم ساخته، فرود بیا. و کوه‌ها را لمس کن تا دود شوند. "},
	{6, "6  رعد را جهنده ساخته، آنها را پراکنده ساز. تیرهای خود را بفرست و آنها را منهزم نما. "},
	{7, "7  دست خود را از اعلی بفرست، و مرا رهانیده، از آبهای بسیار خلاصی ده، یعنی از دست پسران اجنبی "},
	{8, "8  که دهان ایشان به باطل سخن می‌گوید، و دست راست ایشان، دستِ دروغ است. "},
	{9, "9  ای خدا، تو را سرودی تازه میسرایم. با بربط ذات ده تار، تو را ترنّم خواهم نمود. "},
	{10, "10  که پادشاهان را نجات می‌بخشی، و بندهٔ خود داود را از شمشیر مهلک می‌رهانی. "},
	{11, "11  مرا از دست اجنبیان برهان و خلاصی ده، که دهان ایشان به باطل سخن می‌گوید و دست راست ایشان دست دروغ است. "},
	{12, "12  تا پسران ما درجوانیِ خود نموّ کرده، مثل نهالها باشند. و دختران ما مثل سنگهای زاویه تراشیده شده به مثال قصر. "},
	{13, "13  و انبارهای ما پر شده، به انواع نعمت ریزان شوند. و گله‌های ما هزارها و کرورها در صحراهای ما بزایند. "},
	{14, "14  و گاوان ما باربردار شوند و هیچ رخنه و خروج و نالهای در کوچه‌های ما نباشد. "},
	{15, "15  خوشابحال قومی که نصیب ایشان این است. خوشابحال آن قوم که یهوه خدای ایشان است. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view145() {
struct fa145 poems[] = {
	{1, "1  [تسبیح داود] ای خدای من، ای پادشاه، تو را متعال می‌خوانم و نام تو را متبارک می‌گویم، تا ابدالآباد! "},
	{2, "2  تمامی روز تو را متبارک می‌خوانم، و نام تو را حمد می‌گویم تا ابدالآباد. "},
	{3, "3  خداوند عظیم است و بی‌نهایت ممدوح، و عظمت او را تفتیش نتوان کرد. "},
	{4, "4  طبقه تا طبقه اعمال تو را تسبیح می‌خوانند و کارهای عظیم تو را بیان خواهند نمود. "},
	{5, "5  در مجد جلیل کبریایی تو و در کارهای عجیب تو تفکّر خواهم نمود. "},
	{6, "6  در قوّتِ کارهای مهیبِ تو سخن خواهند گفت. و من عظمت تو را بیان خواهم نمود. "},
	{7, "7  و یادگاری کثرت احسان تو را حکایت خواهند کرد. و عدالت تو را خواهند سرایید. "},
	{8, "8  خداوند کریم و رحیم است و دیر غضب و کثیرالاحسان. "},
	{9, "9  خداوند برای همگان نیکو است، و رحمتهای وی بر همهٔ اعمال وی است. "},
	{10, "10  ای خداوند جمیع کارهای تو، تو را حمد می‌گویند. و مقدّسان تو، تو را متبارک می‌خوانند. "},
	{11, "11  دربارهٔٔجلال ملکوت تو سخن می‌گویند و توانایی تو را حکایت می‌کنند. "},
	{12, "12  تا کارهای عظیم تو را به بنی‌آدم تعلیم دهند و کبریاییِ مجیدِ ملکوت تو را. "},
	{13, "13  ملکوت تو، ملکوتی است تا جمیع دهرها و سلطنت تو باقی تا تمام دورها. "},
	{14, "14  خداوند جمیع افتادگان را تأیید می‌کند و خمشدگان را برمی‌خیزاند. "},
	{15, "15  چشمان همگان منتظر تو می‌باشد و تو طعام ایشان را در موسمش می‌دهی. "},
	{16, "16  دست خویش را باز می‌کنی و آرزوی همهٔ زندگان را سیر می‌نمایی. "},
	{17, "17  خداوند عادل است در جمیع طریق‌های خود و رحیم در کّل اعمال خویش. "},
	{18, "18  خداوند نزدیک است به آنانیکه او را می‌خوانند، به آنانیکه او را به راستی می‌خوانند. "},
	{19, "19  آرزوی ترسندگان خود را بجا می‌آورد و تضّرع ایشان را شنیده، ایشان را نجات می‌دهد. "},
	{20, "20  خداوند همهٔ محبّان خود را نگاه می‌دارد و همهٔ شریران را هلاک خواهد ساخت. "},
	{21, "21  دهان من تسبیح خداوند را خواهد گفت و همهٔ بشر نام قدّوس او را متبارک بخوانند تا ابدالآباد. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view146() {
struct fa146 poems[] = {
	{1, "1  هلّلویاه! ای جان من خداوند را تسبیح بخوان! "},
	{2, "2  تا زنده هستم، خداوند را حمد خواهم گفت. مادامی که وجود دارم، خدای خود را خواهم سرایید. "},
	{3, "3  بر رؤسا توکّل مکنید و نه بر ابن آدم که نزد او اعانتی نیست. "},
	{4, "4  روح او بیرون می‌رود و او به خاک خود برمی‌گردد و در همان روز فکرهایش نابود می‌شود. "},
	{5, "5  خوشابحال آنکه خدای یعقوب مددکاراوست، که امید او بر یهوّه خدای وی می‌باشد، "},
	{6, "6  که آسمان و زمین را آفرید و دریا و آنچه را که در آنهاست؛ که راستی را نگاه دارد تا ابدالآباد؛ "},
	{7, "7  که مظلومان را دادرسی می‌کند؛ و گرسنگان را نان می‌بخشد. خداوند اسیران را آزاد می‌سازد. "},
	{8, "8  خداوند چشمان کوران را باز می‌کند. خداوند خم شدگان را برمیافرازد. خداوند عادلان را دوست می‌دارد. "},
	{9, "9  خداوند غریبان را محافظت می‌کند و یتیمان و بیوه زنان را پایدار می‌نماید. لیکن طریق شریران را کج می‌سازد. "},
	{10, "10  خداوند سلطنت خواهد کرد تا ابدالآباد و خدای تو ای صهیون، نسلاً بعد نسل. هلّلویاه! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view147() {
struct fa147 poems[] = {
	{1, "1  هلّلویاه، زیرا خدای ما را سراییدننیکو است و دلپسند، و تسبیح خواندن شایسته است! "},
	{2, "2  خداوند اورشلیم را بنا می‌کند و پراکندگان اسرائیل را جمع می‌نماید. "},
	{3, "3  شکسته دلان را شفا می‌دهد و جراحتهای ایشان را می‌بندد. "},
	{4, "4  عدد ستارگان را می‌شمارد و جمیع آنها را به نام می‌خواند. "},
	{5, "5  خداوند ما بزرگ است و قوّت او عظیم و حکمت وی غیرمتناهی. "},
	{6, "6  خداوند مسکینان را برمیافرازد و شریران را به زمین می‌اندازد. "},
	{7, "7  خداوند را با تشکّر بسرایید. خدای ما را با بربط سرود بخوانید. "},
	{8, "8  که آسمانها را با ابرها می‌پوشاند و باران را برای زمین مهیّا می‌نماید و گیاه را بر کوه‌ها می‌رویاند. "},
	{9, "9  که بهایم را آذوقه می‌دهد و بچّه‌های غراب را که او را می‌خوانند. "},
	{10, "10  در قوّت اسب رغبت ندارد، و از ساقهای انسان راضی نمی‌باشد. "},
	{11, "11  رضامندی خداوند از ترسندگان وی است و از آنانیکه به رحمت وی امیدوارند. "},
	{12, "12  ای اورشلیم، خداوند را تسبیح بخوان. ای صهیون، خدای خود را حمد بگو. "},
	{13, "13  زیرا که پشت بندهٔ‌ای دروازه‌هایت را مستحکم کرده و فرزندانت را در اندرونت مبارک فرموده است. "},
	{14, "14  که حدود تو را سلامتی می‌دهد و تو را از مغز گندم سیر می‌گرداند. "},
	{15, "15  که کلام خود را بر زمین فرستاده است و قول او به زودی هر چه تمامتر می‌دود. "},
	{16, "16  که برف را مثل پشم می‌باراند، و ژاله را مثل خاکستر می‌پاشد. "},
	{17, "17  که تگرگ خود را در قطعه‌ها می‌اندازد؛ و کیست که پیش سرمای او تواند ایستاد؟ "},
	{18, "18  کلام خود را می‌فرستد و آنها را می‌گدازد. باد خویش را میوزاند، پس آبها جاری می‌شود. "},
	{19, "19  کلام خود را به یعقوب بیان کرده، و فرایض و داوریهای خویش را به اسرائیل. "},
	{20, "20  با هیچ امّتی چنین نکرده است و داوریهای او را ندانسته‌اند. هلّلویاه! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view148() {
struct fa148 poems[] = {
	{1, "1  هلّلویاه! خداوند را از آسمانتسبیح بخوانید! در اعلی علیّین او را تسبیح بخوانید! "},
	{2, "2  ای همهٔ فرشتگانش او را تسبیح بخوانید. ای همهٔ لشکرهای او او را تسبیح بخوانید. "},
	{3, "3  ای آفتاب و ماه او را تسبیح بخوانید. ای همهٔ ستارگان نور او را تسبیح بخوانید. "},
	{4, "4  ای فلکالافلاک او را تسبیح بخوانید، و ای آبهایی که فوق آسمانهایید. "},
	{5, "5  نام خداوند را تسبیح بخوانند زیرا که او امر فرمود پس آفریده شدند. "},
	{6, "6  و آنها را پایدار نمود تا ابدالآباد و قانونی قرار داد که از آن در نگذرند. "},
	{7, "7  خداوند را از زمین تسبیح بخوانید، ای نهنگان و جمیع لجّه‌ها. "},
	{8, "8  ای آتش و تگرگ وبرف و مه و باد تند که فرمان او را به جا می‌آورید. "},
	{9, "9  ای کوه‌ها و تمام تلّها و درختان میوه‌دار و همهٔ سروهای آزاد. "},
	{10, "10  ای وحوش و جمیع بهایم و حشرات و مرغان بالدار. "},
	{11, "11  ای پادشاهان زمین و جمیع امّت‌ها و سروران و همهٔ داوران جهان. "},
	{12, "12  ای جوانان و دوشیزگان نیز و پیران و اطفال. "},
	{13, "13  نام خداوند را تسبیح بخوانند، زیرا نام او تنها متعال است و جلال او فوق زمین و آسمان. "},
	{14, "14  و او شاخی برای قوم خود برافراشته است، تا فخر باشد برای همهٔ مقدّسان او، یعنی برای بنی‌اسرائیل که قوم مقرّب او می‌باشند. هلّلویاه! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view149() {
struct fa149 poems[] = {
	{1, "1  هلّلویاه! خداوند را سرود تازهبسرایید و تسبیح او را در جماعت مقدّسان! "},
	{2, "2  اسرائیل در آفریننده خود شادی کنند و پسران صهیون در پادشاه خویش وجد نمایند. "},
	{3, "3  نام او را با رقص تسبیح بخوانند. با بربط و عود او را بسرایند. "},
	{4, "4  زیرا خداوند از قوم خویش رضامندی دارد. مسکینان را به نجاتْ جمیل می‌سازد. "},
	{5, "5  مقدّسان از جلال فخر بنمایند. و بر بسترهای خود ترنّم بکنند. "},
	{6, "6  تسبیحات بلند خدا در دهان ایشان باشد. و شمشیر دو دمه در دست ایشان. "},
	{7, "7  تا از امّت‌ها انتقام بکشند و تأدیبها بر طوایف بنمایند. "},
	{8, "8  و پادشاهان ایشان را به زنجیرها ببندند و سروران ایشان را به پابندهای آهنین. "},
	{9, "9  و داوری را که مکتوب است بر ایشان اجرا دارند. این کرامت است برای همهٔ مقدّسان او. هلّلویاه! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view150() {
struct fa150 poems[] = {
	{1, "1  هلّلویاه! خدا را در قدس او تسبیحبخوانید. در فلکِ قوّت او، او را تسبیح بخوانید! "},
	{2, "2  او را به‌سبب کارهای عظیم او تسبیح بخوانید. او را به حسب کثرت عظمتش تسبیح بخوانید. "},
	{3, "3  او را به آواز کَرِنّا تسبیحبخوانید. او را با بربط و عود تسبیح بخوانید. "},
	{4, "4  او را با دف و رقص تسبیح بخوانید. او را با ذوات اوتار و نی تسبیح بخوانید. "},
	{5, "5  او را با صنجهای بلندآواز تسبیح بخوانید. او را با صنجهای خوشصدا تسبیح بخوانید. "},
	{6, "6  هرکه روح دارد، خداوند را تسبیح بخواند. هلّلویاه! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};