#include <map>
#include <string>
class Bible63
{
	struct fa1	{ int val; const char *msg; };
public:
static void view1() {
struct fa1 poems[] = {
	{1, "1  من که پیرم، به خاتون برگزیده و فرزندانش که ایشان را در راستی محبّت می‌نمایم، و نه من فقط بلکه همهٔٔ کسانی که راستی را می‌دانند، "},
	{2, "2  بخاطر آن راستی که در ما ساکن است و با ما تا به ابد خواهد بود. "},
	{3, "3  فیض و رحمت و سلامتی از جانب خدای پدر و عیسی مسیح خداوند و پسر پدر در راستی و محبّت با ما خواهد بود. "},
	{4, "4  بسیار مسرور شدم چونکه بعضی از فرزندان تو را یافتم که در راستی رفتار می‌کنند، چنانکه از پدر حکم یافتیم. "},
	{5, "5  و الآن ای خاتون از تو التماس دارم، نه آنکه حکمی تازه به تو بنویسم، بلکه همان را که از ابتداء داشتیم که یکدیگر را محبّت بنماییم. "},
	{6, "6  و این است محبّت که موافق احکام او سلوک بنماییم و حکم همان است که از اوّل شنیدید تا در آن سلوک نماییم. "},
	{7, "7  زیرا گمراه‌کنندگانِ بسیار به دنیا بیرون شدند که عیسی مسیح ظاهرشدهٔ در جسم را اقرار نمی‌کنند. آن است گمراه‌کننده و دجّال. "},
	{8, "8  خود را نگاه بدارید مبادا آنچه را که عمل کردیم برباد دهید بلکه تا اجرت کامل بیابید. "},
	{9, "9  هرکه پیشوایی می‌کند و در تعلیم مسیح ثابت نیست، خدا را نیافته است. امّا آنکه در تعلیم مسیح ثابت مانَد، او هم پدر و پسر را دارد. "},
	{10, "10  اگر کسی به نزد شما آید و این تعلیم را نیاوَرَد، او را به خانهٔ خود مپذیرید و او را تحیّت مگویید، "},
	{11, "11  زیرا هرکه او را تحیّت گوید، در کارهای قبیحش شریک گردد. "},
	{12, "12  چیزهای بسیار دارم که به شما بنویسم، لکن نخواستم که به کاغذ و مرکّب بنویسم، بلکه امیدوارم که به نزد شما بیایم و زبانی گفتگو نمایم تا خوشیِ ما کامل شود. "},
	{13, "13  فرزندانِ خواهرِ برگزیدهٔ تو، به تو سلام می‌رسانند. آمین. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};