#include <map>
#include <string>
class Bible57
{
	struct fa1	{ int val; const char *msg; };
public:
static void view1() {
struct fa1 poems[] = {
	{1, "1  پولُس، اسیر مسیح عیسی و تیمؤتاؤس برادر، به فِلیمون عزیز و همکار ما، "},
	{2, "2  و به اَپْفِیّهٔ محبوبه و اَرْخِپُّس هم‌سپاه ما و به کلیسایی که در خانه‌ات می‌باشد: "},
	{3, "3  فیض و سلامتی از جانب پدر ما خدا و عیسی مسیح خداوند با شما باد. "},
	{4, "4  خدای خود را شکر می‌کنم و پیوسته تو را در دعاهای خود یاد می‌آورم، "},
	{5, "5  چونکه ذکر محبّت و ایمان تو را شنیده‌ام که به عیسی خداوند و به همهٔ مقدّسین داری، "},
	{6, "6  تا شراکت ایمانت مؤثّر شود در معرفتِ کاملِ هر نیکویی که در ما است برای مسیحْ عیسی. "},
	{7, "7  زیرا که مرا خوشیِ کامل و تسلّی رخ نمود از محبّت تو، از آنرو که دلهای مقدّسین از تو ای برادر استراحت می‌پذیرند. "},
	{8, "8  بدین جهت، هرچند در مسیح کمال جسارت را دارم که به آنچه مناسب است تو را حکم دهم، "},
	{9, "9  لیکن برای محبّت، سزاوارتر آن است که التماس نمایم، هرچند مردی چون پولُسِ پیر و الآن اسیر مسیح عیسی نیز می‌باشم. "},
	{10, "10  پس تو را التماس می‌کنم دربارهٔٔ فرزند خود اُنیسیمُس، که در زنجیرهای خود او را تولید نمودم، "},
	{11, "11  که سابقاً او برای تو بی‌فایده بود، لیکن الحال تو را و مرا فایده‌مند می‌باشد؛ "},
	{12, "12  که او را نزد تو پس می‌فرستم. پس تو او را بپذیر، که جان من است. "},
	{13, "13  و من می‌خواستم که او را نزد خود نگاه دارم، تا به عوض تو مرا در زنجیرهای انجیل خدمت کند، "},
	{14, "14  امّا نخواستم کاری بدون رأی تو کرده باشم، تا احسان تو از راه اضطرار نباشد، بلکه از روی اختیار. "},
	{15, "15  زیرا که شاید بدین‌جهت ساعتی از تو جدا شد، تا او را تا به ابد دریابی. "},
	{16, "16  لیکن بعد از این نه چون غلام، بلکه فوق از غلام، یعنی برادر عزیز خصوصاً به من، امّا چند مرتبه زیادتر به تو، هم در جسم و هم در خداوند. "},
	{17, "17  پس هرگاه مرا رفیق می‌دانی، او را چون من قبول فرما. "},
	{18, "18  امّا اگر ضرری به تو رسانیده باشد یا طلبی از او داشته باشی، آن را بر من محسوب دار. "},
	{19, "19  من که پولُس هستم، به دست خود می‌نویسم، خود ادا خواهم کرد، تا به تو نگویم که به جان خود نیز مدیون من هستی. "},
	{20, "20  بلی، ای برادر، تا من از تو در خداوند برخوردار شوم. پس جان مرا در مسیح تازگی بده. "},
	{21, "21  چون بر اطاعت تو اعتماد دارم به تو می‌نویسم، از آن‌جهت که می‌دانم بیشتر از آنچه می‌گویم هم خواهی کرد. "},
	{22, "22  معهذا منزلی نیز برای من حاضر کن، زیرا که امیدوارم از دعاهای شما به شما بخشیده شوم. "},
	{23, "23  اِپَفْراس که در مسیح عیسی همزندان من است، و مرقُس "},
	{24, "24  و اَرِسْتَرخُس و دیماس و لوقا همکاران من تو را سلام می‌رسانند. "},
	{25, "25  فیض خداوند ما عیسی مسیح با روح شما باد. آمین. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};