#include <map>
#include <string>
class Bible34
{
	struct am1	{ int val; const char *msg; };
	struct am2	{ int val; const char *msg; };
	struct am3	{ int val; const char *msg; };
public:
static void view1() {
struct am1 poems[] = {
	{1, "1 ፤ ስለ ነነዌ የተነገረ ሸክም፤ የኤልቆሻዊው የናሆም የራእዩ መጽሐፍ ይህ ነው። "},
	{2, "2 ፤ እግዚአብሔር ቀናተኛና ተበቃይ አምላክ ነው፤ እግዚአብሔር ተበቃይና መዓትን የተሞላ ነው፤ እግዚአብሔር ተቃዋሚዎቹን ይበቀላል፥ ለጠላቶቹም ቍጣውን ይጠብቃል። "},
	{3, "3 ፤ እግዚአብሔር ትዕግሥተኛ፥ ኃይሉም ታላቅ ነው፥ በደለኛውንም። ንጹሕ ነህ አይልም፤ እግዚአብሔር በወጀብና በዐውሎ ነፋስ ውስጥ መንገድ አለው፥ ደመናም የእግሩ ትቢያ ነው። "},
	{4, "4 ፤ ባሕሩንም ይገሥጻታል፥ ያደርቃትማል፥ ወንዞችንም ሁሉ ያደርቃል፤ ባሳንና ቀርሜሎስም ላልተዋል፥ የሊባኖስም አበባ ጠውልጎአል። "},
	{5, "5 ፤ ተራሮችም ከእርሱ የተነሣ ታወኩ፥ ኮረብቶችም ቀለጡ፤ ምድርና ዓለም የሚኖሩበትም ሁሉ ከፊቱ ተናወጡ። "},
	{6, "6 ፤ በቍጣው ፊት የሚቆም ማን ነው? የቍጣውንም ትኵሳት ማን ይታገሣል? መዓቱ እንደ እሳት ይፈስሳል፥ ከእርሱም የተነሣ ዓለቶች ተሰነጠቁ። "},
	{7, "7 ፤ እግዚአብሔር መልካም ነው፥ በመከራ ቀንም መሸሸጊያ ነው፤ በእርሱ የሚታመኑትንም ያውቃል። "},
	{8, "8 ፤ ስፍራዋን ግን በሚያጥለቀልቅ ጎርፍ ፈጽሞ ያጠፋታል፥ ጠላቶቹንም ወደ ጨለማ ያሳድዳቸዋል። "},
	{9, "9 ፤ በእግዚአብሔር ላይ የምታስቡት ምንድር ነው? እርሱ ፈጽሞ ያጠፋል፥ መከራም ሁለተኛ አይነሣም። "},
	{10, "10 ፤ እርስ በእርሳቸው እንደ ተመሰቃቅለ እሾህ ቢሆኑ፥ በመጠጣቸውም ቢሰክሩ እንደ ደረቅ ገለባ ፈጽመው ይጠፋሉ። "},
	{11, "11 ፤ በእግዚአብሔር ላይ በክፉ የሚያስብ፥ ክፋትን የሚመክር፥ ከአንተ ዘንድ ወጥቶአል። "},
	{12, "12 ፤ እግዚአብሔር እንዲህ ይላል። ኃይለኞችና ብዙዎች ቢሆኑ እንዲሁ ይቈረጣሉ፥ እርሱም ያልቃል። እኔም አስጨንቄሃለሁ፥ ነገር ግን ከእንግዲህ ወዲህ አላስጨንቅህም። "},
	{13, "13 ፤ አሁንም ቀንበሩን ከአንተ እሰብራለሁ፥ እስራትህንም እበጥሳለሁ። "},
	{14, "14 ፤ እግዚአብሔርም ከስምህ ማንም ከእንግዲህ ወዲህ እንዳይዘራ ስለ አንተ አዝዞአል፤ ከአምላኮችህ ቤት የተቀረጸውንና ቀልጦ የተሠራውን ምስል አጠፋለሁ፤ አንተም የተጠቃህ ነህና መቃብርህን እምሳለሁ። "},
	{15, "15 ፤ እነሆ፥ የምስራችን የሚያመጣ ሰላምንም የሚያወራ ሰው እግር በተራሮች ላይ ነው! ይሁዳ ሆይ፥ አጥፊው ፈጽሞ ጠፍቶአልና፥ ከእንግዲህም ወዲህ በአንተ ዘንድ አያልፍምና ዓመት በዓሎችህን አድርግ፥ ስእለቶችህን ክፈል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct am2 poems[] = {
	{1, "1 ፤ የሚቀጠቅጥ በአንተ ላይ ወጥቶአል፤ ምሽግን ጠብቅ፥ መንገድንም ሰልል፤ ወገብህን አጽና፥ ኃይልህንም እጅግ አበርታ። "},
	{2, "2 ፤ ዘራፊዎች ዘርፈዋቸዋልና፥ የወይናቸውንም አረግ አጥፍተዋልና እግዚአብሔር የያዕቆብን ክብር እንደ እስራኤል ክብር ይመልሳል። "},
	{3, "3 ፤ የኃያላኑ ጋሻ ቀልቶአል፥ ጽኑዓንም ቀይ ልብስ ለብሰዋል። እርሱም በሚያዘጋጅበት ቀን ሰረገሎች እንደ እሳት ይንቦገቦጋሉ፤ የጦሩም ሶመያ ይወዛወዛል። "},
	{4, "4 ፤ ሰረገሎች በመንገድ ላይ ይነጕዳሉ፥ አደባባይም ይጋጫሉ፤ መልካቸው እንደ ፋና ነው፥ እንደ መብረቅም ይከንፋሉ። "},
	{5, "5 ፤ መሳፍንቱን ያስባል፤ በአረማመዳቸው ይሰናከላሉ፤ ፈጥነው በቅጥርዋ ላይ ይወጣሉ፥ መጠጊያም ተዘጋጀለት። "},
	{6, "6 ፤ የወንዞቹም መዝጊያዎች ተከፈቱ፥ የንጉሡ ቤትም ቀለጠች። "},
	{7, "7 ፤ ንግሥት ተገለጠች፥ ተማረከችም፥ ሴቶች ባሪያዎችዋም እንደ ርግብ እየጮኹና ደረታቸውን እየመቱ ዋይ ዋይ ይላሉ። "},
	{8, "8 ፤ ነነዌ ግን ከዱሮ ዘመን ጀምራ እንደ ተከማቸ ውኃ ነበረች፤ አሁን ግን ይሸሻሉ፤ እነርሱም። ቁሙ፥ ቁሙ ይላሉ፥ ነገር ግን የሚመለስ የለም። "},
	{9, "9 ፤ መዝገብዋ መጨረሻ የለውምና፥ የከበረውም የዕቃዋ ሁሉ ብዛት አይቈጠርምና ብሩን በዝብዙ፥ ወርቁንም በዝብዙ። "},
	{10, "10 ፤ ባዶና ባድማ ምድረ በዳም ሆናለች፤ ልብ ቀልጦአል፥ ጕልበቶችም ተብረክርከዋል፤ በወገብም ሁሉ ሕማም አለ፥ የሰዎችም ሁሉ ፊት ጠቍሮአል። "},
	{11, "11 ፤ የአንበሾችም መደብ፥ የአንበሾችም ደቦል የሚሰማራበት፥ አንበሳውና አንበሳይቱ ግልገሉም ሳይፈሩ የሚሄዱት ስፍራ ወዴት ነው? "},
	{12, "12 ፤ አንበሳው ለልጆቹ የሚበቃውን ነጠቀ፥ ለእንስቶቹም ሰበረላቸው ዋሻውን በንጥቂያ፥ መደቡንም በቅሚያ ሞልቶታል። "},
	{13, "13 ፤ እነሆ በአንቺ ላይ ነኝ፥ ይላል የሠራዊት ጌታ እግዚአብሔር፤ ሰረገሎችዋንም አቃጥዬ አጤሳለሁ፥ ሰይፍም የአንበሳ ደቦሎችሽን ይበላቸዋል፤ ንጥቂያሽንም ከምድር አጠፋለሁ፥ የመልክተኞችሽን ድምፅ ከእንግዲህ ወዲህ አይሰማም። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct am3 poems[] = {
	{1, "1 ፤ ለደም ከተማ ወዮላት! በሁለንተናዋ ሐሰትና ቅሚያ ሞልቶባታል፤ ንጥቂያ ከእርስዋ አያልቅም። "},
	{2, "2 ፤ የአለንጋ ድምፅ፥ የመንኰራኵርም ድምፅ፥ የፈረሶችም ኮቴ፥ የፈጣን ሰረገላም ጩኸት ተሰምቶአል፤ "},
	{3, "3 ፤ ፈረሰኛው ይጋልባል፥ ሰይፍም ይንቦገቦጋል፥ ጦርም ይብለጨለጫል፤ የተገደሉትም ይበዛሉ፥ በድኖችም በክምር ይከመራሉ፥ ሬሳቸውም አይቈጠርም፤ በሬሳቸውም ይሰናከላሉ። "},
	{4, "4 ፤ ስለ ተዋበችው ጋለሞታ ግልሙትና ብዛት ይህ ሆኖአል፤ እርስዋም በመተትዋ እጅግ በለጠች፥ አሕዛብንም በግልሙትናዋ፥ ወገኖችንም በመተትዋ ሸጠች። "},
	{5, "5 ፤ እነሆ፥ በአንቺ ላይ ነኝ፥ ይላል የሠራዊት ጌታ እግዚአብሔር፥ ልብስሽን በፊትሽ እገልጣለሁ፤ ኅፍረተ ሥጋሽንም ለአሕዛብ፥ ነውርሽንም ለመንግሥታት አሳያለሁ። "},
	{6, "6 ፤ ርኵሰትንም በላይሽ እጥላለሁ፥ እንቅሻማለሁ፥ ማላገጫም አደርግሻለሁ። "},
	{7, "7 ፤ የሚያይሽም ሁሉ ከአንቺ ሸሽቶ። ነነዌ ባድማ ሆናለች፤ የሚያለቅስላትስ ማን ነው? የሚያጽናናትንስ ከወዴት እፈልጋለሁ? ይላል። "},
	{8, "8 ፤ አንቺ በመስኖች መካከል ከተቀመጠችው፥ ውኃም በዙሪያዋ ከነበራት፥ ምሽግዋም ባሕር ከነበረ፥ ቅጥርዋም በባሕር ውስጥ ከነበረ ከኖእ አሞን ትበልጫለሽን? "},
	{9, "9 ፤ ኢትዮጵያና ግብጽ የማይቈጠር ኃይልዋ ነበሩ፤ ፉጥና ልብያ ረዳቶችዋ ነበሩ። "},
	{10, "10 ፤ እርስዋ ግን ተማርካ ፈለሰች፤ ሕፃናቶችዋ በመንገድ ሁሉ ራስ ላይ ተፈጠፈጡ፤ በከበርቴዎችዋም ላይ ዕጣ ተጣጣሉ፥ ታላላቆችዋም ሁሉ በሰንሰለት ታሰሩ። "},
	{11, "11 ፤ አንቺም ትሰክሪአለሽ ወራዳም ትሆኛለሽ፤ አንቺ ደግሞ ከጠላት የተነሣ መጠጊያን ትፈልጊአለሽ። "},
	{12, "12 ፤ አምባሽ ሁሉ የመጀመሪያውን የበሰለ ፍሬ እንደ ያዙ እንደ በለስ ዛፎች ነው፤ ቢወዛወዝ በሚበላው አፍ ውስጥ ይወድቃል። "},
	{13, "13 ፤ እነሆ፥ በመካከልሽ ያሉ ሕዝብሽ ሴቶች ናቸው፤ የአገርሽ በሮች ለጠላቶችሽ ፈጽሞ ተከፍተዋል፥ እሳትም መወርወሪያዎችህን በልቶአል። "},
	{14, "14 ፤ ከብበው ያስጨንቁሻልና ውኃን ቅጂ፤ አምባሽን አጠንክሪ፤ ወደ ጭቃ ገብተሽ እርገጪ፤ የጡብን መሠሪያ ያዢ። "},
	{15, "15 ፤ በዚያ እሳት ይበላሻል፥ ሰይፍ ያጠፋሻል፥ እንደ ደጎብያ ይበላሻል፤ እንደ ደጎብያ ብዢ፥ እንደ አንበጣም ተባዢ። "},
	{16, "16 ፤ ነጋዴዎችሽን ከሰማይ ከዋክብት ይልቅ አበዛሽ፤ ደጎብያ ተዘረጋ፥ በረረም። "},
	{17, "17 ፤ በአንቺ ዘንድ ዘውድ የጫኑት እንደ አንበጣ፥ አለቆችሽም እንደሚንቀሳቀሱ ኩብኩባዎች ናቸው፤ በብርድ ቀን በቅጥር ውስጥ ይቀመጣሉ፥ ፀሐይም በወጣች ጊዜ ያኰበኵባሉ፤ ስፍራቸው በየት እንደ ሆነ አይታወቅም። "},
	{18, "18 ፤ የአሦር ንጉሥ ሆይ፥ እረኞችህ አንቀላፍተዋል፤ መኳንንቶችህም ዐርፈዋል፤ ሕዝብህም በተራሮች ላይ ተበትኖአል፥ የሚሰበስበውም የለም። "},
	{19, "19 ፤ ስብራትህ አይፈወስም፥ ቍስልህም ክፉ ነው፤ ወሬህንም የሚሰሙ ሁሉ እጃቸውን በአንተ ላይ ያጨበጭባሉ፤ ክፋትህ ሁልጊዜ ያላለፈችበት ሰው ማን ነውና? "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};