#include <map>
#include <string>
class Bible19
{
	struct am1	{ int val; const char *msg; };
	struct am2	{ int val; const char *msg; };
	struct am3	{ int val; const char *msg; };
	struct am4	{ int val; const char *msg; };
	struct am5	{ int val; const char *msg; };
	struct am6	{ int val; const char *msg; };
	struct am7	{ int val; const char *msg; };
	struct am8	{ int val; const char *msg; };
	struct am9	{ int val; const char *msg; };
	struct am10	{ int val; const char *msg; };
	struct am11	{ int val; const char *msg; };
	struct am12	{ int val; const char *msg; };
	struct am13	{ int val; const char *msg; };
	struct am14	{ int val; const char *msg; };
	struct am15	{ int val; const char *msg; };
	struct am16	{ int val; const char *msg; };
	struct am17	{ int val; const char *msg; };
	struct am18	{ int val; const char *msg; };
	struct am19	{ int val; const char *msg; };
	struct am20	{ int val; const char *msg; };
	struct am21	{ int val; const char *msg; };
	struct am22	{ int val; const char *msg; };
	struct am23	{ int val; const char *msg; };
	struct am24	{ int val; const char *msg; };
	struct am25	{ int val; const char *msg; };
	struct am26	{ int val; const char *msg; };
	struct am27	{ int val; const char *msg; };
	struct am28	{ int val; const char *msg; };
	struct am29	{ int val; const char *msg; };
	struct am30	{ int val; const char *msg; };
	struct am31	{ int val; const char *msg; };
	struct am32	{ int val; const char *msg; };
	struct am33	{ int val; const char *msg; };
	struct am34	{ int val; const char *msg; };
	struct am35	{ int val; const char *msg; };
	struct am36	{ int val; const char *msg; };
	struct am37	{ int val; const char *msg; };
	struct am38	{ int val; const char *msg; };
	struct am39	{ int val; const char *msg; };
	struct am40	{ int val; const char *msg; };
	struct am41	{ int val; const char *msg; };
	struct am42	{ int val; const char *msg; };
	struct am43	{ int val; const char *msg; };
	struct am44	{ int val; const char *msg; };
	struct am45	{ int val; const char *msg; };
	struct am46	{ int val; const char *msg; };
	struct am47	{ int val; const char *msg; };
	struct am48	{ int val; const char *msg; };
	struct am49	{ int val; const char *msg; };
	struct am50	{ int val; const char *msg; };
	struct am51	{ int val; const char *msg; };
	struct am52	{ int val; const char *msg; };
	struct am53	{ int val; const char *msg; };
	struct am54	{ int val; const char *msg; };
	struct am55	{ int val; const char *msg; };
	struct am56	{ int val; const char *msg; };
	struct am57	{ int val; const char *msg; };
	struct am58	{ int val; const char *msg; };
	struct am59	{ int val; const char *msg; };
	struct am60	{ int val; const char *msg; };
	struct am61	{ int val; const char *msg; };
	struct am62	{ int val; const char *msg; };
	struct am63	{ int val; const char *msg; };
	struct am64	{ int val; const char *msg; };
	struct am65	{ int val; const char *msg; };
	struct am66	{ int val; const char *msg; };
	struct am67	{ int val; const char *msg; };
	struct am68	{ int val; const char *msg; };
	struct am69	{ int val; const char *msg; };
	struct am70	{ int val; const char *msg; };
	struct am71	{ int val; const char *msg; };
	struct am72	{ int val; const char *msg; };
	struct am73	{ int val; const char *msg; };
	struct am74	{ int val; const char *msg; };
	struct am75	{ int val; const char *msg; };
	struct am76	{ int val; const char *msg; };
	struct am77	{ int val; const char *msg; };
	struct am78	{ int val; const char *msg; };
	struct am79	{ int val; const char *msg; };
	struct am80	{ int val; const char *msg; };
	struct am81	{ int val; const char *msg; };
	struct am82	{ int val; const char *msg; };
	struct am83	{ int val; const char *msg; };
	struct am84	{ int val; const char *msg; };
	struct am85	{ int val; const char *msg; };
	struct am86	{ int val; const char *msg; };
	struct am87	{ int val; const char *msg; };
	struct am88	{ int val; const char *msg; };
	struct am89	{ int val; const char *msg; };
	struct am90	{ int val; const char *msg; };
	struct am91	{ int val; const char *msg; };
	struct am92	{ int val; const char *msg; };
	struct am93	{ int val; const char *msg; };
	struct am94	{ int val; const char *msg; };
	struct am95	{ int val; const char *msg; };
	struct am96	{ int val; const char *msg; };
	struct am97	{ int val; const char *msg; };
	struct am98	{ int val; const char *msg; };
	struct am99	{ int val; const char *msg; };
	struct am100	{ int val; const char *msg; };
	struct am101	{ int val; const char *msg; };
	struct am102	{ int val; const char *msg; };
	struct am103	{ int val; const char *msg; };
	struct am104	{ int val; const char *msg; };
	struct am105	{ int val; const char *msg; };
	struct am106	{ int val; const char *msg; };
	struct am107	{ int val; const char *msg; };
	struct am108	{ int val; const char *msg; };
	struct am109	{ int val; const char *msg; };
	struct am110	{ int val; const char *msg; };
	struct am111	{ int val; const char *msg; };
	struct am112	{ int val; const char *msg; };
	struct am113	{ int val; const char *msg; };
	struct am114	{ int val; const char *msg; };
	struct am115	{ int val; const char *msg; };
	struct am116	{ int val; const char *msg; };
	struct am117	{ int val; const char *msg; };
	struct am118	{ int val; const char *msg; };
	struct am119	{ int val; const char *msg; };
	struct am120	{ int val; const char *msg; };
	struct am121	{ int val; const char *msg; };
	struct am122	{ int val; const char *msg; };
	struct am123	{ int val; const char *msg; };
	struct am124	{ int val; const char *msg; };
	struct am125	{ int val; const char *msg; };
	struct am126	{ int val; const char *msg; };
	struct am127	{ int val; const char *msg; };
	struct am128	{ int val; const char *msg; };
	struct am129	{ int val; const char *msg; };
	struct am130	{ int val; const char *msg; };
	struct am131	{ int val; const char *msg; };
	struct am132	{ int val; const char *msg; };
	struct am133	{ int val; const char *msg; };
	struct am134	{ int val; const char *msg; };
	struct am135	{ int val; const char *msg; };
	struct am136	{ int val; const char *msg; };
	struct am137	{ int val; const char *msg; };
	struct am138	{ int val; const char *msg; };
	struct am139	{ int val; const char *msg; };
	struct am140	{ int val; const char *msg; };
	struct am141	{ int val; const char *msg; };
	struct am142	{ int val; const char *msg; };
	struct am143	{ int val; const char *msg; };
	struct am144	{ int val; const char *msg; };
	struct am145	{ int val; const char *msg; };
	struct am146	{ int val; const char *msg; };
	struct am147	{ int val; const char *msg; };
	struct am148	{ int val; const char *msg; };
	struct am149	{ int val; const char *msg; };
	struct am150	{ int val; const char *msg; };
public:
static void view1() {
struct am1 poems[] = {
	{1, "1 ምስጉን ነው በክፉዎች ምክር ያልሄደ፥ በኃጢአተኞችም መንገድ ያልቆመ፥ በዋዘኞችም ወንበር ያልተቀመጠ። "},
	{2, "2 ነገር ግን በእግዚአብሔር ሕግ ደስ ይለዋል፥ ሕጉንም በቀንና በሌሊት ያስባል። "},
	{3, "3 እርሱም በውኃ ፈሳሾች ዳር እንደ ተተከለች፥ ፍሬዋን በየጊዜዋ እንደምትሰጥ፥ ቅጠልዋም እንደማይረግፍ ዛፍ ይሆናል፤ የሚሠራውም ሁሉ ይከናወንለታል። "},
	{4, "4 ክፉዎች እንዲህ አይደሉም፥ ነገር ግን ነፋስ ጠርጎ እንደሚወስደው ትቢያ ናቸው። "},
	{5, "5 ስለዚህ ክፉዎች በፍርድ፥ ኃጢአተኞችም በጻድቃን ማኅበር አይቆሙም። "},
	{6, "6 እግዚአብሔር የጻድቃንን መንገድ ያውቃልና፥ የክፉዎች መንገድ ግን ትጠፋለች። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct am2 poems[] = {
	{1, "1 አሕዛብ ለምን ያጕረመርማሉ? ወገኖችስ ለምን ከንቱን ይናገራሉ? "},
	{2, "2 የምድር ነገሥታት ተነሡ፥ አለቆችም በእግዚአብሔርና በመሢሑ ላይ እንዲህ ሲሉ ተማከሩ። "},
	{3, "3 ማሰርያቸውን እንበጥስ፥ ገመዳቸውንም ከእኛ እንጣል። "},
	{4, "4 በሰማይ የሚኖር እርሱ ይሥቃል፥ ጌታም ይሣለቅባቸዋል። "},
	{5, "5 በዚያን ጊዜ በቍጣው ይናገራቸዋል፥ በመዓቱም ያውካቸዋል። "},
	{6, "6 እኔ ግን ንጉሤን ሾምሁ በተቀደሰው ተራራዬ በጽዮን ላይ። "},
	{7, "7 ትእዛዙን እናገራለሁ፤ እግዚአብሔር አለኝ። አንተ ልጄ ነህ፥ እኔ ዛሬ ወለድሁህ። "},
	{8, "8 ለምነኝ፥ አሕዛብን ለርስትህ የምድርንም ዳርቻ ለግዛትህ እሰጥሃለሁ። "},
	{9, "9 በብረት በትር ትጠብቃቸዋለህ፥ እንደ ሸክላ ሠሪ ዕቃዎች ትቀጠቅጣቸዋለህ። "},
	{10, "10 አሁንም እናንት ነገሥታት፥ ልብ አድርጉ፤ እናንት የምድር ፈራጆችም፥ ተገሠጹ። "},
	{11, "11 ለእግዚአብሔር በፍርሃት ተገዙ፥ በረዓድም ደስ ይበላችሁ። "},
	{12, "12 ተግሣጹን ተቀበሉ ጌታ እንዳይቈጣ እናንተም በመንገድ እንዳትጠፉ፥ ቍጣው ፈጥና ትነድዳለችና። በእርሱ የታመኑ ሁሉ የተመሰገኑ ናቸው። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct am3 poems[] = {
	{1, "1 ከልጁ ከአቤሴሎም ፊት በሸሸ ጊዜ የዳዊት መዝሙር።1 አቤቱ፥ የሚያስጨንቁኝ ምንኛ በዙ! በኔ ላይ የሚቆሙት ብዙ ናቸው። "},
	{2, "2 ብዙ ሰዎች ነፍሴን። አምላክሽ አያድንሽም አልዋት። "},
	{3, "3 አንተ ግን አቤቱ፥ መጠጊያዬ ነህ፥ ክብሬንና ራሴንም ከፍ ከፍ የምታደርገው አንተ ነህ። "},
	{4, "4 በቃሌ ወደ እግዚአብሔር እጮሃለሁ ከተቀደሰ ተራራውም ይሰማኛል። "},
	{5, "5 እኔ ተኛሁ አንቀላፋሁም፤ እግዚአብሔርም ደግፎኛልና ነቃሁ። "},
	{6, "6 ከሚከብቡኝ ከአእላፍ ሕዝብ አልፈራም። "},
	{7, "7 ተነሥ፥ አቤቱ፤ አምላኬ ሆይ፥ አድነኝ፤ አንተ የጠላቶቼን መንጋጋ መትተሃልና፥ የክፉዎችንም ጥርስ ሰብረሃልና። "},
	{8, "8 ማዳን የእግዚአብሔር ነው፥ በረከትህም በሕዝብህ ላይ ነው። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct am4 poems[] = {
	{1, "1 ለመዘምራን አለቃ በበገናዎች፤ የዳዊት መዝሙር።1 የጽድቄ አምላክ በጠራሁት ጊዜ መለሰልኝ፥ በጭንቀቴም አሰፋህልኝ፤ ማረኝ፥ ጸሎቴንም ስማ። "},
	{2, "2 እናንት የሰው ልጆች፥ እስከ መቼ ድረስ ልባችሁን ታከብዳላችሁ? "},
	{3, "3 እግዚአብሔር በጻድቁ እንደ ተገለጠ እወቁ፤ እግዚአብሔር ወደ እርሱ በተጣራሁ ጊዜ ይሰማኛል። "},
	{4, "4 ተቈጡ፥ ነገር ግን ኃጢአትን አታድርጉ፤ በመኝታችሁ ሳላችሁ በልባችሁ አስቡ፤ ዝም በሉ። "},
	{5, "5 የጽድቅን መሥዋዕት ሠዉ፥ በእግዚአብሔርም ታመኑ። "},
	{6, "6 በጎውን ማን ያሳየናል? የሚሉ ብዙ ናቸው። አቤቱ፥ የፊትህ ብርሃን በላያችን ታወቀ። "},
	{7, "7 በልቤ ደስታን ጨመርህ፤ ከስንዴ ፍሬና ከወይን ከዘይትም ይልቅ በዛ። "},
	{8, "8 በሰላም እተኛለሁ አንቀላፋለሁም፤ አቤቱ፥ አንተ ብቻህን በእምነት አሳድረኸኛልና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct am5 poems[] = {
	{1, "1 ለመዘምራን አለቃ በዋሽንት፤ የዳዊት መዝሙር።1 አቤቱ፥ ቃሌን አድምጥ፥ ጩኸቴንም አስተውል፤ "},
	{2, "2 የልመናዬን ቃል አድምጥ፥ ንጉሤና አምላኬ ሆይ፥ አቤቱ፥ ወደ አንተ እጸልያለሁና። "},
	{3, "3 በማለዳ ድምፄን ትሰማለህ፥ በማለዳ በፊትህ እቆማለሁ፥ እጠብቃለሁም። "},
	{4, "4 አንተ በደልን የማትወድድ አምላክ ነህና፤ ክፉ ከአንተ ጋር አያድርም። "},
	{5, "5 በከንቱ የሚመኩ በዓይኖችህ ፊት አይኖሩም፤ ክፉ አድራጊዎችን ሁሉ ጠላህ። "},
	{6, "6 ሐሰትን የሚናገሩትን ታጠፋቸዋለህ፤ ደም አፍሳሹንና ሸንጋዩን ሰው እግዚአብሔር ይጸየፋል። "},
	{7, "7 እኔ ግን በምሕረትህ ብዛት ወደ ቤትህ እገባለሁ፤ አንተን በመፍራት ወደ ቅድስናህ መቅደስ እሰግዳለሁ። "},
	{8, "8 አቤቱ፥ ስለ ጠላቶቼ በጽድቅህ ምራኝ፤ መንገዴን በፊትህ አቅና። "},
	{9, "9 በአፋቸው እውነት የለምና፥ ልባቸውም ከንቱ ነው፤ ጕሮሮአቸው የተከፈተ መቃብር ነው፤ በምላሳቸው ይሸነግላሉ። "},
	{10, "10 አቤቱ፥ ፍረድባቸው፥ በምክራቸውም ይውደቁ፤ ስለ ክፋታቸውም ብዛት አሳድዳቸው፥ እነርሱ ዐምፀውብሃልና። "},
	{11, "11 በአንተ የሚታመኑት ሁሉ ግን ደስ ይላቸዋል፤ ለዘላለሙ ደስ ይላቸዋል፥ እነርሱንም ትጠብቃለህ፤ ስምህንም የሚወድዱ ሁሉ በአንተ ይመካሉ። "},
	{12, "12 አንተ ጻድቁን ትባርከዋለህና፤ አቤቱ፥ እንደ ጋሻ በሞገስ ከለልኸን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct am6 poems[] = {
	{1, "1 ለመዘምራን አለቃ በበገናዎች ስለ ስምንተኛ፤ የዳዊት መዝሙር።1 አቤቱ፥ በቍጣህ አትቅሠፈኝ፥ በመዓትህም አትገሥጸኝ። "},
	{2, "2 ድውይ ነኝና አቤቱ፥ ማረኝ፤ አጥንቶቼ ታውከዋልና ፈውሰኝ። "},
	{3, "3 ነፍሴም እጅግ ታወከች፤ አንተም አቤቱ፥ እስከ መቼ ድረስ ነው? "},
	{4, "4 አቤቱ፥ ተመለስ ነፍሴንም አድናት፥ ስለ ቸርነትህም አድነኝ። "},
	{5, "5 በሞት የሚያስብህ የለምና፥ በሲኦልም የሚያመሰግንህ ማን ነው? "},
	{6, "6 በጭንቀቴ ደክሜያለሁ፤ ሌሊቱን ሁሉ አልጋዬን አጥባለሁ፥ በዕንባዬም መኝታዬን አርሳለሁ። "},
	{7, "7 ዓይኔ ከቍጡ ዕንባ የተነሣ ታወከች፤ ከጠላቶቼ ሁሉ የተነሣ አረጀሁ። "},
	{8, "8 ዓመፃን የምታደርጉ ሁሉ፥ ከእኔ ራቁ፥ እግዚአብሔር የልቅሶዬን ቃል ሰምቶአልና። "},
	{9, "9 እግዚአብሔር ልመናዬን ሰማኝ፤ እግዚአብሔር ጸሎቴን ተቀበለ። "},
	{10, "10 ጠላቶቼ ሁሉ ይፈሩ እጅግም ይጐስቍሉ፤ ወደ ኋላቸው ይመለሱ፥ በፍጥነትም ይፈሩ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct am7 poems[] = {
	{1, "1 አቤቱ አምላኬ፥ በአንተ ታመንሁ፤ ከሚያሳድዱኝ ሁሉ አድነኝና አውጣኝ፥ "},
	{2, "2 ነፍሴን እንደ አንበሳ ነጥቀው እንዳይሰብሩዋት፥ የሚያድንና የሚታደግ ሳይኖር። "},
	{3, "3 አቤቱ አምላኬ፥ እንዲህስ ካደረግሁ፥ ዓመፃም በእጄ ቢኖር፥ "},
	{4, "4 ክፉ ላደረጉብኝም ክፉን መልሼላቸው ብሆን፥ ጠላቴንም በከንቱ ገፍቼው ብሆን፥ "},
	{5, "5 ጠላት ነፍሴን ያሳድዳት ያግኛትም፥ ሕይወቴንም በምድር ላይ ይርገጣት፥ ክብሬንም በትቢያ ላይ ያዋርዳት። "},
	{6, "6 አቤቱ፥ በመዓትህ ተነሥ፥ በጠላቶቼ ላይ በቍጣ ተነሣባቸው፤ አቤቱ አምላኬ፥ ባዘዝኸው ትእዛዝ ንቃ። "},
	{7, "7 የአሕዛብም ጉባኤ ይከብብሃል፥ በእነርሱም ላይ ወደ ከፍታ ተመለስ። "},
	{8, "8 እግዚአብሔር በአሕዛብ ይፈርዳል፤ አቤቱ፥ እንደ ጽድቄ ፍረድልኝ፥ እንደ የዋህነቴም ይሁንልኝ። "},
	{9, "9 የኃጥኣን ክፋት ይጥፋ፥ ጻድቁን ግን አቅና፤ እግዚአብሔር ልቡናንና ኵላሊትን ይመረምራል። "},
	{10, "10 እግዚአብሔር የጽድቅ ጋሻዬ ነው ልበ ቅኖችን የሚያድናቸው። "},
	{11, "11 እግዚአብሔር የእውነት ዳኛ ነው፥ ኃይለኛም ታጋሽም ነው፥ ሁልጊዜም አይቈጣም። "},
	{12, "12 ባትመለሱ ግን ሰይፉን ይስላል፥ ቀስቱን ገተረ አዘጋጀም፤ "},
	{13, "13 የሞት መሣርያንም አዘጋጀበት፥ ፍላጻዎቹንም የሚቃጠሉ አደረገ። "},
	{14, "14 እነሆ፥ በዓመፃ ተጨነቀ ጉዳትን ፀነሰ ኃጢአትንም ወለደ። "},
	{15, "15 ጕድጓድን ማሰ ቈፈረም። ባደረገውም ጕድጓድ ይወድቃል። "},
	{16, "16 ጉዳቱ በራሱ ይመለሳል፥ ዓመፃውም በአናቱ ላይ ትወርዳለች። "},
	{17, "17 እግዚአብሔርን እንደ ጽድቁ መጠን አመሰግናለሁ፥ ለልዑል እግዚአብሔርም ስም እዘምራለሁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct am8 poems[] = {
	{1, "1 ለመዘምራን አለቃ በዋሽንት፤ የዳዊት መዝሙር።1 አቤቱ ጌታችን፥ ስምህ በምድር ሁሉ እጅግ ተመሰገነ፥ ምስጋናህ በሰማዮች ላይ ከፍ ከፍ ብሎአልና። "},
	{2, "2 ከሕፃናትና ከሚጠቡ ልጆች አፍ ምስጋናን አዘጋጀህ ስለ ጠላትህ፥ ጠላትንና ቂመኛን ለማጥፋት። "},
	{3, "3 የጣቶችህን ሥራ ሰማዮችን ባየሁ ጊዜ፥ ጨረቃንና ከዋክብትን አንተ የሠራሃቸውን፥ "},
	{4, "4 ታስበው ዘንድ ሰው ምንድር ነው? ትጐበኘውም ዘንድ የሰው ልጅ ምንድር ነው? "},
	{5, "5 ከመላእክት እጅግ ጥቂት አሳነስኸው፤ በክብርና በምስጋና ዘውድ ከለልኸው። "},
	{6, "6 በእጆችህም ሥራ ሁሉ ላይ ሾምኸው፤ ሁሉን ከእግሮቹ በታች አስገዛህለት፥ "},
	{7, "7 በጎችንም ላሞችንም ሁሉ ደግሞም የምድረ በዳውን እንስሶች፥ "},
	{8, "8 የሰማይንም ወፎች የባሕርንም ዓሦች፥ በባሕር መንገድ የሚሄደውንም ሁሉ። "},
	{9, "9 አቤቱ ጌታችን፥ ስምህ በምድር ሁሉ እጅግ ተመሰገነ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct am9 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ በሙትላቤን፤ የዳዊት መዝሙር።1 አቤቱ፥ በልቤ ሁሉ አመሰግንሃለሁ፥ ተአምራትህንም ሁሉ እነግራለሁ። "},
	{2, "2 በአንተ ደስ ይለኛል፥ ሐሤትንም አደርጋለሁ፤ ልዑል ሆይ፥ ለስምህ እዘምራለሁ። "},
	{3, "3 ጠላቶቼ ወደ ኋላ በተመለሱ ጊዜ፥ ይሰናከላሉ ከፊትህም ይጠፋሉ። "},
	{4, "4 ፍርዴንና በቀሌን አድርገህልኛልና፤ ጽድቅን እየፈረድህ በዙፋንህ ላይ ተቀመጥህ። "},
	{5, "5 አሕዛብን ገሠጽህ፥ ዝንጉዎችንም አጠፋህ፥ ስማቸውንም ለዘላለም ደመሰስህ። "},
	{6, "6 ጠላቶች በጦር ለዘላለም ጠፉ፥ ከተሞቻቸውንም አፈረስህ፥ ዝክራቸውም በአንድነት ጠፋ። "},
	{7, "7 እግዚአብሔር ግን ለዘላለም ይኖራል፥ ዙፋኑንም ለመፍረድ አዘጋጀ፤ "},
	{8, "8 እርሱም ዓለምን በጽድቅ ይፈርዳታል፥ አሕዛብንም በቅንነት ይዳኛቸዋል። "},
	{9, "9 እግዚአብሔርም ለድሆች መጠጊያ ሆናቸው፥ እርሱም በመከራቸው ጊዜ ረዳታቸው ነው። "},
	{10, "10 ስምህን የሚያውቁ ሁሉ በአንተ ይታመናሉ፥ አቤቱ፥ የሚሹህን አትተዋቸውምና። "},
	{11, "11 በጽዮን ለሚኖር ለእግዚአብሔር ዘምሩ፥ በአሕዛብም መካከል አደራረጉን ንገሩ፤ "},
	{12, "12 ደማቸውን የሚመራመር እርሱ አስቦአልና፥ የድሆችንም ጩኸት አልረሳምና። "},
	{13, "13 አቤቱ፥ እዘንልኝ፥ ጠላቶቼም የሚያመጡብኝን መከራ እይ፥ ከሞት ደጆች ከፍ ከፍ የምታደርገኝ፤ "},
	{14, "14 ምስጋናውን ሁሉ እናገር ዘንድ፤ በጽዮን ልጅ በደጆችዋ በማዳንህ ደስ ይለኛል። "},
	{15, "15 አሕዛብ በሠሩት ጕድጓድ ወደቁ፥ በዚያችም በሸሸጓት ወጥመድ እግራቸው ተጠመደች። "},
	{16, "16 እግዚአብሔር ፍርድን በማድረግ የታወቀ ነው፤ ኃጢአተኛው በእጆቹ ሥራ ተጠመደ። "},
	{17, "17 ኃጢአተኞች ወደ ሲኦል ይመለሳሉ፥ እግዚአብሔርን የሚረሱ አሕዛብም ሁሉ። "},
	{18, "18 ድሀ ለዘላለም አይረሳምና፥ የችግረኞችም ተስፋቸው ለዘላለም አይጠፋም። "},
	{19, "19 አቤቱ፥ ተነሥ፤ ሰውም አይበርታ፥ አሕዛብም በፊትህ ይፈረድባቸው። "},
	{20, "20 አቤቱ፥ ፍርሃትን በላያቸው ጫንባቸው፤ አሕዛብ ሰዎች እንደ ሆኑ ይወቁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct am10 poems[] = {
	{1, "1 አቤቱ፥ ለምን ርቀህ ቆምህ? በመከራም ጊዜ ለምን ትሰወራለህ? "},
	{2, "2 በኃጢአተኛ ትዕቢት ድሀ ይናደዳል፤ ባሰቡት ተንኰላቸው ተጠመዱ። "},
	{3, "3 ኃጢአተኛ በነፍሱ ፈቃድ ይወደሳልና፥ ዓመፀኛም ይባርካል። "},
	{4, "4 ኃጢአተኛ እግዚአብሔርን አበሳጨው፥ እንደ ቍጣውም ብዛት አይመራመረውም በእርሱ ፊት እግዚአብሔር የለም። "},
	{5, "5 መንገዱ ሁሉ የረከሰ ነው፥ ፍርድህም በፊቱ የፈረሰ ነው፥ ጠላቶችንም ሁሉ ይገዛቸዋል። "},
	{6, "6 በልቡ ይላል። ለልጅ ልጅ አልታወክም ክፉም አያገኘኝም። "},
	{7, "7 አፉ መርገምንና ሽንገላን ተንኰልን የተመላ ነው፤ ከምላሱ በታች ጉዳትና መከራ ነው። "},
	{8, "8 በመንደሮች መሸመቅያ ይቀመጣል ንጹሓንን በስውር ይገድል ዘንድ፤ ዓይኖቹም ወደ ድኃ ይመለከታሉ። "},
	{9, "9 እንደ አንበሳ በችፍግ ዱር በስውር ይሸምቃል፤ ድሀውን ለመንጠቅ ያደባል፤ ድሀውን ይነጥቀዋል በአሽክላውም ይስበዋል። "},
	{10, "10 ድሀ ይዋረዳል፥ ይጐብጣል፤ በኃያላኑም እጅግ ይወድቃል። "},
	{11, "11 በልቡም ይላል። እግዚአብሔር ረስቶኛል፤ ፈጽሞም እንዳያይ ፊቱን ሰወረ። "},
	{12, "12 አቤቱ አምላክ ሆይ፥ ተነሥ እጅህም ከፍ ከፍ ትበል፤ ድሆችን አትርሳ። "},
	{13, "13 ኃጢአተኛ ስለ ምን እግዚአብሔርን አስቈጣው? በልቡ። አይመራመረኝም ይላልና። "},
	{14, "14 አየኸው፥ አንተ ክፋትንና ቍጣን ትመለከታለህና በእጅህ ፍዳውን ለመስጠት፤ ድሀ ራሱን ለአንተ ይተዋል፥ ለድሀ አደግም ረዳቱ አንተ ነህ። "},
	{15, "15 የኃጢአተኛንና የክፉን ክንድ ስበር፥ የኃጢአቱንም ብድራት ክፈል ሌላ እስከማይገኝ ድረስ። "},
	{16, "16 እግዚአብሔር ለዘላለም ይነግሣል፤ አሕዛብ ከምድሩ ይጠፋሉ። "},
	{17, "17 እግዚአብሔር የድሆችን ምኞት ሰማ፥ ጆሮውም የልባቸውን አሳብ አደመጠች፥ "},
	{18, "18 ፍርዱ ለድሀ አደግና ለችግረኛ ይደረግ ዘንድ፥ ሰዎች በምድር ላይ አፋቸውን ከፍ ከፍ ማድረግ እንዳይደግሙ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct am11 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የዳዊት መዝሙር።1 በእግዚአብሔር ታመንሁ፤ ነፍሴን። እንደ ወፍ ወደ ተራሮች ተቅበዝበዢ እንዴት ትሉአታላችሁ? "},
	{2, "2 ኃጢአተኞች እነሆ ቀስታቸውን ገትረዋልና፥ ፍላጻቸውንም በአውታር አዘጋጅተዋልና፥ ልበ ቅኖችን በስውር ይነድፉ ዘንድ። "},
	{3, "3 አንተ የሠራኸውን እነሆ እነርሱ አፍርሰዋልና፤ ጻድቅ ግን ምን አደረገ? "},
	{4, "4 እግዚአብሔር በተቀደሰው መቅደሱ ነው፤ እግዚአብሔር፥ ዙፋኑ በሰማይ ነው፤ ዓይኖቹ ወደ ድሃ ይመለከታሉ፥ ቅንድቦቹም የሰው ልጆችን ይመረምራሉ። "},
	{5, "5 እግዚአብሔር ጻድቅንና ኅጥእን ይመረምራል፤ ዓመፃን የወደዳት ግን ነፍሱን ጠልቶአል። "},
	{6, "6 ወጥመድ በኅጥኣን ላይ ያዘንባል እሳትና ዲን ዐውሎ ነፋስም የጽዋቸው እድል ፈንታ ነው። "},
	{7, "7 እግዚአብሔር ጻድቅ ነውና፥ ጽድቅንም ይወድዳል፤ ቅንነት ግን ፊቱን ታየዋለች። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct am12 poems[] = {
	{1, "1 ለመዘምራን አለቃ፥ ስለ ስምንተኛ የዳዊት መዝሙር።1 አቤቱ፥ አድነኝ፤ ደግ ሰው አልቆአልና፥ ከሰው ልጆችም መተማመን ጐድሎአልና። "},
	{2, "2 እርስ በርሳቸው ከንቱ ነገርን ይናገራሉ፤ በሽንገላ ከንፈር ሁለት ልብ ሆነው ይናገራሉ። "},
	{3, "3 የሽንገላን ከንፈሮች ሁሉ እግዚአብሔር ያጠፋቸዋል፥ ታላቅ ነገርን የምትናገረውን ምላስ፤ "},
	{4, "4 ምላሳችንን እናበረታለን፤ ከንፈራችን የእኛ ነው፥ ጌታችን ማን ነው? የሚሉትን። "},
	{5, "5 ስለ ድሆች መከራ፥ ስለ ችግረኞች ጩኸት እግዚአብሔር። አሁን እነሣለሁ ይላል፤ መድኃኒትን አደርጋለሁ፥ በላዩም እገልጣለሁ። "},
	{6, "6 በምድር ላይ እንደ ተፈተነ ሰባት ጊዜ እንደ ተጣራ ብር። የእግዚአብሔር ቃላት የነጹ ቃላት ናቸው። "},
	{7, "7 አቤቱ፥ አንተ ጠብቀን፥ ከዚህችም ትውልድ ለዘላለም ታደገን። "},
	{8, "8 በሰው ልጆች ዘንድ ምናምንቴ ከፍ ከፍ ባለ ጊዜ ክፉዎች በዙሪያው ሁሉ ይመላለሳሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct am13 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የዳዊት መዝሙር።1 አቤቱ፥ እስከ መቼ ፈጽመህ ትረሳኛለህ? እስከ መቼስ ፊትህን ከእኔ ትሰውራለህ? "},
	{2, "2 እስከ መቼ በነፍሴ እመካከራለሁ? ትካዜስ እስከ መቼ ሁልጊዜ ይሆናል? እስከ መቼ ጠላቴ በላዬ ይጓደዳል? "},
	{3, "3 አቤቱ አምላኬ፥ እየኝ ስማኝም፤ ጠላቴ። አሸነፍሁት እንዳይል፥ "},
	{4, "4 የሚያስጨንቁኝም እኔ ብናወጥ ደስ እንዳይላቸው፥ ለሞትም እንዳልተኛ ዓይኖቼን አብራ። "},
	{5, "5 እኔ ግን በቸርነትህ ታመንሁ፥ ልቤም በመድኃኒትህ ደስ ይለዋል። "},
	{6, "6 የረዳኝን እግዚአብሔርን አመሰግናለሁ፥ ለልዑል እግዚአብሔር ስምም እዘምራለሁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct am14 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የዳዊት መዝሙር። ሰነፍ በልቡ። አምላክ የለም ይላል። በሥራቸው ረከሱ፥ ጐስቈሉ፤ በጎ ነገርን የሚሠራ የለም። "},
	{2, "2 የሚያስተውል እግዚአብሔርንም የሚፈልግ እንዳለ ያይ ዘንድ፤ እግዚአብሔር ከሰማይ የሰው ልጆችን ተመለከተ። "},
	{3, "3 ሁሉ ዐመፁ በአንድነትም ረከሱ በጎ ነገርን የሚሠራ የለም፤ አንድም ስንኳ የለም። "},
	{4, "4 ጕሮሮአቸው የተከፈተ መቃብር ነው፥ በምላሳቸው ሸነገሉ፤ "},
	{5, "5 ከከንፈራቸው በታች የእባብ መርዝ አለ፤ አፋቸው መርገምንና መራራን ተሞልቶአል፤ "},
	{6, "6 ደምን ለማፍሰስ እግራቸው ፈጣን ነው፤ ጥፋትና ጕስቍልና በመንገዳቸው አለ፥ የሰላምን መንገድ አላወቁአትምና፤ እግዚአብሔርን መፍራት በዓይናቸው ፊት የለም። "},
	{7, "7 ሕዝቤን እንደ እንጀራ የሚበሉ ኃጢአት የሚሠሩ ሁሉ በውኑ አያውቁምን? እግዚአብሔርንም አይጠሩትም።[8] በዚያ በታላቅ ፍርሃት እጅግ ፈሩ፥ እግዚአብሔር በጻድቃን ትውልድ ዘንድ ነውና።[9] የድሆችን ምክር አሳፈራችሁ፥ እግዚአብሔር ግን ተስፋቸው ነው።[10] ከጽዮን መድኃኒትን ለእስራኤል ማን ይሰጣል? እግዚአብሔር የሕዝቡን ምርኮ በመለሰ ጊዜ፥ ያዕቆብ ደስ ይለዋል፥ እስራኤልም ሐሤት ያደርጋል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct am15 poems[] = {
	{1, "1 አቤቱ፥ በድንኳንህ ውስጥ ማን ያድራል? በተቀደሰውም ተራራህ ማን ይኖራል? "},
	{2, "2 በቅንነት የሚሄድ፥ ጽድቅንም የሚያደርግ፥ በልቡም እውነትን የሚናገር። "},
	{3, "3 በአንደበቱ የማይሸነግል፥ በባልንጀራው ላይ ክፋትን የማያደርግ፥ ዘመዶቹንም የማይሰድብ። "},
	{4, "4 ኃጢአተኛ በፊቱ የተናቀ፥ እግዚአብሔርንም የሚፈሩትን የሚያከብር፥ ለባልንጀራው የሚምል የማይከዳም። "},
	{5, "5 ገንዘቡን በአራጣ የማያበድር፥ በንጹሑ ላይ መማለጃን የማይቀበል። እንዲህ የሚያደርግ ለዘላለም አይታወክም። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct am16 poems[] = {
	{1, "1 የዳዊት ቅኔ።1 አቤቱ፥ በአንተ ታምኛለሁና ጠብቀኝ። "},
	{2, "2 እግዚአብሔርን። አንተ ጌታዬ ነህ አልሁ፤ ከአንተ በቀር በጎነት የለኝም። "},
	{3, "3 ፈቃድህ ሁሉ በምድር ባሉት ቅዱሳንና ክቡራን ላይ ነው። "},
	{4, "4 ወደ ሌላ ለሚፋጠኑት መከራቸው ይበዛል፤ የቍርባናቸውን ደም እኔ አላፈስሰውም፥ ስማቸውንም በከንፈሬ አልጠራም። "},
	{5, "5 እግዚአብሔር የርስቴ እድል ፈንታና ጽዋዬ ነው፥ ዕጣዬንም የምታጠና አንተ ነህ። "},
	{6, "6 ገመድ ባማረ ስፍራ ወደቀችልኝ፥ ርስቴም ተዋበችልኝ። "},
	{7, "7 የመከረኝን እግዚአብሔርን እባርካለሁ፤ ደግሞም በሌሊት ኵላሊቶቼ ይገሥጹኛል። "},
	{8, "8 ሁልጊዜ እግዚአብሔርን በፊቴ አየዋለሁ፤ በቀኜ ነውና አልታወክም። "},
	{9, "9 ስለዚህ ልቤን ደስ አለው ምላሴም ሐሴት አደረገች፤ ሥጋዬም ደግሞ በተስፋ ታድራለች፤ "},
	{10, "10 ነፍሴን በሲኦል አትተዋትምና፥ ቅዱስህንም መበስበስን ያይ ዘንድ አትተወውም። "},
	{11, "11 የሕይወትን መንገድ አሳየኸኝ፤ ከፊትህ ጋር ደስታን አጠገብኸኝ፥ በቀኝህም የዘላለም ፍሥሐ አለ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct am17 poems[] = {
	{1, "1 የዳዊት ጸሎት።1 አቤቱ፥ ጽድቄን ስማ ጩኸቴንም አድምጥ፤ በተንኰለኛም ከንፈር ያልሆነውን ጸሎቴን አድምጥ። "},
	{2, "2 ፍርዴ ከፊትህ ይውጣ፥ ዓይኖችህም በቅንነት ይዩ። "},
	{3, "3 ልቤን ፈተንኸው በሌሊትም ጐበኘኸኝ፤ ፈተንኸኝ፥ ምንም አላገኘህብኝም። "},
	{4, "4 የሰውን ሥራ አፌ እንዳይናገር ፈቃዴ ነው፤ ስለ ከንፈሮችህ ቃል ጭንቅ የሆኑ መንገዶችን ጠበቅሁ። "},
	{5, "5 እግሮች እንዳይናወጡ አረማመዴን በመንገድህ አጽና። "},
	{6, "6 አቤቱ፥ ሰምተኸኛልና ወደ አንተ ጠራሁ፤ ጆሮህን ወደ እኔ አዘንብል፥ ቃሌንም ስማ። "},
	{7, "7 የሚያምኑህን ከሚቃወሙ በቀኝህ የምታድናቸው፥ ቸርነትህን ድንቅ አድርገህ ግለጠው። "},
	{8, "8 እንደ ዓይን ብሌን ጠብቀኝ፥ በክንፎችህ ጥላ ሰውረኝ፥ "},
	{9, "9 ከሚያስጨንቁኝ ከኃጢአተኞች፥ ነፍሴንም ከሚከብቡአት ከጠላቶቼ። "},
	{10, "10 አንጀታቸውን በስብ ቋጠሩ፥ በአፋቸውም ትንቢትን ተናገሩ። "},
	{11, "11 አሁንም እርምጃችንን ከበቡ፤ ዓይናቸውን ወደ ምድር ዝቅ ዝቅ አደረጉ። "},
	{12, "12 እርሱ ንጥቂያን እንደሚናፍቅ አንበሳ ተሸጕጦም እንደሚኖር እንደ አንበሳ ደቦል ነው። "},
	{13, "13 አቤቱ፥ ተነሥ፤ ቀድመህ ወደ ታች ጣለው፤ ነፍሴን ከኃጢአተኛ በሰይፍህ አድናት። "},
	{14, "14 አቤቱ፥ ከሰዎች፥ እድል ፈንታቸው በሕይወታቸው ከሆነች ከዚህ ዓለም ሰዎች በእጅህ አድነኝ፤ ከሰወርኸው መዝገብህ ሆዳቸውን አጠገብህ፤ ልጆቻቸው ብዙ ናቸው የተረፋቸውንም ለሕፃናቶቻቸው ያተርፋሉ። "},
	{15, "15 እኔ ግን በጽድቅ ፊትህን አያለሁ፤ ክብርህን ሳይ እጠግባለሁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct am18 poems[] = {
	{1, "1 ለመዘምራን አለቃ ከሳኦል እጅና ከጠላቶቹ ሁሉ እጅ እግዚአብሔር ባዳነው ቀን በዚህ መዝሙር ቃል ለእግዚአብሔር የተናገረው የእግዚአብሔር ባሪያ የዳዊት መዝሙር። እንዲህም አለ።1 አቤቱ ጕልበቴ ሆይ፥ እወድድሃለሁ። "},
	{2, "2 እግዚአብሔር ዓለቴ፥ አምባዬ፥ መድኃኒቴ፥ አምላኬ፥ በእርሱም የምተማመንበት ረዳቴ፥ መታመኛዬና የደኅንነቴ ቀንድ መጠጊያዬም ነው። "},
	{3, "3 ምስጋና የሚገባውን እግዚአብሔርን እጠራለሁ፥ ከጠላቶቼም እድናለሁ። "},
	{4, "4 የሞት ጣር ያዘኝ፥ የዓመፅ ፈሳሽም አስፈራኝ፤ "},
	{5, "5 የሲኦል ጣር ከበበኝ፤ የሞት ወጥመድም ደረሰብኝ። "},
	{6, "6 በጨነቀኝ ጊዜ እግዚአብሔርን ጠራሁት፥ ወደ አምላኬም ጮኽሁ፤ ከመቅደሱም ቃሌን ሰማኝ፥ ጩኸቴም በፊቱ ወደ ጆሮው ገባ። "},
	{7, "7 ምድርም ተንቀጠቀጠች ተናወጠችም፥ የተራሮችም መሠረቶች ተነቃነቁ፥ እግዚአብሔርም ተቈጥቶአልና ተንቀጠቀጡ። "},
	{8, "8 ከቍጣው ጢስ ወጣ፥ ከፊቱም የሚበላ እሳት ነደደ፤ ፍምም ከእርሱ በራ። "},
	{9, "9 ሰማዮችን ዝቅ ዝቅ አደረገ ወረደም፥ ጨለማ ከእግሩ በታች ነበረ። "},
	{10, "10 በኪሩቤልም ላይ ተቀምጦ በረረ፥ በነፋስም ክንፍ በረረ። "},
	{11, "11 መሰወሪያውን ጨለማ አደረገ፤ በዙሪያውም ድንኳኑ፤ በደመናት ውስጥ የጨለማ ውኃ ነበረ። "},
	{12, "12 በፊቱ ካለው ብርሃን የተነሣ ደመናትና በረዶ የእሳት ፍምም አለፉ። "},
	{13, "13 እግዚአብሔርም ከሰማያት አንጐደጐደ፥ ልዑልም ቃሉን ሰጠ። "},
	{14, "14 ፍላጻውን ላከ በተናቸውም፤ መብረቆችን አበዛ አወካቸውም። "},
	{15, "15 አቤቱ፥ ከዘለፋህ ከመዓትህም መንፈስ እስትንፋስ የተነሣ፥ የውኆች ምንጮች ታዩ፥ የዓለም መሠረቶችም ተገለጡ። "},
	{16, "16 ከላይ ሰደደ ወሰደኝም፥ ከብዙ ውኆችም አወጣኝ። "},
	{17, "17 ከብርቱዎች ጠላቶቼ ከሚጠሉኝም አዳነኝ፥ በርትተውብኝ ነበርና። "},
	{18, "18 በመከራዬ ቀን ደረሱብኝ፤ እግዚአብሔር ግን ደገፋዬ ሆነ። "},
	{19, "19 ወደ ሰፊ ስፍራም አወጣኝ፤ ወድዶኛልና አዳነኝ። "},
	{20, "20 እግዚአብሔር እንደ ጽድቄ ይከፍለኛል፤ እንደ እጄ ንጽሕና ይመልስልኛል። "},
	{21, "21 የእግዚአብሔርን መንገድ ጠብቄአለሁና፥ በአምላኬም አላመፅሁም። "},
	{22, "22 ፍርዱ ሁሉ በፊቴ ነበረና፥ ሥርዓቱንም ከፊቴ አላራቅሁም። "},
	{23, "23 በእርሱ ዘንድ ቅን ነበርሁ፥ ከኃጢአቴም ተጠበቅሁ። "},
	{24, "24 እግዚአብሔርም እንደ ጽድቄ እንደ እጄም ንጽሕና በዓይኖቹ ፊት መለሰልኝ። "},
	{25, "25 ከቸር ሰው ጋር ቸር ሆነህ ትገኛለህ፤ ከቅን ሰው ጋር ቅን ሆነህ ትገኛለህ፤ "},
	{26, "26 ከንጹሕ ጋር ንጹሕ ሆነህ ትገኛለህ፤ ከጠማማም ጋር ጠማማ ሆነህ ትገኛለህ። "},
	{27, "27 አንተ የተጠቃውን ሕዝብ ታድናለህና፥ የትዕቢተኞችን ዓይን ግን ታዋርዳለህ። "},
	{28, "28 አንተ መብራቴን ታበራለህና፤ እግዚአብሔር አምላኬ ጨለማዬን ያበራል። "},
	{29, "29 በአንተ ከጥፋት እድናለሁና በአምላኬም ቅጥሩን እዘልላለሁ። "},
	{30, "30 የአምላኬ መንገድ ፍጹም ነው፥ የእግዚአብሔር ቃል የነጠረ ነው፥ በእርሱ ለሚታመኑት ሁሉ ጋሻ ነው። "},
	{31, "31 ከእግዚአብሔር በቀር አምላክ ማን ነው? ከአምላካችን በቀር አምላክ ማን ነው? "},
	{32, "32 ኃይልን የሚያስታጥቀኝ መንገዴንም የሚያቃና፥ "},
	{33, "33 እግሮቼን እንደ ብሖር እግሮች የሚያረታ በኮረብቶችም የሚያቆመኝ እግዚአብሔር ነው። "},
	{34, "34 እጆቼን ሰልፍ ያስተምራል፥ በክንዴም የናስ ቀስት እገትራለሁ። "},
	{35, "35 ለደኅንነቴም መታመኛን ሰጠኸኝ፥ ቀኝህም ትረዳኛለች፥ ትምህርትህም ለዘላለም ታጠናኛለች፥ ተግሣጽህም ታስተምረኛለች። "},
	{36, "36 አረማመዴን በበታቼ አሰፋህ፥ እግሮቼም አልተንሸራተቱም። "},
	{37, "37 ጠላቶቼን አሳድዳቸዋለሁ እይዛቸዋለሁም፥ እስካጠፋቸውም ድረስ አልመለስም። "},
	{38, "38 አስጨንቃቸዋለሁ መቆምም አይችሉም፥ ከእግሬም በታች ይወድቃሉ። "},
	{39, "39 ለሰልፍም ኃይልን ታስታጥቀኛለህ፤ በበላዬ የቆሙትን ሁሉ በበታቼ ታስገዛቸዋለህ። "},
	{40, "40 የጠላቶቼን ጀርባ ሰጠኸኝ፥ የሚጠሉኝንም አጠፋሃቸው። "},
	{41, "41 ጮኹ የሚረዳቸውም አልነበረም፤ ወደ እግዚአብሔርም ጮኹ አልሰማቸውም። "},
	{42, "42 እንደ ትቢያ በነፋስ ፊት እፈጫቸዋለሁ፥ እንደ አደባባይም ጭቃ እረግጣቸዋለሁ። "},
	{43, "43 ከሕዝብ ክርክር ታድነኛለህ፥ የአሕዛብም ራስ አድርገህ ትሾመኛለህ፥ የማላውቀው ሕዝብም ይገዛልኛል። "},
	{44, "44 በጆሮ ሰምተው ተገዙልኝ፤ የባዕድ ልጆች ደለሉኝ። "},
	{45, "45 የባዕድ ልጆች አረጁ፥ በመንገዳቸውም ተሰናከሉ። "},
	{46, "46 እግዚአብሔር ሕያው ነው፥ አምላኬም ቡሩክ ነው፥ የመድኃኒቴም አምላክ ከፍ ከፍ ይበል። "},
	{47, "47 በቀሌን የሚመልስልኝ አምላክ አሕዛብን በበታቼ ያስገዛልኛል። "},
	{48, "48 ከጠላቶቼ የሚታደገኝ እርሱ ነው፤ በእኔም ላይ ከቆሙ ከፍ ከፍ ታደርገኛለህ፥ ከግፈኛ ሰው ታድነኛለህ። "},
	{49, "49 አቤቱ፥ ስለዚህ በአሕዛብ ዘንድ አመሰግንሃለሁ፥ ለስምህም እዘምራለሁ። "},
	{50, "50 የንጉሡን መድኃኒት ታላቅ ያደርጋል፥ ቸርነቱንም ለቀባው ለዳዊትና ለዘሩ ለዘላለም ይሰጣል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct am19 poems[] = {
	{1, "1 ለመዘምራን አለቃ የዳዊት መዝሙር።1 ሰማያት የእግዚአብሔርን ክብር ይናገራሉ፥ የሰማይም ጠፈር የእጁን ሥራ ያወራል። "},
	{2, "2 ቀን ለቀን ነገርን ታወጣለች፥ ሌሊትም ለሌሊት እውቀትን ትናገራለች። "},
	{3, "3 ነገር የለም መናገርም የለም፥ ድምፃቸውም አይሰማም። "},
	{4, "4 ድምፃቸው ወደ ምድር ሁሉ፥ ቃላቸውም እስከ ዓለም ዳርቻ ወጣ። "},
	{5, "5 በእነርሱም ውስጥ የፀሐይን ድንኳን አደረገ፥ እርሱም እንደ ሙሽራ ከእልፍኙ ይወጣል፤ እንደ አርበኛ በመንገዱ ለመሮጥ ደስ ይለዋል። "},
	{6, "6 አወጣጡ ከሰማያት ዳርቻ ነው፥ ዙረቱም እስከ ዳርቻቸው ነው፤ ከትኩሳቱም የሚሰወር የለም። "},
	{7, "7 የእግዚአብሔር ሕግ ፍጹም ነው፤ ነፍስን ይመልሳል፤ የእግዚአብሔር ምስክር የታመነ ነው፤ ሕፃናትን ጠቢባን ያደርጋል። "},
	{8, "8 የእግዚአብሔር ሥርዓት ቅን ነው፥ ልብንም ደስ ያሰኛል፤ የእግዚአብሔር ትእዛዝ ብሩህ ነው፥ ዓይንንም ያበራል። "},
	{9, "9 የእግዚአብሔር ፍርሃት ንጹሕ ነው፤ ለዘላለም ይኖራል፤ የእግዚአብሔር ፍርድ እውነትና ቅንነት በአንድነት ነው። "},
	{10, "10 ከወርቅና ከክቡር ዕንቍ ይልቅ ይወደዳል፤ ከማርና ከማር ወለላም ይጣፍጣል። "},
	{11, "11 ባሪያህ ደግሞ ይጠብቀዋል፤ በመጠበቁም እጅግ ይጠቀማል። "},
	{12, "12 ስሕተትን ማን ያስተውላታል? ከተሰወረ ኃጢአት አንጻኝ። "},
	{13, "13 የድፍረት ኃጢአት እንዳይገዛኝ ባሪያህን ጠብቅ፤ የዚያን ጊዜ ፍጹም እሆናለሁ፥ ከታላቁም ኃጢአት እነጻለሁ። "},
	{14, "14 አቤቱ፥ ረድኤቴ መድኃኒቴም፥ የአፌ ቃልና የልቤ አሳብ በፊትህ ያማረ ይሁን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct am20 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የዳዊት መዝሙር።1 በመከራ ቀን እግዚአብሔር ይስማህ፤ የያዕቆብ አምላክ ስም ያቁምህ። "},
	{2, "2 ከመቅደሱ ረድኤትን ይላክልህ፥ ከጽዮንም ያጥናህ። "},
	{3, "3 ቍርባንህን ሁሉ ያስብልህ፤ የሚቃጠል መሥዋዕትህን ያለምልምልህ። "},
	{4, "4 እንደ ልብህ ይስጥህ ፈቃድህንም ሁሉ ይፈጽምልህ። "},
	{5, "5 በማዳንህ ደስ ይለናል፤ በአምላካችን ስም ከፍ ከፍ እንላለን፤ ልመናህን ሁሉ እግዚአብሔር ይፈጽምልህ። "},
	{6, "6 እግዚአብሔር የቀባውን እንዳዳነው ዛሬ አወቅሁ፤ ከሰማይ መቅደሱ ይመልስለታል፤ በቀኙ ብርታት ማዳን። "},
	{7, "7 እነዚያ በሰረገላ እነዚያም በፈረስ ይታመናሉ፤ እኛ ግን በአምላካችን በእግዚአብሔር ስም ከፍ ከፍ እንላለን። "},
	{8, "8 እነርሱ ተሰነካክለው ወደቁ፤ እኛ ግን ተነሣን፥ ጸንተንም ቆምን። "},
	{9, "9 አቤቱ፥ ንጉሥን አድነው፥ በጠራንህም ቀን ስማን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct am21 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የዳዊት መዝሙር።1 አቤቱ፥ በኃይልህ ንጉሥ ደስ ይለዋል፤ በማዳንህ እጅግ ሐሤትን ያደርጋል። "},
	{2, "2 የልቡን ፈቃድ ሰጠኽው፥ የከንፈሩንም ልመና አልከለከልኸውም። "},
	{3, "3 በበጎ በረከት ደርሰህለታልና፤ ከክቡር ዕንቍ የሆነ ዘውድን በራሱ ላይ አኖርህ። "},
	{4, "4 ሕይወትን ለመነህ ሰጠኸውም፥ ለረጅም ዘመን ለዘላለሙ። "},
	{5, "5 በማዳንህ ክብሩ ታላቅ ነው፤ ክብርንና ምስጋናን ጨመርህለት። "},
	{6, "6 የዘላለም በረከትን ሰጥተኸዋልና። በፊትህም ደስታ ደስ ታሰኘዋለህ። "},
	{7, "7 ንጉሥ በእግዚአብሔር ተማምኖአልና፥ በልዑልም ምሕረት አይናወጥም። "},
	{8, "8 እጅህ ጠላቶችህን ሁሉ ታግኛቸው፥ ቀኝህም የሚጠሉህን ሁሉ ታግኛቸው። "},
	{9, "9 በተቈጣህም ጊዜ እንደ እሳት እቶን አድርጋቸው፤ እግዚአብሔር በቍጣው ያጠፋቸዋል፥ እሳትም ትበላቸዋለች። "},
	{10, "10 ፍሬአቸውን ከምድር ዘራቸውንም ከሰው ልጆች ታጠፋለህ። "},
	{11, "11 ክፋትን በአንተ ላይ ዘርግተዋልና፥ የማይቻላቸውንም ምክር አሰቡ። "},
	{12, "12 ወደ ኋላቸው ትመልሳቸዋለህ፤ ፍላጻን በፊታቸው ላይ ታዘጋጃለህ። "},
	{13, "13 አቤቱ፥ በኃይልህ ከፍ ከፍ በል፤ ጽናትህንም እናመሰግናለን እንዘምርማለን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct am22 poems[] = {
	{1, "1 ለመዘምራን አለቃ ስለ ንጋት ኃይል፤ የዳዊት መዝሙር።1 አምላኬ፥ አምላኬ፥ ለምን ተውኸኝ? እኔን ከማዳንና ከጩኸቴ ቃል ሩቅ ነህ። "},
	{2, "2 አምላኬ፥ በቀን ወደ አንተ እጠራለሁ፥ አልመለስህልኝም፤ በሌሊትም እንኳ ዕረፍት የለኝም። "},
	{3, "3 በእስራኤል የተመሰገንህ አንተ ግን በቅድስና ትኖራለህ። "},
	{4, "4 አባቶቻችን አንተን ተማመኑ፥ ተማመኑ አንተም አዳንሃቸው። "},
	{5, "5 ወደ አንተ ጮኹ አመለጡም፥ አንተንም ተማመኑ አላፈሩም። "},
	{6, "6 እኔ ግን ትል ነኝ ሰውም አይደለሁም፤ የሰው ማላገጫ በሕዝብም ዘንድ የተናቅሁ ነኝ። "},
	{7, "7 የሚያዩኝ ሁሉ ይላገዱብኛል፤ ራሳቸውን እየነቀነቁ በከንፈሮቻቸው እንዲህ ይላሉ። "},
	{8, "8 በእግዚአብሔር ተማመነ፥ እርሱንም ያድነው፤ ቢወድደውስ ያድነው። "},
	{9, "9 አንተ ግን ከሆድ አውጥተኸኛልና፥ በእናቴ ጡት ሳለሁም በአንተ ታመንሁ። "},
	{10, "10 ከማኅፀን ጀምሮ በአንተ ላይ ተጣልሁ፤ ከእናቴ ሆድ ጀምረህ አንተ አምላኬ ነህ። "},
	{11, "11 ጭንቀት ቀርባለችና የሚረዳኝም የለምና ከእኔ አትራቅ። "},
	{12, "12 ብዙ በሬዎች ከበቡኝ፥ የሰቡትም ፍሪዳዎች ያዙኝ፤ "},
	{13, "13 እንደ ነጣቂና እንደሚጮኽ አንበሳ በላዬ አፋቸውን ከፈቱ። "},
	{14, "14 እንደ ውኃ ፈሰስሁ፤ አጥንቶቼም ሁሉ ተለያዩ፤ ልቤ እንደ ሰም ሆነ፥ በአንጀቴም መካከል ቀለጠ። "},
	{15, "15 ኃይሌ እንደ ገል ደረቀ፥ በጕሮሮዬም ምላሴ ተጣጋ፥ ወደ ሞትም አሸዋ አወረድኸኝ። "},
	{16, "16 ብዙ ውሾች ከብበውኛልና፤ የክፋተኞች ጉባኤም ያዘኝ፤ እጆቼንና እግሮቼን ቸነከሩኝ። "},
	{17, "17 አጥንቶቼ ሁሉ ተቈጠሩ፤ እነርሱም አዩኝ ተመለከቱኝም። "},
	{18, "18 ልብሶቼን ለራሳቸው ተከፋፈሉ፥ በቀሚሴም ላይ ዕጣ ተጣጣሉ። "},
	{19, "19 አንተ ግን፥ አቤቱ፥ ከእኔ አትራቅ፤ አንተ ጕልበቴ፥ እኔን ለመርዳት ፍጠን። "},
	{20, "20 ነፍሴን ከሰይፍ አድናት፥ ብቻነቴንም ከውሾች እጅ። "},
	{21, "21 ከአንበሳ አፍ አድነኝ፥ ብቻነቴንም አንድ ቀንድ ካላቸው። "},
	{22, "22 ስምህን ለወንድሞቼ እነግራቸዋለሁ፥ በጉባኤም መካከል አመሰግንሃለሁ። "},
	{23, "23 እግዚአብሔርን የምትፈሩ፥ አመስግኑት፤ የያዕቆብ ዘር ሁላችሁ፥ አክብሩት፥ የእስራኤልም ዘር ሁላችሁ፥ ፍሩት። "},
	{24, "24 የችግረኛን ችግር አልናቀምና፥ ቸልም አላለምና፤ ፊቱንም ከእኔ አልሰወረምና፥ ነገር ግን ወደ እርሱ በጮኽሁ ጊዜ ሰማኝ። "},
	{25, "25 በታላቅ ጉባኤ ምስጋናዬ ከአንተ ዘንድ ነው። እርሱን በሚፈሩት ፊት ስእለቴን እሰጣለሁ። "},
	{26, "26 ችግረኞች ይበላሉ፥ ይጠግቡማል፤ እግዚአብሔርንም የሚሹት ያመሰግኑታል፤ ልባቸውም ለዘላለም ሕያው ይሆናል። "},
	{27, "27 የምድር ዳርቻዎች ሁሉ ያስቡ፥ ወደ እግዚአብሔርም ይመለሱ፤ የአሕዛብ ነገዶች ሁሉ በፊቱ ይሰግዳሉ። "},
	{28, "28 መንግሥት ለእግዚአብሔር ነውና፥ እርሱም አሕዛብን ይገዛል። "},
	{29, "29 የምድር ደንዳኖች ሁሉ ይበላሉ ይሰግዳሉም፤ ወደ መሬት የሚወርዱት ሁሉ በፊቱ ይንበረከካሉ፤ ነፍሴም ስለ እርሱ በሕይወት ትኖራለች። "},
	{30, "30 ዘሬ ይገዛለታል፤ የምትመጣው ትውልድ ለእግዚአብሔር ትነግረዋለች፤ "},
	{31, "31 ጽድቁንም ለሚወለደው ሕዝብ፥ እግዚአብሔር ያደረገውን ጽድቁን፥ ይነግራሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view23() {
struct am23 poems[] = {
	{1, "1 የዳዊት መዝሙር።1 እግዚአብሔር እረኛዬ ነው፥ የሚያሳጣኝም የለም። "},
	{2, "2 በለመለመ መስክ ያሳድረኛል፤ በዕረፍት ውኃ ዘንድ ይመራኛል። "},
	{3, "3 ነፍሴን መለሳት፥ ስለ ስሙም በጽድቅ መንገድ መራኝ። "},
	{4, "4 በሞት ጥላ መካከል እንኳ ብሄድ አንተ ከእኔ ጋር ነህና ክፉን አልፈራም፤ በትርህና ምርኵዝህ እነርሱ ያጸናኑኛል። "},
	{5, "5 በፊቴ ገበታን አዘጋጀህልኝ በጠላቶቼ ፊት ለፊት ራሴን በዘይት ቀባህ፥ ጽዋዬም የተረፈ ነው። "},
	{6, "6 ቸርነትህና ምሕረትህ በሕይወቴ ዘመን ሁሉ ይከተሉኛል፥ በእግዚአሔርም ቤት ለዘላለም እኖራለሁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view24() {
struct am24 poems[] = {
	{1, "1 በመጀመሪያ ሰንበት የዳዊት መዝሙር።1 ምድርና ሞላዋ ለእግዚአብሔር ናት፥ ዓለምም በእርስዋም የሚኖሩ ሁሉ። "},
	{2, "2 እርሱ በባሕሮች መሥርቶአታልና፥ በፈሳሾችም አጽንቶአታልና። "},
	{3, "3 ወደ እግዚአብሔር ተራራ ማን ይወጣል? በቅድስናውስ ስፍራ ማን ይቆማል? "},
	{4, "4 እጆቹ የነጹ፥ ልቡም ንጹሕ የሆነ፥ ነፍሱን ለከንቱ ያላነሣ፥ ለባልንጀራውም በሽንገላ ያልማለ። "},
	{5, "5 እርሱ ከእግዚአብሔር ዘንድ በረከትን ከመድኃኒቱ አምላክም ምሕረትን ይቀበላል። "},
	{6, "6 ይህች ትውልድ እርሱን የምትፈልግ ናት፥ የያዕቆብን አምላክ ፊት የምትፈልግ። "},
	{7, "7 እናንት መኳንንቶች፥ በሮችን ክፈቱ፥ የዘላለም ደጆችም ይከፈቱ፥ የክብርም ንጉሥ ይግባ። "},
	{8, "8 ይህ የክብር ንጉሥ ማን ነው? እግዚአብሔር ነው፥ ብርቱና ኃያል፥ እግዚአብሔር ነው፥ በሰልፍ ኃያል። "},
	{9, "9 እናንተ መኳንንቶች፥ በሮችን ክፈቱ፥ የዘላለም ደጆችም ይከፈቱ፥ የክብርም ንጉሥ ይግባ። "},
	{10, "10 ይህ የክብር ንጉሥ ማን ነው? የጭፍሮች አምላክ እግዚአብሔር፥ እርሱ የክብር ንጉሥ ነው። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view25() {
struct am25 poems[] = {
	{1, "1 (የዳዊት መዝሙር።1 አቤቱ፥ ወደ አንተ ነፍሴን አነሣለሁ። "},
	{2, "2 አምላኬ፥ አንተን ታመንሁ፤ አልፈር፥ ጠላቶቼ በእኔ አይሣቁብኝ። "},
	{3, "3 አንተን ተስፋ የሚያደርጉ አያፍሩም፤ በከንቱ የሚገበዙ ያፍራሉ። "},
	{4, "4 አቤቱ፥ መንገድህን አመልክተኝ፥ ፍለጋህንም አስተምረኝ። "},
	{5, "5 አንተ የመድኃኒቴ አምላክ ነህና በእውነትህ ምራኝ፥ አስተምረኝም፤ ቀኑን ሁሉ አንተን ተስፋ አድርጌአለሁ። "},
	{6, "6 አቤቱ፥ ምሕረትህንና ቸርነትህን አስብ፥ ከጥንት ጀምሮ ናቸውና። "},
	{7, "7 የልጅነቴን ኃጢአትና መተላለፍ አታስብብኝ፤ አቤቱ፥ ስለ ቸርነትህ ብዛት እንደ ምሕረትህ አስበኝ። "},
	{8, "8 እግዚአብሔር ቸር ቅንም ነው፤ ስለዚህ ኃጢአተኞችን በመንገድ ይመራቸዋል። "},
	{9, "9 ገሮችን በፍርድ ይመራል፥ ለገሮችም መንገድን ያስተምራቸዋል። "},
	{10, "10 የእግዚአብሔር መንገድ ሁሉ ቸርነትና እውነት ነው። ቃል ኪዳኑንና ምስክሩን ለሚጠብቁ። "},
	{11, "11 አቤቱ፥ ኃጢአቴ እጅግ ነውና ስለ ስምህ ይቅር በለኝ። "},
	{12, "12 እግዚአብሔርን የሚፈራ ሰው ማን ነው? በሚመርጠው መንገድ ያስተምረዋል። "},
	{13, "13 ነፍሱ በመልካም ታድራለች፥ ዘሩም ምድርን ይወርሳል። "},
	{14, "14 እግዚአብሔር ለሚፈሩት ኃይላቸው ነው፥ ቃል ኪዳኑንም ያስታውቃቸዋል። "},
	{15, "15 እርሱ እግሮቼን ከወጥመድ ያወጣቸዋልና ዓይኖቼ ሁልጊዜ ወደ እግዚአብሔር ናቸው። "},
	{16, "16 እኔ ብቻዬንና ችግረኛ ነኝና ፊትህን ወደ እኔ አድርግ ማረኝም። "},
	{17, "17 የልቤ ችግር ብዙ ነው፤ ከጭንቀቴ አውጣኝ። "},
	{18, "18 ድካሜንና መከራዬን እይ፥ ኃጢአቴንም ሁሉ ይቅር በለኝ። "},
	{19, "19 ጠላቶቼ እንደ በዙ እይ፥ የግፍም ጥል ጠልተውኛል። "},
	{20, "20 ነፍሴን ጠብቅና አድነኝ፤ አንተን ታምኛለሁና አልፈር። "},
	{21, "21 አንተን ተስፋ አድርጌአለሁና የውሃትና ቅንነት ይጠብቁኝ። "},
	{22, "22 አቤቱ፥ እስራኤልን ከመከራው ሁሉ አድነው። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view26() {
struct am26 poems[] = {
	{1, "1 የዳዊት መዝሙር።1 አቤቱ፥ እኔ በየውሃቴ ሄጃለሁና ፍረድልኝ፤ በእግዚአብሔርም አምኛለሁና አልናወጥም። "},
	{2, "2 አቤቱ፥ ፍተነኝ መርምረኝም፤ ኵላሊቴንና ልቤን ፍተን። "},
	{3, "3 ምሕረትህ በዓይኔ ፊት ነውና፥ በእውነትህም ተመላለስሁ። "},
	{4, "4 በከንቱ ሸንጎ አልተቀመጥሁም፥ ከዓመፀኞችም ጋር አልገባሁም። "},
	{5, "5 የክፉዎችን ማኅበር ጠላሁ፥ ከዝንጉዎችም ጋር አልቀመጥም። "},
	{6, "6 እጆቼን በንጽሕና አጥባለሁ፤ አቤቱ፥ መሠዊያህን እዞራለሁ፥ "},
	{7, "7 የምስጋናን ድምፅ እሰማ ዘንድ፥ ተአምራትህንም ሁሉ እነግር ዘንድ። "},
	{8, "8 አቤቱ፥ የቤትህን ስፍራ የክብርህንም ማደሪያ ቦታ ወደድሁ። "},
	{9, "9 ከኃጢአተኞች ጋር ነፍሴን፥ ከደም ሰዎችም ጋር ሕይወቴን አታጥፋ። "},
	{10, "10 በእጃቸው ተንኰል አለባቸው፥ ቀኛቸውም መማለጃ ተሞልታለች። "},
	{11, "11 እኔ ግን በየውሃቴ ሄጃለሁ፤ አድነኝ ማረኝም። "},
	{12, "12 እግሮቼ በቅንነት ቆመዋልና፤ አቤቱ፥ በማኅበር አመሰግንሃለሁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view27() {
struct am27 poems[] = {
	{1, "1 ሳይቀባ፤ የዳዊት መዝሙር።1 እግዚአብሔር ብርሃኔና መድኃኒቴ ነው፤ የሚያስፈራኝ ማን ነው? እግዚአብሔር የሕይወቴ መታመኛዋ ነው፤ የሚያስደነግጠኝ ማን ነው? "},
	{2, "2 ክፉዎች፥ አስጨናቂዎቼ ጠላቶቼም፥ ሥጋዬን ይበሉ ዘንድ በቀረቡ ጊዜ፥ እነርሱ ተሰናከሉና ወደቁ። "},
	{3, "3 ሠራዊትም ቢሰፍርብኝ ልቤ አይፈራም፤ ሰልፍም ቢነሣብኝ በዚህ እተማመናለሁ። "},
	{4, "4 እግዚአብሔርን አንዲት ነገር ለመንሁት እርስዋንም እሻለሁ፤ በሕይወቴ ዘመን ሁሉ በእግዚአብሔር ቤት እኖር ዘንድ፥ እግዚአብሔርን ደስ የሚያሰኘውንም አይ ዘንድ፥ መቅደሱንም እመለከት ዘንድ። "},
	{5, "5 በመከራዬ ቀን በድንኳኑ ሰውሮኛልና፥ በድንኳኑም መሸሸጊያ ሸሽጎኛልና፥ በዓለት ላይ ከፍ ከፍ አድርጎኛልና። "},
	{6, "6 እነሆ፥ አሁን በዙሪያ ባሉ በጠላቶቼ ላይ ራሴን ከፍ ከፍ አደረገ፤ በድንኳኑም የእልልታ መሥዋዕትን ሠዋሁ፥ ለእግዚአብሔር እቀኛለሁ እዘምርለትማለሁ። "},
	{7, "7 አቤቱ፥ ወደ አንተ የጮኽሁትን ቃሌን ስማኝ። ማረኝና አድምጠኝ። "},
	{8, "8 አንተ ፊቴን እሹት ባልህ ጊዜ። አቤቱ፥ ፊትህን እሻለሁ ልቤ አንተን አለ። "},
	{9, "9 ፊትህን ከእኔ አትሰውር፥ ተቈጥተህ ከባሪያህ ፈቀቅ አትበል፤ ረዳት ሁነኝ፥ አትጣለኝም፥ የመድኃኒቴም አምላክ ሆይ፥ አትተውኝ። "},
	{10, "10 አባቴና እናቴ ትተውኛልና፥ እግዚአብሔር ግን ተቀበለኝ። "},
	{11, "11 አቤቱ፥ መንገድህን አስተምረኝ፥ ስለ ጠላቶቼም በቀና መንገድ ምራኝ። "},
	{12, "12 የሐሰት ምስክሮችና ዓመፀኞች ተነሥተውብኛልና ለጠላቶቼ ፈቃድ አትስጠኝ። "},
	{13, "13 የእግዚአብሔርን ቸርነት በሕያዋን ምድር አይ ዘንድ አምናለሁ። "},
	{14, "14 እግዚአብሔርን ተስፋ አድርግ፤ በርታ፥ ልብህም ይጽና፤ እግዚአብሔርን ተስፋ አድርግ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view28() {
struct am28 poems[] = {
	{1, "1 የዳዊት መዝሙር።1 አቤቱ፥ ወደ አንተ እጠራለሁ፤ ዝም ብትለኝ ወደ ጓድጓድ እንደሚወርዱት እንዳልመስል፥ አንተ አምላኬ፥ ዝም አትበለኝ። "},
	{2, "2 ወደ መቅደስህ ማደሪያ እጄን ባነሣሁ ጊዜ፥ ወደ አንተ የጮኽሁትን የልመናዬን ቃል ስማ። "},
	{3, "3 ከኃጥኣንና ከክፉ አድራጊዎች ጋር ነፍሴን አትውሰዳት፤ ክፋትም በልባቸው እያለ ከባልንጀራቸው ጋር ሰላም ከሚናገሩት ጋር አትጣለኝ። "},
	{4, "4 እንደ ሥራቸው እንደ አካሄዳቸውም ክፉት ስጣቸው፤ እንደ እጃቸውም ሥራ ስጣቸው፤ ፍዳቸውን ወደ ራሳቸው መልስ። "},
	{5, "5 ወደ እግዚአብሔር ሥራ ወደ እጆቹም አደራረግ አላሰቡምና ያፈርሳቸዋል እንጂ አይሠራቸውም። "},
	{6, "6 የልመናዬን ቃል ሰምቶኛልና እግዚአብሔር ይመስገን። "},
	{7, "7 እግዚአብሔር ኃይሌና ጋሻዬ ነው፤ ልቤ በእርሱ ታመነ እኔም ተረዳሁ፤ ሥጋዬም ደስ ይለዋል፥ ፈቅጄም አመሰግነዋለሁ። "},
	{8, "8 እግዚአብሔር ለሕዝቡ ኃይላቸው ነው፥ ለቀባውም የመድኃኒቱ መታመኛ ነው። "},
	{9, "9 ሕዝብህን አድን፥ ርስትህንም ባርክ፤ ጠብቃቸው፥ ለዘላለሙም ከፍ ከፍ አድርጋቸው። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view29() {
struct am29 poems[] = {
	{1, "1 ከድንኳን በመውጣት ጊዜ፤ የዳዊት መዝሙር።1 የአምላክ ልጆች ሆይ፥ ለእግዚአብሔር አምጡ። ክብርንና ምስጋናን ለእግዚአብሔር አምጡ። "},
	{2, "2 የስሙን ክብር ለእግዚአብሔር አምጡ፥ በቅድስናው ስፍራ ለእግዚአብሔር ስገዱ። "},
	{3, "3 የእግዚአብሔር ድምፅ በውኆች ላይ፥ የክብር አምላክ አንጐደጐደ፥ እግዚአብሔር በብዙ ውኆች ላይ። "},
	{4, "4 የእግዚአብሔር ድምፅ በኃይል ነው፤ የእግዚአብሔር ድምፅ በታላቅ ክብር ነው። "},
	{5, "5 የእግዚአብር ድምፅ ዝግባን ይሰብራል፤ እግዚአብሔር የሊባኖስን ዝግባ ይቀጠቅጣል። "},
	{6, "6 እንደ ጥጃ ሊባኖስን፥ አንድ ቀን እንዳለው አውሬ ልጅ ስርዮንን ያዘልላቸዋል። "},
	{7, "7 የእግዚአብሔር ድምፅ የእሳቱን ነበልባል ይቈርጣል። "},
	{8, "8 የእግዚአብሔር ድምፅ ምድረ በዳውን ያናውጣል፥ እግዚአብሔር የቃዴስን ምድረ በዳ ያናውጣል። "},
	{9, "9 የእግዚአብሔር ድምፅ ዋላዎችን ያጠነክራቸዋል፥ ጫካዎቹንም ይገልጣል፤ ሁሉም በመቅደሱ። ምስጋና ይላል። "},
	{10, "10 እግዚአብሔር የጥፋት ውኃን ሰብስቦአል፤ እግዚአብሔር ለዘላለም ንጉሥ ሆኖ ይቀመጣል። "},
	{11, "11 እግዚአብሔር ለሕዝቡ ኃይልን ይሰጣል፤ እግዚአብሔር ሕዝቡን በሰላም ይባርካል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view30() {
struct am30 poems[] = {
	{1, "1 ለቤቱ መመረቅ ምስጋና፤ የዳዊት መዝሙር።1 አቤቱ፥ ተቀብለኸኛልና፥ ጠላቶቼንም ደስ አላሰኘህብኝምና ከፍ ከፍ አደርግሃለሁ። "},
	{2, "2 አቤቱ አምላኬ፥ ወደ አንተ ጮኽሁ ምሕረትም አደረግህልኝ። "},
	{3, "3 አቤቱ፥ ነፍሴን ከሲኦል አወጣሃት፥ ወደ ጕድጓድም እንዳልወርድ አዳንኸኝ። "},
	{4, "4 ቅዱሳን ሆይ፥ ለእግዚአብሔር ዘምሩ፥ ለቅድስናውም መታሰቢያ አመስግኑ። "},
	{5, "5 ቍጣው ለጥቂት ጊዜ ነው፥ ሞገሱ ግን ለሕይወት ዘመን፤ ልቅሶ ማታ ይመጣል፥ ጥዋት ግን ደስታ ይሆናል። "},
	{6, "6 እኔም በደስታዬ። ለዘላለም አልታወክም አልሁ። "},
	{7, "7 አቤቱ፥ በፈቃድህ ለሕይወቴ ኃይልን ሰጠሃት፤ ፊትህን መለስህ፥ እኔም ደነገጥሁ። "},
	{8, "8 አቤቱ፥ ወደ አንተ ጠራሁ፥ ወደ አምላኬም ለመንሁ። "},
	{9, "9 ወደ ጥፋት ብወርድ በደሜ ምን ጥቅም አለ? አፈር ያመሰግንሃልን? እውነትህንም ይናገራልን? "},
	{10, "10 እግዚአብሔር ሰማ ማረኝም፤ እግዚአብሔር ረዳቴ ሆነኝ። "},
	{11, "11 ክብሬ ትዘምርልህ ዘንድ ዝምም እንዳትል ልቅሶዬን ለደስታ ለወጥህልኝ፥ ማቄን ቀድደህ ደስታንም አስታጠቅኸኝ። "},
	{12, "12 አቤቱ አምላኬ፥ ለዘላለም አመሰግንሃለሁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view31() {
struct am31 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ በማድነቅ ጊዜ፤ የዳዊት መዝሙር።1 አቤቱ አንተን ታመንሁ፤ ለዘላለም አልፈር፤ በጽድቅህም አድነኝ። "},
	{2, "2 ጆሮህን ወደ እኔ አዘንብል፥ ፈጥነህም አድነኝ፤ ታድነኝ ዘንድ መታመኛ አምላክና የመጠጊያ ቤት ሁነኝ። "},
	{3, "3 አምባዬና መጠጊያዬ አንተ ነህና ስለ ስምህ መንገዴን አቅና ምራኝም። "},
	{4, "4 አንተ መታመኛዬ ነህና ከደበቁብኝ ወጥመድ አውጣኝ። "},
	{5, "5 በእጅህ ነፍሴን እሰጣለሁ፤ የእውነት አምላክ አቤቱ፥ ተቤዥተኸኛል። "},
	{6, "6 ከንቱ ምናምንቴነትን የጠበቁትን ጠላህ፤ እኔ ግን በእግዚአብሔር ታመንሁ። "},
	{7, "7 መከራዬን አይተሃልና፥ ነፍሴንም ከጭንቀት አድነሃታልና በምሕረትህ ደስ ይለኛል ሐሤትም አደርጋለሁ። "},
	{8, "8 በጠላቴ እጅ አልዘጋኸኝም፥ በሰፊም ስፍራ እግሮቼን አቆምህ። "},
	{9, "9 ተቸግሬአለሁና አቤቱ ምራኝ፤ ዓይኔም ከኃዘን የተነሣ ተፈጀች፥ ነፍሴም ሆዴም። "},
	{10, "10 ሕይወቴ በኅዘን አልቃለችና፥ ዓመታቴም በልቅሶ ጩኸት፤ ኃይሌ በችግር ደከመ፥ አጥንቶቼም ተነዋወጡ። "},
	{11, "11 በጠላቶቼ ዘንድ ተነወርኹ፥ ይልቁንም በጎረቤቶቼ ዘንድ፥ ለሚያውቁኝም ፍርሃት ሆንሁ፤ በሜዳ ያዩኝም ከእኔ ሸሹ። "},
	{12, "12 እንደ ሞተ ሰው ከልብ ተረሳሁ፥ እንደ ተበላሸ ዕቃም ሆንሁ። "},
	{13, "13 የብዙ ሰዎችን ስድብ ሰምቻለሁና፤ በዙሪያው ፍርሃት ነበረ፤ በላዬ በአንድነት በተሰበሰቡ ጊዜ ነፍሴን ለመንጠቅ ተማከሩ። "},
	{14, "14 አቤቱ፥ እኔ ግን በአንተ ታመንሁ፤ አንተ አምላኬ ነህ አልሁ። "},
	{15, "15 ርስቴ በእጅህ ነው፤ ከጠላቶቼ እጅና ከሚያሳድዱኝ አድነኝ። "},
	{16, "16 ፊትህን በባሪያህ ላይ አብራ፥ ስለ ምሕረትህም አድነኝ። "},
	{17, "17 አቤቱ፥ አንተን ጠርቻለሁና አልፈር፤ ክፉዎች ይፈሩ በሲኦልም ዝም ይበሉ። "},
	{18, "18 በድፍረትና በትዕቢት በመናቅም በጻድቅ ላይ የሚናገሩ የሽንገላ ከንፈሮች ድዳ ይሁኑ። "},
	{19, "19 በአንተ ለሚያምኑ በሰው ልጆች ፊት ያዘጋጀሃት ለሚፈሩህም የሰወርሃት፥ ቸርነትህ እንደ ምን በዛች! "},
	{20, "20 በፊትህ መጋረጃ ከሰው ክርክር ትጋርዳቸዋለህ፥ በድንኳንህም ከአንደበት ክርክር ትሸፍናቸዋለህ። "},
	{21, "21 በተከበበ ከተማ የሚያስደንቅ ምሕረቱን በእኔ የገለጠ እግዚአብሔር ይመስገን። "},
	{22, "22 እኔስ ከዓይንህ ፊት ተጣልሁ፥ በድንጋጤ አልሁ፤ አንተ ግን ወደ አንተ በጮኽሁ ጊዜ የልመናዬን ቃል ሰማኸኝ። "},
	{23, "23 ሁላችሁ ቅዱሳኑ፥ እግዚአብሔርን ውደዱት፤ እግዚአብሔር እውነተኞችን ይፈልጋል፥ ትዕቢተኞችንም ፈጽሞ ይበቀላቸዋል። "},
	{24, "24 በእግዚአብሔር የምታምኑ ሁላችሁ፥ በርቱ ልባችሁም ይጥና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view32() {
struct am32 poems[] = {
	{1, "1 የዳዊት ትምህርት።1 መተላለፉ የቀረችለት ኃጢአቱም የተከደነችለት ምስጉን ነው። "},
	{2, "2 እግዚአብሔር በደልን የማይቈጥርበት በመንፈሱም ሽንገላ የሌለበት ሰው ምስጉን ነው። "},
	{3, "3 ሁልጊዜ ከመጮኼ የተነሣ ዝም ባልሁ ጊዜ አጥንቶቼ ተበላሹ፤ "},
	{4, "4 በቀንና በሌሊት እጅህ ከብዳብኛለችና፥ እርጥበቴም ለበጋ ትኵሳት ተለወጠ። "},
	{5, "5 ኃጢአቴን ለአንተ አስታወቅሁ፥ በደሌንም አልሸፈንሁም፤ ለእግዚአብሔር መተላለፌን እነግራለሁ አልሁ፤ አንተም የልቤን ኃጢአት ተውህልኝ። "},
	{6, "6 ስለዚህ ቅዱስ ሁሉ በምቹ ጊዜ ወደ አንተ ይለምናል፤ ብዙ የጥፋት ውኃም ወደ እርሱ አይቀርብም። "},
	{7, "7 አንተ ለእኔ መሸሸጊያዬ ነህ፥ ከጣርም ትጠብቀኛለህ፤ ከከበቡኝ ታድነኝ ዘንድ ደስታዬ ነህ። "},
	{8, "8 አስተምርሃለሁ በምትሄድበትም መንገድ እመራሃለሁ፤ ዓይኖቼን በአንተ ላይ አጠናለሁ። "},
	{9, "9 ወደ አንተ እንዳይቀርቡ በልባብና በልጓም ጉንጫቸውን እንደሚለጕሙአቸው፥ ልብ እንደሌላቸው እንደ ፈረስና እንደ በቅሎ አትሁኑ። "},
	{10, "10 በኃጢአተኛ ብዙ መቅሠፍት አለበት፤ በእግዚአብሔር የሚታመነውን ግን ምሕረት ይከብበዋል። "},
	{11, "11 ጻድቃን ሆይ፥ በእግዚአብሔር ደስ ይበላችሁ ሐሤትም አድርጉ፤ልባችሁም የቀና ሁላችሁ፥ እልል በሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view33() {
struct am33 poems[] = {
	{1, "1 የዳዊት መዝሙር።1 ጻድቃን ሆይ፥ በእግዚአብሔር ደስ ይበላችሁ፤ ለቅኖች ምስጋና ይገባል። "},
	{2, "2 እግዚአብሔርን በመሰንቆ አመስግኑት፥ አሥር አውታርም ባለው በበገና ዘምሩለት። "},
	{3, "3 አዲስ ቅኔም ተቀኙለት፥ በእልልታም መልካም ዝማሬ ዘምሩ፤ "},
	{4, "4 የእግዚአብሔር ቃል ቅን ነውና ሥራውም ሁሉ በእምነት ነውና። "},
	{5, "5 ጽድቅንና ፍርድን ይወድዳል፤ የእግዚአብሔር ቸርነት ምድርን ሞላች። "},
	{6, "6 በእግዚአብሔር ቃል ሰማዮች ጸኑ፥ ሠራዊታቸውም ሁሉ በአፉ እስትንፋስ፤ "},
	{7, "7 የባሕርን ውኃ እንደ ረዋት የሚሰበስበው፥ ቀላዮችንም በመዝገቦች የሚያኖራቸው። "},
	{8, "8 ምድር ሁሉ እግዚአብሔርን ትፍራው፥ በዓለም የሚኖሩ ሁሉም ከእርሱ የተነሣ ይደንግጡ። "},
	{9, "9 እርሱ ተናግሮአልና፥ ሆኑም፤ እርሱ አዘዘ፥ ጸኑም። "},
	{10, "10 እግዚአብሔር የአሕዛብን ምክር ያጠፋል፥ የአሕዛብንም አሳብ ይመልሳል። "},
	{11, "11 የእግዚአብሔር ምክር ግን ለዘላለም ይኖራል። የልቡም አሳብ ለልጅ ልጅ ነው። "},
	{12, "12 እግዚአብሔር አምላኩ የሚሆንለት ሕዝብ ምስጉን ነው፥ እርሱ ለርስቱ የመረጠው ሕዝብ። "},
	{13, "13 እግዚአብሔር ከሰማይ ተመለከተ፥ የሰውንም ልጆች ሁሉ አየ። "},
	{14, "14 ከማደሪያው ቦታ ሆኖ በምድር ወደሚኖሩ ሁሉ ተመለከተ፥ "},
	{15, "15 እርሱ ብቻውን ልባቸውን የሠራ ሥራቸውንም ሁሉ የሚያስተውል። "},
	{16, "16 ንጉሥ በሠራዊቱ ብዛት አይድንም ኃያልም በኃይሉ ብዛት አያመልጥም። "},
	{17, "17 ፈረስም ከንቱ ነው፥ አያድንም፤ በኃይሉም ብዛት አያመልጥም። "},
	{18, "18 እነሆ፥ የእግዚአብሔር ዓይኖች ወደሚፈሩት ናቸው፥ በምሕረቱም ወደሚታመኑ፥ "},
	{19, "19 ነፍሳቸውን ከሞት ያድን ዘንድ፥ በራብም ጊዜ ይመግባቸው ዘንድ። "},
	{20, "20 ነፍሳችን እግዚአብሔርን ተስፋ ታደርገዋለች፥ ረዳታችንና መጠጊያችን እርሱ ነውና። "},
	{21, "21 ልባችን በእርሱ ደስ ይለዋልና፥ በቅዱስ ስሙም ታምነናልና። "},
	{22, "22 አቤቱ፥ ምሕረትህ በላያችን ትሁን፥ በአንተ እንደ ታመንን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view34() {
struct am34 poems[] = {
	{1, "1 ባሳደደው በአቤሜሌክ ፊት መልኩን በለወጠ ጊዜ በሄደም ጊዜ፤ የዳዊት መዝሙር።1 እግዚአብሔርን ሁልጊዜ እባርከዋለሁ፥ ምስጋናውንም ዘወትር በአፌ ነው። "},
	{2, "2 ነፍሴ በእግዚአብሔር ትከብራለች፥ ገሮችም ሰምተው ደስ ይላቸዋል። "},
	{3, "3 እግዚአብሔርን ከእኔ ጋር ታላቅ አድርጉት፥ በአንድነትም ስሙን ከፍ ከፍ እናድርግ። "},
	{4, "4 እግዚአብሔርን ፈለግሁት መለሰልኝም፥ ከመከራዬም ሁሉ አዳነኝ። "},
	{5, "5 ወደ እርሱ ቅረቡ ያበራላችሁማል፥ ፊታችሁም አያፍርም። "},
	{6, "6 ይህ ችግረኛ ጮኸ፥ እግዚአብሔርም ሰማው፥ ከመከራውም ሁሉ አዳነው። "},
	{7, "7 የእግዚአብሔር መልአክ በሚፈሩት ሰዎች ዙሪያ ይሰፍራል፥ ያድናቸውማል። "},
	{8, "8 እግዚአብሔር ቸር እንደ ሆነ ቅመሱ እዩም፤ በእርሱ የሚታመን ሰው ምስጉን ነው። "},
	{9, "9 የሚፈሩት አንዳችን አያጡምና ቅዱሳኑ ሁሉ፥ እግዚአብሔርን ፍሩት። "},
	{10, "10 ባለጠጎች ደኸዩ፥ ተራቡም፥ እግዚአብሔርን የሚፈልጉትን ግን ከመልካም ነገር ሁሉ አይጐድሉም። "},
	{11, "11 ልጆቼ ኑ፥ ስሙኝ፤ እግዚአብሔርን መፍራት አስተምራችኋለሁ። "},
	{12, "12 ሕይወትን የሚፈቅድ ሰው ማን ነው? በጎንም ዘመን ለማየት የሚወድድ? "},
	{13, "13 አንደበትህን ከክፉ ከልክል፥ ከንፈሮችህም ሽንገላን እንዳይናገሩ። "},
	{14, "14 ከክፉ ሽሽ መልካምንም አድርግ፤ ሰላምን እሻ ተከተላትም። "},
	{15, "15 የእግዚአብሔር ዓይኖች ወደ ጻድቃን ጆሮቹም ወደ ጩኸታቸው ናቸውና። "},
	{16, "16 መታሰቢያቸውን ከምድር ያጠፋ ዘንድ የእግዚአብሔር ፊት ክፉን በሚያደርጉ ላይ ነው። "},
	{17, "17 ጻድቃን ጮኹ፥ እግዚአብሔርም ሰማቸው ከመከራቸውም ሁሉ አዳናቸው። "},
	{18, "18 እግዚአብሔር ልባቸው ለተሰበረ ቅርብ ነው፥ መንፈሳቸው የተሰበረውንም ያድናቸዋል። "},
	{19, "19 የጻድቃን መከራቸው ብዙ ነው፥ እግዚአብሔርም ከሁሉ ያድናቸዋል። "},
	{20, "20 እግዚአብሔር አጥንቶቻቸውን ሁሉ ይጠብቃል፥ ከእነርሱም አንድ አይሰበርም። "},
	{21, "21 ኃጢአተኞችን ክፋት ይገድላቸዋል ጻድቃንንም የሚጠሉ ይጸጸታሉ። "},
	{22, "22 የባሪያዎቹን ነፍስ እግዚአብሔር ይቤዣል፥ በእርሱም የሚያምኑ ሁሉ አይጸጸቱም። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view35() {
struct am35 poems[] = {
	{1, "1 የዳዊት መዝሙር። አቤቱ፥ የሚበድሉኝን በድላቸው፥ የሚዋጉኝንም ተዋጋቸው። "},
	{2, "2 ጥሩርና ጋሻ ያዝ፥ እኔንም ለመርዳት ተነሥ። "},
	{3, "3 ሰይፍህን ምዘዝ የሚያሳድዱኝንም መንገዳቸውን ዝጋ፤ ነፍሴን። መድኃኒትሽ እኔ ነኝ በላት። "},
	{4, "4 ነፍሴን የሚሹ ሁሉ ይፈሩ ይጐስቈሉም፤ ክፉትን በእኔ ላይ የሚያስቡ ይፈሩ ወደ ኋላቸውም ይበሉ። "},
	{5, "5 በነፋስ ፊት እንዳለ ትቢያ ይሁኑ፥ የእግዚአብሔርንም መልአክ ያስጨንቃቸው። "},
	{6, "6 መንገዳቸው ዳጥና ጨለማ ይሁን፥ የእግዚአብሔርም መልአክ ያሳድዳቸው። "},
	{7, "7 በከንቱ ያጠፉኝ ዘንድ ወጥመዳቸውን ሸሽገውብኛልና፥ ነፍሴን በከንቱ አበሳጭተዋልና። "},
	{8, "8 ያላወቁት ወጥመድ ይምጣባቸው፥ የሸሸጉትም ወጥመድ ይያዛቸው፤ በዚህ ወጥመድ ውስጥ ይውደቁ። "},
	{9, "9 ነፍሴ ግን በእግዚአብሔር ደስ ይላታል፥ በማዳኑም ሐሴት ታደርጋለች። "},
	{10, "10 አጥንቶቼ ሁሉ እንዲህ ይሉሃል። አቤቱ፥ እንደ አንተ ማን ነው? ችግረኛን ከሚቀማው እጅ፥ ችግረኛንና ድሀውንም ከሚነጥቀው እጅ ታድነዋለህ። "},
	{11, "11 የክፋት ምስክሮች ተነሡብኝ፥ የማላውቀውንም በእኔ ላይ ተናገሩ። "},
	{12, "12 ስለ በጎ ክፋትን መለሱልኝ፥ ነፍሴንም ልጆችን አሳጡአት። "},
	{13, "13 እኔስ እነርሱ በታመሙ ጊዜ ማቅ ለበስሁ፥ ነፍሴንም በጾም አደከምኋት፤ ጸሎቴም ወደ ብብቴ ተመለሰ። "},
	{14, "14 ለወዳጄና ለወንድሜ እንደማደርግ አደረግሁ፤ ለእናቱም እንደሚያለቅስ ራሴን ዝቅ ዝቅ አደረግሁ። "},
	{15, "15 በእኔ ላይ ተሰበሰቡ ደስም አላቸው፤ ግፈኞች በእኔ ላይ ተሰበሰቡ እኔም አላውቅሁም፤ ቀደዱኝ አልተውኝምም። "},
	{16, "16 ፈተኑኝ በሣቅም ዘበቱብኝ፥ ጥርሳቸውንም በእኔ ላይ አንቀጫቅጩ። "},
	{17, "17 አቤቱ፥ እስከ መቼ ድረስ ታይልኛለህ? ነፍሴን ከክፉ ሥራቸው ብችነቴንም ከአንበሶች አድናት። "},
	{18, "18 አቤቱ፥ በታላቁ ጉባኤ ውስጥ እገዛልሃለሁ፥ በብዙ ሕዝብ መካከልም አመሰግንሃለሁ። "},
	{19, "19 በግፍ የሚጠሉኝ በላዬ ደስ አይበላቸው፥ በከንቱ የሚጣሉኝም በዓይናቸው አይጣቀሱብኝ። "},
	{20, "20 ለእኔስ ሰላምን ይናገሩኛልና፥ በቍጣም ሽንገላን ይመክራሉ። "},
	{21, "21 አፋቸውንም በእኔ ላይ አላቀቁ፤ እሰይ እሰይ፥ ዓይናችን አየው ይላሉ። "},
	{22, "22 አቤቱ፥ አንተ አየኸው፤ ዝም አትበል፤ አቤቱ፥ ከእኔ አትራቅ። "},
	{23, "23 አምላኬ ጌታዬም፥ ወደ ፍርዴ ተነሥ፥ አቤቱ፥ ፍርዴን አድምጥ። "},
	{24, "24 አቤቱ አምላኬ፥ እንደ ጽድቅህ ፍረድልኝ፥ በላዬም ደስ አይበላቸው። "},
	{25, "25 በልባቸው። እሰይ እሰይ፥ ነፍሳችንን ደስ አላት አይበሉ፤ ደግሞም። ዋጥነው አይበሉ። "},
	{26, "26 በመከራዬ ደስ የሚላቸው ይፈሩ፥ በአንድነትም ይጐስቍሉ፤ በእኔ ላይ የሚታበዩ እፍረትንና ጕስቍልናን ይልበሱ። "},
	{27, "27 ጽድቄን የሚወድዱአት ደስ ይበላቸው ሐሴትንም ያድርጉ፤ የባሪያውን ሰላም የሚወድድ እግዚአብሔር ታላቅ ይሁን ዘወትር ይበሉ። "},
	{28, "28 ምላሴ ጽድቅህን ሁልጊዜም ምስጋናህን ይናገራል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view36() {
struct am36 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የእግዚአብሔር ባሪያ የዳዊት መዝሙር።1 ኃጢአተኛ በራሱ የሚያስት ነገርን ይናገራል፥ የእግዚአብሔርም ፍርሃት በዓይኖቹ ፊት የለም። "},
	{2, "2 በአንደበቱ ሸንግሎአልና፤ ኃጢአቱ ባገኘችው ጊዜ ይጠላታል። "},
	{3, "3 የአፉ ቃል ግፍና ሽንገላ ነው፤ ማስተዋልን በጎ ማድረግንም ተወ። "},
	{4, "4 በመኝታው ጠማማነትን አሰበ፤ መልካም ባልሆነች መንገድ ቆሞአል፤ ክፋትን አይንቃትም። "},
	{5, "5 አቤቱ፥ ምሕረትህ በሰማይ ነው፥ እውነትህም ወደ ደመናት ትደርሳለች። "},
	{6, "6 ጽድቅህም እንደ እግዚአብሔር ተራሮች፥ ፍርድህም እጅግ ጥልቅ ናት፤ አቤቱ፥ ሰውንና እንስሳን ታድናለህ። "},
	{7, "7 አቤቱ፥ ምሕረትህን እንዴት አበዛህ! የሰው ልጆች በክንፎችህ ጥላ ይታመናሉ። "},
	{8, "8 ከቤትህ ጠል ይጠጣሉ፥ ከተድላም ፈሳሽ ታጠጣቸዋለህ። "},
	{9, "9 የሕይወት ምንጭ ከአንተ ዘንድ ነውና፤ በብርሃንህ ብርሃንን እናያለን። "},
	{10, "10 ምሕረትህን በሚያውቁህ ላይ፥ ጽድቅህንም ልባቸው በቀና ላይ ዘርጋ። "},
	{11, "11 የትዕቢት እግር አይምጣብኝ፥ የኃጢአተኞችም እጅ አያውከኝ። "},
	{12, "12 ዓመፃን የሚያደርጉ ሁሉ ከዚያ ወደቁ፤ ወድቀዋል፥ መቆምም አይችሉም። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view37() {
struct am37 poems[] = {
	{1, "1 የዳዊት መዝሙር።1 በክፉዎች ላይ አትቅና፥ ዓመፃንም በሚያደርጉ ላይ አትቅና፤ "},
	{2, "2 እንደ ሣር ፈጥነው ይደርቃሉና፥ እንደ ለመለመ ቅጠልም ይረግፋሉና። "},
	{3, "3 በእግዚአብሔር ታመን፥ መልካምንም አድርግ፥ በምድርም ተቀመጥ፥ ታምነህም ተሰማራ። "},
	{4, "4 በእግዚአብሔር ደስ ይበልህ፥ የልብህንም መሻት ይሰጥሃል። "},
	{5, "5 መንገድህን ለእግዚአብሔር አደራ ስጥ፥ በእርሱም ታመን፥ እርሱም ያደርግልሃል። "},
	{6, "6 ጽድቅህን እንደ ብርሃን። ፍርድህንም እንደ ቀትር ያመጣል። "},
	{7, "7 ለእግዚአብሔር ተገዛ ተስፋም አድርገው። መንገድም በቀናችለትና ጥመትን በሚያደርግ ሰው አትቅና። "},
	{8, "8 ከቁጣ ራቅ መዓትንም ተው፤ እንዳትበድል አትቅና። "},
	{9, "9 ክፉ አድራጊዎች ይጠፋሉና፤ እግዚአብሔርን ተስፋ የሚያደርጉ ግን እነርሱ ምድርን ይወርሳሉ። "},
	{10, "10 ገና ጥቂት፥ ኃጢአተኛም አይኖርም፤ ትፈልገዋለህ ቦታውንም አታገኝም። "},
	{11, "11 ገሮች ግን ምድርን ይወርሳሉ፥ በብዙም ሰላም ደስ ይላቸዋል። "},
	{12, "12 ኃጢአተኛ ጻድቁን ይመለካከተዋል፥ ጥርሱንም በእርሱ ላይ ያንገጫግጫል። "},
	{13, "13 እግዚአብሔር ይሥቅበታል፥ ቀኑ እንደሚደርስ አይቶአልና። "},
	{14, "14 ኃጢአተኞች ሰይፋቸውን መዘዙ፥ ቀስታቸውንም ገተሩ ድሀውንና ችግረኛውን ይጥሉ ዘንድ ልበ ቅኖችንም ይወጉ ዘንድ፤ "},
	{15, "15 ሰይፋቸው ወደ ልባቸው ይግባ፥ ቀስታቸውም ይሰበር። "},
	{16, "16 ለጻድቅ ያለው ጥቂት ከብዙ ከኃጢአተኞች ሀብት ይበልጣል። "},
	{17, "17 የኃጥአን ክንድ ትሰበራለችና፤ እግዚአብሔር ግን ጻድቃንን ይደግፋቸዋል። "},
	{18, "18 የንጹሓንን መንገድ እግዚአብሔር ያውቃል፥ ርስታቸውም ለዘላለም ነው፤ "},
	{19, "19 በክፉ ዘመንም አያፍሩም በራብ ዘመንም ይጠግባሉ። "},
	{20, "20 ኅጥአን ግን ይጠፋሉ፥ የእግዚአብሔር ጠላቶች በከበሩና ከፍ ከፍ ባሉ ጊዜ እንደ ጢስ ይጠፋሉ። "},
	{21, "21 ኃጢአተኛ ይበደራል አይከፍልምም፤ ጻድቅ ግን ይራራል ይሰጣልም። "},
	{22, "22 እርሱን የሚባርኩት ምድርን ይወርሳሉና፤ የሚረግሙት ግን ይጠፋሉ። "},
	{23, "23 የሰው አካሄድ ከእግዚአብሔር ዘንድ ይጸናል፥ መንገዱንም ይወድዳል። "},
	{24, "24 ቢወድቅም ለድንጋፄ አይጣልም፥ እግዚአብሔር እጁን ይዞ ይደግፈዋልና። "},
	{25, "25 ጐለመስሁ አረጀሁም፤ ጻድቅ ሲጣል፥ ዘሩም እህል ሲለምን አላየሁም። "},
	{26, "26 ሁልጊዜ ይራራል ያበድርማል፥ ዘሩም በበረከት ይኖራል። "},
	{27, "27 ከክፉ ሽሽ፥ መልካምንም አድርግ፤ ለዘላለምም ትኖራለህ። "},
	{28, "28 እግዚአብሔር ፍርዱን ይወድዳልና፥ ቅዱሳኑንም አይጥላቸውምና፤ ለዘላለምም ይጠብቃቸዋል ለንጹሓንም ይበቀልላቸዋል፤ የኅጥኣን ዘር ግን ይጠፋል። "},
	{29, "29 ጻድቃን ምድርን ይወርሳሉ፥ በእርስዋም ለዘላለም ይኖራሉ። "},
	{30, "30 የጻድቅ አፍ ጥበብን ያስተምራል፥ አንደበቱም ፍርድን ይናገራል። "},
	{31, "31 የአምላኩ ሕግ በልቡ ውስጥ ነው፥ በእርምጃውም አይሰናከልም። "},
	{32, "32 ኃጢአተኛ ጻድቁን ይመለከተዋል፥ ሊገድለውም ይወድዳል። "},
	{33, "33 እግዚአብሔር ግን በእጁ አይተወውም፥ በተፋረደውም ጊዜ አያሸንፈውም። "},
	{34, "34 እግዚአብሔርን ደጅ ጥና፥ መንገዱንም ጠብቅ፥ ምድርንም ትወርስ ዘንድ ከፍ ከፍ ያደርግሃል፤ ኃጢአተኞችም ሲጠፉ ታያለህ። "},
	{35, "35 ኃጥአን ከፍ ከፍ ብሎ እንደ ሊባኖስ ዝግባም ለምልሞ አየሁት። "},
	{36, "36 ብመለስ ግን አጣሁት፤ ፈለግሁት ቦታውንም አላገኘሁም። "},
	{37, "37 ቅንነትን ጠብቅ፥ ጽድቅንም እይ፤ ለሰላም ሰው ቅሬታ አለውና። "},
	{38, "38 በደለኞች በአንድነት ይጠፋሉ። የኃጢአተኞች ቅሬታ ይጠፋል። "},
	{39, "39 የጻድቃን መድኃኒታቸው ከእግዚአብሔር ዘንድ ነው፤ በመከራቸውም ጊዜ መጠጊያቸው እርሱ ነው። "},
	{40, "40 እግዚአብሔር ይረዳቸዋል፥ ያድናቸዋልም፥ ከኃጢአተኞችም እጅ ያወጣቸዋል፥ ያድናቸዋል፥ በእርሱ ታምነዋልና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view38() {
struct am38 poems[] = {
	{1, "1 ለሰንበት መታሰቢያ፤ የዳዊት መዝሙር።1 አቤቱ፥ በቍጣህ አትቅሠፈኝ፥ በመዓትህም አትገሥጸኝ። "},
	{2, "2 ፍላጾችህ ወግተውኛልና፥ እጅህንም አክብደህብኛልና። "},
	{3, "3 ከቍጣህ የተነሣ ለሥጋዬ ጤና የለውም፤ ከኃጢአቴም የተነሣ ለአጥንቶቼ ሰላም የላቸውም። "},
	{4, "4 ኃጢአቴ በራሴ ላይ ከፍ ከፍ ብሎአልና፥ እንደ ከባድ ሸክምም በላዬ ከብዶአልና። "},
	{5, "5 ከስንፍናዬ የተነሣ ቍስሌ ሸተተ በሰበሰም፤ "},
	{6, "6 እጅግ ጐሰቈልሁ ተዋረድሁም፥ ሁልጊዜም በትካዜ እመላለሳለሁ። "},
	{7, "7 ነፍሴ ስድብን ተሞልታለችና፥ ለሥጋዬም ጤና የላትምና። "},
	{8, "8 ታመምሁ፤ እጅግም ተቸገርሁ፥ ከልቤ ውዝዋዜም የተነሣ ጮኽሁ። "},
	{9, "9 አቤቱ፥ ፈቃዴ ሁሉ በፊትህ ነው፥ ጭንቀቴም ከአንተ አይሰወርም። "},
	{10, "10 ልቤ ደነገጠብኝ፥ ኃይሌም ተወችኝ፥ የዓይኖቼም ብርሃን ፈዘዘ። "},
	{11, "11 ወዳጆቼም ባልንጀሮቼም ከቍስሌ ገለል ብለው ቆሙ፥ ዘመዶቼም ርቀው ቆሙ። "},
	{12, "12 ነፍሴንም የሚሹአት በረቱብኝ፥ መከራዬንም የሚፈልጉ ከንቱን ተናገሩ፥ ሁልጊዜም በሽንገላ ይመክራሉ። "},
	{13, "13 እኔ ግን እንደማይሰማ ደንቆሮ አፉንም እንደማይከፍት ዲዳ ሆንሁ። "},
	{14, "14 እንደማይሰማ ሰው በአፉም ተግሣጽ እንደሌለው ሰው ሆንሁ። "},
	{15, "15 አቤቱ፥ በአንተ ታምኛለሁና፤ አቤቱ አምላኬ፥ አንተ ትሰማኛለህ። "},
	{16, "16 ጠላቶቼ በእኔ ላይ ደስ እንዳይላቸው ብያለሁና፥ እግሮቼም ቢሰናከሉ ራሳቸውን በእኔ ላይ ከፍ ከፍ ያደርጋሉ። "},
	{17, "17 እኔስ ወደ ማንከስ ቀርቤአለሁና፥ ቍስሌም ሁልጊዜም በፊቴ ነውና። "},
	{18, "18 በደሌን እናገራለሁና፥ ስለ ኃጢአቴም እተክዛለሁ። "},
	{19, "19 ጠላቶቼ ሕያዋን ናቸው ይበረቱብኝማል፥ በጠማማነትም የሚጠሉኝ በዙ። "},
	{20, "20 ጽድቅን ስለ ተከተልሁ፥ በበጎ ፋንታ ክፉን የሚመልሱልኝ ይጠሉኛል። "},
	{21, "21 አቤቱ፥ አንተ አትጣለኝ፤ አምላኬ፥ ከኔ አትራቅ። "},
	{22, "22 አቤቱ መድኃኒቴ፥ እኔን ለመርዳት ፍጠን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view39() {
struct am39 poems[] = {
	{1, "1 ለመዘምራን አለቃ፥ ለኤዶታም፤ የዳዊት መዝሙር።1 በአንደበቴ እንዳልስት መንገዴን እጠብቃለሁ፤ ኃጢአተኛ በፊቴ በተቃወመኝ ጊዜ በአፌ ላይ ጠባቂ አኖራለሁ አልሁ። "},
	{2, "2 ከዝምታ የተነሣ እንደ ዲዳ ሆንሁ፥ ለበጎ እንኳ ዝም አልሁ፥ ቍስሌም ታደሰብኝ። "},
	{3, "3 ልቤም በውስጤ ሞቀብኝ፤ ከማሰቤም የተነሣ እሳት ነደደ፥ በአንደበቴም ተናገርሁ። "},
	{4, "4 አቤቱ፥ ፍጻሜዬን አስታውቀኝ፥ የዘመኔ ቍጥሮች ምን ያህል እንደ ሆኑ፥ እኔ ምን ያህል ወደ ኋላ እንደምቀር አውቅ ዘንድ። "},
	{5, "5 እነሆ፥ ዘመኖቼን አስረጀሃቸው፤ አካሌም በፊትህ እንደ ኢምንት ነው። ሕያው የሆነ ሰው ሁሉ በእውነት ከንቱ ብቻ ነው። "},
	{6, "6 በከንቱ ይታወካል እንጂ በእውነት ሰው እንደ ጣላ ይመላለሳል፤ ያከማቻል የሚሰበስብለትንም አያውቅም። "},
	{7, "7 አሁንስ ተስፋዬ ማን ነው? እግዚአብሔር አይደለምን? ትዕግሥቴም ከአንተ ዘንድ ነው። "},
	{8, "8 ከኃጢአቴ ሁሉ አድነኝ፥ ለሰነፎችም ስድብ አታድርገኝ። "},
	{9, "9 አንተ ሠርተኸኛልና ዝም አልሁ አፌንም አልከፈትሁም። "},
	{10, "10 መቅሠፍትህን ከእኔ አርቅ፥ ከእጅህ ብርታት የተነሣ አልቄአለሁና። "},
	{11, "11 በተግሣጽህ ስለ ኃጢአቱ ሰውን ዘለፍኸው፥ ነፍሱም እንደ ሸረሪት ድር ታልቃለች፤ በእውነት ሰው ሁሉ ከንቱ ነው። "},
	{12, "12 አቤቱ፥ ጸሎቴን ስማ፥ ጩኸቴንም አድምጥ፥ ልቅሶዬንም ቸል አትበለኝ፤ እኔ በምድር ላይ መጻተኛ ነኝና፥ እንደ አባቶችም እንግዳ ነኝና። "},
	{13, "13 ወደማልመለስበት ሳልሄድ ዐርፍ ዘንድ ተወኝ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view40() {
struct am40 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የዳዊት መዝሙር።1 ቆይቼ እግዚአብሔር ደጅ ጠናሁት፥ እርሱም ዘንበል አለልኝ ጩኽቴንም ሰማኝ። "},
	{2, "2 ከጥፋት ጕድጓድ ከረግረግም ጭቃ አወጣኝ፥ እግሮቼንም በድንጋይ ላይ አቆማቸው፥ አረማመዴንም አጸና። "},
	{3, "3 አዲስ ዝማሬን ለአምላካችን ምስጋና በአፌ ጨመረ፤ ብዙዎች ያያሉ ይፈሩማል፥ በእግዚአብሔርም ይታመናሉ። "},
	{4, "4 እግዚአብሔርን የታመነ ወደ ትዕቢተኛና ወደ ሐሰተኛ ያልተመለከተ ሰው ምስጉን ነው። "},
	{5, "5 አቤቱ አምላኬ፥ ያደረግኸው ተአምራት ብዙ ነው፥ አሳብህንም ምንም የሚመስለው የለም፤ ባወራም ብናገርም ከቍጥር ሁሉ በዛ። "},
	{6, "6 መሥዋዕትንና ቍርባንን አልወደድህም፤ ሥጋን አዘጋጀህልኝ፤ የሚቃጠለውንና ስለ ኃጢአት የሚቀርበውን መሥዋዕት አልሻህም። "},
	{7, "7 በዚያን ጊዜ አልሁ። እነሆ፥ መጣሁ፤ ስለ እኔ በመጽሐፍ ራስ ተጽፎአል፤ "},
	{8, "8 አምላኬ ሆይ፥ ፈቃድህን ለማድረግ ወደድሁ፥ ሕግህም በልቤ ውስጥ ነው። "},
	{9, "9 በታላቅ ጉባኤ ጽድቅን አወራሁ፤ እነሆ፥ ከንፈሮቼን አልከለክልም፤ አቤቱ፥ አንተ ጽድቄን ታውቃለህ። "},
	{10, "10 እውነትህንም በልቤ ውስጥ አልሰወርሁም፥ ማዳንህንም ተናገርሁ፤ ምሕረትህንና እውነትህን ከታላቅ ጉባኤ አልሰወርሁም። "},
	{11, "11 አቤቱ፥ አንተ ምሕረትህን ከእኔ አታርቅ፤ ቸርነትህና እውነትህ ዘወትር ይጠብቁኝ። "},
	{12, "12 ቍጥር የሌላት ክፋት አግኝታኛለችና፤ ኃጢአቶቼ ያዙኝ፥ ማየትም ተስኖኛል ከራሴ ጠጕር ይልቅ በዙ፥ ልቤም ተወኝ። "},
	{13, "13 አቤቱ፥ ታድነኝ ዘንድ ፍቀድ፤ አቤቱ፥ እኔን ለመርዳት ፍጠን። "},
	{14, "14 ነፍሴን ለማጥፋት የሚወድዱ ይፈሩ፥ በአንድነትም ይጐስቍሉ፤ በእኔ ላይ ክፋትን ሊያደርጉ የሚወድዱ ወደ ኋላቸው ይመለሱ ይጐስቍሉም። "},
	{15, "15 እሰይ እሰይ የሚሉኝ እፍረታቸውን ወዲያው ይከፈሉ። "},
	{16, "16 አቤቱ፥ የሚፈልጉህ ሁሉ በአንተ ደስ ይበላቸው ሐሤትም ያድርጉ፤ ሁልጊዜ ማዳንህን የሚወድዱ ዘወትር። እግዚአብሔር ታላቅ ይሁን ይበሉ። "},
	{17, "17 እኔ ችግረኛና ምስኪን ነኝ፥ ጌታ ግን ያስብልኛል፤ አንተ ረዳቴና መድኃኒቴ ነህ፤ አምላኬ ሆይ፥ አትዘግይ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view41() {
struct am41 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የዳዊት መዝሙር።1 ለችግረኛና ለምስኪን የሚያስብ ምስጉን ነው፤ እግዚአብሔር በክፉ ቀን ያድነዋል። "},
	{2, "2 እግዚአብሔር ይጠብቀዋል፥ ሕያውም ያደርገዋል፥ በምድር ላይም ያስመሰግነዋል፥ በጠላቶቹም እጅ አያሳልፈውም። "},
	{3, "3 እግዚአብሔር በደዌው አልጋ ሳለ ይረዳዋል፤ መኝታውን ሁሉ በበሽታው ጊዜ ያነጥፍለታል። "},
	{4, "4 እኔስ። አቤቱ ማረኝ፤ አንተን በድያለሁና ነፍሴን ፈውሳት አልሁ። "},
	{5, "5 ጠላቶቼም በላዬ ክፋትን ይናገራሉ። መቼም ይሞታል ስሙስ መቼ ይሻራል? ይላሉ። "},
	{6, "6 እኔን ለማየት ቢገባ ከንቱን ይናገራል፤ ልቡ ኃጢአትን ሰበሰበለት፤ ወደ ሜዳ ይወጣል ይናገራልም። "},
	{7, "7 በላዬ በመተባበር ጠላቶቼ ሁሉ ይሾካሾኩብኛል፥ በእኔ ላይም ክፋትን ያስባሉ። "},
	{8, "8 ክፉ ነገር መጣበት፤ ተኝቶአል ከእንግዲህ ወዲህ አይነሣም ይላሉ። "},
	{9, "9 ደግሞ የሰላሜ ሰው የታመንሁበት እንጀራዬን የበላ በእኔ ላይ ተረከዙን አነሣ። "},
	{10, "10 አንተ ግን አቤቱ፥ ማረኝ እመልስላቸውም ዘንድ አስነሣኝ። "},
	{11, "11 ጠላቴ እልል አይልብኝምና ስለዚህ እንደ ወደድኸኝ አወቅሁ። "},
	{12, "12 እኔን ግን ስለ ቅንነቴ ተቀበልኸኝ፥ በፊትህም ለዘላለም አጸናኸኝ። "},
	{13, "13 ከዘላለም እስከ ዘላለም የእስራኤል አምላክ እግዚአሔር ይባረክ። አሜን አሜን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view42() {
struct am42 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የቆሬ ልጆች ትምህርት።1 ዋላ ወደ ውኃ ምንጭ እንደሚናፍቅ፥ አቤቱ፥ እንዲሁ ነፍሴ ወደ አንተ ትናፍቃለች። "},
	{2, "2 ነፍሴ ወደ ሕያው አምላክ ተጠማች፤ መቼ እደርሳለሁ? የአምላክንስ ፊት መቼ አያለሁ? "},
	{3, "3 ዘወትር። አምላክህ ወዴት ነው? ሲሉኝ እንባዬ በቀንና በሌሊት ምግብ ሆነኝ። "},
	{4, "4 ይህን ሳስብ ነፍሴ በእኔ ውስጥ ፈሰሰች፥ ወደ እግዚአብሔር ቤት ወደ ምስጋና መኖሪያ ስፍራ እገባለሁና፤ በዓል የሚያደርጉ ሰዎች የደስታና ምስጋና ቃል አሰሙ። "},
	{5, "5 ነፍሴ ሆይ፥ ለምን ታዝኛለሽ? ለምንስ ታውኪኛለሽ? የፊቴን መድኃኒት አምላኬን አመሰግነው ዘንድ በእግዚአብሔር ታመኚ። "},
	{6, "6 አምላኬ ሆይ፥ ነፍሴ በእኔ ውስጥ ታወከች፤ ስለዚህ በዮርዳኖስ ምድር በአርሞንኤምም በታናሹ ተራራ አስብሃለሁ። "},
	{7, "7 በፍዋፍዋቴህ ድምፅ ቀላይ ቀላይን ትጠራታለች፤ ማዕበልህና ሞገድህ ሁሉ በላዬ አለፈ። "},
	{8, "8 እግዚአብሔር በቀን ቸርነቱን ያዝዛል፥ በሌሊትም ዝማሬው በእኔ ዘንድ ይሆናል፤ የእኔ ስእለት ለሕይወቴ አምላክ ነው። "},
	{9, "9 እግዚአብሔርን። አንተ መጠጊያዬ ነህ፤ ለምን ረሳኸኝ? ጠላቶቼ ሲያስጨንቁኝ ለምን አዝኜ እመላለሳለሁ? እለዋለሁ። "},
	{10, "10 ጠላቶቼ ሁልጊዜ። አምላክህ ወዴት ነው? ባሉኝ ጊዜ አጥንቶቼን እየቀለጣጠሙ ሰደቡኝ። "},
	{11, "11 ነፍሴ ሆይ፥ ለምን ታዝኛለሽ? ለምንስ ታውኪኛለሽ? የፊቴን መድኃኒት አምላኬን አመሰግነው ዘንድ በእግዚአብሔር ታመኚ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view43() {
struct am43 poems[] = {
	{1, "1 የዳዊት መዝሙር።1 አቤቱ፥ ፍረድልኝ፥ ከጽድቅ ከራቁ ሕዝብም ክርክሬን ተከራከር፤ ከሸንጋይና ከግፈኛ ሰው አድነኝ። "},
	{2, "2 አንተ አምላኬ ኃይሌም፥ ለምን ትተውኛለህ? ጠላቶቼ ሲያስጨንቁኝ ለምን አዝኜ እመላለሳለሁ? "},
	{3, "3 ብርሃንህንና እውነትህን ላክ፤ እነርሱ ይምሩኝ፥ ወደ ቅድስናህ ተራራና ወደ ማደሪያህ ይውሰዱኝ። "},
	{4, "4 ወደ እግዚአብሔር መሠዊያ፥ ጕልማስነቴንም ደስ ወዳሰኛት ወደ አምላኬ እገባለሁ፤ አቤቱ አምላኬ፥ በበገና አመሰግንሃለሁ። "},
	{5, "5 ነፍሴ ሆይ፥ ለምን ታዝኛለሽ? ለምንስ ታውኪኛለሽ? የፊቴን መድኃኒት አምላኬን አመሰግነው ዘንድ በእግዚአብሔር ታመኚ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view44() {
struct am44 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የቆሬ ልጆች ትምህርት።1 አቤቱ፥ በጆሮአችን ሰማን፥ አባቶቻችንም በዘመናቸው በቀድሞ ዘመን የሠራኸውን ሥራ ነገሩን። "},
	{2, "2 እጅህ አሕዛብን አጠፋች፥ እነርሱንም ተከልህ፤ አሕዛብን ሣቀይኻቸው አሳደድኻቸውም። "},
	{3, "3 በሰይፋቸው ምድርን አልወረሱም ክንዳቸውም አላዳናቸው፤ ቀኝህና ክንድህ የፊትህም ብርሃን ነው እንጂ ወድደሃቸዋልና። "},
	{4, "4 አምላኬና ንጉሤ አንተ ነህ፤ ለያዕቆብ መድኃኒትንህ እዘዝ። "},
	{5, "5 በአንተ ጠላቶቻችንን እንወጋቸዋለን፥ በስምህም በላያችን የቆሙትን እናዋርዳቸዋለን። "},
	{6, "6 በቀስቴ የምታመን አይደለሁምና፥ ሰይፌም አያድነኝምና፤ "},
	{7, "7 አንተ ግን ከጠላቶቻችን አዳንኸን፥ የሚጠሉንንም አሳፈርሃቸው። "},
	{8, "8 ሁልጊዜ በእግዚአብሔር እንከብራለን፥ ስምህንም ለዘላለም እናመሰግናለን። "},
	{9, "9 አሁን ግን ጠላኸን አሳፈርኸንም፥ ከሠራዊታችንም ጋር አትወጣም። "},
	{10, "10 ከጠላቶቻችንም ፊት ወደ ኋላችን መለስኸን፥ የሚጠሉንም ተነጣጠቁን። "},
	{11, "11 እንደ በጎች ሊበሉን ሰጠኸን፥ ወደ አሕዛብም በተንኸን። "},
	{12, "12 ሕዝብህን ያለ ዋጋ ሰጠህ፥ በመለወጣቸውም ትርፍ የለም። "},
	{13, "13 ለጎረቤቶቻችን ስድብ፥ በዙሪያችንም ላሉ መሣቂያና መዘበቻ አደረግኸን። "},
	{14, "14 በአሕዛብ ዘንድ ምሳሌ፥ በሕዝብም ዘንድ የራስ መንቀሳቀሻ አደረግኸን። "},
	{15, "15 ጕስቍልናዬ ሁልጊዜም በፊቴ ነው፥ የፊቴም እፍረት ሸፈነኝ። "},
	{16, "16 ከሚሳደብና ከሚላገድ ቃል የተነሣ፥ ከጠላትና ከቂመኛ ፊት የተነሣ ነው። "},
	{17, "17 ይህ ሁሉ በእኛ ላይ ደረሰ፥ አልረሳንህም፥ ኪዳንህንም አልወነጀልንም። "},
	{18, "18 ልባችን ወደ ኋላው አልተመለሰም፥ ፍለጋችንም ከመንገድህ ፈቀቅ አላለም፤ "},
	{19, "19 በክፉ ስፍራ አዋርደኸናልና፥ በሞት ጥላም ሰውረኸናልና። "},
	{20, "20 የአምላካችንን ስም ረስተንስ ቢሆን፥ እጃችንንም ወደ ሌላ አምላክ አንሥተንስ ቢሆን፥ "},
	{21, "21 እግዚአብሔር ይህንን አይመረምርም ነበርን? እርሱ ልብ የሰወረውን ያውቃልና። "},
	{22, "22 ስለ አንተ ሁልጊዜም ተገድለናል፥ እንደሚታረዱም በጎች ሆነናል። "},
	{23, "23 አቤቱ፥ ንቃ፤ ለምንስ ትተኛለህ? ተነሥ፥ ለዘወትርም አትጣለን። "},
	{24, "24 ለምንስ ፊትህን ትሰውራለህ? መከራችንንና ችግራችንንስ ለምን ትረሳለህ? "},
	{25, "25 ነፍሳችን በመሬት ላይ ተጐሳቍላለችና፥ ሆዳችንም ወደ ምድር ተጣብቃለችና። "},
	{26, "26 አቤቱ፥ ተነሥና እርዳን፥ ስለ ስምህም ተቤዠን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view45() {
struct am45 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ በመለኮቶች፤ የቆሬ ልጆች ትምህርት፤ የፍቅር መዝሙር።1 ልቤ መልካም ነገርን አፈለቀ፥ እኔ ሥራዬን ለንጉሥ እነግራለሁ፤ አንደበቴ እንደ ፈጣን ጸሓፊ ብርዕ ነው። "},
	{2, "2 ውበትህ ከሰው ልጆች ይልቅ ያምራል፤ ሞገስ በከንፈሮችህ ፈሰሰ፤ ስለዚህ እግዚአብሔር ለዘላለም ባረከህ። "},
	{3, "3 ኃያል ሆይ፥ በቍንጅናህና በውበትህ ሰይፍህን በወገብህ ታጠቅ። "},
	{4, "4 ስለ ቅንነትና ስለ የዋህነት ስለ ጽድቅም አቅና ተከናወን ንገሥም፤ ቀኝህም በክብር ይመራሃል። "},
	{5, "5 ኃያል ሆይ፥ ፍላጻዎችህ የተሳሉ ናቸው፥ እነርሱም በንጉሥ ጠላቶች ልብ ውስጥ ይገባሉ፥ አሕዛብም በበታችህ ይወድቃሉ። "},
	{6, "6 አምላክ ሆይ፥ ዙፋንህ ለዘላለም ነው፤ የመንግሥትህ በትር የቅንነት በትር ነው። "},
	{7, "7 ጽድቅን ወደድህ ዓመፃንም ጠላህ፤ ስለዚህ ከባልንጀሮችህ ይልቅ እግዚአብሔር አምላክ የደስታ ዘይትን ቀባህ። "},
	{8, "8 በልብሶችህ ሁሉ ከርቤና ሽቱ ዝባድም አሉ፤ ከዝሆን ጥርሶች አዳራሽ ደስ ያሰኙሃል። "},
	{9, "9 የንጉሦች ሴት ልጆች ለክብርህ ናቸው፤ በወርቅ ልብስ ተጐናጽፋና ተሸፋፍና ንግሥቲቱ በቀኝህ ትቆማለች። "},
	{10, "10 ልጄ ሆይ፥ ስሚ እዪ ጆሮሽንም አዘንብዪ፤ ወገንሽን ያባትሽንም ቤት እርሺ፤ "},
	{11, "11 ንጉሥ ውበትሽን ወድዶአልና፥ እርሱ ጌታሽ ነውና። "},
	{12, "12 የጢሮስ ሴቶች ልጆች እጅ መንሻን ይዘው ይሰግዱለታል። የምድር ባለጠጎች አሕዛብ በፊትህ ይማለላሉ። "},
	{13, "13 ለሐሴቦን ንጉሥ ልጅ ሁሉ ክብርዋ ነው፤ ልብስዋ የወርቅ መጐናጸፊያ ነው። "},
	{14, "14 በኋላዋ ደናግሉን ለንጉሥ ይወስዳሉ፥ ባልንጀሮችዋንም ወደ አንተ ያቀርባሉ፤ "},
	{15, "15 በደስታና በሐሴት ይወስዱአቸዋል፥ ወደ ንጉሥ እልፍኝም ያስገቡአቸዋል። "},
	{16, "16 በአባቶችሽ ፋንታ ልጆች ተወለዱልሽ፥ በምድርም ሁሉ ላይ ገዥዎች አድርገሽ ትሾሚያቸዋለሽ። "},
	{17, "17 ለልጅ ልጅ ሁሉ ስምሽን ያሳስባሉ፤ ስለዚህ ለዓለምና ለዘላለም አሕዛብ ይገዙልሃል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view46() {
struct am46 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ ስለ ምሥጢር፤ የቆሬ ልጆች መዝሙር።1 አምላካችን መጠጊያችንና ኃይላችን፥ ባገኘን በታላቅ መከራም ረዳታችን ነው። "},
	{2, "2 ስለዚህ ምድር ብትነዋወጥ፥ ተራሮችም ወደ ባሕር ልብ ቢወሰዱ አንፈራም። "},
	{3, "3 ውኆቻቸው ጮኹ ተናወጡም፥ ተራሮችም ከኃይሉ የተነሣ ተናወጡ። "},
	{4, "4 የወንዝ ፈሳሾች የእግዚአብሔርን ከተማ ደስ ያሰኛሉ፤ ልዑል ማደሪያውን ቀደሰ። "},
	{5, "5 እግዚአሔር በመካከልዋ ነው አትናወጥም፥ እግዚአብሔርም ፈጥኖ ይረዳታል። "},
	{6, "6 አሕዛብ ተናወጡ መንግሥታትም ተመለሱ፤ እርሱ ቃሉን ሰጠ፥ ምድርም ተንቀጠቀጠች። "},
	{7, "7 የሠራዊት ጌታ ከእኛ ጋር ነው፤ የያዕቆብ አምላክ መጠጊያችን ነው። "},
	{8, "8 የእግዚአብሔርን ሥራ፥ በምድር ያደረገውንም ተኣምራት እንድታዩ ኑ። "},
	{9, "9 እስከ ምድር ዳርቻ ድረስ ጦርነት ይሽራል። ቀስትን ይሰብራል፥ ጦርንም ይቈርጣል በእሳትም ጋሻን ያቃጥላል። "},
	{10, "10 ዕረፉ፥ እኔም አምላክ እንደ ሆንሁ እወቁ፤ በአሕዛብ ዘንድ ከፍ ከፍ እላለሁ፥ በምድርም ላይ ከፍ ከፍ እላለሁ። "},
	{11, "11 የሠራዊት ጌታ ከእኛ ጋር ነው፤ የያዕቆብ አምላክ መጠጊያችን ነው። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view47() {
struct am47 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የቆሬ ልጆች መዝሙር።1 አሕዛብ ሁላችሁ፥ እጆቻችሁን አጨብጭቡ፥ በደስታ ቃልም ለእግዚአብሔር እልል በሉ። "},
	{2, "2 እግዚአብሔር ልዑል ግሩምም ነውና፥ በምድር ሁሉ ላይም ታላቅ ንጉሥ ነውና። "},
	{3, "3 አሕዛብን ከእኛ በታች፥ ወገኖችንም ከእግራችን በታች አስገዛልን። "},
	{4, "4 ለርስቱ እኛን መረጠን፥ የወደደውን የያዕቆብን ውበት። "},
	{5, "5 አምላክ በእልልታ፥ እግዚአብሔር በመለከት ድምፅ ዐረገ። "},
	{6, "6 ዘምሩ፥ ለአምላካችን ዘምሩ፤ ዘምሩ፥ ለንጉሣችን ዘምሩ። "},
	{7, "7 እግዚአብሔር ለምድር ሁሉ ንጉሥ ነውና፤ በማስተዋል ዘምሩ። "},
	{8, "8 እግዚአብሔር በአሕዛብ ላይ ነገሠ፤ እግዚአብሔር በቅድስናው ዙፋን ይቀመጣል። "},
	{9, "9 የምድር ኃይለኞች ለእግዚአብሔር ናቸውና የአሕዛብ አለቆች ወደ አብርሃም አምላክ ተሰበሰቡ፤ እርሱንም ከፍ ከፍ አደረጉት። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view48() {
struct am48 poems[] = {
	{1, "1 በሁለተኛ ሰንበት የቆሬ ልጆች፤ የምስጋና መዝሙር።1 እግዚአብሔር ትልቅ ነው፤ በአምላካችን ከተማ በተቀደሰ ተራራ ምስጋናው ብዙ ነው። "},
	{2, "2 በሰሜን ወገን በመልካም ስፍራ የቆመ የምድር ሁሉ ደስታ የጽዮን ተራራ ነው፤ እርሱም የትልቁ ንጉሥ ከተማ ነው። "},
	{3, "3 እግዚአብሔር በአዳራሾችዋ መጠጊያ ሆኖ ይታወቃል። "},
	{4, "4 እነሆ፥ ነገሥታት ተከማችተው በአንድነት መጥተዋል። "},
	{5, "5 እነርሱስ አይተው ተደነቁ፥ ደነገጡ፥ ታወኩ። "},
	{6, "6 መንቀጥቀጥ እንደ ወላድ ምጥ በዚያ ያዛቸው። "},
	{7, "7 በኃይለኛ ነፋስ የተርሴስን መርከቦች ትሰብራለህ። "},
	{8, "8 እንደ ሰማን እንዲሁ አየን በሠራዊት ጌታ ከተማ፥ በአምላካችን ከተማ፤ እግዚአብሔር ለዘላለም ያጸናታል። "},
	{9, "9 አምላክ ሆይ፥ በሕዝብህ መካከል ምሕረትህን ተቀበልን። "},
	{10, "10 አምላክ ሆይ፥ እንደ ስምህ እንዲሁም እስከ ምድር ዳርቻ ድረስ ምስጋናህ ነው፤ ቀኝህ ጽድቅን የተሞላች ናት። "},
	{11, "11 አቤቱ፥ ስለ ፍርድህ የጽዮን ተራራ ደስ ይበለው፥ የአይሁድም ሴት ልጆች ሐሤት ያድርጉ። "},
	{12, "12 ጽዮንን ክበቡአት፥ በዙሪያዋም ተመላለሱ፥ ግንቦችዋንም ቍጠሩ፤ "},
	{13, "13 በብርታትዋ ልባችሁን አኑሩ፤ አዳራሽዋን አስቡ፤ ለሚመጣው ትውልድ ትነግሩ ዘንድ። "},
	{14, "14 ለዓለምና ለዘላለም ይህ አምላካችን ነው፥ እርሱም ለዘላለም ይመራናል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view49() {
struct am49 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የቆሬ ልጆች መዝሙር።1 አሕዛብ ሁላችሁ፥ ይህን ስሙ፤ በዓለም የምትኖሩትም ሁላችሁ፥ አድምጡ፤ "},
	{2, "2 ዝቅተኞችና ከፍተኞች፥ ባለጠጎችና ድሆች በአንድነት። "},
	{3, "3 አፌ ጥበብን ይናገራል፥ የልቤም አሳብ ማስተዋልን። "},
	{4, "4 ጆሮዬን ወደ ምሳሌ አዘነብላለሁ፥ በበገናም ምሥጢሬን እገልጣለሁ። "},
	{5, "5 ኃጢአት ተረከዜን በከበበኝ ጊዜ በክፉ ቀን ለምን እፈራለሁ? "},
	{6, "6 በኃይላቸው የሚታመኑ፥ በባለጠግነታቸውም ብዛት የሚመኩ፤ "},
	{7, "7 ወንድም ወንድሙን አያድንም፥ ሰውም አያድንም፤ ቤዛውን ለእግዚአብሔር አይሰጥም፥ "},
	{8, "8 -9 ለዘላለም እንዲኖር፥ ጥፋትንም እንዳያይ፤ የነፍሳቸው ለውጥ ከብሮአልና፥ ለዘላለምም ቀርቶአልና። "},
	{9, "10 ብልሃተኞች እንዲሞቱ፥ ሰነፎችችና ደንቆሮች በአንድነት እንዲጠፉ፥ ገንዘባቸውንም ለሌሎች እንዲተዉ አይቶአል። "},
	{10, "11 በልባቸውም ቤታቸው ለዘላለም የሚኖር፥ ማደሪያቸውም ለልጆች ልጅ የሚሆን ይመስላቸዋል፤ በየአገራቸውም ስማቸው ይጠራል። "},
	{11, "12 ሰው ግን ክቡር ሆኖ ሳለ አያውቅም፤ እንደሚጠፉ እንስሶች መሰለ። "},
	{12, "13 ይህች መንገዳቸው መሰናክላቸው ናት፥ ከእነርሱም በኋላ የሚመጡ በአፋቸው እሺ ይላሉ። "},
	{13, "14 እንደ በጎች ወደ ሲኦል የሚሄዱ ናቸው፥ እረኛቸውም ሞት ነው፤ ቅኖችንም በማለዳ ይገዙአቸዋል፥ ውበታቸውም ከመኖሪያቸው ተለይታ በሲኦል ታረጃለች። "},
	{14, "15 ነገር ግን እግዚአብሔር ይቀበለኛልና ነፍሴን ከሲኦል እጅ ይቤዣታል። "},
	{15, "16 የሰው ባለጠግነት የቤቱም ክብር በበዛ ጊዜ አትፍራ፥ "},
	{16, "17 በሞተ ጊዜ ከእርሱ ጋር ምንም አይወስድምና፥ ክብሩም ከእርሱ በኋላ አይወርድምና። "},
	{17, "18 በሕይወቱ ሳለ ነፍሱን ባርኮአልና ለሰውነቱ መልካም ብታደርግለት ያመሰግንሃል። "},
	{18, "19 ሆኖም ወደ አባቶቹ ትውልድ ይወርዳል፤ ለዘላለም ብርሃንን አያይም። "},
	{19, "20 አእምሮ የሌለው ክቡር ሰው እንደሚጠፋ እንስሶች መሰለ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view50() {
struct am50 poems[] = {
	{1, "1 የአሳፍ መዝሙር።1 የአማልክት አምላክ እግዚአብሔር ተናገረ፥ ከፀሓይም መውጫ ጀምሮ እስከ መግቢያዋ ድረስ ምድርን ጠራት። "},
	{2, "2 ከክብሩ ውበት ከጽዮን እግዚአብሔር ግልጥ ሆኖ ይመጣል። "},
	{3, "3 አምላካችን ይመጣል ዝምም አይልም፤ እሳት በፊት ይቃጠላል፥ በዙሪያውም ብዙ ዐውሎ አለ። "},
	{4, "4 በላይ ያለውን ሰማይን ምድርንም በሕዝቡ ለመፍረድ ይጠራል፤ "},
	{5, "5 ከእርሱ ጋር ለመሥዋዕት ኪዳን የቆሙትን ቅዱሳኑን ሰብስቡለት። "},
	{6, "6 ሰማያት ጽድቁን ይናገራሉ፥ እግዚአብሔር ፈራጅ ነውና። "},
	{7, "7 ሕዝቤ፥ ስማኝ፥ ልንገርህ፤ እስራኤልም፥ ስማኝ፥ ልመስክርብህ፤ አምላክስ እኔ አምላክህ ነኝ። "},
	{8, "8 ስለ ቍርባንህ የምዘልፍህ አይደለሁም፤ የሚቃጠል መሥዋዕትህ ሁልጊዜ በፊቴ ነው። "},
	{9, "9 ከቤትህ ፍሪዳን ከመንጋህም አውራ ፍየልን አልወስድም፤ "},
	{10, "10 የምድረ በዳ አራዊት ሁሉ በሺህ ተራራዎች ያሉ እንስሶችም የእኔ ናቸውና። "},
	{11, "11 የሰማይን አዕዋፍ ሁሉ አውቃለሁ፥ የምድረ በዳ አራዊትም በእኔ ዘንድ ናቸው። "},
	{12, "12 ብራብም ለአንተ አልነግርህም፥ ዓለምና ሞላው የእኔ ነውና። "},
	{13, "13 የፍሪዳውን ሥጋ እበላለሁን? የፍየሉንስ ደም እጠጣለሁን? "},
	{14, "14 ለእግዚአብሔር የምስጋናን መሥዋዕት ሠዋ፥ ለልዑልም ስእለትህን ስጥ፤ "},
	{15, "15 በመከራ ቀን ጥራኝ፥ አድንህማለሁ አንተም ታከብረኛለህ። "},
	{16, "16 ኃጢአተኛውን ግን እግዚአብሔር አለው። ለምን አንተ ሕጌን ትናገራለህ? ኪዳኔንም በአፍህ ለምን ትወስዳለህ? "},
	{17, "17 አንተስ ተግሣጼን ጠላህ፥ ቃሎቼንም ወደ ኋላህ ጣልህ። "},
	{18, "18 ሌባውን ባየህ ጊዜ ከእርሱ ጋር ትሮጥ ነበር እድል ፈንታህንም ከአመንዝሮች ጋር አደረግህ። "},
	{19, "19 አፍህ ክፋትን አበዛ፥ አንደበትህም ሽንገላን ተበተበ። "},
	{20, "20 ተቀምጠህ ወንድምህን አማኸው፥ ለእናትህም ልጅ ዕንቅፋት አኖርህ። "},
	{21, "21 ይህን አድርገህ ዝም አልሁህ፤ እኔ እንደ አንተ እሆን ዘንድ ጠረጠርህ፤ እዘልፍሃለሁ በፊትህም እቆማለሁ። "},
	{22, "22 እግዚአብሔርን የምትረሱ እናንተ፥ ይህን አስተውሉ፤ አለዚያ ግን ይነጥቃል የሚያድንም የለም። "},
	{23, "23 ምስጋና የሚሠዋ ያከብረኛል፤ የእግዚአብሔርን ማዳን ለእርሱ የማሳይበት መንገድ ከዚያ አለ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view51() {
struct am51 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ ወደ ቤርሳቤህ ከገባ በኋላ ነቢዩ ናታን ወደ እርሱ በመጣ ጊዜ፤ የዳዊት መዝሙር።1 አቤቱ፥ እንደ ቸርነትህ መጠን ማረኝ፤ እንደ ምሕረትህም ብዛት መተላለፌን ደምስስ። "},
	{2, "2 ከበደሌ ፈጽሞ እጠበኝ፥ ከኃጢአቴም አንጻኝ፤ "},
	{3, "3 እኔ መተላለፌን አውቃለሁና፥ ኃጢአቴም ሁልጊዜ በፊቴ ነውና። "},
	{4, "4 አንተን ብቻ በደልሁ፥ በፊትህም ክፋትን አደረግሁ፥ በነገርህም ትጸድቅ ዘንድ በፍርድህም ንጹሕ ትሆን ዘንድ። "},
	{5, "5 እነሆ፥ በዓመፃ ተፀነስሁ፥ እናቴም በኃጢአት ወለደችኝ። "},
	{6, "6 እነሆ፥ እውነትን ወደድህ፤ የማይታይ ስውር ጥበብን አስታወቅኸኝ። "},
	{7, "7 በሂሶጵ እርጨኝ፥ እነጻማለሁ፤ እጠበኝ፥ ከበረዶም ይልቅ ነጭ እሆናለሁ። "},
	{8, "8 ሐሤትንና ደስታን አሰማኝ፥ የሰበርሃቸውም አጥንቶቼ ደስ ይላቸዋል። "},
	{9, "9 ከኃጢአቴ ፊትህን መልስ፥ በደሌንም ሁሉ ደምስስልኝ። "},
	{10, "10 አቤቱ፥ ንጹሕ ልብን ፍጠርልኝ፥ የቀናውንም መንፈስ በውስጤ አድስ። "},
	{11, "11 ከፊትህ አትጣለኝ፥ ቅዱስ መንፈስህንም ከእኔ ላይ አትውሰድብኝ። "},
	{12, "12 የማዳንህን ደስታ ስጠኝ፥ በእሽታ መንፈስም ደግፈኝ። "},
	{13, "13 ለሕግ ተላላፎች መንገድህን አስተምራለሁ፥ ኃጢአተኞችም ወደ አንተ ይመለሳሉ። "},
	{14, "14 የመድኃኒቴ አምላክ እግዚአብሔር ሆይ፥ ከደም አድነኝ፥ አንደበቴም በአንተ ጽድቅ ትደሰታለች። "},
	{15, "15 አቤቱ፥ ከንፈሮቼን ክፈት፥ አፌም ምስጋናህን ያወራል። "},
	{16, "16 መሥዋዕትን ብትወድድስ በሰጠሁህ ነበር፤ የሚቃጠለውም መሥዋዕት ደስ አያሰኝህም። "},
	{17, "17 የእግዚአብሔር መሥዋዕት የተሰበረ መንፈስ ነው፥ የተሰበርውንና የተዋረደውን ልብ እግዚአብሔር አይንቅም። "},
	{18, "18 አቤቱ፥ በውዴታህ ጽዮንን አሰማምራት፤ የኢየሩሳሌምንም ቅጽሮች ሥራ። "},
	{19, "19 የጽድቁን መሥዋዕት መባውንም የሚቃጠለውንም መሥዋዕት በወደድህ ጊዜ፥ ያን ጊዜ በመሠዊያህ ላይ ፍሪዳዎችን ይሠዋሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view52() {
struct am52 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ ኤዶማዊው ዶይቅ መጥቶ ለሳኦል። ዳዊት ወደ አቢሜሌክ ቤት መጥቶአል ብሎ በነገረው ጊዜ፤ የዳዊት ትምህርት።1 ኃያል ሆይ፥ በክፋት ለምን ትጓደዳለህ? ሁልጊዜስ በመተላለፍ? "},
	{2, "2 አንደበትህ ኃጢአትን ያስባል፤ እንደ ተሳለ ምላጭ ሽንገላን አደረግህ። "},
	{3, "3 ከመልካም ይልቅ ክፋትን፥ ጽድቅንም ከመናገር ይልቅ ዓመፃን ወደድህ። "},
	{4, "4 የሚያጠፉ ቃልን ሁሉ፥ የሽንገላ ምላስን ወደድህ። "},
	{5, "5 ስለዚህ እግዚአብሔር ለዘላለም ያፈርስሃል፤ ከቤትህም ይነቅልሃል ያፈልስሃልም፥ ሥርህንም ከሕያዋን ምድር። "},
	{6, "6 ጻድቃን አይተው ይፈራሉ፤ በእርሱም ይሥቃሉ እንዲህም ይላሉ። "},
	{7, "7 እግዚአብሔርን ረዳቱ ያላደረገ፥ በባለጠግነቱም ብዛት የታመነ፥ በከንቱ ነገርም የበረታ ያ ሰው እነሆ። "},
	{8, "8 እኔስ በእግዚአብሔር ቤት እንደ ለመለመ እንደ ወይራ ዛፍ ነኝ፤ ለዓለምና ለዘላለም በእግዚአብሔር ምሕረት ታመንሁ። "},
	{9, "9 አድርገህልኛልና ለዘላለም አመሰግንሃለሁ፥ በቅዱሳንህም ዘንድ መልካም ነውና ስምህን ተስፋ አደርጋለሁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view53() {
struct am53 poems[] = {
	{1, "1 ለመዘምራን አለቃ በማኽላት፤ የዳዊት ትምህርት።1 ሰነፍ በልቡ። አምላክ የለም ይላል። ረከሱ በበደላቸውም ጐሰቈሉ፤ በጎ ነገርን የሚያደርጋት የለም። "},
	{2, "2 የሚያስተውል እግዚአብሔርንም የሚፈልግ እንዳለ ያይ ዘንድ እግዚአብሔር ከሰማይ የሰው ልጆችን ተመለከተ። "},
	{3, "3 ሁሉ በደሉ፥ አብረውም ረከሱ፤ አንድ ስንኳ በጎን ነገር የሚያደርጋት የለም። "},
	{4, "4 ሕዝቤን እንጀራ እንደሚበላ የሚበሉ ግፍ አድራጊዎች ሁሉ አያውቁምን? እግዚአብሔርንም አይጠሩትም። "},
	{5, "5 እግዚአብሔር የግብዞችን አጥንቶች በትኖአልና። በዚያ የሚያስፈራ ሳይኖር እጅግ ፈሩ፤ እግዚአብሔር ንቆአቸዋልና አሳፈርሃቸው። "},
	{6, "6 መድኃኒትን ከጽዮን ለእስራኤል ማን በሰጠ! እግዚአብሔር የሕዝቡን ምርኮ በመለሰ ጊዜ፥ ያዕቆብ ደስ ይለዋል እስራኤልም ሐሤት ያደርጋል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view54() {
struct am54 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ በበገናዎች፤ ዜፋውያን መጥተው ለሳኦል። እነሆ ዳዊት በእኛ ዘንድ ተሸሽጓል ብለው በነገሩት ጊዜ፤ የዳዊት ትምህርት።1 አቤቱ፥ በስምህ አድነኝ፥ በኃይልህም ፍረድልኝ። "},
	{2, "2 አቤቱ፥ ጸሎቴን ስማኝ፥ የአፌንም ቃል አድምጥ፤ "},
	{3, "3 እንግዶች ቁመውብኛልና፥ ኃያላንም ነፍሴን ሽተዋታልና። እግዚአብሔርን በፊታቸው አላደረጉትም። "},
	{4, "4 እነሆ፥ እግዚአብሔር ይረዳኛል፥ ጌታዬም ለነፍሴ ደጋፊዋ ነው። "},
	{5, "5 ክፋትን ወደ ጠላቶቼ ይመልሳታል፤ በእውነትህም አጥፋቸው። "},
	{6, "6 ከፈቃዴ እሠዋልሃለሁ፤ አቤቱ፥ መልካም ነውና ስምህን አመሰግናለሁ፤ "},
	{7, "7 ከመከራ ሁሉ አድኖኛልና፥ ዓይኔም በጠላቶቼ ላይ አይታለችና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view55() {
struct am55 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ በበገናዎች፤ የዳዊት ትምህርት።1 አቤቱ፥ ጸሎቴን አድምጥ፥ ልመናዬንም ቸል አትበል። "},
	{2, "2 ተመልከተኝ ስማኝም። በኀዘኔ ተቅበዘበዝሁ ተናወጥሁም፤ "},
	{3, "3 ከጠላት ድምፅ ከዓመፀኛም ግፍ የተነሣ፤ ዓመፃን በላዬ ጥለውብኛልና፥ በቁጣም ጠልተውኛልና። "},
	{4, "4 ልቤ በላዬ ተናወጠብኝ፥ የሞት ድንጋጤም ወደቀብኝ። "},
	{5, "5 ፍርሃትና እንቅጥቅጥ መጡብኝ፥ ጨለማም ሸፈነኝ። "},
	{6, "6 በርሬ ዐርፍ ዘንድ እንደ ርግብ ክንፍን ማን በሰጠኝ! "},
	{7, "7 እነሆ፥ ኰብልዬ በራቅሁ በምድረ በዳም በተቀመጥሁ፤ "},
	{8, "8 ከዐውሎና ከብርቱ ንፋስ ሸሽቼ በፈጠንሁ አልሁ። "},
	{9, "9 አቤቱ፥ ግፍንና ጠብን በከተማ ውስጥ አይቼአለሁና አስጥማቸው እንደበታቸውንም ቍረጥ። "},
	{10, "10 በቀንና በሌሊት በቅጥርዋ ይከብቡአታል፤ ዓመፃና ድካም ኃጢአትም በመካከልዋ ነው፤ "},
	{11, "11 ተንኰልና ሽንገላ ከአደባባይዋ አይርቁም። "},
	{12, "12 ጠላትስ ቢሰድበኝ፥ በታገሥሁ ነበር፤ የሚጠላኝም ራሱን በላዬ ከፍ ከፍ ቢያደርግ፥ ከእርሱ በተሸሸግሁ ነበር። "},
	{13, "13 አንተ ግን፥ እኩያዬ ሰው፥ ባልንጀራዬና የልቤ ወዳጅ፤ "},
	{14, "14 መብልን ከእኔ ጋር በአንድነት ያጣፈጥህ፤ በአንድ ልብ በእግዚአብሔር ቤት ተራመድን። "},
	{15, "15 ሞት ይምጣባቸው፤ በሕይወት ሳሉ ወደ ሲኦል ይውረዱ፤ ክፋት በማደሪያቸውና በመካከላቸው ነውና። "},
	{16, "16 እኔ ግን ወደ እግዚአብሔር ጮኽሁ፥ እግዚአብሔርም ሰማኝ። "},
	{17, "17 በማታና በጥዋት በቀትርም እናገራለሁ እጮኽማለሁ፥ ቃሌንም ይሰማኛል። "},
	{18, "18 በእኔ ላይ ብዙ ነበሩና ከሚቃረቡኝ ነፍሴን በሰላም አድናት። "},
	{19, "19 ቤዛ የላቸውምና፥ እግዚአብሔርንም አልፈሩትምና ከጥንት ጀምሮ የነበረ እግዚአብሔር ሰምቶ ያጐሰቍላቸዋል። "},
	{20, "20 ከእርሱ ጋር ሰላም በነበሩት ላይ እጁን ዘረጋ፤ ኪዳኑንም አረከሱ። "},
	{21, "21 አፉ ከቅቤ ይልቅ ለዘበ፥ በልቡ ግን ሰልፍ ነበረ፤ ቃሎቹም ከዘይት ይልቅ ለሰለሱ፥ እነርሱ ግን እንደ ተመዘዘ ሰይፍ ናቸው። "},
	{22, "22 ትካዜህን በእግዚአብሔር ላይ ጣል፥ እርሱም ይደግፍሃል፤ ለጻድቁም ለዘላለም ሁከትን አይሰጠውም። "},
	{23, "23 አንተ ግን፥ አቤቱ፥ ወደ ሞት ጕድጓድ ታወርዳቸዋለህ፤ የደም ሰዎችና ሸንጋዮች ዘመናቸው ግማሽ አይሞላም፤ እኔ ግን፥ አቤቱ፥ እታመንሃለሁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view56() {
struct am56 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ ከቅዱሳን ስለ ራቁ ሕዝብ፤ ፍልስጥኤማውያን በጌት በያዙት ጊዜ፤ የዳዊት ቅኔ።1 አቤቱ፥ ሰው ረግጦኛልና ማረኝ፤ ሁልጊዜም በሰልፍ አስጨንቆኛል። "},
	{2, "2 የሚዋጉኝ በዝተዋልና ሁልጊዜ ቀኑን ሁሉ ጠላቶቼ ረገጡኝ። "},
	{3, "3 እኔ ግን ፈራሁ በአንተም ታመንሁ። "},
	{4, "4 በእግዚአብሔር ቃሉን አመሰግናለሁ፤ በእግዚአብሔር ታመንሁ፥ አልፈራም፤ ሰው ምን ያደርገኛል? "},
	{5, "5 ሁልጊዜ ቃሎቼን ያጸይፉብኛል፤ በእኔ ላይም የሚመክሩት ሁሉ ለክፉ ነው። "},
	{6, "6 ይሸምቁብኛል ይሸሽጉኝማል፥ እነርሱም ተረከዜን ይመለካከታሉ፥ ሁልጊዜም ነፍሴን ይሸምቁባታል። "},
	{7, "7 በምንም ምን አታድናቸውም፤ አሕዛብን በቍጣ ትጥላቸዋለህ። "},
	{8, "8 አምላክ ሆይ፥ ሕይወቴን ነገርሁህ፤ እንባዬን እንደ ትእዛዝህ በፊተህ አኖርህ። "},
	{9, "9 በጠራሁህ ጊዜ ጠላቶቼ ወደ ኋላቸው ይመለሳሉ፤ አንተ አምላኬ እንደ ሆንህ እነሆ፥ አወቅሁ። "},
	{10, "10 በእግዚአብሔር ቃሉን አመሰግናለሁ፤ በእግዚአብሔር ቃሉን አከብራለሁ። "},
	{11, "11 በእግዚአብሔር ታመንሁ፥ አልፈራም ሰው ምን ያደርገኛል? "},
	{12, "12 አቤቱ፥ የምስጋና ስእለት የምሰጥህ ከእኔ ዘንድ ነው፤ "},
	{13, "13 ነፍሴን ከሞት፥ እግሮቼን ከመውደቅ አድነሃልና፥ በሕያዋን ብርሃን እግዚአብሔርን ደስ አሰኘው ዘንድ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view57() {
struct am57 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ አታጥፋ። ከሳኦል ፊት ሸሽቶ በዋሻ በነበረበት ጊዜ፤ የዳዊት ቅኔ።1 ማረኝ፥ አቤቱ፥ ማረኝ፥ ነፍሴ አንተን ታምናለችና፤ ጉዳት እስክታልፍ ድረስ በክንፎችህ ጥላ እታመናለሁ። "},
	{2, "2 ወደሚረዳኝ እግዚአብሔር ወደ ልዑል እግዚአብሔር እጮኻለሁ። "},
	{3, "3 ከሰማይ ልኮ አዳነኝ፥ ለረገጡኝም ውርደትን ሰጣቸው፤ እግዚአብሔር ቸርነቱንና እውነቱን ላከ። "},
	{4, "4 ነፍሴን ከአንበሶች መካከል አዳናት። ደንግጬ ተኛሁ፤ የሰው ልጆች ጥርሳቸው ጦርና ፍላጻ፥ አንደበታቸው የተሳለ ሾተል ነው። "},
	{5, "5 አምላክ ሆይ፥ በሰማያት ላይ ከፍ ከፍ በል፤ ክብርህም በምድር ሁሉ ላይ ትሁን። "},
	{6, "6 ለእግሮቼ ወጥመድን አዘጋጁ፥ ነፍሴንም አጐበጡአት፤ ጕድጓድ በፊቴ ቈፈሩ፥ በእርሱም ወደቁ። "},
	{7, "7 ልቤ ጨካኝ ነው፥ አቤቱ፥ ልቤ ጨካኝ ነው፤ እቀኛለሁ፥ እዘምራለሁ። "},
	{8, "8 ክብሬ ይነሣ፥ በገናና መሰንቆም ይነሡ፤ እኔም ማልጄ እነሣለሁ። "},
	{9, "9 አቤቱ፥ በአሕዛብ ዘንድ አመሰግንሃለሁ፥ በወገኖችም ዘንድ እዘምርልሃለሁ፤ "},
	{10, "10 ምሕረትህ እስከ ሰማይ ድረስ ከፍ ብላለችና፥ እውነትህም እስከ ደመናት ድረስ። "},
	{11, "11 አምላክ ሆይ፥ በሰማያት ላይ ከፍ ከፍ በል፤ ክብርህም በምድር ሁሉ ላይ ትሁን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view58() {
struct am58 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ አታጥፋ። የዳዊት ቅኔ።1 በእውነት ጽድቅን ብትናገሩስ፥ የሰው ልጆች ሆይ፥ በቅን ትፈርዳላችሁ፤ "},
	{2, "2 በልባችሁ በምድር ላይ ኃጢአትን ትሠራላችሁና፥ እጆቻችሁም ግፍን ይታታሉና። "},
	{3, "3 ኅጥኣን ከማኅፀን ጀምረው ተለዩ፤ ከሆድም ጀምረው ሳቱ፥ ሐሰትንም ተናገሩ። "},
	{4, "4 ቍጣቸው እንደ እባብ መርዝ ነው፥ እንደ ምድር አውሬም ጆሮዋ የተደፈነ ነው፥ "},
	{5, "5 አዋቂ ሲደግምባት የአስማተኛውን ቃል እንደማትሰማ። "},
	{6, "6 እግዚአብሔር ጥርሳቸውን በአፋቸው ውስጥ ይሰብራል፤ እግዚአብሔር የአንበሶቹን መንጋጋቸውን ያደቅቃል። "},
	{7, "7 እንደሚፈስስ ውኃ ይቀልጣሉ፤ እስኪያደክማቸው ድረስ ፍላጾቹን ይገትራል። "},
	{8, "8 እንደሚቀልጥ ሰም ያልቃሉ፤ እሳት ወደቀች፥ ፀሐይንም አላዩአትም። "},
	{9, "9 እሾኻችሁ ሳይታወቅ በትር ሆነ፤ ሕያዋን ሳላችሁ በመዓቱ ይነጥቃችኋል። "},
	{10, "10 ጻድቅ በቀልን ባየ ጊዜ ደስ ይለዋል፤ በኃጢአተኛው ደምም እጁን ይታጠባል። "},
	{11, "11 ሰውም። በእውነት ለጻድቅ ፍሬ አለው፤ በእውነት በምድር ላይ የሚፈርድ አምላክ አለ ይላል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view59() {
struct am59 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ አታጥፋ። ሳኦል ይገድሉት ዘንድ ቤቱን እንዲጠብቁ በላከ ጊዜ፤ የዳዊት ቅኔ።1 አምላኬ ሆይ፥ ከጠላቶቼ አድነኝ፤ በላዬም ከቆሙት አስጥለኝ። "},
	{2, "2 ከግፍ አድራጊዎች ታደገኝ፥ ከደም ሰዎችም አድነኝ። "},
	{3, "3 እነሆ፥ ነፍሴን ሸምቀውባታልና፥ ብርቱዎችም በላዬ ተሰበሰቡ። አቤቱ፥ በበደሌም አይደለም፥ በኃጢአቴም አይደለም። "},
	{4, "4 ያለ በደል ሮጥሁ ተዘጋጀሁም፤ ተነሥ፥ ተቀበለኝ፥ እይም። "},
	{5, "5 አንተም አቤቱ፥ የኃያላን አምላክ፥ የእስራኤል አምላክ፥ አሕዛብን ሁሉ ትጐበኛቸው ዘንድ ተነሥ፤ ዓመፅ የሚያደርጉትን ሁሉ አትማራቸው። "},
	{6, "6 ማታ ይመለሱ እንደ ውሾችም ይራቡ፥ በከተማም ይዙሩ። "},
	{7, "7 እነሆ፥ በአፋቸው አሰምተው ይናገራሉ፤ ሰይፍም በከንፈሮቻቸው አለ፤ ማን ይሰማል? ይላሉ። "},
	{8, "8 አንተ ግን አቤቱ፥ ትሥቅባቸዋለህ፥ አሕዛብንም ሁሉ ትንቃቸዋለህ። "},
	{9, "9 እግዚአብሔር መጠጊያዬ ነውና ኃይሌን ወደ አንተ አስጠጋለሁ። "},
	{10, "10 የአምላኬ ቸርነቱ ይገናኘኛል አምላኬ በጠላቶቼ ላይ ያሳየኛል። "},
	{11, "11 ሕግህን እንዳይረሱ አትግደላቸው፤ አቤቱ ጋሻዬ፥ በኃይልህ በትናቸው አውርዳቸውም። "},
	{12, "12 ስለ አፋቸው ኃጢአት ስለ ከንፈራቸውም ቃል፥ መርገምንና ሐሰትን ስለሚናገሩ፥ በትዕቢታቸው ይጠመዱ። "},
	{13, "13 በቍጣ አጥፋቸው፥ እንዳይኖሩም አጥፋቸው፤ የያዕቆብም አምላክ እስከ ምድር ዳርቻ ድረስ እንዲገዛ ይወቁ። "},
	{14, "14 ማታ ይመለሱ እንደ ውሾችም ይራቡ፥ በከተማም ይዙሩ። "},
	{15, "15 እነርሱም መብል ለመፈለግ ይበተኑ፤ ያልጠገቡ እንደ ሆነም ያንጐረጕራሉ። "},
	{16, "16 እኔ ግን ለኃይልህ እቀኛለሁ፤ በምሕረትህም ማልዶ ደስ ይለኛል፤ በመከራዬ ቀን መጠጊያዬና አምባዬ ሆነኸኛልና። "},
	{17, "17 ረዳቴ ሆይ፥ ለአንተ ለአምላኬ እዘምራለሁ፤ አንተ፥ አምላኬ፥ መጠጊያዬ ምሕረቴም ነህና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view60() {
struct am60 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የሶርያን ሁለቱን ወንዞችና የሶርያን ሶባልን ባቃጠለ ጊዜ ኢዮአብም ተመልሶ ከኤዶማውያን ሰዎች በጨው ሸለቆ አሥራ ሁለት ሺህ በገደለ ጊዜ ለትምህርት የዳዊት ቅኔ።1 አቤቱ፥ ጣልኸን አፈረስኸንም፤ ተቈጣኸን ይቅርም አልኸን። "},
	{2, "2 ምድርን አናወጥሃት አወክሃትም፤ ተናውጣለችና ቍስልዋን ፈውስ። "},
	{3, "3 ለሕዝብህ ጭንቅን አሳየሃቸው፥ አስደንጋጩንም ወይን አጠጣኸን። "},
	{4, "4 ከቀስት ፊት ያመልጡ ዘንድ፥ ለሚፈሩህ ምልክትን ሰጠሃቸው። "},
	{5, "5 ወዳጆችህ እንዲድኑ በቀኝህ አድን፥ አድምጠኝም። "},
	{6, "6 እግዚአብሔር በቅድስናው ተናገረ፤ ደስ ይለኛል፥ ሴኬምንም እካፈላለሁ፥ የሱኮትንም ሸለቆ እሰፍራለሁ። "},
	{7, "7 ገለዓድ የእኔ ነው፥ ምናሴም የእኔ ነው፤ ኤፍሬም የራሴ መጠጊያ ነው። ይሁዳ ንጉሤ ነው፤ "},
	{8, "8 ሞዓብ መታጠቢያዬ ነው፥ በኤዶምያስ ላይ ጫማዬን እዘረጋለሁ፤ ፍልስጥኤም ይገዙልኛል። "},
	{9, "9 ወደ ጽኑ ከተማ ማን ይወስደኛል? ማንስ እስከ ኤዶምያስ ይመራኛል? "},
	{10, "10 አቤቱ፥ የጣልኸን አንተ አይደለህምን? አምላክ ሆይ፥ ከሠራዊታችን ጋር አትወጣም። "},
	{11, "11 በመከራችን ረድኤትን ስጠን የሰውም ማዳን ከንቱ ነው። "},
	{12, "12 በእግዚአብሔር ኃይልን እናደርጋለን እርሱ የሚያስጨንቁንን ያዋርዳቸዋልና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view61() {
struct am61 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ በበገናዎች፤ የዳዊት መዝሙር።1 አምላክ ሆይ፥ ልመናዬን ስማ፥ ጸሎቴንም አድምጥ። "},
	{2, "2 ልቤ ተስፋ በቈረጠ ጊዜ ከምድር ዳርቻ ወደ አንተ እጮኻለሁ፤ በድንጋይ ላይ ከፍ ከፍ አደረግኸኝ። "},
	{3, "3 ጽኑ ግንብ በጠላት ፊት ተስፋዬም ሆነኸኛልና መራኸኝ። "},
	{4, "4 በድንኳንህ ለዘላለም እኖራለሁ፤ በክንፎችህም ጥላ እጋረዳለሁ፤ "},
	{5, "5 አቤቱ፥ አንተ ስእለቴን ሰምተሃልና፤ ስምህንም ለሚፈሩ ርስትህን ሰጠሃቸው። "},
	{6, "6 ለንጉሥ ከቀን በላይ ቀን ትጨምራለህ፥ ዓመታቱም ከትውልድ ወደ ትውልድ ይሆናሉ። "},
	{7, "7 በእግዚአብሔር ፊት ለዘላለም ይኖራል፤ ይጠብቁት ዘንድ ምሕረትንና እውነትን አዘጋጅለት። "},
	{8, "8 እንዲሁ ለስምህ ለዘላለም እዘምራለሁ ስእለቴን ሁልጊዜ እፈጽም ዘንድ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view62() {
struct am62 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ ስለ ኤዶታም፤ የዳዊት መዝሙር።1 ነፍሴ ለእግዚአብሔር የምትገዛ አይደለችምን? መድኃኒቴ ከእርሱ ዘንድ ናትና። "},
	{2, "2 እርሱ አምላኬ መድኃኒቴም ነውና፤ እርሱ መጠጊያዬ ነው፥ እጅግም አልታወክም። "},
	{3, "3 እስከ መቼ በሰው ላይ ትቆማላችሁ? እናንተ ሁላችሁ እንዳዘነበለ ግድግዳ እንደ ፈረሰም ቅጥር ትገድላላችሁ። "},
	{4, "4 ነገር ግን ክብሬን ይሽሩ ዘንድ መከሩ፥ ሐሰትንም ይወድዳሉ፤ በአፋቸው ይባርካሉ፥ በልባቸውም ይረግማሉ። "},
	{5, "5 ነገር ግን፥ ነፍሴ ሆይ፥ አንቺ ለእግዚአብሔር ተገዢ፥ ተስፋዬ ከእርሱ ዘንድ ናትና። "},
	{6, "6 እርሱ አምላኬ መድኃኒቴም ነውና፤ እርሱ መጠጊያዬ ነው፤ አልታወክም። "},
	{7, "7 መድኃኒቴና ክብሬ በእግዚአብሔር ነው፤ የረድኤቴ አምላክ ተስፋዬም እግዚአብሔር ነው። "},
	{8, "8 የሕዝብ ማኅበር ሁላችሁ፥ በእርሱ ታመኑ፥ ልባችሁንም በፊቱ አፍስሱ፤ እግዚአብሔር ረዳታችን ነው። "},
	{9, "9 ነገር ግን የሰው ልጆች ከንቱ ናቸው፥ የሰው ልጆችም ሐሰተኞች ናቸው፤ በሚዛንም ይበድላሉ፥ እነርሱስ በፍጹም ከንቱ ናቸው። "},
	{10, "10 ዓመፃን ተስፋ አታድርጉ፥ ቅሚያንም አትተማመኑት፤ ባለጠግነት ቢበዛ ልባችሁ አይኵራ። "},
	{11, "11 እግዚአብሔር አንድ ጊዜ ተናገረ፥ እኔም ይህን ብቻ ሰማሁ፤ ኃይል የእግዚአብሔር ነው፥ "},
	{12, "12 አቤቱ፥ ምሕረትም ያንተ ነው፤ አንተ ለእያንዳንዱ እንደ ሥራው ፍዳውን ትሰጣለህና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view63() {
struct am63 poems[] = {
	{1, "1 በኤዶምያስ ምድረ በዳ በነበረ ጊዜ፤ የዳዊት መዝሙር።1 አምላኬ፥ አምላኬ፥ ወደ አንተ እገሠግሣለሁ፤ ነፍሴ አንተን ተጠማች፥ ሥጋዬ አንተን እንዴት ናፈቀች እንጨትና ውኃ በሌለበት በምድረ በዳ። "},
	{2, "2 ኃይልህንና ክብርህን አይ ዘንድ እንዲሁ በመቅደስ ውስጥ ተመለከትሁህ። "},
	{3, "3 ምሕረትህ ከሕይወት ይሻላልና ከንፈሮቼ ያመሰግኑሃል። "},
	{4, "4 እንዲህ በሕይወቴ ዘመን አመሰግንሃለሁ፥ በአንተም ስም እጆቼን አነሣለሁ። "},
	{5, "5 ነፍሴ በቅቤና በስብ እንደሚጠግቡ ትጠግባለች፥ ከንፈሮቼም ስምህን በደስታ ያመሰግናሉ። "},
	{6, "6 በመኝታዬም አስብሃለሁ፥ በማለዳም እናገርልሃለሁ፤ "},
	{7, "7 ረዳቴ ሆነኸኛልና፥ በክንፎችህም ጥላ ደስ ይለኛልና። "},
	{8, "8 ነፍሴ በኋላህ ተከታተለች፥ እኔንም ቀኝህ ተቀበለችኝ። "},
	{9, "9 እነርሱ ግን ነፍሴን ለከንቱ ፈለጓት፤ ወደ ምድር ጥልቅ ይገባሉ። "},
	{10, "10 ለሰይፍ እጅ አልፈው ይሰጣሉ፥ የቀበሮም እድል ፈንታ ይሆናሉ። "},
	{11, "11 ንጉሥ ግን በእግዚአብሔር ደስ ይለዋል፤ በእርሱ የሚምል ሁሉ ይከብራል፥ ሐሰትን የሚናገር አፍ ይዘጋልና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view64() {
struct am64 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የዳዊት መዝሙር።1 አቤቱ፥ ወደ አንተ በለመንሁ ጊዜ ጸሎቴን ስማኝ፥ ከጠላትም ፍርሃት ነፍሴን አድን። "},
	{2, "2 ከክፉዎች ሸንጎ ከዓመፀኞችም ብዛት ሰውረኝ። "},
	{3, "3 እንደ ሰይፍ ምላሳቸውን አሰሉ፤ መራራ ነገርን ለማድረግ፥ "},
	{4, "4 ንጹሕንም በስውር ለመንደፍ ቀስትን ገተሩ፤ ድንገት ይነድፉታል አይፈሩምም። "},
	{5, "5 ለእነርሱ ለራሳቸው ክፉ ነገርን አጸኑ፤ ወጥመድን ይሰውሩ ዘንድ ተማከሩ፤ ማንስ ያየናል? ይላሉ። "},
	{6, "6 ዓመፃን ፈልጓት፥ ሲፈትኑም አለቁ፤ የሰው የውስጥ አሳቡና ልቡ የጠለቀ ነው፥ "},
	{7, "7 እግዚአብሔርም ከፍ ከፍ ይላል። የድንገትም ፍላጻ፤ ያቈስላቸዋል፤ "},
	{8, "8 አንደበታቸው ያሰናክላቸዋል፥ የሚያዩአቸውም ሁሉ ይደነግጣሉ። "},
	{9, "9 ሰዎች ሁሉ ፈሩ፥ የእግዚአብሔርንም ሥራ ተናገሩ፥ ሥራውንም አስተዋሉ። "},
	{10, "10 ጻድቅ በእግዚአብሔር ደስ ይለዋል፥ በእርሱም ይታመናል፤ ልባቸውም የቀና ሁሉ እልል ይላሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view65() {
struct am65 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የዳዊት የምስጋና መዝሙር።1 አቤቱ፥ በጽዮን ለአንተ ምስጋና ይገባል፥ ለአንተም ጸሎት ይቀርባል። "},
	{2, "2 ሥጋ ሁሉ ጸሎትን ወደምትሰማ ወደ አንተ ይመጣል። "},
	{3, "3 የዓመፃ ነገር በረታብን፤ ኃጢአታችንንስ አንተ ይቅር ትላለህ። "},
	{4, "4 አንተ የመረጥኸው በአደባባዮችህም ለማደር የተቀበልኸው ምስጉን ነው፤ ከቤትህ በረከት እንጠግባለን። "},
	{5, "5 ቤተ መቅደስህ ቅዱስ ነው በጽድቅም ድንቅ ነው። በምድር ዳርቻ ሁሉና በሩቅ ባሕር ውስጥ ላሉ ተስፋቸው የሆንህ፥ አምላካችንና መድኃኒታችን ሆይ፥ ስማን። "},
	{6, "6 በጉልበትህ ተራሮችን አጸናሃቸው፥ በኃይልም ታጥቀሃል። "},
	{7, "7 የባሕሩን ጥልቀት የሞገድንም ጩኸት ታናውጣለህ። "},
	{8, "8 ከተአምራትህ የተነሣ አሕዛብ ይደነግጣሉ፥ በምድር ዳርቻም የሚኖሩ ይፈራሉ፤ የጥዋትንና የማታን መውጫ ደስ ታሰኛቸዋለህ። "},
	{9, "9 ምድርን ጐበኘሃት አጠጣሃትም፥ ብልጥግናዋንም እጅግ አበዛህ፤ የእግዚአብሔርን ወንዝ ውኃን የተመላ ነው፤ ምግባቸውን አዘጋጀህ እንዲሁ ታሰናዳለህና። "},
	{10, "10 ትልምዋን ታረካለህ፥ ቦይዋንም ታስተካክላለህ፤ በነጠብጣብ ታለሰልሳታለህ፥ ቡቃያዋንም ትባርካለህ። "},
	{11, "11 በቸርነትህ ዓመትን ታቀዳጃለህ፥ ምድረ በዳውም ስብን ይጠግባል። "},
	{12, "12 የምድረ በዳ ተራሮች ይረካሉ፥ ኮረብቶችም በደስታ ይታጠቃሉ። "},
	{13, "13 ማሰማርያዎች መንጎችን ለበሱ፥ ሸለቆችም በእህል ተሸፈኑ፤ በደስታ ይጮኻሉ ይዘምራሉም። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view66() {
struct am66 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የመነሣት የምስጋና መዝሙር።1 በምድር ያላችሁ ሁሉ ለእግዚአብሔር እልል በሉ፥ "},
	{2, "2 ለስሙም ዘምሩ፥ ለምስጋናውም ክብርን ስጡ። "},
	{3, "3 እግዚአብሔርን እንዲህ በሉት። ሥራህ ግሩም ነው፤ ኃይልህ ብዙ ሲሆን ጠላቶች ዋሹብህ። "},
	{4, "4 በምድር ያሉ ሁሉ ለአንተ ይሰግዳሉ፥ ለአንተም ይዘምራሉ፥ ለስምህም ይዘምራሉ። "},
	{5, "5 ኑ የእግዚአብሔርንም ሥራ እዩ፤ ከሰው ልጆች ይልቅ በምክር ግሩም ነው። "},
	{6, "6 ባሕርን የብስ አደረጋት፥ ወንዙንም በእግር ተሻገሩ፤ በዚያ በእርሱ ደስ ይለናል። "},
	{7, "7 በኃይሉ ለዘላለም ይገዛል፤ ዓይኖቹ ወደ አሕዛብ ይመለከታሉ፤ ዓመፀኞች ራሳቸውን ከፍ ከፍ አያድርጉ። "},
	{8, "8 አሕዛብ ሆይ፥ አምላካችንን ባርኩ፥ የምስጋናውንም ድምፅ አሰሙ። "},
	{9, "9 ነፍሴን በሕይወት ያኖራታል፥ እግሮቼንም ለመናወጥ አልሰጠም። "},
	{10, "10 አቤቱ፥ ፈትነኸናልና፥ ብርንም እንደሚያነጥሩት አንጥረኸናልና። "},
	{11, "11 ወደ ወጥመድ አገባኸን፥ በጀርባችንም መከራን አኖርህ። "},
	{12, "12 በራሳችን ላይ ሰውን አስረገጥኸን፤ በእሳትና በውኃ መካከል አለፍን፥ ወደ ዕረፍትም አወጣኸን። "},
	{13, "14 ከሚቃጠል መሥዋዕት ጋር ወደ ቤትህ እገባለሁ፤ በመከራዬ ጊዜ በአፌ የተናገርሁትን ከንፈሮቼም ያሉትን ስእለቴን ለአንተ እፈጽማለሁ። "},
	{14, "15 ከዕጣንና ከወጠጤዎች ጋር ለሚቃጠል መሥዋዕት ፍሪዳን አቀርባለሁ፤ ላሞችንና ፍየሎችን እሠዋልሃለሁ። "},
	{15, "16 እግዚአብሔርን የምትፈሩት ሁሉ፥ ኑ፥ ስሙኝ፤ ለነፍሴ ያደረገላትን ልንገራችሁ። "},
	{16, "17 በአፌ ወደ እርሱ ጮኽሁ፥ በአንደበቴም አመሰገንሁት። "},
	{17, "18 በልቤስ በደልን አይቼ ብሆን ጌታ አይሰማኝም ነበር። "},
	{18, "19 ስለዚህ እግዚአብሔር ሰማኝ፤ የልመናዬን ድምፅ አደመጠ። "},
	{19, "20 ጸሎቴን ያልከለከለኝ ምሕረቱንም ከእኔ ያላራቀ እግዚአብሔር ይመስገን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view67() {
struct am67 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ በበገናዎች፤ የዳዊት መዝሙር።1 እግዚአብሔር ይማረን ይባርከንም፥ ፊቱንም በላያችን ያብራ፤ "},
	{2, "2 በአሕዛብ ሁሉ መካከል ማዳንህን፥ መንገድህንም በምድር እናውቅ ዘንድ። "},
	{3, "3 አቤቱ፥ አሕዛብ ያመስግኑህ፥ አሕዛብ ሁሉ ያመስግኑህ። "},
	{4, "4 ለአሕዛብ በቅን ትፈርድላቸዋለህና፥ አሕዛብንም በምድር ላይ ትመራለህና አሕዛብ ደስ ይበላቸው ሐሤትም ያድርጉ። "},
	{5, "5 አቤቱ፥ አሕዛብ ያመስግኑህ፥ አሕዛብ ሁሉ ያመስግኑህ። "},
	{6, "6 ምድር ፍሬዋን ሰጠች፤ እግዚአብሔር አምላካችንም ይባርከናል። "},
	{7, "7 እግዚአብሔር ይባርከናል፥ የምድርም ዳርቻ ሁሉ ይፈሩታል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view68() {
struct am68 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የዳዊት የምስጋና መዝሙር።1 እግዚአብሔር ይነሣ፥ ጠላቶቹም ይበተኑ፥ የሚጠሉትም ከፊቱ ይሽሹ። "},
	{2, "2 ጢስ እንደሚበንን እንዲሁ ይብነኑ፤ ሰም በእሳት ፊት እንደሚቀልጥ፥ እንዲሁ ኅጥኣን ከእግዚአብሔር ፊት ይጥፉ። "},
	{3, "3 ጻድቃንም ደስ ይበላቸው፥ በእግዚአብሔርም ፊት ሐሤት ያድርጉ፥ በደስታም ደስ ይበላቸው። "},
	{4, "4 ለእግዚአብሔር ተቀኙ ለስሙም ዘምሩ፤ ወደ ምድረ በዳ ለወጣም መንገድ አድርጉ፤ ስሙ እግዚአብሔር ነው፥ በፊቱም ደስ ይበላችሁ፤ በፊቱም ይደነግጣሉ። "},
	{5, "5 እግዚአብሔር በቅዱስ ቦታው ለድሀ አደጎች አባት፥ ለባልቴቶችም ዳኛ ነው። "},
	{6, "6 እግዚአብሔር ብቸኞችን በቤት ያሳድራቸዋል፥ እስረኞችንም በኃይሉ ያወጣቸዋል፤ ዓመፀኞች ግን በምድረ በዳ ይኖራሉ። "},
	{7, "7 አቤቱ፥ በሕዝብም ፊት በወጣህ ጊዜ፥ በምድረ በዳም ባለፍህ ጊዜ፥ ምድር ተናወጠች፥ "},
	{8, "8 ከሲና አምላክ ፊት፥ ከእስራኤል አምላክ ፊት ሰማያትም አንጠበጠቡ። "},
	{9, "9 አቤቱ፥ የሞገስን ዝናብ ለርስትህ አዘነብህ፥ በደከመም ጊዜ አንተ አጸናኸው። "},
	{10, "10 እንስሶችህ በውስጡ አደሩ፤ አቤቱ፥ በቸርነትህ ለድሆች አዘጋጀህ። "},
	{11, "11 እግዚአብሔር ቃሉን ሰጠ፤ የሚያወሩት ብዙ ሠራዊት ናቸው። "},
	{12, "12 የሠራዊት ነገሥታት ፈጥነው ይሸሻሉ፤ በቤትም የምትኖር ምርኮን ተካፈለች። "},
	{13, "13 በርስቶች መካከል ብታድሩ፥ ከብር እንደ ተሠሩ እንደ ርግብ ክንፎች፥ በቅጠልያ ወርቅም እንደ ተለበጡ ላባዎችዋ ትሆናላችሁ። "},
	{14, "14 ሰማያዊ ንጉሥ በላይዋ ባዘዘ ጊዜ፥ በሰልሞን ላይ በረዶ ዘነበ። "},
	{15, "15 የእግዚአብሔር ተራራ የለመለመ ተራራ ነው፤ የጸና ተራራና የለመለመ ተራራ ነው። "},
	{16, "16 የጸኑ ተራራዎች ለምን ይነሣሉ? እግዚአብሔር ይህን ተራራ ያድርበት ዘንድ ወደደው፤ በእውነት እግዚአብሔር ለዘላለም ያድርበታል። "},
	{17, "17 የእግዚአብሔር ሰረገላዎች የብዙ ብዙ ሺህ ናቸው፤ ጌታ በመቅደሱ በሲና በመካከላቸው ነው። "},
	{18, "18 ወደ ላይ ዓረግህ፥ ምርኮን ማረክህ፥ ስጦታንም ለሰዎች ሰጠህ፥ ደግሞም ለዓመፀኞች በዚያ ያድሩ ዘንድ። "},
	{19, "19 እግዚአብሔር አምላክ ቡሩክ ነው፤ እግዚአብሔር በየዕለቱ ቡሩክ ነው፤ የመድኃኒታችን አምላክ ይረዳናል። "},
	{20, "20 አምላካችንስ የደኅንነት አምላክ ነው፤ ከሞት መውጣትም ከእግዚአብሔር ነው። "},
	{21, "21 ነገር ግን እግዚአብሔር የጠላቶቹን ራስ፥ በኃጢአት የሚሄድንም የጠጕሩን አናት ይቀጠቅጣል። "},
	{22, "22 እግዚአብሔር እንዲህ አለ። ከባሳን አመጣቸዋለሁ፥ ከባሕርም ጥልቅ እመልሳቸዋለሁ፥ "},
	{23, "23 እግሮችህ በደም ይረገጡ ዘንድ፥ የውሾችህ ምላስ በጠላቶች ላይ ይሆን ዘንድ። "},
	{24, "24 የአምላኬ የንጉሥ መንገድ በመቅደሱ፥ አቤቱ፥ መንገድህ ተገለጠ። "},
	{25, "25 አለቆች ቀደሙ፥ መዘምራንም ተከተሉ፤ ከበሮን በሚመቱ በቈነጃጅት መካከል። "},
	{26, "26 እግዚአብሔርን በጉባኤ፥ ጌታችንንም በእስራኤል ምንጭ አመስግኑት። "},
	{27, "27 ወጣቱ ብንያም በጕልበቱ በዚያ አለ፥ ገዦቻቸው የይሁዳ አለቆች የዛብሎን አለቆችና የንፍታሌምም አለቆች። "},
	{28, "28 አቤቱ፥ ኃይልህን እዘዝ፤ አቤቱ፥ ይህንም ለእኛ የሠራኸውን አጽናው። "},
	{29, "29 በኢየሩሳሌም ስላለው መቅደስህ ነገሥታት እጅ መንሻን ለአንተ ያመጣሉ። "},
	{30, "30 በሸምበቆ ውስጥ ያሉትን አራዊት፥ በአሕዛብ ውስጥ ያሉትን የበሬዎችንና የወይፈኖችን ጉባኤ ገሥጽ፥ እንደ ብር የተፈተኑት አሕዛብ እንዳይዘጉ፤ ሰልፍን የሚወድዱትን አሕዛብን በትናቸው። "},
	{31, "31 መኳንንት ከግብጽ ይመጣሉ፤ ኢትዮጵያ እጆችዋን ወደ እግዚአብሔር ትዘረጋለች። "},
	{32, "32 የምድር ነገሥታት፥ ለእግዚአብሔር ተቀኙ፥ ለጌታም ዘምሩ። "},
	{33, "33 በምሥራቅ በኩል ወደ ሰማየ ሰማያት ለወጣ ለእግዚአብሔር ዘምሩ፤ የኃይል ቃል የሆነ ቃሉን፥ እነሆ፥ ይሰጣል። "},
	{34, "34 ለእግዚአብሔር ክብርን ስጡ፤ ግርማው በእስራኤል ላይ፥ ኃይሉም በደመናት ላይ ነው። "},
	{35, "35 እግዚአብሔር በቅዱሳኑ ላይ ድንቅ ነው፤ የእስራኤል አምላክ እርሱ ኃይልን ብርታትንም ለሕዝቡ ይሰጣል፤ እግዚአብሔርም ይመስገን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view69() {
struct am69 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ በመለከቶች፤ የዳዊት መዝሙር።1 አቤቱ፥ ውኃ እስከ ነፍሴ ደርሶብኛልና አድነኝ። "},
	{2, "2 በጥልቅ ረግረግ ጠለቅሁ መቋሚያም የለኝም። ወደ ጥልቅ ባሕር ገባሁ ማዕበልም አሰጠመኝ። "},
	{3, "3 በጩኸት ደከምሁ ጕሮሮዬም ሰለለ፤ አምላኬን ስጠብቅ ዓይኖቼ ፈዘዙ። "},
	{4, "4 በከንቱ የሚጠሉኝ ከራሴ ጠጕር በዙ፤ በዓመፅ ያሚያሳድዱኝ ጠላቶቼ በረቱ፤ በዚያን ጊዜ ያልቀማሁትን መለስሁ። "},
	{5, "5 አቤቱ፥ አንተ ስንፍናዬን ታውቃለህ፥ ኃጢአቴም ከአንተ አልተሰወረም። "},
	{6, "6 አቤቱ የሠራዊት አምላክ፥ ተስፋ የሚያደርጉህ በእኔ አይፈሩ፤ የእስራኤል አምላክ ሆይ፥ የሚሹህ በእኔ አይነወሩ። "},
	{7, "7 ስለ አንተ ስድብን ታግሻለሁና፥ እፍረትም ፊቴን ሸፍናለችና። "},
	{8, "8 ለወንድሞቼ እንደ ሌላ፥ ለእናቴ ልጆችም እንደ እንግዳ ሆንሁባቸው፥ "},
	{9, "9 የቤትህ ቅንዓት በልታኛለችና፥ የሚሰድቡህም ስድብ በላዬ ወድቆአልና። "},
	{10, "10 ነፍሴን በጾም አስመረርሁአት፥ ለስድብም ሆነብኝ። "},
	{11, "11 ማቅ ለበስሁ ምሳሌም ሆንሁላቸው። "},
	{12, "12 በደጅ የሚቀመጡ በእኔ ይጫወታሉ፤ ወይን የሚጠጡ እኔን ይዘፍናሉ። "},
	{13, "13 አቤቱ፥ በመልካሙ ጊዜ ጸሎቴ ወደ አንተ ነው፤ አቤቱ፥ በምሕረትህ ብዛት በማዳንህም እውነት አድምጠኝ። "},
	{14, "14 እንዳይውጠኝ ከረግረግ አውጣኝ፤ ከሚጠሉኝና ከጥልቅ ውኃ አስጥለኝ። "},
	{15, "15 የውኃው ማዕበል አያስጥመኝ፥ ጥልቁም አይዋጠኝ፥ ጕድጓድም አፉን በእኔ ላይ አይዝጋ። "},
	{16, "16 አቤቱ፥ ምሕረትህ መልካም ናትና ስማኝ። እንደ ርኅራኄህም ብዛት ወደ እኔ ተመልከት፤ "},
	{17, "17 ከባሪያህም ፊትህን አትሰውር፤ ተጨንቄአለሁና ፈጥነህ አድምጠኝ። "},
	{18, "18 ነፍሴን ተመልክተህ ተቤዣት፤ ስለ ጠላቶቼም አድነኝ። "},
	{19, "19 አንተ ስድቤን እፍረቴንም ነውሬንም ታውቃለህ፤ የሚያስጨንቁኝ ሁሉ በፊትህ ናቸው። "},
	{20, "20 ነፍሴ ስድብንና ኃሣርን ታገሠች፤ አስተዛዛኝም ተመኘሁ አላገኘሁም። የሚያጽናናኝም አጣሁ። "},
	{21, "21 ለመብሌ ሐሞት ሰጡኝ፥ ለጥማቴም ሆምጣጤ አጠጡኝ። "},
	{22, "22 ማዕዳቸው በፊታቸው ለወጥመድ ለፍዳ ለዕንቅፋት ትሁንባቸው፤ "},
	{23, "23 ዓይኖቻቸው እንዳያዩ ይጨልሙ፥ ጀርባቸውም ዘወትር ይጕበጥ። "},
	{24, "24 መዓትህን በላያቸው አፍስስ፥ የቍጣህ መቅሠፍትም ያግኛቸው። "},
	{25, "25 ማደሪያቸው በረሃ ትሁን፥ በድንኳኖቻቸውም የሚቀመጥ አይገኝ፤ "},
	{26, "26 አንተ የቀሠፍኸውን እነርሱ አሳድደዋልና፥ በቍስሌም ላይ ጥዝጣዜ ጨመሩብኝ። "},
	{27, "27 በኃጢአታቸው ላይ ኃጢአትን ጨምርባቸው፥ በጽድቅህም አይግቡ። "},
	{28, "28 ከሕያዋን መጽሐፍ ይደምሰሱ፥ ከጻድቃንም ጋር አይጻፉ። "},
	{29, "29 እኔ ችግረኛና ቍስለኛ ነኝ፤ አቤቱ፥ የፊትህ መድኃኒት ይቀበለኝ። "},
	{30, "30 የእግዚአብሔርን ስም በዝማሬ አመሰግናለሁ፥ በምስጋናም ከፍ ከፍ አደርገዋለሁ። "},
	{31, "31 ቀንድና ጥፍር ካበቀለ ከእምቦሳ ይልቅ እግዚአብሔርን ደስ ያሰኘዋል። "},
	{32, "32 ችግረኞች ያያሉ ደስ ይላቸዋል፤ እግዚአብሔርን ፈልጉ ሕያዋንም ሁኑ። "},
	{33, "33 እግዚአብሔር ችግረኞችን ሰምቶአልና፥ እስረኞቹንም አልናቀምና። "},
	{34, "34 ሰማይና ምድር ባሕርም በእርስዋም የሚንቀሳቀስ ሁሉ ያመሰግኑታል። "},
	{35, "35 እግዚአብሔር ጽዮንን ያድናታልና፥ የይሁዳንም ከተሞች ይሠራልና፤ በዚያም ይቀመጣሉ ይወርሱአትማል። "},
	{36, "36 የባሪያዎቹ ዘር ይኖሩባታል። ስሙንም የሚወድዱ በዚያ ይቀመጣሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view70() {
struct am70 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ ለመታሰቢያ፤ የዳዊት መዝሙር።1 አቤቱ፥ እኔን ለማዳን ተመልከት፤ አቤቱ፥ እኔን ለመርዳት ፍጠን። "},
	{2, "2 ነፍሴን የሚሹአት ይፈሩ ይጐስቍሉም፥ ክፉንም የሚመክሩብኝ ወደ ኋላቸው ይመለሱ ይፈሩም። "},
	{3, "3 እንኳ እንኳ የሚሉኝ አፍረው ወዲያው ወደ ኋላቸው ይመለሱ። "},
	{4, "4 የሚሹህ ሁሉ በአንተ ሐሤት ያድርጉ ደስ ይበላቸው፤ ማዳንህን የሚወድዱ ሁልጊዜ። እግዚአብሔር ታላቅ ነው ይበሉ። "},
	{5, "5 እኔ ችግረኛና ምስኪን ነኝ፤ አቤቱ፥ እርዳኝ፤ ረዳቴ ታዳጊዬም አንተ ነህ፤ አቤቱ፥ አትዘግይ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view71() {
struct am71 poems[] = {
	{1, "1 አስቀድመው ስለ ማረኩ ስለ አሚናዳብ ልጆች የዳዊት መዝሙር።1 አቤቱ፥ አንተን ታመንሁ፤ ለዘላለም አልፈር። "},
	{2, "2 በጽድቅህ አስጥለኝ ታደገኝም፤ ጆሮህን ወደ እኔ አዘንብል አድነኝም። "},
	{3, "3 በጠንካራ ቦታ ታድነኝ ዘንድ አምላክና መሸሸጊያ ሁነኝ፤ ኃይሌ መጠጊያዬ አንተ ነህና። "},
	{4, "4 አምላኬ፥ ከኃጢአተኛ እጅ፥ ከዓመፀኛና ከግፈኛም እጅ አድነኝ። "},
	{5, "5 አቤቱ፥ አንተ ተስፋዬ ነህና፥ እግዚአብሔር ሆይ፥ ከታናሽነቴ ጀምረህ መታመኛዬ ነህና። "},
	{6, "6 ከማኅፀን ጀምሮ በአንተ ተደገፍሁ፥ ከእናቴም ሆድ ጀምሮ አንተ መሸሸጊያዬ ነህ፤ ሁልጊዜም ዝማሬዬ ለአንተ ነው። "},
	{7, "7 ለብዙዎች መደነቂያ ሆንሁ፤ አንተ ግን ብርቱ መጠጊያዬ ነህ። "},
	{8, "8 አፌን ምስጋና ምላ ሁልጊዜ ክብርህንና ግርማህን እዘምር ዘንድ። "},
	{9, "9 በእርጅናዬ ዘመን አትጣለኝ፥ ጕልበቴም ባለቀ ጊዜ አትተወኝ። "},
	{10, "10 ጠላቶቹ በላዬ ተናግረዋልና፤ ነፍሴንም የሚሹአት በአንድነት ተማክረዋልና፥ እንዲህም አሉ። "},
	{11, "11 እግዚአብሔር ትቶታል፤ የሚያድነው የለምና ተከትላችሁ ያዙት። "},
	{12, "12 አምላክ ሆይ፥ ከእኔ አትራቅ፤ አምላኬ ሆይ፥ እኔን ለመርዳት ፍጠን። "},
	{13, "13 ነፍሴን የሚቃወሙአት ይፈሩ ይጥፉም፥ ጕዳቴንም የሚፈልጉ እፍረትንና ኃሣርን ይልበሱ። "},
	{14, "14 እኔ ግን ሁልጊዜ ተስፋ አደርጋለሁ፥ በምስጋናህም ሁሉ ላይ እጨምራለሁ። "},
	{15, "15 ሥራን አላውቅምና አፌ ጽድቅህን ሁልጊዜም ማዳንህን ይናገራል። "},
	{16, "16 በእግዚአብሔር ኃይል እገባለሁ፤ አቤቱ፥ ጽድቅህን ብቻ አስባለሁ። "},
	{17, "17 አምላኬ፥ ከታናሽነቴ ጀምረህ አስተማርኸኝ፤ እስከ ዛሬም ተአምራትህን እነግራለሁ። "},
	{18, "18 እስካረጅም እስክሸመግልም ድረስ፥ ለሚመጣ ትውልድም ሁሉ ክንድህን ኃይልህንም ጽድቅህንም እስክነግር ድረስ፥ አቤቱ፥ አትተወኝ። "},
	{19, "19 አቤቱ፥ እስከ አርያም ታላላቅ ነገሮችን አደረግህ፤ አምላክ ሆይ፥ እንደ አንተ ያለ ማን ነው? "},
	{20, "20 ብዙ ጭንቀትንና መከራን አሳይተኸኛልና፥ ተመለስህ ሕያውም አደረግኸኝ፤ ከምድር ጥልቅም እንደ ገና አወጣኸኝ። "},
	{21, "21 ጽድቅህንም አብዛው፥ ተመልሰህም ደስ አሰኘኝ፥ ከጥልቅም እንደ ገና አወጣኸኝ። "},
	{22, "22 እኔም በበገና ስለ እውነትህ አመሰግንሃለሁ፤ የእስራኤል ቅዱስ አምላክ ሆይ፥ በመሰንቆ እዘምርልሃለሁ። "},
	{23, "23 ዝማሬን ባቀርብሁልህ ጊዜ ከንፈሮቼ ደስ ይላቸዋል፥ አንተ ያዳንሃትም ነፍሴ። "},
	{24, "24 ጕዳቴን የሚሹ ባፈሩና በተነወሩ ጊዜ አንደበቴ ደግሞ ሁልጊዜ ጽድቅህን ይናገራል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view72() {
struct am72 poems[] = {
	{1, "1 ስለ ሰሎሞን።1 አቤቱ፥ ፍርድህን ለንጉሥ ስጥ፥ ጽድቅህንም ለንጉሥ ልጅ፥ "},
	{2, "2 ሕዝብህን በጽድቅ፥ ችግረኞችህንም በፍርድ ይዳኝ ዘንድ። "},
	{3, "3 ተራሮችና ኰረብቶች ለሕዝብህ ሰላምን ይቀበሉ። "},
	{4, "4 ለችግረኞች ሕዝብ በጽድቅ ትፈርዳለህ የድሆችንም ልጆች ታድናለህ፤ ክፉውንም ታዋርደዋለህ። "},
	{5, "5 ፀሐይ በሚኖርበት ዘመን ሁሉ፥ በጨረቃም ፊት ለፊት ለልጅ ልጅ ይኖራል። "},
	{6, "6 እንደ ዝናብ በታጨደ መስክ ላይ፥ በምድርም ላይ እንደሚንጠባጠብ ጠብታ ይወርዳል። "},
	{7, "7 በዘመኑም ጽድቅ ያብባል፥ ጨረቃም እስኪያልፍ ድረስ ሰላም ብዙ ነው። "},
	{8, "8 ከባሕር እስከ ባሕር ድረስ፥ ከወንዝም እስከ ምድር ዳርቻ ድረስ ይገዛል። "},
	{9, "9 በፊቱም ኢትዮጵያ ይሰግዳሉ፥ ጠላቶቹም አፈር ይልሳሉ። "},
	{10, "10 የተርሴስና የደሴቶች ነገሥታት ስጦታን ያመጣሉ፤ የዓረብና የሳባ ነገሥታት እጅ መንሻን ያቀርባሉ። "},
	{11, "11 ነገሥታት ሁሉ ይሰግዱለታል። አሕዛብም ሁሉ ይገዙለታል። "},
	{12, "12 ችግረኛውን ከቀማኛው እጅ፥ ረዳት የሌለውንም ምስኪን ያድነዋልና። "},
	{13, "13 ለችግረኛና ለምስኪን ይራራል፥ የችግረኞችንም ነፍስ ያድናል። "},
	{14, "14 ከግፍና ከጭንቀት ነፍሳቸውን ያድናል፤ ስማቸው በፊቱ ክቡር ነው። "},
	{15, "15 እርሱ ይኖራል ከዓረብም ወርቅ ይሰጡታል፤ ሁልጊዜም ወደ እርሱ ይጸልያሉ፥ ዘወትርም ይባርኩታል። "},
	{16, "16 በምድር ውስጥ በተራሮች ላይ መጠጊያ ይሆናል፤ ፍሬውም ከሊባኖስ ይልቅ ከፍ ከፍ ይላል፤ እንደ ምድር ሣር በከተማ ይበቅላል። "},
	{17, "17 ስሙ ለዘላለም ቡሩክ ይሆናል፥ ከፀሐይም አስቀድሞ ስሙ ይኖራል፤ የምድር አሕዛብ ሁሉ በእርሱ ይባረካሉም አሕዛብ ሁሉ ያመሰግኑታል። "},
	{18, "18 ብቻውን ተአምራትን የሚያደርግ የእስራኤል አምላክ እግዚአብሔር ይባረክ። "},
	{19, "19 የምስጋናው ስም ለዓለምና ለዘላለም ይባረክ፤ ምስጋናውም ምድርን ሁሉ ይምላ። ይሁን፤ ይሁን። "},
	{20, "20 የእሴይ ልጅ የዳዊት መዝሙር ተፈጸመ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view73() {
struct am73 poems[] = {
	{1, "1 የአሳፍ መዝሙር።1 ልባቸው ለቀና ለእስራኤል እግዚአብሔር እንዴት ቸር ነው። "},
	{2, "2 እኔ ግን እግሮቼ ሊሰናከሉ፥ አረማመዴም ሊወድቅ ትንሽ ቀረ። "},
	{3, "3 የኃጢአተኞችን ሰላም አይቼ በዓመፀኞች ቀንቼ ነበርና። "},
	{4, "4 ለሞታቸው መጣጣር የለውምና፤ ኃይላቸውም ጠንካራ ነውና። "},
	{5, "5 እንደ ሰው በድካም አልሆኑም፥ ከሰው ጋርም አልተገረፉም። "},
	{6, "6 ስለዚህ ትዕቢት ያዛቸው፤ ኃጢአትንና በደልን ተጐናጸፉአት። "},
	{7, "7 ዓይናቸው ስብ ስለ ሆነ ወጣ፤ ልባቸውም ከምኞታቸው ይልቅ አገኘ። "},
	{8, "8 አስበው ክፉ ነገርን ተናገሩ። ከፍ ከፍ ብለውም በዓመፃ ተናገሩ። "},
	{9, "9 አፋቸውን በሰማይ አኖሩ፥ አንደበታቸውም በምድር ውስጥ ተመላለሰ። "},
	{10, "10 ስለዚህ ሕዝቤ ወደዚህ ይመለሳሉ፤ ፍጹም ጊዜም በላያቸው ይገኛል፤ "},
	{11, "11 እግዚአብሔር እንዴት ያውቃል? በልዑልስ ዘንድ በውኑ እውቀት አለ? ይላሉ። "},
	{12, "12 እነሆ፥ እነዚህ ኃጢአተኞች ይደሰታሉ፥ ሁልጊዜም ባለጠግነታቸውን ያበዛሉ። "},
	{13, "13 እንዲህም አልሁ። በውኑ ልቤን በከንቱ አጸደቅሁ፥ እጆቼንም በንጽሕና በከንቱ አጠብሁ። "},
	{14, "14 ሁልጊዜም የተገረፍሁ ሆንሁ፥ መሰደቤም በማለዳ ነው። "},
	{15, "15 እንደዚህ ብዬ ብናገር ኖሮ፥ እነሆ፥ የልጆችህን ትውልድ በበደልሁ ነበር። "},
	{16, "16 አውቅም ዘንድ አሰብሁ፥ ይህ ግን በፊቴ ችግር ነበረ። "},
	{17, "17 ወደ እግዚአብሔር መቅደስ እስክገባ ድረስ፥ ፍጻሜአቸውንም እስካስተውል ድረስ። "},
	{18, "18 በድጥ ስፍራ አስቀመጥኻቸው፥ ወደ ጥፋትም ጣልኻቸው። "},
	{19, "19 እንዴት ለጥፋት ሆኑ! በድንገት አለቁ ስለ ኃጢአታቸውም ጠፉ። "},
	{20, "20 ከሕልም እንደሚነቃ፥ አቤቱ፥ ስትነቃ ምልክታቸውን ታስነውራለህ። "},
	{21, "21 ልቤ ነድዶአልና፥ ኵላሊቴም ቀልጦአልና፤ "},
	{22, "22 እኔ የተናቅሁ ነኝ አላውቅሁምም፥ በአንተ ዘንድም እንደ እንስሳ ሆንሁ። "},
	{23, "23 እኔ ግን ዘወትር ከአንተ ጋር ነኝ፥ ቀኝ እጄንም ያዝኸኝ። "},
	{24, "24 በአንተ ምክር መራኸኝ፤ ከክብር ጋር ተቀበልኸኝ። "},
	{25, "25 በሰማይ ያለኝ ምንድር ነው? በምድርስ ውስጥ ከአንተ ዘንድ ምን እሻለሁ? "},
	{26, "26 የልቤ አምላክ ሆይ፥ ልቤና ሥጋዬ አለቀ፤ እግዚአብሔር ግን ለዘላለም እድል ፈንታዬ ነው። "},
	{27, "27 እነሆ፥ ከአንተ የሚርቁ ይጠፋሉና ከአንተ ርቀው የሚያመነዝሩትንም ሁሉ አጠፋኻቸው። "},
	{28, "28 ለእኔ ግን ወደ እግዚአብሔር መቅረብ ይሻለኛል፤ መታመኛዬም እግዚአብሔር ነው በጽዮን ልጅ በሮች ምስጋናህን ሁሉ እናገር ዘንድ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view74() {
struct am74 poems[] = {
	{1, "1 የአሳፍ ትምህርት።1 አቤቱ፥ ስለ ምን ለዘወትር ጣልኸኝ? በማሰማርያህ በጎች ላይስ ቍጣህን ስለ ምን ተቈጣህ? "},
	{2, "2 አስቀድመህ የፈጠርሃትን ማኅበርህን፥ የተቤዤሃትንም የርስትህን በትር፥ በእርስዋ ያደርህባትን የጽዮንን ተራራ አስብ። "},
	{3, "3 ጠላት በቅዱሳንህ ላይ እንደ ከፋ መጠን፥ ሁልጊዜም በትዕቢታቸው ላይ እጅህን አንሣ። "},
	{4, "4 ጠላቶችህ በበዓል መካከል ተመኩ፤ የማያውቁትንም ምልክት ምልክታቸው አደረጉ። "},
	{5, "5 እንደ ላይኛው መግቢያ ውስጥ በዱር እንዳሉም እንጨቶች፥ በመጥረቢያ በሮችዋን ሰበሩ። "},
	{6, "6 እንዲሁ በመጥረቢያና በመዶሻ ሰበሩአት። "},
	{7, "7 መቅደስህን በእሳት አቃጠሉ፤ የስምህንም ማደሪያ በምድር ውስጥ አረከሱ። "},
	{8, "8 አንድ ሆነው በልባቸው በየሕዝባቸው። ኑ፥ የእግዚአብሔርን በዓሎች ከምድር እንሻር አሉ። "},
	{9, "9 ምልክታችንን አናይም ከእንግዲህ ወዲህም ነቢይ የለም፤ እስከ መቼ እንዲኖር የሚያውቅ በኛ ዘንድ የለም። "},
	{10, "10 አቤቱ፥ ጠላት እስከ መቼ ይሳደባል? ስምህን ጠላት ሁልጊዜ ያቃልላልን? "},
	{11, "11 ቀኝህንም በብብትህ መካከል፥ እጅህንም ፈጽመህ ለምን ትመልሳለህ? "},
	{12, "12 እግዚአብሔር ግን ከዓለም አስቀድሞ ንጉሥ ነው፥ በምድርም መካከል መድኃኒትን አደረገ። "},
	{13, "13 አንተ ባሕርን በኃይልህ አጸናሃት፤ አንተ የእባቦችን ራስ በውኃ ውስጥ ሰበርህ። "},
	{14, "14 አንተም የዘንዶውን ራሶች ቀጠቀጥህ፤ ለኢትዮጵያ ሰዎችም ምግባቸውን ሰጠሃቸው። "},
	{15, "15 አንተ ምንጮቹንና ፈሳሾቹን ሰነጠቅህ፤ አንተ ሁልጊዜ የሚፈስሱትን ወንዞች አደረቅህ። "},
	{16, "16 ቀኑ የአንተ ነው ሌሊቱም የአንተ ነው፤ አንተ ፀሓዩንና ጨረቃውን አዘጋጀህ። "},
	{17, "17 አንተ የምድርን ዳርቻ ሁሉ ሠራህ፤ በጋንም ክረምትንም አንተ አደረግህ። "},
	{18, "18 ይህን ፍጥረትህን አስብ። ጠላት እግዚአብሔርን ተላገደ፥ ሰነፍ ሕዝብም ስሙን አስቈጣ። "},
	{19, "19 የምትገዛልህን ነፍስ ለአራዊት አትስጣት፤ የችግረኞችህን ነፍስ ለዘወትር አትርሳ። "},
	{20, "20 ወደ ኪዳንህ ተመልከት፥ የምድር የጨለማ ስፍራዎች በኅጥኣን ቤቶች ተሞልተዋልና። "},
	{21, "21 ችግረኛ አፍሮ አይመለስ፤ ችግረኛና ምስኪን ስምህን ያመሰግናሉ። "},
	{22, "22 አቤቱ፥ ተነሥ በቀልህንም ተበቀል፤ ሰነፎች ሁልጊዜም የተላገዱህን አስብ። "},
	{23, "23 የባሪያዎችህን ቃል አትርሳ፤ የጠላቶችህ ኵራት ሁልጊዜ ወደ አንተ ይወጣል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view75() {
struct am75 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ አታጥፋ። የአሳፍ የምስጋና መዝሙር።1 አቤቱ፥ እናመሰግንሃለን እናመሰግንሃለን ስምህንም እንጠራለን፤ ተኣምራትህን ሁሉ እናገራለሁ። "},
	{2, "2 ጊዜውን ስቀበል እኔ በቅን እፈርዳለሁ። "},
	{3, "3 ምድርና በእርስዋ ውስጥ የሚኖሩት ሁሉ ቀለጡ፥ እኔም ምሰሶችዋን አጠናሁ። "},
	{4, "4 ዓመፀኞችን። አትበድሉ አልኋቸው፥ ኃጢአተኞችንም። ቀንዳችሁን አታንሡ፤ "},
	{5, "5 ቀንዳችሁን እስከ ላይ አታንሡ፥ በእግዚአብሔርም ላይ ዓመፅን አትናገሩ። "},
	{6, "6 ክብር ከምሥራቅ ወይም ከምዕራብ ወይም ከምድረ በዳ የለምና፤ "},
	{7, "7 እግዚአብሔር ፈራጅ ነውና ይህን ያዋርዳል ይህንም ያከብራል። "},
	{8, "8 ጽዋ በእግዚአብሔር እጅ ነውና፤ ያልተቀላቀለ የወይን ጠጅ ሞላበት፤ ከዚህ ወደዚያ አገላበጠው፥ ነገር ግን አተላው አልፈሰሰም፤ የምድር ኃጢአተኞች ሁሉ ይጠጡታል። "},
	{9, "9 እኔ ግን ለዘላለም ደስ ይለኛል፥ ለያዕቆብም አምላክ ዝማሬን አቀርባለሁ። "},
	{10, "10 የኅጥኣንን ቀንዶች ሁሉ እሰብራለሁ፤ የጻድቃን ቀንዶች ግን ከፍ ከፍ ይላሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view76() {
struct am76 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ በበገናዎች፤ ስለ አሦራውያን፤ የአሳፍ የምስጋና መዝሙር።1 እግዚአብሔር በይሁዳ ታወቀ፥ ስሙም በእስራኤል ታላቅ ነው። "},
	{2, "2 ስፍራው በሳሌም፥ ማደሪያውም በጽዮን ነው። "},
	{3, "3 በዚያም የቀስትን ኃይል፥ ጋሻን ሰይፍን ሰልፍንም ሰበረ፤ በዚያም ቀንዶችን ሰበረ። "},
	{4, "4 አንተ በዘላለም ተራሮች ሆነህ በድንቅ ታበራለህ። "},
	{5, "5 ልበ ሰነፎች ሁሉ ደነገጡ፥ እንቅልፋቸውንም አንቀላፉ፤ ባለጠጎች ሁሉ በእነርሱ እጅ ምንም አላገኙም። "},
	{6, "6 የያዕቆብ አምላክ ሆይ፥ ከተግሣጽህ የተነሣ ፈረሰኞች ሁሉ አንቀላፉ። "},
	{7, "7 አንተ ግን፥ አንተ ግሩም ነህ፤ ቍጣህን ማን ይቃወማል? "},
	{8, "8 ፍርድን ከሰማይ አሰማህ፤ ምድር ፈራች ዝምም አለች፥ "},
	{9, "9 ልበ የዋሃን ያድን ዘንድ እግዚአብሔር ለፍርድ በተነሣ ጊዜ። "},
	{10, "10 ሰው በፈቃዱ ያመሰግንሃልና፥ ከሕሊናቸው ትርፍም በዓልህን ያደርጋሉ። "},
	{11, "11 ለአምላካችን ለእግዚአብሔር ስእለትን ክፈሉ፤ በዙሪያው ያሉ ሁሉ እጅ መንሻን ለሚያስፈራው ያገባሉ። "},
	{12, "12 የመኳንንትን ነፍስ ያወጣል፤ በምድርም ነገሥታት ዘንድ ያስፈራል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view77() {
struct am77 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ ስለ ኤዶታም፤ የአሳፍ መዝሙር።1 በቃሌ ወደ እግዚአብሔር ጮኽሁ፥ ቃሌም ወደ እግዚአብሔር ነው፥ እርሱም አደመጠኝ። "},
	{2, "2 በመከራዬ ቀን እግዚአብሔርን ፈለግሁት፤ እጆቼ በሌሊት በፊቱ ናቸው፥ አላረፍሁምም፥ ነፍሴም መጽናናትን አልቻለችም። "},
	{3, "3 እግዚአብሔርን አሰብሁት ደስ አለኝም፤ ተናገርሁ፥ ነፍሴም ፈዘዘች። "},
	{4, "4 ዓይኖቼ እንዲተጉ ያዝሃቸው፤ ደነገጥሁ አልተናገርሁም። "},
	{5, "5 የዱሮውን ዘመን አሰብሁ፤ የዘላለሙን ዓመታት አሰብሁ፤ አጠናጠንሁም "},
	{6, "6 በሌሊት ከልቤ ጋር ተጫወትሁ፥ ነፍሴንም አነቃቃኋት። "},
	{7, "7 እግዚአብሔር ለዘላለም ይጥላልን? እንግዲህስ ቸርነቱን አይጨምርምን? "},
	{8, "8 ለዘላለምስ ምሕረቱ ለልጅ ልጅ ተቈረጠችን? የተናገረውስ ቃል አልቆአልን? "},
	{9, "9 እግዚአብሔርስ ሞገሱን ረሳን? በቍጣውስ ምሕረቱን ዘጋውን? "},
	{10, "10 ይህ ድካሜ ነው አልሁ፥ የልዑል ቀኝ እንደ ተለወጠ። "},
	{11, "11 የእግዚአብሔርን ሥራ አስታወስሁ፤ የቀደመውን ተአምራትህን አስታወሳለሁና፤ "},
	{12, "12 በምግባርህም ሁሉ እናገራለሁ፥ በሥራህም እጫወታለሁ። "},
	{13, "13 አቤቱ፥ መንገድህ በመቅደስ ውስጥ ነው፤ እንደ አምላካችን ያለ ታላቅ አምላክ ማን ነው? "},
	{14, "14 ተኣምራትን የምታደርግ አምላክ አንተ ነህ። ለሕዝብህ ኃይልን አስታወቅሃቸው። "},
	{15, "15 የያዕቆብንና የዮሴፍን ልጆች፥ ሕዝብህን በክንድህ አዳንሃቸው። "},
	{16, "16 አቤቱ፥ ውኆች አዩህ፥ ውኆችም አይተውህ ፈሩ፤ ጥልቆች ተነዋወጡ፥ ውኆችም ጮኹ። "},
	{17, "17 ደመኖች ድምፅን ሰጡ፥ ፍላጾችህም ወጡ። "},
	{18, "18 የነጐድጓድህ ድምፅ በዐውሎ ነበረ፤ መብረቆች ለዓለም አበሩ፤ ምድር ተናወጠች ተንቀጠቀጠችም። "},
	{19, "19 መንገድህ በባህር ውስጥ ነው፥ ፍለጋህም በብዙ ውኆች ነው፥ አረማመድህም አልታወቀም። "},
	{20, "20 በሙሴና በአሮን እጅ ሕዝብህን እንደ በጎች መራሃቸው። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view78() {
struct am78 poems[] = {
	{1, "1 የአሳፍ ትምህርት።1 ሕዝቤ ሆይ፥ ሕጌን አድምጡ፤ ጆሮአችሁንም ወደ አፌ ቃል አዘንብሉ። "},
	{2, "2 አፌን በምሳሌ እከፍታለሁ፤ ከቀድሞ ጀምሮ፥ ያለውንም ተምሳሊት እናገራለሁ። "},
	{3, "3 የሰማነውንና ያውቅነውን፥ አባቶቻችንም የነገሩንን፥ ለሚመጣ ትውልድ ከልጆቻቸው አልሰወሩም። "},
	{4, "4 የእግዚአብሔርን ምስጋናና ኃይሉን ያደረገውንም ተኣምራት ተናገሩ። "},
	{5, "5 ለልጆቻቸው ያስታውቅ ዘንድ ለአባቶቻችን ያዘዘውን ምስክር በያዕቆብ አቆመ፥ በእስራኤልም ሕግን ሠራ፤ "},
	{6, "6 የሚመጣ፥ ትውልድ የሚወለዱም ልጆች ያውቁ ዘንድ፥ ተነሥተው ለልጆቻቸው ይነግራሉ፤ "},
	{7, "7 ተስፋቸውን በእግዚአብሔር እንዲያደርጉ፥ የእግዚአብሔርንም ሥራ እንዳይረሱ፥ ትእዛዙንም እንዲጠብቁ፤ "},
	{8, "8 እንደ አባቶቻቸው እንዳይሆኑ ጠማማና የምታስመርር ትውልድ፥ ልብዋን ያላቀናች ትውልድ፥ ነፍስዋ በእግዚአብሔር ዘንድ ያልታመነች። "},
	{9, "9 የኤፍሬም ልጆች ለሰልፍ ታጥቀው ቀስትንም ገትረው በሰልፍ ቀን ወደ ኋላ ተመለሱ። "},
	{10, "10 የእግዚአብሔርን ኪዳን አልጠበቁም፥ በሕጉም ለመመላለስ እንቢ አሉ፤ "},
	{11, "11 መልካም ሥራውንና ያሳያቸውን ተኣምራቱን ረሱ፥ "},
	{12, "12 በግብጽ አገርና በጣኔዎስ በረሃ በአባቶቻቸው ፊት የሠራውን ተኣምራት። "},
	{13, "13 ባሕርን ከፍሎ አሳለፋቸው፤ ውኆችን እንደ ክምር አቆመ። "},
	{14, "14 ቀን በደመና መራቸው፥ ሌሊቱንም ሁሉ በእሳት ብርሃን። "},
	{15, "15 ዓለቱን በምድረ በዳ ሰነጠቀ፤ ከጥልቅ እንደሚገኝ ያህል በብዙ አጠጣቸው። "},
	{16, "16 ውኃን ከጭንጫ አወጣ፥ ውኃንም እንደ ወንዞች አፈሰሰ። "},
	{17, "17 ነገር ግን ይበድሉት ዘንድ እንደ ገና ደገሙ፥ ልዑልንም በምድረ በዳ አስቈጡት። "},
	{18, "18 ለነፍሳቸው መብልን ይፈልጉ ዘንድ፥ እግዚአብሔርን በልባቸው ፈተኑት። "},
	{19, "19 እግዚአብሔርን እንዲህ ብለው አሙት። እግዚአብሔር በምድረ በዳ ማዕድን ያሰናዳ ዘንድ ይችላልን? "},
	{20, "20 ዓለቱን መታ፤ ውኆችም ወጡ፥ ወንዞችም ጐረፉ፤ እንጀራን መስጠትስ ይችላልን? ለሕዝቡስ ማዕድን ያዘጋጃልን? "},
	{21, "21 እግዚአብሔርም ይህን ሰምቶ ተቈጣ፤ በያዕቆብም ላይ እሳት ነደደ፥ መዓትም በእስራኤል ላይ መጣ፤ "},
	{22, "22 በእግዚአብሔር አላመኑምና፥ በመድኃኒቱም አልተማመኑምና። "},
	{23, "23 ደመናውንም ከላይ አዘዘ፥ የሰማይንም ደጆች ከፈተ፤ "},
	{24, "24 ይበሉም ዘንድ መናን አዘነበላቸው፥ የሰማይንም እንጀራ ሰጣቸው። "},
	{25, "25 የመላክትንም እንጀራ ሰው በላ ስንቅንም እስኪተርፋቸው ላከላቸው። "},
	{26, "26 ከሰማይ የምሥራቅን ነፋስ አስነሣ፥ በኃይሉም የደቡብን ነፋስ አመጣ፤ "},
	{27, "27 ሥጋን እንደ አፈር፥ የሚበርሩትንም ወፎች እንደ ባሕር አሸዋ አዘነበላቸው፤ "},
	{28, "28 በሰፈራቸው መካከል፥ በድንኳናቸውም ዙሪያ ወደቀ። "},
	{29, "29 በሉ እጅግም ጠገቡ፤ ምኞታቸውንም ሰጣቸው። "},
	{30, "30 ከወደዱትም አላሳጣቸውም፤ መብላቸውም ገና በአፋቸው ሳለ፥ "},
	{31, "31 የእግዚአብሔር ቍጣ በላያቸው መጣ፥ ከእነርሱም ከፍ ያሉትን ገደለ፥ የእስራኤልንም ምርጦች አሰናከለ። "},
	{32, "32 ከዚህም ሁሉ ጋር እንደ ገና በደሉ፥ ተኣምራቱንም አላመኑም፤ "},
	{33, "33 ቀኖቻቸውም በከንቱ አለቁ፥ ዓመቶቻቸውም በችኰላ። "},
	{34, "34 በገደላቸውም ጊዜ ወዲያው ፈለጉት፤ ተመለሱ ወደ እግዚአብሔርም ገሠገሡ፤ "},
	{35, "35 ረዳታቸውም እግዚአብሔር፥ መድኃኒታቸውም ልዑል አምላክ እንደ ሆነ አሰቡ። "},
	{36, "36 በአፋቸው ብቻ ወደዱት፤ በአንደበታቸውም ዋሹበት፤v "},
	{37, "37 ልባቸውም ከእርሱ ጋር አልቀናም፥ በቃል ኪዳኑም አልተማመኑትም። "},
	{38, "38 እርሱ ግን መሓሪ ነው፥ ኃጢአታቸውንም ይቅር አላቸው፥ አላጠፋቸውምም፤ ቍጣውንም መመለስ አበዛ፥ መዓቱንም ሁሉ አላቃጠለም። "},
	{39, "39 ወጥቶ የማይመለስ መንፈስ፥ ሥጋም እንደ ሆኑ አሰበ። "},
	{40, "40 በምድረ በዳ ምን ያህል አስቈጡት፥ በበረሃም አሳዘኑት። "},
	{41, "41 ተመለሱ፥ እግዚአብሔርንም ፈተኑት፥ የእስራኤልንም ቅዱስ አሳዘኑት። "},
	{42, "42 እነርሱም እጁን አላሰቡም፥ ከጠላቶቻቸው እጅ ያዳነበትን ቀን፥ "},
	{43, "43 በግብጽ ያደረገውን ተኣምራቱን፥ በጣኔዎስም በረሃ ያደረገውን ድንቁን። "},
	{44, "44 ወንዞቻቸውንም ወደ ደም ለወጠ፥ ምንጮቻቸውን ደግሞ እንዳይጠጡ። "},
	{45, "45 ዝንቦችንም በላያቸው ሰደደባቸው፥ በሉአቸውም፤ በጓጉንቸርም አጠፋቸው። "},
	{46, "46 ፍሬያቸውን ለኩብኩባ፥ ሥራቸውንም ለአንበጣ ሰጠ። "},
	{47, "47 ወይናቸውን በበረዶ፥ በለሳቸውንም በአመዳይ አጠፋ። "},
	{48, "48 እንስሶቻቸውን ለበረዶ፥ ሀብታቸውንም ለእሳት ሰጠ። "},
	{49, "49 የመዓቱን መቅሠፍት በላያቸው ሰደደ፤ መቅሠፍትን መዓትንም መከራንም በክፉዎች መላእክት ሰደደ። "},
	{50, "50 ለቍጣው መንገድን ጠረገ፤ ነፍሳቸውንም ከሞት አላዳናትም፥ እንስሶቻቸውንም በሞት ውስጥ ዘጋ፤ "},
	{51, "51 በኵሮቻቸውን ሁሉ በግብጽ፥ የድካማቸውንም መጀመሪያ በካም ድንኳኖች ገደለ። "},
	{52, "52 ሕዝቡን ግን እንደ በጎች አሰማራቸው፥ እንደ መንጋም በምድረ በዳ መራቸው። "},
	{53, "53 በተስፋም መራቸው አልፈሩምም፥ ጠላቶቻቸውንም ባሕር ደፈናቸው። "},
	{54, "54 ወደ መቅደሱም ተራራ አገባቸው፥ ቀኙ ወደ ፈጠረችው ወደዚህች ተራራ፤ "},
	{55, "55 ከፊታቸውም አሕዛብን አባረረ፥ ርስቱንም በገመድ አካፈላቸው፥ የእስራኤልንም ወገኖች በቤታቸው አኖረ። "},
	{56, "56 ነገር ግን ልዑል እግዚአብሔርን ፈተኑት አስቈጡትም፥ ምስክሩንም አልጠበቁም፤ "},
	{57, "57 ተመለሱም እንደ አባቶቻቸውም ከዱ፤ እንደ ጠማማ ቀስትም ተገለበጡ፤ "},
	{58, "58 በኰረብታ መስገጃዎቻቸውም አስቈጡት፥ በተቀረጹ ምስሎቻቸውም አስቀኑት። "},
	{59, "59 እግዚአብሔርም ይህን ሰምቶ ተቈጣ፥ እስራኤልንም እጅግ ናቀ፤ "},
	{60, "60 የሴሎምን ማደሪያ ተዋት በሰዎች መካከል ያደረገባትን ድንኳኑን፤ "},
	{61, "61 ኃይላቸውን ለምርኮ፥ ሽልማቱንም በጠላት እጅ ሰጠ። "},
	{62, "62 ሕዝቡንም በጦር ውስጥ ዘጋቸው፥ ርስቱንም ቸል አላቸው። "},
	{63, "63 ጕልማሶቻቸውን እሳት በላቸው፥ ቈነጃጅቶቻቸውም አላዘኑም፤ "},
	{64, "64 ካህናቶቻቸውም በሰይፍ ወደቁ፥ ባልቴቶቻቸውም አላለቀሱላቸውም። "},
	{65, "65 እግዚአብሔርም ከእንቅልፍ እንደሚነቃ ተነሣ፥ የወይን ስካር እንደ ተወው እንደ ኃያልም ሰው፤ "},
	{66, "66 ጠላቶቹንም በኋላቸው መታ፤ የዘላለምን ኀሣር ሰጣቸው። "},
	{67, "67 የዮሴፍንም ድንኳን ተዋት፥ የኤፍሬምንም ወገን አልመረጠውም፤ "},
	{68, "68 የይሁዳን ወገን ግን መረጠ፥ የወደደውን የጽዮንን ተራራ። "},
	{69, "69 መቅደሱን እንደ አርያም ሠራ፥ ለዘላለምም በምድር ውስጥ መሠረታት። "},
	{70, "70 ዳዊትንም ባሪያውን መረጠው፥ ከበጎቹም መንጋ ውስጥ ወሰደው፤ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view79() {
struct am79 poems[] = {
	{1, "1 የአሳፍ መዝሙር።1 አቤቱ፥ አሕዛብ ወደ ርስትህ ገቡ፤ የቅድስናህንም መቅደስ አረከሱ፥ ኢየሩሳሌምንም እንደ መደብ አደረጉአት። "},
	{2, "2 የባሪያዎችህንም በድኖች ለሰማይ ወፎች መብል አደረጉ፥ የጻድቃንህንም ሥራ ለምድር አራዊት፤ "},
	{3, "3 ደማቸውንም በኢየሩሳሌም ዙሪያ እንደ ውኃ አፈሰሱ፥ የሚቀብራቸውም አጡ። "},
	{4, "4 ለጎረቤቶቻችንም ስድብ ሆንን፥ በዙሪያችንም ላሉ ሣቅና ዘበት። "},
	{5, "5 አቤቱ፥ እስከ መቼ ለዘላለም ትቈጣለህ? ቅንዓትህም እንደ እሳት ይነድዳል? "},
	{6, "6 ስምህን በማይጠሩ መንግሥታት ላይ በማያውቁህም አሕዛብ ላይ መዓትህን አፍስስ፤ "},
	{7, "7 ያዕቆብን በልተውታልና፥ ስፍራውንም ባድማ አድርገዋልና። "},
	{8, "8 የቀደመውን በደላችንን አታስብብን፥ ምሕረትህ በቶሎ ታግኘን፥ እጅግ ተቸግረናልና። "},
	{9, "9 አምላካችንና መድኃኒታችን ሆይ፥ እርዳን፤ ስለ ስምህ ክብር፥ አቤቱ፥ ታደገን፥ ስለ ስምህም ኃጢአታችንን አስተሰርይልን። "},
	{10, "10 አሕዛብ፥ አምላካቸው ወዴት ነው? እንዳይሉ፥ የፈሰሰውን የባሪያዎችህን ደም በቀል በዓይኖቻችን ፊት አሕዛብ ያወቁ፤ "},
	{11, "11 የእስረኞች ጩኸት ወደ ፊትህ ይግባ፤ እንደ ክንድህም ታላቅነት ሊገደሉ የተፈረደባቸውን አድን። "},
	{12, "12 አቤቱ፥ የተዘባበቱብህን መዘባበታቸውን ለጎረቤቶቻችን ሰባት እጥፍ በብብታቸው ክፈላቸው። "},
	{13, "13 እኛ ሕዝብህ ግን፥ የማሰማርያህም በጎች፥ ለዘላለም እናመሰግንሃለን፤ ለልጅ ልጅም ምስጋናህን እንናገራለን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view80() {
struct am80 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ በመለከቶች፤ ስለ አሦራውያን፤ የአሳፍ የምስክር መዝሙር።1 ዮሴፍን እንደ መንጋ የምትመራ፥ የእስራኤል ጠባቂ ሆይ፥ አድምጥ፤ በኪሩቤል ላይ የምትቀመጥ፥ ተገለጥ። "},
	{2, "2 በኤፍሬምና በብንያም በምናሴም፤ ኃይልህን አንሣ እኛንም ለማዳን ና። "},
	{3, "3 አቤቱ፥ መልሰን፥ ፊትህንም አብራ፥ እኛም እንድናለን። "},
	{4, "4 የሠራዊት አምላክ አቤቱ፥ በባሪያህ ጸሎት ላይ እስከ መቼ ትቈጣለህ? "},
	{5, "5 የእንባ እንጀራን ትመግበናለህ፥ እንባም በስፍር ታጠጣናለህ። "},
	{6, "6 ለጎረቤቶቻችን ክርክር አደረግኸን፥ ጠላቶቻችንም በላያችን ተሣለቁብን። "},
	{7, "7 የሠራዊት አምላክ አቤቱ፥ መልሰን፥ ፊትህንም አብራ፥ እኛም እንድናለን። "},
	{8, "8 ከግብጽ የወይን ግንድ አመጣህ፤ አሕዛብን አባረርህ እርስዋንም ተከልህ። "},
	{9, "9 በፊትዋም ስፍራን አዘጋጀህ፥ ሥሮችዋንም ተከልህ ምድርንም ሞላች። "},
	{10, "10 ጥላዋ ተራሮችን ከደነ፥ ጫፎችዋም እንደ እግዚአብሔር ዝግባ ሆኑ። "},
	{11, "11 ቅርንጫፎችዋንም እስከ ባሕር፥ ቡቃያዋንም እስከ ወንዙ ዘረጋች። "},
	{12, "12 አጥርዋን ለምን አፈረስህ? መንገድ አላፊም ሁሉ ይቀጥፋታል። "},
	{13, "13 የዱር እርያ አረከሳት፥ የአገር አውሬም ተሰማራባት። "},
	{14, "14 የሠራዊት አምላክ ሆይ፥ እንግዲህ ተመለስ፤ ከሰማይ ተመልከት፥ እይም፥ ይህችንም የወይን ግንድ ጐብኝ። "},
	{15, "15 በሰው ልጅ ለአንተ ያጸናኸውን ቀኝህ የተከላትን አንሣ። "},
	{16, "16 በእሳት ተቃጥላለች ተነቅላማለች፤ ከፊትህ ተግሣጽም የተነሣ ይጠፋሉ። "},
	{17, "17 ለአንተ ባጸናኸው በሰው ልጅ ላይ፥ በቀኝህ ሰው ላይ እጅህ ትሁን። "},
	{18, "18 ከአንተም አንራቅ፤ አድነን ስምህንም እንጠራለን። "},
	{19, "19 የሠራዊት አምላክ አቤቱ፥ መልሰን፥ ፊትህንም አብራ፥ እኛም እንድናለን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view81() {
struct am81 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ በዋሽንት፤ የአሳፍ መዝሙር።1 በረድኤታችን በእግዚአብሔር ደስ ይበላችሁ፥ ለያዕቆብም አምላክ እልል በሉ። "},
	{2, "2 ዝማሬውን አንሡ ከበሮንም ስጡ፥ ደስ የሚያሰኘውን በገና ከመሰንቆ ጋር፤ "},
	{3, "3 በመባቻ ቀን በከፍተኛው በዓላችን ቀን መለከትን ንፉ፤ "},
	{4, "4 ለእስራኤል ሥርዓቱ ነውና፥ የያዕቆብም አምላክ ፍርድ። "},
	{5, "5 ከግብጽ በወጣ ጊዜ ለዮሴፍ ምስክር አቆመው። ያላወቅሁትን ቋንቋ ሰማሁ። "},
	{6, "6 ጫንቃውን ከሸክም፥ እጆቹንም በቅርጫት ከመገዛት አራቅሁ። "},
	{7, "7 በመከራህ ጊዜ ጠራኸኝ አዳንሁህም፥ በተሰወረ ዐውሎም መለስሁልህ፥ በክርክር ውኃ ዘንድም ፈተንሁህ። "},
	{8, "8 ሕዝቤ ሆይ፥ስማኝ እነግርሃለሁም፤ እስራኤል ሆይ፥ እመሰክርልሃለሁ። "},
	{9, "9 አንተስ ብትሰማኝ ሌላ አምላክ አይሆንልህም፥ ለሌላ አምላክም አትሰግድም። "},
	{10, "10 ከግብጽ ምድር ያወጣሁህ እኔ እግዚአብሔር አምላክህ ነኝና፤ አፍህን አስፋ እሞላዋለሁም። "},
	{11, "11 ሕዝቤ ግን ቃሌን አልሰሙኝም፥ እስራኤልም አላዳመጠኝም። "},
	{12, "12 እንደ ልባቸው ሥራ ተውኋቸው፥ በልባቸውም አሳብ ሄዱ። "},
	{13, "13 ሕዝቤስ ሰምቶኝ ቢሆን፥ እስራኤልም በመንገዴ ሄደው ቢሆን፤ "},
	{14, "14 ጠላቶቻቸውን ፈጥኜ ባዋረድኋቸው ነበር፥ በሚያስጨንቋቸውም ላይ እጄን በጣልሁ ነበር፤ "},
	{15, "15 የእግዚአብሔር ጠላቶችም በተገዙለት ነበር፥ ዘመናቸውም ለዘላለም በሆነ ነበር፤ "},
	{16, "16 ከስንዴም ስብ ባበላቸው ነበር፥ ከዓለቱም ማር ባጠገባቸው ነበር። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view82() {
struct am82 poems[] = {
	{1, "1 የአሳፍ መዝሙር።1 እግዚአብሔር በአማልክት ማኅበር ቆመ፥ በአማልክትም መካከል ይፈርዳል። "},
	{2, "2 እስከ መቼ ሐሰትን ትፈርዳላችሁ? እስከ መቼ ለኃጢአተኞች ፊት ታደላላችሁ? "},
	{3, "3 ለድሆችና ለድሀ አደጎች ፍረዱ፤ ለችግረኛውና ለምስኪኑ ጽድቅ አድርጉ፤ "},
	{4, "4 ብቸኛውንና ችግረኛውን አድኑ፤ ከኃጢአተኞችም እጅ አስጥሉአቸው። "},
	{5, "5 አያውቁም፥ አያስተውሉም፤ በጨለማ ውስጥ ይመላለሳሉ፤ የምድር መሠረቶች ሁሉ ተናወጡ። "},
	{6, "6 እኔ ግን። አማልክት ናችሁ፥ ሁላችሁም የልዑል ልጆች ናችሁ፤ "},
	{7, "7 ነገር ግን እንደ ሰው ትሞታላችሁ፥ ከአለቆችም እንደ አንዱ ትወድቃላችሁ አልሁ። "},
	{8, "8 አቤቱ፥ ተነሥ፥ በምድር ላይ ፍርድ፥ አንተ አሕዛብን ሁሉ ትወርሳለህና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view83() {
struct am83 poems[] = {
	{1, "1 የአሳፍ የምስጋና መዝሙር።1 አቤቱ፥ እንደ አንተ ማን ነው? አቤቱ፥ ዝም አትበል፥ ቸልም አትበል። "},
	{2, "2 እነሆ፥ ጠላቶችህ ጮኽዋልና፥ የሚጠሉህም ራሳቸውን አንሥተዋልና። "},
	{3, "3 ሕዝብህን በምክር ሸነገሉአቸው፥ በቅዱሳንህም ላይ ተማከሩ። "},
	{4, "4 ኑ ከሕዝብ እናጥፋቸው፥ ደግሞም የእስራኤል ስም አይታሰብ አሉ። "},
	{5, "5 አንድ ሆነው በአንተ ላይ ተማከሩ፤ በአንተ ላይ ቃል ኪዳን አደረጉ፤ "},
	{6, "6 የኤዶማውያን ድንኳኖች እስማኤላውያንም፥ ሞዓብም አጋራውያንም፥ "},
	{7, "7 ጌባል አሞንም አማሌቅም፥ ፍልስጥኤማውያንም ከጢሮስ ሰዎች ጋር፤ "},
	{8, "8 አሦርም ከእነርሱ ጋር ተባበረ፥ ለሎጥ ልጆችም ረዳት ሆኑአቸው። "},
	{9, "9 እንደ ምድያምና እንደ ሲሣራ፥ በቂሶንም ወንዝ እንደ ኢያቢስ አድርግባቸው። "},
	{10, "10 በዓይንዶር ጠፉ፥ እንደ ምድርም ጕድፍ ሆኑ። "},
	{11, "11 አለቆቻቸውን እንደ ሔሬብና እንደ ዜብ፥ ታላላቆቻቸውንም እንደ ዛብሄልና እንደ ስልማና አድርጋቸው። "},
	{12, "12 የእግዚአብሔርን መሠዊያ እንወርሳለን የሚሉትን። "},
	{13, "13 አምላኬ ሆይ፥ እንደ ትቢያ በነፋስ ፊትም እንደ ገለባ አድርጋቸው። "},
	{14, "14 እሳት ዱርን እንደሚያቃጥል፥ ነበልባልም ተራሮች እንደሚያነድድ፥ "},
	{15, "15 እንዲሁ በቍጣህ አሳድዳቸው፥ በመቅሠፍትህም አስደንግጣቸው። "},
	{16, "16 ፊታቸውን እፍረት ሙላው፥ አቤቱ፥ ስምህንም ይፈልጋሉ። "},
	{17, "17 ይፈሩ ለዘላለሙም ይታወኩ፤ ይጐስቍሉ ይጥፉም። "},
	{18, "18 ስምህም እግዚአብሔር እንደ ሆነ፥ በምድር ሁሉ ላይም አንተ ብቻ ልዑል እንደ ሆንህ ይወቁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view84() {
struct am84 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ በዋሽንት፤ የቆሬ ልጆች መዝሙር።1 የሠራዊት አምላክ ሆይ፥ ማደሪያዎችህ እንደምን የተወደዱ ናቸው! "},
	{2, "2 ነፍሴ የእግዚአብሔርን አደባባዮች ትወድዳለች ትናፍቅማለች፤ ልቤም ሥጋዬም በሕያው አምላክ ደስ ተሰኘ። "},
	{3, "3 ወፍ ለእርስዋ ቤትን አገኘች፥ ዋኖስም ጫጩቶችዋን የምታኖርበት ቤት አገኘች፤ የሠራዊት አምላክ ንጉሤም አምላኬም ሆይ፥ እርሱ መሠዊያህ ነው። "},
	{4, "4 በቤትህ የሚኖሩ ሁሉ የተመሰገኑ ናቸው፤ ለዓለምና ለዘላለምም ያመሰግኑሃል። "},
	{5, "5 አቤቱ፥ እርዳታው ከአንተ ዘንድ የሆነለት፥ በልቡም የላይኛውን መንገድ የሚያስብ ሰው ምስጉን ነው። "},
	{6, "6 በልቅሶ ሸለቆ ውስጥ በወሰነው ስፍራ የሕግ መምህር በረከትን ይሰጣልና። "},
	{7, "7 ከኃይል ወደ ኃይል ይሄዳሉ፤ የአማልክት አምላክ በጽዮን ይታያል። "},
	{8, "8 የሠራዊት አምላክ አቤቱ፥ ጸሎቴን ስማ፤ የያዕቆብ አምላክ ሆይ፥ አድምጥ። "},
	{9, "9 አቤቱ፥ መታመናችንን እይልን፥ ወደ ቀባኸውም ፊት ተመልከት። "},
	{10, "10 ከአእላፍ ይልቅ በአደባባዮችህ አንዲት ቀን ትሻላለች፤ በኃጥኣን ድንኳኖች ከመቀመጥ ይልቅ፥ በእግዚአብሔር ቤት እጣል ዘንድ መረጥሁ። "},
	{11, "11 እግዚአብሔር አምላክ ምሕረትንና እውነትን ስለ ወደደ፥ ሞገስንና ክብርን ይሰጣል፤ እግዚአብሔር በቅንነት የሚሄዱትን ከመልካም ነገር አያሳጣቸውም። "},
	{12, "12 የሠራዊት አምላክ ሆይ፥ በአንተ የታመነ ሰው ምስጉን ነው። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view85() {
struct am85 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የቆሬ ልጆች መዝሙር።1 አቤቱ፥ ለምድርህ ሞገስን አደረግህ፥ የያዕቆብንም ምርኮ መለስህ። "},
	{2, "2 የሕዝብህን ኃጢአት አስቀረህ፥ አበሳቸውንም ሁሉ ከደንህ። "},
	{3, "3 መዓትህንም ሁሉ አስወገድህ፤ ከቍጣህ መቅሠፍት ተመለስህ። "},
	{4, "4 የመድኃኒታችን አምላክ ሆይ፥ መልሰን፥ ቍጣህንም ከእኛ መልስ። "},
	{5, "5 በውኑ ለዘላለም ትቈጣናለህን? ቍጣህንስ ለልጅ ልጅ ታስረዝማለህን? "},
	{6, "6 አቤቱ፥ ትመለሳለህ ታድነንማለህ፤ ሕዝቡም በአንተ ደስ ይላቸዋል። "},
	{7, "7 አቤቱ፥ ምሕረትህን አሳየን፥ አቤቱ፥ መድኃኒትህንም ስጠን። "},
	{8, "8 እግዚአብሔር አምላክ የሚናገረውን እሰማለሁ፤ ሰላምን ለሕዝቡና ለቅዱሳኑ ልባቸውንም ወደ እርሱ ለሚመልሱ ይናገራልና። "},
	{9, "9 ነገር ግን ክብር በምድራችን ያድር ዘንድ ማዳኑ ለሚፈሩት ቅርብ ነው፤ "},
	{10, "10 ምሕረትና እውነት ተገናኙ፤ ጽድቅና ሰላም ተስማሙ። "},
	{11, "11 እውነት ከምድር በቀለች፥ ጽድቅም ከሰማይ ተመለከተች። "},
	{12, "12 እግዚአብሔርም በጎ ነገርን ይሰጣል፥ ምድራችንም ፍሬዋን ትሰጣለች። "},
	{13, "13 ጽድቅ በፊቱ ይሄዳል፥ ፍለጋውንም በመንገድ ውስጥ ያኖራል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view86() {
struct am86 poems[] = {
	{1, "1 የዳዊት ጸሎት።1 አቤቱ፥ ጆሮህን ወደ እኔ አዘንብል አድምጠኝም፥ ችግረኛና ምስኪን ነኝና። "},
	{2, "2 ቅዱስ ነኝና ነፍሴን ጠብቅ፤ አምላኬ ሆይ፥ አንተን የታመነውን ባሪያህን አድነው። "},
	{3, "3 አቤቱ፥ ቀኑን ሁሉ ወደ አንተ እጮኻለሁና ማረኝ። "},
	{4, "4 የባሪያህን ነፍስ ደስ አሰኛት፥ አቤቱ፥ ነፍሴን ወደ አንተ አነሣለሁና። "},
	{5, "5 አቤቱ፥ አንተ መሓሪና ይቅር ባይ ነህና፥ ምሕረትህም ለሚጠሩህ ሁሉ ብዙ ነውና። "},
	{6, "6 አቤቱ፥ ጸሎቴን አድምጥ፥ የልመናዬንም ድምፅ ስማ። "},
	{7, "7 ትመልስልኛለህና በመከራዬ ቀን ወደ አንተ እጠራለሁ። "},
	{8, "8 አቤቱ፥ ከአማልክት የሚመስልህ የለም፥ እንደ ሥራህም ያለ የለም። "},
	{9, "9 ያደረግሃቸው አሕዛብ ሁሉ ይመጣሉ፥ አቤቱ፥ በፊትህም ይሰግዳሉ፥ ስምህንም ያከብራሉ፤ "},
	{10, "10 አቤቱ፥ ድንቅ የምታደርግ አንተ ታላቅ ነህና፥ አንተም ብቻህን ታላቅ አምላክ ነህና። "},
	{11, "11 አቤቱ፥ መንገድህን ምራኝ፥ በእውነትህም እሄዳለሁ፤ ስምህን ለመፍራት ልቤ ደስ ይለዋል። "},
	{12, "12 አቤቱ አምላኬ ሆይ፥ በልቤ ሁሉ አመሰግንሃለሁ፥ ለዘላለምም ስምህን አከብራለሁ፤ "},
	{13, "13 ምሕረትህ በእኔ ላይ ታላቅ ናትና፥ ነፍሴንም ከታችኛይቱ ሲኦል አድነሃታልና። "},
	{14, "14 አቤቱ፥ ዓመፀኞች በእኔ ላይ ተነሥተዋል፥ የክፉዎችንም ማኅበር ነፍሴን ፈለጉአት፤ በፊታቸውም አላደረጉህም። "},
	{15, "15 አቤቱ፥ አንተ ግን መሓሪና ርኅሩኅ አምላክ ነህ፤ መዓትህ የራቀ ምሕረትህም እውነትህም የበዛ፤ "},
	{16, "16 ወደ እኔ ተመልከት ማረኝም፤ ለባሪያህ ኃይልህን ስጥ፥ የሴት ባሪያህንም ልጅ አድን። "},
	{17, "17 ምልክትንም ለመልካም ከእኔ ጋር አድርግ፤ የሚጠሉኝ ይዩ ይፈሩም፥ አቤቱ፥ አንተ ረድተኸኛልና፥ አጽንተኸኛልምና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view87() {
struct am87 poems[] = {
	{1, "1 የቆሬ ልጆች የምስጋና መዝሙር።1 መሠረቶቹ በተቀደሱ ተራሮች ናቸው፤ "},
	{2, "2 ከያዕቆብ ድንኳኖች ይልቅ፥ እግዚአብሔር የጽዮንን ደጆች ይወድዳቸዋል። "},
	{3, "3 የእግዚአብሔር ከተማ ሆይ፥ በአንቺ የተከበረ ነገር ይባላል። "},
	{4, "4 የሚያውቁኝን ረዓብንና ባቢሎንን አስባቸዋለሁ፤ እነሆ፥ ፍልስጥኤማውያን ጢሮስም የኢትዮጵያም ሕዝብ፥ እነዚህ በዚያ ተወለዱ። "},
	{5, "5 ሰው እናታችን ጽዮን ይላል፥ በውስጥዋም ሰው ተወለደ፤ እርሱ ራሱም ልዑል መሠረታት። "},
	{6, "6 እግዚአብሔር ለሕዝቡ፥ በውስጥዋም ለተወለዱት አለቆችዋ በመጽሐፍ ይነግራቸዋል። "},
	{7, "7 በአንቺ የሚኖሩ ሁሉ ደስ እንደሚላቸው ይነግራቸዋል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view88() {
struct am88 poems[] = {
	{1, "1 የቆሬ ልጆች የምስጋና መዝሙር። ለመዘምራን አለቃ በማኸላት ለመዘመር፤ የይዝራኤላዊው የኤማን ትምህርት።1 አቤቱ፥ የመድኃኒቴ አምላክ፥ በቀንና በሌሊት በፊትህ ጮኽሁ፤ "},
	{2, "2 ጸሎቴ ወደ ፊትህ ትግባ፥ ጆሮህንም ወደ ጩኸቴ አዘንብል፤ "},
	{3, "3 ነፍሴ መከራን ጠግባለችና፥ ሕይወቴም ወደ ሲኦል ቀርባለችና። "},
	{4, "4 ወደ ጓድጓድ ከሚወርዱ ጋር ተቈጠርሁ፥ ረዳትም እንደሌለው ሰው ሆንሁ። "},
	{5, "5 ለዘላለም እንደማታስባቸው፥ እንደ ተገደሉና በመቃብር ውስጥ እንደ ተጣሉ፥ በሙታን ውስጥ እንዳሉ የተጣልሁ ሆንሁ፤ እነርሱም ከእጅህ ተለዩ። "},
	{6, "6 በጨለማና በሞት ጥላ ውስጥ፥ በታችኛው ጕድጓድ አስቀመጥኸኝ። "},
	{7, "7 በእኔ ላይ ቍጣህ ጸና፥ መቅሠፍትህን ሁሉ በእኔ ላይ አመጣህ። "},
	{8, "8 የሚያውቁኝን ከእኔ አራቅህ፤ በእነርሱ ዘንድ ርኵስ አደረግኸኝ፤ ያዙኝ፥ መውጫም የለኝም። "},
	{9, "9 ዓይኖቼም በመከራ ፈዘዙ፤ አቤቱ፥ ሁልጊዜ ወደ አንተ ጮኽሁ፥ እጆቼንም ወደ አንተ ዘረጋሁ፥ "},
	{10, "10 በውኑ ለሙታን ተኣምራት ታደርጋለህን? የሞቱትስ ተነሥተው ያመሰግኑሃልን? "},
	{11, "11 በመቃብርስ ውስጥ ቸርነትህን፥ እውነትህንስ በጥፋት ስፍራ ይናገራሉን? "},
	{12, "12 ተአምራትህ በጨለማ፥ ጽድቅህንም በመርሳት ምድር ትታወቃለችን? "},
	{13, "13 አቤቱ፥ እኔ ግን ወደ አንተ ጮኽሁ፤ በጥዋት ጸሎቴ ወደ ፊትህ ትደርሳለች። "},
	{14, "14 አቤቱ፥ ነፍሴን ለምን ትጥላለህ? ፊትህንስ ከእኔ ለምን ትሰውራለህ? "},
	{15, "15 እኔ ከታናሽነቴ ችግረኛ ለሞትም የቀረብሁ ነኝ፤ ከፍ ከፍ ካልሁ በኋላ ግን ተዋረድሁ ተናቅሁም። "},
	{16, "16 መቅሠፍትህ በላዬ አለፈ፥ ግርማህም አስደነገጠኝ። "},
	{17, "17 ሁልጊዜ እንደ ውኃ ከበቡኝ፥ በአንድነትም ያዙኝ። "},
	{18, "18 ወዳጄንና ባልንጀራዬን ዘመዶቼንም ከመከራ የተነሣ ከእኔ አራቅህ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view89() {
struct am89 poems[] = {
	{1, "1 የይዝራኤላዊው የኤታን ትምህርት።1 አቤቱ፥ ምሕረትህን ለዘላለም እዘምራለሁ፥ እውነትህንም በአፌ ለልጅ ልጅ እናገራለሁ። "},
	{2, "2 እንዲህ ብለሃልና። ምሕረት ለዘላለም ይመሠረታል፥ እውነትህም በሰማይ ይጸናል። "},
	{3, "3 ከመረጥሁት ጋር ቃል ኪዳኔን አደረግሁ፥ ለባሪያዬም ለዳዊት ማልሁ። "},
	{4, "4 ዘርህን ለዘላለም አዘጋጃለሁ፥ ዙፋንህንም ለልጅ ልጅ እመሠርታለሁ። "},
	{5, "5 አቤቱ፥ ሰማያት ተኣምራትህን እውነትህንም ደግሞ በቅዱሳን ማኅበር ያመሰግናሉ። "},
	{6, "6 እግዚአብሔርን በሰማይ የሚተካከለው ማን ነው? ከአማልክትስ ልጆች እግዚአብሔርን ማን ይመስለዋል? "},
	{7, "7 በቅዱሳን ምክር እግዚአብሔር ክቡር ነው፤ በዙሪያው ባሉት ሁሉ ላይ ታላቅና ግሩም ነው። "},
	{8, "8 አቤቱ የሠራዊት አምላክ፥ እንደ አንተ ያለ ማን ነው? አቤቱ፥ አንተ ብርቱ ነህ፥ እውነትህም ይከብብሃል። "},
	{9, "9 የባሕርን ኃይል አንተ ትገዛለህ፥ የሞገዱንም መናወጥ አንተ ዝም ታሰኘዋለህ። "},
	{10, "10 አንተ ረዓብን እንደ ተገደለ አዋረድኸው፥ በኃይልህም ክንድ ጠላቶችህን በተንሃቸው። "},
	{11, "11 ሰማያት የአንተ ናቸው፥ ምድርም የአንተ ናት፤ ዓለምንና ሞላውም አንተ መሠረትህ። "},
	{12, "12 ሰሜንና ደቡብን አንተ ፈጠርህ፤ ታቦርና አርሞንዔም በስምህ ደስ ይላቸዋል። "},
	{13, "13 ክንድህ ከኃይልህ ጋር ነው፤ እጅህ በረታች ቀኝህም ከፍ ከፍ አለች። "},
	{14, "14 የዙፋንህ መሠረት ጽድቅና ፍርድ ነው፤ ምሕረትና እውነት በፊትህ ይሄዳሉ። "},
	{15, "15 እልልታ የሚያውቅ ሕዝብ ምስጉን ነው፤ አቤቱ፥ በፊትህ ብርሃን ይሄዳሉ። "},
	{16, "16 በስምህ ቀኑን ሁሉ ደስ ይላቸዋል፥ በጽድቅህም ከፍ ከፍ ይላሉ፤ "},
	{17, "17 የኃይላቸው ትምክሕት አንተ ነህና፥ በሞገስህም ቀንዳችን ከፍ ከፍ ይላልና። "},
	{18, "18 ረድኤታችን ከእግዚአብሔር ከንጉሣችንም ከእስራኤል ቅዱስ ነውና። "},
	{19, "19 በዚያ ጊዜ ለልጆችህ በራእይ ተናገርህ እንዲህም አልህ። ረድኤቴን በኃይል ላይ አኖርሁ፤ ከሕዝቤ የተመረጠውን ከፍ ከፍ አደረግሁ። "},
	{20, "20 ባሪያዬን ዳዊትን አገኘሁት፥ ቅዱስ ዘይትም ቀባሁት። "},
	{21, "21 እጄም ትረዳዋለች፥ ክንዴም ታጸናዋለች። "},
	{22, "22 ጠላት በእርሱ ላይ አይጠቀምም፥ የዓመፃ ልጅም መከራ አይጨምርበትም። "},
	{23, "23 ጠላቶቹን ከፊቱ አጠፋለሁ፥ የሚጠሉትንም አዋርዳቸዋለሁ። "},
	{24, "24 እውነቴና ምሕረቴም ከእርሱ ጋር ነው፥ በስሜም ቀንዱ ከፍ ከፍ ይላል። "},
	{25, "25 እጁን በባሕር ላይ ቀኙንም በወንዞች ላይ አኖራለሁ። "},
	{26, "26 እርሱ። አባቴ አንተ ነህ፥ አምላኬ የመድኃኒቴም መጠጊያ ይላል። "},
	{27, "27 እኔም ደግሞ በኵሬ አደርገዋለሁ፥ ከምድር ነገሥታትም ከፍ ይላል። "},
	{28, "28 ለዘላለምም ምሕረቴን ለእርሱ እጠብቃለሁ፥ ኪዳኔም በእርሱ ዘንድ የታመነ ነው። "},
	{29, "29 ዘሩንም ለዓለምና ለዘላለም፥ ዙፋኑንም እንደ ሰማይ ዘመን አደርጋለሁ። "},
	{30, "30 ልጆቹ ግን ሕጌን ቢተዉ፥ በፍርዴም ባይሄዱ፤ "},
	{31, "31 ሥርዓቴንም ቢያረክሱ፥ ትእዛዜንም ባይጠብቁ፤ "},
	{32, "32 ኃጢአታቸውን በበትር፥ በደላቸውንም በመቅሠፍት እጐበኛታለሁ። "},
	{33, "33 ምሕረቴን ግን ከእርሱ አላርቅም፥ በእውነቴም አልበድልም፤ "},
	{34, "34 ኪዳኔንም አላረክስም፥ ከከንፈሬም የወጣውን አልለውጥም። "},
	{35, "35 ዳዊትን እንዳልዋሸው አንድ ጊዜ በቅዱስነቴ ማልሁ። "},
	{36, "36 ዘሩ ለዘላለም፥ ዙፋኑም በፊቴ እንደ ፀሐይ ይኖራል። "},
	{37, "37 ለዘላለም እንደ ጨረቃ ይጸናል፤ ምስክርነቱ በሰማይ የታመን ነው። "},
	{38, "38 አንተ ግን ናቅኸው ጣልኸውም፥ የቀባኸውንም ጣልኸው። "},
	{39, "39 የባሪያህንም ኪዳን አፈረስህ፥ መቅደሱንም በምድር አረከስህ። "},
	{40, "40 ቅጥሩን ሁሉ ጣልህ፥ አምባዎቹንም አጠፋህ። "},
	{41, "41 መንገድ አላፊም ሁሉ ተናጠቀው፥ ለጎረቤቶቹም ስድብ ሆነ። "},
	{42, "42 የጠላቶቹንም ቀኝ ከፍ ከፍ አደረግህ፥ ጠላቶቹንም ሁሉ ደስ አሰኘህ። "},
	{43, "43 የሰይፉንም ረድኤት መለስህ፥ በሰልፍም ውስጥ አልደገፍኸውም። "},
	{44, "44 ከንጽሕናውም ሻርኸው፥ ዙፋኑንም በምድር ጣልህ። "},
	{45, "45 የዙፋኑንም ዘመን አሳነስህ፥ በእፍረትም ሸፈንኸው። "},
	{46, "46 አቤቱ፥ እስከ መቼ ለዘላለም ፊትህን ትመልሳለህ? እስከ መቼስ ቍጣህ እንደ እሳት ይነድዳል? "},
	{47, "47 ችሎታዬ ምን እንደ ሆነ አስብ፤ በውኑ የሰውን ልጅ ሁሉ ለከንቱ ፈጠርኸውን? "},
	{48, "48 ሕያው ሆኖ የሚኖር፥ ሞትንስ የማያይ ማን ነው? ነፍሱንስ ከሲኦል እጅ የሚያድን ማን ነው? "},
	{49, "49 ለዳዊት በእውነት የማልህ፥ አቤቱ፥ የቀድሞ ምሕረትህ ወዴት ነው? "},
	{50, "50 አቤቱ፥ የባሪያዎችህን ስድብ፥ በብብቴ ብዙ አሕዛብን የተቀበልሁትን፥ "},
	{51, "51 አቤቱ፥ ጠላቶችህን የሰደቡትን የቀባኸውን ዘመን የሰደቡትን አስብ። "},
	{52, "52 እግዚአብሔር ለዘላለም ይባረክ። ይሁን ይሁን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view90() {
struct am90 poems[] = {
	{1, "1 የእግዚአብሔር ሰው የሙሴ ጸሎት።1 አቤቱ፥ አንተ ለትውልድ ሁሉ መጠጊያ ሆንህልን። "},
	{2, "2 ተራሮች ሳይወለዱ፥ ምድርም ዓለምም ሳይሠሩ፥ ከዘላለም እስከ ዘላለም ድረስ አንተ ነህ። "},
	{3, "3 ሰውን ወደ ኅሳር አትመልስም፤ የሰው ልጆች ሆይ፥ ተመለሱ ትላለህ፤ "},
	{4, "4 ሺህ ዓመት በፊትህ እንዳለፈች እንደ ትናንት ቀን፥ እንደ ሌሊትም ትጋት ነውና። "},
	{5, "5 ዘመኖች የተናቁ ይሆናሉ፥ በማለዳም እንደ ሣር ያልፋል። "},
	{6, "6 ማልዶ ያብባል ያልፋልም፥ በሠርክም ጠውልጎና ደርቆ ይወድቃል። "},
	{7, "7 እኛ በቍጣህ አልቀናልና፥ በመዓትህም ደንግጠናልና። "},
	{8, "8 የተሰወረውን ኃጢአታችንን በፊትህ ብርሃን፥ በደላችንንም በፊትህ አስቀመጥህ። "},
	{9, "9 ዘመናችን ሁሉ አልፎአልና፥ እኛም በመዓትህ አልቀናልና፤ ዘመኖቻችንም እንደ ሸረሪት ድር ይሆናሉ። "},
	{10, "10 የዘመኖቻችንም ዕድሜ ሰባ ዓመት፥ ቢበረታም ሰማንያ ዓመት ነው፤ ቢበዛ ግን ድካምና መከራ ነው፤ ከእኛ ቶሎ ያልፋልና፥ እኛም እንገሠጻለንና። "},
	{11, "11 የቍጣህን ጽናት ማን ያውቃል? ከቍጣህ ግርማ የተነሣ አለቁ። "},
	{12, "12 በልብ ጥበብን እንድንማር፥ ቀኝህን እንዲህ አስታውቀን። "},
	{13, "13 አቤቱ፥ ተመለስ፥ እስከ መቼስ ነው? ስለ ባሪያዎችህም ተምዋገት። "},
	{14, "14 በማለዳ ምሕረትህን እንጠግባለን፤ በዘመናችን ሁሉ ደስ ይለናል ሐሤትም እናደርጋለን። "},
	{15, "15 መከራ ባሳየኸን ዘመን ፈንታ፥ ክፉም ባየንባቸው ዘመኖች ፋንታ ደስ ይለናል። "},
	{16, "16 ባሪያዎችህንና ሥራህን እይ፥ ልጆቻቸውንም ምራ። "},
	{17, "17 የአምላካችን የእግዚአብሔር ብርሃን በላያችን ይሁን። የእጆቻችንንም ሥራ በላያችን አቅና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view91() {
struct am91 poems[] = {
	{1, "1 የዳዊት የምስጋና መዝሙር።1 በልዑል መጠጊያ የሚኖር ሁሉን በሚችል አምላክ ጥላ ውስጥ ያድራል። "},
	{2, "2 እግዚአብሔርን። አንተ መታመኛዬ ነህ እለዋለሁ፤ አምላኬና መሸሸጊያዬ ነው፥ በእርሱም እታመናለሁ። "},
	{3, "3 እርሱ ከአዳኝ ወጥመድ ከሚያስደነግጥም ነገር ያድንሃልና። "},
	{4, "4 በላባዎቹ ይጋርድሃል፥ በክንፎቹም በታች ትተማመናለህ፤ እውነት እንደ ጋሻ ይከብብሃል። "},
	{5, "5 ከሌሊት ግርማ፥ በቀን ከሚበርር ፍላጻ፥ "},
	{6, "6 በጨለማ ከሚሄድ ክፉ ነገር፥ ከአደጋና ከቀትር ጋኔን አትፈራም። "},
	{7, "7 በአጠገብህ ሺህ በቀኝህም አሥር ሺህ ይወድቃሉ፤ ወደ አንተ ግን አይቀርብም። "},
	{8, "8 በዓይኖችህ ብቻ ትመለከታለህ፥ የኃጥኣንንም ብድራት ታያለህ። "},
	{9, "9 አቤቱ፥ አንተ ተስፋዬ ነህና፤ ልዑልን መጠጊያህ አደረግህ። "},
	{10, "10 ክፉ ነገር ወደ አንተ አይቀርብም፥ መቅሠፍትም ወደ ቤትህ አይገባም። "},
	{11, "11 በመንገድህ ሁሉ ይጠብቁህ ዘንድ መላእክቱን ስለ አንተ ያዝዛቸዋልና፤ "},
	{12, "12 እግርህም በድንጋይ እንዳትሰናከል በእጆቻቸው ያነሡሃል። "},
	{13, "13 በተኵላና በእባብ ላይ ትጫማለህ፤ አንበሳውንና ዘንዶውን ትረግጣለህ። "},
	{14, "14 በእኔ ተማምኖአልና አስጥለዋለሁ፤ ስሜንም አውቆአልና እጋርደዋለሁ። "},
	{15, "15 ይጠራኛል እመልስለትማለሁ፥ በመከራውም ጊዜ ከእርሱ ጋራ እሆናለሁ፤ አድነዋለሁ አከብረውማለሁ። "},
	{16, "16 ረጅምን ዕድሜ አጠግበዋለሁ፥ ማዳኔንም አሳየዋለሁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view92() {
struct am92 poems[] = {
	{1, "1 በሰንበት ቀን የምስጋና መዝሙር።1 እግዚአብሔርን ማመስገን መልካም ነው፥ ልዑል ሆይ፥ ለስምህም ዝማሬ ማቅረብ፤ "},
	{2, "2 በማለዳ ምሕረትን፥ በሌሊትም እውነትህን ማውራት "},
	{3, "3 አሥር አውታር ባለው በበገና፥ ከምስጋና ጋርም በመሰንቆ። "},
	{4, "4 አቤቱ፥ በሥራህ ደስ አሰኝተኸኛልና፤ በእጅህም ሥራ ደስ ይለኛልና። "},
	{5, "5 አቤቱ፥ ሥራህ እጅግ ትልቅ ነው፥ አሳብህም እጅግ ጥልቅ ነው። "},
	{6, "6 ሰነፍ ሰው አያውቅም። ልብ የሌለውም ይህን አያስተውለውም። "},
	{7, "7 ኃጢአተኞች እንደ ሣር ሲበቅሉ ዓመፃ የሚያደርጉ ሁሉ ሲለመልሙ፥ ለዘላለም ዓለም እንዲጠፋ ነው። "},
	{8, "8 አቤቱ፥ አንተ ግን ለዘላለም ልዑል ነህ፤ "},
	{9, "9 አቤቱ፥ እነሆ፥ ጠላቶችህ ይጠፋሉና፥ ዓመፃንም የሚሠሩ ሁሉ ይበተናሉና። "},
	{10, "10 ቀንዴ አንድ ቀንድ እንዳለው ከፍ ከፍ ይላል፤ ሽምግልናዬም በዘይት ይለመልማል። "},
	{11, "11 ዓይኔም በጠላቶቼ ላይ አየች፥ ጆሮዬም በእኔ ላይ በቆሙ በክፉዎች ላይ ሰማች። "},
	{12, "12 ጻድቅ እንደ ዘንባባ ያፈራል፥ እንደ ሊባኖስ ዝግባም ያድጋል። "},
	{13, "13 በእግዚአብሔር ቤት ውስጥ ተተክለዋል፥ በአምላካችንም አደባባይ ውስጥ ይበቅላሉ። "},
	{14, "14 ያን ጊዜ በለመለመ ሽምግልና ያፈራሉ ደስተኞችም ሆነው ይኖራሉ። "},
	{15, "15 አምላኬ እግዚአብሔር እውነተኛ እንደ ሆነ ይነግራሉ፥ በእርሱም ዘንድ ዓመፃ የለም። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view93() {
struct am93 poems[] = {
	{1, "1 በሰንበት ቀን የምስጋና መዝሙር።1 እግዚአብሔር ነገሠ፥ ክብርንም ለበሰ፤ እግዚአብሔር ኃይልን ለበሰ፥ ታጠቀም፤ ዓለምን እንዳትናወጥ አጸናት። "},
	{2, "2 ዙፋንህ ከጥንት ጀምሮ የተዘጋጀ ነው፥ አንተም ከዘላለም ነህ። "},
	{3, "3 አቤቱ፥ ወንዞች ከፍ ከፍ አደረጉ፥ ወንዞች ቃሎቻቸውን ከፍ ከፍ አደረጉ። "},
	{4, "4 ከብዙ ውኆች ድምፅ ከባሕርም ታላቅ ሞገድ ይልቅ እግዚአብሔር በከፍታው ድንቅ ነው። "},
	{5, "5 ምስክርህ እጅግ የታመነ ነው፤ አቤቱ፥ እስከ ረጅም ዘመን ድረስ ለቤትህ ቅድስና ይገባል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view94() {
struct am94 poems[] = {
	{1, "1 በአራተኛ ሰንበት የዳዊት መዝሙር።1 እግዚአብሔር የበቀል አምላክ ነው። የበቀል አምላክ ተገለጠ። "},
	{2, "2 የምድር ፈራጅ ሆይ፥ ከፍ ከፍ በል፤ ለትዕቢተኞች ፍዳቸውን ክፈላቸው። "},
	{3, "3 አቤቱ፥ ኃጢአተኞች እስከ መቼ? ኃጢአተኞች እስከ መቼ ይጓደዳሉ? "},
	{4, "4 ይከራከራሉ፥ ዓመፃንም ይናገራሉ፤ ዓመፃንም የሚያደርጉ ሁሉ ይናገራሉ። "},
	{5, "5 አቤቱ፥ ሕዝብን አዋረዱ፥ ርስትህንም አስቸገሩ። "},
	{6, "6 ባልቴቲቱንና ድሀ አደጉን ገደሉ፥ ስደተኛውንም ገደሉ። "},
	{7, "7 እግዚአብሔር አያይም፥ የያዕቆብ አምላክ አያስተውልም አሉ። "},
	{8, "8 የሕዝብ ደንቆሮች ሆይ፥ አስተውሉ፤ ሰነፎችማ መቼ ይጠበባሉ? "},
	{9, "9 ጆሮን የተከለው አይሰማምን? ዓይንን የሠራው አያይምን? "},
	{10, "10 አሕዛብንስ የሚገሥጸው፥ ለሰውም እውቀት የሚያስተምረው እርሱ አይዘልፍምን? "},
	{11, "11 የሰዎች አሳብ ከንቱ እንደ ሆነ እግዚአብሔር ያውቃል። "},
	{12, "13 ለኃጢአተኛ ጕድጓድ እስኪቈፈር ድረስ ከክፉዎች ዘመናት ይወገድ ዘንድ፥ አቤቱ፥ አንተ የገሠጽኸው ሕግህንም ያስተማርኸው ሰው ምስጉን ነው። "},
	{13, "14 እግዚአብሔር ሕዝቡን አይጥልምና፥ ርስቱንም አይተውምና "},
	{14, "15 ፍርድ ወደ ጽድቅ እስኪመልስ ድረስ ልበ ቅኖችም ሁሉ ይከተሉአታል። "},
	{15, "16 በክፉዎች ላይ ለእኔ የሚቆም ማን ነው? ዓመፃንስ በሚያደርጉ ላይ ለእኔ የሚከራከር ማን ነው? "},
	{16, "17 እግዚአብሔር የረዳኝ ባይሆን ነፍሴ ለጥቂት ጊዜ በሲኦል ባደረች ነበር። "},
	{17, "18 እግሮቼ ተሰናከሉ ባልሁ ጊዜ፥ አቤቱ፥ ምሕረትህ ረዳኝ። "},
	{18, "19 አቤቱ፥ ለልቤ እንደ መከራዋ ብዛት ማጽናናትህ ነፍሴን ደስ አሰኛት። "},
	{19, "20 በሕግ ላይ ዓመፅን የሚሠራ የዓመፅ ዙፋን ከአንተ ጋር አንድ ይሆናልን? "},
	{20, "21 የጻድቅን ነፍስ ያደቡባታል፥ በንጹሕ ደምም ይፈርዳሉ። "},
	{21, "22 እግዚአብሔር መጠጊያ ሆነኝ፥ አምላኬ የተስፋዬም ረዳት ነው። "},
	{22, "23 እንደ በደላቸውም እንደ ክፋታቸውም ፍዳቸውን ይከፍላቸዋል፥ አምላካችን እግዚአብሔርም ያጠፋቸዋል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view95() {
struct am95 poems[] = {
	{1, "1 የዳዊት ምስጋና መዝሙር።1 ኑ፥ በእግዚአብሔር ደስ ይበለን፤ ለአምላክ ለመድኃኒታችን እልል እንበል። "},
	{2, "2 በምስጋና ወደ ፊቱ እንድረስ፥ በዝማሬም ለእርሱ እልል እንበል፤ "},
	{3, "3 እግዚአብሔር ታላቅ አምላክ ነውና፥ በአማልክትም ሁሉ ላይ ታላቅ ንጉሥ ነውና። "},
	{4, "4 እግዚአብሔር ሕዝቡን አይጥላቸውም፤ የምድር ዳርቻዎችም በእጁ ውስጥ ናቸው፥ የተራሮች ከፍታዎች የእርሱ ናቸው። "},
	{5, "5 ባሕር የእርሱ ናት እርሱም አደረጋት፥ የብስንም እጆቹ ሠሩአት። "},
	{6, "6 ኑ፥ እንስገድ ለእርሱም እንገዛ፤ በእርሱ ባደረገን በእግዚአብሔር ፊት እንበርከክ፤ "},
	{7, "7 እርሱ አምላካችን ነውና፥ እኛ የማሰማርያው ሕዝብ የእጁም በጎች ነንና። "},
	{8, "8 በምድረ በዳ እንደ ተፈታተኑት እንዳስቈጡት ጊዜ፥ ዛሬ ድምፁን ብትሰሙ ልባችሁን አታጽኑ። "},
	{9, "9 የተፈታተኑኝ አባቶቻችሁ ፈተኑኝ ሥራዬንም አዩ። "},
	{10, "10 ያችን ትውልድ አርባ ዓመት ተቈጥቻት ነበር። ሁልጊዜ ልባቸው ይስታል፥ እነርሱም መንገዴን አላወቁም አልሁ። "},
	{11, "11 ወደ ዕረፍቴም እንዳይገቡ በቁጣዬ ማልሁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view96() {
struct am96 poems[] = {
	{1, "1 ከምርኮ በኋላ ቤት በተሠራ ጊዜ።1 ለእግዚአብሔር አዲስ ምስጋናን አመስግኑ፤ ምድር ሁሉ፥ እግዚአብሔርን አመስግኑ። "},
	{2, "2 እግዚአብሔርን አመስግኑ ስሙንም ባርኩ፥ ዕለት ዕለትም ማዳኑን አውሩ። "},
	{3, "3 ክብሩን ለአሕዛብ ተኣምራቱንም ለወገኖች ሁሉ ንገሩ፤ "},
	{4, "4 እግዚአብሔር ታላቅ ምስጋናውም ብዙ ነውና፥ በአማልክትም ሁሉ ላይ የተፈራ ነውና። "},
	{5, "5 የአሕዛብ አማልክት ሁሉ አጋንንት ናቸውና፤ እግዚአብሔር ግን ሰማያትን ሠራ። "},
	{6, "6 ምስጋናና ውበት በፊቱ፥ ቅዱስነትና ግርማ በመቅደሱ ውስጥ ናቸው። "},
	{7, "7 የአሕዛብ ወገኖች፥ ለእግዚአብሔር አምጡ፥ ክብርና ምስጋናን ለእግዚአብሔር አምጡ፤ "},
	{8, "8 ለስሙ የሚገባ ክብርን ለእግዚአብሔር አምጡ፤ ቍርባን ያዙ ወደ አደባባዮችም ግቡ። "},
	{9, "9 በቅድስናው ስፍራ ለእግዚአብሔር ስገዱ፤ ምድር ሁሉ በፊቱ ትነዋወጥ። "},
	{10, "10 በአሕዛብ መካከል። እግዚአብሔር ነገሠ በሉ። እንዳይናወጥም ዓለሙን እርሱ አጸናው፥ አሕዛብንም በቅንነት ይፈርዳል። "},
	{11, "11 ሰማያት ደስ ይበላቸው፥ ምድርም ሐሤትን ታድርግ፤ ባሕርና ሞላዋ ይናወጡ፤ "},
	{12, "12 በረሃ በእርስዋም ያሉ ሁሉ ሐሤትን ያድርጉ፤ የዱር ዛፎች ሁሉ በዚያን ጊዜ በእግዚአብሔር ፊት ደስ ይላቸዋል፤ "},
	{13, "13 ይመጣልና፤ በምድር ላይ ሊፈርድ ይመጣልና፤ እርሱም ዓለምን በጽድቅ አሕዛብንም በቅንነት ይፈርዳል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view97() {
struct am97 poems[] = {
	{1, "1 እግዚአብሔር ነገሠ፤ ምድር ሐሤትን ታድርግ፥ ብዙ ደሴቶችም ደስ ይበላቸው። "},
	{2, "2 ደመና ጭጋግም በዙሪያው ናቸው፤ ጽድቅና ፍርድ የዙፋኑ መሠረት ናቸው። "},
	{3, "3 እሳት በፊቱ ይሄዳል፥ ጠላቶቹንም በዙሪያው ያቃጥላል። "},
	{4, "4 መብረቆቹ ለዓለም አበሩ፤ ምድር አየችና ተናወጠች። "},
	{5, "5 ተራሮችም ከእግዚአብሔር ፊት፥ ከምድር ሁሉ ጌታ ፊት እንደ ሰም ቀለጡ። "},
	{6, "6 ሰማያት የእርሱን ጽድቅ አወሩ፥ አሕዛብም ሁሉ ክብሩን አዩ። "},
	{7, "7 ለተቀረጸ ምስል የሚሰግዱ ሁሉ፥ በጣዖቶቻቸውም የሚመኩ ይፈሩ፤ መላእክቱ ሁሉ፥ ስገዱለት። "},
	{8, "8 አቤቱ፥ ስለ ፍርድህ ጽዮን ሰምታ ደስ አላት፥ የይሁዳም ሴት ልጆች ደስ አላቸው፤ "},
	{9, "9 አንተ፥ እግዚአብሔር፥ በምድር ላይ ሁሉ ልዑል ነህና፥ በአማልክትም ሁሉ ላይ እጅግ ከፍ ከፍ ብለሃልና። "},
	{10, "10 እግዚአብሔርን የምትወዱ፥ ክፋትን ጥሉ፤ እግዚአብሔር የቅዱሳኑን ነፍሶች ይጠብቃል፥ ከኃጥኣንም እጅ ያድናቸዋል። "},
	{11, "11 ብርሃን ለጻድቃን፥ ደስታም ለልበ ቅኖች ወጣ። "},
	{12, "12 ጻድቃን፥ በእግዚአብሔር ደስ ይበላችሁ፥ ለቅድስናውም መታሰቢያ አመስግኑ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view98() {
struct am98 poems[] = {
	{1, "1 የዳዊት መዝሙር።1 ለእግዚአብሔር አዲስ ምስጋናን አመስግኑ፥ እግዚአብሔር ተኣምራትን አድርጎአልና፤ ቀኙ የተቀደሰም ክንዱ ለእርሱ ማዳን አደረገ። "},
	{2, "2 እግዚአብሔር ማዳኑን አስታወቀ፥ በአሕዛብም ፊት ጽድቁን ገለጠ። "},
	{3, "3 ለያዕቆብ ምሕረቱን ለእስራኤልም ቤት እውነቱን አሰበ፤ የምድር ዳርቻዎች ሁሉ የአምላካችንን ማዳን አዩ። "},
	{4, "4 ምድር ሁሉ ሆይ፥ ለእግዚአብሔር እልል በሉ፤ አመስግኑ፥ ደስ ይበላችሁ፥ ዘምሩም። "},
	{5, "5 ለእግዚአብሔር በመሰንቆ፥ በመሰንቆና በዝማሬ ድምፅ ዘምሩ። "},
	{6, "6 በዋሽንትና በመለከት ድምፅ በንጉሥ በእግዚአብሔር ፊት እልል በሉ። "},
	{7, "7 ባሕርና ሞላዋ፥ ዓለምም በእርስዋም የሚኖሩ ይናወጡ። "},
	{8, "8 ወንዞችም በአንድነት በእጅ ያጨብጭቡ፤ ተራሮች ደስ ይበላቸው፥ በምድር ሊፈርድ ይመጣልና። "},
	{9, "9 ለዓለምም በጽድቅ ለአሕዛብም በቅንነት ይፈርዳል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view99() {
struct am99 poems[] = {
	{1, "1 የዳዊት መዝሙር።1 እግዚአብሔር ነገሠ፥ አሕዛብ ይደንግጡ፤ በኪሩቤል ላይ ተቀመጠ፥ ምድር ትናወጥ። "},
	{2, "2 እግዚአብሔር በጽዮን ታላቅ ነው፤ እርሱም በአሕዛብ ሁሉ ላይ ከፍ ከፍ አለ። "},
	{3, "3 ግሩምና ቅዱስ ነውና ሁሉ ታላቅ ስምህን ያመስግኑ። "},
	{4, "4 የንጉሥ ክብር ፍርድን ይወድዳል፤ አንተ ቅንነትን አጸናህ፥ ለያዕቆብ ፍርድንና ጽድቅን አንተ አደረግህ። "},
	{5, "5 አምላካችንን እግዚአብሔርን ከፍ ከፍ አድርጉት፥ ቅዱስ ነውና ወደ እግሩ መረገጫ ስገዱ። "},
	{6, "6 ሙሴና አሮን በካህናቱ ዘንድ፥ ሳሙኤልም ስሙን በሚጠሩት ዘንድ ናቸው። እግዚአብሔርን ጠሩት፥ እርሱም መለሰላቸው። "},
	{7, "7 በደመና ዓምድም ተናገራቸው፤ ምስክሩንና የሰጣቸውን ትእዛዝ ጠበቁ። "},
	{8, "8 አቤቱ አምላክችን ሆይ፥ አንተ ሰማሃቸው፤ አቤቱ፥ አንተ ማርሃቸው፥ ሥራቸውን ሁሉ ግን ተበቀልሃቸው። "},
	{9, "9 አምላካችንን እግዚአብሔርን ከፍ ከፍ አድርጉት፥ በቅዱስ ተራራውም ስገዱ፤ አምላካችን እግዚአብሔር ቅዱስ ነውና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view100() {
struct am100 poems[] = {
	{1, "1 የምስጋና መዝሙር።1 ምድር ሁሉ፥ ለእግዚአብሔር እልል በሉ፥ "},
	{2, "2 በደስታም ለእግዚአብሔር ተገዙ፥ በሐሤትም ወደ ፊቱ ግቡ። "},
	{3, "3 እግዚአብሔር እርሱ አምላክ እንደ ሆነ እወቁ፤ እርሱ ሠራን እኛም አይደለንም፤ እኛስ ሕዝቡ የማሰማርያውም በጎች ነን። "},
	{4, "4 ወደ ደጆቹ በመገዛት፥ ወደ አደባባዮቹም በምስጋና ግቡ፤ አመስግኑት፥ ስሙንም ባርኩ፤ "},
	{5, "5 እግዚአብሔር ቸር፥ ምሕረቱም ለዘላለም፥ እውነቱም ለልጅ ልጅ ነውና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view101() {
struct am101 poems[] = {
	{1, "1 የዳዊት መዝሙር።1 አቤቱ፥ ምሕረትንና ፍርድን እቀኝልሃለሁ። "},
	{2, "2 እዘምራለሁ፥ ንጹሕ መንገዱንም አስተውላለሁ፤ ወደ እኔ መቼ ትመጣለህ? በቤቴ መካከል በልቤ ቅንነት እሄዳለሁ። "},
	{3, "3 በዓይኔ ፊት ክፉን ነገር አላኖርሁም፤ ሕግ ተላላፊዎችን ጠላሁ። "},
	{4, "4 ጠማማ ልብም አልተጠጋኝም፤ ክፉ ከእኔ በራቀ ጊዜ አላወቅሁም። "},
	{5, "5 ባልንጀራውን በቀስታ የሚያማን እርሱን አሳደድሁ፤ በዓይኑ ትዕቢተኛ የሆነውና ልቡ የሚሳሳው ከእኔ ጋር አይተባበርም። "},
	{6, "6 ከእኔ ጋር ይኖሩ ዘንድ፤ ዓይኖቼ በምድር ምእመናን ላይ ናቸው፤ በቀና መንገድ የሚሄድ እርሱ ያገለግለኛል። "},
	{7, "7 ትዕቢትን የሚያደርግ በቤቴ መካከል አይኖርም፤ ዓመፅን የሚናገር በዓይኔ ፊት አይቀናም። "},
	{8, "8 ዓመፃ የሚያደርጉትን ሁሉ ከእግዚአብሔር ከተማ አጠፋቸው ዘንድ፥ የምድርን ኃጢአተኞች ሁሉ በማለዳ እገድላቸዋለሁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view102() {
struct am102 poems[] = {
	{1, "1 ባዘነና ልመናውን በእግዚአብሔር ፊት ባፈሰሰ ጊዜ የችግረኛ ጸሎት።1 አቤቱ፥ ጸሎቴን ስማኝ፥ ጩኸቴም ወደ አንተ ይድረስ። "},
	{2, "2 በመከራዬ ቀን ፊትህን ከኔ አትመልስ፤ ጆሮህን ወደ እኔ አዘንብል፤ በጠራሁህ ቀን ፈጥነህ ስማኝ። "},
	{3, "3 ዘመኔ እንደ ጢስ አልቃለችና፥ አጥንቶቼም እንደ መቃጠያ ተቃጥለዋልና። "},
	{4, "4 እህል መብላት ተረስቶኛልና ተቀሠፍሁ ልቤም እንደ ሣር ደረቀ። "},
	{5, "5 ከጩኸቴ ድምፅ የተነሣ አጥንቶቼ ከሥጋዬ ጋር ተጣበቁ። "},
	{6, "6 እንደ ምድረ በዳ እርኩም መሰልሁ፤ በፈረሰ ቤት እንዳለ እንደ ጕጕት ሆንሁ። "},
	{7, "7 ተጋሁ፥ በሰገነትም እንደሚኖር ብቸኛ ድንቢጥ ሆንሁ። "},
	{8, "8 ጠላቶቼ ሁልጊዜ ይሰድቡኛል፥ የሚያሳድዱኝም ተማማሉብኝ። "},
	{9, "9 አመድን እንደ እህል ቅሜአለሁና፥ መጠጤንም ከእንባዬ ጋር ቀላቅያለሁና፥ "},
	{10, "10 ከቍጣህና ከመዓትህም የተነሣ፤ አንሥተኸኛልና፥ ጥለኸኝማልና። "},
	{11, "11 ዘመኖቼ እንደ ጥላ አዘንብለዋል፤ እኔም እንደ ሣር ደርቄአለሁ። "},
	{12, "12 አንተ ግን፥ አቤቱ፥ ለዘላለም ትኖራለህ፥ መታሰቢያህም ለልጅ ልጅ ነው። "},
	{13, "13 አንተ ተነሥ ጽዮንንም ይቅር በላት፥ የምሕረትዋ ጊዜ ነውና፥ ዘመንዋም ደርሶአልና፤ "},
	{14, "14 ባሪያዎችህም ድንጋዮችዋን ወድደዋልና፥ ለመሬትዋም አዝነዋልና። "},
	{15, "15 አቤቱ፥ አሕዛብ ስምህን፥ ነገሥታትም ሁሉ ክብርህን ይፈራሉ፤ "},
	{16, "16 እግዚአብሔር ጽዮንን ይሠራታልና፥ በክብሩም ይገለጣልና። "},
	{17, "17 ወደ ችግረኞች ጸሎት ተመለከተ፥ ልመናቸውንም አልናቀም። "},
	{18, "18 ይህ ለሚመጣ ትውልድ ይጻፍ፥ የሚፈጠርም ሕዝብ ለእግዚአብሔር እልል ይላል፤ "},
	{19, "19 እግዚአብሔር ከመቅደሱ ከፍታ ሆኖ ተመልክቶአልና፥ ከሰማይ ሆኖ ምድርን አይቶአልና፤ "},
	{20, "20 የእስረኞችን ጩኸት ይሰማ ዘንድ፥ ሊገድሉ የተፈረደባቸውን ያድን ዘንድ፤ "},
	{21, "21 የእግዚአብሔርን ስም በጽዮን ምስጋናውንም በኢየሩሳሌም ይናገሩ ዘንድ፤ "},
	{22, "22 አሕዛብ በአንድነት በተሰበሰቡ ጊዜ መንግሥታትም ለእግዚአብሔር ይገዙ ዘንድ። "},
	{23, "23 በኃይሉ ጎዳና መለሰለት። የዘመኔን አነስተኛነት ንገረኝ። "},
	{24, "24 በዘመኔ እኵሌታ አትውሰደኝ፤ ዓመቶችህ ለልጅ ልጅ ናቸው። "},
	{25, "25 አቤቱ፥ አንተ ከጥንት ምድርን መሠረትህ፥ ሰማያትም የእጅህ ሥራ ናቸው። "},
	{26, "26 እነርሱ ይጠፋሉ፥ አንተ ግን ትኖራለህ፤ ሁላቸው እንደ ልብስ ያረጃሉ፥ እንደ መጐናጸፊያም ትለውጣቸዋለህ፥ ይለወጡማል፤ "},
	{27, "27 አንተ ግን ያው አንተ ነህ፥ ዓመቶችህም ከቶ አያልቁም። "},
	{28, "28 የባሪያዎችህም ልጆች ይኖራሉ፥ ዘራቸውም ለዘላለም ትጸናለች። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view103() {
struct am103 poems[] = {
	{1, "1 የዳዊት መዝሙር።1 ነፍሴ ሆይ፥ እግዚአብሔርን ባርኪ፥ አጥንቶቼም ሁሉ፥ የተቀደሰ ስሙን። "},
	{2, "2 ነፍሴ ሆይ፥ እግዚአብሔርን ባርኪ፥ ምስጋናውንም ሁሉ አትርሺ፤ "},
	{3, "3 ኃጢአትሽን ሁሉ ይቅር የሚል፥ ደዌሽንም ሁሉ የሚፈውስ፥ "},
	{4, "4 ሕይወትሽን ከጥፋት የሚያድናት፥ በምሕረቱና በቸርነቱ የሚከልልሽ፥ "},
	{5, "5 ምኞትሽን ከበረከቱ የሚያጠግባት፥ ጕልማስነትሽን እንደ ንስር ያድሳል። "},
	{6, "6 እግዚአብሔር ይቅርታ አድራጊ ነው፤ ለተበደሉ ሁሉ ይፈርዳል። "},
	{7, "7 ለሙሴ መንገዱን አስታወቀ፥ ለእስራኤል ልጆችም አደራረጉን። "},
	{8, "8 እግዚአብሔር መሓሪና ይቅር ባይ ነው፥ ከቍጣ የራቀ ምሕረቱም የበዛ። "},
	{9, "9 ሁልጊዜም አይቀሥፍም፥ ለዘላለምም አይቈጣም። "},
	{10, "10 እንደ ኃጢአታችን አላደረገብንም፥ እንደ በደላችንም አልከፈለንም። "},
	{11, "11 ሰማይ ከምድር ከፍ እንደሚል፥ እንዲሁ እግዚአብሔር ምሕረቱን በሚፈሩት ላይ አጠነከረ። "},
	{12, "12 ምሥራቅ ከምዕራብ እንደሚርቅ፥ እንዲሁ ኃጢአታችንን ከእኛ አራቀ። "},
	{13, "13 አባት ለልጆቹ እንደሚራራ እንዲሁ እግዚአብሔር ለሚፈሩት ይራራል፤ "},
	{14, "14 ፍጥረታችንን እርሱ ያውቃልና፤ አቤቱ፥ እኛ አፈር እንደ ሆንን አስብ። "},
	{15, "15 ሰውስ ዘመኑ እንደ ሣር ነው፤ እንደ ዱር አበባ እንዲሁ ያብባል፤ "},
	{16, "16 ነፋስ በነፈሰበት ጊዜ ያልፋልና፥ ስፍራውንም ደግሞ አያውቀውምና። "},
	{17, "17 የእግዚአብሔር ምሕረት ግን ከዘላለም እስከ ዘላለም በሚፈሩት ላይ፥ ጽድቁም በልጅ ልጆች ላይ ነው፤ "},
	{18, "18 ቃል ኪዳኑን በሚጠብቁ፥ ትእዛዙንም ያደርጉአት ዘንድ በሚያስቡ ላይ ነው። "},
	{19, "19 እግዚአብሔር ዙፋኑን በሰማይ አዘጋጀ፥ መንግሥቱም ሁሉን ትገዛለች። "},
	{20, "20 ቃሉን የምትፈጽሙ፥ ብርቱዎችና ኃያላን፥ የቃሉንም ድምፅ የምትሰሙ መላእክቱ ሁሉ፥ እግዚአብሔርን ባርኩ። "},
	{21, "21 ሠራዊቱ ሁሉ፥ ፈቃዱን የምታደርጉ አገልጋዮቹ፥ እግዚአብሔርን ባርኩ። "},
	{22, "22 ፍጥረቶቹ ሁሉ በግዛቱ ስፍራ ሁሉ፥ እግዚአብሔርን ባርኩ። ነፍሴ ሆይ፥ እግዚአብሔርን ባርኪ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view104() {
struct am104 poems[] = {
	{1, "1 የዳዊት መዝሙር።1 ነፍሴ ሆይ፥ እግዚአብሔርን ባርኪ፤ አቤቱ አምላኬ ሆይ፥ አንተ እጅግ ታላቅ ነህ፤ ክብርንና ግርማን ለበስህ። "},
	{2, "2 ብርሃንን እንደ ልብስ ለበስህ፤ ሰማይንም እንደ መጋረጃ ዘረጋህ፤ "},
	{3, "3 እልፍኙን በውኃ የሚሠራ፥ ሰረገላውን ደመና የሚያደርግ፥ በነፋስ ክንፍም የሚሄድ፥ "},
	{4, "4 መላእክቱን መንፈስ የሚያደርግ፥ አገልጋዮቹንም የእሳት ነበልባል። "},
	{5, "5 ለዘላለም እንዳትናወጥ ምድርን በመሠረትዋ ላይ መሠረታት። "},
	{6, "6 በጥልቅ እንደ ልብስ ከደንሃት፥ በተራሮችም ላይ ውኆች ይቆማሉ። "},
	{7, "7 ከዘለፋህም ይሸሻሉ፥ ከነጐድጓድህም ድምፅ ይደነግጣሉ፤ "},
	{8, "8 ወደ ተራሮች ይወጣሉ፥ ወደ ቈላዎች ወዳዘጋጀህላቸው ስፍራ ይወርዳሉ፤ "},
	{9, "9 እንዳያልፉትም ድንበር አደረግህላቸው ምድርን ይከድኑ ዘንድ እንዳይመለሱ። "},
	{10, "10 ምንጮችን ወደ ቈላዎች ይልካል፤ በተራሮች መካከል ውኆች ያልፋሉ፤ "},
	{11, "11 የዱር አራዊትን ሁሉ ያጠጣሉ፥ የበረሃ አህያዎችም ጥማታቸውን ይረካሉ። "},
	{12, "12 የሰማይም ወፎች በእነርሱ ዘንድ ያድራሉ፥ በድንጋዩ ስንጥቅ መካከልም ይጮኻሉ። "},
	{13, "13 ተራሮችን ከላይ የሚያጠጣቸው፤ ከሥራህ ፍሬ ምድር ትጠግባለች። "},
	{14, "14 እንጀራን ከምድር ያወጣ ዘንድ ለምለሙን ለሰው ልጆች ጥቅም፥ ሣርንም ለእንስሳ ያበቅላል። "},
	{15, "15 ወይን የሰውን ልብ ደስ ያሰኛል፥ ዘይትም ፊትን ያበራል፥ እህልም የሰውን ጕልበት ያጠነክራል። "},
	{16, "16 የእግዚአብሔር ዛፎች እርሱም የተከላቸው የሊባኖስ ዝግባዎች ይጠግባሉ። "},
	{17, "17 በዚያም ወፎች ይዋለዳሉ፥ የሽመላ ቤትም የእነርሱ ጎረቤት ነው። "},
	{18, "18 ረጃጅም ተራራዎች ለዋላዎች፥ ድንጋዮችም ለእሽኮኮች መሸሻ ናቸው። "},
	{19, "19 ጨረቃን ለጊዜዎች አደረገ፤ ፀሐይም መግቢያውን ያውቃል። "},
	{20, "20 ጨለማ ታደርጋለህ ሌሊትም ይሆናል፤ በእርሱም የዱር አራዊት ሁሉ ይወጡበታል። "},
	{21, "21 የአንበሳ ግልገሎች ለመንጠቅ ይጮኻሉ፥ ከእግዚአብሔርም ምግባቸውን ይሻሉ። "},
	{22, "22 ፀሐይ ስትወጣ ይሰበሰባሉ በየዋሻቸውም ይተኛሉ። "},
	{23, "23 ሰው ወደ ተግባሩ፥ እስኪመሽም ድረስ ወደ ሥራው ይወጣል። "},
	{24, "24 አቤቱ፥ ሥራህ እጅግ ብዙ ነው፤ ሁሉን በጥበብ አደረግህ፥ ምድርም ከፍጥረትህ ተሞላች። "},
	{25, "25 ይህች ባሕር ታላቅና ሰፊ ናት፤ በዚያ ስፍራ ቍጥር የሌለው ተንቀሳቃሽ፥ ታላላቆችና ታናናሾች እንስሶች አሉ። "},
	{26, "26 በዚያ ጊዜ መርከቦች ይሄዳሉ፥ በዚያም ላይ የፈጠርኸው ዘንዶ ይጫወትበታል። "},
	{27, "27 ምግባቸውን በየጊዜው ትሰጣቸው ዘንድ እነዚህ ሁሉ አንተን ተስፋ ያደርጋሉ። "},
	{28, "28 በሰጠሃቸውም ጊዜ ይሰበስባሉ፤ እጅህን ትከፍታለህ፥ ከመልካም ነገርም ይጠግባሉ። "},
	{29, "29 ፊትህን ስትሰውር ይደነግጣሉ፤ ነፍሳቸውን ታወጣለህ ይሞታሉም፥ ወደ አፈራቸውም ይመለሳሉ። "},
	{30, "30 መንፈስህን ትልካለህ ይፈጠራሉም፥ የምድርንም ፊት ታድሳለህ። "},
	{31, "31 የእግዚአብሔር ክብር ለዘላለም ይሁን፤ እግዚአብሔር በሥራው ደስ ይለዋል። "},
	{32, "32 ምድርን ያያል እንድትንቀጠቀጥም ያደርጋል፤ ተራሮችን ይዳስሳል ይጤሳሉም። "},
	{33, "33 በሕይወቴ ሳለሁ ለእግዚአብሔር እቀኛለሁ፥ ለአምላኬም በምኖርበት ዘመን ሁሉ እዘምራለሁ። "},
	{34, "34 ቃሌ ለእርሱ ይጣፍጠው፥ እኔም በእግዚአብሔር ደስ ይለኛል። "},
	{35, "35 ኅጥኣን ከምድር ይጥፉ፤ ዓመፀኞች እንግዲህ አይገኙ። ነፍሴ ሆይ፥ እግዚአብሔርን ባርኪ። ሃሌ ሉያ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view105() {
struct am105 poems[] = {
	{1, "1 ሃሌ ሉያ።1 እግዚአብሔርን አመስግኑ ስሙንም ጥሩ፥ ለአሕዛብም ሥራውን አውሩ። "},
	{2, "2 ተቀኙለት፥ ዘምሩለት፥ ተአምራቱንም ሁሉ ተናገሩ። "},
	{3, "3 በቅዱስ ስሙ ተጓደዱ፤ እግዚአብሔርን የሚፈልግ ልብ ደስ ይበለው። "},
	{4, "4 እግዚአብሔርን ፈልጉት ትጸናላችሁም፤ ሁልጊዜ ፊቱን ፈልጉ። "},
	{5, "5 -6 ባሪያዎቹ የአብርሃም ዘር፥ ለእርሱም የተመረጣችሁ የያዕቆብ ልጆች ሆይ፥ የሠራትን ድንቅ አስቡ፥ ተአምራቱን የአፉንም ፍርድ። "},
	{6, "7 እርሱ እግዚአብሔር አምላካችን ነው፤ ፍርዱ በምድር ሁሉ ነው። "},
	{7, "8 ቃል ኪዳኑን ለዘላለም፥ እስከ ሺህ ትውልድ ያዘዘውን ቃሉን አሰበ፥ "},
	{8, "9 ለአብርሃም ያደረገውን፥ ለይስሐቅም የማለውን፤ "},
	{9, "10 ለያዕቆብ ሥርዓት እንዲሆን ለእስራኤልም የዘላለም ኪዳን እንዲሆን አጸና። "},
	{10, "11 እንዲህም አለ። ለአንተ የከነዓንን ምድር የርስታችሁን ገመድ እሰጣለሁ፤ "},
	{11, "12 ይህም የሆነው እነርሱ በቍጥር ጥቂቶች ሰዎች፥ እጅግ ጥቂቶችና ስደተኞች ሲሆኑ ነው። "},
	{12, "13 ከሕዝብ ወደ ሕዝብ፥ ከመንግሥታትም ወደ ሌላ ሕዝብ አለፉ። "},
	{13, "15 የቀባኋቸውን አትዳስሱ፥ በነቢያቴም ክፉ አታድርጉ ብሎ፥ ሰው ግፍ ያደርግባቸው ዘንድ አልፈቀደም፥ ስለ እነርሱም ነገሥታትን ገሠጸ። "},
	{14, "16 በምድር ላይ ራብን ጠራ፥ የእህልን ኃይል ሁሉ ሰበረ። "},
	{15, "17 በፊታቸው ሰውን ላከ፤ ዮሴፍ ለባርነት ተሸጠ። "},
	{16, "18 እግሮቹም በእግር ብረት ደከሙ፥ እርሱም በብረት ውስጥ ገባ። "},
	{17, "19 ቃሉ እስኪመጣለት ድረስ፥ የእግዚአብሔር ቃል ፈተነው። "},
	{18, "20 ንጉሥ ላከ ፈታውም፥ የአሕዛብም አለቃ አስፈታው። "},
	{19, "21 የቤቱ ጌታ፥ የጥሪቱ ሁሉ ገዢ አደረገው፥ "},
	{20, "22 አለቆቹን እንደ ፈቃዱ ይገሥጽ ዘንድ፥ ሽማግሌዎቹንም ጥበበኞች ያደርጋቸው ዘንድ። "},
	{21, "23 እስራኤልም ወደ ግብጽ ገባ፥ ያዕቆብም በካም አገር ተቀመጠ። "},
	{22, "24 ሕዝቡንም እጅግ አበዛ፥ ከጠላቶቻቸውም ይልቅ አበረታቸው። "},
	{23, "25 ሕዝቡን ይጠሉ ዘንድ በባሪያዎቹም ላይ ይተነኰሉ ዘንድ ልባቸውን ለወጠ። "},
	{24, "26 ባሪያውን ሙሴን የመረጠውንም አሮንን ላከ። "},
	{25, "27 የተኣምራቱን ነገር በላያቸው ድንቁንም በካም አገር አደረገ። "},
	{26, "28 ጨለማን ላከ ጨለመባቸውም፤ በቃሉም ዐመፁ። "},
	{27, "29 ውኃቸውን ወደ ደም ለወጠ፥ ዓሦቻቸውንም ገደለ። "},
	{28, "30 ምድራቸው የንጉሦቻቸውም ቤቶች በጓጕንቸር ሞሉ። "},
	{29, "31 ተናገረ፥ የውሻ ዝንብ ትንኝም በዳርቻቸው መጡ። "},
	{30, "32 ዝናባቸውን በረዶ አደረገው፥ እሳትም በምድራቸው ተቃጠለች። "},
	{31, "33 ወይናቸውንና በለሳቸውን መታ፥ የአገራቸውንም ዛፍ ሁሉ ሰበረ። "},
	{32, "34 ተናገረ፥ አንበጣም ስፍር ቍጥር የሌለውም ኩብኩባ መጣ፥ "},
	{33, "35 የአገራቸውንም ለምለም ሁሉ በላ፥ የምድራቸውንም ፍሬ በላ። "},
	{34, "36 የአገራቸውንም በኵር ሁሉ፥ የጕልበታቸውን መጀመሪያ ሁሉ መታ። "},
	{35, "37 ከወርቅና ከብርም ጋር አወጣቸው፥ በወገናቸውም ውስጥ ደዌ አልነበረም። "},
	{36, "38 ፈርተዋቸው ነበርና ግብጽ በመውጣታቸው ደስ አላት። "},
	{37, "39 ደመናን ለመሸፈኛ ዘረጋባቸው፥ እሳትንም በሌሊት ያበራላቸው ዘንድ ዘረጋ። "},
	{38, "40 ለመኑ፥ ድርጭትንም አመጣላቸው፥ የሰማይንም እንጀራ አጠገባቸው። "},
	{39, "41 ዓለቱን ሰነጠቀ፥ ውኃውም ፈሰሰ፤ ወንዞች በበረሃ ሄዱ፤ "},
	{40, "42 ለባሪያው ለአብርሃም የነገረውን ቅዱስ ቃሉን አስቦአልና። "},
	{41, "43 ሕዝቡንም በደስታ የተመረጡትንም በእልልታ አወጣ። "},
	{42, "44 የአሕዛብንም አገሮች ሰጣቸው፥ የወገኖችንም ድካም ወረሱ፥ "},
	{43, "45 ሕጉን ይጠብቁ ዘንድ፥ ሥርዓቱንም ይፈልጉ ዘንድ። ሃሌ ሉያ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view106() {
struct am106 poems[] = {
	{1, "1 ሃሌ ሉያ፤ ቸር ነውና፥ ምህረቱም ለዘላለም ነውና እግዚአብሔርን አመስግኑ። "},
	{2, "2 የእግዚአብሔርን ኃይል ሥራ ማን ይናገራል? ምስጋናውንስ ሁሉ ማን ያሰማል? "},
	{3, "3 ፍርድን የሚጠብቁ፥ ጽድቅንም ሁልጊዜ የሚያደርጉ ምስጉኖች ናቸው። "},
	{4, "4 አቤቱ፥ በሕዝብህ ሞገስ አስበን፥ በመድኃኒትህም ጐብኘን፤ "},
	{5, "5 የመረጥሃቸውን በጎነት እናይ ዘንድ፥ በሕዝብህም ደስታ ደስ ይለን ዘንድ፥ ከርስትህም ጋር እንጓደድ ዘንድ። "},
	{6, "6 ከአባቶቻችን ጋር ኃጢአትን ሠራን፥ ዐመፅንም፥ በደልንም። "},
	{7, "7 አባቶቻችን በግብጽ ሳሉ ተኣምራትህን አላስተዋሉም፥ የምሕረትህንም ብዛት አላሰቡም፤ በኤርትራ ባሕር ባለፉ ጊዜ ዐመፁብህ። "},
	{8, "8 ኃይሉን ግን ለማስታወቅ። ስለ ስሙ አዳናቸው። "},
	{9, "9 የኤርትራንም ባሕር ገሠጸ እርሱም ደረቀ፤ እንደ ምድረ በዳ በጥልቅ መራቸው። "},
	{10, "10 ከሚጠሉአቸውም እጅ አዳናቸው፥ ከጠላትም እጅ ተቤዣቸው። "},
	{11, "11 ያሳደዱአቸውንም ውኃ ደፈናቸው፥ ከእነርሱም አንድ አልቀረም። "},
	{12, "12 በዚያን ጊዜ በቃሉ አመኑ፥ ምስጋናውንም ዘመሩ። "},
	{13, "13 ፈጥነውም ሥራውን ረሱ፥ በምክሩም አልታገሡም። "},
	{14, "14 በምድረ በዳም ምኞትን ተመኙ፥ በበረሃም እግዚአብሔርን ተፈታተኑት። "},
	{15, "15 የለመኑትንም ሰጣቸው፤ ለነፍሳቸው ግን ክሳትን ላከ። "},
	{16, "16 ሙሴንም እግዚአብሔር የቀደሰውንም አሮንን በሰፈር ተመቀኙአቸው። "},
	{17, "17 ምድርም ተከፈተች ዳታንንም ዋጠችው፥ የአቤሮንንም ወገን ደፈነች፤ "},
	{18, "18 በማኅበራቸውም እሳት ነደደች፥ ነበልባልም ኅጥኣንን አቃጠላቸው። "},
	{19, "19 በኮሬብም ጥጃን ሠሩ፥ ቀልጦ ለተሠራ ምስልም ሰገዱ። "},
	{20, "20 ሣርም በሚበላ በበሬ ምሳሌ ክብራቸውን ለወጡ። "},
	{21, "22 ታላቅ ነገርንም በግብጽ፥ ድንቅንም በካራን ምድር፥ ግሩም ነገርንም በኤርትራ ባሕር ያደረገውን ያዳናቸውንም እግዚአብሔርን ረሱ። "},
	{22, "23 እንዳያጠፋቸው ቍጣውን ይመልስ ዘንድ የተመረጠው ሙሴ በመቅሠፍት ጊዜ በፊቱ ባይቆም ኖሮ፥ ያጠፋቸው ዘንድ ተናገረ። "},
	{23, "24 የተወደደችውን ምድር ናቁ፥ በቃሉም አልታመኑም፥ "},
	{24, "25 በድንኳኖቻቸውም ውስጥ አንጐራጐሩ፤ የእግዚአብሔርን ቃል አልሰሙም። "},
	{25, "27 በምድረ በዳም ይጥላቸው ዘንድ፥ ዘራቸውንም በአሕዛብ መካከል ይጥል ዘንድ፥ በየአገሩም ይበትናቸው ዘንድ፥ እጁን አነሣባቸው። "},
	{26, "28 በብዔል ፌጎርም ተባበሩበት፥ የሙታንንም መሥዋዕት በሉ። "},
	{27, "29 በሥራቸውም አስመረሩት፥ ቸነፈርም በላያቸው በዛ። "},
	{28, "30 ፊንሐስም ተነሥቶ ፈረደባቸው፥ ቸነፈሩም ተወ፤ "},
	{29, "31 ያም እስከ ዘላለም ለልጅ ልጅ ጽድቅ ሆኖ ተቈጠረለት። "},
	{30, "33 በክርክር ውኃ ዘንድም አስቈጡት፥ መንፈሱን አስመርረዋታልና፤ ስለ እነርሱም ሙሴ ተበሳጨ፤ በከንፈሮቹም በስንፍና ተናገረ። "},
	{31, "34 እግዚአብሔርም እንዳላቸው አሕዛብን አላጠፉም፤ "},
	{32, "35 ከአሕዛብም ጋር ተደባለቁ፥ ሥራቸውንም ተማሩ። "},
	{33, "36 ለጣዖቶቻቸውም ተገዙ፥ ወጥመድም ሆኑባቸው። "},
	{34, "37 ወንዶች ልጆቻቸውንና ሴቶች ልጆቻቸውን ለአጋንንት ሠው፤ "},
	{35, "38 የወንዶች ልጆቻቸውንና የሴቶች ልጆቻቸን ደም፥ ለከነዓን ጣዖቶች የሠውአቸውን ንጹሕ ደም አፈሰሱ፥ ምድርም በደም ረከሰች። "},
	{36, "39 በሥራቸው ረከሱ፥ በማድረጋቸውም አመነዘሩ። "},
	{37, "40 የእግዚአብሔርም ቍጣ በሕዝቡ ላይ ነደደ፥ ርስቱንም ተጸየፈ። "},
	{38, "41 ወደ አሕዛብም እጅ አሳለፋቸው፥ የሚጠሉአቸውም ገዙአቸው። "},
	{39, "42 ጠላቶቻቸውም ግፍ አደረጉባቸው፥ ከእጃቸውም በታች ተዋረዱ። "},
	{40, "43 ብዙ ጊዜ አዳናቸው፤ ነገር ግን በምክራቸው አስመረሩት፥ በኃጢአታቸውም ተዋረዱ። "},
	{41, "44 እርሱ ግን ጩኸታቸውን በሰማ ጊዜ ጭንቃቸውን ተመለከተ፤ "},
	{42, "45 ለእነርሱም ኪዳኑን አሰበ፥ እንደ ምሕረቱም ብዛት ተጸጸተ። "},
	{43, "46 በማረኩአቸውም ሁሉ ፊት ሞገስን ሰጣቸው። "},
	{44, "47 አምላካችን እግዚአብሔር ሆይ፥ አድነን፤ ቅዱስ ስምህን እናመሰግን ዘንድ፥ በምስጋናህም እንመካ ዘንድ፥ ከአሕዛብ መካከል ሰብስበን። "},
	{45, "48 ከዘላለም እስከ ዘላለም የእስራኤል አምላክ እግዚአብሔር ይባረክ ሕዝብም ሁሉ አሜን ይበል። ሃሌ ሉያ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view107() {
struct am107 poems[] = {
	{1, "1 ሃሌ ሉያ።1 ቸር ነውና፥ ምሕረቱ ለዘላለም ነውና እግዚአብሔርን አመስግኑ፤ "},
	{2, "2 እግዚአብሔር ያዳናቸው፥ ከጠላቶች እጅ ያዳናቸው ይናገሩ። "},
	{3, "3 ከምሥራቅና ከምዕራብ፥ ከሰሜንና ከባሕር፥ ከየአገሩ ሰበሰባቸው። "},
	{4, "4 ውኃ በሌለበት ምድረ በዳ ተቅበዘበዙ፤ የሚኖሩበትንም ከተማ መንገድ አላገኙም። "},
	{5, "5 ተራቡ ተጠሙም፥ ነፍሳቸውም በውስጣቸው አለቀች። "},
	{6, "6 በተጨነቁ ጊዜ ወደ እግዚአብሔር ጮኹ፥ ከመከራቸውም አዳናቸው፤ "},
	{7, "7 ወደሚኖሩበት ከተማ ይሄዱ ዘንድ የቀና መንገድን መራቸው። "},
	{8, "8 ለሰው ልጆች ስላደረገው ተኣምራት ስለ ምሕረቱም እግዚአብሔርን ያመስግኑ፤ "},
	{9, "9 የተራበችን ነፍስ አጥግቦአልና፥ የተራቈተችንም ነፍስ በበረከት ሞልቶአልና። "},
	{10, "10 በጨለማ በሞትም ጥላ የተቀመጡ፥ በችግር በብረትም የታሰሩ፤ "},
	{11, "11 የእግዚአብሔርን ቃል ስለ ዐመፁ፥ የልዑልንም ምክር ስለ ናቁ፥ "},
	{12, "12 ልባቸው በድካም ተዋረደ፤ ታመሙ የሚረዳቸውም አጡ። "},
	{13, "13 በተጨነቁ ጊዜ ወደ እግዚአብሔር ጮኹ፥ በመከራቸውም አዳናቸው። "},
	{14, "14 ከጨለማና ከሞት ጥላ አወጣቸው፥ እስራታቸውንም ሰበረ። "},
	{15, "15 ለሰው ልጆች ስላደረገው ተኣምራት ስለ ምሕረቱም እግዚአብሔርን ያመስግኑ፤ "},
	{16, "16 የናሱን ደዶች ሰብሮአልና፥ የብረቱንም መወርወሪያ ቈርጦአልና። "},
	{17, "17 ስለ ዓመፃቸው ሰነፉ፥ ስለ ኃጢአታቸውም ተቸገሩ። "},
	{18, "18 ሰውነታቸው መብልን ሁሉ ተጸየፈች፥ ወደ ሞትም ደጆች ቀረቡ። "},
	{19, "19 በተጨነቁ ጊዜም ወደ እግዚአብሔር ጮኹ፥ ከመከራቸውም አዳናቸው። "},
	{20, "20 ቃሉን ላከ ፈወሳቸውም፥ ከጥፋታቸውም አዳናቸው። "},
	{21, "21 ለሰው ልጆች ስላደረገው ተኣምራት ስለ ምሕረቱም እግዚአብሔርን ያመሰግኑ፤ "},
	{22, "22 የምስጋና መሥዋዕትንም ይሠውለት፥ በእልልታም ሥራውን ይንገሩ። "},
	{23, "23 በመርከቦች ወደ ባሕር የሚወርዱ፥ በታላቅ ውኃ ሥራቸውን የሚሠሩ፥ "},
	{24, "24 እነርሱ የእግዚአብሔርን ሥራ፥ በጥልቅም ያለችውን ድንቁን አዩ። "},
	{25, "25 ተናገረ፥ ዐውሎ ነፋስም ተነሣ፥ ሞገድም ከፍ ከፍ አለ። "},
	{26, "26 ወደ ሰማይ ይወጣሉ ወደ ጥልቅም ይወርዳሉ፤ ነፍሳቸውም በመከራ ቀለጠች። "},
	{27, "27 ደነገጡ እንደ ስካርም ተንገደገዱ፥ ጥበባቸውም ሁሉ ተዋጠች። "},
	{28, "28 በተጨነቁ ጊዜ ወደ እግዚአብሔር ጮኹ፥ ከመከራቸውም አዳናቸው። "},
	{29, "29 ዐውሎንም ጸጥ አደረገ፥ ሞገዱም ዝም አለ። "},
	{30, "30 ዝም ብሎአልና ደስ አላቸው፤ ወደ ፈለጉትም ወደብ መራቸው። "},
	{31, "31 ለሰው ልጆች ስላደረገው ተአምራት ስለ ምሕረቱም እግዚአብሔርን ያመስግኑ። "},
	{32, "32 በአሕዛብ ጉባኤ ከፍ ከፍ ያድርጉት፥ በሽማግሌዎችም ሸንጎ ያመስግኑት። "},
	{33, "33 ወንዞችን ምድረ በዳ፥ የውኃውንም ምንጮች ደረቅ አደረጋቸው፤ "},
	{34, "34 ከተቀመጡባት ክፋት የተነሣ ፍሬያማዋን ምድር ጨው አደረጋት። "},
	{35, "35 ምድረ በዳን ለውኃ መቆሚያ፥ ደረቁንም ምድር የውኃ ምንጮች አደረገ። "},
	{36, "36 በዚያም ራብተኞችን አስቀመጠ፥ የሚኖርባትንም ከተማ ሠሩ። "},
	{37, "37 እርሻዎችንም ዘሩ ወይኖችንም ተከሉ፥ የእህልንም ሰብል አደረጉ። "},
	{38, "38 ባረካቸውም እጅግም በዙ፤ እንስሶቻቸውንም አላሳነሰባቸውም። "},
	{39, "39 እነርሱ በችግር በክፋት በጭንቀት ተዋረዱ እያነሱም ሄዱ፤ "},
	{40, "40 በአለቶችም ላይ ኅሣርን፥ አፈሰሰ፥ መንገድም በሌለበት በምድረ በዳ አሳታቸው። "},
	{41, "41 ችግረኛንም ከችግሩ ረዳው፤ እንደ በጎች መንጋ ወገን አደረገው። "},
	{42, "42 ቅኖች ያያሉ፥ ደስም ይላቸዋል፤ ኃጢአትም ሁሉ አፍዋን ትዘጋለች። "},
	{43, "43 ጥበበኛ የሆነና ይህን የሚጠብቅ ማን ነው? እርሱ የእግዚአብሔርን ምሕረት ያስተውላል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view108() {
struct am108 poems[] = {
	{1, "1 የዳዊት የምስጋና መዝሙር።1 ልቤ ጽኑ ነው፥ አቤቱ፥ ልቤ ጽኑ ነው፤ እቀኛለሁ በክብሬም እዘምራለሁ። "},
	{2, "2 በገና ሆይ፥ ተነሥ፥ መሰንቆም፤ እኔም ማልጄ እነሣለሁ። "},
	{3, "3 አቤቱ፥ በአሕዛብ መካከል አመሰግንሃለሁ፥ በወገኖችም መካከል እዘምርልሃለሁ፤ "},
	{4, "4 ምሕረትህ በሰማይ ላይ ታላቅ ናትና፥ እውነትህም እስከ ደመናት ድረስ ነውና። "},
	{5, "5 አቤቱ፥ በሰማያት ላይ ከፍ ከፍ በል፥ ክብርህም በምድር ሁሉ ላይ ትሁን። "},
	{6, "6 ወዳጆችህ ይድኑ ዘንድ፤ በቀኝህ አድን አድምጠኝም። "},
	{7, "7 እግዚአብሔር በቅድስናው ተናገረ። ደስ ይለኛል፥ ሴኬምንም እካፈላለሁ፥ የሱኮትንም ሸለቆ እሰፍራለሁ። "},
	{8, "8 ገለዓድ የእኔ ነው ምናሴም የእኔ ነው፤ ኤፍሬም የራሴ መጠጊያ ነው። ይሁዳ ንጉሤ ነው። "},
	{9, "9 ሞዓብ መታጠቢያዬ ነው፥ በኤዶምያስ ላይም ጫማዬን እዘረጋለሁ፤ ፍልስጥኤም ይገዙልኛል። "},
	{10, "10 ወደ ጽኑ ከተማ ማን ይወስደኛል? ማንስ እስከ ኤዶምያስ ይመራኛል? "},
	{11, "11 አቤቱ፥ የጣልኸኝ አንተ አይደለህምን? አምላክ ሆይ፥ ከሠራዊታችን ጋር አትወጣም። "},
	{12, "12 በመከራችን ረድኤትን ስጠን፤ የሰውም ማዳን ከንቱ ነው። "},
	{13, "13 በእግዚአብሔር ኃይልን እናደርጋለን፤ እርሱም የሚያስጨንቁንን ያዋርዳቸዋል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view109() {
struct am109 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የዳዊት መዝሙር።1 አምላክ ሆይ፥ ምሥጋናዬን ዝም አትበል፥ "},
	{2, "2 የኃጢአተኛ አፍና የተንኰለኛ አፍ በላዬ ተላቅቀውብኛልና፤ በሽንገላ አንደበትም በላዬ ተናገሩ፤ "},
	{3, "3 በጥል ቃል ከበቡኝ፥ በከንቱም ተሰለፉብኝ። "},
	{4, "4 በወደድኋቸው ፋንታ አጣሉኝ፥ እኔ ግን እጸልያለሁ። "},
	{5, "5 በመልካም ፋንታ ክፉን በወደድኋቸውም ፋንታ ጠላትነትን መለሱልኝ። "},
	{6, "6 በላዩ ኃጢአተኛን ሹም፤ ሰይጣንም በቀኙ ይቁም። "},
	{7, "7 በተምዋገተም ጊዜ ተረትቶ ይውጣ፤ ጸሎቱም ኃጢአት ትሁንበት። "},
	{8, "8 ዘመኖቹም ጥቂት ይሁኑ፤ ሹመቱንም ሌላ ይውሰድ። "},
	{9, "9 ልጆቹም ድሀ አደግ ይሁኑ፥ ሚስቱም መበለት ትሁን። "},
	{10, "10 ልጆቹም ተናውጠው ይቅበዝበዙ ይለምኑም፥ ከስፍራቸውም ይባረሩ። "},
	{11, "11 ባለዕዳም ያለውን ሁሉ ይበርብረው፥ እንግዶችም ድካሙን ሁሉ ይበዝብዙት። "},
	{12, "12 የሚያግዘውንም አያግኝ። ለድሀ አደግ ልጆቹም የሚራራ አይኑር። "},
	{13, "13 ልጆቹ ይጥፉ፤ በአንድ ትውልድ ስሙ ይደምሰስ። "},
	{14, "14 የአባቶቹ ኃጢአት በእግዚአብሔር ፊት ትታሰብ፤ የእናቱም ኃጢአት አትደምሰስ። "},
	{15, "15 በእግዚአብሔር ፊት ሁልጊዜ ይኑሩ፤ መታሰቢያቸው ከምድር ይጥፋ። "},
	{16, "16 ምሕረትን ያደርግ ዘንድ አላሰበምና ችግረኛንና ምስኪንን ልቡ የተሰበረውንም ሰው ይገድል ዘንድ አሳደደ። "},
	{17, "17 መርገምን ወደደ ወደ እርሱም መጣች፤ በረከትንም አልመረጠም ከእርሱም ራቀች። "},
	{18, "18 መርገምን እንደ ልብስ ለበሳት፥ እንደ ውኃም ወደ አንጀቱ፥ እንደ ቅባትም ወደ አጥንቱ ገባች። "},
	{19, "19 እንደሚለብሰው ልብስ። ሁልጊዜም እንደሚታጠቀው ትጥቅ ይሁነው። "},
	{20, "20 ይህ ሥራ ከእግዚአብሔር ዘንድ በሚያጣሉኝ በነፍሴም ላይ ክፉን በሚናገሩ ነው። "},
	{21, "21 አንተ ግን አቤቱ ጌታዬ፥ ስለ ስምህ ምሕረትህን በእኔ ላይ አድርግ፤ ምሕረትህ መልካም ናትና አድነኝ። "},
	{22, "22 እኔ ችግረኛ ምስኪንም ነኝና፥ ልቤም በውስጤ ደነገጠብኝ። "},
	{23, "23 እንዳለፈ ጥላ አለቅሁ፥ እንደ አንበጣም እረገፍሁ። "},
	{24, "24 ጕልበቶቼ በጾም ደከሙ፤ ሥጋዬም ቅቤ በማጣት ከሳ። "},
	{25, "25 እኔም በእነርሱ ዘንድ ለነውር ሆንሁ፤ ባዩኝ ጊዜ ራሳቸውን ነቀነቁ። "},
	{26, "26 አቤቱ አምላኬ፥ እርዳኝ፥ እንደ ምሕረትህም አድነኝ። "},
	{27, "27 አቤቱ፥ እጅህ ይህች እንደ ሆነች፥ አንተም ይህችን እንዳደረግህ ይወቁ። "},
	{28, "28 እነርሱ ይራገማሉ አንተ ግን ባርክ፤ በእኔ ላይ የሚነሡ ይፈሩ፥ ባሪያህ ግን ደስ ይበለው። "},
	{29, "29 የሚያጣሉኝ እፍረትን ይልበሱ፤ እፍረታቸውን እንደ መጐናጸፊያ ይልበሱአት። "},
	{30, "30 እግዚአብሔርን በአፌ እጅግ አመሰግነዋለሁ። በብዙዎችም መካከል አከብረዋለሁ፤ "},
	{31, "31 ነፍሱን ከሚያሳድዱአት ያድን ዘንድ በድሀ ቀኝ ቆሞአልና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view110() {
struct am110 poems[] = {
	{1, "1 የዳዊት መዝሙር።1 እግዚአብሔር ጌታዬን። ጠላቶችህን ለእግርህ መቀመጫ እስካደርግልህ ድረስ በቀኜ ተቀመጥ አለው። "},
	{2, "2 እግዚአብሔር የኃይልን በትር ከጽዮን ይልክልሃል፤ በጠላቶችህም መካከል ግዛ። "},
	{3, "3 ከአንተ ጋር ቀድሞ በኃይልህ ቀን፥ በቅዱሳን ብርሃን፥ ከአጥቢያ ኮከብ አስቀድሞ ከሆድ ወለድሁህ። "},
	{4, "4 እንደ መልከ ጼዴቅ ሥርዓት አንተ ለዘላለም ካህን ነህ ብሎ፥ እግዚአብሔር ማለ አይጸጸትም። "},
	{5, "5 እግዚአብሔር በቀኝህ ነገሥታትን በቍጣው ቀን ይቀጠቅጣቸዋል። "},
	{6, "6 በአሕዛብ መካከል ይፈርዳል፥ ሬሳዎችንም ያበዛል፤ በሰፊ ምድር ላይ ራሶችን ይቀጠቅጣል። "},
	{7, "7 በመንገድ ከፈሳሽ ውኃ ይጠጣል፤ ስለዚህ ራስ ከፍ ከፍ ይላል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view111() {
struct am111 poems[] = {
	{1, "1 ሃሌ ሉያ። አቤቱ፥ በቅኖች ሸንጎ በጉባኤም በፍጹም ልቤ አመሰግንሃለሁ። "},
	{2, "2 የእግዚአብሔር ሥራ ታላቅ ናት፥ ደስ በሚሰኙባት ሁሉ ዘንድ የተፈለገች ናት። "},
	{3, "3 ሥራው ምስጋናና ግርማ ነው፤ ጽድቁም ለዘላለም ይኖራል። "},
	{4, "4 ለተአምራቱ መታሰቢያን አደረገ፤ እግዚአብሔር መሓሪና ይቅር ባይ ነው። "},
	{5, "5 ለሚፈሩት ምግብን ሰጣቸው፤ ኪዳኑንም ለዘላለም ያስባል። "},
	{6, "6 የአሕዛብን ርስት ይሰጣቸው ዘንድ ለሕዝቡ የሥራውን ብርታት አሳየ። "},
	{7, "7 የእጆቹ ሥራ እውነትና ፍርድ ነው፤ ትእዛዙም ሁሉ የታመነ ነው፥ "},
	{8, "8 ለዘላለምም የጸና ነው፥ በእውነትና በቅንም የተሠራ ነው። "},
	{9, "9 መድኃኒትንም ለሕዝቡ ሰደደ፥ ኪዳኑንም ለዘላለም አዘዘ፤ ስሙ የተቀደሰና የተፈራ ነው። "},
	{10, "10 የጥበብ መጀመሪያ እግዚአብሔርን መፍራት ነው፥ ለሚያደርጓትም ሁሉ ደኅና ማስተዋል አላቸው፤ ምስጋናውም ለዘላለም ይኖራል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view112() {
struct am112 poems[] = {
	{1, "1 ሃሌ ሉያ። እግዚአብሔርን የሚፈራ፥ ትእዛዙንም እጅግ የሚወድድ ሰው ምስጉን ነው። "},
	{2, "2 ዘሩ በምድር ላይ ኃያል ይሆናል፤ የቅኖች ትውልድ ትባረካለች። "},
	{3, "3 ክብርና ባለጠግነት በቤቱ ነው፥ ጽድቁም ለዘላለም ይኖራል። "},
	{4, "4 ለቅኖች ብርሃን በጨለማ ወጣ፤ መሓሪና ይቅር ባይ ጻድቅም ነው። "},
	{5, "5 ቸር ሰው ይራራል ያበድራልም፥ በፍርድም ነገሩን ይፈጽማል። "},
	{6, "6 ለዘላለም አይናወጥም፤ የጻድቅ መታሰቢያ ለዘላለም ይኖራል። "},
	{7, "7 ከክፉ ነገር አይፈራም፤ በእግዚአብሔር ለመታመን ልቡ የጸና ነው። "},
	{8, "8 በጠላቶቹ ላይ እስኪያይ ድረስ ልቡ ጽኑ ነው፥ አይፈራም። "},
	{9, "9 በተነ ለችግረኞችም ሰጠ፤ ጽድቁ ለዘላለም ዓለም ይኖራል፤ ቀንዱ በክብር ከፍ ከፍ ይላል። "},
	{10, "10 ኃጢአተኛም አይቶ ይቈጣል፥ ጥርሱንም ያፋጫል፥ ይቀልጣልም፤ የኃጢአተኞችም ምኞት ትጠፋለች። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view113() {
struct am113 poems[] = {
	{1, "1 ሃሌ ሉያ። የእግዚአብሔር ባሪያዎች ሆይ፥ አመስግኑት፥ የእግዚአብሔርንም ስም አመስግኑ። "},
	{2, "2 ከዛሬ ጀምሮ እስከ ዘላለም ድረስ የእግዚአብሔር ስም ቡሩክ ይሁን። "},
	{3, "3 ከፀሐይ መውጫ ጀምሮ እስከ መግቢያው ድረስ የእግዚአብሔር ስም ይመስገን። "},
	{4, "4 እግዚአብሔር በአሕዛብ ሁሉ ላይ ከፍተኛ ነው፥ ክብሩም ከሰማያት በላይ ነው። "},
	{5, "5 እንደ አምላካችን እንደ እግዚአብሔር ማን ነው? በላይ የሚኖር፤ "},
	{6, "6 በሰማይና በምድር የተዋረዱትን የሚያይ፤ "},
	{7, "7 -8 ከአለቆች ጋር ከሕዝቡም አለቆች ጋር ያኖረው ዘንድ ችግረኛን ከመሬት የሚያነሣ፥ ምስኪኑንም ከፋንድያ ከፍ ከፍ የሚያደርግ፤ "},
	{8, "9 መካኒቱን በቤት የሚያኖራት፥ ደስ የተሰኘችም የልጆች እናት የሚያደርጋት። ሃሌ ሉያ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view114() {
struct am114 poems[] = {
	{1, "1 ሃሌ ሉያ።1 እስራኤል ከግብጽ፥ የያዕቆብም ቤት ከእንግዳ ሕዝብ በወጣ ጊዜ፥ "},
	{2, "2 ይሁዳ መቅደሱ፥ እስራኤልም ግዛቱ ሆነ። "},
	{3, "3 ባሕር አየች ሸሸችም፥ ዮርዳኖስም ወደ ኋላው ተመለሰ። "},
	{4, "4 ተራሮች እንደ ኮርማዎች፥ ኮረብቶችም እንደ ጠቦቶች ዘለሉ። "},
	{5, "5 አንቺ ባሕር የሸሸሽ፥ አንቺም ዮርዳኖስ ወደ ኋላሽ የተመለስሽ፥ምን ሆናችኋል? "},
	{6, "6 እናንተም ተራሮች፥ እንደ ኮርማዎች፥ ኮረብቶችስ፥ እንደ ጠቦቶች ለምን ዘለላችሁ? "},
	{7, "7 ከያዕቆብ አምላክ ፊት፥ ከጌታ ፊት ምድር ተናወጠች፤ "},
	{8, "8 ድንጋዩን ወደ ውኃ መቆሚያ፥ ጭንጫውንም ወደ ውኃ ምንጭ ከለወጠ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view115() {
struct am115 poems[] = {
	{1, "1 ለእኛ አይደለም፥ አቤቱ፥ ለእኛ አይደለም፥ ነገር ግን ለስምህ ስለ ምሕረትህ ስለ እውነትህም ምስጋናን ስጥ። "},
	{2, "2 አሕዛብ። አምላካቸው ወዴት ነው? አይበሉ። "},
	{3, "3 አምላካችንስ በላይ በሰማይ ነው፤ በሰማይም በምድርም የፈቀደውን ሁሉ አደረገ። "},
	{4, "4 የአሕዛብ ጣዖታቶች የወርቅና የብር፥ የሰው እጅ ሥራ ናቸው። "},
	{5, "5 አፍ አላቸው አይናገሩምም፤ ዓይን አላቸው አያዩምም፤ "},
	{6, "6 ጆሮ አላቸው አይሰሙምም፤ አፍንጫ አላቸው አያሸትቱምም፤ "},
	{7, "7 እጅ አላቸው አይዳሰሱምም፤ እግር አላቸው አይሄዱምም፤ በጕሮሮአቸውም አይናገሩም። "},
	{8, "8 የሚሠሩአቸውም የሚያምኑባቸውም ሁሉ እንደ እነርሱ ይሁኑ። "},
	{9, "9 የእስራኤል ቤት ሆይ፥ በእግዚአብሔር ታመኑ፤ ረድኤታቸውና መታመኛቸው እርሱ ነው። "},
	{10, "10 የአሮን ቤት ሆይ፥ በእግዚአብሔር ታመኑ ረድኤታቸውና መታመኛቸው እርሱ ነው። "},
	{11, "11 እግዚአብሔርን የምትፈሩ ሆይ፥ በእግዚአብሔር ታመኑ፤ ረድኤታቸውና መታመኛቸው እርሱ ነው። "},
	{12, "12 እግዚአብሔር አሰበን ይባርከንማል፤ የእስራኤልን ቤት ይባረካል፥ የአሮንንም ቤት ይባረካል። "},
	{13, "13 እግዚአብሔርን የሚፈሩትን፥ ትንንሾችንና ትልልቆችን ይባርካል። "},
	{14, "14 እግዚአብሔር በላያችሁ፥ በላያችሁና በልጆቻችሁ ላይ ይጨምር። "},
	{15, "15 እናንተ ሰማይንና ምድርን ለሠራ ለእግዚአብሔር የተባረካችሁ ናችሁ። "},
	{16, "16 የሰማያት ሰማይ ለእግዚአብሔር ነው፤ ምድርን ግን ለሰው ልጆች ሰጣት። "},
	{17, "17 አቤቱ፥ ሙታን የሚያመሰግኑህ አይደሉም ወደ ሲኦልም የሚወርዱ ሁሉ፤ "},
	{18, "18 እኛ ሕያዋን ግን ከዛሬ ጀምሮ እስከ ዘላለም እግዚአብሔርን እንባርካለን። ሃሌ ሉያ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view116() {
struct am116 poems[] = {
	{1, "1 ሃሌ ሉያ።1 እግዚአብሔር የልመናዬን ድምፅ ሰምቶአልና ወደድሁት። "},
	{2, "2 ጆሮውን ወደ እኔ አዘንብሎአልና በዘመኔ ሁሉ እጠራዋለሁ። "},
	{3, "3 የሞት ጣር ያዘኝ፥ የሲኦልም ሕማም አገኘኝ፤ ጭንቀትንና መከራን አገኘሁ። "},
	{4, "4 የእግዚአብሔርንም ስም ጠራሁ። አቤቱ፥ ነፍሴን አድናት። "},
	{5, "5 እግዚአብሔር መሓሪና ጻድቅ ነው፥ አምላካችንም ይቅር ባይ ነው። "},
	{6, "6 እግዚአብሔር ሕፃናትን ይጠብቃል፤ ተቸገርሁ እርሱም አዳነኝ። "},
	{7, "7 ነፍሴ ሆይ፥ ወደ ዕረፍትሽ ተመለሺ፥ እግዚአብሔር መልካም አድርጎልሻልና፤ "},
	{8, "8 ነፍሴን ከሞት፥ ዓይኔንም ከእንባ፥ እግሬንም ከመሰናከል አድኖአልና። "},
	{9, "9 በሕያዋን አገር በእግዚአብሔር ፊት እሄዳለሁ። "},
	{10, "10 አመንሁ ስለዚህም ተናገርሁ፤ እኔም እጅግ ተቸገርሁ። "},
	{11, "11 እኔም ከድንጋጤዬ የተነሣ። ሰው ሁሉ ሐሰተኛ ነው አልሁ። "},
	{12, "12 ስላደረገልኝ ሁሉ ለእግዚአብሔር ምንን እመልሳለሁ? "},
	{13, "13 የመድኃኒትን ጽዋ እቀበላለሁ፥ የእግዚአብሔርንም ስም እጠራለሁ። "},
	{14, "14 በሕዝቡ ሁሉ ፊት ስእለቴን ለእግዚአብሔር እፈጽማለሁ። "},
	{15, "15 የቅዱሳኑ ሞት በእግዚአብሔር ፊት የከበረ ነው። "},
	{16, "16 አቤቱ፥ እኔ ባሪያህ ነኝ፥ ባሪያህ ነኝ፥ የሴት ባሪያህም ልጅ ነኝ፤ ሰንሰለቴን ሰበርህ። "},
	{17, "17 ለአንተ የምስጋና መሥዋዕትን እሠዋለሁ፥ የእግዚአብሔርንም ስም እጠራለሁ። "},
	{18, "18 በሕዝቡ ሁሉ ፊት ስእለቴን ለእግዚአብሔር እፈጽማለሁ፥ "},
	{19, "19 በእግዚአብሔር ቤት አደባባይ፥ ኢየሩሳሌም ሆይ፥ በመካከልሽም። ሃሌሉያ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view117() {
struct am117 poems[] = {
	{1, "1 ሃሌ ሉያ።1 አሕዛብ ሁላችሁ፥ እግዚአብሔርን አመስግኑት፥ ወገኖችም ሁሉ ያመስግኑት፤ "},
	{2, "2 ምሕረቱ በእኛ ላይ ጸንታለችና፤ የእግዚአብሔርም እውነት ለዘላለም ትኖራለች። ሃሌ ሉያ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view118() {
struct am118 poems[] = {
	{1, "1 ሃሌ ሉያ።1 እግዚአብሔርን አመስግኑ፥ ቸር ነውና፤ ምሕረቱ ለዘላለም ናትና። "},
	{2, "2 ቸር እንደ ሆነ፥ ምሕረቱ ለዘላለም እንደ ሆነች የእስራኤል ቤት አሁን ይንገሩ። "},
	{3, "3 ቸር እንደ ሆነ፥ ምሕረቱ ለዘላለም እንደ ሆነች የአሮን ቤት አሁን ይንገሩ። "},
	{4, "4 ቸር እንደ ሆነ፥ ምሕረቱ ለዘላለም እንደ ሆነች እግዚአብሔርን የሚፈሩ ሁሉ አሁን ይንገሩ። "},
	{5, "5 በተጨነቅሁ ጊዜ እግዚአብሔርን ጠራሁት፤ ሰማኝ አሰፋልኝም። "},
	{6, "6 እግዚአብሔር ረዳቴ ነው፥ አልፈራም ሰው ምን ያደርገኛል? "},
	{7, "7 እግዚአብሔር ረዳቴ ነው፥ እኔም በጠላቶቼ ላይ አያለሁ። "},
	{8, "8 በሰው ከመታመን ይልቅ በእግዚአብሔር መታመን ይሻላል። "},
	{9, "9 በገዦች ተስፋ ከማድረግ ይልቅ በእግዚአብሔር ተስፋ ማድረግ ይሻላል። "},
	{10, "10 አሕዛብ ሁሉ ከበቡኝ፥ በእግዚአብሔርም ስም አሸነፍኋቸው፤ "},
	{11, "11 መክበቡንስ ከበቡኝ፥ በእግዚአብሔርም ስም አሸነፍኋቸው፤ "},
	{12, "12 ንብ ማርን እንዲከብብ ከበቡኝ፥ እሳትም በእሾህ ውስጥ እንዲነድድ ነደዱ፥ በእግዚአብሔርም ስም አሸነፍኋቸው። "},
	{13, "13 ገፋኸኝ፥ ለመውደቅም ተንገዳገድሁ፤ እግዚአብሔር ግን አገዘኝ። "},
	{14, "14 ኃይሌም ዝማሬዬም እግዚአብሔር ነው፥ እርሱም መድኃኒት ሆነልኝ። "},
	{15, "15 የእልልታና የመድኃኒት ድምፅ በጻድቃን ድንኳን ነው፤ የእግዚአብሔር ቀኝ ኃይልን አደረገች። "},
	{16, "16 የእግዚአብሔር ቀኝ ከፍ ከፍ አደረገችኝ፤ የእግዚአብሔር ቀኝ ኃይልን አደረገች። "},
	{17, "17 አልሞትም በሕይወት እኖራለሁ እንጂ፥ የእግዚአብሔርንም ሥራ እናገራለሁ። "},
	{18, "18 መገሠጽስ እግዚአብሔር ገሠጸኝ፤ ለሞት ግን አልሰጠኝም። "},
	{19, "19 የጽድቅን ደጆች ክፈቱልኝ፤ ወደ እነርሱ ገብቼ እግዚአብሔርን አመሰግናለሁ። "},
	{20, "20 ይህች የእግዚአብሔር ደጅ ናት፤ ወደ እርስዋ ጻድቃን ይገባሉ። "},
	{21, "21 ሰምተኸኛልና፥ መድኃኒትም ሆነኸኛልና አመሰግንሃለሁ። "},
	{22, "22 ግንበኞች የናቁት ድንጋይ፥ እርሱ የማዕዘን ራስ ሆነ፥ "},
	{23, "23 ይህች ከእግዚአብሔር ዘንድ ሆነች፥ ለዓይናችንም ድንቅ ናት። "},
	{24, "24 እግዚአብሔር የሠራት ቀን ይህች ናት፤ ሐሤትን እናድርግ፥ በእርስዋም ደስ ይበለን። "},
	{25, "25 አቤቱ፥ እባክህ፥ አሁን አድን፤ አቤቱ፥ እባክህ፥ አሁን አቅና። "},
	{26, "26 በእግዚአብሔር ስም የሚመጣ ቡሩክ ነው፤ ከእግዚአብሔር ቤት መረቅናችሁ። "},
	{27, "27 እግዚአብሔር አምላክ ነው፥ ለእኛም በራልን፤ እስከ መሠዊያው ቀንዶች ድረስ የበዓሉን መሥዋዕት በገመድ እሰሩት። "},
	{28, "28 አንተ አምላኬ ነህ አመሰግንህማለሁ። አንተ አምላኬ ነህ፥ ከፍ ከፍ አደርግሃለሁ፤ ሰምተኸኛልና፥ መድኃኒትም ሆነኸኛልና አመሰግንሃለሁ። "},
	{29, "29 እግዚአብሔርን አመስግኑ፥ ቸር ነውና፤ ምሕረቱ ለዘላለም ናትና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view119() {
struct am119 poems[] = {
	{1, "1 በመንገዳቸው ንጹሐን የሆኑ፥ በእግዚአብሔርም ሕግ የሚሄዱ ምስጉኖች ናቸው። "},
	{2, "2 ምስክሩን የሚፈልጉ፥ በፍጹም ልብ የሚሹት ምስጉኖች ናቸው፤ "},
	{3, "3 ዓመፅንም አያደርጉም፥ በመንገዶቹም ይሄዳሉ። "},
	{4, "4 ትእዛዛትህን እጅግ እንጠብቅ ዘንድ አንተ አዘዝህ። "},
	{5, "5 ሥርዓትህን ለመጠበቅ፤ መንገዶቼ ይቀኑ ዘንድ እወድድ ነበር። "},
	{6, "6 ትእዛዝህን ሁሉ ስመለከት በዚያን ጊዜ አላፍርም። "},
	{7, "7 አቤቱ፥ የጽድቅህን ፍርድ ስማር በቅን ልብ አመሰግንሃለሁ። "},
	{8, "8 ሥርዓትህን እጠብቃለሁ፤ በፍጹም አትጣለኝ።ቤት "},
	{9, "9 ጕልማሳ መንገዱን በምን ያነጻል? ቃልህን በመጠበቅ ነው። "},
	{10, "10 በፍጹም ልቤ ፈለግሁህ፥ ከትእዛዝህ አታርቀኝ። "},
	{11, "11 አንተ እንዳልበድል፥ ቃልህን በልቤ ሰወርሁ። "},
	{12, "12 አቤቱ፥ አንተ ቡሩክ ነህ፤ ሥርዓትህን አስተምረኝ። "},
	{13, "13 የአፍህን ፍርድ ሁሉ በከንፈሬ ነገርሁ። "},
	{14, "14 እንደ ብልጥግና ሁሉ በምስክርህ መንገድ ደስ አለኝ። "},
	{15, "15 ትእዛዝህን አሰላስላለሁ፥ መንገድህንም እፈልጋለሁ። "},
	{16, "16 በትእዛዝህ ደስ ይለኛል፤ ቃልህንም አልረሳም።ጋሜል "},
	{17, "17 ለባሪያህ መልካም አድርግ ሕያው እንድሆን፥ ቃልህንም እንድጠብቅ። "},
	{18, "18 ዓይኖቼን ክፈት፥ ከሕግህም ተኣምራትህን አያለሁ። "},
	{19, "19 እኔ በምድር እንግዳ ነኝ፤ ትእዛዛትህን ከእኔ አትሰውር። "},
	{20, "20 ነፍሴ ሁልጊዜ ፍርድህን እጅግ ናፈቀች። "},
	{21, "21 ከትእዛዛትህ የሳቱትን ትዕቢተኞችንና ርጉማንን ዘለፍህ። "},
	{22, "22 ምስክርህን ፈልጌአለሁና። ስድብንና ነውርን ከእኔ አርቅ። "},
	{23, "23 አለቆች ደግሞ ተቀምጠው እኔን አሙኝ፤ ባሪያህ ግን ሕግህን ያሰላስል ነበር። "},
	{24, "24 ምስክርህም ተድላዬ ነው፥ ሥርዓትህም መካሪዬ ነው።ዳሌጥ "},
	{25, "25 ነፍሴ ወደ ምድር ተጠጋች፤ እንደ ቃልህ ሕያው አድርገኝ። "},
	{26, "26 መንገድህን ነገርሁ ሰማኸኝም፤ ሥርዓትህን አስተምረኝ። "},
	{27, "27 የሥርዓትህን መንገድ እንዳስተውል አድርገኝ፥ ተኣምራትህንም አሰላስላለሁ። "},
	{28, "28 ከኀዘን የተነሣ ነፍሴ አንቀላፋች፤ በቃልህ አጠንክረኝ። "},
	{29, "29 የዓመፅን መንገድ ከእኔ አርቅ፥ በሕግህም ማረኝ፤ "},
	{30, "30 የእውነትህን መንገድ መረጥሁ፥ ፍርድህንም አልረሳሁም። "},
	{31, "31 አቤቱ፥ ምስክርህን ተጠጋሁ፤ አታሳፍረኝ። "},
	{32, "32 ልቤን ባሰፋኸው ጊዜ፥ በትእዛዝህ መንገድ ሮጥሁ።ሄ "},
	{33, "33 አቤቱ፥ የሥርዓትህን መንገድ አስተምረኝ፥ ሁልጊዜም እፈልገዋለሁ። "},
	{34, "34 እንዳስተውል አድርገኝ፥ ሕግህንም እፈልጋለሁ፤ በፍጹም ልቤም እጠብቀዋለሁ። "},
	{35, "35 እርስዋን ወድጃለሁና የትእዛዝህን መንገድ ምራኝ። "},
	{36, "36 ልቤን ወደ ምስክርህ አዘንብል፥ ወደ ስስትም አይሁን። "},
	{37, "37 ከንቱ ነገርን እንዳያዩ ዓይኖቼን መልስ፤ በመንገድህ ሕያው አድርገኝ። "},
	{38, "38 እንዲፈራህ ባሪያህን በቃልህ አጽና። "},
	{39, "39 ፍርድህ መልካም ናትና የተጠራጠርሁትን ስድብ ከእኔ አርቅ። "},
	{40, "40 እነሆ፥ ትእዛዝህን ናፈቅሁ፤ በጽድቅህ ሕያው አድርገኝዋው "},
	{41, "41 አቤቱ፥ እንደ ቃልህ፥ ምሕረትህና መድኃኒትህ ይምጡልኝ። "},
	{42, "42 በቃልህ ታምኛለሁና ለሚሰድቡኝ በነገር እመልስላቸዋለሁ። "},
	{43, "43 በፍርድህም ታምኛለሁና የእውነትን ቃል ከአፌ ፈጽመህ አታርቅ። "},
	{44, "44 ለዘላለም ዓለም ሁልጊዜ ሕግህን እጠብቃለሁ። "},
	{45, "45 ትእዛዛትህንም ፈልጌአለሁና አስፍቼ እሄዳለሁ። "},
	{46, "46 በነገሥታት ፊት ምስክርህን እናገራለሁ፥ አላፍርምም፤ "},
	{47, "47 እጅግም በወደድኋቸው በትእዛዛትህ ደስ ይለኛል። "},
	{48, "48 እጆቼንም ወደ ወደድኋቸው ወደ ትእዛዛትህ አነሣለሁ፤ ሥርዓትህንም አሰላስላሁ።ዛይ "},
	{49, "49 ለባሪያህ ተስፋ ያስደረግኸውን ቃልህን አስብ። "},
	{50, "50 ቃልህ ሕያው አድርጎኛልና ይህች በመከራዬ ደስ አሰኘችኝ። "},
	{51, "51 ትዕቢተኞች እጅግ ዐመፁ፤ እኔ ግን ከሕግህ አልራቅሁም። "},
	{52, "52 ከጥንት የነበረውን ፍርድህን አሰብሁ፥ አቤቱ፥ ተጽናናሁም። "},
	{53, "53 ሕግህን ከተዉ ከኃጢአተኞች የተነሣ ኅዘን ያዘኝ። "},
	{54, "54 በእንግድነቴ አገር ሥርዓትህ መዝሙር ሆነችኝ። "},
	{55, "55 አቤቱ፥ በሌሊት ስምህን አሰብሁ፥ ሕግህንም ጠበቅሁ። "},
	{56, "56 ትእዛዛትህንም ፈልጌአለሁና፤ ይህች ሆነችልኝ።ሔት "},
	{57, "57 እግዚአብሔር ክፍሌ ነው፤ ሕግህን እጠብቃለሁ አልሁ። "},
	{58, "58 በፍጹም ልቤ ወደ ፊትህ ተማለልሁ፤ እንደ ቃልህ ማረኝ። "},
	{59, "59 ስለ መንገዶችህ አሰብሁ፥ እግሬንም ወደ ምስክሮችህ መለስሁ። "},
	{60, "60 ትእዛዝህን ለመጠበቅ ጨከንሁ አልዘገየሁምም። "},
	{61, "61 የኃጥኣን ገመዶች ተተበተቡብኝ፤ ሕግህን ግን አልረሳሁም። "},
	{62, "62 ስለ ጽድቅህ ፍርድ፥ በእኩለ ሌሊት አመሰግንህ ዘንድ እነሣለሁ። "},
	{63, "63 እኔ ለሚፈሩህ ሁሉ፥ ትእዛዝህንም ለሚጠብቁ ባልንጀራ ነኝ። "},
	{64, "64 አቤቱ፥ ምሕረትህ በምድር ሁሉ ሞላች፤ ሥርዓትህን አስተምረኝ።ጤት "},
	{65, "65 አቤቱ፥ እንደ ቃልህ ለባሪያህ መልካም አደረግህ። "},
	{66, "66 በትእዛዛትህ ታምኛለሁና መልካም ምክርና እውቀትን አስተምረኝ። "},
	{67, "67 እኔ ሳልጨነቅ ሳትሁ፤ አሁን ግን ቃልህን ጠበቅሁ። "},
	{68, "68 አቤቱ፥ አንተ ቸር ነህ፥ በቸርነትህም ሥርዓትህን አስተምረኝ። "},
	{69, "69 የትዕቢተኞች ዓመፅ በላዬ በዛ፤ እኔ ግን በፍጹም ልቤ ትእዛዛትህን እፈልጋለሁ። "},
	{70, "70 ልባቸው እንደ ወተት ረጋ፤ እኔ ግን በሕግህ ደስ ይለኛል። "},
	{71, "71 ሥርዓትህን እማር ዘንድ ያስጨነቅኸኝ መልካም ሆነልኝ። "},
	{72, "72 ከአእላፋት ወርቅና ብር ይልቅ የአፍህ ሕግ ይሻለኛል።ዮድ "},
	{73, "73 እጆችህ ሠሩኝ አበጃጁኝም፤ እንዳስተውል አድርገኝ፥ ትእዛዛትህንም እማራለሁ። "},
	{74, "74 በቃልህ ታምኛለሁና የሚፈሩህ እኔን አይተው ደስ ይላቸዋል። "},
	{75, "75 አቤቱ፥ ፍርድህ ጽድቅ እንደ ሆነች፥ በእውነትህም እንዳስቸገርኸኝ አወቅሁ። "},
	{76, "76 ምሕረትህ ለመጽናናቴ ትሁነኝ፥ እንደ ቃልህም ለባሪያህ ይሁነው። "},
	{77, "77 ሕግህ ተድላዬ ናትና ቸርነትህ ትምጣልኝ፥ በሕይወትም ልኑር። "},
	{78, "78 ትዕቢተኞች በዓመፅ ጠምመውብኛልና ይፈሩ፤ እኔ ግን በትእዛዝህ እጫወታለሁ። "},
	{79, "79 የሚፈሩህና ምስክሮችህን የሚያውቁ ወደ እኔ ይመለሱ። "},
	{80, "80 እንዳላፍር ልቤ በሥርዓትህ የቀና ይሁን።ካፍ "},
	{81, "81 ነፍሴ መድኃኒትህን ናፈቀች፤ በቃልህም ታመንሁ። "},
	{82, "82 መቼ ታጽናናኛለህ እያልሁ ዓይኖቼ ስለ ቃልህ ፈዘዙ። "},
	{83, "83 በጢስ እንዳለ አቁማዳ ሆኛለሁና፤ ሥርዓትህን ግን አልረሳሁም። "},
	{84, "84 የባሪያህ ዘመኖች ስንት ናቸው? በሚያሳድዱኝስ ላይ መቼ ትፈርድልኛለህ? "},
	{85, "85 ኃጢአተኞች ጨዋታን ነገሩኝ፥ አቤቱ፥ እንደ ሕግህ ግን አይደለም። "},
	{86, "86 ትእዛዛትህ ሁሉ እውነት ናቸው፤ በዓመፅ አሳድደውኛል፤ እርዳኝ። "},
	{87, "87 ከምድር ሊያጠፉኝ ጥቂት ቀርቶአቸው ነበር፤ እኔ ግን ትእዛዛትህን አልተውሁም። "},
	{88, "88 እንደ ምሕረትህ ሕያው አድርገኝ፤ የአፍህንም ምስክር እጠብቃለሁ።ላሜድ "},
	{89, "89 አቤቱ፥ ቃልህ በሰማይ ለዘላለም ይኖራል። "},
	{90, "90 እውነትህ ለልጅ ልጅ ናት፤ ምድርን መሠረትሃት እርስዋም ትኖራለች። "},
	{91, "91 ሁሉም ባሪያዎችህ ናቸውና ቀኑ በትእዛዝህ ይኖራል። "},
	{92, "92 ሕግህ ተድላዬ ባይሆን፥ ቀድሞ በጐስቍልናዬ በጠፋሁ ነበር። "},
	{93, "93 በእርሱ ሕያው አድርገኸኛልና ፍርድህን ለዘላለም አልረሳም። "},
	{94, "94 እኔ የአንተ ነኝ፤ ፍርድህን ፈልጌአልሁና አድነኝ። "},
	{95, "95 ኃጢአተኞች ያጠፉኝ ዘንድ ጠበቁኝ፤ ምስክርህን ግን መረመርሁ። "},
	{96, "96 የሥራህን ሁሉ ፍጻሜ አየሁ፤ ትእዛዝህ ግን እጅግ ሰፊ ነው።ሜም "},
	{97, "97 አቤቱ፥ ሕግህን እንደ ምን እጅግ ወደድሁ! ቀኑን ሁሉ እርሱ ትዝታዬ ነው። "},
	{98, "98 ለዘላለም ለእኔ ነውና ትእዛዝህ ከጠላቶቼ ይልቅ አስተዋይ አደረገኝ። "},
	{99, "99 ምስክርህ ትዝታዬ ነውና ካስተማሩኝ ሁሉ ይልቅ አስተዋልሁ። "},
	{100, "100 ትእዛዝህን ፈልጌአለሁና ከሽማግሌዎች ይልቅ አስተዋልሁ። "},
	{101, "101 ቃልህን እጠብቅ ዘንድ ከክፉ መንገድ ሁሉ እግሬን ከለከልሁ። "},
	{102, "102 አስተምረኸኛልና ከፍርድህ አልራቅሁም። "},
	{103, "103 ቃልህ ለጕሮሮዬ ጣፋጭ ነው፤ ከማርና ከወለላ ይልቅ ለአፌ ጣፈጠኝ። "},
	{104, "104 ከትእዛዝህ የተነሣ አስተዋልሁ፤ ስለዚህ የሐሰትን መንገድ ጠላሁ።ኖን "},
	{105, "105 ሕግህ ለእግሬ መብራት፥ ለመንገዴ ብርሃን ነው። "},
	{106, "106 የጽድቅህን ፍርድ እጠብቅ ዘንድ ማልሁ፥ አጸናሁም። "},
	{107, "107 እጅግ ተቸገርሁ፤ አቤቱ፥ እንደ ቃልህ ሕያው አድርገኝ። "},
	{108, "108 አቤቱ፥ ከአፌ የሚወጣውን ቃል ውደድ፥ ፍርድህንም አስተምረኝ። "},
	{109, "109 ነፍሴ ሁልጊዜ በእጅህ ውስጥ ናት፤ ሕግህን ግን አልረሳሁም። "},
	{110, "110 ኃጢአተኞች ወጥመድን ዘረጉብኝ፤ ከትእዛዝህ ግን አልሳትሁም። "},
	{111, "111 የልቤ ደስታ ነውና ምስክርህን ለዘላለም ወረስሁ። "},
	{112, "112 ለዘላለም ለፍጻሜውም ትእዛዝህን አደርግ ዘንድ ልቤን አዘነበልሁ።ሳምኬት "},
	{113, "113 ዓመፀኞችን ጠላሁ፥ ሕግህን ግን ወደድሁ። "},
	{114, "114 አንተ ረዳቴና መጠጊያዬ ነህ፥ በቃልህም ተማመንሁ። "},
	{115, "115 እናንተ ኃጢአተኞች፥ ከእኔ ራቁ፥ የአምላኬንም ትእዛዝ ልፈልግ። "},
	{116, "116 እንደ ቃልህ ደግፈኝ፥ ሕያውም እሆናለሁ። ከተስፋዬም አልፈር። "},
	{117, "117 እርዳኝ እድናለሁም፥ ሁልጊዜም ሥርዓትህን እመረምራለሁ። "},
	{118, "118 ምኞታቸው ዓመፃ ነውና ከሥርዓትህ የሚርቁትን ሁሉ አጐሳቈልሃቸው። "},
	{119, "119 የምድርን ኃጢአተኞች ሁሉ እንደ ርኵሰት አጠፋሃቸው፤ ስለዚህ ምስክርህን ወደድሁ። "},
	{120, "120 ሥጋዬ አንተን ከመፍራት የተነሣ ደንገጠ፤ ከፍርድህ የተነሣ ፈርቻለሁ።ዔ "},
	{121, "121 ፍርድንና ጽድቅን ሠራሁ፤ ለሚያስጨንቁኝ አሳልፈህ አትስጠኝ። "},
	{122, "122 ባሪያህን በመልካም ጠብቀው፤ ትዕቢተኞችም አይጋፉኝ። "},
	{123, "123 ዓይኖቼ ለማዳንህ፥ ለጽድቅህም ቃል ፈዘዙ። "},
	{124, "124 ለባሪያህ እንደ ምሕረትህ አድርግ፥ ሥርዓትህንም አስተምረኝ። "},
	{125, "125 እኔ ባሪያህ ነኝ፤ እንዳስተውል አድርገኝ፥ ምስክርህንም አውቃለሁ። "},
	{126, "126 ለእግዚአብሔር የሥራ ጊዜ ነው፥ ሕግህንም ሻሩት። "},
	{127, "127 ስለዚህ ከወርቅና ከዕንቍ ይልቅ ትእዛዝህን ወደድሁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view120() {
struct am120 poems[] = {
	{1, "1 የመዓርግ መዝሙር።1 በተጨነቅሁ ጊዜ ወደ እግዚአብሔር ጮኽሁ፥ ሰማኝም። "},
	{2, "2 ከዓመፀኛ ከንፈር ከሸንጋይም አንደበት፥ አቤቱ፥ ነፍሴን አድናት። "},
	{3, "3 ስለ ሽንገላ አንደበት ምንም ይሰጡሃል? ምንስ ይጨምሩልሃል? "},
	{4, "4 እንደ በረሃ እንጨት ፍም የኃያላን ፍላጾች የተሳሉ ናቸው። "},
	{5, "5 መኖሪያዬ የራቀ እኔ ወዮልኝ፤ በቄዳር ድንኳኖች አደርሁ። "},
	{6, "6 ሰላምን ከሚጠሉ ጋር ነፍሴ ብዙ ጊዜ ኖረች። "},
	{7, "7 እኔ ሰላማዊ ነኝ፤ በተናገኋቸው ጊዜ ግን በከንቱ ተሰለፉብኝ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view121() {
struct am121 poems[] = {
	{1, "1 የመዓርግ መዝሙር።1 ዓይኖቼ ወደ ተራሮች አነሣሁ፤ ረዳቴ ከወዴት ይምጣ? "},
	{2, "2 ረዳቴ ሰማይና ምድርን ከሠራ ከእግዚአብሔር ዘንድ ነው። "},
	{3, "3 እግርህን ለመናወጥ አይሰጠውም፤ የሚጠብቅህም አይተኛም። "},
	{4, "4 እነሆ፥ እስራኤልን የሚጠብቅ አይተኛም አያንቀላፋምም። "},
	{5, "5 እግዚአብሔር ይጠብቅሃል፥ እግዚአብሔርም በቀኝ እጅህ በኩል ይጋርድሃል። "},
	{6, "6 ፀሐይ በቀን አያቃጥልህም ጨረቃም በሌሊት። "},
	{7, "7 እግዚአብሔር ከክፉ ሁሉ ይጠብቅሃል፥ ነፍስህንም ይጠብቃታል። "},
	{8, "8 ከዛሬ ጀምሮ እስከ ዘላለም እግዚአብሔር መውጣትህና መግባትህን ይጠብቃል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view122() {
struct am122 poems[] = {
	{1, "1 የዳዊት የመዓርግ መዝሙር።1 ወደ እግዚአብሔር ቤት እንሄድ ባሉኝ ጊዜ ደስ አለኝ። "},
	{2, "2 ኢየሩሳሌም ሆይ፥ እግሮቻችን በአደባባይሽ ቆሙ። "},
	{3, "3 ኢየሩሳሌምስ እርስ በርስዋ እንደ ተገጠገጠች ከተማ ተሠርታለች። "},
	{4, "4 የእግዚአብሔርን ስም ያመስግኑ ዘንድ፥ ለእስራኤል ምስክር ሊሆኑ የእግዚአብሔር ነገዶች ወደዚያ ይወጣሉ። "},
	{5, "5 ዙፋኖች በዚያ ለፍርድ ተቀምጠዋልና፥ የዳዊት ቤት ዙፋኖች። "},
	{6, "6 ለኢየሩሳሌም ሰላምን ለምኑ፤ አንተንም ለሚወድዱ ልማት ይሁን። "},
	{7, "7 በኃይልህ ሰላም፥ በጌጠኛ ቤትህም ልማት ይሁን። "},
	{8, "8 ስለ ወንድሞቼ ስለ ባልንጀሮቼም፥ በውስጥሽ ሰላም ይሁን አልሁ። "},
	{9, "9 ስለ አምላካችን ስለ እግዚአብሔር ቤት ላንቺ መልካምነትሽን ፈለግሁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view123() {
struct am123 poems[] = {
	{1, "1 የመዓርግ መዝሙር።1 በሰማይ የምትኖር ሆይ፥ ዓይኖቼን ወደ አንተ አነሣሁ። "},
	{2, "2 እነሆ፥ የባሪያዎች ዓይኖች ወደ ጌታቸው እጅ እንደ ሆኑ፥ የባሪያይቱም ዓይን ወደ እመቤትዋ እጅ እንደ ሆነ፥ እንዲሁ እስኪምረን ድረስ ዓይናችን ወደ አምላካችን ወደ እግዚአብሔር ነው። "},
	{3, "3 ማረን፥ አቤቱ፥ ማረን፤ ንቀትን እጅግ ጠግበናልና፤ "},
	{4, "4 የባለጠጎች ስድብና የትዕቢተኞችን ንቀት ነፍሳችን እጅግ ጠገበች። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view124() {
struct am124 poems[] = {
	{1, "1 የዳዊት የመዓርግ መዝሙር።1 እግዚአብሔር ከእኛ ጋር ባይሆን እስራኤል እንዲህ ይበል። "},
	{2, "2 እግዚአብሔር ከእኛ ጋር ባይሆን ሰዎች በእኛ ላይ በተነሡ ጊዜ፥ "},
	{3, "3 ቍጣቸውን በላያችን በነደደ ጊዜ፥ በዚያን ጊዜ ሕያዋን ሳለን በዋጡን ነበር፤ "},
	{4, "4 በዚያን ጊዜ ውኃ ባሰጠመን ነበር፥ በነፍሳችንም ላይ ፈሳሽ ባለፈ ነበር፤ "},
	{5, "5 በዚያን ጊዜ የጐርፍ ውኃ በነፍሳችን ላይ ባለፈ ነበር። "},
	{6, "6 ለጥርሳቸው ንክሻ ያላደረገን እግዚአብሔር ይባረክ። "},
	{7, "7 ነፍሳችን እንደ ወፍ ከአዳኞች ወጥመድ አመለጠች። ወጥመድ ተሰበረ እኛም አመለጥን። "},
	{8, "8 ረድኤታችን ሰማይንና ምድርን በሠራ በእግዚአብሔር ስም ነው። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view125() {
struct am125 poems[] = {
	{1, "1 የመዓርግ መዝሙር።1 በእግዚአብሔር የታመኑ እንደማይታወክ ለዘላለም እንደሚኖር እንደ ጽዮን ተራራ ናቸው። "},
	{2, "2 ተራሮች በኢየሩሳሌም ዙሪያ እንደ ሆኑ፥ ከዛሬ ጀምሮ ለዘላለም፤ እግዚአብሔር በሕዝቡ ዙሪያ ነው። "},
	{3, "3 ጻድቃን እጃቸውን ወደ ክፋት እንዳይዘረጉ የኃጥኣን በትር በጻድቃን ዕጣ ላይ አይኖርም። "},
	{4, "4 አቤቱ፥ ለቸሮች ልባቸውም ለቀና መልካምን አድርግ። "},
	{5, "5 ወደ ጠማማነት የሚመለሱትን ግን ዓመፃን ከሚሠሩት ጋር እግዚአብሔር ይወስዳቸዋል። ሰላም በእስራኤል ላይ ይሁን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view126() {
struct am126 poems[] = {
	{1, "1 የመዓርግ መዝሙር።1 እግዚአብሔር የጽዮንን ምርኮ በመለሰ ጊዜ፥ እጅግ ደስተኞች ሆንን። "},
	{2, "2 በዚያን ጊዜ አፋችን ደስታን፥ አንደበታችንም ሐሴትን ሞላ፤ በዚያን ጊዜ በአሕዛብ ዘንድ። እግዚአብሔር ታላቅ ነገርን አደረገላቸው ተባለ። "},
	{3, "3 እግዚአብሔር ታላቅ ነገርን አደረገልን፥ ደስም አለን። "},
	{4, "4 አቤቱ፥ በደቡብ እንዳሉ ፈሳሾች ምርኮአችንን መልስ። "},
	{5, "5 በልቅሶ የሚዘሩ በደስታ ይለቅማሉ። "},
	{6, "6 በሄዱ ጊዜ፥ ዘራቸውን ተሸክመው እያለቀሱ ተሰማሩ፤ በተመለሱ ጊዜ ግን ነዶአቸውን ተሸክመው ደስ እያላቸው ይመጣሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view127() {
struct am127 poems[] = {
	{1, "1 የመዓርግ መዝሙር።1 እግዚአብሔር ቤትን ካልሠራ፥ ሠራተኞች በከንቱ ይደክማሉ፤ እግዚአብሔር ከተማን ካልጠበቀ፥ ጠባቂ በከንቱ ይተጋል። "},
	{2, "2 በማለዳ መገሥገሣችሁም ከንቱ ነው። ለወዳጆቹ እንቅልፍን በሰጠ ጊዜ፥ እናንተ የመከራን እንጀራ የምትበሉ፥ ከተቀመጣችሁበት ተነሡ። "},
	{3, "3 እነሆ፥ ልጆች የእግዚአብሔር ስጦታ ናቸው፥ የሆድም ፍሬ የእርሱ ዋጋ ነው። "},
	{4, "4 በኃያል እጅ እንዳሉ ፍላጾች፥ የጐልማስነት ልጆች እንዲሁ ናቸው። "},
	{5, "5 ከእነርሱ ዘንድ ምኞቱን የሚፈጽም ብፁዕ ሰው ነው፤ ጠላቶቻቸውን በአደባባይ በተናገሩ ጊዜ እርሱ አያፍርም። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view128() {
struct am128 poems[] = {
	{1, "1 የመዓርግ መዝሙር።1 እግዚአብሔርን የሚፈሩት ሁሉ፥ በመንገዶቹም የሚሄዱ ምስጉኖች ናቸው። "},
	{2, "2 የድካምህንም ፍሬ ትመገባለህ፤ ምስጉን ነህ መልካምም ይሆንልሃል። "},
	{3, "3 ሚስትህ በቤትህ እልፍኝ ውስጥ እንደሚያፈራ ወይን ናት፤ ልጆችህ በማዕድህ ዙሪያ እንደ ወይራ ቡቃያ ናቸው። "},
	{4, "4 እነሆ፥ እግዚአብሔርን የሚፈራ ሰው እንዲህ ይባረካል። "},
	{5, "5 እግዚአብሔር ከጽዮን ይባርክህ፤ በሕይወትህ ዘመን ሁሉ፥ የኢየሩሳሌምን መልካምነትዋን ታያለህ። "},
	{6, "6 የልጆችህንም ልጆች ታያለህ። በእስራኤል ላይ ሰላም ይሁን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view129() {
struct am129 poems[] = {
	{1, "1 የመዓርግ መዝሙር።1 እስራኤል። ከትንሽነቴ ጀምሮ ብዙ ጊዜ ተሰለፉብኝ ይበል፤ "},
	{2, "2 ከትንሽነቴ ጀምሮ ብዙ ጊዜ ተሰለፉብኝ፤ ነገር ግን አላሸነፉኝም። "},
	{3, "3 ኃጢአተኞች በጀርባዬ ላይ መቱኝ፥ ኃጢአታቸውንም አስረዘሙአት። "},
	{4, "4 እግዚአብሔር ጻድቅ ነው፤ የኃጢአተኞችን አንገታቸውን ቈረጠ። "},
	{5, "5 ጽዮንን የሚጠሉ ሁሉ ይፈሩ፥ ወደ ኋላቸውም ይመለሱ። "},
	{6, "6 በሰገነት ላይ እንደ በቀለ ሣር፥ ሳይነቀል እንደሚደርቅ፥ "},
	{7, "7 ለሚያጭደው እጁን፥ ነዶዎቹን ለሚሰበስብ እቅፉን እንደማይሞላ ይሁኑ። "},
	{8, "8 በመንገዱም የሚያልፉ። የእግዚአብሔር በረከት በእናንተ ላይ ይሁን፤ በእግዚአብሔር ስም እንመርቃችኋለን አይሉም። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view130() {
struct am130 poems[] = {
	{1, "1 የመዓርግ መዝሙር።1 አቤቱ፥ አንተን ከጥልቅ ጠራሁህ። "},
	{2, "2 አቤቱ፥ ድምፄን ስማ፤ ጆሮህ የልመናዬን ቃል የሚያደምጥ ይሁን። "},
	{3, "3 አቤቱ፥ ኃጢአትንስ ብትጠባበቅ፥ አቤቱ፥ ማን ይቆማል? "},
	{4, "4 ይቅርታ ከአንተ ዘንድ ነውና። "},
	{5, "5 አቤቱ፥ ስለ ስምህ ተስፋ አደረግሁህ፤ ነፍሴ በሕግህ ታገሠች። "},
	{6, "6 ከማለዳው ሰዓት ጀምሮ እስከ ሌሊት ነፍሴ በእግዚአብሔር ታመነች። "},
	{7, "7 ከእግዚአብሔር ዘንድ ምሕረት፥ በእርሱም ዘንድ ብዙ ማዳን ነውና እስራኤል በእግዚአብሔር ይታመን። "},
	{8, "8 እርሱም እስራኤልን ከኃጢአቱ ሁሉ ያድነዋል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view131() {
struct am131 poems[] = {
	{1, "1 የዳዊት መዓርግ መዝሙር።1 አቤቱ፥ ልቤ አይታበይብኝ፥ ዓይኖቼም ከፍ ከፍ አይበሉብኝ፤ ከትልልቆች ጋር፥ ከእኔም ይበልጥ ከሚከበሩ ጋር አልሄድሁም። "},
	{2, "2 ነፍሴን አሳረፍኋት፥ የእናቱንም ጡት እንዳስተውት ዝም አሰኘኋት፤ ነፍሴ የእናቱን ጡት እንዳስተውት በእኔ ውስጥ ናት። "},
	{3, "3 ከዛሬ ጀምሮ እስከ ዘላለም እስራኤል በእግዚአብሔር ይታመን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view132() {
struct am132 poems[] = {
	{1, "1 የመዓርግ መዝሙር።1 አቤቱ፥ ዳዊትን ገርነቱንም ሁሉ አስብ፤ "},
	{2, "2 ለእግዚአብሔር እንደ ማለ፥ ለያዕቆብም አምላክ እንደ ተሳለ። "},
	{3, "3 በእውነት ወደ ቤቴ ድንኳን አልገባም፥ ወደ ምንጣፌም አልጋ አልወጣም፥ "},
	{4, "4 ለዓይኖቼም መኝታ ለሽፋሽፍቶቼም እንቅልፍ፥ ለጕንጮቼም ዕረፍትን አልሰጥም፥ "},
	{5, "5 ለእግዚአብሔር ስፍራ፥ ለያዕቆብ አምላክ ማደሪያ እስካገኝ ድረስ ብሎ። "},
	{6, "6 እነሆ፥ በኤፍራታ ሰማነው፥ በዱር ውስጥም አገኘነው። "},
	{7, "7 ወደ ማደሪያዎቹ እንገባለን፤ እግሮቹ በሚቆሙበት ስፍራ እንሰግዳለን። "},
	{8, "8 አቤቱ፥ ወደ ዕረፍትህ ተነሥ፥ አንተና የመቅደስህ ታቦት። "},
	{9, "9 ካህናቶችህ ጽድቅን ይልበሱ፥ ቅዱሳንህም ደስ ይበላቸው። "},
	{10, "10 ስለ ዳዊት ስለ ባሪያህ የቀባኸውን ሰው ፊት አትመልስ። "},
	{11, "11 እግዚአብሔር ለዳዊት በእውነት ማለ አይጸጸትምም፥ እንዲህ ብሎ። ከሆድህ ፍሬ በዙፋንህ ላይ አስቀምጣለሁ። "},
	{12, "12 ልጆችህ ኪዳኔን፥ ይህንም የማስተምራቸውን ምስክሬን ቢጠብቁ፥ ልጆቻቸው ደግሞ በዙፋንህ ላይ ለዘላለም ይቀመጣሉ። "},
	{13, "13 እግዚአብሔር ጽዮንን መርጦአታልና፥ ማደሪያውም ትሆነው ዘንድ ወድዶአታልና፥ እንዲህ ብሎ። "},
	{14, "14 ይህች ለዘላለም ማረፊያዬ ናት፤ መርጫታለሁና በዚህች አድራለሁ። "},
	{15, "15 አሮጊቶችዋን እጅግ እባርካለሁ፥ ድሆችዋንም እንጀራ አጠግባለሁ። "},
	{16, "16 ካህናቶችዋንም ደኅንነትን አለብሳቸዋለሁ፥ ቅዱሳኖችዋም እጅግ ደስ ይላቸዋል። "},
	{17, "17 በዚያ ለዳዊት ቀንድን አበቅላለሁ፥ ለቀባሁትም ሰው መብራትን አዘጋጃለሁ። "},
	{18, "18 ጠላቶችንም እፍረትን አለብሳቸዋለሁ፤ በእርሱ ግን ቅድስናዬ ያብባል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view133() {
struct am133 poems[] = {
	{1, "1 የዳዊት የመዓርግ መዝሙር።1 ወንድሞች በኅብረት ቢቀመጡ፥ እነሆ፥ መልካም ነው፥ እነሆም፥ ያማረ ነው። "},
	{2, "2 ከራስ እስከ ጢም እንደሚፈስስ፥ እስከ አሮን ጢም፥ በልብሱ መደረቢያ እንደሚወርድ ሽቱ ነው። "},
	{3, "3 በጽዮን ተራሮች እንደሚወርድ እንደ አርሞንዔም ጠል ነው፤ በዚያ እግዚአብሔር በረከቱን ሕይወትንም እስከ ዘላለም አዝዞአልና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view134() {
struct am134 poems[] = {
	{1, "1 የመዓረግ መዝሙር።1 እነሆ፥ እግዚአብሔርን ባርኩ፥ በአምላካችን ቤት አደባባዬች የምትቆሙ እናንተ የእግዚአብሔር ባሪያዎች ሁላችሁ። "},
	{2, "2 በሌሊት በቤተ መቅደስ ውስጥ እጆቻችሁን አንሡ፥ እግዚአብሔርንም ባርኩ። "},
	{3, "3 ሰማይንና ምድርን የሠራ እግዚአብሔር ከጽዮን ይባርክህ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view135() {
struct am135 poems[] = {
	{1, "1 ሃሌ ሉያ። የእግዚአብሔርን ስም አመስግኑ፤ እናንተ የእግዚአብሔር ባሪያዎች ሆይ፥ አመስግኑት፥ "},
	{2, "2 በእግዚአብሔር ቤት ውስጥ፥ በአምላካችን ቤት አደባባይ የምትቆሙ። "},
	{3, "3 እግዚአብሔር ቸር ነውና እግዚአብሔርን አመስግኑ፤ ለስሙ ዘምሩ፥ መልካም ነውና፤ "},
	{4, "4 እግዚአብሔር ያዕቆብን ለራሱ፥ እስራኤልንም ለመዝገቡ መርጦታልና፤ "},
	{5, "5 እግዚአብሔር ታላቅ እንደ ሆነ፥ ጌታችንም ከአማልክት ሁሉ እንዲበልጥ አውቄአለሁና። "},
	{6, "6 በሰማይና በምድር በባሕርና በጥልቆች ሁሉ፥ እግዚአብሔር የወደደውን ሁሉ አደረገ። "},
	{7, "7 ከምድር ዳር ደመናትን ያወጣል፤ በዝናብ ጊዜ መብረቅን አደረገ፤ ነፋሳትንም ከመዛግብቱ ያወጣል። "},
	{8, "8 የግብጽን በኵር ልጆች ከሰው ጀምሮ እስከ እንስሳ ድረስ መታ። "},
	{9, "9 ግብጽ ሆይ፥ በመካከልሽ በፈርዖንና በባሪያዎቹ ሁሉ ላይ ተኣምራትንና ድንቅን ሰደደ። "},
	{10, "10 ብዙ አሕዛብን መታ፥ ብርቱዎችንም ነገሥታት ገደለ። "},
	{11, "11 የአሞራውያንን ንጉሥ ሴዎንን፥ የባሳንንም ንጉሥ ዐግን፥ የከነዓንን መንግሥታት ሁሉ ገደለ፤ "},
	{12, "12 ምድራቸውንም ርስት አድርጎ ለእስራኤል ለሕዝቡ ርስት ሰጠ። "},
	{13, "13 አቤቱ፥ ስምህ ለዘላለም ነው፥ ዝክርህም ለልጅ ልጅ ነው፤ "},
	{14, "14 እግዚአብሔር ለሕዝቡ ይፈርዳልና፥ ባሪያዎቹንም ይረዳልና። "},
	{15, "15 የአሕዛብ ጣዖታት የብርና የወርቅ፥ የሰው እጅ ሥራ ናቸው። "},
	{16, "16 አፍ አላቸው፥ አይናገሩምም፤ ዓይን አላቸው፥ አያዩምም፤ "},
	{17, "17 ጆሮ አላቸው፥ አይሰሙምም፤ እስትንፋስም በአፋቸው የለም። "},
	{18, "18 የሚሠሩአቸው ሁሉ የሚታመኑባቸውም ሁሉ እንደ እነርሱ ይሁን። "},
	{19, "19 የእስራኤል ቤት ሆይ፥ እግዚአብሔርን ባርኩት። የአሮን ቤት ሆይ፥ እግዚአብሔርን ባርኩት፤ "},
	{20, "20 የሌዊ ቤት ሆይ፥ እግዚአብሔርን ባርኩት እግዚአብሔርን የምትፈሩት ሆይ፥ እግዚአብሔርን ባርኩት። "},
	{21, "21 በኢየሩሳሌም የሚያድር እግዚአብሔር ከጽዮን የተባረከ ነው። ሃሌ ሉያ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view136() {
struct am136 poems[] = {
	{1, "1 እግዚአብሔርን አመስግኑ፤ ቸር ነውና፥ ምሕረቱ ለዘላለም ነውና። "},
	{2, "2 የአማልክትን አምላክ አመስግኑ፤ ምሕረቱ ለዘላለም ነውና። "},
	{3, "3 የጌቶችን ጌታ አመስግኑ፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{4, "4 እርሱ ብቻውን ታላቅ ተኣምራትን ያደረገ፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{5, "5 ሰማያትን በብልሃት የሠራ፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{6, "6 ምድርን በውኃ ላይ ያጸና፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{7, "7 ብቻውን ታላላቅ ብርሃናትን የሠራ፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{8, "8 ለፀሐይ ቀንን ያስገዛው፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{9, "9 ለጨረቃና ለከዋክብትም ሌሊትን ያስገዛቸው፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{10, "10 ከበኵራቸው ጋር ግብጽን የመታ፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{11, "11 እስራኤልንም ከመካከላቸው ያወጣ፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{12, "12 በጸናች እጅ በተዘረጋችም ክንድ፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{13, "13 የኤርትራን ባሕር በየክፍሉ የከፈለ፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{14, "14 እስራኤልን በመካከሉ ያሳለፈ፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{15, "15 ፈርዖንንና ሠራዊቱን በኤርትራ ባሕር የጣለ፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{16, "16 ሕዝቡን በምድረ በዳ የመራ፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{17, "17 ታላላቅ ነገሥታትን የመታ፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{18, "18 ብርቱዎችንም ነገሥታት የገደለ፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{19, "19 የአሞራውያንን ንጉሥ ሴዎንን፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{20, "20 የባሳንን ንጉሥ ዐግን፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{21, "21 ምድራቸውን ርስት አድርጎ የሰጠ፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{22, "22 ለባሪያው ለእስራኤል ርስት፤ ምሕረቱ ለዘላለም ነውና። "},
	{23, "23 እኛን በመዋረዳችን አስቦናልና፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{24, "24 ከጠላቶቻችንም እጅ አድኖናልና፤ ምሕረቱ ለዘላለም ነውና፤ "},
	{25, "25 ለሥጋ ሁሉ ምግብን የሚሰጥ፤ ምሕረቱ ለዘላለም ነውና። "},
	{26, "26 የሰማይን አምላክ አመስግኑ፤ ምሕረቱ ለዘላለም ነውና። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view137() {
struct am137 poems[] = {
	{1, "1 በባቢሎን ወንዞች አጠገብ በዚያ ተቀመጥን፤ ጽዮንንም ባሰብናት ጊዜ አለቀስን። "},
	{2, "2 በአኻያ ዛፎችዋ ላይ መሰንቆቻችንን ሰቀልን። "},
	{3, "3 የማረኩን በዚያ የዝማሬን ቃል ፈለጉብን፥ የወሰዱንም። የጽዮንን ዝማሬ ዘምሩልን አሉን። "},
	{4, "4 የእግዚአብሔርን ዝማሬ በባዕድ ምድር እንዴት እንዘምራለን? "},
	{5, "5 ኢየሩሳሌም ሆይ፥ ብረሳሽ፥ ቀኜ ትርሳኝ። "},
	{6, "6 ባላስብሽ፥ ምላሴ በጕሮሮዬ ይጣበቅ፤ ከደስታዬ ሁሉ በላይ ኢየሩሳሌምን ባልወድድ። "},
	{7, "7 አቤቱ፥ በኢየሩሳሌም ቀን የኤዶምን ልጆች አስብ። እስከ መሠረትዋ ድረስ አፍርሱ አፍርሱ ያሉአትን። "},
	{8, "8 አንቺ ወራዳ የባቢሎን ልጅ ሆይ፥ ስለ ተበቀልሽን የሚበቀልሽ የተመሰገነ ነው። "},
	{9, "9 ሕፃናቶችሽን ይዞ በዓለት ላይ የሚፈጠፍጣቸው የተመሰገነ ነው። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view138() {
struct am138 poems[] = {
	{1, "1 የዳዊት መዝሙር።1 አቤቱ፥ በፍጹም ልቤ አመሰግንሃለሁ፥ የአፌን ነገር ሰምተኸኛልና፤ በመላእክት ፊት እዘምርልሃለሁ። "},
	{2, "2 ወደ ቅዱስ መቅደስህ እሰግዳለሁ፤ ስለ ምሕረትህና ስለ እውነትህ ስምህንም አመሰግናለሁ፥ በሁሉ ላይ ቅዱስ ስምህን ከፍ ከፍ አድርገሃልና። "},
	{3, "3 በጠራሁህ ቀን በፍጥነት አድምጠኝ፤ ነፍሴን በኃይልህ በብዙ አጸናሃት። "},
	{4, "4 አቤቱ፥ የምድር ነገሥታት ሁሉ ያመሰግኑሃል፤ የአፍህን ቃል ሁሉ ሰምተዋልና። "},
	{5, "5 በእግዚአብሔርም መንገድ ይዘምራሉ፤ የእግዚአብሔር ክብር ታላቅ ነውና። "},
	{6, "6 እግዚአብሔር ከፍ ያለ ነውና፥ ወደ ችግረኞችም ይመለከታልና፤ ትዕቢተኞችንም ከሩቅ ያውቃል። "},
	{7, "7 በመከራ መካከል እንኳ ብሄድ፥ አንተ ሕያው ታደርገኛለህ፤ በጠላቶቼ ቍጣ ላይ እጆቼን ትዘረጋለህ፥ ቀኝህም ታድነኛለች። "},
	{8, "8 እግዚአብሔር ብድራትን ይመልስልኛል፤ አቤቱ፥ ምሕረትህ ለዘላለም ነው፤ አቤቱ፥ የእጅህን ሥራ ቸል አትበል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view139() {
struct am139 poems[] = {
	{1, "1 ለመዘምራን አለቃ፤ የዳዊት መዝሙር።1 አቤቱ፥ መረመርኸኝ፥ አወቅኸኝም። "},
	{2, "2 አንተ መቀመጤንና መነሣቴን አወቅህ፤ አሳቤን ሁሉ ከሩቅ አስተዋልህ። "},
	{3, "3 ፍለጋዬንና ዕረፍቴን አንተ መረመርህ፤ መንገዶቼን ሁሉ ቀድመህ አወቅህ፥ "},
	{4, "4 የዓመፃ ቃል በአንደበቴ እንደሌለ። "},
	{5, "5 አቤቱ፥ አንተ እነሆ የቀድሞውንና የኋላውን አወቅህ፤ አንተ ፈጠርኸኝ፥ እጅህንም በላዬ አደረግህ። "},
	{6, "6 እውቀትህ ከእኔ ይልቅ ተደነቀች፤ በረታች፥ ወደ እርስዋም ለመድረስ አልችልም። "},
	{7, "7 ከመንፈስህ ወዴት እሄዳለሁ? ከፊትህስ ወዴት እሸሻለሁ? "},
	{8, "8 ወደ ሰማይ ብወጣ፥ አንተ በዚያ አለህ። ወደ ሲኦልም ብወርድ፥ በዚያ አለህ። "},
	{9, "9 እንደ ንስር የንጋትን ክንፍ ብወስድ፥ እስከ ባሕር መጨረሻም ብበርር፥ "},
	{10, "10 በዚያ እጅህ ትመራኛለች፥ ቀኝህም ትይዘኛለች። "},
	{11, "11 በውኑ ጨለማ ትሸፍነኛለች ብል፥ ሌሊት በዙሪያዬ ብርሃን ትሆናለች፤ "},
	{12, "12 ጨለማ በአንተ ዘንድ አይጨልምምና፥ ሌሊትም እንደ ቀን ታበራለችና፤ እንደ ጨለማዋ እንዲሁ ብርሃንዋ ነው። "},
	{13, "13 አቤቱ፥ አንተ ኵላሊቴን ፈጥረሃልና፥ በእናቴም ሆድ ሰውረኸኛል። "},
	{14, "14 ግሩምና ድንቅ ሆኜ ተፈጥሬአለሁና አመሰግንሃለሁ፤ ሥራህ ድንቅ ነው፥ ነፍሴም እጅግ ታውቀዋለች። "},
	{15, "15 እኔ በስውር በተሠራሁ ጊዜ፥ አካሌም በምድር ታች በተሠራ ጊዜ አጥንቶቼ ከአንተ አልተሰወሩም። "},
	{16, "16 ያልተሠራ አካሌን ዓይኖችህ አዩኝ፤ የተፈጠሩ ቀኖቼ ሁሉ አንድ ስንኳ ሳይኖር በመጽሐፍህ ተጻፉ። "},
	{17, "17 አቤቱ፥ አሳቦችህ በእኔ ዘንድ እንደ ምን እጅግ የተከበሩ ናቸው! ቍጥራቸውም እንደ ምን በዛ! "},
	{18, "18 ብቈጥራቸው ከአሸዋ ይልቅ ይበዛሉ፤ ተነሣሁም፥ እኔም ገና ከአንተ ጋር ነኝ። "},
	{19, "19 አቤቱ፥ አንተ ኃጢአተኞችን የምትገድል ከሆንህስ፥ የደም ሰዎች ሆይ፥ ከእኔ ፈቀቅ በሉ። "},
	{20, "20 በክፋት ይናገሩብሃልና፤ ጠላቶችህም በከንቱ ያምፁብሃል። "},
	{21, "21 አቤቱ፥ የሚጠሉህን እኔ የጠላሁ አይደለሁምን? ስለ ጠላቶችህም አልተሰቀቅሁምን? "},
	{22, "22 ፍጹም ጥል ጠላኋቸው፥ ጠላቶችም ሆኑኝ። "},
	{23, "23 አቤቱ፥ መርምረኝ ልቤንም እወቅ፤ ፍተነኝ መንገዴንም እወቅ፤ "},
	{24, "24 በደልንም በእኔ ውስጥ ብታገኝ እይ፤ የዘላለምንም መንገድ ምራኝ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view140() {
struct am140 poems[] = {
	{1, "1 ለመዘምራን አለቃ የዳዊት መዝሙር።1-2 አቤቱ፥ ከክፉ ሰው አድነኝ፥ በልባቸውም ክፉ ካሰቡ ከዓመፀኞች ሰዎች ጠብቀኝ፤ ቀኑን ሁሉ ለሰልፍ ይከማቻሉ። "},
	{2, "3 ምላሳቸውን እንደ እባብ ሳሉ፤ ከከንፈራቸው በታች የእፉኝት መርዝ ነው። "},
	{3, "4 አቤቱ፥ ከኃጢአተኞች እጅ ጠብቀኝ፥ እርምጃዬንም ሊያሰናክሉ ከመከሩ ከዓመፀኞች አድነኝ። "},
	{4, "5 ትዕቢተኞች ወጥመድን ሰወሩብኝ፥ ለእግሮቼም የወጥመድ ገመድን ዘረጉ፤ በመንገድ ዕንቅፋትን አኖሩ። "},
	{5, "6 እግዚአብሔርንም። አንተ አምላኬ ነህ፤ የልመናዬን ቃል፥ አቤቱ፥ አድምጥ አልሁት። "},
	{6, "7 አቤቱ፥ ጌታዬ፥ የመድኃኒቴ ጕልበት፥ በሰልፍ ቀን ራሴን ሸፈንህ። "},
	{7, "8 አቤቱ፥ ከምኞቴ የተነሣ ለኃጢአተኞች አትስጠኝ፤ በላዬ ተማከሩ፤ እንዳይጓደዱ አትተወኝ። "},
	{8, "9 የሚከብቡኝን ራስ የከንፈራቸው ክፋት ይክደናቸው። "},
	{9, "10 የእሳት ፍም በላያቸው ይውደቅ፤ እንዳይነሡም ወደ እሳትና ወደ ማዕበል ይጣሉ። "},
	{10, "11 ተናጋሪ ሰው በምድር ውስጥ አይጸናም፤ ዓመፀኛን ሰው ክፋት ለጥፋት ይፈልገዋል። "},
	{11, "12 እግዚአብሔር ለድሀ ዳኝነትን ለችግረኛም ፍርድን እንዲያደርግ አወቅሁ። "},
	{12, "13 ጻድቃንም በእውነት ስምህን ያመሰግናሉ፤ ቀኖችም በፊትህ ይኖራሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view141() {
struct am141 poems[] = {
	{1, "1 የዳዊት መዝሙር።1 አቤቱ፥ ወደ አንተ ጮኽሁ፤ ስማኝ፤ ወደ አንተ ስጮኽም የልመናዬን ቃል አድምጥ። "},
	{2, "2 ጸሎቴን በፊትህ እንደ ዕጣን ተቀበልልኝ፥ እጅ መንሣቴም እንደ ሠርክ መሥዋዕት ትሁን። "},
	{3, "3 አቤቱ፥ ለአፌ ጠባቂ አኑር፥ የከንፈሮቼንም መዝጊያ ጠብቅ። "},
	{4, "4 ልቤን ወደ ክፉ ነገር አትመልሰው፥ ዓመፃን ከሚያደርጉ ሰዎች ጋር ለኃጢአት ምክንያት እንዳልሰጥ፤ ከምርጦቻቸውም ጋር አልተባበር። "},
	{5, "5 ጻድቅ በምሕረት ይገሥጸኝ፥ ይዝለፈኝም፥ የኃጢአተኛ ዘይት ግን ራሴን አይቅባ፤ ጸሎቴ ገና በክፋታቸው ላይ ነውና። "},
	{6, "6 ኃያላኖቻቸው በዓለት አጠገብ ተጣሉ፤ ጣፋጭ ናትና ቃሌን ይሰማሉ። "},
	{7, "7 በምድር ላይ እንደ ተሰነጠቀ እንደ መሬት ጓል፥ እንዲሁ አጥንቶቻችን በሲኦል ተበተኑ። "},
	{8, "8 አቤቱ ጌታ፥ ዓይኖቼ ወደ አንተ ናቸውና፤ በአንተ ታመንሁ፥ ነፍሴን አታውጣት። "},
	{9, "9 ከሰወሩብኝ ወጥመድ፥ ዓመፅንም ከሚያደርጉ ሰዎች ዕንቅፋት ጠብቀኝ። "},
	{10, "10 እኔ ብቻዬን እስካልፍ ድረስ ኃጢአተኞች በወጥመዳቸው ይውደቁ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view142() {
struct am142 poems[] = {
	{1, "1 ጸሎት፤ በዋሻ በነበረ ጊዜ፤ የዳዊት ትምህርት።1 በቃሌ ወደ እግዚአብሔር ጮኽሁ፤ በቃሌ ወደ እግዚአብሔር ለመንሁ። "},
	{2, "2 ልመናዬን በፊቱ አፈስሳለሁ፤ መከራዬንም በፊቴ እናገራለሁ። "},
	{3, "3 ነፍሴ በውስጤ ባለቀች ጊዜ መንገዴን አወቅሁ፤ በምሄድባት በዚያች መንገድ ወጥመድን ሰወሩብኝ። "},
	{4, "4 ወደ ቀኝ ተመለከትሁ አየሁም፥ የሚያውቀኝም አጣሁ፤ መሸሸጊያም የለኝም፥ ስለ ነፍሴም የሚመራመር የለም። "},
	{5, "5 አቤቱ፥ ወደ አንተ ጮኽሁ። አንተ ተስፋዬ ነህ፥ በሕያዋንም ምድር አንተ እድል ፈንታዬ ነህ አልሁ። "},
	{6, "6 እጅግ ተቸግሬአለሁና ወደ ልመናዬ አድምጥ፤ በርትተውብኛልና ከሚያሳድዱኝ አድነኝ። "},
	{7, "7 አቤቱ፥ ስምህን አመሰግን ዘንድ፤ ነፍሴን ከወህኒ አውጣት፤ ዋጋዬን እስክትሰጠኝ ድረስ ጻድቃን እኔን ይጠብቃሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view143() {
struct am143 poems[] = {
	{1, "1 ልጁ ባሳደደው ጊዜ፤ የዳዊት መዝሙር።1 አቤቱ፥ ጸሎቴን ስማ፤ በእውነትህ ልመናዬን አድምጥ፥ በጽድቅህም መልስልኝ። "},
	{2, "2 ሕያው ሁሉ በፊትህ ጻድቅ አይደለምና ከባሪያህ ጋር ወደ ፍርድ አትግባ። "},
	{3, "3 ጠላትህ ነፍሴን አሳድዶአታል፥ ሕይወቴንም በምድር ውስጥ አጐስቍሎአታል፤ ቀድሞ እንደ ሞተ ሰው በጨለማ አኑሮኛል። "},
	{4, "4 ነፍሴ በውስጤ አለቀችብኝ፥ ልቤም በውስጤ ደነገጠብኝ። "},
	{5, "5 የቀድሞውን ዘመን አሰብሁ፥ ሥራህንም ሁሉ አሰላሰልሁ፤ የእጅህንም ሥራ ተመለከትሁ። "},
	{6, "6 እጆቼን ወደ አንተ ዘረጋሁ፤ ነፍሴም እንደ ምድረ በዳ አንተን ተጠማች። "},
	{7, "7 አቤቱ፥ ፈጥነህ ስማኝ፤ ነፍሴ አልቃለች፤ ፊትህን ከኔ አትመልስ፥ ወደ ጕድጓድም እንደሚወርዱ አልሁን። "},
	{8, "8 አንተን ታምኛለሁና በማለዳ ምሕረትህን አሰማኝ፤ አቤቱ፥ ነፍሴን ወደ አንተ አንሥቻለሁና የምሄድበትን መንገድ አስታውቀኝ። "},
	{9, "9 አቤቱ፥ ወደ አንተ ተማፅኛለሁና ከጠላቶቼ አድነኝ። "},
	{10, "10 አንተ አምላኬ ነህና ፈቃድህን ለማድረግ አስተምረኝ፤ ቅዱስ መንፈስህም በጽድቅ ምድር ይምራኝ። "},
	{11, "11 አቤቱ፥ ስለ ስምህ ሕያው አድርገኝ፤ በጽድቅህም ነፍሴን ከመከራዋ አውጣት። "},
	{12, "12 በምሕረትህ ጠላቶቼን ደምስሳቸው፥ እኔ ባሪያህ ነኝና ነፍሴን የሚያስጨንቁአትን ሁሉ አጥፋቸው። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view144() {
struct am144 poems[] = {
	{1, "1 ስለ ጎልያድ፤ የዳዊት መዝሙር።1 እግዚአብሔር አምላኬ ይባረክ፥ ለእጆቼ ሰልፍን፥ ለጣቶቼም ዘመቻን የሚያስተምር፤ "},
	{2, "2 መሓሪዬና መሸሸጊያዬ፥ መጠጊያዬና መድኃኒቴ፤ ረዳቴና መታመኛዬም፤ ሕዝቤንም ከእኔ በታች የሚያስገዛልኝ። "},
	{3, "3 አቤቱ፥ እርሱን ታውቀው ዘንድ ሰው ምንድር ነው? ታስብለት ዘንድ የሰው ልጅ ምንድር ነው? "},
	{4, "4 ሰው ከንቱን ነገር ይመስላል፤ ዘመኑ እንደ ጥላ ያልፋል። "},
	{5, "5 አቤቱ፥ ሰማዮችህን ዝቅ ዝቅ አድርጋቸው ውረድም፤ ተራሮችን ዳስሳቸው ይጢሱም። "},
	{6, "6 መብረቆችህን ብልጭ አድርጋቸው በትናቸውም፤ ፍላጾችህን ላካቸው አስደንግጣቸውም። "},
	{7, "7 -8 እጅህን ከአርያም ላክ አድነኝም ከብዙ ውኆች፥ አፋቸውም ምናምንን ከሚናገር፥ ቀኛቸው የሐሰት ቀኝ ከሆነ፥ ከባዕድ ልጆች እጅ አስጥለኝ። "},
	{8, "9 አቤቱ፥ አዲስ ቅኔ እቀኛልሃለሁ፤ አሥር አውታር ባለው በገና እዘምርልሃለሁ። "},
	{9, "10 ለነገሥታት መድኃኒትን የሚሰጥ፥ ባሪያውን ዳዊትን ከክፉ ሰይፍ የሚያድነው እርሱ ነው። "},
	{10, "11 አድነኝ፥ አፋቸውም ምናምንን ከሚናገር፥ ቀኛቸውም የሐሰት ቀኝ ከሆነ፥ ከባዕድ ልጆች እጅ አስጥለኝ። "},
	{11, "12 ልጆቻቸው በጕልማስነታቸው እንደ አዲስ አትክልት የሆኑ፥ ሴቶች ልጆቻቸውም እንደ እልፍኝ ያማሩና ያጌጡ፤ "},
	{12, "13 ዕቃ ቤቶቻቸውም የተሞሉ በየዓይነቱ ዕቃ የሚሰጡ፥ በጎቻቸውም ብዙ የሚወልዱ፥ በማሰማርያቸውም የሚበዙ፥ "},
	{13, "14 ላሞቻቸውም የሚሰቡ፤ ቅጥራቸውም መፍረሻና መውጫ የሌለው፥ በአደባባዮቻቸውም ዋይታ የሌለ፤ "},
	{14, "15 እንደዚህ የሚሆን ሕዝብ የተመሰገነ ነው፤ እግዚአብሔር አምላኩ የሆነ ሕዝብ ምስጉን ነው። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view145() {
struct am145 poems[] = {
	{1, "1 የዳዊት የምስጋና መዝሙር።1 አምላኬ ንጉሤ ሆይ፥ ከፍ ከፍ አደርግሃለሁ፥ ስምህንም ለዘላለም ዓለምም እባርካለሁ። "},
	{2, "2 በየቀኑ ሁሉ እባርክሃለሁ፥ ስምህንም ለዘላለም ዓለምም አመሰግናለሁ። "},
	{3, "3 እግዚአብሔር ታላቅ ነው እጅግም የተመሰገነ ነው፤ ለታላቅነቱም ፍጻሜ የለውም። "},
	{4, "4 ትውልደ ትውልድ ሥራህን ያመሰግናሉ፥ ኃይልህንም ያወራሉ። "},
	{5, "5 የቅድስናህን ግርማ ክብር ይናገራሉ፥ ተኣምራትህንም ይነጋገራሉ። "},
	{6, "6 የግርማህንም ኃይል ይናገራሉ፥ ታላቅነትህንም ይነጋገራሉ፥ ብርታትህንም ይነጋገራሉ። "},
	{7, "7 የቸርነትህን ብዛት መታሰብ ያወጣሉ፥ በጽድቅህም ሐሤትን ያደርጋሉ። "},
	{8, "8 እግዚአብሔር ርኅሩኅና መሓሪ ነው፥ ከቍጣ የራቀ፥ ምሕረቱም ብዙ ነው፤ "},
	{9, "9 እግዚአብሔር ለሚታገሡት ቸር ነው። ምሕረቱም በሥራው ሁሉ ላይ ነው። "},
	{10, "10 አቤቱ፥ ሥራህ ሁሉ ያመሰግኑሃል፥ ቅዱሳንህም ይባርኩሃል። "},
	{11, "11 የመንግሥትህን ክብር ይናገራሉ፥ ኃይልህንም ይነጋገራሉ፥ "},
	{12, "12 ለሰው ልጆች ኃይልህን የመንግሥትህንም ግርማ ክብር ያስታውቁ ዘንድ "},
	{13, "13 መንግሥትህ የዘላለም መንግሥት ናት፥ ግዛትህም ለልጅ ልጅ ነው። "},
	{14, "14 እግዚአብሔር በቃሎቹ የታመነ ነው፥ በሥራውም ሁሉ ጻድቅ ነው፤ እግዚአብሔር የተፍገመገሙትን ሁሉ ይደግፋቸዋል፥ የወደቁትንም ያነሣቸዋል። "},
	{15, "15 የሁሉ ዓይን አንተን ተስፋ ያደርጋል፤ አንተም ምግባቸውን በየጊዜው ትሰጣቸዋለህ። "},
	{16, "16 አንተ እጅህን ትከፍታለህ፥ ሕይወት ላለውም ሁሉ መልካምን ታጠግባለህ። "},
	{17, "17 እግዚአብሔር በመንገዱ ሁሉ ጻድቅ ነው በሥራውም ሁሉ ቸር ነው። "},
	{18, "18 እግዚአብሔር ለሚጠሩት ሁሉ፥ በእውነት ለሚጠሩት ሁሉ ቅርብ ነው። "},
	{19, "19 ለሚፈሩት ምኞታቸውን ያደርጋል፥ ልመናቸውንም ይሰማል ያድናቸዋልም። "},
	{20, "20 እግዚአብሔር የሚወድዱትን ሁሉ ይጠብቃል፤ ኃጢአተኞችንም ሁሉ ያጠፋል። "},
	{21, "21 አፌ የእግዚአብሔርን ምስጋና ይናገራል፤ ሥጋም ሁሉ ለዘላለም ዓለም የተቀደሰውን ስሙን ይባርክ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view146() {
struct am146 poems[] = {
	{1, "1 የሐጌና የዘካርያስ መዝሙር።1 ሃሌ ሉያ። ነፍሴ ሆይ፥ እግዚአብሔርን አመስግኚ። "},
	{2, "2 በሕይወቴ እግዚአብሔርን አመሰግናለሁ፤ በምኖርበት ዘመን ሁሉ ለአምላኬ እዘምራለሁ። "},
	{3, "3 ማዳን በማይችሉ በሰው ልጆችና በአለቆች አትታመኑ። "},
	{4, "4 ነፍሱ ትወጣለች ወደ መሬቱም ይመለሳል፤ ያን ጊዜ ምክሩ ሁሉ ይጠፋል። "},
	{5, "5 የያዕቆብ አምላክ ረዳቱ የሆነ ተስፋውም በአምላኩ በእግዚአብሔር የሆነ ሰው ምስጉን ነው፤ "},
	{6, "6 እርሱም ሰማይንና ምድርን ባሕርንም፥ በእነርሱ ያለውንም ሁሉ የፈጠረ፤ እውነትን ለዘላለም የሚጠብቅ፤ "},
	{7, "7 ለተበደሉት የሚፈርድ፥ ለተራቡ ምግብን የሚሰጥ ነው። እግዚአብሔር የታሰሩትን ይፈታል፤ "},
	{8, "8 እግዚአብሔር የወደቁትን ያነሣል፤ እግዚአብሔር ዕውሮችን ጥበበኞች ያደርጋቸዋል፤ እግዚአብሔር ጻድቃንን ይወድዳል፤ "},
	{9, "9 እግዚአብሔር ስደተኞችን ይጠብቃል፤ ድሀ አደጎችንና ባልቴቶችን ይቀበላል፤ የኃጢአተኞችንም መንገድ ያጠፋል። "},
	{10, "10 እግዚአብሔር ለዘላለም ይነግሣል፤ ጽዮን ሆይ፥ አምላክሽ ለልጅ ልጅ ነው። ሃሌ ሉያ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view147() {
struct am147 poems[] = {
	{1, "1 የሐጌና የዘካርያስ መዝሙር።1 እግዚአብሔርን አመስግኑ፥ መዝሙር መልካም ነውና። ለአምላካችን ምስጋና ያማረ ነው። "},
	{2, "2 እግዚአብሔር ኢየሩሳሌምን ይሠራል፥ ከእስራኤልም የተበተኑትን ይሰበስባል። "},
	{3, "3 ልባቸውን የቈሰሉትን ይፈውሳል፥ ሕማማቸውንም ይጠግናል። "},
	{4, "4 የከዋክብትንም ብዛት ይቈጥራል፥ ሁሉንም በየስማቸው ይጠራቸዋል። "},
	{5, "5 ጌታችን ታላቅ ነው፥ ኃይሉም ታላቅ ነው፥ ለጥበቡም ቍጥር የለውም። "},
	{6, "6 እግዚአብሔር የዋሃንን ያነሣል፥ ኃጢአተኞችን ግን እስከ ምድር ድረስ ያዋርዳል። "},
	{7, "7 ለእግዚአብሔር በምስጋና ዘምሩ፥ ለአምላካችንም በመሰንቆ ዘምሩ፤ "},
	{8, "8 ሰማዩን በደመናት ይሸፍናል ለምድርም ዝናብን ያዘጋጃል፤ ሣርን በተራሮች ላይ ያበቅላል፤ ለምለሙንም ለሰው ልጆች ጥቅም። "},
	{9, "9 ለሚጠሩት ለቍራዎች ጫጩቶች ለእንስሶችም ምግባቸውን ይሰጣል። "},
	{10, "10 የፈረስን ኃይል አይወድድም፥ በሰውም ጭን አይደሰትም። "},
	{11, "11 እግዚአብሔር በሚፈሩት፥ በምሕረቱም በሚታመኑት ይደሰታል። "},
	{12, "12 ኢየሩሳሌም ሆይ፥ እግዚአብሔርን አመስግኚ፥ "},
	{13, "13 ጽዮንም ሆይ፥ ለአምላክሽ እልል በዪ፤ የደጆችሽን መወርወሪያ አጽንቶአልና፥ ልጆችንም በውስጥሽ ባርኮአልና። "},
	{14, "14 በወሰንሽም ሰላምን አደረገ፥ የስንዴንም ስብ አጠገበሽ። "},
	{15, "15 ነገሩን ወደ ምድር ይሰድዳል፥ ቃሉም እጅግ ፈጥኖ ይሮጣል። "},
	{16, "16 አመዳዩን እንደ ባዘቶ ይሰጣል፤ ጉሙን እንደ አመድ ይበትነዋል፤ "},
	{17, "17 በረዶውን እንደ ፍርፋሪ ያወርዳል፤ በበረዶውስ ፊት ማን ይቆማል? "},
	{18, "18 ቃሉን ልኮ ያቀልጠዋል፤ ነፋሱን ያነፍሳል፥ ውኆችንም ያፈስሳል። "},
	{19, "19 ቃሉን ለያዕቆብ፥ ሥርዓቱንና ፍርዱን ለእስራኤል ይናገራል። "},
	{20, "20 ለሌሎች አሕዛብ ሁሉ እንዲህ አላደረገም፥ ፍርዱንም አልገለጠላቸውም። ሃሌ ሉያ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view148() {
struct am148 poems[] = {
	{1, "1 የሐጌና የዘካርያስ መዝሙር።1 ሃሌ ሉያ። እግዚአብሔርን ከሰማያት አመስግኑት፤ በአርያም አመስግኑት። "},
	{2, "2 መላእክቱ ሁሉ፥ አመስግኑት፤ ሠራዊቱ ሁሉ፥ አመስግኑት። "},
	{3, "3 ፀሐይና ጨረቃ፥ አመስግኑት፤ ከዋክብትና ብርሃን ሁሉ፥ አመስግኑት። "},
	{4, "4 ሰማየ ሰማያት፥ አመስግኑት የሰማያት በላይም ውኃ። "},
	{5, "5 እርሱ ብሎአልና፥ ሆኑም፤ እርሱም አዝዞአልና፥ ተፈጠሩም፤ የእግዚአብሔርን ስም ያመስግኑት። "},
	{6, "6 ለዘላለም ዓለም አቆማቸው፤ ትእዛዝን ሰጠ፥ አያልፉምም። "},
	{7, "7 እባቦች ጥልቆችም ሁሉ፥ እግዚአብሔርን ከምድር አመስግኑት፤ "},
	{8, "8 እሳትና በረዶ አመዳይና ውርጭ፥ ቃሉን የሚያደርግ ዐውሎ ነፋስም፤ "},
	{9, "9 ተራሮች ኰረብቶችም ሁሉ፥ የሚያፈራም ዛፍ ዝግባም ሁሉ፤ "},
	{10, "10 አራዊትም እንስሳትም ሁሉ፥ ተንቀሳቃሾችም የሚበርሩ ወፎችም፤ "},
	{11, "11 የምድር ነገሥታት አሕዛብም ሁሉ፥ አለቆች የምድርም ፈራጆች ሁሉ፥ "},
	{12, "12 ጕልማሶችና ቈነጃጅቶች፥ ሽማግሌዎችና ልጆች፤ "},
	{13, "13 የእግዚአብሔርን ስም ያመስግኑ፤ ስሙ ብቻውን ከፍ ከፍ ብሎአልና፥ ምስጋናውም በሰማይና በምድር ላይ ነው። "},
	{14, "14 የሕዝቡንም ቀንድ ከፍ ከፍ ያደርጋል፤ የቅዱሳኑንም ሁሉ ምስጋና ወደ እርሱ ለቀረበ ለእስራኤል ልጆች ሕዝብ ከፍ ከፍ ያደርጋል። ሃሌ ሉያ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view149() {
struct am149 poems[] = {
	{1, "1 ሃሌ ሉያ። ለእግዚአብሔር አዲሱን ቅኔ ተቀኙለት፤ ምስጋናው በቅዱሳኑ ጉባኤ ነው። "},
	{2, "2 እስራኤል በፈጣሪው ደስ ይበለው፥ የጽዮንም ልጆች በንጉሣቸው ሐሤትን ያድርጉ። "},
	{3, "3 ስሙን በዘፈን ያመስግኑ፥ በከበሮና በመሰንቆም ይዘምሩለት። "},
	{4, "4 እግዚአብሔር በሕዝቡ ተደስቶአልና፥ የዋሃንንም በማዳኑ ከፍ ከፍ ያደርጋልና። "},
	{5, "5 ቅዱሳን በክብር ይመካሉ፤ በምንጣፋቸውም ላይ ሐሤትን ያደርጋሉ። "},
	{6, "6 የእግዚአብሔር ምስጋና በጕሮሮአቸው ነው፤ ሁለት አፍ ያለውም ሰይፍ በእጃቸው ነው፥ "},
	{7, "7 በአሕዛብ ላይ በቀልን በሰዎችም መካከል ቅጣትን ያደርጉ ዘንድ፤ "},
	{8, "8 ንጉሦቻቸውን በሰንሰለት፥ አለቆቻቸውንም በእግር ብረት ያስሩ ዘንድ፤ "},
	{9, "9 የተጻፈውን ፍርድ ያደርጉባቸው ዘንድ። ለቅዱሳን ሁሉ ይህች ክብር ናት። ሃሌ ሉያ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view150() {
struct am150 poems[] = {
	{1, "1 ሃሌ ሉያ። እግዚአብሔርን በመቅደሱ አመስግኑት፤ በኃይሉ ጠፈር አመስግኑት። "},
	{2, "2 በችሎቱ አመስግኑት፤ በታላቅነቱ ብዛት አመስግኑት። "},
	{3, "3 በመለከት ድምፅ አመስግኑት፤ በበገናና በመሰንቆ አመስግኑት። "},
	{4, "4 በከበሮና በዘፈን አመስግኑት፤ በአውታርና በእምቢልታ አመስግኑት። "},
	{5, "5 ድምፁ መልካም በሆነ ጸናጽል አመስግኑት፤ እልልታ ባለው ጸናጽል አመስግኑት። "},
	{6, "6 እስትንፋስ ያለው ሁሉ እግዚአብሔርን ያመስግን። ሃሌ ሉያ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};