#include <map>
#include <string>
class Bible28
{
	struct am1	{ int val; const char *msg; };
	struct am2	{ int val; const char *msg; };
	struct am3	{ int val; const char *msg; };
	struct am4	{ int val; const char *msg; };
	struct am5	{ int val; const char *msg; };
	struct am6	{ int val; const char *msg; };
	struct am7	{ int val; const char *msg; };
	struct am8	{ int val; const char *msg; };
	struct am9	{ int val; const char *msg; };
	struct am10	{ int val; const char *msg; };
	struct am11	{ int val; const char *msg; };
	struct am12	{ int val; const char *msg; };
	struct am13	{ int val; const char *msg; };
	struct am14	{ int val; const char *msg; };
public:
static void view1() {
struct am1 poems[] = {
	{1, "1 ፤ በይሁዳ ነገሥታት በዖዝያንና በኢዮአታም በአካዝና በሕዝቅያስም ዘመን በእስራኤልም ንጉሥ በዮአስ ልጅ በኢዮርብዓም ዘመን ወደ ብኤሪ ልጅ ወደ ሆሴዕ የመጣ የእግዚአብሔር ቃል ይህ ነው። "},
	{2, "2 ፤ እግዚአብሔር መጀመሪያ በሆሴዕ በተናገረ ጊዜ፥ እግዚአብሔር ሆሴዕን። ምድሪቱ ከእግዚአብሔር ርቃ ታላቅ ግልሙትና ታደርጋለችና ሂድ፤ ጋለሞታን ሴትና የግልሙትናን ልጆች ለአንተ ውሰድ አለው። "},
	{3, "3 ፤ እርሱም ሄዶ የዴቤላይምን ልጅ ጎሜርን አገባ፤ እርስዋም ፀነሰች ወንድ ልጅንም ወለደችለት። "},
	{4, "4 ፤ እግዚአብሔርም። ከጥቂት ዘመን በኋላ የኢይዝራኤልን ደም በኢዩ ቤት ላይ እበቀላለሁና፥ ከእስራኤልም ቤት መንግሥትን እሽራለሁና ስሙን ኢይዝራኤል ብለህ ጥራው፤ "},
	{5, "5 ፤ በዚያም ቀን በኢይዝራኤል ሸለቆ ውስጥ የእስራኤልን ቀስት እሰብራለሁ አለው። "},
	{6, "6 ፤ ደግሞ ፀነሰች ሴት ልጅንም ወለደች። እግዚአብሔርም። ይቅር እላቸው ዘንድ የእስራኤልን ቤት ከእንግዲህ ወዲህ አልምርምና ስምዋን ሎሩሃማ ብለህ ጥራት፤ "},
	{7, "7 ፤ ነገር ግን የይሁዳን ቤት እምራለሁ፤ በአምላካቸውም በእግዚአብሔር አድናቸዋለሁ እንጂ በቀስት ወይም በሰይፍ ወይም በሰልፍ ወይም በፈረሶች ወይም በፈረሰኞች አላድናቸውም አለው። "},
	{8, "8 ፤ ሎሩሃማም ጡት ባስጣለች ጊዜ፥ ደግሞ ፀነሰች ወንድ ልጅንም ወለደች። "},
	{9, "9 ፤ እግዚአብሔርም። ሕዝቤ አይደላችሁምና፥ እኔም አምላክ አልሆናችሁምና ስሙን ሎዓሚ ብለህ ጥራው አለው። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct am2 poems[] = {
	{1, "1 ፤ የእስራኤልም ልጆች ቍጥር እንደማይሰፈርና እንደማይቈጠር እንደ ባሕር አሸዋ ይሆናል፤ እንዲህም ይሆናል፤ እናንተ ሕዝቤ አይደላችሁም ተብሎ በተነገረበት በዚያ ስፍራ የሕያው አምላክ ልጆች ይባላሉ። "},
	{2, "2 ፤ የይሁዳ ልጆችና የእስራኤል ልጆች በአንድነት ይሰበሰባሉ፥ ለእነርሱም አንድ አለቃ ይሾማሉ፥ ከምድሪቱም ይወጣሉ፤ የኢይዝራኤል ቀን ታላቅ ይሆናልና። "},
	{3, "3 ፤ ወንድሞቻችሁን። ዓሚ፥ እኅቶቻችሁንም። ሩሃማ በሉአቸው። "},
	{4, "4 ፤ እናታችሁ ሚስቴ አይደለችምና፥ እኔም ባልዋ አይደለሁምና ተምዋገቱ፤ ከእናታችሁ ጋር ተምዋገቱ። ግልሙትናዋን ከፊትዋ፥ ምንዝርናዋንም ከጡቶችዋ መካከል ታስወግድ፤ "},
	{5, "5 ፤ ዕራቁትዋን እንዳልገፍፋት፥ እንደ ተወለደችበትም ቀን እንዳላደርጋት፥ እንደ ምድረ በዳና እንደ ደረቅ ምድር እንዳላደርጋት፥ በጥማትም እንዳልገድላት፤ "},
	{6, "6 ፤ የግልሙትናዋ ልጆች ናቸውና ልጆችዋን አልምርም። "},
	{7, "7 ፤ እናታቸው አመንዝራለች፤ የፀነሰቻቸውም። እንጀራዬንና ውኃዬን፥ ጥጤንና የተልባ እግሬን፥ ዘይቴንና መጠጤን ከሚሰጡኝ ከውሽሞቼ በኋላ እሄዳለሁ ብላ አስነወረቻቸው። "},
	{8, "8 ፤ ስለዚህ፥ እነሆ፥ መንገድሽን በእሾህ እዘጋለሁ፥ መንገድዋንም እንዳታገኝ ቅጥርን እቀጥርባታለሁ። "},
	{9, "9 ፤ ውሽሞችዋንም ትከተላለች፥ ነገር ግን አትደርስባቸውም፤ ትፈልጋቸውማለች፥ ነገር ግን አታገኛቸውም፤ እርስዋም። ከዛሬ ይልቅ የዚያን ጊዜ ይሻለኝ ነበርና ተመልሼ ወደ ቀደመው ባሌ እሄዳለሁ ትላለች። "},
	{10, "10 ፤ እርስዋም እህልንና ወይንን ጠጅ ዘይትንም የሰጠኋት፥ ለበኣልም የተሠራውን ብርና ወርቅ ያበዛሁላት እኔ እንደ ሆንሁ አላወቀችም። "},
	{11, "11 ፤ ስለዚህ እህሌን በጊዜዋ፥ ወይን ጠጄንም በወረትዋ እወስዳለሁ፥ ዕራቁትነትዋንም እንዳትሸፍን ጥጤንና የተልባ እግሬን እገፍፋታለሁ። "},
	{12, "12 ፤ አሁንም ውሽሞችዋ እያዩ ነውርዋን እገልጣለሁ፤ ከእጄም ማንም አያድናትም። "},
	{13, "13 ፤ ደስታዋንም ሁሉ፥ በዓላቶችዋንም፥ መባቻዎችዋንም፥ ሰንበቶችዋንም፥ የተቀደሱትንም ጉባኤዎችን ሁሉ አስቀራለሁ። "},
	{14, "14 ፤ እርስዋም። ውሽሞቼ የሰጡኝ ዋጋዬ ይህ ነው ያለችውን ወይንዋንና በለስዋን አጠፋለሁ፤ ዱርም አደርገዋለሁ፥ የምድረ በዳም አራዊት ይበሉታል። "},
	{15, "15 ፤ እኔን ረስታ ውሽሞችዋን እየተከተለች፥ በጕትቾችዋና በጌጥዋም እያጌጠች ለበኣሊም ያጠነችበትን ወራት እበቀልባታለሁ፥ ይላል እግዚአብሔር። "},
	{16, "16 ፤ ስለዚህ፥ እነሆ፥ አባብላታለሁ፥ ወደ ምድረ በዳም አመጣታለሁ፥ ለልብዋም እናገራለሁ። "},
	{17, "17 ፤ ከዚያም የወይን ቦታዋን፥ የተስፋ በርም እንዲሆንላት የአኮርን ሸለቆ እሰጣታለሁ፤ በዚያም ከግብጽ ምድር እንደ ወጣችበት ቀን እንደ ሕፃንነትዋ ወራት ትዘምራለች። "},
	{18, "18 ፤ በዚያ ቀን ባሌ ብለሽ ትጠሪኛለሽ እንጂ ዳግመኛ በኣሌ ብለሽ አትጠሪኝም፥ ይላል እግዚአብሔር፤ "},
	{19, "19 ፤ የበኣሊምን ስም ከአፍዋ አስወግደዋለሁና፥ በስማቸውም እንግዲህ አይታሰቡምና። "},
	{20, "20 ፤ በዚያም ቀን ከምድር አራዊትና ከሰማይ ወፎች ከመሬትም ተንቀሳቃሾች ጋር ቃል ኪዳን አደርግላቸዋለሁ፤ ቀስትንና ሰይፍን ሰልፍንም ከምድሩ እሰብራለሁ፥ ተከልለውም እንዲኖሩ አስተኛቸዋለሁ። "},
	{21, "21 ፤ ለዘላለምም ለእኔ እንድትሆኚ አጭሻለሁ፤ በጽድቅና በፍርድ በምሕረትና በርኅራኄ አጭሻለሁ። "},
	{22, "22 ፤ ለእኔም እንድትሆኚ በመታመን አጭሻለሁ፤ አንቺም እግዚአብሔርን ታውቂአለሽ። "},
	{23, "23 ፤ በዚያንም ቀን እመልሳለሁ፥ ይላል እግዚአብሔር፤ ለሰማይ እመልሳለሁ፥ ሰማይም ለምድር ይመልሳል፤[24]፤ ምድርም ለእህልና ለወይን ጠጅ ለዘይትም ትመልሳለች፤ እነርሱም ለኢይዝራኤል ይመልሳሉ።[25]፤ በምድርም ላይ ለእኔ እዘራታለሁ፤ ምሕረትም የሌላትን እምራለሁ፥ ሕዝቤም ያልሆነውን። አንተ ሕዝቤ ነህ እለዋለሁ፤ እርሱም። አንተ አምላኬ ነህ ይለኛል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct am3 poems[] = {
	{1, "1 ፤ እግዚአብሔርም። የእስራኤል ልጆች ወደ ሌሎች አማልክት ቢመለሱና የዘቢብ ጥፍጥፍን ቢወድዱ እንኳ፥ እግዚአብሔር እንደሚወድዳቸው አንተም ውሽማዋን የምትወድደውን አመንዝራይትን ሴት ውደድ አለኝ። "},
	{2, "2 ፤ እኔም በአሥራ አምስት ብርና በአንድ ቆሮስ መስፈሪያ ተኩል ገብስ ገዛኋት። "},
	{3, "3 ፤ ከእኔ ጋር ብዙ ወራት ተቀመጪ፥ አታመንዝሪም፥ ለሌላ ሰውም አትሁኚ፤ እኔም እንዲሁ እሆንልሻለሁ አልኋት። "},
	{4, "4 ፤ የእስራኤል ልጆች ያለ ንጉሥና ያለ አለቃ፥ ያለ መሥዋዕትና ያለ ዓምድ፥ ያለ ኤፉድና ያለ ተራፊም ብዙ ወራት ይቀመጣሉና፤ "},
	{5, "5 ፤ ከዚያም በኋላ የእስራኤል ልጆች ተመልሰው አምላካቸውን እግዚአብሔርንና ንጉሣቸውን ዳዊትን ይፈልጋሉ፤ በኋለኛውም ዘመን ፈርተው ወደ እግዚአብሔርና ወደ በረከቱ ይመጣሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct am4 poems[] = {
	{1, "1 ፤ እናንተ የእስራኤል ልጆች ሆይ፥ እውነትና ምሕረት እግዚአብሔርንም ማወቅ በምድር ስለሌለ እግዚአብሔር በምድሩ ላይ ከሚኖሩ ጋር ክርክር አለውና የእግዚአብሔርን ቃል ስሙ። "},
	{2, "2 ፤ እርግማንና ሐሰት ግዳይና ስርቆት ምንዝርናም ወጥተዋል፤ ደምም ወደ ደም ደርሶአል። "},
	{3, "3 ፤ ስለዚህ ምድሪቱ ታለቅሳለች፥ በእርስዋም የሚቀመጡ ሁሉ ከምድር አራዊትና ከሰማይ ወፎች ጋር ይደክማሉ፤ የባሕሩም ዓሦች ያልቃሉ። "},
	{4, "4 ፤ ነገር ግን ሕዝብህ ከካህን ጋር እንደሚከራከሩ ናቸውና ማንም አይከራከር፥ ማንም አይዝለፍ። "},
	{5, "5 ፤ በቀንም ትሰናከላለህ፥ ነቢዩም ከአንተ ጋር በሌሊት ይሰናከላል፤ እናትህንም አጠፋታለሁ። "},
	{6, "6 ፤ ሕዝቤ እውቀት ከማጣቱ የተነሣ ጠፍቶአል፤ አንተም እውቀትን ጠልተሃልና እኔ ካህን እንዳትሆነኝ እጠላሃለሁ፤ የአምላክህንም ሕግ ረስተሃልና እኔ ደግሞ ልጆችህን እረሳለሁ። "},
	{7, "7 ፤ እንደ ብዛታቸው መጠን ኃጢአት ሠሩብኝ፤ እኔም ክብራቸውን ወደ ነውር እለውጣለሁ። "},
	{8, "8 ፤ የሕዝቤም ኃጢአት መብል ሆኖላቸዋል፥ ልባቸውንም ወደ በደላቸው አድርገዋል። "},
	{9, "9 ፤ እንደ ሕዝቡም እንዲሁ ካህኑ ይሆናል፤ በመንገዳቸውም እበቀላቸዋለሁ፥ ሥራቸውንም እመልስባቸዋለሁ። "},
	{10, "10 ፤ እግዚአብሔርንም መጠበቅ ትተዋልና ሲበሉ አይጠግቡም፥ ሲያመነዝሩም አይበዙም። "},
	{11, "11 ፤ ግልሙትናና የወይን ጠጅ ስካርም አእምሮን ያጠፋል። "},
	{12, "12 ፤ የግልሙትና መንፈስ ሕዝቤን አስቶአቸዋልና፥ እነርሱም ከአምላካቸው ርቀው አመንዝረዋልና በትራቸውን ይጠይቃሉ፥ ዘንጋቸውም ይመልስላቸዋል። "},
	{13, "13 ፤ በተራሮችም ራስ ላይ ይሠዋሉ፤ ጥላውም መልካም ነውና ከኮምበልና ከልብን ከአሆማም ዛፍ በታች በኮረብቶች ላይ ያጥናሉ፤ ስለዚህ ሴቶች ልጆቻችሁ ይገለሙታሉ፥ ሙሽሮቻችሁም ያመነዝራሉ። "},
	{14, "14 ፤ ወንዶችም ደግሞ ከጋለሞቶች ጋር ይጫወታሉና፥ ከጋለሞቶችም ጋር ይሠዋሉና ሴቶች ልጆቻችሁ በገለሞቱ ጊዜ፥ ሙሽሮቻችሁም ባመነዘሩ ጊዜ አልቀጣቸውም፤ የማያስተውልም ሕዝብ ይገለበጣል። "},
	{15, "15 ፤ እስራኤል ሆይ፥ አንተ ብታመነዝር ይሁዳ አይበድል፤ እናንተም ወደ ጌልገላ አትግቡ፥ ወደ ቤትአዌንም አትውጡ፥ ወይም። ሕያው እግዚአብሔርን! ብላችሁ አትማሉ። "},
	{16, "16 ፤ እስራኤል እንደ እልከኛ ጊደር እንቢ ብሎአል፤ እግዚአብሔርስ በሰፊው ቦታ እንደ ጠቦት ያሰማራዋልን? "},
	{17, "17 ፤ ኤፍሬም ከጣዖታት ጋር ተጋጠመ፤ ተወው። "},
	{18, "18 ፤ ስካርን ፈጽመዋል፥ ግልሙትናንም አብዝተዋል፤ አለቆችዋም ነውርን እጅግ ወደዱ። "},
	{19, "19 ፤ ነፋስ በክንፍዋ አስሮአታል፤ ከመሥዋዕታቸውም የተነሣ ያፍራሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct am5 poems[] = {
	{1, "1 ፤ ካህናት ሆይ፥ ይህን ስሙ፤ የእስራኤል ቤት ሆይ፥ አድምጡ፤ የንጉሥ ቤት ሆይ፥ ልብ አድርጉ፤ በምጽጳ ላይ ወጥመድ፥ በታቦርም ላይ የተዘረጋ አሽክላ ሆናችኋልና ፍርድ በእናንተ ላይ ነው። "},
	{2, "2 ፤ ዓመፀኞችም እርድ አብዝተዋል፤ እኔ ግን እነዚያን ሁሉ እዘልፋለሁ። "},
	{3, "3 ፤ ኤፍሬምን አውቀዋለሁ፥ እስራኤልም ከእኔ አልተሰወረም፤ ኤፍሬም ሆይ፥ ዛሬ አመንዝረሃል፥ እስራኤልም ረክሶአል። "},
	{4, "4 ፤ ወደ አምላካቸው ይመለሱ ዘንድ ሥራቸውን አላቀኑም፤ የግልሙትና መንፈስ በውስጣቸው አለና፤ እግዚአብሔርንም አላውቁምና። "},
	{5, "5 ፤ የእስራኤልም ትዕቢት በፊቱ ይመሰክራል፤ ስለዚህ እስራኤልና ኤፍሬም በኃጢአታቸው ይሰናከላሉ፤ ይሁዳም ደግሞ ከእነሱ ጋር ይሰናከላል። "},
	{6, "6 ፤ እግዚአብሔርንም ለመሻት በጎቻቸውንና ላሞቻቸውን ነድተው ይሄዳሉ፤ ነገር ግን እርሱ ከእነርሱም ተመልሶአልና አያገኙትም። "},
	{7, "7 ፤ ዲቃሎችን ልጆች ወልደዋልና እግዚአብሔርን ወንጅለዋል፤ አሁንም አንድ ወር እነርሱንና ርስታቸውን ይበላቸዋል። "},
	{8, "8 ፤ በጊብዓ መለከትን፥ በራማ እንቢልታን ንፉና። ብንያም ሆይ፥ ከአንተ በኋላ እያላችሁ በቤትአዌን ላይ እሪ በሉ። "},
	{9, "9 ፤ ኤፍሬም በዘለፋ ቀን የፈረሰ ይሆናል። በእስራኤል ነገዶች ዘንድ በእርግጥ የሚሆነውን ነገር ገልጫለሁ። "},
	{10, "10 ፤ የይሁዳ አለቆች ድምበርን እንደሚነቅሉ ሆነዋል፤ እኔም መዓቴን እንደ ውኃ አፈስስባቸዋለሁ። "},
	{11, "11 ፤ ኤፍሬም ከትእዛዝ በኋላ መሄድን ወድዶአልና የተገፋና በፍርድ የተጐዳ ሆኖአል። "},
	{12, "12 ፤ እኔም ለኤፍሬም እንደ ብል፥ ለይሁዳም ቤት እንደ ነቀዝ ሆኜአለሁ። "},
	{13, "13 ፤ ኤፍሬምም ደዌውን፥ ይሁዳም ቍስሉን ባየ ጊዜ ኤፍሬም ወደ አሦር ሄደ ወደ ንጉሡም ወደ ኢያሪም መልእክተኛን ላከ፤ እርሱ ግን ይፈውሳችሁ ዘንድ፥ ከቊስላችሁም ያድናችሁ ዘንድ አልቻለም። "},
	{14, "14 ፤ እኔም ለኤፍሬም እንደ አንበሳ፥ ለይሁዳም ቤት እንደ አንበሳ ደቦል እሆናለሁና፤ እኔም ነጥቄ እሄዳለሁ እወስድማለሁ፥ የሚያድንም አይገኝም። "},
	{15, "15 ፤ በደላቸውንም እስኪያውቁ ድረስ፥ ፊቴንም እስኪሹ ድረስ ሄጄ ወደ ስፍራዬ እመለሳለሁ፤ በመከራቸው ጊዜ እጅግ አድርገው ፊቴን ይፈልጋሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct am6 poems[] = {
	{1, "1 ፤ ኑ፥ ወደ እግዚአብሔር እንመለስ፤ እርሱ ሰብሮናልና፥ እርሱም ይፈውሰናል፤ እርሱ መትቶናል፥ እርሱም ይጠግነናል። "},
	{2, "2 ፤ ከሁለት ቀን በኋላ ያድነናል፤ በሦስተኛውም ቀን ያስነሣናል፥ በፊቱም በሕይወት እንኖራለን። "},
	{3, "3 ፤ እንወቅ፤ እናውቀውም ዘንድ እግዚአብሔርን እንከተል፤ እንደ ወገግታም ተዘጋጅቶ እናገኘዋለን፤ እንደ ዝናብም ምድርንም እንደሚያጠጣ እንደ መጨረሻ ዝናብ ይመጣል። "},
	{4, "4 ፤ ምሕረታችሁ እንደ ማለዳ ደመና፥ በማለዳም እንደሚያልፍ ጠል ነውና ኤፍሬም ሆይ፥ ምን ላድርግልህ? ይሁዳ ሆይ፥ ምን ላድርግልህ? "},
	{5, "5 ፤ ስለዚህ በነቢያት እጅ ቈረጥኋቸው፥ በአፌም ቃል ገደልኋቸው፤ ፍርዴም እንደ ብርሃን ይወጣል። "},
	{6, "6 ፤ ከመሥዋዕት ይልቅ ምሕረትን፥ ከሚቃጠልም መሥዋዕት ይልቅ እግዚአብሔርን ማወቅ እወድዳለሁና። "},
	{7, "7 ፤ እነርሱ ግን እንደ አዳም ቃል ኪዳንን ተላልፈዋል፤ በዚያም ላይ ወንጅለውኛል። "},
	{8, "8 ፤ ገለዓድ ኃጢአትን የሚሠሩ ሰዎች ከተማ፥ በደምም የተቀባ ነው። "},
	{9, "9 ፤ ለሰውም እንደሚያደቡ ወንበዴዎች፥ እንዲሁ የካህናት ወገኖች በሴኬም መንገድ ላይ ይገድላሉ፤ ሴሰኝነትንም ያደርጋሉ። "},
	{10, "10 ፤ በእስራኤል ቤት የሚያስፈራን ነገር አይቻለሁ፤ በዚያ በኤፍሬም ውስጥ ግልሙትና ተገኘ፥ እስራኤልም ረክሶአል። "},
	{11, "11 ፤ ይሁዳ ሆይ፥ የሕዝቤን ምርኮ በምመልስበት ጊዜ ለአንተ ደግሞ መከር ተወስኖልሃል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct am7 poems[] = {
	{1, "1 ፤ በሐሰት አድርገዋልና፥ ሌባም ገብቶአልና፥ በውጭም ወንበዴዎች ቀምተዋልና እስራኤልን እፈውስ ዘንድ በወደድሁ ጊዜ የኤፍሬም ኃጢአትና የሰማርያ ክፋት ተገለጠ። "},
	{2, "2 ፤ እኔም ክፋታቸውን ሁሉ እንዳሰብሁ በልባቸው አያስቡም አሁንም ሥራቸው ከብባቸዋለች፥ በፊቴም አለች። "},
	{3, "3 ፤ ንጉሡን በክፋታቸው፥ አለቆቹንም በሐሰታቸው ደስ አሰኝተዋል። "},
	{4, "4 ፤ ሁሉም አመንዝራዎች ናቸው፤ ጋጋሪ እንደሚያነድድበት እንደ ምድጃ ናቸው፤ ሁሉ እስኪቦካ ድረስ እሳትን መቈስቈስና እርሾን መለወስ ይቆያል። "},
	{5, "5 ፤ በንጉሣችን ቀን አለቆች ከወይን ጠጅ ሙቀት የተነሣ ታመሙ፤ እርሱም ከዋዘኞች ጋር እጁን ዘረጋ። "},
	{6, "6 ፤ እያደቡ ልባቸውን እንደ ምድጃ አዘጋጅተዋል፤ አበዛቸውም ሌሊቱን ሁሉ አንቀላፋ፤ በጠባም ጊዜ እንደ እሳት ነበልባል ይነድዳል። "},
	{7, "7 ፤ ሁሉም እንደ ምድጃ ግለዋል፥ ፈራጆቻቸውንም በሉ፤ ነገሥታቶቻቸውም ሁሉ ወደቁ፤ ከእነርሱም ወደ እኔ የሚጮኽ የለም። "},
	{8, "8 ፤ ኤፍሬም ከአሕዛብ ጋር ተደባለቀ፤ ኤፍሬም እንዳልተገላበጠ ቂጣ ነው። "},
	{9, "9 ፤ እንግዶች ጕልበቱን በሉት፥ እርሱም አላወቀም፤ ሽበትም ወጣበት፥ እርሱም አላወቀም። "},
	{10, "10 ፤ የእስራኤልም ትዕቢቱ በፊቱ መሰከረ፤ ወደ አምላካቸው ወደ እግዚአብሔር ግን አልተመለሱም፥ በዚህም ሁሉ አልፈለጉትም። "},
	{11, "11 ፤ ኤፍሬምም አእምሮ እንደሌላት እንደ ሰነፍ ርግብ ነው፤ ግብጽን ጠሩ፥ ወደ አሦርም ሄዱ። "},
	{12, "12 ፤ ሲሄዱ አሽክላዬን አዘረጋባቸዋለሁ፤ እንደ ሰማይ ወፎች አወርዳቸዋለሁ፤ መከራቸውን ሲሰሙ እገሥጻቸዋለሁ። "},
	{13, "13 ፤ ከእኔ ፈቀቅ ብለዋልና ወዮላቸው! በእኔም ላይ ዐመፀዋልና ጥፋት ይምጣባቸው! እኔ ልታደጋቸው ወደድሁ፥ እነርሱ ግን በሐሰት ተናገሩብኝ። "},
	{14, "14 ፤ በመኝታቸው ላይ ሆነው ያለቅሱ ነበር እንጂ በልባቸው ወደ እኔ አልጮኹም፤ ስለ እህልና ስለ ወይን ጠጅ ይሰበሰቡ ነበር፤ በእኔም ላይ ዐመፁ። "},
	{15, "15 ፤ እኔም ክንዳቸውን አስተማርሁና አጸናሁ፤ እነርሱ ግን ክፉ ነገርን መከሩብኝ። "},
	{16, "16 ፤ ወደ ከንቱ ነገር ተመለሱ፤ እንደ ተንኰለኛ ቀስት ሆኑ፤ አለቆቻቸው ከምላሳቸው ቍጣ የተነሣ በሰይፍ ይወድቃሉ፤ ይህ በግብጽ ምድር ውስጥ መሳለቂያ ይሆንባቸዋል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct am8 poems[] = {
	{1, "1 ፤ መለከትን ወደ አፍህ አቅርብ፤ ቃል ኪዳኔን ተላልፈዋልና፥ በሕጌም ላይ ዐምፀዋልና በእግዚአብሔር ቤት ላይ እንደ ንስር ይመጣል። "},
	{2, "2 ፤ እነርሱም። አምላክ ሆይ፥ እኛ እስራኤል አወቅንህ ብለው ወደ እኔ ይጮኻሉ። "},
	{3, "3 ፤ እስራኤል ደግነትን ጥሎአል፤ ጠላትም ያሳድዱታል። "},
	{4, "4 ፤ ለራሳቸው ነገሥታትን አነገሡ፥ ከእኔም ዘንድ አይደለም፤ አለቆችንም አደረጉ፥ እኔም አላወቅሁም፤ ለጥፋታቸውም ከብራቸውና ከወርቃቸው፤ ጣዖታትን ለራሳቸው አደረጉ። "},
	{5, "5 ፤ ሰማርያ ሆይ፥ እምቦሳህን፤ ጥሎአል፤ ቍጣዬ በላያቸው ነድዶአል፤ እስከ መቼ ድረስ ንጹሕ ሊሆኑ አይችሉም? "},
	{6, "6 ፤ ይህ ደግሞ ከእስራኤል ዘንድ ነው፤ ሠራተኛ ሠራው፥ እርሱም አምላክ አይደለም፤ የሰማርያም እምቦሳ ይቈራረጣል። "},
	{7, "7 ፤ ነፍስን ዘርተዋል፥ ዐውሎ ነፍስንም ያጭዳሉ፤ አገዳ የለውም፥ ከፍሬውም ዱቄት አይገኝም፤ ቢገኝም እንግዶች ይበሉታል። "},
	{8, "8 ፤ እስራኤል ተውጦአል፥ በአሕዛብም መካከል ዛሬ እንደ ረከሰ ዕቃ ሆኖአል። "},
	{9, "9 ፤ ለብቻውም እንደሚቀመጥ እንደ ምድረ በዳ አህያ ወደ አሦር ወጥተዋል፤ ኤፍሬምም ወዳጆቹን በእጅ መንሻ ገዛ። "},
	{10, "10 ፤ ነገር ግን ለአሕዛብ እጅ መንሻ ቢሰጡ እኔ አሁን እሰበስባቸዋለሁ፤ ከንጉሥና ከአለቆችም ሸክም የተነሣ ይደክማሉ። "},
	{11, "11 ፤ ኤፍሬም ኃጢአትን ለመሥራት መሠዊያ አብዝቶአልና መሠዊያ ለኃጢአት ይሆንለታል። "},
	{12, "12 ፤ የሕጌን ብዛት ጽፌለታለሁ፤ እነርሱ ግን እንደ እንግዳ ነገር ቈጥረውታል። "},
	{13, "13 ፤ መሥዋዕቴን ያቀርባሉ፥ ሥጋንም ያርዳሉ፥ ይበላሉም፤ እግዚአብሔር ግን አይቀበላቸውም፤ በደላቸውንም ያስባል፥ ኃጢአታቸውንም ይቀጣል፤ እነርሱም ወደ ግብጽ ይመለሳሉ። "},
	{14, "14 ፤ እስራኤል ፈጣሪውን ረስቶአል፥ መስገጃዎችንም ሠርቶአል፤ ይሁዳም የተመሸጉትን ከተሞች አብዝቶአል፤ እኔ ግን በከተሞች ላይ እሳትን እሰድዳለሁ፥ አዳራሾችንም ትበላለች። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct am9 poems[] = {
	{1, "1 ፤ እስራኤል ሆይ፥ ከአምላክህ ተለይተህ አመንዝረሃልና እንደ አሕዛብ ደስ አይበልህ፥ ሐሴትንም አታድርግ፤ በእህሉ አውድማ ሁሉ ላይ የግልሙትናን ዋጋ ወድደሃል። "},
	{2, "2 ፤ አውድማውና መጥመቂያው አይመግባቸውም፥ ጉሽ ጠጅም ይጐድልባታል። "},
	{3, "3 ፤ በእግዚአብሔር ምድር ላይ አይቀመጡም፤ ኤፍሬምም ወደ ግብጽ ይመለሳል፥ በአሦርም ርኩስን ነገር ይበላሉ። "},
	{4, "4 ፤ ለእግዚአብሔርም የወይን ጠጅን ቁርባን አያፈስሱም፥ መሥዋዕታቸውም ደስ አያሰኘውም፤ የኀዘንም እንጀራ ይሆንላቸዋል፥ የሚበላውም ሁሉ ይረክሳል፤ እንጀራቸውም ለሰውነታቸው ይሆናል እንጂ ወደ እግዚአብሔር ቤት አይገባም። "},
	{5, "5 ፤ በዓመት በዓል ቀንና በእግዚአብሔር በዓል ቀን ምን ታደርጋላችሁ? "},
	{6, "6 ፤ እነሆ፥ ከጥፋት ሸሽተው ሄዱ፥ ግብጽም ትሰበስባቸዋለች፥ ሜምፎስም ትቀብራቸዋለች፤ ሳማም የብራቸውን ጌጥ ይወርሳል፥ እሾህም በድንኳኖቻቸው ውስጥ ይበቅላል። "},
	{7, "7 ፤ የበቀል ወራት መጥቶአል፥ የፍዳም ወራት ደርሶአል፥ እስራኤልም ያውቃል፤ ከኃጢአትህና ከጠላትነትህ ብዛት የተነሣ ነቢዩ ሰንፎአል፥ መንፈስም ያለበት ሰው አብዶአል። "},
	{8, "8 ፤ ኤፍሬም ከአምላኬ ጋር ተመልካች ነበረ፤ አሁን ግን ነቢዩ በመንገዱ ሁሉ ላይ የወፍ ወጥመድ ሆነ፥ በአምላኩም ቤት ጠላትነት አለ። "},
	{9, "9 ፤ በጊብዓ ዘመን እንደ ነበረ እጅግ ረከሱ፤ እርሱም በደላቸውን ያስባል፥ ኃጢአታቸውንም ይበቀላል። "},
	{10, "10 ፤ እስራኤልን በምድረ በዳ እንዳለ ወይን ሆኖ አገኘሁት፤ አባቶቻችሁንም ከመጀመሪያዋ ዓመት እንደ በለስ በkWraት ሆነው አየኋቸው፤ እነርሱ ግን ወደ ብዔልፌጎር መጡ፥ ለነውርም ተለዩ፥ እንደ ወደዱትም ርኩስ ሆኑ፥ "},
	{11, "11 ፤ የኤፍሬምም ክብር እንደ ወፍ በርሮ ይጠፋል፤ መውለድና መፅነስ ማርገዝም አይሆንላቸውም። "},
	{12, "12 ፤ ልጆቻቸውንም ቢያሳድጉ ሰው እንዳይቀርላቸው ልጅ አልባ አደረጋቸዋለሁ፤ ከእነርሱም በራቅሁ ጊዜ ወዮላቸው! "},
	{13, "13 ፤ እኔ እንዳየሁ የኤፍሬም ልጆች ለምርኮ ተሰጥተዋል፤ ኤፍሬምም ልጆቹን ወደ ገዳዩች ያወጣል። "},
	{14, "14 ፤ አቤቱ፥ ስጣቸው፤ ምን ትሰጣቸዋለህ? የሚጨነግፍን ማኅፀን የደረቀውንም ጡት ስጣቸው። "},
	{15, "15 ፤ ክፋታቸው ሁሉ በጌልገላ አለ፤ በዚያ ጠልቻቸዋለሁ፤ ስለ ሠሩት ክፋት ከቤቴ አሳድዳቸዋለሁ፤ ከእንግዲህ ወዲያ አልወድዳቸውም፤ አለቆቻቸው ሁሉ ዓመፀኞች ናቸው። "},
	{16, "16 ፤ ኤፍሬም ተመታ፥ ሥሩም ደረቀ፥ ፍሬም አያፈራም፤ ደግሞም ቢወልዱ የማኅፀናቸውን ፍሬ እገድላለሁ። "},
	{17, "17 ፤ አልሰሙትምና አምላኬ ይጥላቸዋል፤ በአሕዛብም መካከል ተቅበዝባዦች ይሆናሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct am10 poems[] = {
	{1, "1 ፤ እስራኤል ፍሬው የበዛለት የለመለመ ወይን ነው፤ እንደ ፍሬው ብዛት መሠዊያውን አብዝቶአል፤ እንደ ምድሩም ማማር መጠን ሐውልቶችን እያሳመሩ ሠርተዋል። "},
	{2, "2 ፤ ልባቸው ተከፈለ፤ አሁንም በደላቸውን ይሸከማሉ፤ እርሱ መሠዊያቸውን ያፈርሳል፥ ሐውልቶቻቸውን ያጠፋል። "},
	{3, "3 ፤ አሁንም። ንጉሥ የለንም፥ እግዚአብሔርን አልፈራንምና፤ ንጉሥስ ምን ያደርግልናል? ይላሉ። "},
	{4, "4 ፤ የማይረባውን ቃል ይናገራሉ፤ ቃል ኪዳን በገቡ ጊዜ በሐሰት ይምላሉ፤ ስለዚህ መርዛም ሣር በእርሻ ትልም ላይ እንደሚበቅል መቅሠፍት ይበቅልባቸዋል። "},
	{5, "5 ፤ የሰማርያ ሰዎች ስለ ቤትአዌን እምቦሳ ይፈራሉ፤ ክብሩም ከእርሱ ዘንድ ወጥቶአልና ሕዝቡ ያለቅሱለታል፥ የጣዖቱ ካህናትም በኀዘን ይንተባተባሉ። "},
	{6, "6 ፤ ለንጉሡ ለኢያሪም እጅ መንሻ ይሆን ዘንድ ወደ አሦር ይማረካል፤ ኤፍሬምን እፍረት ይይዘዋል፥ እስራኤልም በምክሩ ያፍራል። "},
	{7, "7 ፤ ሰማርያ ከንጉሥዋ ጋር በውኃ ላይ እንዳለ አረፋ ጠፍታለች። "},
	{8, "8 ፤ የእስራኤል ኃጢአት የሆኑት የአዌን የኮረብታው መስገጃዎች ይፈርሳሉ፤ እሾህና አሜከላ በመሠዊያዎቻቸው ላይ ይበቅላል፤ ተራሮችንም። ክደኑን፥ ኮረብቶችንም። ውደቁብን ይሉአቸዋል። "},
	{9, "9 ፤ እስራኤል ሆይ፥ ከጊብዓ ዘመን ጀምረህ ኃጢአትን ሠርተሃል፤ በዚያ ጸንተዋል፤ በጊብዓ ላይ ሰልፍ አይደርስባቸውምን? "},
	{10, "10 ፤ በፈቀድሁም ጊዜ እገሥጻቸዋለሁ፤ ስለ ሁለቱም ኃጢአታቸው በታሰሩ ጊዜ አሕዛብ ይሰበሰቡባቸዋል። "},
	{11, "11 ፤ ኤፍሬም ማበራየት እንደ ለመደች ጊደር ነው፥ እኔ ግን በአንገቱ ውበት እጫንበታለሁ፤ በኤፍሬም ላይ እጠምድበታለሁ፥ ይሁዳም ያርሳል፥ ያዕቆብም አፈሩን ያለሰልሳል። "},
	{12, "12 ፤ እግዚአብሔር መጥቶ ጽድቅን እስኪያዘንብላችሁ ድረስ እርሱን የምትሹበት ዘመን ነውና ለእናንተ በጽድቅ ዝሩ፥ እንደ ምሕረቱም መጠን እጨዱ፥ ጥጋታችሁንም እረሱ። "},
	{13, "13 ፤ ክፋትን አርሳችኋል፥ ኃጢአትንም አጭዳችኋል፥ የሐሰትንም ፍሬ በልታችኋል፤ በኃያላንህ ብዛት፥ በመንገድህም ላይ ታምነሃልና። "},
	{14, "14 ፤ በሕዝብህም መካከል ሽብር ይነሣል፤ እናትም ከልጆችዋ ጋር በተፈጠፈጠች ጊዜ ሰልማን ቤትአርብኤልን በሰልፍ ቀን እንዳፈረሰ፥ አምባዎችህ ሁሉ ይፈርሳሉ። "},
	{15, "15 ፤ ከኃጢአታችሁም ክፋት የተነሣ ቤቴል እንዲሁ ያደርግባችኋል፤ በነጋ ጊዜ የእስራኤል ንጉሥ ፈጽሞ ይጠፋል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct am11 poems[] = {
	{1, "1 ፤ እስራኤል ሕፃን በነበረ ጊዜ ወደድሁት፥ ልጄንም ከግብጽ ጠራሁት። "},
	{2, "2 ፤ አብዝቼ ብጠራቸው አጥብቀው ከፊቴ ራቁ፤ ለበኣሊምም ይሠዉ ነበር፥ ለተቀረጹ ምስሎችም ያጥኑ ነበር። "},
	{3, "3 ፤ እኔም ኤፍሬምን ክንዱን ይዤ በእግሩ እንዲሄድ መራሁት፤ እኔም እፈውሳቸው እንደ ነበርሁ አላወቁም። "},
	{4, "4 ፤ በሰው ገመድ በፍቅርም እስራት ሳብኋቸው፤ ለእነርሱም ቀምበርን ከጫንቃቸው ላይ እንደሚያነሣ ሆንሁ፥ ድርቆሽም ጣልሁላቸው። "},
	{5, "5 ፤ ወደ እኔ ይመለሱ ዘንድ አልወደዱምና ወደ ግብጽ ምድር ይመለሳሉ፥ አሦርም ንጉሣቸው ይሆናል። "},
	{6, "6 ፤ ከመከሩትም ምክር የተነሣ ሰይፍ በከተሞቻቸው ላይ ይወድቃል፥ ከበርቴዎችንም ያጠፋል። "},
	{7, "7 ፤ ሕዝቤም ከእኔ ይመለሱ ዘንድ ወደዱ፤ ወደ ላይም ቢጠሩአቸው ማንም ከፍ ከፍ ያደርጋቸው ዘንድ አይችልም። "},
	{8, "8 ፤ ኤፍሬም ሆይ፥ እንዴት እጥልሃለሁ? እስራኤል ሆይ፥ እንዴትስ አሳልፌ እሰጥሃለሁ? እንዴትስ እንደ አዳማ እጥልሃለሁ? እንዴትስ እንደ ሲባዮ አደርግሃለሁ? ልቤ በውስጤ ተናውጣለች፥ ምሕረቴም ተነሣሥታለች። "},
	{9, "9 ፤ እኔ አምላክ ነኝ እንጂ ሰው አይደለሁምና፥ በመካከልህም ቅዱሱ ነኝና የቁጣዬን መቅሠፍት አላደርግም፥ ኤፍሬምንም አጠፋ ዘንድ አልመለስም፤ በመዓትም አልመጣም። "},
	{10, "10 ፤ እግዚአብሔርን ይከተላሉ፥ እርሱም እንደ አንበሳ ያገሣል፤ ባገሣም ጊዜ ልጆች እየተንቀጠቀጡ ከምዕራብ ይመጣሉ። "},
	{11, "11 ፤ እንደ ወፍም ከግብጽ፥ እንደ ርግብም ከአሦር ምድር እየተንቀጠቀጡ ይመጣሉ፤ በቤታቸውም አኖራቸዋለሁ፥ ይላል እግዚአብሔር። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct am12 poems[] = {
	{1, "1 ፤ ኤፍሬም በሐሰት፥ የእስራኤልም ቤት በተንኰል ከበበኝ፤ ይሁዳም ከታመነው ቅዱሱ ከእግዚአብሔር ጋር አይጸናም። "},
	{2, "2 ፤ ኤፍሬም ነፋስን ይበላል፥ የምሥራቅንም ነፋስ ይከተላል፤ ሁልጊዜም ሐሰትንና ተንኰልን ያበዛል፤ ከአሦር ጋር ቃል ኪዳን ያደርጋሉ፥ ወደ ግብጽም ዘይት ይወስዳሉ። "},
	{3, "3 ፤ እግዚአብሔርም ደግሞ ከይሁዳ ጋር ክርክር አለው፥ ያዕቆብንም እንደ መንገዱ ይቀጣል፤ እንደ ሥራውም ይመልስለታል። "},
	{4, "4 ፤ በማኅፀን ውስጥ ወንድሙን በተረከዙ ያዘው፥ በጕልማስነቱም ጊዜ ከአምላክ ጋር ታገለ፤ "},
	{5, "5 ፤ ከመልአኩም ጋር ታግሎ አሸነፈ፤ አልቅሶም ለመነው። በቤቴልም አገኘው፥ በዚያም ከእኛ ጋር ተነጋገረ። "},
	{6, "6 ፤ እርሱም የሠራዊት አምላክ እግዚአብሔር ነው፤ የመታሰቢያው ስም እግዚአብሔር ነው። "},
	{7, "7 ፤ ስለዚህ ወደ አምላክህ ተመለስ፤ ምሕረትንና ፍርድን ጠብቅ፥ ዘወትርም በአምላክህ ታመን። "},
	{8, "8 ፤ ከከነዓን ወገን ነው፤ በእጁ የተንኰል ሚዛን አለ፥ ሽንገላንም ይወድዳል። "},
	{9, "9 ፤ ኤፍሬምም። ባለ ጠጋ ሆኜአለሁ፥ ሀብትንም አግኝቻለሁ፥ በድካሜም ሁሉ ኃጢአት የሚሆን በደል አይገኝብኝም አለ። "},
	{10, "10 ፤ እኔም ከግብጽ ጀምሬ አምላክህ እግዚአብሔር ነኝ፤ እንደ ዓመት በዓል ቀን እንደ ገና በድንኳን እንድትኖር አደርግሃለሁ። "},
	{11, "11 ፤ ለነቢያትም ተናግሬአለሁ፥ ራእይንም አብዝቻለሁ፤ በነቢያትም እጅ ምሳሌዎችን አውጥቻለሁ። "},
	{12, "12 ፤ ኃጢአት በገለዓድ አለ፤ ፈጽመው ከንቱ ናቸው፤ ወይፈኖች በጌልገላ ይሠዋሉ፥ መሠዊያዎቻቸውም በእርሻ ትልም ላይ የድንጋይ ክምር ይሆናሉ። "},
	{13, "13 ፤ ያዕቆብ ወደ ሶርያ አገር ሸሸ፥ እስራኤልም ስለ ሚስት አገለገለ፥ ስለ ሚስትም ጠባቂ ነበረ። "},
	{14, "14 ፤ እግዚአብሔርም በነቢይ እጅ እስራኤልን ከግብጽ አወጣ፥ በነቢይም እጅ ጠበቀው። "},
	{15, "15 ፤ ኤፍሬም አስመርሮ አስቈጣው፤ ስለዚህ ደሙ በላዩ ላይ ነው፤ ጌታውም ስድቡን በራሱ ላይ ይመልሳል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct am13 poems[] = {
	{1, "1 ፤ ኤፍሬም በተናገረ ጊዜ ፍርሃት ነበረ፥ በእስራኤልም ዘንድ ታበየ፤ ነገር ግን በኣልን በማምለክ በበደለ ጊዜ ሞተ። "},
	{2, "2 ፤ አሁንም ኃጢአትን ይሠሩ ዘንድ ጨመሩ፤ በብራቸውም ለራሳቸው ቀልጦ የተሠራ ምስልን፥ እንደ ጥበባቸውም ጣዖታትን ሠርተዋል፤ ሁሉም የሠራተኛ ሥራ ናቸው። ስለ እነርሱም። የሚሠዉ ሰዎች እምቦሳውን ይሳሙ ይላሉ። "},
	{3, "3 ፤ ስለዚህም እንደ ማለዳ ደመና፥ በጥዋትም እንደሚያልፍ ጠል፥ በዐውሎ ነፍስም ከአውድማ እንደሚበተን እብቅ፥ ከመስኮትም እንደሚወጣ ጢስ ይሆናሉ። "},
	{4, "4 ፤ እኔ ግን ከግብጽ ምድር ጀምሬ አምላክህ እግዚአብሔር ነኝ፤ ከእኔም በቀር ሌላ አምላክ አታውቅም፥ ከእኔም በቀር ሌላ መድኃኒት የለም። "},
	{5, "5 ፤ በምድረ በዳ፥ እጅግ በደረቀ ምድር አውቄህ ነበር። "},
	{6, "6 ፤ ከተሰማሩ በኋላ ጠገቡ፥ በጠገቡም ጊዜ ልባቸው ታበየ፤ ስለዚህ ረሱኝ። "},
	{7, "7 ፤ ስለዚህም እኔ እንደ አንበሳ ሆንሁባቸው፥ እንደ ነብርም በመንገድ አጠገብ አደባባቸዋለሁ፤ "},
	{8, "8 ፤ ልጅዋ እንደ ተነጠቀባት ድብ እገጥማቸዋለሁ፥ የልባቸውንም ስብ እቀድዳለሁ፤ በዚያም እንደ አንበሳ እበላቸዋለሁ፥ የምድረ በዳም አውሬ ይነጣጠቃቸዋል። "},
	{9, "9 ፤ እስራኤል ሆይ፥ በእኔ በረዳትህ ላይ በመነሣትህ ጥፋትህ ነው። "},
	{10, "10 ፤ በየከተማህ ሁሉ ያድንህ ዘንድ ንጉሥህ ወዴት አለ? ስለ እነርሱም። ንጉሥንና አለቆችን ስጠኝ ብለህ የተናገርኸው መሳፍንቶችህ ወዴት አሉ? "},
	{11, "11 ፤ በቍጣዬ ንጉሥን ሰጠሁህ፥ በመዓቴም ሻርሁት። "},
	{12, "12 ፤ የኤፍሬም በደል ታስሮአል፥ ኃጢአቱም ተከማችቶአል። "},
	{13, "13 ፤ ምጥ እንደ ያዛት ሴት ጭንቅ ይመጣበታል፤ በሚወለድበት ጊዜ በማኅፀን አፍ ቀጥ ብሎ አይወጣምና አእምሮ የሌለው ልጅ ነው። "},
	{14, "14 ፤ ከሲኦል እጅ እታደጋቸዋለሁ፥ ከሞትም እቤዣቸዋለሁ፤ ሞት ሆይ፥ ቸነፈርህ ወዴት አለ? ሲኦል ሆይ፥ ማጥፋትህ ወዴት አለ? ርኅራኄ ከዓይኔ ተሰወረች። "},
	{15, "15 ፤ በወንድሞቹ መካከል ፍሬያማ ቢሆን የምሥራቅ ነፋስ ይመጣል፥ የእግዚአብሔር ነፋስ ከምድረ በዳ ይመጣል፤ ምንጩንም ያደርቃል፥ ፈሳሹንም ያጠፋል፥ የተከበሩ ዕቃዎች ሁሉ ያሉበትን መዝገብ ይበዘብዛል። "},
	{16, "16 ፤ ሰማርያ በአምላክዋ ላይ ዐምፃለችና በደልዋን ትሸከማለች፤ በሰይፍ ይወድቃሉ፥ ሕፃኖቻቸውም ይፈጠፈጣሉ፥ እርጕዞቻቸውም ይቀደዳሉ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct am14 poems[] = {
	{1, "1 ፤ እስራኤል ሆይ፥ በኃጢአትህ ወድቀሃልና ወደ አምላክህ ወደ እግዚአብሔር ተመለስ። "},
	{2, "2 ፤ ከእናንተ ጋር ቃልን ውሰዱ፥ ወደ እግዚአብሔርም ተመልሳችሁ። ኃጢአትን ሁሉ አስወግድ፥ በቸርነትም ተቀበለን፥ በወይፈንም ፋንታ የከንፈራችንን ፍሬ እንሰጣለን። "},
	{3, "3 ፤ አሦር አያድነንም፤ በፈረስ ላይ አንቀመጥም፤ ድሀ አደጉም በአንተ ዘንድ ምሕረትን ያገኛልና ከእንግዲህ ወዲህ ለእጆቻችን ሥራ። አምላኮቻችን ናችሁ አንላቸውም በሉት። "},
	{4, "4 ፤ ቍጣዬ ከእርሱ ዘንድ ተመልሶአልና ዓመፃቸውን እፈውሳለሁ፥ በገዛ ፈቃዴ እወድዳቸዋለሁ። "},
	{5, "5 ፤ ለእስራኤልም እንደ ጠል እሆነዋለሁ፤ እንደ አበባም ያብባል፥ እንደ ሊባኖስም ሥሩን ይሰድዳል። "},
	{6, "6 ፤ ቅርንጫፎቹም ይዘረጋሉ፥ ውበቱም እንደ ወይራ፥ ሽታውም እንደ ሊባኖስ ይሆናል። "},
	{7, "7 ፤ ከጥላውም በታች የሚቀመጡ ይመለሳሉ፤ ከእህሉም የተነሣ ይጠግባሉ፤ እንደ ወይንም አረግ ያብባሉ፤ መታሰቢያውም እንደ ሊባኖስ ወይን ጠጅ ይሆናል። "},
	{8, "8 ፤ ከእንግዲህ ወዲያ ጣዖት ለኤፍሬም ምንድር ነው? እኔ ሰምቼዋለሁ፥ ወደ እርሱም እመለከታለሁ፤ እኔ እንደ ለመለመ ጥድ ነኝ፤ ፍሬህ በእኔ ዘንድ ይገኛል። "},
	{9, "9 ፤ ይህን ነገር የሚያስተውል ጠቢብ፥ የሚያውቃትም አስተዋይ ማን ነው? የእግዚአብሔር መንገድ ቅን ነው፥ ጻድቃንም ይሄዱበታል፤ ተላላፊዎች ግን ይወድቁበታል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};