#include <map>
#include <string>
class Bible61
{
	struct am1	{ int val; const char *msg; };
	struct am2	{ int val; const char *msg; };
	struct am3	{ int val; const char *msg; };
public:
static void view1() {
struct am1 poems[] = {
	{1, "1 የኢየሱስ ክርስቶስ ባሪያና ሐዋርያ የሆነ ስምዖን ጴጥሮስ፥ በአምላካችንና በመድኃኒታችን በኢየሱስ ክርስቶስ ጽድቅ ካገኘነው ጋር የተካከለ የክብር እምነትን ላገኙ፤ "},
	{2, "2 -3 የመለኮቱ ኃይል፥ በገዛ ክብሩና በበጎነቱ የጠራንን በማወቅ፥ ለሕይወትና እግዚአብሔርን ለመምሰል የሚሆነውን ነገር ሁሉ ስለ ሰጠን፥ በእግዚአብሔርና በጌታችን በኢየሱስ እውቀት ጸጋና ሰላም ይብዛላችሁ። "},
	{3, "4 ስለ ክፉ ምኞት በዓለም ካለው ጥፋት አምልጣችሁ ከመለኮት ባሕርይ ተካፋዮች በተስፋ ቃል እንድትሆኑ፥ በእነዚያ ክብርና በጎነት የተከበረና እጅግ ታላቅ የሆነ ተስፋን ሰጠን። "},
	{4, "5 ስለዚህም ምክንያት ትጋትን ሁሉ እያሳያችሁ በእምነታችሁ በጎነትን ጨምሩ፥ "},
	{5, "6 በበጎነትም እውቀትን፥ በእውቀትም ራስን መግዛት፥ ራስንም በመግዛት መጽናትን፥ በመጽናትም እግዚአብሔርን መምሰል፥ "},
	{6, "7 እግዚአብሔርንም በመምሰል የወንድማማችን መዋደድ፥ በወንድማማችም መዋደድ ፍቅርን ጨምሩ። "},
	{7, "8 እነዚህ ነገሮች ለእናንተ ሆነው ቢበዙ፥ በጌታችን በኢየሱስ ክርስቶስ እውቀት ሥራ ፈቶችና ፍሬ ቢሶች እንዳትሆኑ ያደርጉአችኋልና፤ "},
	{8, "9 እነዚህ ነገሮች የሌሉት ዕውር ነውና፥ በቅርብም ያለውን ብቻ ያያል፥ የቀደመውንም ኃጢአቱን መንጻት ረስቶአል። "},
	{9, "10 ስለዚህ፥ ወንድሞች ሆይ፥ መጠራታችሁንና መመረጣችሁን ታጸኑ ዘንድ ከፊት ይልቅ ትጉ፤ እነዚህን ብታደርጉ ከቶ አትሰናከሉምና። "},
	{10, "11 እንዲሁ ወደ ዘላለሙ ወደ ጌታችንና መድኃኒታችን ወደ ኢየሱስ ክርስቶስ መንግሥት መግባት በሙላት ይሰጣችኋልና። "},
	{11, "12 ስለዚህ እነዚህን ነገሮች ምንም ብታውቁ በእናንተም ዘንድ ባለ እውነት ምንም ብትጸኑ፥ ስለ እነዚህ ዘወትር እንዳሳስባችሁ ቸል አልልም። "},
	{12, "13 ሁልጊዜም በዚህ ማደሪያ ሳለሁ በማሳሰቤ ላነቃችሁ የሚገባኝ ይመስለኛል። "},
	{13, "14 ጌታችን ኢየሱስ ክርስቶስ እንዳመለከተኝ ከዚህ ማደሪያዬ መለየቴ ፈጥኖ እንዲሆን አውቃለሁና። "},
	{14, "15 ከመውጣቴም በኋላ እነዚህን ነገሮች እንድታስቡ በየጊዜው ትችሉ ዘንድ እተጋለሁ። "},
	{15, "16 የእርሱን ግርማ አይተን እንጂ በብልሃት የተፈጠረውን ተረት ሳንከተል የጌታችንን የኢየሱስ ክርስቶስን ኃይልና መምጣት አስታወቅናችሁ። "},
	{16, "17 ከገናናው ክብር። በእርሱ ደስ የሚለኝ የምወደው ልጄ ይህ ነው የሚል ያ ድምፅ በመጣለት ጊዜ ከእግዚአብሔር አብ ክብርንና ምስጋናን ተቀብሎአልና፤ "},
	{17, "18 እኛም በቅዱሱ ተራራ ከእርሱ ጋር ሳለን ይህን ድምፅ ከሰማይ ሲወርድ ሰማን። "},
	{18, "19 ከእርሱም ይልቅ እጅግ የጸና የትንቢት ቃል አለን፤ ምድርም እስኪጠባ ድረስ የንጋትም ኮከብ በልባችሁ እስኪወጣ ድረስ፥ ሰው በጨለማ ስፍራ የሚበራን መብራት እንደሚጠነቀቅ ይህን ቃል እየጠነቀቃችሁ መልካም ታደርጋላችሁ። "},
	{19, "20 ይህን በመጀመሪያ እወቁ፤ በመጽሐፍ ያለውን ትንቢት ሁሉ ማንም ለገዛ ራሱ ሊተረጉም አልተፈቀደም፤ "},
	{20, "21 ትንቢት ከቶ በሰው ፈቃድ አልመጣምና፥ ዳሩ ግን በእግዚአብሔር ተልከው ቅዱሳን ሰዎች በመንፈስ ቅዱስ ተነድተው ተናገሩ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct am2 poems[] = {
	{1, "1 ነገር ግን ሐሰተኞች ነቢያት ደግሞ በሕዝቡ መካከል ነበሩ እንዲሁም በመካከላችሁ ደግሞ ሐሰተኞች አስተማሪዎች ይሆናሉ፤ እነርሱም የዋጃቸውን ጌታ እንኳ ክደው የሚፈጥንን ጥፋት በራሳቸው ላይ እየሳቡ የሚያጠፋ ኑፋቄን አሹልከው ያገባሉ፤ "},
	{2, "2 ብዙዎችም በመዳራታቸው ይከተሉአቸዋል በእነርሱም ጠንቅ የእውነት መንገድ ይሰደባል። "},
	{3, "3 ገንዘብንም በመመኘት በተፈጠረ ነገር ይረቡባችኋል፤ ፍርዳቸውም ከጥንት ጀምሮ አይዘገይም ጥፋታቸውም አያንቀላፋም። "},
	{4, "4 እግዚአብሔር ኃጢአትን ላደረጉ መላእክት ሳይራራላቸው ወደ ገሃነም ጥሎ በጨለማ ጉድጓድ ለፍርድ ሊጠበቁ አሳልፎ ከሰጣቸው፥ "},
	{5, "5 ለቀደመውም ዓለም ሳይራራ ከሌሎች ሰባት ጋር ጽድቅን የሚሰብከውን ኖኅን አድኖ በኃጢአተኞች ዓለም ላይ የጥፋትን ውኃ ካወረደ፥ "},
	{6, "6 ኃጢአትንም ያደርጉ ዘንድ ላሉት ምሳሌ አድርጎ ከተማዎችን ሰዶምንና ገሞራን አመድ እስኪሆኑ ድረስ አቃጥሎና ገልብጦ ከፈረደባቸው፥ "},
	{7, "7 -8 ጻድቅ ሎጥም በመካከላቸው ሲኖር እያየና እየሰማ ዕለት ዕለት በዓመፀኛ ሥራቸው ጻድቅ ነፍሱን አስጨንቆ ነበርና በዓመፀኞች ሴሰኛ ኑሮ የተገፋውን ያን ጻድቅ ካዳነ፥ "},
	{8, "10 ጌታ እግዚአብሔርን የሚያመልኩትን ከፈተና እንዴት እንዲያድን፥ በደለኞችንም ይልቁንም በርኵስ ምኞት የሥጋን ፍትወት እየተከተሉ የሚመላለሱትን ጌትነትንም የሚንቁትን እየቀጣቸው ለፍርድ ቀን እንዴት እንዲጠብቅ ያውቃል። ደፋሮችና ኵሩዎች ሆነው ሥልጣን ያላቸውን ሲሳደቡ አይንቀጠቀጡም፤ "},
	{9, "11 ዳሩ ግን መላእክት በኃይልና በብርታት ከእነርሱ ይልቅ ምንም ቢበልጡ በጌታ ፊት በእነርሱ ላይ የስድብን ፍርድ አያመጡም። "},
	{10, "12 እነዚህ ግን ለመጠመድና ለመጥፋት በፍጥረታቸው እንደ ተወለዱ አእምሮ እንደ ሌላቸው እንስሶች ሆነው፥ በማያውቁት ነገር እየተሳደቡ በጥፋታቸው ይጠፋሉ፤ "},
	{11, "13 የዓመፃቸውን ደመወዝ ይቀበላሉ። በቀን ሲዘፍኑ እንደ ተድላ ይቆጥሩታል፤ ነውረኞችና ርኵሳን ሆነው ከእናንተ ጋር ሲጋበዙ በፍቅር ግብዣ ይዘፍናሉ፤ "},
	{12, "14 ምንዝር የሞላባቸው ኃጢአትንም የማይተዉ ዓይኖች አሉአቸው፤ የማይጸኑትን ነፍሳት ያታልላሉ፤ መመኘትን የለመደ ልብ አላቸው፤ የተረገሙ ናቸው። "},
	{13, "15 ቅንን መንገድ ትተው ተሳሳቱ፤ የባሶርን ልጅ የበለዓምን መንገድ ተከተሉ፤ እርሱ የዓመፃን ደመወዝ ወደደ፥ "},
	{14, "16 ነገር ግን ስለ መተላለፉ ተዘለፈ፤ ቃል የሌለው አህያ በሰው ቃል ተናግሮ የነቢዩን እብድነት አገደ። "},
	{15, "17 ድቅድቅ ጨለማ ለዘላለም የተጠበቀላቸው እነዚህ ውኃ የሌለባቸው ምንጮች በዐውሎ ነፋስም የተነዱ ደመናዎች ናቸው። "},
	{16, "18 ከንቱና ከመጠን ይልቅ ታላቅ የሆነውን ቃል ይናገራሉና፥ በስሕተትም ከሚኖሩት አሁን የሚያመልጡትን በሥጋ ሴሰኛ ምኞት ያታልላሉ። "},
	{17, "19 ራሳቸው የጥፋት ባሪያዎች ሆነው። አርነት ትወጣላችሁ እያሉ ተስፋ ይሰጡአቸዋል፤ ሰው ለተሸነፈበት ለእርሱ ተገዝቶ ባሪያ ነውና። "},
	{18, "20 በጌታችንና በመድኃኒታችን በኢየሱስ ክርስቶስ እውቀት ከዓለም ርኵሰት ካመለጡ በኋላ ዳግመኛ በእርስዋ ተጠላልፈው የተሸነፉ ቢሆኑ፥ ከፊተኛው ኑሮአቸው ይልቅ የኋለኛው የባሰ ሆኖባቸዋል። "},
	{19, "21 አውቀዋት ከተሰጣቸው ከቅድስት ትእዛዝ ከሚመለሱ የጽድቅን መንገድ ባላወቋት በተሻላቸው ነበርና። "},
	{20, "22 ውሻ ወደ ትፋቱ ይመለሳል፥ ደግሞ። የታጠበች እርያ በጭቃ ለመንከባለል ትመለሳለች እንደሚባል እውነተኞች ምሳሌዎች ሆኖባቸዋል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct am3 poems[] = {
	{1, "1 -2 ወዳጆች ሆይ፥ አሁን የምጽፍላችሁ መልእክት ይህች ሁለተኛይቱ ናት። በቅዱሳን ነቢያትም ቀድሞ የተባለውን ቃል በሐዋርያቶቻችሁም ያገኛችኋትን የጌታንና የመድኃኒትን ትእዛዝ እንድታስቡ በሁለቱ እያሳሰብኋችሁ ቅን ልቡናችሁን አነቃቃለሁ። "},
	{2, "3 በመጨረሻው ዘመን እንደ ራሳቸው ምኞት የሚመላለሱ ዘባቾች በመዘበት እንዲመጡ ይህን በፊት እወቁ፤ "},
	{3, "4 እነርሱም። የመምጣቱ የተስፋ ቃል ወዴት ነው? አባቶች ከሞቱባት ጊዜ፥ ከፍጥረት መጀመሪያ ይዞ ሁሉ እንዳለ ይኖራልና ይላሉ። "},
	{4, "5 ሰማያት ከጥንት ጀምረው ምድርም በእግዚአብሔር ቃል ከውኃ ተጋጥማ በውኃ መካከል እንደ ነበሩ ወደው አያስተውሉምና፤ "},
	{5, "6 በዚህም ምክንያት ያን ጊዜ የነበረ ዓለም በውኃ ሰጥሞ ጠፋ፤ "},
	{6, "7 አሁን ያሉ ሰማያትና ምድር ግን እግዚአብሔርን የማያመልኩት ሰዎች እስከሚጠፉበት እስከ ፍርድ ቀን ድረስ ተጠብቀው በዚያ ቃል ለእሳት ቀርተዋል። "},
	{7, "8 እናንተ ግን ወዳጆች ሆይ፥ በጌታ ዘንድ አንድ ቀን እንደ ሺህ ዓመት፥ ሺህ ዓመትም እንደ አንድ ቀን እንደ ሆነ ይህን አንድ ነገር አትርሱ። "},
	{8, "9 ለአንዳንዶች የሚዘገይ እንደሚመስላቸው ጌታ ስለ ተስፋ ቃሉ አይዘገይም፥ ነገር ግን ሁሉ ወደ ንስሐ እንዲደርሱ እንጂ ማንም እንዳይጠፋ ወዶ ስለ እናንተ ይታገሣል። "},
	{9, "10 የጌታው ቀን ግን እንደ ሌባ ሆኖ ይመጣል፤ በዚያም ቀን ሰማያት በታላቅ ድምፅ ያልፋሉ፥ የሰማይም ፍጥረት በትልቅ ትኵሳት ይቀልጣል፥ ምድርም በእርስዋም ላይ የተደረገው ሁሉ ይቃጠላል። "},
	{10, "12 ይህ ሁሉ እንዲህ የሚቀልጥ ከሆነ፥ የእግዚአብሔርን ቀን መምጣት እየጠበቃችሁና እያስቸኰላችሁ፥ በቅዱስ ኑሮ እግዚአብሔርንም በመምሰል እንደ ምን ልትሆኑ ይገባችኋል? ስለዚያ ቀን ሰማያት ተቃጥለው ይቀልጣሉ የሰማይም ፍጥረት በትልቅ ትኵሳት ይፈታል፤ "},
	{11, "13 ነገር ግን ጽድቅ የሚኖርባትን አዲስ ሰማይና አዲስ ምድር እንደ ተስፋ ቃሉ እንጠብቃለን። "},
	{12, "14 ስለዚህ፥ ወዳጆች ሆይ፥ ይህን እየጠበቃችሁ ያለ ነውርና ያለ ነቀፋ ሆናችሁ በሰላም በእርሱ እንድትገኙ ትጉ፥ "},
	{13, "15 የጌታችንም ትዕግሥት መዳናችሁ እንደ ሆነ ቍጠሩ። እንዲህም የተወደደው ወንድማችን ጳውሎስ ደግሞ እንደ ተሰጠው ጥበብ መጠን ጻፈላችሁ፥ በመልእክቱም ሁሉ ደግሞ እንደ ነገረ ስለዚህ ነገር ተናገረ። "},
	{14, "16 በእነዚያ ዘንድ ለማስተዋል የሚያስቸግር ነገር አለ፥ ያልተማሩትና የማይጸኑትም ሰዎች ሌሎችን መጻሕፍት እንደሚያጣምሙ እነዚህን ደግሞ ለገዛ ጥፋታቸው ያጣምማሉ። "},
	{15, "17 እንግዲህ እናንተ፥ ወዳጆች ሆይ፥ ይህን አስቀድማችሁ ስለምታውቁ፥ በዓመፀኞቹ ስሕተት ተስባችሁ ከራሳችሁ ጽናት እንዳትወድቁ ተጠንቀቁ፤ "},
	{16, "18 ነገር ግን በጌታችንና በመድኃኒታችን በኢየሱስ ክርስቶስ ጸጋና እውቀት እደጉ። ለእርሱ አሁንም እስከ ዘላለምም ቀን ድረስ ክብር ይሁን፤ አሜን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};