#include <map>
#include <string>
class Bible63
{
	struct am1	{ int val; const char *msg; };
public:
static void view1() {
struct am1 poems[] = {
	{1, "1 -2 በእኛ ስለሚኖርና ከእኛ ጋር ለዘላለም ስለሚሆን እውነት፥ እኔ ሽማግሌው በእውነት ለምወዳቸውና እኔ ብቻ ሳልሆን እውነትን የሚያውቁ ሁሉ ደግሞ ለሚወዱአቸው ለተመረጠች እመቤትና ለልጆችዋ፤ "},
	{2, "3 ከእግዚአብሔር አብና ከአብ ልጅ ከኢየሱስ ክርስቶስ ጸጋና ምሕረት ሰላምም በእውነትና በፍቅር ከእኛ ጋር ይሆናሉ። "},
	{3, "4 ትእዛዝን ከአብ እንደ ተቀበልን ከልጆችሽ በእውነት የሚሄዱ አንዳንዶችን ስለ አገኘኋቸው እጅግ ደስ ብሎኛል። "},
	{4, "5 አሁንም፥ እመቤት ሆይ፥ እርስ በርሳችን እንድንዋደድ እለምንሻለሁ፤ ይህች ከመጀመሪያ በእኛ ዘንድ የነበረች ትእዛዝ ናት እንጂ አዲስ ትእዛዝን እንደምጽፍልሽ አይደለም። "},
	{5, "6 እንደ ትእዛዛቱም እንሄድ ዘንድ ይህ ፍቅር ነው፤ ከመጀመሪያ እንደ ሰማችሁ፥ በእርስዋ ትሄዱ ዘንድ ትእዛዙ ይህች ናት። "},
	{6, "7 ብዙ አሳቾች ወደ ዓለም ገብተዋልና እነርሱም ኢየሱስ ክርስቶስ በሥጋ እንደ መጣ የማያምኑ ናቸው፤ ይህ አሳቹና የክርስቶስ ተቃዋሚው ነው። "},
	{7, "8 ሙሉ ደመወዝን እንድትቀበሉ እንጂ የሠራችሁትን እንዳታጠፉ ለራሳችሁ ተጠንቀቁ። "},
	{8, "9 ለሚወጣ ሁሉ በክርስቶስም ትምህርት ለማይኖር ሰው አምላክ የለውም፤ በክርስቶስ ትምህርት ለሚኖር አብና ወልድ አሉት። "},
	{9, "10 ማንም ወደ እናንተ ቢመጣ ይህንም ትምህርት ባያመጣ በቤታችሁ አትቀበሉት ሰላምም አትበሉት፤ "},
	{10, "11 ሰላም የሚለው ሰው በክፉ ሥራው ይካፈላልና። "},
	{11, "12 እንድጽፍላችሁ የምፈልገው ብዙ ነገር ሳለኝ በወረቀትና በቀለም ልጽፈው አልወድም፥ ዳሩ ግን ደስታችሁ ፍጹም እንዲሆን ወደ እናንተ ልመጣ አፍ ለአፍም ልናገራችሁ ተስፋ አደርጋለሁ። "},
	{12, "13 የተመረጠችው የእኅትሽ ልጆች ሰላምታ ያቀርቡልሻል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};