#include <map>
#include <string>
class Bible57
{
	struct am1	{ int val; const char *msg; };
public:
static void view1() {
struct am1 poems[] = {
	{1, "1 የክርስቶስ ኢየሱስ እስር ጳውሎስ ወንድሙም ጢሞቴዎስ፥ ለተወደደውና አብሮን ለሚሠራ ለፊልሞና፥ "},
	{2, "2 ለእኅታችንም ለአፍብያ፥ ከእኛም ጋር አብሮ ወታደር ለሆነ ለአርክጳ፥ በቤትህም ላለች ቤተ ክርስቲያን፤ "},
	{3, "3 ከእግዚአብሔር ከአባታችን ከጌታም ከኢየሱስ ክርስቶስ ጸጋና ሰላም ለእናንተ ይሁን። "},
	{4, "4 -5 በጌታ በኢየሱስ ዘንድ በቅዱሳንም ሁሉ ዘንድ ስላለህ ስለ ፍቅርህና ስለ እምነትህ ሰምቼ፥ በጸሎቴ እያሳሰብሁ ሁልጊዜ አምላኬን አመሰግናለሁ፤ "},
	{5, "6 የእምነትህም ኅብረት፥ በእኛ ዘንድ ያለውን በጎ ነገር ሁሉ በማወቅ፥ ለክርስቶስ ኢየሱስ ፍሬ እንዲያፈራ እለምናለሁ፤ "},
	{6, "7 የቅዱሳን ልብ በአንተ ስራ ስለ ዐረፈ፥ ወንድሜ ሆይ፥ በፍቅርህ ብዙ ደስታንና መጽናናትን አግኝቼአለሁና። "},
	{7, "8 ስለዚህ የሚገባውን አዝህ ዘንድ በክርስቶስ ምንም እንኳ ብዙ ድፍረት ቢኖረኝ፥ "},
	{8, "9 ይልቁንም እንደዚህ የሆንሁ እኔ ጳውሎስ ሽማግሌው፥ አሁንም ደግሞ የኢየሱስ ክርስቶስ እስር የሆንሁ፥ ስለ ፍቅር እለምናለሁ። "},
	{9, "11 አስቀድሞ ስላልጠቀመህ፥ አሁን ግን ለእኔም ለአንተም ስለሚጠቅም በእስራቴ ስለ ወለድሁት ስለ ልጄ ስለ አናሲሞስ እለምንሃለሁ። "},
	{10, "12 እርሱን እልከዋለሁ፤ "},
	{11, "13 አንተም ልቤ እንደሚሆን ተቀበለው። እኔስ በወንጌል እስራት ስለ አንተ እንዲያገለግለኝ ለራሴ ላስቀረው እፈቅድ ነበር፥ "},
	{12, "14 ነገር ግን በጎነትህ በፈቃድህ እንጂ በግድ እንዳይሆን፥ ሳልማከርህ ምንም እንኳ ላደርግ አልወደድሁም። "},
	{13, "15 ተቀብለህ ለዘላለም እንድትይዘው ስለዚህ ምናልባት ለጊዜው ተለይቶሃልና፤ "},
	{14, "16 ከእንግዲህ ወዲህ እንደ ባሪያ አይሆንም፥ ነገር ግን ለእኔ በተለየ የተወደደ ወንድም ከሆነ፥ ለአንተማ ይልቅ በስጋውም በጌታም ዘንድ ከባሪያ የሚሻል የተወደደ ወንድም እንዴት አይሆንም። "},
	{15, "17 እንግዲህ እንደ ባልንጀራ ብትቈጥረኝ፥ እንደ እኔ አድርገህ ተቀበለው። "},
	{16, "18 በአንዳች ነገር የበደለህ ቢኖር ግን ወይም ብድር ያለበት እንደሆነ፥ ይህን በእኔ ላይ ቍጠር፤ "},
	{17, "19 እኔ ጳውሎስ። እኔ እመልሰዋለሁ ብዬ በእጄ እጽፋለሁ፤ ከዚህም በላይ ለእኔ የራስህ ደግሞ ብድር እንዳለብህ አልልህም። "},
	{18, "20 አዎን፥ ወንድሜ ሆይ፥ በጌታ እኔ እንድጠቀምብህ ይሁን፤ በክርስቶስ ልቤን አሳርፍልኝ። "},
	{19, "21 ከምልህ ይልቅ አብልጠህ እንድታደርግ አውቄ እንድትታዘዝም ታምኜ እጽፍልሃለሁ። "},
	{20, "22 ደግሞ ከዚህም ጋር የማስተናገጃ ቤት አዘጋጅልኝ፤ በጸሎታችሁ ለእናንተ እንድሰጥ ተስፋ አደርጋለሁና። "},
	{21, "23 በክርስቶስ ኢየሱስ ከእኔ ጋር የታሰረ ኤጳፍራ "},
	{22, "24 አብረውኝም የሚሰሩ ማርቆስና አርስጥሮኮስ ዴማስም ሉቃስም ሰላምታ ያቀርቡልሃል። "},
	{23, "25 የጌታችን የኢሱስ ክርስቶስ ጸጋ ከመንፈሳችሁ ጋር ይሁን፤ አሜን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};