#include <map>
#include <string>
class Bible56
{
	struct am1	{ int val; const char *msg; };
	struct am2	{ int val; const char *msg; };
	struct am3	{ int val; const char *msg; };
public:
static void view1() {
struct am1 poems[] = {
	{1, "1 -2 የእግዚአብሔር ባሪያና የኢየሱስ ክርስቶስ ሐዋርያ የሆነ ጳውሎስ፥ በእግዚአብሔር ለተመረጡት እምነት እንዲሆንላቸው በዘላለምም ሕይወት ተስፋ እንደ አምልኮት ያለውን እውነት እንዲያውቁ የተላከ፤ ስለዚህም ሕይወት የማይዋሽ እግዚአብሔር ከዘላለም ዘመናት በፊት ተስፋ ሰጠ፥ "},
	{2, "3 በዘመኑም ጊዜ፥ መድኃኒታችን እግዚአብሔር እንዳዘዘ፥ ለእኔ አደራ በተሰጠኝ ስብከት ቃሉን ገለጠ፤ "},
	{3, "4 በሃይማኖት ኅብረት እውነተኛ ልጄ ለሚሆን ለቲቶ፤ ከእግዚአብሔር አብ ከመድኃኒታችንም ከጌታ ከኢየሱስ ክርስቶስ ጸጋና ምሕረት ሰላምም ይሁን። "},
	{4, "5 ስለዚህ ምክንያት የቀረውን እንድታደራጅ በየከተማውም፥ እኔ አንተን እንዳዘዝሁ፥ ሽማግሌዎችን እንድትሾም በቀርጤስ ተውሁህ፤ "},
	{5, "6 የማይነቀፍና የአንዲት ሚስት ባል የሚሆን፥ የሚያምኑም ልጆች ያሉት፥ ስለ መዳራትም ወይም ስለ አለመታዘዝ የማይከሰስ ማንም ቢኖር፥ ሹመው። "},
	{6, "7 ኤጲስ ቆጶስ፥ እንደ እግዚአብሔር መጋቢ፥ የማይነቀፍ ሊሆን ይገባዋልና፤ የማይኮራ፥ የማይቆጣ፥ የማይሰክር፥ የማይጨቃጨቅ፥ ነውረኛ ረብ የማይወድ፥ "},
	{7, "8 ነገር ግን እንግዳ ተቀባይ፥ በጎ የሆነውን ነገር የሚወድ፥ ጠንቃቃ፥ ጻድቅ፥ ቅዱስ፥ ራሱን የሚገዛ ይሁን፤ "},
	{8, "9 ሕይወት በሚገኝበት ትምህርት ደግሞ ሊመክር ተቃዋሚዎቹንም ሊወቅስ ይችል ዘንድ፥ እንደተማረው በታመነ ቃል ይጽና። "},
	{9, "10 የማይታዘዙና ከንቱ የሚናገሩ የሚያታልሉ ይልቁንም ከተገረዙት ወገን የሚሆኑ ብዙ ናቸውና፤ "},
	{10, "11 እነዚህም ስለ ነውረኛ ረብ የማይገባውን እያስተማሩ ቤቶችን በሞላው ስለ ሚገለብጡ፥ አፋቸውን መዝጋት ይገባል። "},
	{11, "12 የገዛ ራሳቸው ነቢይ የሆነ ከእነርሱ አንዱ። የቀርጤስ ሰዎች ዘወትር ውሸተኞች፥ ክፉዎች አራዊት፥ በላተኞች፥ ሥራ ፈቶች ናቸው ብሎአል። "},
	{12, "14 ይህ ምስክር እውነተኛ ነው። ስለዚህ ምክንያት የአይሁድን ተረትና ከእውነት ፈቀቅ የሚሉትን ሰዎች ትእዛዝ ሳያዳምጡ፥ በሃይማኖት ጤናሞች እንዲሆኑ በብርቱ ውቀሳቸው። "},
	{13, "15 ሁሉ ለንጹሖች ንጹሕ ነው፤ ለርኵሳንና ለማያምኑ ግን ንጹሕ የሆነ ምንም የለም፥ ነገር ግን አእምሮአቸውም ሕሊናቸውም ረክሶአል። "},
	{14, "16 እግዚአብሔርን እንዲያውቁ በግልጥ ይናገራሉ፥ ዳሩ ግን የሚያስጸይፉና የማይታዘዙ ለበጎ ሥራም ሁሉ የማይበቁ ስለ ሆኑ፥ በሥራቸው ይክዱታል። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct am2 poems[] = {
	{1, "1 አንተ ግን ሕይወት ለሚገኝበት ትምህርት የሚገባውን ተናገር። "},
	{2, "2 ሽማግሌዎች ልከኞች፥ ጭምቶች፥ ራሳቸውን የሚገዙ፥ በእምነትና በፍቅር በመጽናትም ጤናሞች እንዲሆኑ ምከራቸው፤ "},
	{3, "3 እንዲሁም አሮጊቶች ሴቶች አካሄዳቸው ለቅዱስ አገልግሎት የሚገባ፥ የማያሙ፥ ለብዙ ወይን ጠጅ የማይገዙ፥ በጎ የሆነውን ነገር የሚያስተምሩ ይሁኑ፤ "},
	{4, "4 -5 ቆነጃጅትም የእግዚአብሔር ቃል እንዳይሰደብ፥ ባሎቻቸውን የሚወዱ፥ ልጆቻቸውን የሚወዱ፥ ራሳቸውን የሚገዙ፥ ንጹሖች፥ በቤት የሚሠሩ፥ በጎዎች፥ ለባሎቻቸው የሚታዘዙ እንዲሆኑ ይምከሩአቸው። "},
	{5, "6 ጎበዞችም እንዲሁ ራሳቸውን እንዲገዙ ምከራቸው። "},
	{6, "7 -8 የሚቃወም ሰው ስለ እኛ የሚናገረውን መጥፎ ነገር ሲያጣ እንዲያፍር፥ በነገር ሁሉ መልካምን በማድረግህ ምሳሌ የሚሆን ራስህን አሳይ፤ በትምህርትህም ደኅንነትን፥ ጭምትነትን፥ ጤናማና የማይነቀፍ ንግግርን ግለጥ። "},
	{7, "10 ባሪያዎች ስለ መድኃኒታችን ስለ እግዚአብሔር የሚሆነውን ትምህርት በሁሉ ነገር ያስመሰግኑ ዘንድ፥ ለገዛ ጌቶቻቸው እንዲገዙ በሁሉም ደስ እንዲያሰኙ፥ ሳይቃወሙና ሳይሰርቁም በጎ ታማኝነትን ሁሉ እንዲያሳዩ ምከራቸው። "},
	{8, "11 ሰዎችን ሁሉ የሚያድን የእግዚአብሔር ጸጋ ተገልጦአልና፤ "},
	{9, "13 ይህም ጸጋ፥ ኃጢአተኝነትንና ዓለማዊን ምኞት ክደን፥ የተባረከውን ተስፋችንን እርሱም የታላቁን የአምላካችንንና የመድኃኒታችንን የኢየሱስ ክርስቶስን ክብር መገለጥ እየጠበቅን፥ ራሳችንን በመግዛትና በጽድቅ እግዚአብሔርንም በመምሰል በአሁኑ ዘመን እንድንኖር ያስተምረናል፤ "},
	{10, "14 መድኃኒታችንም ከዓመፅ ሁሉ እንዲቤዠን፥ መልካሙንም ለማድረግ የሚቀናውን ገንዘቡም የሚሆነውን ሕዝብ ለራሱ እንዲያነጻ፥ ስለ እኛ ነፍሱን ሰጥቶአል። "},
	{11, "15 ይህን በሙሉ ሥልጣን ተናገርና ምከር ገሥጽም፤ ማንም አይናቅህ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct am3 poems[] = {
	{1, "1 -2 ለገዦችና ለባለ ሥልጣኖች የሚገዙና የሚታዘዙ፥ ለበጎ ሥራ ሁሉ የተዘጋጁ፥ ማንንም የማይሰድቡ፥ የማይከራከሩ፥ ገሮች፥ ለሰው ሁሉ የዋህነትን ሁሉ የሚያሳዩ እንዲሆኑ ኣሳስባቸው። "},
	{2, "3 እኛ ደግሞ አስቀድመን የማናስተውል ነበርንና፤ የማንታዘዝ፥ የምንስት፥ ለምኞትና ለልዩ ልዩ ተድላ እንደ ባሪያዎች የምንገዛ፥ በክፋትና በምቀኝነት የምንኖር፥ የምንጣላ፥ እርስ በርሳችን የምንጠላላ ነበርን። "},
	{3, "4 ነገር ግን የመድኃኒታችን የእግዚአብሔር ቸርነትና ሰውን መውደዱ በተገለጠ ጊዜ፥ "},
	{4, "5 እንደ ምሕረቱ መጠን ለአዲስ ልደት በሚሆነው መታጠብና በመንፈስ ቅዱስ በመታደስ አዳነን እንጂ፥ እኛ ስላደረግነው በጽድቅ ስለ ነበረው ሥራ አይደለም፤ "},
	{5, "6 -7 ያን መንፈስም፥ በጸጋው ጸድቀን በዘላለም ሕይወት ተስፋ ወራሾች እንድንሆን፥ በመድኃኒታችን በኢየሱስ ክርስቶስ በእኛ ላይ አትርፎ አፈሰሰው። "},
	{6, "8 ቃሉ የታመነ ነው። እግዚአብሔርንም የሚያምኑት በመልካም ሥራ በጥንቃቄ እንዲጸኑ፥ እነዚህን አስረግጠህ እንድትናገር እፈቅዳለሁ። ይህ መልካምና ለሰዎች የሚጠቅም ነው፤ "},
	{7, "9 ነገር ግን ሞኝነት ካለው ምርመራና ከትውልዶች ታሪክ ከክርክርም ስለ ሕግም ከሚሆን ጠብ ራቅ፤ የማይጠቅሙና ከንቱዎች ናቸውና፤ "},
	{8, "11 መለያየትን የሚያነሣ ሰው ጠማማ እንዲሆን በራሱም ላይ ፈርዶ ኃጢአትን እንዲያደርግ አውቀህ፥ አንድ ጊዜ ሁለት ጊዜም ከገሠጽኸው በኋላ እንዲህ ከሚመስል ሰው ራቅ። "},
	{9, "12 አርጢሞንን ወይም ቲኪቆስን ወደ አንተ ስልክ፥ ወደ ኒቆጵልዮን ወደ እኔ እንድትመጣ ትጋ፤ በዚያ ልከርም ቈርጬአለሁና። "},
	{10, "13 ሕግ አዋቂውን ዜማስንና አጵሎስን ምንም እንዳይጎድልባቸው በጉዞአቸው ተግተህ እርዳ። "},
	{11, "14 ከወገናችንም ያሉት ደግሞ ፍሬ ቢሶች ሆነው እንዳይቀሩ፥ የግድ ስለሚያስፈልገው ነገር በመልካም ሥራ እንዲጸኑ ይማሩ። "},
	{12, "15 ከእኔ ጋር ያሉት ሁሉ ሰላምታ ያቀርቡልሃል። በእምነት ለሚወዱን ሰላምታ አቅርብልን። ጸጋ ከሁላችሁ ጋር ይሁን፤ አሜን። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};