#include <map>
#include <string>
class Bible64
{
	struct am1	{ int val; const char *msg; };
public:
static void view1() {
struct am1 poems[] = {
	{1, "1 ሽማግሌው በእውነት እኔ ለምወደው ለተወደደው ለጋይዮስ። "},
	{2, "2 ወዳጅ ሆይ፥ ነፍስህ እንደሚከናወን፥ በነገር ሁሉ እንዲከናወንልህና ጤና እንዲኖርህ እጸልያለሁ። "},
	{3, "3 ወንድሞች መጥተው አንተ በእውነት እንደምትሄድ ስለ እውነትህ ሲመሰክሩ እጅግ ደስ ብሎኛልና። "},
	{4, "4 ልጆቼ በእውነት እንዲሄዱ ከመስማት ይልቅ የሚበልጥ ደስታ የለኝም። "},
	{5, "5 ወዳጅ ሆይ፥ ምንም እንግዶች ቢሆኑ፥ ለወንድሞች በምታደርገው ሁሉ የታመነ ሥራ ትሠራለህ፥ እነርሱም በማኅበር ፊት ስለ ፍቅርህ መስክረዋል፤ "},
	{6, "6 ለእግዚአብሔር እንደሚገባ አድርገህ በጉዞአቸው ብትረዳ መልካም ታደርጋለህ፤ "},
	{7, "7 ከአሕዛብ አንዳች ሳይቀበሉ ስለ ስሙ ወጥተዋልና። "},
	{8, "8 እንግዲህ ከእውነት ጋር አብረን እንድንሠራ እኛ እንዲህ ያሉትን በእንግድነት ልንቀበል ይገባናል። "},
	{9, "9 ወደ ቤተ ክርስቲያን ጻፍሁ፤ ዳሩ ግን ዋናቸው ሊሆን የሚወድ ዲዮጥራጢስ አይቀበለንም። "},
	{10, "10 ስለዚህ፥ እኔ ብመጣ፥ በእኛ ላይ በክፉ ቃል እየለፈለፈ የሚያደርገውን ሥራውን አሳስባለሁ፤ ይህም ሳይበቃው እርሱ ራሱ ወንድሞችን አይቀበልም፥ ሊቀበሉአቸውም የሚወዱትን ከልክሎ ከቤተ ክርስቲያን ያወጣቸዋል። "},
	{11, "11 ወዳጅ ሆይ፥ በጎ የሆነውን እንጂ ክፉን አትምሰል። በጎ የሚያደርግ ከእግዚአብሔር ነው፤ ክፉን የሚያደርግ ግን እግዚአብሔርን አላየውም። "},
	{12, "12 ለድሜጥሮስ ሁሉ ይመሰክሩለታል፥ እውነት ራስዋም ትመሰክርለታለች፤ እኛም ደግሞ እንመሰክርለታለን፥ ምስክርነታችንም እውነት እንደ ሆነ ታውቃላችሁ። "},
	{13, "13 ልጽፍልህ የምፈልገው ብዙ ነገር ነበረኝ፥ ዳሩ ግን በቀለምና በብርዕ ልጽፍልህ አልወድም፤ "},
	{14, "14 ነገር ግን ወዲያው ላይህ ተስፋ አደርጋለሁ፥ አፍ ለአፍም እንነጋገራለን።[15] ሰላም ለአንተ ይሁን። ወዳጆች ሰላምታ ያቀርቡልሃል። ወዳጆችን በየስማቸው እየጠራህ ሰላምታ አቅርብልኝ። "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};