#include <map>
#include <string>
class Bible55
{
	struct heb1	{ int val; const char *msg; };
	struct heb2	{ int val; const char *msg; };
	struct heb3	{ int val; const char *msg; };
	struct heb4	{ int val; const char *msg; };
public:
static void view1() {
struct heb1 poems[] = {
	{1, "1 פולוס שליח ישוע המשיח ברצון האלהים לפי הבטחת החיים אשר בישוע המשיח׃"},
	{2, "2 אל טימותיוס בנו החביב חסד ורחמים ושלום מאת אלהים אבינו ומאת המשיח ישוע אדנינו׃"},
	{3, "3 מודה אני לאלהים אשר אני עבד אותו מימי אבותי ברוח טהורה כי תמיד אזכרך בתפלותי לילה ויומם׃"},
	{4, "4 ונכספתי לראותך בזכרי את דמעותיך למען אמלא שמחה׃"},
	{5, "5 כי באתי לזכר את אמונתך בלתי צבועה ששכנה כבר בלואיס זקנתך ובאבניקה אמך ומבטח אני כי תשכן גם בך׃"},
	{6, "6 על כן אזכירך שתעורר את מתנת האלהים הנתונה לך בסמיכת ידי׃"},
	{7, "7 כי האלהים לא נתן לנו רוח אימה כי אם רוח גבורה ואהבה ומוסר׃"},
	{8, "8 לכן אל תבוש לא מעדות אדנינו ולא ממני אסירו כי אם תסבל הרעות גם אתה כמוני על הבשורה כפי כח האלהים׃"},
	{9, "9 אשר הוא הושיענו וקראנו בקריאה קדושה לא לפי מעשינו כי אם לפי עצתו וחסדו הנתן לנו במשיח ישוע לפני ימות עולם׃"},
	{10, "10 ועתה נגלה בהראות מושיענו ישוע המשיח אשר בטל את המות ויוצא לאור על ידי הבשורה את החיים ואת אשר איננו עובר׃"},
	{11, "11 אשר הפקדתי להיות לה כרוז ושליח ומורה הגוים׃"},
	{12, "12 ובעבור זאת אסבל כאלה ולא אבוש כי יודע אנכי במי האמנתי ומבטח אנכי כי היכלת לו לשמר את פקדוני עד היום ההוא׃"},
	{13, "13 החזק בתכונת הדברים הבריאים אשר שמעת ממני באמונה ובאהבה אשר במשיח ישוע׃"},
	{14, "14 שמר את הפקדון הטוב בעזרת רוח הקדש השכן בנו׃"},
	{15, "15 זאת אתה יודע כי פנו ממני כל אשר באסיא ובתוכם פוגלוס והרמוגניס׃"},
	{16, "16 יתן האדון רחמים לבית אניסיפורוס כי פעמים רבות השיב את נפשי ולא בוש ממוסרי׃"},
	{17, "17 כי אם בהיותו ברומי יגע לבקשני עד כי מצאני׃"},
	{18, "18 יתן לו האדון למצא רחמים מלפני יהוה ביום ההוא ורב שרותו אשר שרת באפסוס אתה ידעת היטב׃"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct heb2 poems[] = {
	{1, "1 לכן בני התחזק בחסד אשר במשיח ישוע׃"},
	{2, "2 ואת אשר שמעת ממני בפני עדים רבים תפקידנו בידי אנשים נאמנים אשר הם כשרים ללמד גם את האחרים׃"},
	{3, "3 וסבל הרעות כאיש חיל בצבא מלחמת ישוע המשיח׃"},
	{4, "4 איש יצא לצבא לא יתערב בעשקי החיים למען יהיה רצוי לשר הצבא׃"},
	{5, "5 וגם אם נאבק איש לא יכתר אם לא יאבק כמשפט׃"},
	{6, "6 האכר העבד הוא יאכל ראשונה מפרי האדמה׃"},
	{7, "7 בין באשר אני אמר כי האדון יתן לך חכמה בכל דבר׃"},
	{8, "8 זכור תזכר את ישוע המשיח הנעור מן המתים אשר הוא מזרע דוד כפי בשורתי׃"},
	{9, "9 אשר בעבורה אני נשא רעות עד למוסרות כעשה עול אבל דבר האלהים איננו נאסר׃"},
	{10, "10 ועל כן אסבל את כל למען הבחירים למען ישיגו גם המה את התשועה במשיח ישוע עם כבוד עולמים׃"},
	{11, "11 נאמן הדבר הזה כי אם מתנו אתו גם אתו נחיה׃"},
	{12, "12 אם נסבל גם נמלך אתו ואם ננכר גם הוא ינכר אתנו׃"},
	{13, "13 אם לא נאמין הנה הוא קים באמונתו כי לכחש בעצמו לא יוכל׃"},
	{14, "14 זאת הזכר להם והעד לפני האדון שלא לעשק במחלקת מלים אשר לא להועיל רק לעות דעת השמעים׃"},
	{15, "15 היה שקוד להתיצב נאמן לפני אלהים וכפעל אשר לא יבוש המחלק על נכון דבר האמת׃"},
	{16, "16 אבל תרחק מדברי הבל הפסולים כי יוסיפו הרבות רשע׃"},
	{17, "17 ושיחתם כרקב תאכל סביב אשר מהם הומניוס ופיליטוס׃"},
	{18, "18 אשר תעו מן האמת באמרם כי תחית המתים כבר היתה ויבלבלו אמונת קצת אנשים׃"},
	{19, "19 אך איתן הוא יסוד האלהים וזה חותמו ידע יהוה את אשר לו ועוד יסור מעול כל הקורא את שם המשיח׃"},
	{20, "20 כי בבית גדול לא כלי זהב וכסף בלבד אלא גם של עץ ושל חרש ומהם לכבוד ומהם לבזיון׃"},
	{21, "21 והנה אם טהר איש את נפשו מאלה יהיה כלי לכבוד מקדש ומועיל לבעל הבית מוכן לכל מעשה טוב׃"},
	{22, "22 ברח לך מתאות הנעורים ורדף צדק ואמונה ואהבה ושלום עם כל הקראים אל יהוה בלב טהור׃"},
	{23, "23 ותרחק מן השאלות התפלות באין מוסר באשר תדע כי אך קטטה מולידות הנה׃"},
	{24, "24 ועבד האדון לא יתקוטט אלא יהי נוח לכל ומבין ללמד וסבלן׃"},
	{25, "25 ומיסר בנמיכות רוח את המתנגדים אולי יתן האלהים בלבבם לשוב להכרת האמת׃"},
	{26, "26 ויעירו ממוקשי השטן אשר צדם בהם לרצונו׃"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct heb3 poems[] = {
	{1, "1 וזאת תדע כי באחרית הימים יבאו עתים קשות׃"},
	{2, "2 כי יהיו האנשים אהבי עצמם ואהבי בצע והוללים וגאים ומגדפים וממרים באבותם וכפויי טובה ולא חסידים׃"},
	{3, "3 חסרי אהבה ובוגדים ומלשינים וזוללים ואכרזים ושנאי טוב׃"},
	{4, "4 ומסרים ופחזים וגבהי רוח והלכים אחרי תענוגים יותר מאחרי האלהים׃"},
	{5, "5 ואשר דמיון חסידות להם ומכחשים בכחה ואתה סור מאלה׃"},
	{6, "6 כי יש בהם הבאים בלאט אל הבתים ושבים נשים טעונות חטאים ונתעות בתאות שנות׃"},
	{7, "7 הלמדות תמיד ולעולם אינן יכלות לבוא לידיעת האמת׃"},
	{8, "8 כי כמו יניס וימבריס אשר קמו על משה כן גם אלה מתקוממים אל האמת אנשים אשר נשחתה דעתם ונמאסים בדבר האמונה׃"},
	{9, "9 אכן לא יוסיפו להצליח כי שגעונם יגלה לכל כאשר קרה גם את האנשים ההם׃"},
	{10, "10 אבל אתה הלכת אחרי בהוראה ובהנהגה וברצון ובאמונה ובארך הרוח ובאהבה ובסבלנות׃"},
	{11, "11 וברדיפות ובענוים אשר מצאוני באנטיוכיא ובאקוניא ובלוסטרא ואלה הרדיפות סבלתי ומכלן הצילני האדון׃"},
	{12, "12 וגם כל החפצים לחיות חיי חסידות במשיח ישוע המה ירדפו׃"},
	{13, "13 ואנשים רעים וקסמים יוסיפו סרה מתעים ונתעים׃"},
	{14, "14 אבל אתה עמד במה שלמדת והבטחת כי יודע אתה מי הוא אשר למדת ממנו׃"},
	{15, "15 ומנעוריך ידעת את כתבי הקדש היכלים להחכימך אל הישועה על ידי האמונה במשיח ישוע׃"},
	{16, "16 כי כל הכתוב נכתב ברוח אלהים גם מועיל להורת ולהוכיח ולישר וליסר בצדק׃"},
	{17, "17 למען אשר יהיה איש האלהים תמים ומהיר לכל מעשה טוב׃"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct heb4 poems[] = {
	{1, "1 לכן אני מעיד בך נגד האלהים ונגד אדנינו ישוע המשיח הבא לשפט את החיים ואת המתים בהופעתו ובמלכותו׃"},
	{2, "2 הכרז את הדבר והתמד בין בעתו בין שלא בעתו הוכח וגער והזהר בכל ארך רוח והוראה׃"},
	{3, "3 כי בוא תבא העת אשר לא יכילו את הלקח הבריא כי אם כאות נפשם יקבצו להם מורים לשעשעי אזנים׃"},
	{4, "4 ויטו אזניהם מן האמת ויפנו אל ההגדות׃"},
	{5, "5 אבל אתה היה ער בכל סבל הרעות ועשה מלאכת המבשר ומלא את שרותך׃"},
	{6, "6 כי עתה זה אסך נסך ועת פטירתי הגיעה׃"},
	{7, "7 המלחמה הטובה נלחמתי את המרוצה השלמתי את האמונה שמרתי׃"},
	{8, "8 ומעתה שמור לי כתר הצדקה אשר ביום ההוא יתננו לי האדון השפט הצדיק ולא לי לבדי כי גם לכל אהבי הופעתו׃"},
	{9, "9 חושה לבוא אלי במהרה׃"},
	{10, "10 כי דימס עזבני באהבתו את העולם הזה וילך לו לתסלוניקי וקריסקיס הלך לגלטיא וטיטוס לדלמטיא׃"},
	{11, "11 ולוקס הוא לבדו עמדי קח את מרקוס והביאהו אתך כי יועיל לי למאד לעבודה׃"},
	{12, "12 את טוכיקוס שלחתי לאפסוס׃"},
	{13, "13 את המטפחת שהנחתי בטרואס אצל קרפוס הביאהו אתך בבואך ואף את הספרים ובפרט את המגלות של קלף׃"},
	{14, "14 אלכסנדר חרש הנחשת עשה לי רעות רבות ישלם לו יהוה כמעשיו׃"},
	{15, "15 וגם אתה השמר לך ממנו כי מרו מרה את דברינו׃"},
	{16, "16 בהתנצלותי הראשונה לא היה איש לעזרני כי כלם עזבוני אל יחשב להם עון׃"},
	{17, "17 אבל האדון הוא עזרני וחזקני למען תשלם על ידי הבשורה וישמעוה כל הגוים ואנצל מפי אריה׃"},
	{18, "18 ויצילני האדון מכל מעשה רע ויושיעני אל מלכותו שבשמים לו הכבוד לעולמי עולמים אמן׃"},
	{19, "19 שאל לשלום פריסקה ועקילס ובית אניסיפורוס׃"},
	{20, "20 ארסטוס נשאר בקורנתוס ואת טרופימוס הנחתי חולה במילטוס׃"},
	{21, "21 חושה לבוא לפני הסתיו אובולוס ופודיס ולינוס וקלודיה והאחים כלם שאלים לשלומך׃"},
	{22, "22 אדנינו ישוע המשיח יהי עם רוחך החסד עמכם אמן׃"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};