#include <map>
#include <string>
class Bible57
{
	struct heb1	{ int val; const char *msg; };
public:
static void view1() {
struct heb1 poems[] = {
	{1, "1 פולוס אסיר המשיח ישוע וטימותיוס האח אל פילימון החביב והעזר אתנו׃"},
	{2, "2 ואל אפיה האהובה ואל ארכפוס חבר מלחמתינו ואל הקהלה אשר בביתך׃"},
	{3, "3 חסד לכם ושלום מאת אלהים אבינו ואדנינו ישוע המשיח׃"},
	{4, "4 מודה אני לאלהי בכל עת בהזכירי אתך בתפלותי׃"},
	{5, "5 אחרי שמעי אהבתך ואמונתך אשר בך לאדנינו ישוע ולכל הקדושים׃"},
	{6, "6 למען אשר תאמץ התחברות אמונתך בדעת כל טוב אשר בכם לשם המשיח׃"},
	{7, "7 כי שמחה גדולה ונחמה יש לנו באהבתך באשר היתה רוחה למעי הקדושים אחי על ידיך׃"},
	{8, "8 לכן אף כי יש לי בטחון רב במשיח לצותך את הראוי לך הנה בחרתי למען האהבה לחלות את פניך׃"},
	{9, "9 כאשר הנה אנכי פולוס איש זקן ועתה גם אסיר ישוע המשיח׃"},
	{10, "10 אבקשה ממך על בני אשר הוללתיו במוסרי על אניסימוס׃"},
	{11, "11 אשר מלפנים לא הועיל לך ועתה הוא להועיל גם לך גם לי והשיבתיו אליך׃"},
	{12, "12 ואתה קבל נא אתו שהוא מעי׃"},
	{13, "13 חפצתי לעצר אתו אצלי שישרתני תחתיך במוסרות הבשורה׃"},
	{14, "14 אבל בלי רצונך לא אביתי לעשות דבר למען לא תהיה טובתך באנס כי אם בנדבה׃"},
	{15, "15 כי אולי נפרד ממך לשעה בעבור אשר יהיה לך לעולם׃"},
	{16, "16 ומעתה לא כעבד כי אם למעלה מעבד כאח אהוב שכן הוא לי ביותר ואף כי לך הן בבשר הן באדון׃"},
	{17, "17 והנה אם תחשבני לחבר לך תקבלנו כמוני׃"},
	{18, "18 ואם הרע לך בדבר או חיב הוא לך דבר חשבהו לי׃"},
	{19, "19 אני פולוס כתבתי בידי אני אשלם ולא אמר כי אתה חיב לי גם את נפשך׃"},
	{20, "20 כן אחי אהנה נא ממך באדון נחם נא את מעי באדון׃"},
	{21, "21 בבטחוני כי תשמע לי כתבתי אליך ויודע אני כי תעשה יותר ממה שאמרתי׃"},
	{22, "22 ועם זה גם תכין לי בית מלון כי אקוה אשר אנתן לכם על ידי תפלותיכם׃"},
	{23, "23 אפפרס האסור אתי במשיח ישוע׃"},
	{24, "24 ומרקוס וארסטרכוס ודימס ולוקס עזרי שאלים לשלומך׃"},
	{25, "25 חסד ישוע המשיח אדנינו עם רוחכם אמן׃"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};