#include <map>
#include <string>
class Bible64
{
	struct heb1	{ int val; const char *msg; };
public:
static void view1() {
struct heb1 poems[] = {
	{1, "1 הזקן אל גיוס החביב אשר אני אהב אתו באמת׃"},
	{2, "2 חביבי חפצי הוא כי ייטב לך בכל דבר ותחזק כאשר טוב לך בנפשך׃"},
	{3, "3 כי שמחתי למאד כאשר באו אחים ויעידו על אמתך אשר מתהלך באמת אתה׃"},
	{4, "4 אין לי שמחה גדולה מלשמע את אשר בני יתהלכו באמת׃"},
	{5, "5 חביבי באמונה כל מעשיך עם האחים ועם הארחים׃"},
	{6, "6 אשר העידו על אהבתך בפני הקהל ואף תיטיב לעשות בלותך אתם כאשר יאתה לפני אלהים׃"},
	{7, "7 כי בעבור שמו יצאו ולא לקחו מאומה מן הגוים׃"},
	{8, "8 על כן חיבים אנחנו לקבל אתם למען נהיה עזרים לאמת׃"},
	{9, "9 אני כתבתי אל הקהלה אך דיוטריפס המתאוה להיות עליהם לראש איננו מקבל אתנו׃"},
	{10, "10 על כן בבאי אזכיר את מעשיו אשר הוא עשה בספרו עלינו דברים רעים ולא דיו שלא יקבל את האחים כי גם ימנע את החפצים לקבל ויגרשם מתוך הקהלה׃"},
	{11, "11 חביבי אל תרדף הרעה כי אם הטוב העשה טוב הוא מאלהים והעשה רע לא ראה את האלהים׃"},
	{12, "12 על דימטריוס העידו הכל וגם האמת עצמה וגם אנחנו מעידים עליו וידעתם כי עדותנו היא נאמנה׃"},
	{13, "13 הרבה לי לכתב ולא חפצתי לכתב אליך בדיו ובקנה׃"},
	{14, "14 אבל אקוה לראותך במהרה ופה אל פה נדבר׃ [ (III John 1:15) שלום לך הרעים שאלים לשלומך שאל לשלום הרעים לאיש איש בשמו׃ ]"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};