#include <map>
#include <string>
class Bible21
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
	struct bg5	{ int val; const char *msg; };
	struct bg6	{ int val; const char *msg; };
	struct bg7	{ int val; const char *msg; };
	struct bg8	{ int val; const char *msg; };
	struct bg9	{ int val; const char *msg; };
	struct bg10	{ int val; const char *msg; };
	struct bg11	{ int val; const char *msg; };
	struct bg12	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Думите на проповедника, сина на Давид, цар в Ерусалим:"},
	{2, "2 Суета на суетите! — казва проповедникът. — Суета на суетите, всичко е суета."},
	{3, "3 Каква полза има човек от целия си труд, в който се труди под слънцето?"},
	{4, "4 Едно поколение преминава и друго поколение идва, а земята вечно стои."},
	{5, "5 И слънцето изгрява и слънцето залязва, и бърза към мястото, където е изгряло."},
	{6, "6 Вятърът отива на юг и се обръща на север, непрестанно се върти и отива, и в кръгообразните си пътища се връща вятърът."},
	{7, "7 Всички реки отиват в морето, а морето не се напълва. На мястото, където реките отиват, там те се връщат да отидат отново."},
	{8, "8 Всички думи са трудни, нищо не може да каже човек. Окото не се насища с гледане и ухото не се напълва със слушане."},
	{9, "9 Каквото е било, това и ще бъде и каквото е извършено, това и ще се извърши; и няма нищо ново пред слънцето."},
	{10, "10 Има ли нещо, за което да се каже: Виж, това е ново? То вече е било в древни времена преди нас."},
	{11, "11 Няма спомен за предишните; и за следващите, които ще бъдат, няма да има спомен между онези, които ще бъдат после."},
	{12, "12 Аз, проповедникът, бях цар над Израил в Ерусалим."},
	{13, "13 И предадох сърцето си да издиря и да изследвам чрез мъдрост всичко, което се върши под небето. Тежка работа е дал Бог на човешките синове, за да се трудят в нея."},
	{14, "14 Видях всичките дела, които се вършат под слънцето, и ето, всичко е суета и гонене на вятър."},
	{15, "15 Кривото не може да се изправи и липсващото не може да се брои."},
	{16, "16 Аз говорих в сърцето си и казах: Ето, увеличих и умножих мъдрост повече от всички, които са били преди мен в Ерусалим, и сърцето ми видя изобилие от мъдрост и знание."},
	{17, "17 И предадох сърцето си, за да позная мъдрост и да позная лудост и безумие. Разбрах, че и това е гонене на вятър."},
	{18, "18 Защото в многото мъдрост има много тъга, и който умножава знание, умножава печал."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 Казах аз в сърцето си: Ела сега, ще те изпитам с веселие; затова, наслаждавай се на добро! И ето, и това беше суета."},
	{2, "2 Казах за смеха: Лудост е! — и за веселието: Какво постига то?"},
	{3, "3 Реших в сърцето си да веселя плътта си с вино, докато сърцето ми ме водеше в мъдрост, и да удържа безумието, докато видя кое е доброто за човешките синове да го вършат под небето през всичките дни на живота си."},
	{4, "4 Извърших големи дела: построих си къщи, насадих си лозя,"},
	{5, "5 направих си градини и паркове, и насадих в тях всякакви плодни дървета."},
	{6, "6 Направих си водоеми, от които да поливам растящата гора от дървета."},
	{7, "7 Купих слуги и слугини, и имах слуги, родени в дома ми. Имах и стада от едър и дребен добитък, повече от всички, които са били преди мен в Ерусалим."},
	{8, "8 Събрах си и сребро, и злато, и съкровища на царе и страни. Събрах си също певци и певици, и насладите на човешките синове — всякакви изобилни великолепия."},
	{9, "9 Така станах велик и превъзходен повече от всички, които са били преди мен в Ерусалим. Също и мъдростта ми ми остана."},
	{10, "10 И от всичко, което очите ми пожелаха, не им отказах нищо. Не възпрях сърцето си от никакво удоволствие, защото сърцето ми се радваше заради целия ми труд и това беше наградата ми за целия ми труд."},
	{11, "11 И разгледах всичките си дела, които ръцете ми бяха извършили, и труда, в който работейки се трудих, и ето, всичко беше суета и гонене на вятър, и нямаше полза под слънцето."},
	{12, "12 Тогава се обърнах да разгледам мъдростта и лудостта, и безумието, защото какво ще направи човек, който идва след царя? — Това, което е вече направено."},
	{13, "13 Тогава видях, че мъдростта превъзхожда безумието, както светлината превъзхожда тъмнината."},
	{14, "14 Очите на мъдрия са в главата му, а безумният ходи в тъмнина. Но познах също, че една участ ги постига всичките."},
	{15, "15 Тогава казах в сърцето си: Каквато е участта на безумния, това ще постигне и мен. Защо тогава станах аз толкова мъдър? Затова казах в сърцето си, че и това е суета."},
	{16, "16 Защото няма вечно спомен нито за мъдрия, нито за безумния, защото в идещите дни всичко ще бъде вече забравено. И как умира мъдрият? — Като безумния!"},
	{17, "17 Затова аз намразих живота, защото тежко ми се видя делото, което се върши под слънцето; понеже всичко е суета и гонене на вятър."},
	{18, "18 И аз намразих целия си труд, в който се бях трудил под слънцето, защото трябва да го оставя на човека, който идва след мен."},
	{19, "19 И кой знае дали той ще бъде мъдър или безумен? Но пак той ще владее над плода на целия ми труд, в който се трудих и в който се показах мъдър под слънцето. И това е суета."},
	{20, "20 Затова се обърнах и се отчаях от целия труд, в който съм се трудил под слънцето."},
	{21, "21 Защото има човек, чийто труд е бил с мъдрост, знание и умение, но го оставя за дял на друг, който не се е трудил за него. И това е суета и голямо зло."},
	{22, "22 Защото каква полза за човека от целия му труд и от усилията на сърцето му, с които се труди под слънцето?"},
	{23, "23 Понеже всичките му дни са страдание и трудът му е скръб; дори и нощем сърцето му не почива. И това е суета."},
	{24, "24 Няма нищо по-добро за човека, освен да яде и да пие, и да оставя душата си да вижда доброто от труда му. И това видях, че е от Божията ръка."},
	{25, "25 Защото кой може да яде и кой може да се наслаждава без Мен — Бог?"},
	{26, "26 Понеже на човека, който е угоден пред Него, Бог дава мъдрост и знание, и радост, а на грешника дава да се труди, да събира и да трупа, за да даде на угодния пред Бога. И това е суета и гонене на вятър."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 Има време за всяко нещо и определено време за всяко намерение под небето:"},
	{2, "2 време за раждане и време за умиране; време за насаждане и време за изкореняване на насаденото;"},
	{3, "3 време за убиване и време за изцеляване; време за събаряне и време за градене;"},
	{4, "4 време за плачене и време за смеене; време за жалеене и време за танцуване;"},
	{5, "5 време за хвърляне на камъни и време за събиране на камъни; време за прегръщане и време за въздържане от прегръщане;"},
	{6, "6 време за търсене и време за изгубване; време за пазене и време за изхвърляне;"},
	{7, "7 време за късане и време за шиене; време за мълчане и време за говорене;"},
	{8, "8 време за обичане и време за мразене; време за война и време за мир."},
	{9, "9 Каква полза има работникът от това, в което се труди?"},
	{10, "10 Видях труда, който Бог даде на човешките синове, за да се трудят в него."},
	{11, "11 Той е направил всяко нещо хубаво на времето му. Положил е и вечността в тяхното сърце, без човек да може да издири делото, което Бог е извършил, от началото до края."},
	{12, "12 Познах, че няма по-добро за тях, освен да се веселят и да вършат добро през живота си,"},
	{13, "13 а и че всеки човек яде и пие, и вижда добро в целия си труд — това е дар от Бога."},
	{14, "14 Познах, че всичко, което Бог прави, ще бъде вечно; не може нищо да се прибави към него, и нищо да се отнеме от него. Бог го прави, за да Му се боят."},
	{15, "15 Каквото е, вече е било и каквото ще бъде, вече е било; и Бог издирва миналото."},
	{16, "16 И още видях под слънцето мястото на съда, а там — беззаконието, и мястото на правдата, а там — беззаконието."},
	{17, "17 Казах в сърцето си: Бог ще съди и правЕдния и безбожния, защото там има време за всяко намерение и за всяко дело."},
	{18, "18 Казах в сърцето си: Заради делото на човешките синове е това, за да ги изпита Бог, за да видят, че сами за себе си, без Бога, те са животни."},
	{19, "19 Защото участта на човешките синове и участта на животните е една участ. Както умира единият, така умира и другият; и едно дихание имат всички. И човекът няма никакво предимство пред животните, защото всичко е суета."},
	{20, "20 Всичко отива на едно място; всичко е от пръстта, и всички се връщат в пръстта."},
	{21, "21 Кой знае, че духът на човека се издига горе, а духът на животното слиза долу на земята?"},
	{22, "22 И така, видях, че няма по-добро от това, да се радва човек в делата си, защото това е делът му. Понеже кой ще го доведе да види какво ще бъде след него?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 Тогава се обърнах и видях всичките потисничества, които се вършат под слънцето: И ето, сълзите на угнетените, но нямаше за тях утешител — и от ръката на потисниците им излизаше насилие, но нямаше за тях утешител."},
	{2, "2 Затова аз завидях повече на мъртвите, които са вече умрели, отколкото на живите, които са още живи."},
	{3, "3 А по-щастлив и от двамата е онзи, който още не е бил, който не е видял злите дела, които се вършат под слънцето."},
	{4, "4 И видях, че всеки труд и всяка сполука в работата е съперничество между човека и ближния му. И това е суета и гонене на вятър."},
	{5, "5 Безумният сгъва ръцете си и яде собствената си плът."},
	{6, "6 По-добре пълна шепа със спокойствие отколкото две шепи пълни с труд и гонене на вятър."},
	{7, "7 И се обърнах и видях суета под слънцето."},
	{8, "8 Има такъв, който е сам, без другар; няма нито син, нито брат. Но няма край на целия му труд и окото му не се насища с богатства. И не казва: За кого се трудя и лишавам душата си от благо? И това е суета и тежка работа."},
	{9, "9 Двама са по-добре отколкото един, понеже те имат добра награда за труда си."},
	{10, "10 Защото, ако паднат, единият ще вдигне другаря си; но горко на онзи, който е сам, когато падне, и няма втори да го вдигне."},
	{11, "11 И ако двама легнат заедно, ще се топлят; а как ще се стопли един?"},
	{12, "12 И ако някой може да надвие единия, двама ще му противостоят. И тройното въже не се къса бързо."},
	{13, "13 По-добре е беден и мъдър младеж отколкото стар и безумен цар, който вече не приема съвет."},
	{14, "14 Защото младежът излиза от затвора, за да бъде цар, въпреки че е роден беден в царството му."},
	{15, "15 Видях всичките живи, които ходят под слънцето, че бяха с втория, с младежа, който трябваше да застане на неговото място."},
	{16, "16 Нямаше край на целия народ, на всички, които бяха преди тях; и послешните няма да се зарадват в него. Защото и това е суета и гонене на вятър."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct bg5 poems[] = {
	{1, "1 Пази стъпките си, когато отиваш към Божия дом, и по-добре да се приближиш да слушаш, отколкото да принесеш жертва на безумни, защото те не знаят, че вършат зло."},
	{2, "2 Не прибързвай с устата си и да не бърза сърцето ти да произнася дума пред Бога — защото Бог е на небето, а ти си на земята, затова нека думите ти бъдат малко."},
	{3, "3 Защото сънищата идват от много занимание и гласът на безумния — от много думи."},
	{4, "4 Когато дадеш обещание на Бога, не се бави да го изпълниш, защото Той не благоволява в безумните. Изпълни това, което си обещал!"},
	{5, "5 По-добре да не обещаваш, отколкото да обещаеш и да не изпълниш."},
	{6, "6 Не позволявай на устата си да вкара плътта ти в грях и не казвай пред Божия Ангел, че е било по погрешка. Защо да се разгневи Бог на гласа ти и да унищожи делото на ръцете ти?"},
	{7, "7 Защото в множеството на сънищата и в множеството на думите има суети, но ти се бой от Бога."},
	{8, "8 Ако видиш угнетяване на бедния и изкривяване на правосъдието и правдата в страната, не се учудвай на това нещо; защото над високия служител надзирава друг по-висок, а над тях има още по-високи."},
	{9, "9 И ползата от земята е за всичките; и сам царят има полза от нивите."},
	{10, "10 Който обича парите, няма да се насити с пари, нито с доходи — онзи, който обича изобилието. И това е суета."},
	{11, "11 Когато се увеличават благата, увеличават се и онези, които ги ядат; затова, каква полза имат притежателите им, освен да ги гледат с очите си?"},
	{12, "12 Сънят на онзи, който работи, е сладък, независимо дали яде малко, или много, а пресищането на богатия не го оставя да спи."},
	{13, "13 Има тежко зло, което видях под слънцето — богатство, пазено от притежателя му за негова вреда."},
	{14, "14 Но онова богатство се загубва от зъл случай и когато той ражда син, няма нищо в ръката му."},
	{15, "15 Както е излязъл от утробата на майка си, гол ще се върне, и ще си отиде, както е дошъл. Няма да вземе нищо от плода на труда си, което да отнесе в ръката си."},
	{16, "16 И това също е тежко зло — както е дошъл, така ще си и отиде и каква полза за него, че се е трудил на вятъра?"},
	{17, "17 Още и през всичките си дни той яде в тъмнина с много досада и болест, и гняв."},
	{18, "18 Ето какво видях за добро и прилично — човек да яде, да пие и да вижда добро от целия си труд, в който се труди под слънцето според броя на дните на живота си, които Бог му е дал; защото това е делът му."},
	{19, "19 И за всеки човек, на когото Бог е дал богатство и имот, и му е дал власт да яде от него, да взема дела си и да се весели в труда си — това е дар от Бога."},
	{20, "20 Защото няма да мисли много за дните на живота си, понеже Бог го занимава с радостта на сърцето му."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct bg6 poems[] = {
	{1, "1 Има зло, което видях под слънцето и е много сред хората:"},
	{2, "2 човек, на когото Бог е дал богатство и имот, и почест и нищо не му липсва от всичко, което пожелава; но Бог не му дава власт да яде от тях, а ги яде чужденец. Това е суета и лоша болест."},
	{3, "3 Ако човек роди сто деца и живее много години, и дните на годините му станат много, а душата му не се насити с благо, и той дори няма прилично погребение, казвам, че мъртвороденото е по-добре от него,"},
	{4, "4 защото то идва в нищожност и отива в тъмнина, и името му се покрива с тъмнина,"},
	{5, "5 и не е видяло слънцето и не е познало нищо. То има повече покой, отколкото онзи човек."},
	{6, "6 Дори да живее два пъти по хиляда години, без да види добро — не отиват ли всички на едно място?"},
	{7, "7 Целият труд на човека е за устата му — душата му обаче не се насища."},
	{8, "8 Защото какво предимство има мъдрият пред безумния и какво — сиромахът, който знае как да живее между живите?"},
	{9, "9 По-добре да виждаш нещо с очите си, отколкото да блуждаеш с желанието си. И това е суета и гонене на вятър."},
	{10, "10 Каквото и да съществува, вече си има име, и се знае какво е човек; и той не може да се съди с по-могъщия от него."},
	{11, "11 Понеже има много неща, които умножават суетата — каква полза има човек от това?"},
	{12, "12 Защото кой знае какво е добро за човека в живота през малкото години на суетния му живот, които той прекарва като сянка? Защото кой ще каже на човека какво ще бъде след него под слънцето?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct bg7 poems[] = {
	{1, "1 Добро име е по-добро от скъпоценно масло и денят на смъртта — от деня на раждането."},
	{2, "2 По-добре да отидеш в дом на жалеене, отколкото да отидеш в дом на пируване, защото това е краят на всички хора и живият го влага в сърцето си."},
	{3, "3 Печалта е по-добра от смеха, защото чрез тъжното лице сърцето става по-добро."},
	{4, "4 Сърцето на мъдрите е в дома на жалеене, а сърцето на безумните е в дома на веселие."},
	{5, "5 По-добре да се слуша изобличението на мъдрия, отколкото да слуша човек песента на безумните."},
	{6, "6 Защото какъвто е гласът на тръните под котела, такъв е и смехът на безумния. И това е суета."},
	{7, "7 Наистина насилието подлудява мъдрия и подкупът покварява сърцето."},
	{8, "8 Краят на работата е по-добър от началото й; търпеливият по дух е по-добър от гордия по дух."},
	{9, "9 Не бързай в духа си да се гневиш, защото гневът почива в пазвата на безумните."},
	{10, "10 Не казвай: Как предишните дни бяха по-добри от тези? — защото не от мъдрост питаш за това."},
	{11, "11 Мъдростта е добра като наследство и полезна за онези, които гледат слънцето,"},
	{12, "12 защото мъдростта е защита, както и парите са защита, но предимството на знанието е, че мъдростта оживява онези, които я имат."},
	{13, "13 Разгледай Божието дело, защото кой може да изправи онова, което Той е направил криво?"},
	{14, "14 В деня на благоденствие бъди весел, а в деня на бедствие разсъди: Бог е направил едното, както и другото, за да не намери човек нищо след себе си."},
	{15, "15 Всичко видях в суетните си дни — има праведен, който загива в правдата си, и има безбожен, който дългоденства в безбожието си."},
	{16, "16 Не бъди прекалено праведен и не се прави на прекалено мъдър — защо да се погубиш?"},
	{17, "17 Не бъди прекалено зъл и не бъди безумен — защо да умреш преди времето си?"},
	{18, "18 Добре е да държиш това и да не оттегляш ръката си от онова, защото който се бои от Бога, ще избегне всичко това."},
	{19, "19 Мъдростта прави мъдрия по-силен от десет началници, които са в града,"},
	{20, "20 защото няма праведен човек на земята, който върши добро и не греши."},
	{21, "21 И не обръщай внимание на всички думи, които се говорят, да не би да чуеш слугата си да те кълне,"},
	{22, "22 защото сърцето ти знае също, че и ти много пъти си проклинал други."},
	{23, "23 Всичко това опитах чрез мъдрост. Казах: Ще бъда мъдър! — но тя се отдалечи от мен."},
	{24, "24 Далеч е онова, което е, и изключително дълбоко — кой може да го открие?"},
	{25, "25 Отново предадох сърцето си да позная, да изследвам и да открия мъдростта и разума, да позная, че злото е безумие и глупостта е лудост."},
	{26, "26 И открих че е по-горчива от смъртта жената, чието сърце е примки и мрежи, чиито ръце са окови. Който е угоден на Бога, ще избегне от нея, а грешникът ще бъде хванат от нея."},
	{27, "27 Виж, това открих — казва проповедникът — като сравнявах едно нещо с друго, за да намеря обяснение,"},
	{28, "28 което душата ми още търси, но не е намерила — един мъж между хиляда намерих, но една жена между всички тях не намерих."},
	{29, "29 Ето, само това намерих — че Бог направи човека праведен, но те потърсиха много хитрини."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct bg8 poems[] = {
	{1, "1 Кой е като мъдрия и кой знае обяснението на нещата? Мъдростта на човека осветлява лицето му и твърдостта на лицето му се променя."},
	{2, "2 Аз казвам: Пази царската заповед заради клетвата си към Бога."},
	{3, "3 Не бързай да излезеш от присъствието му. Не постоянствай в зло дело, защото той върши всичко, каквото иска."},
	{4, "4 В думата на царя има власт, кой ще му каже: Какво правиш?"},
	{5, "5 Който пази заповедта, няма да види зло, защото мъдрото сърце познава време и правилен начин."},
	{6, "6 Понеже за всяко нещо има време и правилен начин, понеже злощастието на човека тежи върху него."},
	{7, "7 Защото не знае какво ще се случи, понеже кой може да му каже какво ще стане?"},
	{8, "8 Няма човек който да има власт над духа, за да задържи духа, и никой няма власт в деня на смъртта. От тази война няма уволнение и безбожието няма да избави онези, които са се предали на него."},
	{9, "9 Всичко това видях и обърнах сърцето си към всяко дело, което се върши под слънцето: има време, в което човек господства над друг човек за своя вреда."},
	{10, "10 Тогава видях безбожните погребани — които бяха идвали и си отивали от святото място — и те бяха забравени в града, където бяха правили така. И това е суета."},
	{11, "11 Понеже присъдата срещу зло дело не се изпълнява бързо, затова сърцето на човешките синове е напълно предадено в тях да вършат зло."},
	{12, "12 Въпреки че грешникът върши зло сто пъти и дългоденства, пак аз зная, че ще бъде добре на боящите се от Бога, които се боят пред Него."},
	{13, "13 Но на безбожния няма да бъде добре и като сянка няма да продължи дните си, защото не се бои пред Бога."},
	{14, "14 Има една суета, която става на земята — че има праведни, на които се случва според делата на безбожните, и има безбожни, на които се случва според делата на праведните. Казах, че и това е суета."},
	{15, "15 Затова аз похвалих веселието, защото няма нищо по-добро за човека под слънцето от това да яде и да пие, и да се весели. И това ще му остане от труда му в дните на живота му, които Бог му дава под слънцето."},
	{16, "16 Когато предадох сърцето си да позная мъдростта и да видя работата, която се върши на земята — макар че човек не вижда сън с очите си нито денем, нито нощем —"},
	{17, "17 тогава видях в цялото Божие дело, че човек не може да открие делото, което става под слънцето. Колкото и да се труди човек и да търси, няма да го открие; и дори мъдрият да твърди, че го познава, не може да го открие."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct bg9 poems[] = {
	{1, "1 Защото всичко това взех присърце, за да издиря всичко това — че праведните и мъдрите, и делата им са в Божията ръка. Няма човек, който да знае дали любов или омраза го очаква; всичко е пред тях."},
	{2, "2 Всичко идва еднакво за всички, едно и също се случва на праведния и на безбожния; на добрия и на чистия, и на нечистия; и на този, който жертва, и на този, който не жертва; както на добрия, така и на грешния, на този, който се заклева, както на този, който се страхува от заклеване."},
	{3, "3 Това е зло във всичко, което се върши под слънцето — че едно и също се случва на всички. Сърцето на човешките синове е пълно със зло; безумие е в сърцето им, докато живеят, и после отиват при мъртвите."},
	{4, "4 Защото за този, който е между всички живи, има надежда, понеже живо куче е по-добре от мъртъв лъв."},
	{5, "5 Защото живите знаят, че ще умрат, а мъртвите не знаят нищо и нямат вече награда, понеже споменът за тях е забравен."},
	{6, "6 Както любовта им, така и омразата им, и ревността им са вече изгубени; вече никога няма да имат дял в нещо, което се прави под слънцето."},
	{7, "7 Иди, яж хляба си с радост и пий виното си с весело сърце, защото Бог вече е благоволил в делата ти."},
	{8, "8 Нека дрехите ти бъдат винаги бели и нека не липсва масло на главата ти."},
	{9, "9 Наслаждавай се на живота с жената, която обичаш, през всичките дни на суетния си живот, който Той ти е дал под слънцето, във всичките дни на своята суета, защото това е делът ти в живота и в труда ти, в който се трудиш под слънцето."},
	{10, "10 Всичко, което ръката ти намери да прави, направи със силата си, понеже няма нито работа, нито размисъл, нито знание, нито мъдрост в Шеол, където отиваш."},
	{11, "11 Обърнах се и видях под слънцето, че надбягването не е на бързите, нито боят — на силните, нито хлябът — на мъдрите, нито богатствата — на проницателните, нито благоволението — на изкусните, защото времето и случаят постигат всички тях."},
	{12, "12 Защото и човек не знае времето си; както рибите, уловени в зла мрежа и както птиците, уловени в примка, като тях и човешките синове се улавят в зло време, когато то ги сполети внезапно."},
	{13, "13 Също и това видях като мъдрост под слънцето, и тя ми се видя голяма:"},
	{14, "14 Имаше малък град с малцина мъже в него; и велик цар дойде против него и го обсади, и съгради около него големи обсадни съоръжения,"},
	{15, "15 но в него се намери беден мъдър човек и той чрез мъдростта си избави града. Но никой не си спомни за онзи беден човек."},
	{16, "16 Тогава казах: Мъдростта е по-добра от силата. Но мъдростта на сиромаха се презира и думите му не се чуват."},
	{17, "17 Думите на мъдрите, чути в тишина, са повече от вика на властващия между безумни."},
	{18, "18 Мъдростта е по-добра от военни оръжия; но един грешник погубва много добри неща."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct bg10 poems[] = {
	{1, "1 Умрели мухи развалят маслото на мировареца и го правят да вони; същото прави и малко безумие на един, който е уважаван за мъдрост и чест."},
	{2, "2 Разумът на мъдрия е в десницата му, а разума на безумния — в левицата му."},
	{3, "3 Дори когато безумният ходи по пътя, той няма разум и показва на всекиго, че е безумен."},
	{4, "4 Ако духът на владетеля се надигне против теб, не напускай мястото си, защото кротостта предотвратява големи грехове."},
	{5, "5 Има зло, което видях под слънцето, като грешка, произхождаща от владетеля —"},
	{6, "6 безумието се поставя на голяма почит, а богатите седят на скромни места."},
	{7, "7 Видях слуги на коне и князе да ходят на земята като слуги."},
	{8, "8 Който копае яма, ще падне в нея и който разбива ограда, змия ще го ухапе."},
	{9, "9 Който копае камъни, ще се рани от тях; който цепи дърва, се излага на опасност от тях."},
	{10, "10 Ако се притъпи желязото и човек не наточи острието, трябва да използва повече сила. А мъдростта е полезна за оправяне."},
	{11, "11 Ако змията ухапе, преди да бъде омаяна, няма полза за омайвача."},
	{12, "12 Думите от устата на мъдрия са благодатни, а устните на безумния ще го погълнат;"},
	{13, "13 началото на думите на устата му е безумие, и краят на говоренето му е дива лудост."},
	{14, "14 Безумният умножава думи, но човек не знае какво ще бъде, и кой може да му извести какво ще бъде след него?"},
	{15, "15 Трудът на безумните ги уморява, понеже те дори не знаят как да отидат в града."},
	{16, "16 Горко ти, земьо, когато царят ти е дете и първенците ти преяждат сутрин!"},
	{17, "17 Блазе ти, земьо, когато царят ти е син на благородни и първенците ти ядат навреме — за укрепване, а не за напиване!"},
	{18, "18 От леност се съсипва къщният покрив и от безделието на ръцете къщата прокапва."},
	{19, "19 Угощение се приготвя за забавление и виното весели живота, а парите отговарят на всичко."},
	{20, "20 Не проклинай царя дори и в мисълта си и не проклинай богатия дори и в спалнята си, защото небесна птица може да отнесе гласа ти и крилата птица да разкаже това."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct bg11 poems[] = {
	{1, "1 Хвърли хляба си по водата, защото след много дни ще го намериш."},
	{2, "2 Дай дял на седмина и още на осмина, защото не знаеш какво зло ще бъде на земята."},
	{3, "3 Ако облаците са пълни, изливат дъжд на земята; и ако дърво падне на юг или на север, на мястото, където дървото падне, там си остава."},
	{4, "4 Който се взира във вятъра, няма да сее и който гледа на облаците, няма да жъне."},
	{5, "5 Както не знаеш пътя на вятъра и както не знаеш как духът влиза в костите на утробата на бременната, така не знаеш и действието на Бога, който прави всичко."},
	{6, "6 Сей семето си сутрин и вечер не въздържай ръката си, защото не знаеш кое ще успее — това или онова, или и двете ще са еднакво добри."},
	{7, "7 И светлината е сладка, и е добро за очите да виждат слънцето,"},
	{8, "8 но дори човек да живее много години и да се весели през всички тях, нека си спомня дните на тъмнината, защото ще бъдат много. Всичко, което идва, е суета."},
	{9, "9 Весели се, младежо, в младостта си и нека сърцето ти се радва в дните на младостта ти. Ходи в пътищата на сърцето си и в това, което гледат очите ти, но знай, че за всичко това Бог ще те доведе на съд."},
	{10, "10 Затова отмахни от сърцето си печалта и отдалечи злото от плътта си — защото младостта и черните коси са суета."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct bg12 poems[] = {
	{1, "1 И помни Създателя си в дните на младостта си, преди да дойдат дните на злото и да се приближат годините, за които ще кажеш: Нямам удоволствие от тях! —"},
	{2, "2 преди да се помрачат слънцето и светлината, и луната, и звездите и да се върнат облаците след дъжда;"},
	{3, "3 във времето, когато стражите на къщата треперят и се прегърбват силните мъже; и онези, които мелят, престават, защото намаляха; и очите на гледащите през прозорците се помрачават;"},
	{4, "4 когато вратите към улицата се затварят и звукът на мелницата заглъхва, и човек става при звука на птица, и всички тонове на песента се приглушават;"},
	{5, "5 и се страхуват от височина и от ужаси по пътя; и бадемът разцъфтява и натегва скакалецът, и охотата изчезва, защото човек отива във вечния си дом и жалеещите обикалят улиците —"},
	{6, "6 преди да се скъса сребърната верижка и да се счупи златната чаша, и да се строши стомната при извора, и да се счупи колелото на кладенеца,"},
	{7, "7 и пръстта да се върне в земята, както е била, а духът да се върне при Бога, който го е дал."},
	{8, "8 Суета на суетите! — казва проповедникът. — Всичко е суета."},
	{9, "9 И освен че беше мъдър, проповедникът учеше и народа на знание; и обмисляше, издирваше и подреждаше много притчи."},
	{10, "10 Проповедникът търсеше да намери благоугодни думи и писаното беше право, думи на истина."},
	{11, "11 Думите на мъдрите са като остени и думите на събраните мъдрости са като добре забити гвоздеи, дадени от един Пастир."},
	{12, "12 И освен това, сине мой, приеми поучение: Правенето на много книги няма край и многото учене е уморително за плътта."},
	{13, "13 Нека чуем свършека на цялото слово: Бой се от Бога и пази заповедите Му, понеже това е всичко за човека —"},
	{14, "14 защото Бог ще доведе всяко дело на съда над всичко скрито, било то добро или зло."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};