#include <map>
#include <string>
class Bible60
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
	struct bg5	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Петър, апостол на Иисус Христос, до пришълците, пръснати из Понт, Галатия, Кападокия, Азия и Витиния,"},
	{2, "2 избрани по предузнанието на Бог Отец чрез освещението на Духа, за да сте послушни и да бъдете поръсени с кръвта на Иисус Христос: Благодат и мир да ви се умножи!"},
	{3, "3 Благословен да бъде Бог и Отец на нашия Господ Иисус Христос, който според голямата Си милост ни новороди за жива надежда чрез възкресението на Иисус Христос от мъртвите,"},
	{4, "4 за наследство нетленно и неопетнено, и което не повяхва, запазено на небесата за вас,"},
	{5, "5 които с Божията сила сте пазени чрез вяра за спасение, готово да се открие в последното време,"},
	{6, "6 в което вие се радвате, макар и за малко време да поскърбите сега, ако е потребно, в различни изкушения,"},
	{7, "7 така че изпитването на вашата вяра – по-скъпоценна от златото, което е преходно, но пак се изпитва чрез огън – да излезе за хвала и почест, и слава, когато се яви Иисус Христос,"},
	{8, "8 когото любите, без да сте Го видели, в когото като вярвате, без сега да Го виждате, се радвате с неизказана и преславна радост,"},
	{9, "9 като получавате следствието на вярата си – спасението на душите."},
	{10, "10 За това спасение търсиха и изследваха пророците, които пророкуваха за благодатта, която е за вас,"},
	{11, "11 като издирваха кое или какво време посочваше Христовият Дух, който беше в тях, когато предизвестяваше страданията на Христос и последващите ги слави."},
	{12, "12 И им се откри, че не за себе си, а за вас служеха те в това, което сега ви се извести чрез онези, които ви проповядваха благовестието чрез Светия Дух, изпратен от небесата, в което и ангели желаят да надникнат."},
	{13, "13 Затова, препашете се през слабините на вашите мисли, бъдете трезви и имайте пълна надежда за благодатта, която ще ви се даде при явяването на Иисус Христос."},
	{14, "14 Като деца на послушанието не се съобразявайте с предишните страсти, които имахте във вашето незнание,"},
	{15, "15 а както е свят Този, който ви е призовал, така бъдете и вие свети в цялото си поведение,"},
	{16, "16 защото е писано: „Бъдете свети, понеже Аз съм свят.“"},
	{17, "17 И ако призовавате като Отец Този, който без пристрастие съди според делото на всекиго, то прекарайте със страх времето на вашето пребиваване,"},
	{18, "18 като знаете, че не с преходни неща – сребро или злато – сте изкупени от суетния живот, предаден ви от бащите ви,"},
	{19, "19 а със скъпоценната кръв на Христос, като на агне без недостатък и петно."},
	{20, "20 Той наистина е бил предузнат преди създанието на света, но се яви в тези последни времена за вас,"},
	{21, "21 които чрез Него вярвате в Бога, който Го възкреси от мъртвите и Му даде слава, така че вашата вяра и надежда да бъдат в Бога."},
	{22, "22 Тъй като сте очистили душите си чрез послушание на истината за нелицемерно братолюбие, любете се един друг горещо, с чисто сърце,"},
	{23, "23 тъй като се новородихте не от тленно семе, а от нетленно, чрез Божието слово, което живее и трае (до века)."},
	{24, "24 Защото: „Всяко създание е като трева и цялата му слава – като цвят от трева. Тревата изсъхна и цветът й окапа,"},
	{25, "25 но словото Божие трае до века.“ И това е словото, което ви е благовестено."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 И така, като отхвърлите всяка злоба, всяко лукавство, лицемерие, завист и всяко одумване,"},
	{2, "2 пожелавайте като новородени деца чистото мляко на словото, за да пораснете чрез него към спасение,"},
	{3, "3 ако наистина сте опитали, че Господ е благ."},
	{4, "4 При Него като идвате, като при жив камък, от хората отхвърлен, но от Бога избран и скъпоценен,"},
	{5, "5 вие също като живи камъни се съграждате в духовен дом, свято свещенство, да принасяте духовни жертви, благоприятни на Бога чрез Иисус Христос."},
	{6, "6 Защото е писано в Писанието: „Ето, полагам в Сион крайъгълен камък, избран, скъпоценен; и който вярва в Него, няма да се посрами.“"},
	{7, "7 За вас обаче, които вярвате, Той е скъпоценност, а за тези, които не вярват: „Камъкът, който отхвърлиха зидарите, Той стана глава на ъгъла“,"},
	{8, "8 и „Камък на препъване и канара на съблазън“, защото се препъват, бивайки непокорни, за което бяха и определени."},
	{9, "9 Но вие сте избран род, царско свещенство, свят народ, народ, който Бог придоби, за да възвестявате добродетелите на Този, който ви призова от тъмнината в Своята чудна светлина,"},
	{10, "10 които някога не бяхте народ, а сега сте Божи народ, не бяхте получили милост, а сега сте получили."},
	{11, "11 Възлюбени, умолявам ви, като пришълци и чужденци на света да се въздържате от плътски страсти, които воюват против душата,"},
	{12, "12 да живеете благоприлично между езичниците, така че за каквото ви хулят като злосторници, да могат чрез добрите ви дела, които виждат, да прославят Бога в деня на посещението."},
	{13, "13 Покорявайте се заради Господа на всяка човешка власт – било на царя, като на върховна власт,"},
	{14, "14 било на управниците, като на такива, които са пратени от него за наказание на злосторниците и за похвала на тези, които вършат добро."},
	{15, "15 Защото това е Божията воля – като правите добро, да накарате да замълчи невежеството на безумните хора,"},
	{16, "16 като свободни, но не употребяващи свободата за покривало на злото, а като Божии слуги."},
	{17, "17 Почитайте всички, любете братството, от Бога се бойте, царя почитайте."},
	{18, "18 Слуги, покорявайте се на господарите си с пълен страх – не само на добрите и кротките, а и на опърничавите,"},
	{19, "19 защото това е благодат, ако някой от съзнанието за Бога претърпява скръб, като страда несправедливо."},
	{20, "20 Защото каква похвала, ако понасяте търпеливо, когато ви бият за престъпленията ви? Но когато вършите добро и страдате, ако понасяте търпеливо, това е благодат пред Бога."},
	{21, "21 Защото за това сте призовани; понеже и Христос пострада за вас, като ви остави пример, за да следвате по Неговите стъпки;"},
	{22, "22 който грях не е сторил, нито се е намерило лукавство в устата Му;"},
	{23, "23 който, когато Го хулеха, с хула не отвръщаше; когато страдаше, не заплашваше, а предаваше делото Си на Този, който съди справедливо;"},
	{24, "24 който Сам понесе в тялото Си нашите грехове на дървото, така че ние, като сме умрели за греховете, да живеем за правдата; чрез чиито рани вие оздравяхте."},
	{25, "25 Защото вие бяхте като овце, които блуждаят, но сега се върнахте при Пастира и Надзорника на вашите души."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 Също така и вие, жени, покорявайте се на мъжете си, така че даже ако някои от тях не се покоряват на словото, да се спечелят без слово, чрез поведението на жените си,"},
	{2, "2 като видят вашето поведение в страх и чистота."},
	{3, "3 Вашето украшение да не е външно, тоест плетене на косата, кичене със злато или обличане със скъпи дрехи,"},
	{4, "4 а скритият човек на сърцето, с нетленното украшение на кротък и тих дух, което е скъпоценно пред Бога."},
	{5, "5 Защото така някога и светите жени, които се надяваха на Бога, украсяваха себе си, като се покоряваха на мъжете си,"},
	{6, "6 както Сара се покоряваше на Авраам и го наричаше господар, чиито деца станахте и вие, като правите добро и не се боите от никаква заплаха."},
	{7, "7 Също и вие, мъже, живейте благоразумно, като с по-слаб съсъд, с женския пол и им отдавайте почит като на сънаследници на благодатта на живота, за да не бъдат възпрепятствани молитвите ви."},
	{8, "8 А най-после, бъдете всички единомислени, състрадателни, братолюбиви, милостиви, смирени."},
	{9, "9 Не връщайте зло за зло или хула за хула, а напротив, благославяйте, като знаете, че за това бяхте призовани, за да наследите благословение."},
	{10, "10 Защото, „който желае да люби живота и да види добри дни, нека пази езика си от зло и устните си – от лъжливо говорене;"},
	{11, "11 нека се отклони от злото и да върши добро; нека търси мир и да се стреми към него."},
	{12, "12 Защото очите на Господа са върху праведните и ушите Му – към тяхната молитва, но лицето на Господа е против онези, които вършат зло.“"},
	{13, "13 И кой ще ви стори зло, ако сте станали ревностни за доброто?"},
	{14, "14 Но ако пострадате за правдата, блажени сте; а „от тяхното заплашване не се бойте, и не се смущавайте.“"},
	{15, "15 Но пазете свят в сърцата си Христос като Господ и бъдете винаги готови да отговаряте на всеки, който ви пита за причината за вашата надежда, но с кротост и страхопочитание,"},
	{16, "16 като имате чиста съвест, така че във всичко, в което ви одумват като злосторници, да се посрамят онези, които клеветят доброто ви поведение в Христос."},
	{17, "17 Защото е по-добре да страдате, като вършите добро, ако е такава Божията воля, а не като вършите зло."},
	{18, "18 Защото и Христос един път пострада за греховете – Праведният за неправедните – за да ни приведе при Бога, бидейки умъртвен по плът, но оживотворен по Дух;"},
	{19, "19 в когото Той също отиде да проповядва на духовете в тъмницата,"},
	{20, "20 които едно време бяха непокорни, когато Божието дълготърпение ги чакаше в дните на Ной, докато се правеше ковчегът, в който малцина, тоест осем души, се спасиха през вода,"},
	{21, "21 чийто образ, кръщението, и сега ви спасява – не измиването на плътската нечистота, а молбата към Бога за чиста съвест – чрез възкресението на Иисус Христос,"},
	{22, "22 който се е възнесъл на небето и е отдясно на Бога и на когото се покориха ангели, власти и сили."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 И така, понеже Христос пострада по плът, въоръжете се и вие със същата мисъл, защото този, който е пострадал по плът, се е оставил от греха,"},
	{2, "2 за да живеете през останалото в плътта време не вече по човешките страсти, а по Божията воля."},
	{3, "3 Защото достатъчно е миналото време, когато постъпвахте като езичниците, като живеехте в разпуснатост, страсти, пиянство, гуляи, опивания и омразни идолослужения."},
	{4, "4 Затова те се и чудят и ви хулят, че не тичате в същия поток на разпуснатостта,"},
	{5, "5 но те ще отговарят пред Онзи, който е готов да съди живите и мъртвите."},
	{6, "6 Затова именно беше проповядвано благовестието и на мъртви, за да бъдат съдени по човешки в плът, но да живеят по Бога в дух."},
	{7, "7 А краят на всичко е близо, затова бъдете благоразумни и бодърствайте в молитвите си."},
	{8, "8 Преди всичко имайте усърдна любов помежду си, защото любовта покрива множество грехове."},
	{9, "9 Бъдете гостолюбиви едни към други, без да роптаете."},
	{10, "10 Според дарбата, която всеки е приел, служете с нея един на друг като добри настойници на многообразната Божия благодат."},
	{11, "11 Ако говори някой, нека говори като Божии думи; ако служи някой, нека служи според силата, която му дава Бог; за да се слави във всичко Бог чрез Иисус Христос, на когото е славата и господството до вечни векове. Амин."},
	{12, "12 Възлюбени, не се чудете на огненото изпитание, което идва върху вас, за да ви изпита, като че ви се случва нещо чудно,"},
	{13, "13 а се радвайте, доколкото сте участници в страданията на Христос, за да се радвате и ликувате и когато се яви Неговата слава."},
	{14, "14 Блажени сте, ако ви опозоряват за Христовото Име, защото Духът на славата и на Бога почива на вас; (откъм тях се хули, а откъм вас се прославя)."},
	{15, "15 Но нека никой от вас не страда като убиец или крадец, или злодей, или като такъв, който се бърка в чужди работи."},
	{16, "16 Но ако страда някой като християнин, да не се срамува, а да слави Бога с това име."},
	{17, "17 Защото дойде времето да се започне съдът от Божия дом; и ако започне първо от нас, какъв ще бъде краят на тези, които не се покоряват на Божието благовестие?"},
	{18, "18 И ако праведният едва се спасява, то къде ще се яви безбожният и грешният?"},
	{19, "19 Затова и тези, които страдат по Божията воля, нека предават душите си на верния Създател, като вършат добро."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct bg5 poems[] = {
	{1, "1 И така, старейшините, които са между вас, увещавам аз, който също съм старейшина и свидетел на страданията на Христос, и участник на славата, която има да се яви:"},
	{2, "2 пасете Божието стадо, което е между вас; надзиравайте го не по принуда, а с добра воля, като за Бога, нито за гнусна печалба, а с усърдие,"},
	{3, "3 нито като че ли сте господари над онези, които са ви поверени, а като сте пример на стадото."},
	{4, "4 И когато се яви Пастироначалникът, ще получите венеца на славата, който не повяхва."},
	{5, "5 Така и вие, по-младите, се покорявайте на старейшините. Да! А всички се облечете със смирение, като се покорявате един на друг, защото „Бог се противи на горделивите, а на смирените дава благодат.“"},
	{6, "6 И така, смирете се под мощната ръка на Бога, за да ви възвиси своевременно,"},
	{7, "7 и всяка ваша грижа възложете на Него, защото Той се грижи за вас."},
	{8, "8 Бъдете трезви, бъдете бдителни, защото вашият противник, дяволът, обикаля като ревящ лъв и търси кого да погълне."},
	{9, "9 Съпротивете му се, стоейки твърди във вярата, като знаете, че същите страдания се понасят и от братството ви в света."},
	{10, "10 А Бог на всяка благодат, който ви е призовал за Своята вечна слава в Христос (Иисус), да ви усъвършенства, утвърди, укрепи и направи непоколебими, след като пострадате малко."},
	{11, "11 На Него да бъде господството до вечни векове. Амин."},
	{12, "12 Чрез Сила, верния брат, както мисля, ви писах накъсо, като ви насърчавам и заявявам, че това е истинската Божия благодат, в която вие стоите."},
	{13, "13 Поздравява ви и избраната заедно с вас църква във Вавилон, а също и синът ми Марк."},
	{14, "14 Поздравете се един друг с целувка на любов. Мир на всички вас, които сте в Христос. Амин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};