#include <map>
#include <string>
class Bible51
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Павел, с Божията воля апостол на Иисус Христос, и брат Тимотей"},
	{2, "2 до светите и верни братя в Христос, които са в Колос: Благодат и мир да бъде на вас от Бога, нашия Отец, (и Господ Иисус Христос)."},
	{3, "3 Благодарим на Бога и Отца на нашия Господ Иисус Христос, като се молим винаги за вас,"},
	{4, "4 понеже чухме за вашата вяра в Христос Иисус и за вашата любов към всичките светии,"},
	{5, "5 заради надеждата, която се пази за вас на небесата, за която сте чули преди това в словото на истината на благовестието,"},
	{6, "6 което дойде до вас, както е и в целия свят, и принася плод и расте, както и между вас от деня, когато чухте и познахте Божията благодат в истина,"},
	{7, "7 което и научихте от нашия възлюбен съработник Епафрас, който е верен служител на Христос за вас;"},
	{8, "8 който и ни извести за вашата любов в Духа."},
	{9, "9 Затова и ние от деня, когато чухме за това, не преставаме да се молим за вас и да молим от Бога да се изпълните с познаването на Неговата воля чрез пълна мъдрост и духовно разбиране,"},
	{10, "10 за да живеете достойно за Господа и да Му бъдете във всичко угодни, като принасяте плод във всяко добро дело и като растете в познаването на Бога,"},
	{11, "11 подкрепяни с пълна сила според мощта на Неговата слава, за да издържите и дълготърпите всичко с радост,"},
	{12, "12 като благодарите на Отца, който ни направи способни да участваме в наследството на светиите в светлината,"},
	{13, "13 който ни избави от властта на тъмнината и ни пресели в царството на Своя възлюбен Син,"},
	{14, "14 в когото ние имаме изкупление чрез Неговата кръв, прощението на греховете."},
	{15, "15 Той е образ на невидимия Бог, Първородният на цялото творение;"},
	{16, "16 защото в Него беше създадено всичко, което е на небесата и на земята, видимото и невидимото – било престоли или господства, или началства, или власти – всичко беше създадено чрез Него и за Него;"},
	{17, "17 и Той е преди всичко и всичко чрез Него се крепи."},
	{18, "18 И Той е главата на тялото, тоест на църквата; Той е Началото, Първородният от мъртвите, за да има първенство във всичко."},
	{19, "19 Защото в Него благоволи Отец да обитава цялата пълнота"},
	{20, "20 и чрез Него да примири със Себе Си всичко – било на земята, или на небето – като въдвори мир чрез кръвта, пролята на Неговия кръст."},
	{21, "21 И вас, които някога бяхте отчуждени от Него и врагове по разположение чрез злите си дела,"},
	{22, "22 сега примири в тялото на Неговата плът чрез смъртта, за да ви представи пред Себе Си свети, непорочни и безупречни,"},
	{23, "23 ако останете основани и твърди във вярата и без да се помръднете от надеждата на благовестието, което сте чули и което е било проповядвано в цялото творение под небесата, на което аз, Павел, станах служител."},
	{24, "24 И сега се радвам в страданията си за вас и допълвам в плътта си това, което още не достига на скърбите на Христос за Неговото тяло, което е църквата,"},
	{25, "25 на която станах служител според Божието настойничество, което ми беше възложено за вас, за да изпълня словото на Бога,"},
	{26, "26 тоест тайната, която е била скрита от векове и от поколения, а сега беше открита на Неговите светии,"},
	{27, "27 на които Бог пожела да изяви какви са богатствата на славата на тази тайна между езичниците, която е Христос във вас, надеждата на славата."},
	{28, "28 Него ние възвестяваме, като наставляваме всеки човек и поучаваме всеки човек с пълна мъдрост, за да представим всеки човек съвършен в Христос."},
	{29, "29 Затова се трудя и аз, като се боря според Неговата сила, която мощно действа в мен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 Защото желая да знаете каква голяма борба имам за вас и за онези, които са в Лаодикия, и за онези, които не са ме виждали лично,"},
	{2, "2 за да се утешат сърцата им, като се свържат заедно в любов, за всички богатства на пълното проумяване, за познаването на тайната на Бога – Христос,"},
	{3, "3 в когото са скрити всичките съкровища на мъдростта и на познанието."},
	{4, "4 И това казвам, за да не би да ви измами някой с убедителни думи."},
	{5, "5 Защото, макар и да не съм с вас тялом, пак духом съм с вас и се радвам, като гледам вашия ред и твърдостта на вашата вяра в Христос."},
	{6, "6 И така, както сте приели Христос Иисус, Господа, така и ходете в Него,"},
	{7, "7 вкоренени и изграждани в Него и утвърждавани във вярата така, както бяхте научени, като изобилствате в нея с благодарение."},
	{8, "8 Внимавайте да не ви заплени някой с философия и с празна измама, според човешки предания и първоначалните неща на света, а не според Христос."},
	{9, "9 Защото в Него обитава телесно цялата пълнота на Божеството"},
	{10, "10 и вие също имате пълнота в Него, който е глава на всяко началство и власт."},
	{11, "11 В Него бяхте също и обрязани с обрязване, не извършено от ръка, а с обрязването, което е от Христос, като съблякохте плътското тяло."},
	{12, "12 Погребани бяхте с Него в кръщението, в Него бяхте и съвъзкресени чрез вяра в действието на Бога, който Го възкреси от мъртвите."},
	{13, "13 И вас, които бяхте мъртви в прегрешенията си и необрязването на плътта си, Той съживи с Него, като прости всичките ви престъпления."},
	{14, "14 Той изличи написаното в постановленията на закона, което беше против нас, и го отстрани отсред нас, като го прикова на кръста;"},
	{15, "15 и като разоръжи началствата и властите, Той ги изложи открито на показ, тържествувайки над тях чрез него."},
	{16, "16 И така, никой да не ви осъжда за ястие или питие, или във връзка с някой празник или новолуние, или събота,"},
	{17, "17 които са сянка на бъдещето, но тялото е Христово."},
	{18, "18 Никой да не ви отнема наградата, вършейки собствената си воля в смирение и поклонение на ангели, като се вглъбява в неща, които не е видял, и напразно се надува с плътския си ум,"},
	{19, "19 а не държи Главата, Христос, от която цялото тяло, подкрепяно и сглобявано чрез своите стави и връзки, расте с растежа на Бога."},
	{20, "20 И така, ако сте умрели с Христос за първоначалните неща на света, тогава защо, като че ли живеете в света, се подчинявате на постановления като:"},
	{21, "21 Не докосвай; не хващай; не вкусвай,"},
	{22, "22 които всички се развалят от употреба, според човешки заповеди и учения?"},
	{23, "23 Тези неща наистина имат вид на мъдрост в своеволно богослужение и смирение, и в нещадене на тялото, но нямат никаква стойност, а са за угаждането на плътта."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 И така, ако сте били възкресени заедно с Христос, търсете това, което е горе, където Христос седи отдясно на Бога."},
	{2, "2 Мислете за горното, а не за земното;"},
	{3, "3 защото умряхте и животът ви е скрит с Христос в Бога."},
	{4, "4 Когато Христос, нашият живот, се яви, тогава и вие ще се явите с Него в слава."},
	{5, "5 Затова умъртвете земното у вас: блудство, нечистота, страст, зли желания и сребролюбие, което е идолопоклонство,"},
	{6, "6 заради които Божият гняв идва върху синовете на непокорството,"},
	{7, "7 сред които и вие някога сте ходили, когато живеехте в тези неща."},
	{8, "8 Но сега отхвърлете и вие всичко това: гняв, ярост, злоба, хулене, срамно говорене с устата."},
	{9, "9 Не се лъжете един друг, понеже сте съблекли вече стария човек с делата му"},
	{10, "10 и сте облекли новия, който се подновява в познаване по образа на Този, който го е създал,"},
	{11, "11 където няма грък или юдеин, обрязан или необрязан, варварин, скит, роб или свободен, а Христос е всичко и във всичко."},
	{12, "12 И така, като Божии избрани, свети и възлюбени, облечете се с милосърдие, благост, смирение, кротост, дълготърпение,"},
	{13, "13 като си претърпявате един на друг и един на друг си прощавате, ако някой има оплакване против някого; както и Господ е простил на вас, така прощавайте и вие."},
	{14, "14 А над всичко това облечете се в любовта, която свързва всичко в съвършенство."},
	{15, "15 И нека в сърцата ви царува Божият мир, за който и бяхте призовани в едно тяло; и бъдете благодарни."},
	{16, "16 Нека Христовото слово да се вселява във вас богато; с пълна мъдрост се учете и се увещавайте с псалми и химни, и духовни песни, като пеете на Господа с благодат в сърцата си."},
	{17, "17 И каквото и да вършите със слово или дело, вършете всичко в Името на Господ Иисус, като благодарите чрез Него на Бог и Отец."},
	{18, "18 Жени, подчинявайте се на мъжете си, както е подобаващо в Господа."},
	{19, "19 Мъже, любете жените си и не се огорчавайте срещу тях."},
	{20, "20 Деца, покорявайте се на родителите си във всичко, защото това е угодно на Господа."},
	{21, "21 Бащи, не дразнете децата си, за да не се обезсърчават."},
	{22, "22 Слуги, покорявайте се във всичко на господарите си по плът, като работите не за пред очи, като че угаждате на хора, а със сърдечна простота, боейки се от Господа."},
	{23, "23 Каквото и да вършите, работете от сърце, като за Господа, а не като за хора,"},
	{24, "24 като знаете, че като отплата от Господа ще получите наследството, тъй като вие служите на Господ Христос."},
	{25, "25 А всеки, който върши неправда, ще получи обратно своята неправда, и то без никакво пристрастие."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 Господари, отдавайте на слугите си това, което е справедливо и им се полага, като знаете, че и вие имате Господар на небето."},
	{2, "2 Постоянствайте в молитва и бдете в нея с благодарение."},
	{3, "3 Молете се също и за нас – Бог да ни отвори врата за словото, за да говоря тайната на Христос, за която аз съм и в окови,"},
	{4, "4 да я изявя така, както трябва да говоря."},
	{5, "5 Отнасяйте се мъдро с външните, като изкупувате благоприятното време."},
	{6, "6 Това, което говорите, да бъде винаги с благодат, подправено със сол, за да знаете как трябва да отговаряте на всекиго."},
	{7, "7 Що се отнася до мен, всичко ще ви каже Тихик, възлюбеният ми брат и верният служител и съработник в Господа,"},
	{8, "8 когото изпратих до вас точно затова – за да узнаете моето състояние и той да утеши сърцата ви."},
	{9, "9 Изпратих с него и верния и възлюбен брат Онисим, който е от вас. Те ще ви кажат всичко за тук."},
	{10, "10 Поздравява ви Аристарх, който е затворен заедно с мен, и Марк, племенникът на Варнава, за когото получихте поръчката – ако дойде при вас, приемете го,"},
	{11, "11 и Иисус, наречен Юст. Тези са единствените мои съработници за Божието царство от обрязаните, които са ми били утеха."},
	{12, "12 Поздравява ви Епафрас, служителят на Иисус Христос, който е от вас и който винаги се бори в молитва за вас, за да стоите съвършени и напълно уверени в цялата Божия воля."},
	{13, "13 Защото свидетелствам за него, че се труди много за вас и за тези, които са в Лаодикия и в Йерапол."},
	{14, "14 Поздравяват ви възлюбеният лекар Лука и Димас."},
	{15, "15 Поздравете братята, които са в Лаодикия, и Нимфан и събранието в неговия дом."},
	{16, "16 И като прочетете това писмо помежду си, наредете да се прочете и в лаодикийската църква и по същия начин да прочетете и вие това, което е от Лаодикия."},
	{17, "17 И кажете на Архип: Внимавай в службата, която си приел от Господа – да я изпълниш!"},
	{18, "18 Поздрава пиша аз, Павел, със собствената си ръка. Помнете оковите ми. Благодатта да бъде с вас. (Амин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};