#include <map>
#include <string>
class Bible58
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
	struct bg5	{ int val; const char *msg; };
	struct bg6	{ int val; const char *msg; };
	struct bg7	{ int val; const char *msg; };
	struct bg8	{ int val; const char *msg; };
	struct bg9	{ int val; const char *msg; };
	struct bg10	{ int val; const char *msg; };
	struct bg11	{ int val; const char *msg; };
	struct bg12	{ int val; const char *msg; };
	struct bg13	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Бог, който много пъти и по много начини е говорил в миналото на бащите ни чрез пророците,"},
	{2, "2 в края на тези дни говори на нас чрез Сина, когото постави Наследник на всичко, чрез когото също направи световете,"},
	{3, "3 който, бидейки сияние на Неговата слава и отпечатък на Неговото същество и държейки всичко чрез словото на Своята мощ, след като извърши (чрез Себе Си) очистване на греховете, седна отдясно на Величието във висините"},
	{4, "4 и стана толкова по-горен от ангелите, колкото Името, което е наследил, е по-горно от тяхното."},
	{5, "5 Защото, на кого от ангелите Бог е казал някога: ?Ти Си Мой Син, Аз днес Те родих“; и пак: ?Аз ще Му бъда Отец и Той ще Ми бъде Син“?"},
	{6, "6 И когато отново въвежда Първородния във вселената, казва: ?Да Му се поклонят всички Божии ангели.“"},
	{7, "7 И за ангелите казва: ?Който прави ангелите Си ветрове и служителите Си – огнен пламък.“"},
	{8, "8 А за Сина казва: ?Твоят престол, Боже, е до вечни векове и скиптърът на Твоето царство е скиптър на правота."},
	{9, "9 Възлюбил си правда и си намразил беззаконие; затова, Боже, Твоят Бог Те е помазал с миро на радост повече от Твоите събратя.“"},
	{10, "10 И пак: ?В началото Ти, Господи, си основал земята и дело на Твоите ръце са небесата."},
	{11, "11 Те ще изчезнат, а Ти пребъдваш. Да! Те всички ще овехтеят като дреха"},
	{12, "12 и като одежда ще ги свиеш, и те ще бъдат изменени; но Ти си същият и Твоите години няма да се свършат.“"},
	{13, "13 А на кого от ангелите е казал някога: ?Седи отдясно Ми, докато положа враговете Ти под краката Ти“?"},
	{14, "14 Не са ли те всички служебни духове, изпращани да слугуват заради онези, които ще наследят спасение?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 Затова ние сме длъжни да внимаваме още повече на това, което сме чули, за да не би да се разминем с целта."},
	{2, "2 Защото, ако словото, изговорено чрез ангели, беше твърдо и всяко престъпление и непокорство получи справедлива отплата,"},
	{3, "3 то как ще избегнем ние, ако пренебрегнем едно толкова велико спасение, което отначало беше прогласено от Господа и беше потвърдено между нас от тези, които го бяха чули,"},
	{4, "4 като Бог също свидетелстваше чрез знамения и чудеса, чрез разни велики дела и чрез раздаване на Светия Дух според Своята воля?"},
	{5, "5 Защото не на ангели Той подчини бъдещата вселена, за която говорим;"},
	{6, "6 но някой е засвидетелствал някъде, като е казал: ?Какво е човек, че да го помниш, или човешки син, че да го зачиташ?"},
	{7, "7 Ти си го направил малко по-долен от ангелите, със слава и чест си го увенчал и си го поставил над делата на ръцете Си;"},
	{8, "8 всичко си подчинил под краката му.“ И като му е подчинил всичко, не е оставил нищо неподчинено на него; но сега ние не виждаме още да му е подчинено всичко."},
	{9, "9 Но виждаме Иисус, който за малко време е бил поставен по-долу от ангелите заради претърпяната смърт, че е увенчан със слава и чест, за да вкуси смърт, с Божията благодат, за всеки човек."},
	{10, "10 Защото беше уместно Онзи, заради когото е всичко и чрез когото е всичко, като довежда много синове до слава, да направи съвършен чрез страдания Автора на тяхното спасение."},
	{11, "11 Понеже и Онзи, който освещава, и онези, които се освещават, всички са от Един; по която причина Той не се срамува да ги нарича братя,"},
	{12, "12 като казва: ?Ще възвестявам Името Ти на братята Си, ще Те хваля сред събранието.“"},
	{13, "13 И пак: ?Аз на Него ще се уповавам.“ И пак: ?Ето, Аз и децата, които Ми е дал Бог.“"},
	{14, "14 И така, понеже децата са участници в плът и кръв, то и Той подобно взе участие в същите неща, за да унищожи чрез смъртта този, който има властта на смъртта, тоест дявола,"},
	{15, "15 и да избави всички онези, които чрез страха от смъртта през целия си живот са били подчинени на робство."},
	{16, "16 Защото наистина Той не помогна на ангелите, а помогна на Авраамовото потомство."},
	{17, "17 Затова трябваше да стане във всичко като братята Си, за да бъде милостив и верен Първосвещеник пред Бога, за да извърши умилостивение за греховете на народа."},
	{18, "18 Защото в това, в което Самият Той пострада, като беше изкушен, може и на изкушаваните да помага."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 Затова, свети братя, участници в небесното призвание, размислете за Апостола и Първосвещеника, когото ние изповядваме – Христос Иисус,"},
	{2, "2 който е верен на Този, който Го постави, както беше и Мойсей в целия Негов дом."},
	{3, "3 Понеже Той се удостои със слава, толкова по-голяма от тази на Мойсей, колкото е по-голяма почитта, която има онзи, който е построил къщата, от почитта, която има къщата."},
	{4, "4 Защото всяка къща се строи от някого, а Този, който е построил всичко, е Бог."},
	{5, "5 И Мойсей беше верен в целия Негов дом като слуга, за да засвидетелства за онова, което щеше да се оповести по-късно;"},
	{6, "6 а Христос – като Син над Неговия дом. Неговият дом сме ние, ако държим здраво дръзновението и похвалата на надеждата докрай."},
	{7, "7 Затова, както казва Светият Дух: ?Днес, ако чуете гласа Му,"},
	{8, "8 не закоравявайте сърцата си както в преогорчението, както в деня на изкушението в пустинята,"},
	{9, "9 където бащите ви Ме изкушиха, изпитаха Ме и видяха делата Ми четиридесет години."},
	{10, "10 Затова се разгневих на това поколение и казах: Всякога се заблуждават в сърцата си и не са познали Моите пътища."},
	{11, "11 Така се заклех в гнева Си: Те няма да влязат в Моята почивка!“"},
	{12, "12 Внимавайте, братя, да не би да има в някого от вас зло сърце на неверие, което да отстъпи от живия Бог."},
	{13, "13 Но се увещавайте един друг всеки ден, докато е още ?днес“, за да не би някой от вас да се закорави чрез измамата на греха."},
	{14, "14 Защото ние сме станали участници в Христос, ако удържим твърдо първоначалната си увереност докрай;"},
	{15, "15 докато се казва: ?Днес, ако чуете гласа Му, не закоравявайте сърцата си както в преогорчението.“"},
	{16, "16 Защото кои бяха тези, които, като чуха, Го преогорчиха? Не бяха ли всички онези, които излязоха от Египет с Мойсей?"},
	{17, "17 А против кои се гневи четиридесет години? Не против онези ли, които съгрешиха и чиито трупове паднаха в пустинята?"},
	{18, "18 На кои още се закле, че няма да влязат в Неговата почивка? Не на онези ли, които бяха непокорни?"},
	{19, "19 И така, виждаме, че те не можаха да влязат поради неверието си."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 И така, докато ни остава обещанието да влезем в Неговата почивка, нека се боим да не би някой от вас да се яви изостанал."},
	{2, "2 Защото и до нас, както и до тях, се донесе една блага вест; но словото, което те чуха, не ги ползва, понеже не се съедини с вяра в онези, които го чуха."},
	{3, "3 Защото ние, повярвалите, влизаме в тази почивка, както каза Бог: ?Така се заклех в гнева Си: Те няма да влязат в Моята почивка!“; макар и делата Му да са били свършени още при основаването на света."},
	{4, "4 Защото някъде Той е говорил за седмия ден така: ?И Бог си почина на седмия ден от всичките Си дела“;"},
	{5, "5 и пак на това място: ?Няма да влязат в Моята почивка!“"},
	{6, "6 И така, понеже остава, че някои влизат в нея, а онези, на които преди това се благовести, не влязоха поради непокорството си,"},
	{7, "7 затова Той пак определя един ден – ?днес“ – като казва чрез Давид след толкова дълго време, както беше казано: ?Днес, ако чуете Неговия глас, не закоравявайте сърцата си.“"},
	{8, "8 Защото, ако Иисус Навиев ги беше въвел в почивката, Бог не би говорил след това за друг ден."},
	{9, "9 Следователно, за Божия народ остава съботна почивка."},
	{10, "10 Защото онзи, който е влязъл в Неговата почивка, той също си е починал от своите дела, както и Бог – от Своите."},
	{11, "11 Затова, нека се постараем да влезем в тази почивка, за да не падне някой в същия пример на непокорство."},
	{12, "12 Защото Божието слово е живо, действено, по-остро от всеки двуостър меч, като пронизва до разделяне душата и духа, ставите и мозъка, и е съдия на помислите и намеренията на сърцето."},
	{13, "13 И няма създание, което да е скрито от Него, а всичко е голо и разкрито пред очите на Този, пред когото има да отговаряме."},
	{14, "14 И така, като имаме велик Първосвещеник, който е преминал през небесата, Иисус, Божия Син, нека държим здраво това, което сме изповядали!"},
	{15, "15 Защото нямаме такъв първосвещеник, който да не може да ни съчувства в нашите слабости, а имаме Един, който е бил във всичко изкушен по същия начин като нас, но пак е без грях."},
	{16, "16 Затова нека пристъпваме с дръзновение към престола на благодатта, за да получим милост и да намерим благодат, която да ни помага своевременно."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct bg5 poems[] = {
	{1, "1 Защото всеки първосвещеник, взет измежду хората се поставя за хората, в служене към Бога да принася дарове и жертви за грехове"},
	{2, "2 и да може да бъде снизходителен към невежите и заблудените, защото и сам той е подчинен на слабост."},
	{3, "3 И затова е длъжен да принася жертва за греховете, както за народа, така и за себе си."},
	{4, "4 И никой не взема сам тази почит, а този, който бъде призван от Бога, както беше Аарон."},
	{5, "5 Така и Христос не взе сам славата да стане първосвещеник, а Му я даде Онзи, който Му е казал: ?Ти си Мой Син, Аз днес Те родих“;"},
	{6, "6 както и на друго място казва: ?Ти си свещеник до века според Мелхиседековия чин.“"},
	{7, "7 Той в дните на плътта Си със силен вик и със сълзи принесе молитви и молби на Този, който можеше да Го избави от смърт, и като беше чут заради благоговението Си,"},
	{8, "8 въпреки че беше Син, пак се научи на послушание от това, което пострада,"},
	{9, "9 и усъвършенстван, стана причина за вечно спасение на всички, които са Му послушни;"},
	{10, "10 наречен от Бога първосвещеник според Мелхиседековия чин."},
	{11, "11 Върху това имаме да кажем много неща, които са трудни за поясняване, защото сте станали лениви да слушате."},
	{12, "12 Понеже според изтеклото време трябваше вече да сте учители, а вие имате нужда да ви учи някой отново на най-простите основи на Божиите слова и сте станали такива, които имат нужда от мляко, а не от твърда храна."},
	{13, "13 Понеже всеки, който се храни с мляко, не е опитен в словото на правдата, защото е невръстен,"},
	{14, "14 а твърдата храна е за пълнолетните, които благодарение на навика имат сетива да разпознават добро и зло."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct bg6 poems[] = {
	{1, "1 Поради това, нека оставим първоначалното учение за Христос и нека се обърнем към пълната зрялост, без да полагаме отново за основа покаянието от мъртви дела и вярата в Бога,"},
	{2, "2 учението за умивания, за ръкополагане, за възкресение на мъртвите и за вечен съд."},
	{3, "3 И това ще направим, ако Бог позволи."},
	{4, "4 Защото за тези, които веднъж са били осветлени и са опитали от небесния дар, и са станали съпричастни на Светия Дух,"},
	{5, "5 и са опитали доброто Божие слово и силите на бъдещия век,"},
	{6, "6 а са отпаднали, е невъзможно да се обновят за покаяние, като отново разпъват за себе си Божия Син и Го опозоряват."},
	{7, "7 Защото земята, която се е поила от дъжда, който пада често на нея, и която ражда полезни растения за тези, за които се и обработва, получава благословение от Бога,"},
	{8, "8 но ако ражда тръни и репеи, е негодна и е близко до проклятие, чийто край е изгаряне."},
	{9, "9 Но относно вас, възлюбени, макар и да говорим така, ние сме убедени в по-доброто и спасителното."},
	{10, "10 Защото Бог не е несправедлив, за да забрави делото ви и любовта, която показахте към Неговото Име, като послужихте и още служите на светиите."},
	{11, "11 И желаем всеки от вас да показва същото усърдие за пълна увереност в надеждата докрай,"},
	{12, "12 да не бъдете лениви, а да подражавате на онези, които чрез вяра и търпение наследяват обещанията."},
	{13, "13 Защото, когато Бог даваше обещание на Авраам, понеже нямаше никой по-голям, в когото да се закълне, се закле в Себе Си, като каза:"},
	{14, "14 ?Наистина ще те благословя премного и ще те умножа и преумножа.“"},
	{15, "15 И така, Авраам с дълготърпение получи обещаното."},
	{16, "16 Защото, както хората се кълнат в някой по-голям от тях и клетвата, дадена за потвърждение, е край на всеки спор за тях,"},
	{17, "17 така и Бог, като искаше да покаже по-пълно на наследниците на обещанието, че намерението Му е неизменимо, си послужи с клетва,"},
	{18, "18 така че чрез две неизменими неща, в които е невъзможно за Бога да лъже, да имаме голямо насърчение ние, които сме прибягнали да сграбчим поставената пред нас надежда,"},
	{19, "19 която имаме като здрава и непоколебима котва за душата и която прониква в това, което е вътре, зад завесата,"},
	{20, "20 където Иисус влезе за нас като предшественик и стана Първосвещеник според Мелхиседековия чин до века."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct bg7 poems[] = {
	{1, "1 Защото този Мелхиседек, салимски цар, свещеник на Всевишния Бог, който срещна Авраам, когато се връщаше от поражението на царете, и го благослови;"},
	{2, "2 на когото Авраам отдели също и десятък от всичко; който, според значението на името си, е първо цар на правда, а после и цар на Салим, тоест цар на мир;"},
	{3, "3 без баща, без майка, без родословие, нямащ нито начало на дни, нито край на живот, а оприличен на Божия Син, остава завинаги свещеник."},
	{4, "4 Но вижте колко велик беше този, на когото и патриархът Авраам даде десятък от плячката."},
	{5, "5 И наистина, онези от Левиевите потомци, които приемат свещенослужението, имат заповед според закона да вземат десятък от народа, тоест от братята си, макар и те да са произлезли от семенниците на Авраам;"},
	{6, "6 той обаче, който не е произлязъл от техния род, взе десятък от Авраам и благослови този, на когото бяха дадени обещанията."},
	{7, "7 А безспорно по-долният се благославя от по-горния."},
	{8, "8 И тук десятъкът се взема от смъртни хора, а там – от Този, за когото се свидетелства, че живее."},
	{9, "9 И може да се каже, че сам Леви, който взема десятък, даде десятък чрез Авраам,"},
	{10, "10 защото беше още в семенниците на баща си, когато Мелхиседек го срещна."},
	{11, "11 И така, ако можеше да има съвършенство чрез левитското свещенство – защото под него народът получи закона – каква нужда е имало още да се издига друг свещеник, според Мелхиседековия чин, и да не се определя такъв според Аароновия чин?"},
	{12, "12 Защото, като се промени свещенството, по необходимост става и промяна на закона."},
	{13, "13 Понеже Този, за когото се казва това, принадлежи на друго племе, от което никой не е служил при олтара."},
	{14, "14 Защото е явно, че нашият Господ произлезе от Юда, а за това племе Мойсей не каза нищо относно свещеници."},
	{15, "15 Това става още по-явно, тъй като по подобие на Мелхиседек се издига друг свещеник,"},
	{16, "16 който стана такъв не по закона на плътска заповед, а по силата на един неунищожим живот;"},
	{17, "17 защото се свидетелства: ?Ти си свещеник до века според Мелхиседековия чин.“"},
	{18, "18 Защото наистина по-предишната заповед се отменя поради нейната слабост и безполезност –"},
	{19, "19 понеже законът не е усъвършенствал нищо – а се въвежда една по-добра надежда, чрез която се приближаваме при Бога."},
	{20, "20 И както това не е станало без заклеване –"},
	{21, "21 защото те ставаха свещеници без заклеване, а Той – със заклеване от страна на Този, който Му казва: ?Господ се закле и няма да се разкае: Ти си свещеник до века!“ –"},
	{22, "22 така Иисус стана Поръчител на един по-добър завет."},
	{23, "23 При това, свещениците са били много на брой, защото смъртта им е пречела да продължат службата си,"},
	{24, "24 а Той, понеже живее вечно, има свещенство, което не преминава на друг."},
	{25, "25 Затова и може напълно да спасява онези, които идват при Бога чрез Него, понеже винаги живее, за да ходатайства за тях."},
	{26, "26 Защото такъв първосвещеник ни трябваше: свят, невинен, непорочен, отделен от грешните и възвисен по-горе от небесата;"},
	{27, "27 който няма нужда като първосвещениците да принася всеки ден жертви първо за своите грехове, а после за греховете на народа, защото направи това веднъж завинаги, като принесе Себе Си."},
	{28, "28 Защото законът поставя за първосвещеници хора, които са слаби; но думите на клетвата, която беше след закона, поставят Сина, който е съвършен до века."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct bg8 poems[] = {
	{1, "1 Но главното на това, което казваме, е: ние имаме такъв Първосвещеник, който седна отдясно на престола на Величието в небесата,"},
	{2, "2 Служител на светилището и на истинската скиния, която Господ е издигнал, а не човек."},
	{3, "3 Защото всеки първосвещеник се поставя, за да принася и дарове, и жертви; затова е нужно и този Първосвещеник да има също да принася нещо."},
	{4, "4 Понеже, ако беше на земята, Той дори нямаше да бъде свещеник, защото има такива, които принасят даровете според закона,"},
	{5, "5 които служат на образа и сянката на небесните неща, както на Мойсей му беше наредено от Бога, когато щеше да направи скинията: ?Внимавай, каза Бог, да направиш всичко по образеца, който ти беше показан на планината.“"},
	{6, "6 Но служението, което Христос е получил, е толкова по-превъзходно, колкото и заветът, на който Той е Посредник, е по-добър, тъй като е узаконен въз основа на по-добри обещания."},
	{7, "7 Защото, ако онзи първи завет е бил без недостатък, Бог не би търсил място за втори."},
	{8, "8 Но като ги укорява, казва: ?Ето, идат дни, казва Господ, когато ще сключа с израилевия дом и с юдовия дом нов завет:"},
	{9, "9 не такъв завет, какъвто направих с бащите им в деня, когато ги хванах за ръка, за да ги изведа от египетската земя; защото те не останаха в завета Ми и Аз не се погрижих повече за тях, казва Господ."},
	{10, "10 Защото ето заветът, който ще направя с израилевия дом след онези дни, казва Господ: ще положа законите Си в ума им и ще ги напиша в сърцата им; Аз ще бъда техен Бог и те ще бъдат Мой народ."},
	{11, "11 И няма вече да учат всеки съгражданина си и всеки брат си, като му казват: Познай Господа; защото всички ще Ме познават – от малък до голям между тях."},
	{12, "12 Защото ще покажа милост към неправдите им и греховете им и беззаконията им няма да помня вече.“"},
	{13, "13 А като каза ?нов“ завет, Той обяви първия за остарял. А онова, което овехтява и остарява, е близо до изчезване."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct bg9 poems[] = {
	{1, "1 И наистина, и при първия завет имаше постановления за богослужение, както и земно светилище."},
	{2, "2 Защото беше направена скиния, в първата част на която бяха светилникът, трапезата и присъствените хлябове; която част се нарича Святото място;"},
	{3, "3 а зад втората завеса беше онази част от скинията, която се наричаше Пресвятото място,"},
	{4, "4 където бяха златната кадилница и ковчегът на завета, от всички страни обкован със злато, в който бяха златната стомна, съдържаща манната, Аароновият жезъл, който разцъфна, и плочите на завета,"},
	{5, "5 и над него – херувимите на славата, които осеняваха умилостивилището; за които неща сега не е време да говорим подробно."},
	{6, "6 И когато това беше така направено, свещениците влизаха винаги в първата част на скинията, за да извършват богослужението;"},
	{7, "7 но във втората влизаше само първосвещеникът веднъж в годината, и то не без кръв, която той принасяше за себе си и за греховете на народа, извършени от незнание."},
	{8, "8 С това Светият Дух показваше, че пътят за Пресвятото място още не е бил открит, докато е стояла все още първата част на скинията,"},
	{9, "9 която е образ на сегашното време, в което се принасят дарове и жертви, които не могат да направят онзи, който служи, съвършен, що се отнася до неговата съвест,"},
	{10, "10 понеже се състоят само от ястия и питиета, и различни умивания, и плътски постановления, наложени, докато дойде времето на правилния ред."},
	{11, "11 Но понеже Христос дойде като Първосвещеник на бъдещите добрини през по-голямата и по-съвършена скиния, не с ръка направена, тоест не от настоящото творение, и не чрез кръвта на козли и на телета, а чрез Собствената Си кръв,"},
	{12, "12 Той влезе веднъж завинаги в Светилището и придоби за нас вечно изкупление."},
	{13, "13 Защото, ако кръвта от козли и от юнци и пепелта от юница, с които се поръсваха осквернените, освещава, за да се очисти плътта,"},
	{14, "14 колко повече кръвта на Христос, който чрез вечния Дух принесе Себе Си без недостатък на Бога, ще очисти вашата съвест от мъртви дела, за да служите на живия Бог!"},
	{15, "15 И затова Той е Посредник на един нов завет, така че чрез смъртта, станала за изкупване на престъпленията, извършени при първия завет, призваните да получат обещаното вечно наследство."},
	{16, "16 Защото, където има завещание, трябва да настъпи и смъртта на завещателя."},
	{17, "17 Защото едно завещание влиза в сила само след като има смърт, понеже то няма никаква сила, докато завещателят е жив."},
	{18, "18 Затова и първият завет не беше утвърден без кръв."},
	{19, "19 Защото, след като Мойсей провъзгласи всяка заповед от закона пред целия народ, той взе кръвта на телетата и на козлите с вода и червена вълна, и исоп и поръси както самата книга, така и целия народ, като казваше:"},
	{20, "20 ?Това е кръвта на завета, който Бог ви заповяда да спазвате.“"},
	{21, "21 Освен това, по същия начин той поръси с кръвта и скинията, и всичките съдове за служение."},
	{22, "22 А според закона почти всичко се очиства с кръв и без проливането на кръв няма опрощаване."},
	{23, "23 И така, беше необходимо образите на небесните неща да се очистват с тези жертви, а самите небесни неща – с по-добри жертви от тези."},
	{24, "24 Защото Христос не влезе в светилище, направено от човешки ръце, което е образ на истинското, а в самите небеса, за да се яви сега пред Божието лице заради нас;"},
	{25, "25 и не за да принася Себе Си много пъти, както първосвещеникът влиза в светилището всяка година с чужда кръв,"},
	{26, "26 защото тогава Той трябваше да е страдал много пъти от създаването на света; но сега се яви веднъж в края на вековете, за да отстрани греха, като принесе Себе Си в жертва."},
	{27, "27 И както на хората е определено веднъж да умрат, а след това – съд,"},
	{28, "28 така и Христос беше принесен веднъж, за да понесе греховете на мнозина, и ще се яви втори път, без да има работа с грях, за спасението на онези, които Го очакват."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct bg10 poems[] = {
	{1, "1 Защото законът, съдържайки в себе си само сянката на бъдещите добрини, а не самия образ на нещата, не може никога чрез едни и същи жертви, които непрекъснато се принасят, година след година, да направи съвършени онези, които пристъпват да жертват."},
	{2, "2 В противен случай не би ли престанало принасянето на жертвите, защото тези, които ги принасят, веднъж очистени, не биха имали вече никакво съзнание за грехове?"},
	{3, "3 Но чрез тези жертви греховете всяка година се напомнят;"},
	{4, "4 защото не е възможно кръвта от юнци и от козли да отстрани греховете."},
	{5, "5 Затова Христос, като влиза в света, казва: ?Жертва и принос не си поискал, но приготвил си Ми тяло;"},
	{6, "6 всеизгаряния и жертви за грях не са Ти угодни."},
	{7, "7 Тогава казах: Ето, дойдох – в свитъка на книгата е писано за Мен – да изпълня Твоята воля, о, Боже.“"},
	{8, "8 Като казва първо: ?Жертви и приноси, и всеизгаряния, и жертви за грях не си поискал, нито са Ти угодни“ – които се принасят според закона –"},
	{9, "9 а после казва: ?Ето, дойдох да изпълня волята Ти“, Той отменя първото, за да постанови второто;"},
	{10, "10 според която воля ние сме осветени чрез принасянето на тялото на Иисус Христос веднъж завинаги."},
	{11, "11 И всеки свещеник, като стои и служи всеки ден, принася много пъти едни и същи жертви, които никога не могат да отмахнат греховете;"},
	{12, "12 но Той, като принесе една жертва за греховете, седна завинаги отдясно на Бога;"},
	{13, "13 и оттогава насам чака, докато враговете Му се положат за Негово подножие."},
	{14, "14 Защото с един принос Той е усъвършенствал завинаги онези, които се освещават."},
	{15, "15 И Светият Дух също ни свидетелства за това; защото, след като е казал преди това:"},
	{16, "16 ?Ето заветът, който ще направя с тях след онези дни, казва Господ: ще положа законите Си в сърцата им и ще ги напиша в умовете им“; и после добавя:"},
	{17, "17 ?И греховете им и беззаконията им няма да помня вече.“"},
	{18, "18 А където има прощение за тези неща, там няма вече принос за грях."},
	{19, "19 И така, братя, като имаме дръзновение да влезем в светилището чрез кръвта на Иисус,"},
	{20, "20 през един нов и жив път, който Той е открил за нас през завесата, тоест плътта Си,"},
	{21, "21 и като имаме велик Свещеник над Божия дом,"},
	{22, "22 нека пристъпваме с истинно сърце в пълна увереност на вярата, след като сърцата ни са били поръсени, за да се очистят от зла съвест, и тялото ни е било измито в чиста вода;"},
	{23, "23 нека държим неотстъпно изповядването на надеждата, защото е верен Този, който е дал обещанието;"},
	{24, "24 и нека внимаваме един за друг, за да се поощряваме към любов и добри дела,"},
	{25, "25 като не преставаме да се събираме заедно, както някои имат обичай да престават, а да се увещаваме един друг, и то толкова повече, колкото повече виждате, че Денят наближава."},
	{26, "26 Защото, ако съгрешаваме самоволно, след като сме приели познаването на истината, не остава вече никаква жертва за грехове,"},
	{27, "27 а едно страшно очакване на съда и на едно огнено негодувание, което ще изпояде противниците."},
	{28, "28 Ако някой, който е престъпил закона на Мойсей, умира безпощадно при думата на двама или трима свидетели,"},
	{29, "29 то колко по-тежко наказание, мислите, ще заслужи онзи, който е потъпкал Божия Син и е счел за просто нещо кръвта на завета, с която е бил осветен, и е оскърбил Духа на благодатта?"},
	{30, "30 Защото познаваме Този, който е казал: ?Мое е възмездието, Аз ще отплатя“; и пак: ?Господ ще съди народа Си.“"},
	{31, "31 Страшно е да падне човек в ръцете на живия Бог."},
	{32, "32 Припомняйте си също предишните дни, когато, след като бяхте просветлени, издържахте голяма борба от страдания,"},
	{33, "33 когато понякога бяхте публично опозорявани с хули и оскърбления, а понякога – като съучастници на тези, които страдаха така."},
	{34, "34 Защото вие не само страдахте заедно с онези, които бяха в окови, но и посрещахте с радост разграбването на имота си, знаейки, че вие си имате по-добър и траен имот."},
	{35, "35 И така, не напускайте дръзновението си, за което имате голяма награда."},
	{36, "36 Защото се нуждаете от търпение, така че след като извършите Божията воля, да получите обещаното."},
	{37, "37 Защото още твърде малко време и ще дойде Този, който има да дойде, и няма да се забави."},
	{38, "38 ?А Моят праведник ще живее чрез вяра“; и ?ако се дръпне назад, няма да благоволи в него душата Ми.“"},
	{39, "39 Ние обаче не сме от онези, които се дърпат назад и се погубват, а от тези, които вярват и душата им се спасява."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct bg11 poems[] = {
	{1, "1 А вярата е твърдата увереност в неща, за които се надяваме, убеденост в неща, които не виждаме."},
	{2, "2 Защото заради нея старовременните получаваха свидетелство."},
	{3, "3 С вяра разбираме, че световете са били устроени с Божието слово, така че видимото не стана от видими неща."},
	{4, "4 С вяра Авел принесе на Бога по-добра жертва от тази на Каин, чрез която за него се засвидетелства, че е праведен, тъй като Бог свидетелства за неговите дарове. И чрез тази вяра той, макар и мъртъв, още говори."},
	{5, "5 С вяра Енох беше преселен, за да не види смърт, и не можеше да бъде намерен, защото Бог го пресели. Понеже преди неговото преселване за него беше свидетелствано, че е бил угоден на Бога."},
	{6, "6 А без вяра не е възможно да се угоди на Бога, защото, който идва при Бога, трябва да вярва, че Той съществува и че възнаграждава тези, които Го търсят."},
	{7, "7 С вяра Ной, предупреден от Бога за неща, които още не се виждаха, и движен от страхопочитание, направи ковчег за спасение на своя дом. Чрез тази вяра той осъди света и стана наследник на правдата, която е от вяра."},
	{8, "8 С вяра Авраам, когато беше повикан да излезе и да отиде на едно място, което щеше да получи в наследство, послуша и излезе, без да знае къде отива."},
	{9, "9 С вяра той се засели в обещаната земя като в чужда и живееше в шатри с Исаак и Яков, сънаследниците на същото обещание,"},
	{10, "10 защото очакваше един град, който има вечни основи, на който Архитект и Строител е Бог."},
	{11, "11 С вяра и самата Сара получи сила да зачене и роди в преминала възраст, понеже счете за верен Този, който беше дал обещанието."},
	{12, "12 Затова само от един човек, и то замъртвял, се народи толкова многобройно потомство, колкото са звездите на небето и колкото е крайморският пясък, който не може да се изброи."},
	{13, "13 Всички тези умряха във вяра, тъй като не бяха получили изпълнението на обещанията; но като ги видяха отдалеч и като ги приветстваха, изповядаха, че са чужденци и пришълци на земята."},
	{14, "14 А онези, които говорят така, показват явно, че търсят свое отечество."},
	{15, "15 И наистина, ако те са мислели за онова отечество, от което са били излезли, щяха да имат време да се върнат."},
	{16, "16 Но сега те копнеят за едно по-добро отечество, тоест небесно. Затова Бог не се срамува от тях, да се нарече техен Бог, защото им е приготвил град."},
	{17, "17 С вяра Авраам, когато беше изпитван, принесе Исаак в жертва – онзи, който беше получил обещанията, принесе единородния си син;"},
	{18, "18 онзи, за когото беше казано: ?По Исаак ще се нарече твоето потомство“;"},
	{19, "19 като разсъди, че Бог може да възкресява и от мъртвите, откъдето, като символ на възкресението, го и получи обратно."},
	{20, "20 С вяра Исаак благослови Яков и Исав за неща, които щяха да дойдат."},
	{21, "21 С вяра Яков на умиране благослови всеки от синовете на Йосиф и се поклони на Бога, подпирайки се на върха на тоягата си."},
	{22, "22 С вяра Йосиф на умиране спомена за излизането на израилевите синове и даде поръчка за костите си."},
	{23, "23 С вяра, когато се роди Мойсей, родителите му го криха три месеца, защото видяха, че беше красиво дете, и не се бояха от заповедта на царя."},
	{24, "24 С вяра Мойсей, когато стана на възраст, отказа да се нарича син на дъщерята на фараона"},
	{25, "25 и предпочете да страда с Божия народ, а не да се наслаждава временно на греха,"},
	{26, "26 като счете опозоряването на Христос за по-голямо богатство от египетските съкровища, защото гледаше към наградата."},
	{27, "27 С вяра той напусна Египет, без да се бои от царския гняв, защото издържа, като че ли виждаше Невидимия."},
	{28, "28 С вяра изпълни Пасхата и поръсването с кръвта, за да не се допре до тях този, който погубваше първородните."},
	{29, "29 С вяра израилтяните минаха през Червено море като по суша, а египтяните, като се опитаха да направят същото, се издавиха."},
	{30, "30 Чрез вяра стените на Ерихон паднаха, след като бяха обикаляли седем дни около тях."},
	{31, "31 С вяра блудницата Раав не погина заедно с непокорните, като прие съгледвачите с мир."},
	{32, "32 И какво повече да кажа? Защото няма да ми стигне време да говоря за Гедеон, Варак, Самсон и Ефтай, още и за Давид, и за Самуил, и за пророците,"},
	{33, "33 които с вяра побеждаваха царства, раздаваха правда, получаваха обещания, затваряха устите на лъвове,"},
	{34, "34 угасяха силата на огъня, избягваха от острието на меча, от слабост ставаха силни, ставаха силни в бой, обръщаха в бяг чужди войски,"},
	{35, "35 жени приемаха мъртвите си възк??есени. А други бяха мъчени, като не приемаха да бъдат освободени, за да получат по-добро възкресение,"},
	{36, "36 други бяха подлагани на изпитания от подигравки и бичувания, а още и окови и тъмници,"},
	{37, "37 бяха убивани с камъни, изкушавани, разрязвани с триони, умираха заклани от меч, скитаха се в овчи и кози кожи, като търпяха лишения, бедствия и страдания."},
	{38, "38 Тези, за които светът не беше достоен, се скитаха по пустините и планините, по пещерите и рововете на земята."},
	{39, "39 Но всички тези, макар и да бяха засвидетелствани чрез вярата, не получиха изпълнението на обещанието,"},
	{40, "40 да не би да достигнат съвършенство без нас; защото за нас Бог беше предвидил нещо по-добро."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct bg12 poems[] = {
	{1, "1 Затова и ние, като сме заобиколени от такъв голям облак свидетели, нека отхвърлим всяко бреме и греха, който лесно ни оплита, и нека тичаме с издръжливост в поставеното пред нас поприще,"},
	{2, "2 като гледаме на Иисус, Начинателя и Завършителя на нашата вяра, който заради предстоящата Му радост издържа кръста, като презря срама, и седна отдясно на Божия престол."},
	{3, "3 Защото размислете за Този, който издържа такава враждебност против Себе Си от грешниците, за да не ви дотяга и да не ставате малодушни."},
	{4, "4 Не сте се съпротивили още до кръв в борбата си против греха"},
	{5, "5 и сте забравили увещанието, което ви съветва като синове: ?Сине мой, не презирай наказанието на Господа и не отслабвай, когато те изобличава Той,"},
	{6, "6 защото Господ наказва този, когото люби, и бие всеки син, когото приема.“"},
	{7, "7 Ако търпите наказание, Бог постъпва с вас като със синове, защото кой е този син, когото баща му не наказва?"},
	{8, "8 Но ако сте без наказание, в което всички участват, тогава сте незаконородени деца, а не синове."},
	{9, "9 Освен това, имали сме бащи по плът, които са ни наказвали, и ние сме ги почитали; не трябва ли много повече да се покоряваме на Отца на духовете и да живеем?"},
	{10, "10 Защото те са ни наказвали за кратко време, както са смятали за добре; а Той – за наша полза, за да бъдем участници в Неговата святост."},
	{11, "11 Нито едно наказание не изглежда да е за радост, а за скръб; но после донася мирния плод на правдата на тези, които са били обучавани чрез него."},
	{12, "12 Затова ?укрепете немощните ръце и отслабналите колена“"},
	{13, "13 и направете за краката си прави пътища, за да не се отклони куцото, а да се изцели."},
	{14, "14 Търсете мир с всички и онова освещение, без което никой няма да види Господа,"},
	{15, "15 като внимавате да не би някой да не достигне до Божията благодат; да не би да поникне някой горчив корен, който да ви смущава, така че мнозина да се осквернят от него;"},
	{16, "16 да не би някой да е блудник или безбожник, като Исав, който за едно ястие продаде първородството си,"},
	{17, "17 понеже знаете, че даже когато искаше след това да наследи благословението, той беше отхвърлен, защото не намери място за покаяние, въпреки че го потърси със сълзи."},
	{18, "18 Защото вие не сте пристъпили до осезаема планина и която е пламнала в огън, нито до тъмнина, мрак и буря,"},
	{19, "19 нито сте чули звук на тръба и глас на думи – такъв, че онези, които го чуха, се помолиха да не им се говори повече нито дума,"},
	{20, "20 защото не можеха да издържат онова, което им се заповядваше: ?Даже животно, ако се допре до планината, да се убие с камъни“,"},
	{21, "21 и гледката беше толкова страшна, че Мойсей каза: ?Много съм уплашен и разтреперен“ –"},
	{22, "22 а пристъпихме до хълма Сион, до града на живия Бог, небесния Ерусалим, и при десетки хиляди ангели, при празнично събрание"},
	{23, "23 и при събранието на първородните, които са записани на небесата, при Бога, Съдията на всички, при духовете на усъвършенстваните праведници,"},
	{24, "24 при Иисус, Посредника на нов завет, и при поръсената кръв, която говори по-добре от тази на Авел."},
	{25, "25 Внимавайте да не отхвърлите Този, който говори; защото, ако не избегнаха наказанието онези, които отхвърлиха този, който ги предупреждаваше на земята, колко повече не ще избегнем ние, ако се отвърнем от Онзи, който предупреждава от небесата,"},
	{26, "26 чийто глас разтърси тогава земята! Но сега Той обеща, като каза: ?Още веднъж Аз ще разтърся не само земята, но и небето.“"},
	{27, "27 А това ?още веднъж“ означава премахването на онези неща, които могат да се разклатят, тоест направените неща, за да останат тези, които не могат да се разклатят."},
	{28, "28 Затова, понеже приемаме непоклатимо царство, нека бъдем благодарни и така да служим благоугодно на Бога с благоговение и страхопочитание;"},
	{29, "29 защото и нашият Бог е огън пояждащ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct bg13 poems[] = {
	{1, "1 Постоянствайте в братолюбието."},
	{2, "2 Не забравяйте гостолюбието, понеже чрез него някои, без да знаят, са приели на гости ангели."},
	{3, "3 Помнете затворените, като че заедно с тях сте затворени, страдащите, понеже и самите вие сте в тяло."},
	{4, "4 Женитбата да бъде на почит у всички и леглото – неосквернено, защото Бог ще съди блудниците и прелюбодейците."},
	{5, "5 Не се отдавайте на сребролюбие, задоволявайте се с това, което имате, защото Бог е казал: ?Никак няма да те оставя и никак няма да те напусна.“"},
	{6, "6 Така че ние смело можем да кажем: ?Господ ми е помощник, няма да се убоя; какво ще ми стори човек?“"},
	{7, "7 Помнете онези, които ви ръководят, които са ви говорили Божието слово, и подражавайте на вярата им, като гледате следствията от техния начин на живот."},
	{8, "8 Иисус Христос е същият вчера, днес и до века."},
	{9, "9 Не се увличайте по разни и странни учения, защото е добре сърцето да се укрепва с благодат, а не с наредби за ястия, от които не са имали полза онези, които са се водили по тях."},
	{10, "10 Ние имаме олтар, от който нямат право да ядат онези, които служат в скинията."},
	{11, "11 Защото телата на животните, чиято кръв първосвещеникът внася в светилището като жертва за греховете, се изгарят вън от стана."},
	{12, "12 Затова и Иисус, за да освети народа чрез Своята Собствена кръв, пострада вън от градската порта."},
	{13, "13 И така, нека и ние излизаме към Него вън от стана, понасяйки Неговия позор."},
	{14, "14 Защото тук ние нямаме постоянен град, а търсим този, който ще дойде."},
	{15, "15 И така, чрез Него нека принасяме на Бога непрестанно жертва на хваление, тоест плод на устни, които изповядват Неговото Име."},
	{16, "16 И не забравяйте да вършите добро и да разделяте с другите, защото такива жертви са угодни на Бога."},
	{17, "17 Подчинявайте се на онези, които ви ръководят, и се покорявайте, защото те бдят за вашите души като такива, които ще отговарят; за да правят това с радост, а не с въздишане, защото да го правят с въздишане не е полезно за вас."},
	{18, "18 Молете се за нас, защото сме уверени, че имаме чиста съвест, като искаме във всичко да постъпваме добре."},
	{19, "19 А особено ви моля да правите това, за да мога по-скоро да ви бъда върнат."},
	{20, "20 А Бог на мира, който чрез кръвта на вечния завет възведе от мъртвите великия Пастир на овцете – нашия Господ Иисус –"},
	{21, "21 нека ви усъвършенства във всяко добро нещо, за да вършите Неговата воля, като изработва във вас това, което е угодно пред Него, чрез Иисус Христос, на когото да бъде слава за вечни векове. Амин."},
	{22, "22 И аз ви умолявам, братя, да приемете с търпение това напътствено слово, защото ви писах накратко."},
	{23, "23 Знайте, че нашият брат Тимотей е пуснат на свобода; и с него, ако дойде скоро, ще ви видя."},
	{24, "24 Поздравете всички, които ви ръководят, и всички светии! Поздравяват ви тези, които са от Италия."},
	{25, "25 Благодат да бъде с всички вас. Амин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};