#include <map>
#include <string>
class Bible62
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
	struct bg5	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Това, което беше отначало, което чухме, което видяхме с очите си, което гледахме и ръцете ни попипаха за Словото на живота,"},
	{2, "2 защото животът се яви и ние видяхме, и свидетелстваме, и ви възвестяваме вечния живот, който беше в Отца и се яви на нас —"},
	{3, "3 това, което сме видели и чули, него възвестяваме и на вас, за да имате и вие общение с нас, а пък нашето общение е с Отца и с Неговия Син Иисус Христос."},
	{4, "4 И това ви пишем, за да бъде пълна вашата радост."},
	{5, "5 И известието, което чухме от Него и известяваме на вас, е това, че Бог е светлина, и в Него няма никаква тъмнина."},
	{6, "6 Ако кажем, че имаме общение с Него, а ходим в тъмнината, лъжем и не вършим истината."},
	{7, "7 Но ако ходим в светлината, както е и Той в светлината, имаме общение един с друг и кръвта на Иисус (Христос), Неговия Син, ни очиства от всеки грях."},
	{8, "8 Ако кажем, че нямаме грях, лъжем себе си и истината не е в нас."},
	{9, "9 Ако изповядваме греховете си, Той е верен и праведен да ни прости греховете и да ни очисти от всяка неправда."},
	{10, "10 Ако кажем, че не сме съгрешили, правим Бога лъжец и Неговото слово не е в нас."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 Дечица мои, това ви пиша, за да не съгрешите; но ако някой съгреши, имаме Застъпник при Отца – Иисус Христос Праведния."},
	{2, "2 Той е умилостивението за нашите грехове, но не само за нашите, а и за греховете на целия свят."},
	{3, "3 И по това знаем, че сме Го познали, ако пазим заповедите Му."},
	{4, "4 Който казва: Познах Го, а заповедите Му не пази, е лъжец и истината не е в него."},
	{5, "5 Но който пази словото Му, Божията любов в него наистина е съвършена. По това знаем, че сме в Него."},
	{6, "6 Който казва, че стои в Него, сам е длъжен да ходи, както е ходил Христос."},
	{7, "7 Възлюбени, не ви пиша нова заповед, а стара заповед, която сте имали от началото. Старата заповед е словото, което сте чули."},
	{8, "8 Но все пак, нова заповед ви пиша – това, което е истинно и в Него, и във вас, защото тъмнината преминава и истинската светлина вече свети."},
	{9, "9 Който казва, че е в светлината, а мрази брат си, той и досега е в тъмнината."},
	{10, "10 Който люби брат си, стои в светлината и в него няма повод за грях."},
	{11, "11 А който мрази брат си, той е в тъмнината и ходи в тъмнината, и не знае къде отива, защото тъмнината е заслепила очите му."},
	{12, "12 Пиша на вас, дечица, защото вашите греховете са простени заради Неговото Име."},
	{13, "13 Пиша на вас, бащи, защото познахте Този, който е от началото. Пиша на вас, младежи, защото победихте лукавия. Писах на вас, дечица, защото познахте Отца."},
	{14, "14 Писах на вас, бащи, защото познахте Този, който е от началото. Писах на вас, младежи, защото сте силни и Божието слово стои във вас, и победихте лукавия."},
	{15, "15 Не любете света, нито каквото е в света. Ако някой люби света, любовта на Отца не е в него."},
	{16, "16 Защото всичко, което е в света – похотта на плътта, похотта на очите и тщеславието на живота – не е от Отца, а е от света."},
	{17, "17 И светът преминава, и неговите похоти, но който върши Божията воля, пребъдва до века."},
	{18, "18 Дечица, последно време е; и както сте чули, че идва Антихрист, така и сега са се явили много антихристи; от това знаем, че е последно време."},
	{19, "19 От нас излязоха, но не бяха от нас; защото, ако бяха от нас, щяха да останат с нас; но излязоха, за да стане явно, че те всички не са от нас."},
	{20, "20 А вие имате помазанието от Светия и знаете всичко."},
	{21, "21 Пиша ви не защото не знаете истината, а защото я знаете и разбирате, че никаква лъжа не е от истината."},
	{22, "22 Кой е лъжецът, ако не този, който отрича, че Иисус е Христос? Той е антихристът, който отрича Отца и Сина."},
	{23, "23 Всеки, който отрича Сина, няма и Отца; а който изповядва Сина, има и Отца."},
	{24, "24 Колкото до вас, нека онова, което сте чули отначало, да стои във вас. Ако онова, което сте чули отначало, стои във вас, то и вие ще стоите в Сина и в Отца."},
	{25, "25 И това е обещанието, което Той ни даде – вечният живот."},
	{26, "26 Писах ви това заради тези, които ви подмамват."},
	{27, "27 А колкото за вас, помазанието, което приехте от Него, стои във вас и нямате нужда да ви учи някой; но както Неговото помазание ви учи за всичко и е истинско, а не лъжливо, и вие стойте в Него, както ви е научило."},
	{28, "28 И така, дечица, стойте в Него, та когато се яви, да имаме дръзновение и да не се посрамим пред Него при Неговото пришествие."},
	{29, "29 Ако знаете, че Той е праведен, знайте, че и всеки, който върши правда, е от Него роден."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 Вижте каква любов ни е дал Отец – да се наречем Божии деца; а такива и сме. Затова светът не ни познава, защото Него не позна."},
	{2, "2 Възлюбени, сега сме Божии деца и още не е станало явно какво ще бъдем, но знаем, че когато стане явно, ще бъдем като Него, защото ще Го видим Такъв, какъвто е."},
	{3, "3 И всеки, който има тази надежда в Него, очиства себе си, както Той е чист."},
	{4, "4 Всеки, който върши грях, върши и беззаконие; и грехът е беззаконие."},
	{5, "5 И вие знаете, че Той се яви, за да вземе нашите грехове, и в Него няма грях."},
	{6, "6 Никой, който стои в Него, не съгрешава; никой, който съгрешава, не Го е видял, и не Го е познал."},
	{7, "7 Дечица, никой да не ви заблуждава! Който върши правда, е праведен, както и Той е праведен."},
	{8, "8 Който върши грях, е от дявола, защото дяволът съгрешава от началото. Затова се яви Божият Син – за да унищожи делата на дявола."},
	{9, "9 Никой, който е роден от Бога, не върши грях, защото Неговото семе живее в него; и не може да съгрешава, защото е роден от Бога."},
	{10, "10 По това се разпознават Божиите деца и дяволските деца: никой, който не върши правда, не е от Бога, нито онзи, който не люби брат си."},
	{11, "11 Защото това е посланието, което чухте отначало: да се любим един друг;"},
	{12, "12 не като Каин, който беше от лукавия и уби брат си. И защо го уби? Защото неговите дела бяха зли, а на брат му – праведни."},
	{13, "13 Не се чудете, братя, ако светът ви мрази."},
	{14, "14 Ние знаем, че сме преминали от смърт в живот, защото любим братята. Който не люби, стои в смърт."},
	{15, "15 Всеки, който мрази брат си, е човекоубиец; и вие знаете, че в нито един човекоубиец не обитава вечен живот."},
	{16, "16 По това познахме любовта, че Той отдаде живота Си за нас. Така и ние сме длъжни да отдадем живота си за братята."},
	{17, "17 Но ако някой има благата на този свят и види, че брат му е в нужда, а заключи сърцето си от него, как обитава в него Божията любов?"},
	{18, "18 Дечица, да не любим с думи, нито с език, а с дело и истина."},
	{19, "19 От това ще познаем, че сме от истината, и ще успокоим сърцето си пред Него,"},
	{20, "20 защото, ако нашето сърце ни осъжда, Бог е по-голям от нашето сърце и знае всичко."},
	{21, "21 Възлюбени, ако нашето сърце не ни осъжда, ние имаме дръзновение спрямо Бога,"},
	{22, "22 и каквото и да поискаме, получаваме от Него, защото пазим Неговите заповеди и вършим това, което е угодно пред Него."},
	{23, "23 И това е Неговата заповед: да вярваме в Името на Неговия Син Иисус Христос и да се любим един друг, както ни е заповядал."},
	{24, "24 И който пази Неговите заповеди, стои в Него и Той – в него; и по това познаваме, че Той обитава в нас – по Духа, който ни е дал."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 Възлюбени, не вярвайте на всеки дух, а изпитвайте духовете дали са от Бога, защото много лъжепророци излязоха по света."},
	{2, "2 По това познавайте Божия Дух: всеки дух, който изповяда, че Иисус Христос е дошъл в плът, е от Бога;"},
	{3, "3 а всеки дух, който не изповяда, че Иисус Христос е дошъл в плът, не е от Бога; и това е духът на Антихриста, за когото сте чули, че идва, и сега вече е в света."},
	{4, "4 Вие сте от Бога, дечица, и сте ги победили, защото Този, който е във вас, е по-велик от онзи, който е в света."},
	{5, "5 Те са от света, затова светски говорят и светът тях слуша."},
	{6, "6 Ние сме от Бога. Който познава Бога, нас слуша; който не е от Бога, не ни слуша. По това познаваме духа на истината и духа на заблудата."},
	{7, "7 Възлюбени, да се любим един друг, защото любовта е от Бога; и всеки, който люби, е роден от Бога и познава Бога."},
	{8, "8 Който не люби, не познава Бога, защото Бог е любов."},
	{9, "9 В това се яви Божията любов към нас, че Бог изпрати на света Своя Единороден Син, за да живеем чрез Него."},
	{10, "10 В това се състои любовта – не че ние възлюбихме Бога, а че Той възлюби нас и прати Сина Си като умилостивение за нашите грехове."},
	{11, "11 Възлюбени, понеже Бог така ни възлюби, то и ние сме длъжни да любим един другиго."},
	{12, "12 Никой никога не е видял Бога; но ако любим един другиго, Бог обитава в нас и Неговата любов е съвършена в нас."},
	{13, "13 По това познаваме, че стоим в Него и Той в нас, защото ни е дал от Духа Си."},
	{14, "14 И ние видяхме и свидетелстваме, че Отец прати Сина за Спасител на света."},
	{15, "15 Който изповяда, че Иисус е Божият Син, Бог обитава в него, и той – в Бога."},
	{16, "16 И ние сме познали и сме повярвали любовта, която Бог има към нас. Бог е любов; и който стои в любовта, стои в Бога, и Бог – в него."},
	{17, "17 В това се усъвършенства любовта в нас, че имаме дръзновение в съдния ден, защото, както е Той, така сме и ние в този свят."},
	{18, "18 В любовта няма страх, а съвършената любов изгонва страха, защото в страха има наказание, но който се страхува, не е станал съвършен в любовта."},
	{19, "19 Ние любим, защото първо Той възлюби нас."},
	{20, "20 Ако каже някой: Любя Бога, а мрази брат си, той е лъжец; защото, който не люби брат си, когото е видял, не може да люби Бога, когото не е видял."},
	{21, "21 И тази заповед имаме от Него: който люби Бога, да люби и брат си."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct bg5 poems[] = {
	{1, "1 Всеки, който вярва, че Иисус е Христос, е роден от Бога; и всеки, който люби Родителя, люби и родения от Него."},
	{2, "2 По това познаваме, че любим Божиите деца – когато любим Бога и изпълняваме Неговите заповеди."},
	{3, "3 Защото това е любов към Бога – да пазим Неговите заповеди; и заповедите Му не са тежки."},
	{4, "4 Защото всичко, което е родено от Бога, побеждава света; и това е победата, която е победила света – нашата вяра."},
	{5, "5 И кой побеждава света, ако не този, който вярва, че Иисус е Божият Син?"},
	{6, "6 Това е Иисус Христос, който е дошъл чрез вода и кръв; не само чрез водата, а чрез водата и чрез кръвта;"},
	{7, "7 и Духът е, който свидетелства, понеже Духът е истината."},
	{8, "8 Защото три са, които свидетелстват: Духът, водата и кръвта; и тези три са съгласни."},
	{9, "9 Ако приемаме свидетелството на хората, свидетелството на Бога е по-велико, защото свидетелството на Бога е това, че Той е свидетелствал за Сина Си."},
	{10, "10 Който вярва в Божия Син, има свидетелството в себе си; който не вярва в Бога, Го е направил лъжец, защото не е повярвал на свидетелството, с което Бог е свидетелствал за Своя Син."},
	{11, "11 И свидетелството е това, че Бог ни е дал вечен живот и този живот е в Неговия Син."},
	{12, "12 Който има Сина, има живота; който няма Божия Син, няма живота."},
	{13, "13 Това ви писах на вас, които вярвате в Името на Божия Син, за да знаете, че имате вечен живот."},
	{14, "14 И увереността, която имаме към Него е това, че ако молим нещо по Неговата воля, Той ни слуша;"},
	{15, "15 и ако знаем, че ни слуша, за каквото и да помолим, знаем, че получаваме това, което сме помолили от Него."},
	{16, "16 Ако някой види брат си, че извърши несмъртен грях, нека се моли, и Бог ще му даде живот – на онези, които съгрешават несмъртно. Има смъртен грях – не казвам за него да се моли."},
	{17, "17 Всяка неправда е грях; и има грях, който не е смъртен."},
	{18, "18 Знаем, че всеки, който е роден от Бога, не съгрешава; а *роденият от Бога, пази себе си* и лукавият не го докосва."},
	{19, "19 Ние знаем, че сме от Бога; и целият свят лежи в лукавия."},
	{20, "20 Знаем също, че Божият Син е дошъл и ни е дал разум да познаем истинния Бог; и ние сме в истинния Бог, в Неговия Син Иисус Христос. Този е истинният Бог и вечен живот."},
	{21, "21 Дечица, пазете себе си от идоли. Амин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};