#include <map>
#include <string>
class Bible52
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
	struct bg5	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Павел и Сила, и Тимотей до солунската църква в Бог Отец и Господ Иисус Христос: Благодат и мир да бъде на вас!"},
	{2, "2 Винаги благодарим на Бога за всички вас и ви споменаваме в молитвите си,"},
	{3, "3 като си спомняме непрестанно пред нашия Бог и Отец за вашата работа във вярата и усилия на любов, и твърдост в надежда в нашия Господ Иисус Христос."},
	{4, "4 Понеже знаем, възлюбени от Бога братя, че Той ви е избрал;"},
	{5, "5 защото нашето благовестие не дойде до вас само с думи, но също и със сила, със Светия Дух и с голяма увереност; както и знаете какви се показахме помежду ви заради вас."},
	{6, "6 И вие станахте подражатели на нас и на Господа, като приехте словото сред много скръб с радостта на Светия Дух;"},
	{7, "7 така че станахте пример на всички вярващи в Македония и Ахая."},
	{8, "8 Защото от вас се прогласи Господното слово не само в Македония и Ахая, но за вашата вяра в Бога се разчу навсякъде, така че няма нужда ние да казваме нищо за нея."},
	{9, "9 Защото самите те разказват за нас – какъв достъп сме имали при вас и как сте се обърнали към Бога от идолите, за да служите на живия и истинен Бог"},
	{10, "10 и да очаквате Неговия Син от небесата, когото Той възкреси от мъртвите – Иисус, който ни избавя от идещия гняв."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 Защото вие сами знаете, братя, че нашият достъп при вас не беше напразен,"},
	{2, "2 но макар и пострадали и опозорени по-рано във Филипи, както знаете, ние придобихме смелост в нашия Бог да ви проповядваме Божието благовестие сред голяма борба."},
	{3, "3 Защото нашето увещание не е от заблуда, нито от нечисти подбуди, нито с измама,"},
	{4, "4 а както сме били одобрени от Бога да ни се повери благовестието, така и говорим – не за да угаждаме на хора, а на Бога, който изпитва сърцата ни."},
	{5, "5 Защото, както знаете, никога не сме употребявали ласкателни думи или прикрито сребролюбие – Бог е свидетел –"},
	{6, "6 нито сме търсили слава от хора – било от вас, или от други – макар и да сме могли да се държим с тежест като Христови апостоли,"},
	{7, "7 но сме се държали нежно с вас, като майка-кърмачка, която се грижи за децата си."},
	{8, "8 Така, като имахме гореща любов към вас, бяхме готови да ви предадем не само Божието благовестие, но и своя живот, защото ни бяхте станали мили."},
	{9, "9 Защото вие помните, братя, нашия труд и усилие – как, като работехме ден и нощ, за да не натежим на нито един от вас, ние ви проповядвахме Божието благовестие."},
	{10, "10 Вие сте свидетели, и Бог също, как свято, праведно и безукорно се държахме към вас, вярващите,"},
	{11, "11 като знаете как увещавахме и утешавахме всеки един от вас, както баща – децата си,"},
	{12, "12 и ви подтиквахме да живеете достойно за Бога, който ви призовава в Своето царство и слава."},
	{13, "13 И затова и ние непрестанно благодарим на Бога за това, че като приехте чрез нас словото на Божието послание, го приехте не като човешко слово, а като Божие слово, каквото е наистина, което и действа във вас, вярващите."},
	{14, "14 Защото вие, братя, станахте подражатели на Божиите църкви в Христос Иисус, които са в Юдея, понеже и вие пострадахте по същия начин от своите сънародници, както те – от юдеите,"},
	{15, "15 които убиха и Господ Иисус, и пророците и прогониха и нас, и на Бога не угаждат, и на всички хора се противопоставят,"},
	{16, "16 като ни забраняват да говорим на езичниците, за да се спасят и те. Така те винаги допълват греховете си, но гневът ги постигна окончателно."},
	{17, "17 А ние, братя, като останахме без вас за кратко време – като присъствие, а не в нашето сърце – се постарахме още повече, с голямо желание да видим лицето ви."},
	{18, "18 Затова пожелахме да дойдем при вас – поне аз, Павел, и веднъж, и два пъти – но Сатана ни попречи."},
	{19, "19 Понеже, коя е нашата надежда или радост, или венец, с който се хвалим пред нашия Господ Иисус при Неговото пришествие? Не сте ли вие?"},
	{20, "20 Защото вие сте нашата слава и радост."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 Затова, когато не можахме повече да търпим, намерихме за добре да останем сами в Атина"},
	{2, "2 и изпратихме Тимотей, нашия брат и съработник на Бога, и съработник в благовестието на Христос, да ви утвърди и да ви утеши във вярата ви,"},
	{3, "3 за да не се разколебае никой от тези скърби. Защото вие сами знаете, че за това сме определени,"},
	{4, "4 понеже, когато бяхме при вас, ви казахме предварително, че ще има да страдаме, което и стана, както знаете."},
	{5, "5 Затова, когато не можах повече да търпя, го изпратих, за да узная за вярата ви, да не би по някакъв начин да ви е изкушил изкусителят и трудът ни да бъде напразно."},
	{6, "6 Но сега, когато Тимотей от вас дойде при нас и ни донесе добри вести за вашата вяра и любов и че имате винаги добри спомени за нас и копнеете да ни видите, както и ние вас,"},
	{7, "7 тогава ние, братя, при цялата наша нужда и скръб, се утешихме за вас поради вашата вяра;"},
	{8, "8 понеже ние сега живеем, ако вие стоите твърдо в Господа."},
	{9, "9 Защото как можем да се отблагодарим на Бога за вас, за цялата радост, с която се радваме за вас пред нашия Бог?"},
	{10, "10 Нощ и ден се молим най-усърдно, за да видим лицата ви и да допълним това, което не достига на вашата вяра."},
	{11, "11 А дано Сам Бог и нашият Отец и нашият Господ Иисус да насочат пътя ни към вас."},
	{12, "12 И Господ да ви направи да растете и да изобилствате в любов един към друг и към всички, както и ние към вас,"},
	{13, "13 за да утвърди сърцата ви непорочни в святост пред нашия Бог и Отец при пришествието на нашия Господ Иисус с всичките Негови светии."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 По-нататък, братя, молим ви и ви увещаваме в Господ Иисус: така, както сте научили от нас как трябва да живеете и да угаждате на Бога – както и живеете наистина – така да преуспявате все повече и повече."},
	{2, "2 Защото знаете какви наставления ви дадохме чрез Господ Иисус."},
	{3, "3 Понеже това е Божията воля – вашето освещение; да се въздържате от блудство;"},
	{4, "4 всеки от вас да знае как да спечели своя съсъд в святост и почит,"},
	{5, "5 не в страстна похот, както езичниците, които не познават Бога;"},
	{6, "6 и никой да не престъпва и да не ощетява брат си в това нещо, защото за всичко това ще отмъсти Господ, както и предварително ви предупредихме и уверихме."},
	{7, "7 Защото Бог не ни е призовал за нечистота, а за освещение."},
	{8, "8 Затова, който отхвърля това, отхвърля не човек, а Бога, който ви дава и Светия Си Дух."},
	{9, "9 А за братолюбието няма нужда да ви пиша, защото вие сами сте научени от Бога да се любите един друг"},
	{10, "10 и вие наистина правите това към всичките братя по цяла Македония. Но ние ви умоляваме, братя, да преуспявате все повече и повече"},
	{11, "11 и усърдно да се стараете да бъдете тихи, да вършите своите си работи и да работите с ръцете си, както ви заръчахме,"},
	{12, "12 за да живеете благоприлично пред външните хора и да не се нуждаете от никого."},
	{13, "13 А не желаем, братя, да останете в незнание за онези, които са починали, за да не скърбите като другите, които нямат надежда."},
	{14, "14 Защото, ако вярваме, че Иисус умря и възкръсна, така и Бог ще приведе починалите чрез Иисус с Него."},
	{15, "15 Защото това ви казваме чрез словото от Господа: че ние, живите, останалите до Господното пришествие, няма да изпреварим починалите."},
	{16, "16 Понеже Сам Господ ще слезе от небето с команда, с гласа на архангел и с Божия тръба; и мъртвите в Христос първо ще възкръснат;"},
	{17, "17 после ние, живите, останалите, ще бъдем грабнати заедно с тях в облаци да срещнем Господа във въздуха; и така ще бъдем винаги с Господа."},
	{18, "18 И така, насърчавайте се един друг с тези думи."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct bg5 poems[] = {
	{1, "1 А за годините и времената, братя, няма нужда да ви пиша,"},
	{2, "2 защото вие добре знаете, че Господният Ден ще дойде както крадец нощем."},
	{3, "3 Когато казват: Мир и безопасност; тогава ще дойде върху тях внезапна погибел както болките върху бременна жена; и няма да избегнат."},
	{4, "4 Но вие, братя, не сте в тъмнина, че денят да дойде върху вас като крадец."},
	{5, "5 Защото всички вие сте синове на светлината, синове на деня; ние не сме от нощта, нито от тъмнината."},
	{6, "6 И така, да не спим както другите, а да бъдем будни и трезви."},
	{7, "7 Защото, които спят, нощем спят и които се опиват, нощем се опиват."},
	{8, "8 Но ние, които сме от деня, нека бъдем трезви и нека облечем бронения нагръдник на вярата и любовта и сложим за шлем надеждата на спасението."},
	{9, "9 Защото Бог ни е определил не за гняв, а за да придобием спасение чрез нашия Господ Иисус Христос,"},
	{10, "10 който умря за нас, така че – будни ли сме, или спим – да живеем заедно с Него."},
	{11, "11 Затова се насърчавайте помежду си и се изграждайте един друг, както и правите."},
	{12, "12 И молим ви, братя, да признавате тези, които се трудят между вас като ваши настойници в Господа и ви поучават,"},
	{13, "13 и да се отнасяте към тях с голямо уважение и с любов заради делото им. Живейте в мир помежду си."},
	{14, "14 Молим ви още, братя, вразумявайте безредните, насърчавайте малодушните, поддържайте слабите, бъдете търпеливи към всички."},
	{15, "15 Внимавайте никой да не връща зло за зло на никого, а винаги се стремете към това, което е добро — един за друг и за всички."},
	{16, "16 Винаги се радвайте."},
	{17, "17 Непрестанно се молете."},
	{18, "18 За всичко благодарете, защото това е Божията воля за вас в Христос Иисус."},
	{19, "19 Не угасяйте Духа."},
	{20, "20 Пророчества не презирайте,"},
	{21, "21 но изпитвайте всичко; дръжте доброто."},
	{22, "22 Въздържайте се от всякакво зло."},
	{23, "23 И Сам Бог на мира да ви освети напълно; и дано се запазят непокътнати вашият дух, душа и тяло без порок при пришествието на нашия Господ Иисус Христос."},
	{24, "24 Верен е Онзи, който ви призовава, и ще го направи."},
	{25, "25 Братя, молете се за нас."},
	{26, "26 Поздравете всичките братя със свята целувка."},
	{27, "27 Заклевам ви в Господа да се прочете това писмо на всичките (свети) братя."},
	{28, "28 Благодатта на нашия Господ Иисус Христос да бъде с вас. (Амин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};