#include <map>
#include <string>
class Bible22
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
	struct bg5	{ int val; const char *msg; };
	struct bg6	{ int val; const char *msg; };
	struct bg7	{ int val; const char *msg; };
	struct bg8	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Песен на песните, на Соломон."},
	{2, "2 Нека ме целуне с целувките на устата си — защото любовта ти е по-добра от вино."},
	{3, "3 Твоите масла имат приятно благоухание, името ти е като пречистено масло — затова те обичат девиците."},
	{4, "4 Привлечи ме след теб, нека побързаме. Царят ме въведе в покоите си. Ще се радваме и ще се веселим за теб. Ще прославяме твоята любов повече от виното. Те с право те обичат!"},
	{5, "5 Черна съм, но хубава, ерусалимски дъщери, като кидарските шатри, като Соломоновите завеси."},
	{6, "6 Не ме гледайте, че съм почерняла, защото слънцето ме е погледнало. Синовете на майка ми ми се разгневиха, направиха ме пазачка на лозята, но своето лозе не опазих."},
	{7, "7 Кажи ми, ти, когото обича душата ми, къде пасеш стадото си, къде го успокояваш по пладне? Понеже, защо да съм като една, която се скита край стадата на твоите другари?"},
	{8, "8 Ако ти не знаеш, най-прекрасна между жените, излез по стъпките на стадото и паси козлетата си при шатрите на овчарите."},
	{9, "9 На кобила на фараоновите колесници те уподобих, любима моя."},
	{10, "10 Красиви са бузите ти с украшения и шията ти с огърлици."},
	{11, "11 Ще ти направим златни украшения със сребърни капки."},
	{12, "12 Докато царят е на трапезата си, нардът ми издава благоуханието си."},
	{13, "13 Възлюбеният ми е за мен като торбичка със смирна, която почива между гърдите ми."},
	{14, "14 Възлюбеният ми е за мен като кипрова китка в лозята на Енгади."},
	{15, "15 Ето, красива си, любима моя! Ето, красива си! Очите ти са като гълъби."},
	{16, "16 Ето, красив си, любими мой, да и приятен! И постелката ни е свежа зеленина."},
	{17, "17 Гредите на къщите ни са кедри, дъските ни — кипарис."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 Аз съм саронският нарцис и кремът на долините."},
	{2, "2 Като крем сред тръните, така е любимата ми сред дъщерите."},
	{3, "3 Като ябълково дърво сред горските дървета, така е любимият ми сред синовете. Насладих се на сянката му и седнах, и плодът му бе сладък в устата ми."},
	{4, "4 Доведе ме в дома на виното и знамето му над мен е любов."},
	{5, "5 Подкрепете ме със сушено грозде, освежете ме с ябълки, защото съм болна от любов."},
	{6, "6 Левицата му е под главата ми и десницата му ме прегръща."},
	{7, "7 Заклевам ви, ерусалимски дъщери, в сърните или в полските кошути, да не възбудите, да не събудите любовта, докато сама не пожелае."},
	{8, "8 Слушайте! Любимият ми! Ето, идва, играейки по планините и скачайки по хълмовете."},
	{9, "9 Любимият ми е като сърна или млад елен. Ето, той стои зад стената ни, гледа в прозорците, наднича през решетката."},
	{10, "10 Любимият ми отговори и ми каза: Стани, любима моя, прекрасна моя, и ела!"},
	{11, "11 Защото, ето, зимата премина, дъждът отмина и си отиде."},
	{12, "12 Цветята се появиха на земята, времето за пеене дойде и гласът на гургулицата се чува в земята ни."},
	{13, "13 На смокинята покарват зелените смокини и разцъфтелите лозя издават благоуханието си. Стани, любима моя, прекрасна моя, и ела!"},
	{14, "14 Гълъбице моя, в пукнатините на скалата, в скришните места на канарата, нека видя лицето ти, нека чуя гласа ти, защото гласът ти е сладък и лицето ти — прекрасно."},
	{15, "15 Уловете ни лисиците, малките лисици, които съсипват лозята, защото лозята ни цъфтят."},
	{16, "16 Любимият ми е мой, и аз съм негова; той пасе стадо между кремовете."},
	{17, "17 Докато отмине денят и побягнат сенките, обърни се, любими мой, и бъди като сърна или млад елен по разцепените планини."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 Нощем на леглото си потърсих онзи, когото обича душата ми; потърсих го и не го намерих."},
	{2, "2 Казах: Ще стана сега и ще обиколя града; по улиците и площадите ще търся онзи, когото обича душата ми. Потърсих го и не го намерих."},
	{3, "3 Намериха ме стражарите, които обхождат града; попитах ги: Видяхте ли онзи, когото обича душата ми?"},
	{4, "4 Едва ги бях отминала, когато намерих онзи, когото обича душата ми. Хванах го и не го пуснах, докато не го доведох в къщата на майка си и в стаята на онази, която ме е родила."},
	{5, "5 Заклевам ви, ерусалимски дъщери, в сърните или в полските кошути, да не възбудите, да не събудите любовта, докато сама не пожелае."},
	{6, "6 Коя е тази, която излиза от пустинята като стълбове дим, окадена със смирна и ливан, с всичките благоуханни прахове на търговеца?"},
	{7, "7 Ето, ложето на Соломон, с шестдесет силни мъже около него от силните мъже на Израил."},
	{8, "8 Всички те държат меч и са опитни в бой. Всеки държи меча си на бедрото си срещу ужаси в нощта."},
	{9, "9 Цар Соломон си направи носилка от ливанското дърво;"},
	{10, "10 стълбовете й направи от сребро, подложката й — от злато, постелката й — от пурпур; вътрешността й е украсена с любов от ерусалимските дъщери."},
	{11, "11 Излезте, сионски дъщери, и вижте цар Соломон с венеца, с който майка му го увенча в деня на неговата сватба, в деня на радостта на сърцето му!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 Ето, красива си, любима моя! Ето, красива си! Очите ти под булото ти са като гълъби. Косата ти е като стадо кози, слизащи от планината Галаад."},
	{2, "2 Зъбите ти са като стадо новоостригани овци, излизащи от къпането, всяка от които ражда близнаци, и нито една между тях не е безплодна."},
	{3, "3 Устните ти са като червена прежда и устата ти е сладка. Челото ти зад булото ти е като парче от нар."},
	{4, "4 Шията ти е като Давидовата кула, построена за оръжейна, хиляда щитчета висят на нея — всички щитове на силни мъже."},
	{5, "5 Двете ти гърди са като две сърнета близнета, които пасат между кремовете."},
	{6, "6 Докато отмине денят и побягнат сенките, ще отида в планината на смирната и на хълма на ливана."},
	{7, "7 Ти си цялата красива, любима моя, и недостатък няма в теб."},
	{8, "8 Ела с мен от Ливан, невесто, с мен от Ливан. Погледни от върха на Амана, от върха на Санир и Ермон, от леговищата на лъвовете, от планините на рисовете."},
	{9, "9 Пленила си сърцето ми, сестро моя, невесто, пленила си сърцето ми с един поглед на очите си, с една огърлица на шията си."},
	{10, "10 Колко прекрасна е твоята любов, сестро моя, невесто! Колко по-добра от вино е твоята любов и благоуханието на твоите масла — от всички аромати!"},
	{11, "11 От устните ти, невесто, капе мед; мед и мляко има под езика ти; и благоуханието на дрехите ти е като благоуханието на Ливан."},
	{12, "12 Градина затворена е сестра ми, невястата, извор затворен, източник запечатан."},
	{13, "13 Твоите стръкове са градина от нарове с избрани плодове, кипър с нард,"},
	{14, "14 нард и шафран, тръстика и канела, с всичките дървета ливан, смирна и алое, с всичките превъзходни аромати."},
	{15, "15 Градински извор си ти, кладенец с жива вода и потоци от Ливан."},
	{16, "16 Събуди се, северен ветре, и ела, южни ветре! Повей в градината ми, за да потекат ароматите й. Нека дойде възлюбеният ми в градината си и яде приятните й плодове."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct bg5 poems[] = {
	{1, "1 Дойдох в градината си, сестро моя, невесто; обрах смирната си с аромата си; изядох медената си пита с меда си; изпих виното си с млякото си. Яжте, приятели! Пийте, изобилно пийте, възлюбени!"},
	{2, "2 Аз спя, но сърцето ми е будно — гласът на любимия ми! Чука: Отвори ми, сестро моя, любима моя, гълъбице моя, съвършена моя! Защото главата ми е пълна с роса, къдриците ми с — нощни капки."},
	{3, "3 Съблякох дрехата си — как да я облека? Измих краката си — как да ги изцапам?"},
	{4, "4 Любимият ми протегна ръката си през процепа и сърцето ми закопня за него."},
	{5, "5 Аз станах, за да отворя на любимия си, и от ръцете ми капеше смирна и от пръстите ми — бистра смирна върху дръжките на ключалката."},
	{6, "6 Отворих на любимия си, но любимият ми се беше обърнал и си беше отишъл. Сърцето ми примря, когато ми говореше. Потърсих го, но не го намерих; повиках го, но не ми отговори."},
	{7, "7 Намериха ме стражите, които обхождат града, биха ме, раниха ме; пазачите на стените ми взеха покривалото."},
	{8, "8 Заклевам ви, ерусалимски дъщери, ако намерите любимия ми, какво да му кажете? — че съм ранена от любов."},
	{9, "9 Какво повече е твоят любим от друг любим, о, най-прекрасна между жените? Какво повече е твоят любим от друг любим, че ни заклеваш така?"},
	{10, "10 Любимият ми е бял и румен, личи между десет хиляди."},
	{11, "11 Главата му е като най-чисто злато, къдриците му са буйни, черни като гарван."},
	{12, "12 Очите му са като гълъби при водни потоци, окъпани в мляко, красиво поставени."},
	{13, "13 Бузите му са като лехи с аромати, възвишения с благоуханни растения. Устните му са кремове, от които капе бистра смирна."},
	{14, "14 Ръцете му са като златни рула, покрити с хрисолит. Тялото му е като изваяна слонова кост, украсено със сапфири."},
	{15, "15 Краката му са като мраморни стълбове, основани на подложки от чисто злато. Изгледът му е като Ливан, превъзходен като кедрите."},
	{16, "16 Устата му е пълна със сладост и той целият е желателен. Този е любимият ми и този е приятелят ми, о, ерусалимски дъщери."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct bg6 poems[] = {
	{1, "1 Къде е отишъл твоят любим, о, най-прекрасна между жените? Къде се е отбил твоят любим, за да го търсим с теб?"},
	{2, "2 Любимият ми слезе в градината си, в лехите с ароматите, за да пасе стадото си в градините и да бере кремове."},
	{3, "3 Аз съм на любимия си, и любимият ми е мой; той пасе стадото си между кремовете."},
	{4, "4 Красива си, любима моя, като Терса, прекрасна като Ерусалим, страшна като войска със знамена."},
	{5, "5 Отвърни очите си от мен, защото ме пленяват. Косата ти е като стадо кози, слизащи от Галаад."},
	{6, "6 Зъбите ти са като стадо овце, излизащи от къпането; всяка от които ражда близнаци и нито една между тях не е безплодна."},
	{7, "7 Челото ти зад булото ти е като парче от нар."},
	{8, "8 Има шестдесет царици и осемдесет наложници, и безброй девойки."},
	{9, "9 Но една е гълъбицата ми, съвършената ми, едничка на майка си, избрана на онази, която я е родила. Видяха я дъщерите и я нарекоха благословена; цариците и наложниците — и я похвалиха."},
	{10, "10 Коя е тази, която поглежда като зората, красива като луната, ясна като слънцето, страшна като войска със знамена?"},
	{11, "11 Слязох в градината с орехите, за да видя фиданките на долината, да видя дали е напъпило лозето и дали са разцъфтели наровете."},
	{12, "12 Без да усетя, душата ми ме отнесе на колесниците на благородния ми народ."},
	{13, "13 Обърни се, обърни се, Суламит, завърти се, завърти се, за да те погледаме! Какво ще видите в Суламит? — Нещо като танца на Маханаим."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct bg7 poems[] = {
	{1, "1 Колко красиви са стъпките ти в сандалите, дъще княжеска! Извивките на бедрата ти са като огърлица, като дело на ръцете на майстор."},
	{2, "2 Скутът ти е като кръгла чаша, от която не липсва смесено вино. Коремчето ти е като житен куп, обграден с кремове."},
	{3, "3 Двете ти гърди са като две сърнета близнета."},
	{4, "4 Шията ти е като кулата от слонова кост. Очите ти са като езерата в Есевон до портата на Бат-Рабим. Носът ти е като ливанската кула, която гледа към Дамаск."},
	{5, "5 Главата ти е върху теб като Кармил и косите на главата ти са като пурпурна коприна — царят е вързан с къдриците ти."},
	{6, "6 Колко си красива и колко си приятна, о, любима, в удоволствията!"},
	{7, "7 Това твое тяло прилича на палма и гърдите ти — на гроздове."},
	{8, "8 Казах: Ще се изкача на палмата, ще хвана клоните й. Нека гърдите ти бъдат като гроздове на лозата и благоуханието на дъха ти — като ябълки,"},
	{9, "9 и устата ти като ароматно вино — което слиза гладко за възлюбения ми и се плъзга леко през устните на дремещите."},
	{10, "10 Аз съм на любимия си, и неговото желание е към мен."},
	{11, "11 Ела, любими мой, нека излезем на полето, нека пренощуваме в селата."},
	{12, "12 Нека осъмнем в лозята, нека видим напъпила ли е лозата, отворили ли са се цветовете й, разцъфтели ли са наровете. Там ще ти дам любовта си."},
	{13, "13 Мандрагоровите ябълки издават благоухание и при вратите ни има всякакви приятни плодове — нови и стари, които съм запазила за теб, любими мой."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct bg8 poems[] = {
	{1, "1 О, да ми беше като брат, който е сукал от гърдите на майка ми! Ако те намерех навън, щях да те целуна, и нямаше да ме презират."},
	{2, "2 Щях да те заведа, да те въведа в къщата на майка си, за да ме учиш. Щях да те напоя с ароматно вино от сока на наровете си."},
	{3, "3 Левицата му е под главата ми и десницата му ме прегръща."},
	{4, "4 Заклевам ви, ерусалимски дъщери, в сърните или в полските кошути, да не възбудите, да не събудите любовта, докато сама не пожелае."},
	{5, "5 Коя е тази, която идва от пустинята, като се опира на любимия си? Аз те събудих под ябълката; там те роди майка ти, там тя беше в родилни мъки и те роди."},
	{6, "6 Положй ме като печат на сърцето си, като печат на ръката си — защото любовта е силна като смъртта, ревността е жестока като Шеол; пламъците й са огнени пламъци, като ГОСПОДНИЯ пламък."},
	{7, "7 Дори и много води не могат да угасят любовта, нито порои да я потопят. Ако човек би дал цялото богатство на дома си за любов, съвсем биха го презряли."},
	{8, "8 Ние имаме малка сестра и тя няма гърди. Какво да направим за сестра си в деня, когато стане дума за нея?"},
	{9, "9 Ако тя е стена, ще построим на нея сребърно укрепление; а ако е врата, ще я заградим с кедрови греди."},
	{10, "10 Аз бях стена, и гърдите ми бяха като кули; тогава станах в очите му като една, която е намерила мир."},
	{11, "11 Соломон имаше лозе във Ваал-Хамон и даде лозето на пазачи; всеки трябваше да донесе за плода му хиляда сребърника."},
	{12, "12 Моето лозе е пред мен — хилядата сребърника са за теб, Соломоне, а двеста са за пазачите на плода му."},
	{13, "13 О, ти, която седиш в градините, другарите ми се ослушват за гласа ти — дай ми да го чуя!"},
	{14, "14 Бързай, любими мой, и бъди като сърна или млад елен по благоуханните планини."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};