#include <map>
#include <string>
class Bible47
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
	struct bg5	{ int val; const char *msg; };
	struct bg6	{ int val; const char *msg; };
	struct bg7	{ int val; const char *msg; };
	struct bg8	{ int val; const char *msg; };
	struct bg9	{ int val; const char *msg; };
	struct bg10	{ int val; const char *msg; };
	struct bg11	{ int val; const char *msg; };
	struct bg12	{ int val; const char *msg; };
	struct bg13	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Павел, с Божията воля апостол на Иисус Христос, и брат Тимотей до Божията църква, която е в Коринт, и до всичките светии, които са по цяла Ахая:"},
	{2, "2 Благодат на вас и мир от Бога, нашия Отец, и Господ Иисус Христос."},
	{3, "3 Благословен да бъде Бог и Отец на нашия Господ Иисус Христос, Отец на милостите и Бог на всяка утеха,"},
	{4, "4 който ни утешава във всяка наша скръб, за да можем и ние да утешаваме тези, които се намират в каквато и да било скръб, с утехата, с която и ние сме утешавани от Бога."},
	{5, "5 Защото, както изобилстват в нас страданията на Христос, така и нашата утеха изобилства чрез Христос."},
	{6, "6 И ако ни притесняват, това е за вашата утеха и спасение; или ако ни утешават, това е за вашата утеха (и спасение), която действа, като устоявате на същите страдания, които понасяме и ние."},
	{7, "7 И надеждата ни за вас е твърда, като знаем, че както сте участници в страданията, така сте и в утехата."},
	{8, "8 Защото не искаме, братя, да не знаете за скръбта, която ни сполетя в Азия – че бяхме изключително притеснени, свръх силите си, така че дори се отчаяхме за живота си;"},
	{9, "9 но ние самите бяхме приели смъртната присъда в себе си, за да не се уповаваме на себе си, а на Бога, който възкресява мъртвите,"},
	{10, "10 който ни избави от толкова близка смърт и още избавя и на когото се надяваме, че пак ще ни избавя,"},
	{11, "11 като ни съдействате и вие чрез молитва, така че поради дадената на нас чрез молитвите на мнозина благодат да благодарят мнозина за нас."},
	{12, "12 Защото нашата похвала е тази: свидетелството на нашата съвест, че живяхме на света с простота и Божия искреност – не с плътска мъдрост, а в Божията благодат; и най-много между вас."},
	{13, "13 Защото не ви пишем друго освен това, което четете, а и разбирате, и което се надявам, че ще разберете и до край;"},
	{14, "14 както и отчасти сте разбрали, че ние сме похвала за вас, както и вие – за нас, в Деня на нашия Господ Иисус."},
	{15, "15 С тази увереност възнамерявах да дойда при вас преди това, за да имате втора благодат,"},
	{16, "16 като мина през вас за Македония, а от Македония да дойда пак при вас и тогава вие да ме изпратите за Юдея."},
	{17, "17 Като възнамерявах това, лекомислено ли постъпих? Или това, което възнамерявах, от плътта ли го възнамерявах, че да означава Да, да и Не, не едновременно?"},
	{18, "18 Но Бог е верен, така че словото ни към вас не е Да и Не."},
	{19, "19 Защото Божият Син, Иисус Христос, който беше проповядван между вас от нас – от мен, Сила и Тимотей – не беше Да и Не, а в Него беше Да;"},
	{20, "20 понеже, колкото са Божиите обещания, всичките в Него са Да! -- затова и чрез Него е Амин! за слава на Бога чрез нас."},
	{21, "21 А Този, който ни утвърждава заедно с вас в Христос и който ни е помазал, е Бог,"},
	{22, "22 който ни е запечатал и е дал в сърцата ни Духа в залог."},
	{23, "23 И аз призовавам Бога за свидетел на моята душа, че за да ви пощадя, още не съм дошъл в Коринт."},
	{24, "24 Не че ние господстваме над вашата вяра, а сме помощници на вашата радост; понеже чрез вярата вие стоите."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 Но в себе си реших това: да не идвам при вас пак със скръб."},
	{2, "2 Защото, ако аз ви наскърбявам, то кой ще развесели мен, ако не този, който е бил наскърбен от мен?"},
	{3, "3 И това писах нарочно, да не би когато дойда, да бъда наскърбен от онези, които би трябвало да ме зарадват, като съм сигурен във всички вас, че моята радост е радостта на всички вас."},
	{4, "4 Защото с голяма скръб и свито сърце ви писах с много сълзи – не за да се наскърбите, а за да познаете любовта, която аз имам особено към вас."},
	{5, "5 Но ако някой е причинил скръб, не е наскърбил мен, а донякъде – да не кажа прекалено много – всички вас."},
	{6, "6 За такъв един е достатъчно това наказание, което му е било наложено от мнозинството;"},
	{7, "7 така че сега вече вие трябва по-добре да му простите и да го утешите, да не би такъв един да бъде погълнат от прекомерната скръб."},
	{8, "8 Затова ви умолявам да го уверите в любовта си към него."},
	{9, "9 Понеже затова и писах – за да позная от опит дали сте послушни във всичко."},
	{10, "10 А на когото вие прощавате нещо, прощавам и аз; защото, ако и аз съм простил нещо, простил съм го заради вас пред лицето на Христос,"},
	{11, "11 да не би Сатана да добие преимущество над нас; защото неговите замисли не са ни неизвестни."},
	{12, "12 И когато дойдох в Троада да проповядвам благовестието на Христос и когато ми се отвори врата в Господното дело,"},
	{13, "13 духът ми не се успокои, понеже не намерих брат си Тит, а като се простих с тях, отпътувах за Македония."},
	{14, "14 Но благодаря на Бога, който винаги ни води в победно шествие в Христос и на всяко място изявява чрез нас благоуханието на познанието за Него."},
	{15, "15 Защото за Бога ние сме благоуханието на Христос сред тези, които се спасяват, и сред онези, които погиват."},
	{16, "16 За едните – смъртоносно ухание, което докарва смърт, а за другите – животворно ухание, което докарва живот. И кой е способен на това?"},
	{17, "17 Защото ние не сме като мнозината, които изопачават Божието слово, а говорим искрено в Христос, като от Бога, пред Бога."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 Пак ли започваме да се препоръчваме? Или и ние, както някои, имаме нужда от препоръчителни писма до вас или от вас?"},
	{2, "2 Вие сте нашето писмо, написано в сърцата ни, узнавано и прочитано от всички хора;"},
	{3, "3 и става явно, че вие сте Христово писмо, произлязло чрез нашето служение, написано не с мастило, а с Духа на живия Бог, не на плочи от камък, а на плочи от плът – на сърцето."},
	{4, "4 И ние имаме такава увереност спрямо Бога чрез Христос;"},
	{5, "5 не че ние сме способни от само себе си да съдим за нещо като от нас си, но нашата способност е от Бога,"},
	{6, "6 който ни направи способни да бъдем служители на нов завет – не на буквата, а на Духа; защото буквата убива, а Духът оживотворява."},
	{7, "7 Но ако служенето на онова, което докарва смърт, написано с букви, издълбани на камък, стана с такава слава, че израилевите синове не можеха да гледат Мойсей в лице заради блясъка на лицето му, който преминаваше,"},
	{8, "8 как служенето на Духа няма да бъде с по-голяма слава?"},
	{9, "9 Защото, ако служенето на онова, което докарва осъждане, стана със слава, служенето на онова, което докарва правда, го надминава много повече по слава."},
	{10, "10 Защото и онова, което е било прославено, не е било прославено в това отношение, поради славата, която превъзхожда."},
	{11, "11 Защото, ако преходното беше със слава, колко повече ще бъде в слава трайното!"},
	{12, "12 И така, като имаме такава надежда, пристъпваме с голямо дръзновение"},
	{13, "13 и не сме като Мойсей, който слагаше покривало на лицето си, за да не могат израилевите синове да гледат края на това, което преминаваше."},
	{14, "14 Но техните умове бяха заслепени. Защото и до днес същото това покривало стои при прочитането на Стария Завет, като не се открива, защото то се отмахва в Христос."},
	{15, "15 Но и до днес при прочитането на Мойсей покривало лежи на сърцето им,"},
	{16, "16 но когато Израил се обърне към Господа, покривалото се отмахва."},
	{17, "17 А Господ е Духът; и където е Господният Дух, там е свобода."},
	{18, "18 А ние всички, с открито лице, гледайки като в огледало Господната слава, биваме преобразявани в същия образ от слава в слава, като от Господния Дух."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 Затова, като имаме това служение, както придобихме милост, не се обезсърчаваме;"},
	{2, "2 но се отрекохме от тайните дела на срама, като не постъпваме лукаво, нито изопачаваме Божието слово, а като изявяваме истината, препоръчваме себе си на съвестта на всеки човек пред Бога."},
	{3, "3 Но ако нашето благовестие е покрито, то е покрито за тези, които погиват,"},
	{4, "4 за невярващите, чиито умове е заслепил богът на този свят, за да не би да ги озари светлината на благовестието на славата на Христос, който е образ на Бога."},
	{5, "5 Защото ние не проповядваме себе си — а Христос Иисус като Господ, а себе си като ваши слуги заради Иисус."},
	{6, "6 Защото Бог, който е казал на светлината да изгрее от тъмнината, е Този, който е огрял в сърцата ни, за да даде светлината на познанието на Божията слава в лицето на Иисус Христос."},
	{7, "7 Но ние имаме това съкровище в съдове от пръст, за да бъде превъзходството на силата от Бога, а не от нас."},
	{8, "8 Угнетявани сме отвсякъде, но не сме съкрушени; в недоумение сме, но не до отчаяние;"},
	{9, "9 гонени сме, но не сме изоставени; поваляни сме, но не сме унищожени;"},
	{10, "10 винаги носещи в тялото си умирането на (Господ) Иисус, за да се яви в тялото ни и животът на Иисус."},
	{11, "11 Защото ние, живите, винаги сме предавани на смърт заради Иисус, за да се яви и животът на Иисус в нашата смъртна плът;"},
	{12, "12 така че смъртта наистина действа в нас, а животът – във вас."},
	{13, "13 А като имаме един и същ дух на вяра, както е писано: ?Повярвах, затова и говорих“, то и ние, понеже вярваме, затова и говорим,"},
	{14, "14 като знаем, че Този, който е възкресил Господ Иисус, ще възкреси и нас заедно с Иисус и ще ни представи заедно с вас."},
	{15, "15 Защото всичко това е заради вас, така че благодатта, като се умножи чрез мнозината, да преумножи благодарението за Божията слава."},
	{16, "16 Затова ние не се обезсърчаваме; но дори и да тлее нашият външен човек, пак вътрешният всеки ден се подновява."},
	{17, "17 Защото нашата временна лека скръб произвежда все повече и повече една вечна пълна слава за нас,"},
	{18, "18 които не гледаме на видимите, а на невидимите неща; защото видимите са временни, а невидимите – вечни."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct bg5 poems[] = {
	{1, "1 Защото знаем, че ако се развали земният ни дом, телесната ни скиния, имаме от Бога здание на небесата, дом неръкотворен, вечен."},
	{2, "2 Понеже в този дом ние стенем, като копнеем да се облечем с нашето небесно жилище,"},
	{3, "3 стига само, като сме облечени, да не се намерим голи."},
	{4, "4 Понеже, като сме в тази телесна скиния, ние стенем обременени; защото желаем не да бъдем съблечени, а да бъдем облечени още повече, така че смъртното да бъде погълнато от живота."},
	{5, "5 А Този, който ни е направил точно за това, е Бог, който ни е дал и Духа в залог."},
	{6, "6 И така, винаги сме дързостни, като знаем, че докато сме у дома в тялото, ние сме далеч от Господа,"},
	{7, "7 защото ходим с вярване, а не с виждане."},
	{8, "8 И така, ние сме дързостни и предпочитаме да сме далеч от тялото и да дойдем у дома при Господа."},
	{9, "9 Затова и ревностно се стараем – било у дома или далеч – да бъдем угодни на Него."},
	{10, "10 Защото всички ние трябва да се явим пред Христовото съдилище, за да получи всеки според това, което е правил в тялото – било добро, или зло."},
	{11, "11 И така, като познаваме страха от Господа, убеждаваме хората, а за Бога сме открити; надявам се още, че и за вашите съвести сме открити."},
	{12, "12 И не препоръчваме себе си отново на вас, а ви даваме повод да се хвалите с нас, за да го използвате срещу онези, които се хвалят с това, което е на лице, а не с това, което е на сърце."},
	{13, "13 Защото, ако сме излезли извън себе си, то е заради Бога; или ако сме разумни, то е заради вас."},
	{14, "14 Защото Христовата любов ни принуждава, като разсъждаваме така, че ако един е умрял за всичките, тогава и всичките са умрели;"},
	{15, "15 и че Той умря за всички, така че тези, които живеят, да не живеят вече за себе си, а за Този, който за тях е умрял и е бил възкресен."},
	{16, "16 Затова, отсега нататък ние не познаваме никого по плът; дори и да сме познавали Христос по плът, пак сега вече не Го познаваме така."},
	{17, "17 И така, ако някой е в Христос, той е ново създание; старото премина, ето, (всичко) стана ново!"},
	{18, "18 А всичко е от Бога, който ни примири със Себе Си чрез (Иисус) Христос и ни даде служение на примирение,"},
	{19, "19 тоест, че Бог беше в Христос и примири света със Себе Си, като не счете на хората прегрешенията им, и че вложи в нас словото на примирението."},
	{20, "20 И така, от страна на Христос ние сме посланици, като че Бог чрез нас умолява; молим ви от страна на Христос: примирете се с Бога,"},
	{21, "21 който за нас направи грешен Онзи, който не знаеше грях, за да станем ние в Него праведни пред Бога."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct bg6 poems[] = {
	{1, "1 И ние, като съработници, също ви умоляваме да не приемате напразно Божията благодат."},
	{2, "2 Защото Той казва: ?В благоприятно време те послушах и в спасителен ден ти помогнах.“ Ето, сега е благоприятно време! Ето, сега е спасителен ден!"},
	{3, "3 Ние в нищо не даваме никаква причина за съблазън, да не би да се злослови служението ни,"},
	{4, "4 а във всичко представяме себе си като Божии служители, в голямо търпение, в скърби, в нужди, в страхове,"},
	{5, "5 в бичувания, в затваряния, в смутове, в трудове, в неспане, в постене,"},
	{6, "6 в чистота, в познание, в дълготърпение, в благост, в Светия Дух, в нелицемерна любов,"},
	{7, "7 в говорене истината, в Божията сила, чрез оръжията на правдата в дясната и в лявата ръка,"},
	{8, "8 сред слава и опозорение, сред похвали и укори; считани като измамници, и въпреки това истинни;"},
	{9, "9 като непознати, и въпреки това добре познати; като умиращи, и въпреки това, ето, живеем; като наказвани, и въпреки това неумъртвени;"},
	{10, "10 като наскърбени, но винаги радостни; като бедни, но обогатяващи мнозина; като не притежаващи нищо, и въпреки това притежаващи всичко."},
	{11, "11 О, коринтяни, устата ни са отворени към вас, сърцето ни се разшири."},
	{12, "12 На вас не ви е тясно в нас, а ви е тясно в сърцата ви."},
	{13, "13 Също така за отплата – говоря като на деца – разширете и вие сърцата си."},
	{14, "14 Не се впрягайте с невярващите; защото, какво общо имат правдата и беззаконието? Или какво общение има светлината с тъмнината?"},
	{15, "15 И какво съгласие има между Христос и Велиал? Или какво съучастие има вярващият с невярващия?"},
	{16, "16 И какво споразумение има между Божия храм и идолите? Защото ние сме храм на живия Бог, както каза Бог: ?Ще се заселя между тях и между тях ще ходя; и ще им бъда Бог, и те ще Ми бъдат народ.“"},
	{17, "17 Затова, ?излезте изсред тях и се отделете“, казва Господ, ?и не се допирайте до нечисто“, и: ?Аз ще ви приема,"},
	{18, "18 и ще ви бъда Отец, и вие ще Ми бъдете синове и дъщери“, казва всемогъщият Господ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct bg7 poems[] = {
	{1, "1 И така, възлюбени, като имаме тези обещания, нека очистим себе си от всяка плътска и духовна нечистота, като се усъвършенстваме в святост в страх от Бога."},
	{2, "2 Направете място в сърцата си за нас. Никого не сме онеправдали, никого не сме покварили, никого не сме измамили."},
	{3, "3 Не казвам това, за да ви осъдя; защото преди това казах, че вие сте в нашите сърца, за да умрем заедно и да живеем заедно."},
	{4, "4 Голяма е моята увереност към вас, много се хваля с вас. Изпълнен съм с утеха, преизобилствам с радост при всичката наша скръб."},
	{5, "5 Защото и когато дойдохме в Македония, плътта ни нямаше спокойствие, а отвсякъде бяхме притеснени – отвън борби, отвътре страхове."},
	{6, "6 Но Бог, който утешава смирените, ни утеши с идването на Тит."},
	{7, "7 И не само с идването му, но и с утехата, с която той беше утешен чрез вас, като ни извести копнежа ви, плача ви, ревността ви за мен, така че аз още повече се зарадвах."},
	{8, "8 Защото, дори да ви наскърбих с писмото си, не се разкайвам; въпреки че се бях поразкаял, когато видях, че онова писмо ви наскърби, макар и за кратко време."},
	{9, "9 Сега се радвам, не заради наскърбяването ви, а заради това, че наскърбяването ви доведе до покаяние; понеже вие бяхте наскърбени по Бога, така че да не претърпите никаква вреда от нас."},
	{10, "10 Защото скръбта по Бога докарва спасително покаяние, за което не съжаляваш; но скръбта на света докарва смърт."},
	{11, "11 Защото вижте, това, че се наскърбихте по Бога, какво усърдие породи във вас, каква защита, какво негодувание, какъв страх, какъв копнеж, каква ревност, какво наказание! Във всичко вие показахте, че сте чисти в това нещо."},
	{12, "12 И така, ако ви писах, не ви писах заради този, който беше оскърбил, нито заради този, който беше оскърбен, а за да ви се яви пред Бога нашата грижа за вас."},
	{13, "13 Затова ние се утешихме и освен тази наша утеха се зарадвахме още повече заради радостта на Тит, защото всички вие сте освежили духа му."},
	{14, "14 Защото, ако съм му се похвалил с нещо за вас, не бях посрамен; но както всичко, което ви говорихме, беше истинно, така и похвалата ни с вас пред Тит излезе истина."},
	{15, "15 И той още повече милее за вас, като си спомня послушанието на всички ви и как сте го приели със страх и трепет."},
	{16, "16 Радвам се, че във всичко мога да разчитам на вас."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct bg8 poems[] = {
	{1, "1 При това, братя, известяваме ви Божията благодат, дадена на църквите в Македония,"},
	{2, "2 че макар и в голямо скръбно изпитание, пак изобилната им радост и дълбоката им беднотия направиха да преизобилства богатството на тяхната щедрост."},
	{3, "3 Защото свидетелствам, че те дадоха доброволно според възможностите си и дори над възможностите си,"},
	{4, "4 като ни умоляваха с голяма настоятелност да приемем и техния дар и участие в служенето на светиите."},
	{5, "5 И те не само дадоха, както се надявахме, но първо предадоха себе си на Господа и по Божията воля на нас."},
	{6, "6 Така че помолихме Тит да довърши у вас и това благодеяние, както го беше и започнал."},
	{7, "7 И както изобилствате във всяко нещо – във вяра, в слово, в познание, в пълно усърдие и в любовта си към нас – така да преизобилствате и в това благодеяние."},
	{8, "8 Не казвам това като по заповед, а за да изпитам искреността на вашата любов чрез усърдието на другите."},
	{9, "9 Защото знаете благодатта на нашия Господ Иисус Христос – че като беше богат, за вас стана беден, за да станете вие богати чрез Неговата бедност."},
	{10, "10 А относно това ви давам този съвет, защото това е полезно за вас, които миналата година започнахте не само да правите това, но и да го желаете."},
	{11, "11 А сега го свършете и на дело, така че, както сте имали готовност в желанието, така да имате и в довършването според това, което имате."},
	{12, "12 Защото, ако има готовност, тя се приема според това, което има човек, а не според това, което няма."},
	{13, "13 Понеже не искам други да бъдат облекчени, а вие – притеснени,"},
	{14, "14 а да има равенство, като вашето сегашно изобилие запълни тяхната оскъдност и тяхното изобилие послужи на вашата оскъдност; така че да има равенство,"},
	{15, "15 както е писано: ?Който беше събрал много, нямаше излишък; и който беше събрал малко, не му беше оскъдно.“"},
	{16, "16 Но да благодарим на Бога, който влага същото усърдие за вас в сърцето на Тит."},
	{17, "17 Защото той наистина прие молбата, но като беше и сам много усърден, тръгна към вас доброволно."},
	{18, "18 Пратихме с него и брата, чиято похвала в делото на благовестието е известна на всичките църкви;"},
	{19, "19 и не само това, но още беше избран от църквите да пътува с нас за делото на това благодеяние, на което служим за славата на Самия Господ и за да се покаже нашето усърдие,"},
	{20, "20 като избягваме това, някой да ни упрекне относно този щедър дар, който е поверен на нашето служение;"},
	{21, "21 понеже се грижим за това, което е добро не само пред Господа, но и пред хората."},
	{22, "22 Изпратихме с тях и другия наш брат, чието усърдие сме опитали много пъти и в много неща и който сега е много по-усърден поради голямото доверие към вас."},
	{23, "23 Колкото за Тит, той е мой другар и съработник между вас; а колкото за нашите братя, те са пратеници на църквите и са слава на Христос."},
	{24, "24 И така, покажете на тях, а и пред църквите, доказателство за своята любов и за основателността на нашата похвала с вас."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct bg9 poems[] = {
	{1, "1 А за служенето на светиите Е излишно да ви пиша,"},
	{2, "2 понеже зная вашата готовност, за което се хваля с вас пред македонците – че Ахая още от миналата година е готова; и вашата ревност е подбудила по-голямата част от тях."},
	{3, "3 Но аз изпратих братята, за да не би нашата похвала с вас в това отношение да излезе напразна, така че да бъдете готови, както казах;"},
	{4, "4 да не би ако дойдат с мен македонци и ви намерят, че не сте готови, да се посрамим ние – да не кажа вие – в тази увереност."},
	{5, "5 И така, намерих за необходимо да помоля братята да отидат при вас по-рано и да приготвят обещаното отпреди ваше дарение, за да бъде готово като дарение, а не като скъперничество."},
	{6, "6 А това казвам, че който сее оскъдно, оскъдно и ще пожъне; а който сее щедро, щедро и ще пожъне."},
	{7, "7 Всеки да дава, както е решил в сърцето си, не с неохота и не от принуждение; защото Бог люби онзи, който дава на драго сърце."},
	{8, "8 А Бог е силен да преумножи върху вас всякаква благодат, така че, като имате винаги и във всичко достатъчно във всяко отношение, да изобилствате във всяко добро дело,"},
	{9, "9 както е писано: ?Разпръсна щедро, даде на сиромасите; правдата Му трае до века.“"},
	{10, "10 А Този, който дава семе на сеяча и хляб за храна, ще даде и ще умножи вашето семе за сеене и ще направи да изобилстват плодовете на вашата правда,"},
	{11, "11 за да бъдете във всяко отношение богати за всякаква щедрост, която чрез нас произвежда благодарение на Бога."},
	{12, "12 Защото извършването на това служение не само запълва нуждите на светиите, но и се умножава чрез многото благодарения пред Бога;"},
	{13, "13 понеже чрез доказателството на това служение те славят Бога за вашата послушност на Христовото благовестие, което изповядвате, и за щедростта на вашето участие в дарението за тях и за всички;"},
	{14, "14 и в молитвите си за вас те копнеят за вас поради дадената ви изобилна Божия благодат."},
	{15, "15 Да благодарим на Бога за Неговия неизразим дар!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct bg10 poems[] = {
	{1, "1 И сам аз, Павел, ви моля с кротостта и нежността на Христос – аз, който съм смирен, когато съм между вас, но когато отсъствам, ставам смел към вас –"},
	{2, "2 моля ви, когато съм при вас, да не се принудя да употребя смелост с онази увереност, с която мисля да се одързостя срещу някои, които считат, че ние постъпваме плътски."},
	{3, "3 Защото, макар и да живеем в плът, ние не воюваме по плът."},
	{4, "4 Защото оръжията, с които воюваме, не са плътски, а са силни пред Бога за събаряне на крепости."},
	{5, "5 Понеже събаряме помисли и всичко, което се издига високо против познанието на Бога, и пленяваме всяка мисъл да се покорява на Христос."},
	{6, "6 И сме готови да накажем всяко непослушание, щом стане пълно вашето послушание."},
	{7, "7 Погледнете това, което е пред очите ви! Ако някой е уверен в себе си, че е Христов, нека размисли още веднъж в себе си, че както той е Христов, така и ние сме Христови."},
	{8, "8 Защото, ако бих се похвалил малко повече с нашата власт, която Господ ни даде за вашето изграждане, а не за вашето разрушение, не бих се засрамил."},
	{9, "9 Но нека не изглежда така, като че желая да ви плаша с писмата си."},
	{10, "10 Понеже – казват някои – писмата му са строги и силни, но личното му присъствие е слабо и говоренето – нищожно."},
	{11, "11 Такъв нека има предвид това, че каквито сме на думи в писмата си, когато сме далеч от вас, такива сме и на дело, когато сме при вас."},
	{12, "12 Защото не смеем да се причисляваме или да се сравняваме с някои от онези, които препоръчват сами себе си; но те, като мерят себе си със себе си и като сравняват себе си със себе си, не постъпват разумно."},
	{13, "13 Но ние няма да се похвалим извън мярката, а според мярката на областта, която Бог ни е определил като мярка, която да достигне дори до вас."},
	{14, "14 Защото ние не се простираме прекалено надалеч, като че ли не сме били достигали до вас, защото и до вас достигнахме с Христовото благовестие;"},
	{15, "15 и не се хвалим с това, което е извън нашата мярка, тоест с чужди трудове, но имаме надежда, че с растежа на вашата вяра ние, според областта си за работа, ще се възвеличим още повече между вас,"},
	{16, "16 така че да проповядваме благовестието и от вас по-нататък, а не да се хвалим с извършеното в чужда област."},
	{17, "17 А ?който се хвали, с Господа да се хвали.“"},
	{18, "18 Защото не е одобрен този, който препоръчва сам себе си, а този, когото Господ препоръчва."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct bg11 poems[] = {
	{1, "1 О, да бихте потърпели още малко моето безумие! Но и вие наистина ме търпите!"},
	{2, "2 Защото ревнувам за вас с божествена ревност, понеже ви сгодих за един Мъж, за да ви представя като чиста девица пред Христос."},
	{3, "3 Но се боя, да не би както змията измами Ева с хитростта си, така и вашите умове да се покварят и да отпаднат от простотата, която дължите на Христос."},
	{4, "4 Защото, ако дойде някой и ви проповядва друг Иисус, когото ние не сме проповядвали, или ако получите друг дух, когото не сте получили, или друго благовестие, което не сте приели, вие лесно търпите това."},
	{5, "5 Обаче аз мисля, че не съм в нищо по-долен от превъзходните апостоли!"},
	{6, "6 Но дори и да съм неучен в говоренето, в познанието не съм; и ние по всякакъв начин сме ви показали това пред всички."},
	{7, "7 Грях ли сторих, като смирявах себе си, за да се издигнете вие, понеже ви проповядвах Божието благовестие даром?"},
	{8, "8 Други църкви обрах, като вземах заплата от тях, за да служа на вас."},
	{9, "9 А когато бях при вас и изпаднах в нужда, не дотежах на никого, защото братята, които дойдоха от Македония, задоволиха нуждата ми. Така във всичко се пазих и ще се пазя, да не ви бъда в тежест."},
	{10, "10 Христовата истина, която е в мен, свидетелства, че никой няма да ми отнеме тази похвала в ахайските места."},
	{11, "11 Защо? Защото не ви любя ли? Бог знае!"},
	{12, "12 А каквото правя, това и ще правя, за да отрежа възможността на тези, които търсят възможност да бъдат считани за такива, каквито сме ние, в това, с което те се хвалят."},
	{13, "13 Защото такива хора са лъжеапостоли, измамни работници, които се преправят на Христови апостоли."},
	{14, "14 И това не е чудно, защото сам Сатана се преправя на ангел на светлината."},
	{15, "15 Така че не е голямо нещо, ако и неговите служители се преправят на служители на правдата. Но техният край ще бъде според делата им."},
	{16, "16 Пак казвам, никой да не ме счита за безумен; ако ли не, приемете ме като безумен, та и аз да се похваля малко."},
	{17, "17 Това, което казвам, не го казвам по Господа, а като в безумие, в тази моя увереност на хваленето."},
	{18, "18 Тъй като мнозина се хвалят по плът, ще се похваля и аз."},
	{19, "19 Защото вие, като сте разумни, с готовност търпите безумните;"},
	{20, "20 понеже търпите, ако някой ви заробва, ако ви изпояжда, ако ви обира, ако се превъзнася, ако ви бие по лицето."},
	{21, "21 За срам казвам, че бяхме слаби; но в каквото се осмелява някой – неразумно говоря – осмелявам се и аз."},
	{22, "22 Евреи ли са? И аз съм. Израилтяни ли са? И аз съм. Авраамово потомство ли са? И аз съм."},
	{23, "23 Христови служители ли са? – В безумие говоря. – Аз още повече. Бил съм в много повече усилия, прекомерно в бичувания, още повече в тъмници и много пъти и на смърт."},
	{24, "24 Пет пъти юдеите са ми удряли по четиридесет удара без един,"},
	{25, "25 три пъти са ме били с тояги, веднъж са ме пребивали с камъни, три пъти съм претърпявал корабокрушение, една нощ и един ден съм бил сред морските стихии."},
	{26, "26 Много пъти съм бил в пътешествия, в опасност от реки, в опасност от разбойници, в опасност от съотечественици, в опасност от езичници, в опасност в града, в опасност в пустинята, в опасност в морето, в опасност между лъжебратя;"},
	{27, "27 в труд и мъка, много пъти в неспане, в глад и жажда, много пъти в пост, в студ и голота;"},
	{28, "28 и освен всичко, това, което тежи върху мен всеки ден – грижата за всичките църкви."},
	{29, "29 Кой изнемощява, без да изнемощявам и аз? Кой се съблазнява, без да се разпалвам и аз?"},
	{30, "30 Ако трябва да се хваля, ще се похваля със своята немощ."},
	{31, "31 Бог и Отец на нашия Господ Иисус (Христос), който е благословен до века, знае, че не лъжа."},
	{32, "32 В Дамаск областният управител на цар Арета постави стража в град Дамаск, за да ме улови,"},
	{33, "33 но през един прозорец ме спуснаха по стената с кош и избягах от ръцете му."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct bg12 poems[] = {
	{1, "1 Трябва да се хваля, макар че не е от полза; но сега ще дойда до видения и откровения от Господа."},
	{2, "2 Познавам един човек в Христос, който преди четиринадесет години – в тялото ли, не зная, вън от тялото ли, не зная, Бог знае – беше грабнат и занесен до третото небе."},
	{3, "3 И зная за този човек – в тялото ли, или извън тялото, не зная, Бог знае –"},
	{4, "4 че беше грабнат и занесен в рая, и чу неизразими думи, които на човека не е позволено да изговори."},
	{5, "5 С такъв човек ще се похваля, а със себе си няма да се похваля освен с немощите си."},
	{6, "6 Защото, дори и да поискам да се похваля, няма да бъда безумен, понеже ще говоря истината; но се въздържам, за да не би някой да помисли за мен повече от това, което вижда в мен или чува от мен."},
	{7, "7 А за да не се превъзнасям поради твърде многото откровения, ми се даде трън в плътта, пратеник от Сатана, да ме мъчи, за да не се превъзнасям."},
	{8, "8 За това нещо три пъти се молих на Господа да се махне от мен;"},
	{9, "9 и Той ми каза: Достатъчна ти е Моята благодат; защото силата Ми се показва съвършена в немощ. И така, с голяма радост ще се похваля по-скоро с немощите си, за да почива на мен Христовата сила."},
	{10, "10 Затова намирам удоволствие в немощи, в укори, в лишения, в гонения, в страхове заради Христос; защото, когато съм немощен, тогава съм силен."},
	{11, "11 Станах безумен. Вие ме принудихте. Защото вие трябваше да ме препоръчвате, понеже не съм бил по-долен в нищо от превъзходните апостоли, макар и да съм нищо."},
	{12, "12 Наистина, апостолските признаци се показаха между вас с пълно търпение, чрез знамения, чудеса и велики дела."},
	{13, "13 Защото, в какво бяхте поставени по-долу от другите църкви освен в това, че сам аз не ви дотежах? Простете ми тази неправда!"},
	{14, "14 Ето, готов съм да дойда при вас за трети път ?? няма да ви дотежа, защото не искам вашето, а вас; понеже децата не са длъжни да събират имот за родителите, а родителите – за децата."},
	{15, "15 А пък аз с най-голяма радост ще харча и цял ще се похарча за душите ви. Ако аз ви любя повече, вие по-малко ли ще ме любите?"},
	{16, "16 Но нека да е така, че не съм ви натежал, но понеже съм бил хитър, съм ви уловил с измама."},
	{17, "17 Припечелих ли аз чрез някои от онези, които изпратих до вас?"},
	{18, "18 Помолих Тит да отиде при вас и изпратих нашия брат с него. Тит припечели ли в нещо от вас? Не ходехме ли в същия дух, в същите стъпки?"},
	{19, "19 Още ли мислите, че ние се защищаваме пред вас? Ние говорим пред Бога в Христос, и всичко това, възлюбени мои, за ваше изграждане."},
	{20, "20 Защото се боя, да не би като дойда, да не ви намеря такива, каквито ви желая, и вие да ме намерите такъв, какъвто не ме желаете; и да не би да има между вас раздори, завист, гняв, партизанщина, клюкарство, шушукания, големеене, бъркотии;"},
	{21, "21 да не би когато дойда пак, да ме смири моят Бог между вас и да оплача мнозина, които преди това са съгрешили и не са се покаяли за нечистотата, блудството и разпътството, на които са се предавали."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct bg13 poems[] = {
	{1, "1 Ето, трети път идвам при вас. ?От устата на двама или трима свидетели ще се потвърди всяка работа.“"},
	{2, "2 Както, когато бях при вас втори път, ви предупредих, така и сега, когато не съм при вас, предупреждавам тези, които преди това са съгрешили, и всички други, че ако дойда пак, няма да пощадя,"},
	{3, "3 тъй като търсите доказателство, че в мен говори Христос, който не е слаб спрямо вас, но е силен във вас;"},
	{4, "4 защото, макар и да беше разпънат в немощ, пак живее чрез Божията сила. И ние също сме немощни в Него, но ще живеем с Него чрез Божията сила към вас."},
	{5, "5 Изпитвайте себе си дали сте във вярата, опитвайте себе си. Или самите вие не познавате, че Христос е във вас, освен ако не сте негодни?"},
	{6, "6 Но аз се надявам вие да познаете, че ние не сме негодни."},
	{7, "7 И моля Бога да не извършите никакво зло – не за да се покажем ние годни, а за да правите вие това, което е добро, дори и ние да бъдем като негодни."},
	{8, "8 Защото не можем да вършим нищо против истината, а само за истината."},
	{9, "9 Понеже се радваме, когато ние сме слаби, а вие сте силни; и за това се молим – за вашето усъвършенстване."},
	{10, "10 И така, пиша това, докато отсъствам, та когато съм при вас, да не трябва да се отнеса строго към вас според властта, която ми е дал Господ за изграждане, а не за разрушение."},
	{11, "11 Най-накрая, братя, радвайте се, усъвършенствайте се, утешавайте се, бъдете единомислени, живейте в мир; и Бог на любовта и на мира ще бъде с вас."},
	{12, "12 Поздравете се един друг със свята целувка."},
	{13, "13 Поздравяват ви всичките светии."},
	{14, "14 Благодатта на Господ Иисус Христос и Божията любов, и общението на Светия Дух да бъде с всички вас. (Амин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};