#include <map>
#include <string>
class Bible36
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 ГОСПОДНОТО слово, което беше към Софония, сина на Хусий, син на Годолия, син на Амария, син на Езекия, в дните на юдовия цар Йосия, сина на Амон:"},
	{2, "2 Напълно ще погубя всичко от лицето на земята, заявява ГОСПОД."},
	{3, "3 Ще погубя човек и животно, ще погубя въздушните птици и морските риби, и идолите за препъване заедно с безбожните; и ще изтребя човека от лицето на земята, заявява ГОСПОД."},
	{4, "4 И ще простра ръката Си върху Юда и върху всичките жители на Ерусалим и ще изтребя от това място остатъка на Ваал и името на жреците заедно със свещениците,"},
	{5, "5 и онези, които се кланят по покривите на небесното войнство; и онези, които се кланят и се кълнат в ГОСПОДА,и се кълнат в Мелхом;"},
	{6, "6 и онези, които се отклоняват отслед ГОСПОДА и които не търсят ГОСПОДА и не питат за Него."},
	{7, "7 Мълчи пред Господа БОГА, защото Денят на ГОСПОДА е близо, защото ГОСПОД е приготвил жертва, осветил е поканените Си."},
	{8, "8 И в деня на жертвата ГОСПОДНА ще накажа първенците и царските синове и всички, които се обличат в чуждестранни дрехи."},
	{9, "9 И в онзи ден ще накажа и всички, които прескачат прага, които пълнят дома на своя Господ с насилие и измама."},
	{10, "10 И в онзи ден, заявява ГОСПОД, ще се разнесе вик от Рибната порта, ридание от другата част на града и голямо разрушение от хълмовете."},
	{11, "11 Плачете, жители на Мактес, защото целият търговски народ се изтреби, всички натоварени със сребро се отсякоха."},
	{12, "12 И в онова време ще претърся Ерусалим със светилници и ще накажа мъжете, които почиват на дрождите си, които казват в сърцето си: ГОСПОД няма да направи нито добро, нито зло!"},
	{13, "13 Затова имотът им ще бъде за грабеж и къщите им — за опустошение; и ще строят къщи, но няма да живеят в тях, и ще садят лозя, но няма да пият виното им."},
	{14, "14 Близо е великият Ден на ГОСПОДА; близо е и много бърза. Гласът на Деня на ГОСПОДА! Горко, вика там воинът."},
	{15, "15 Ден на ярост е онзи ден, ден на скръб и утеснение, ден на опустошение и запустение, ден на тъмнина и мрак, ден на облак и гъста мъгла,"},
	{16, "16 ден на тръба и на боен вик против укрепените градове и против високите кули."},
	{17, "17 И Аз ще притесня хората, така че ще ходят като слепи, понеже съгрешиха против ГОСПОДА; и кръвта им ще се излее като прах и месата им — като тор."},
	{18, "18 Нито среброто им, нито златото им ще може да ги избави в деня на яростта ГОСПОДНА и от огъня на ревността Му ще бъде погълната цялата земя, защото ще сложи край, и то внезапен, на всичките жители на земята."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 Изпитайте се и се съберете, народе безсрамен,"},
	{2, "2 преди да влезе указът в сила — денят преминава като плява — преди да ви връхлети пламенният гняв на ГОСПОДА, преди да ви връхлети Денят на гнева ГОСПОДЕН."},
	{3, "3 Търсете ГОСПОДА, всички смирени на земята, които вършите правилата Му; търсете правда, търсете смирение — може би ще бъдете скрити в Деня на гнева ГОСПОДЕН."},
	{4, "4 Защото Газа ще бъде оставена и Аскалон — запустен, ще изгонят Азот по пладне и Акарон ще бъде изкоренен."},
	{5, "5 Горко на жителите на морските крайбрежия, на народа на херетците! Словото ГОСПОДНО е против вас, Ханаане! Филистимска земьо, ще те погубя, да няма в теб жител!"},
	{6, "6 И морското крайбрежие ще бъде селище с кладенци за овчари и кошари за стада."},
	{7, "7 И крайбрежието ще бъде за остатъка от юдовия дом — на него ще пасат стадата си. В къщите на Аскалон ще се изтягат вечер, защото ГОСПОД, техният Бог, ще ги посети и ще ги върне от плен."},
	{8, "8 Чух хулата на Моав и оскърбленията на синовете на Амон, с които хулеха народа Ми и се големееха против пределите му."},
	{9, "9 Затова, жив съм Аз, заявява ГОСПОД на Войнствата, Израилевият Бог — непременно Моав ще стане като Содом и синовете на Амон — като Гомора — място, обрасло с коприва и солници и вечна пустош. Остатъкът от народа Ми ще ги ограби и останката от народа Ми ще ги притежава."},
	{10, "10 Това ще им стане заради високомерието им, защото хулеха народа на ГОСПОДА на Войнствата и се големееха против него."},
	{11, "11 ГОСПОД ще бъде страшен за тях, защото ще умори всичките богове на земята. И всичките острови на народите ще Му се поклонят, всеки от мястото си."},
	{12, "12 И вие, етиопци, ще бъдете пронизани от меча Ми."},
	{13, "13 Той ще простре ръката Си против севера и ще погуби Асур, и ще обърне Ниневия в пустош, в място, безводно като пустинята."},
	{14, "14 И сред нея ще лежат стада, всякакъв вид животни; и пеликанът и таралежът ще нощуват по капителите й, глас ще ехти в прозорците, разруха — в праговете, защото Той я лиши от кедровите изделия."},
	{15, "15 Този е веселящият се град, който живееше безгрижно, който казваше в сърцето си: Аз съм, и освен мен няма друг! Как се обърна в пустош, в обиталище на зверове! Всеки, който минава край него, ще подсвирне, ще помаха с ръката си."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 Горко на бунтовния и осквернен град, на потисническия град!"},
	{2, "2 Не послуша глас, не прие поправление, не се упова на ГОСПОДА, не се приближи при своя Бог."},
	{3, "3 Първенците му сред него са ревящи лъвове, съдиите му — вечерни вълци, не оставят кост за сутринта."},
	{4, "4 Пророците му са лекомислени, коварни хора, свещениците му оскверниха светилището, насилваха закона."},
	{5, "5 ГОСПОД е праведен сред него, няма да извърши неправда; сутрин след сутрин неизменно извежда на светло Своето правосъдие, но неправедният не знае срам."},
	{6, "6 Изтребих народи, кулите им опустяха, запустих пътищата им, да не минава никой, градовете им са опустошени, няма никой, няма жител."},
	{7, "7 Казах: О, дано се убоиш от Мен, да приемеш поправление! И така селището му няма да се изтреби според всичко, което му определих. Но те станаха рано и поквариха всичките си дела."},
	{8, "8 Затова, чакайте Ме, заявява ГОСПОД, до деня, когато се надигна за обир; защото присъдата Ми е да струпам народите, да събера царствата, за да излея върху тях негодуванието Си, целия си пламенен гняв, понеже в огъня на ревността Ми ще бъде погълната цялата земя."},
	{9, "9 Защото тогава ще променя устните на народите на чисти устни, за да призовават всички Името на ГОСПОДА и да Му служат единодушно."},
	{10, "10 От отвъд етиопските реки поклонниците Ми, разпръснатите Ми, ще Ми донесат принос."},
	{11, "11 В онзи ден няма да се срамуваш от всичките си дела, с които си отстъпил от Мен, защото тогава ще отнема отсред теб твоите, които горделиво тържествуват, и ти няма вече да се държиш надменно на светия Ми хълм."},
	{12, "12 Но ще оставя сред теб смирен и беден народ, който ще се уповава на Името на ГОСПОДА."},
	{13, "13 Останалите от Израил няма да вършат беззаконие и няма да говорят лъжа и няма да се намери в устата им измамен език — защото ще пасат и ще лежат и никой няма да ги плаши."},
	{14, "14 Пей, сионска дъще, извикай от радост, Израилю! Радвай се и се весели от все сърце, ерусалимска дъще!"},
	{15, "15 ГОСПОД отмени присъдите ти, отвърна врага ти; Царят на Израил, ГОСПОД, е сред теб; няма вече да видиш зло."},
	{16, "16 В онзи ден ще се каже на Ерусалим: Не се бой! Сионе, да не отслабват ръцете ти!"},
	{17, "17 ГОСПОД, твоят Бог, е сред теб. Силният ще те спаси, ще се весели за теб с радост, ще мълчи в любовта си, ще ликува за теб с песен."},
	{18, "18 Ще събера скърбящите заради празниците — от теб бяха, позорът тежи върху тях."},
	{19, "19 Ето, Аз ще се разправя с всичките ти угнетители; и ще спася куцащата и ще прибера изгонената; и ще ги направя за слава и име във всички страни, където бяха за срам."},
	{20, "20 В онова време ще ви доведа и на времето ще ви събера, защото ще ви направя за име и слава сред всички народи на земята, когато ви върна от плен пред очите ви, казва ГОСПОД."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};