#include <map>
#include <string>
class Bible32
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 ГОСПОДНОТО слово беше към Йона, сина на Аматий, и каза:"},
	{2, "2 Стани, иди в големия град Ниневия и прогласявай против него, защото злината му се изкачи пред Мен."},
	{3, "3 А Йона стана да побегне в Тарсис от лицето на ГОСПОДА. И слезе в Йопия и намери кораб, който отиваше в Тарсис, и плати за пътуването си и влезе в него, за да отиде с тях в Тарсис от лицето на ГОСПОДА."},
	{4, "4 А ГОСПОД надигна силен вятър в морето и стана голяма буря в морето, и изглеждаше, че корабът ще се разбие."},
	{5, "5 И моряците се уплашиха и извикаха всеки към своя бог, и хвърлиха в морето вещите, които бяха в кораба, за да олекне от тях. А Йона беше слязъл и легнал на дъното на кораба и спеше дълбоко."},
	{6, "6 И капитанът на кораба се приближи до него и каза: Какво спиш? Стани, призови Бога си — може би Бог ще си спомни за нас и няма да загинем!"},
	{7, "7 И си казаха един на друг: Елате да хвърлим жребий, за да разберем заради кого ни е това зло. И хвърлиха жребий и той падна на Йона."},
	{8, "8 И му казаха: Кажи ни, молим те, заради кого ни е това зло! Каква ти е работата и откъде идваш? Коя е страната ти и от кой народ си?"},
	{9, "9 А той им каза: Аз съм евреин и се боя от ГОСПОДА, небесния Бог, който е направил морето и сушата."},
	{10, "10 И мъжете твърде много се уплашиха и му казаха: Какво си сторил? Защото мъжете бяха разбрали, че той бяга от лицето на ГОСПОДА, понеже им беше казал."},
	{11, "11 И му казаха: Какво да ти направим, за да утихне за нас морето? Защото морето ставаше все по-бурно."},
	{12, "12 И им каза: Вземете ме и ме хвърлете в морето и морето ще утихне за вас; защото зная, че заради мен ви постигна тази голяма буря."},
	{13, "13 А мъжете гребяха силно, за да върнат кораба към сушата, но не можеха, защото морето ставаше все по-бурно против тях."},
	{14, "14 И извикаха към ГОСПОДА и казаха: Молим Те, ГОСПОДИ, молим Те да не загинем заради душата на този човек! И не налагай върху нас невинна кръв, защото Ти, ГОСПОДИ, си извършил, каквото си искал."},
	{15, "15 И взеха Йона и го хвърлиха в морето, и яростта на морето утихна."},
	{16, "16 И мъжете се убояха твърде много от ГОСПОДА и принесоха жертва на ГОСПОДА и направиха обреци."},
	{17, "17 А ГОСПОД определи една голяма риба да погълне Йона. И Йона беше в корема на рибата три дни и три нощи."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 И Йона се помоли на ГОСПОДА, своя Бог, от корема на рибата."},
	{2, "2 И каза: В скръбта си извиках към ГОСПОДА и Той ми отговори; от утробата на Шеол извиках и Ти чу гласа ми."},
	{3, "3 Защото Ти ме хвърли в дълбините, в сърцето на морето, и течението ме обви; всички Твои вълни и талази преминаха над мен."},
	{4, "4 И аз казах: Отхвърлен съм отпред очите Ти! Но отново ще погледна към светия Ти храм."},
	{5, "5 Водите обгърнаха душата ми, бездната ме обкръжи, водорасли се обвиха около главата ми."},
	{6, "6 Слязох до дъното на планините, резетата на земята се затвориха зад мен навеки. Но Ти изведе живота ми от рова, ГОСПОДИ, Боже мой!"},
	{7, "7 Когато душата ми чезнеше в мен, си спомних за ГОСПОДА и молитвата ми дойде при Теб в светия Ти храм."},
	{8, "8 Онези, които почитат нищожните идоли, оставят милостта, пазена за тях."},
	{9, "9 Но аз ще ти принеса жертва с глас на хваление; ще отдам това, което съм обрекъл. Спасението е при ГОСПОДА."},
	{10, "10 И ГОСПОД заповяда на рибата и тя изплю Йона на сушата."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 И ГОСПОДНОТО слово беше втори път към Йона и каза:"},
	{2, "2 Стани, иди в големия град Ниневия и му прогласявай проповедта, която ти говоря."},
	{3, "3 И Йона стана и отиде в Ниневия според словото на ГОСПОДА. А Ниневия беше изключително голям град, който изискваше три дни, за да се обходи."},
	{4, "4 И Йона започна да ходи в града, на един ден път, и прогласяваше, и казваше: Още четиридесет дни и Ниневия ще бъде разорена!"},
	{5, "5 И жителите на Ниневия повярваха на Бога и прогласиха пост, и се облякоха с вретище, от най-големия им до най-малкия им."},
	{6, "6 И словото стигна до царя на Ниневия и той стана от престола си и свали одеждата си, и се покри с вретище и седна в праха."},
	{7, "7 И разгласи и заяви из Ниневия с указ от царя и от големците му, казвайки: Хора и животни, говеда и дребен добитък да не вкусят нищо и да не пасат, и да не пият вода!"},
	{8, "8 И човек, и животно да се покрият с вретище и да викат силно към Бога; и да се върнат всеки от злия си път и от неправдата, която е в ръцете им."},
	{9, "9 Кой знае, може Бог да се обърне и да се разкае, и да се отвърне от пламтящия Си гняв, и да не погинем?"},
	{10, "10 И Бог видя делата им, че се обърнаха от злия си път, и Бог се разкая за злото, което беше говорил, че ще им направи, и не го направи."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 А това раздразни Йона много лошо и той се разсърди."},
	{2, "2 И се помоли на ГОСПОДА и каза: О, ГОСПОДИ, не беше ли това думата ми още когато бях в страната си? Затова побързах да бягам в Тарсис, защото знаех, че Ти си Бог милостив и състрадателен, дълготърпелив и многомилостив, и се разкайваш за злото."},
	{3, "3 И сега, ГОСПОДИ, моля Ти се, вземи душата ми от мен, защото е по-добре да умра, отколкото да живея!"},
	{4, "4 А ГОСПОД каза: Добро ли е да се сърдиш?"},
	{5, "5 И Йона излезе от града и седна на изток от града, и си направи там колиба, и седеше под нея на сянка, докато види какво ще стане с града."},
	{6, "6 И ГОСПОД Бог определи едно растение, което се издигна над Йона, за да бъде сянка над главата му и да го избави от раздразнението му. И Йона се зарадва твърде много за растението."},
	{7, "7 Но Бог определи един червей на зазоряване на следващия ден, и той изгриза растението и то изсъхна."},
	{8, "8 И когато изгря слънцето, Бог определи горещ източен вятър и слънцето хапеше главата на Йона, и той изнемогваше и поиска за себе си да умре, и каза: По-добре е да умра, отколкото да живея!"},
	{9, "9 А Бог каза на Йона: Добро ли е да се сърдиш за растението? И той каза: Добро е да се сърдя, даже до смърт."},
	{10, "10 И ГОСПОД каза: Ти пожали растението, за което нито си се трудил, нито си го отгледал, което се роди за една нощ и за една нощ загина."},
	{11, "11 А Аз не трябваше ли да пожаля Ниневия, големия град, в който има повече от сто и двадесет хиляди души, които не могат да различават десницата си от левицата си, и много добитък?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};