#include <map>
#include <string>
class Bible48
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
	struct bg5	{ int val; const char *msg; };
	struct bg6	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Павел, апостол не от хора, нито чрез човек, а чрез Иисус Христос и Бог Отец, който Го е възкресил от мъртвите,"},
	{2, "2 и всичките братя, които са с мен, към църквите в Галатия:"},
	{3, "3 Благодат и мир да бъде на вас от Бог Отец и от нашия Господ Иисус Христос,"},
	{4, "4 който даде Себе Си за нашите грехове, за да ни избави от настоящия свят на злото според волята на нашия Бог и Отец,"},
	{5, "5 на когото да бъде славата за вечни векове. Амин."},
	{6, "6 Чудя се как вие така бързо се отвръщате от Онзи, който ви призова чрез Христовата благодат, и преминавате към друго благовестие,"},
	{7, "7 което не е друго благовестие, а е дело на неколцината, които ви смущават и искат да изопачат Христовото благовестие."},
	{8, "8 Но ако и самите ние или ангел от небето ви проповядва друго благовестие освен онова, което ви проповядвахме, нека бъде проклет."},
	{9, "9 Както казахме и преди, така го казвам и сега пак: ако някой ви проповядва друго благовестие освен онова, което приехте, нека бъде проклет."},
	{10, "10 Защото от хора ли сега търся благоволение, или от Бога? Или на хора ли искам да угаждам? Ако бях още угаждал на хора, нямаше да съм слуга на Христос."},
	{11, "11 Но аз ви известявам, братя, че евангелието, което ви благовестих, не е човешко;"},
	{12, "12 понеже аз нито съм го приел от човек, нито съм го научил от човек, а чрез откровение от Иисус Христос."},
	{13, "13 Защото сте чули за моето някогашно поведение, когато бях в юдейската религия – как прекомерно гонех Божията църква и я разорявах;"},
	{14, "14 и напредвах в юдейската религия повече от мнозина свои връстници между съотечествениците си, като бях много по-ревностен към преданията на предците си."},
	{15, "15 А когато Бог, който още от утробата на майка ми ме беше отделил и призовал чрез Своята благодат,"},
	{16, "16 благоволи да открие в мен Сина Си, за да Го проповядвам между езичниците, аз не се допитах до плът и кръв,"},
	{17, "17 нито се изкачих в Ерусалим при тези, които бяха апостоли преди мен, а веднага заминах за Арабия и пак се върнах в Дамаск."},
	{18, "18 По-късно, след три години, се изкачих в Ерусалим, за да се запозная с Кифа, и останах при него петнадесет дни;"},
	{19, "19 но друг от апостолите не видях освен Яков, брата на Господа."},
	{20, "20 А за това, което ви пиша, ето, пред Бога ви уверявам, че не лъжа."},
	{21, "21 После дойдох в областите на Сирия и Киликия,"},
	{22, "22 но още не бях познат лично на Христовите църкви в Юдея,"},
	{23, "23 а те само бяха слушали, че онзи, който едно време ги е гонил, сега проповядва вярата, която някога е разорявал,"},
	{24, "24 и славеха Бога заради мен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 Тогава, след четиринадесет години, пак се изкачих в Ерусалим с Варнава, като взех със себе си и Тит."},
	{2, "2 Но се изкачих по откровение и изложих пред тях благовестието, което проповядвам между езичниците, но насаме пред по-именитите от тях, да не би да тичам или да съм тичал напразно."},
	{3, "3 Но даже Тит, който беше с мен, макар и да беше грък, не беше принуден да се обреже;"},
	{4, "4 и то поради промъкналите се лъжебратя, които се бяха вмъкнали, за да дебнат свободата, която имаме в Христос Иисус, като искаха да ни поробят,"},
	{5, "5 на които ние нито за час не отстъпихме да им се покорим, за да остане с вас истината на благовестието."},
	{6, "6 А тези, които бяха считани за нещо – каквито и да са били, за мен е все едно, Бог не гледа на лицето на човека – тези, видните, не прибавиха нищо повече към моето учение;"},
	{7, "7 а напротив, когато видяха, че на мен беше поверено да проповядвам благовестието между необрязаните, както на Петър между обрязаните –"},
	{8, "8 защото Този, който подейства в Петър за апостолство между обрязаните, подейства и в мен за апостолство между езичниците –"},
	{9, "9 и когато познаха дадената на мен благодат, Яков, Кифа и Йоан, които се считаха за стълбове, дадоха на мен и на Варнава десница на общение, за да идем ние между езичниците, а те – между обрязаните."},
	{10, "10 Искаха само да помним бедните – същото нещо, което и аз бях ревностен да върша."},
	{11, "11 Но когато Кифа дойде в Антиохия, аз му се противопоставих в очи, защото беше виновен."},
	{12, "12 Понеже, преди да дойдат някои от Яков, той ядеше заедно с езичниците, а когато те дойдоха, той се оттегли и странеше от тях, защото се боеше от обрязаните."},
	{13, "13 И заедно с него лицемереха и другите юдеи, така че и Варнава се увлече от лицемерието им."},
	{14, "14 Но като видях, че не постъпват правилно според истината на благовестието, казах на Кифа пред всички: Ако ти, който си юдеин, живееш като езичниците, а не като юдеите, защо принуждаваш езичниците да живеят като юдеите?"},
	{15, "15 Ние, които по природа сме юдеи, а не грешници от езичниците,"},
	{16, "16 като знаем, че човек не се оправдава чрез дела по закона, а само чрез вяра в Иисус Христос, ние също повярвахме в Христос Иисус, за да се оправдаем чрез вяра в Христос, а не чрез дела по закона; защото чрез дела по закона няма да се оправдае нито едно същество."},
	{17, "17 Но ако ние самите, търсейки да се оправдаем чрез Христос, пак сме били намерени грешници, тогава Христос на греха ли е служител? Да не бъде!"},
	{18, "18 Защото, ако изградя отново онова, което съм разрушил, правя себе си престъпник."},
	{19, "19 Защото аз чрез закона умрях спрямо закона, за да живея за Бога."},
	{20, "20 Съразпънат съм с Христос; и вече не аз живея, а Христос живее в мен; и животът, който сега живея в плътта, го живея с вярата в Божия Син, който ме възлюби и предаде Себе Си заради мен."},
	{21, "21 Аз не отхвърлям Божията благодат: защото, ако оправданието се придобива чрез закона, тогава Христос е умрял напразно."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 О, неразумни галатяни, кой ви омая така – вас, пред чиито очи Иисус Христос е бил ясно очертан като разпънат?"},
	{2, "2 Това само желая да науча от вас: чрез дела изисквани от закона ли получихте Духа, или чрез слушане с вяра?"},
	{3, "3 Толкова ли сте неразумни, че след като започнахте в Духа, сега се усъвършенствате в плътта?"},
	{4, "4 Напразно ли страдахте толкова? Ако наистина е напразно!"},
	{5, "5 Тогава Този, който ви дава Духа и върши чудеса между вас, чрез дела изисквани от закона ли върши това, или чрез вяра в посланието? —"},
	{6, "6 както Авраам повярва в Бога и това му се счете за правда."},
	{7, "7 Тогава знайте, че тези, които са от вяра, те са Авраамови синове."},
	{8, "8 И Писанието, като предвидя, че Бог щеше да оправдае езичниците чрез вяра, предварително изяви благовестието на Авраам, казвайки: ?В теб ще се благославят всичките народи.“"},
	{9, "9 Така че тези, които са от вяра, се благославят заедно с вярващия Авраам."},
	{10, "10 Защото всички, които се облягат на дела изисквани от закона, са под проклятие, понеже е писано: ?Проклет всеки, който не постоянства да изпълнява всичко писано в книгата на закона.“"},
	{11, "11 А че никой не се оправдава пред Бога чрез закона, е явно, защото ?праведният чрез вяра ще живее.“"},
	{12, "12 А законът не действа чрез вяра, а казва: ?Който върши това, което заповядва законът, ще живее чрез него.“"},
	{13, "13 Христос ни изкупи от проклятието на закона, като стана проклет за нас; защото е писано: ?Проклет всеки, който виси на дърво“;"},
	{14, "14 така че благословението дадено на Авраам да дойде чрез Христос Иисус на езичниците, за да приемем обещанието на Духа чрез вяра."},
	{15, "15 Братя – по човешки говоря – ако едно завещание е потвърдено, дори и да е само човешко, никой не може да го развали, нито да му прибави нещо."},
	{16, "16 А обещанията се изрекоха на Авраам и на неговия потомък. Не казва: ?и на потомците“, като за мнозина, а като за един: ?и на твоя потомък“, който е Христос."},
	{17, "17 И това казвам, че завет, предварително потвърден от Бога, не може да бъде развален от закона, появил се четиристотин и тридесет години по-късно, така че обещанието да бъде унищожено."},
	{18, "18 Защото, ако наследството е по закона, то вече не е по обещание; а Бог го подари на Авраам чрез обещание."},
	{19, "19 Тогава защо се даде законът? Прибави се, за да се изявят престъпленията, докато дойде Потомъкът, на когото беше дадено обещанието; и беше постановен от ангели чрез ръката на един посредник."},
	{20, "20 Но посредникът не е за един, а Бог е един."},
	{21, "21 Тогава законът против Божиите обещания ли е? Да не бъде! Защото, ако беше даден закон, който да можеше да оживотворява, то наистина правдата щеше да бъде от закон."},
	{22, "22 Но Писанието затвори всичко под грях, така че обещанието чрез вяра в Иисус Христос да се даде на тези, които вярват."},
	{23, "23 А преди да дойде вярата, ние бяхме под стражата на закона, затворени до времето на вярата, която щеше да се открие."},
	{24, "24 Така че законът стана за нас възпитател, за да ни доведе до Христос, за да се оправдаем чрез вяра."},
	{25, "25 Но след идването на вярата не сме вече под ръководството на възпитател."},
	{26, "26 Защото всички сте Божии синове чрез вяра в Иисус Христос,"},
	{27, "27 понеже всички вие, които сте се кръстили в Христос, с Христос сте се облекли."},
	{28, "28 Няма вече юдеин, нито грък, няма роб, нито свободен, няма мъж, нито жена, защото вие всички сте едно в Христос Иисус."},
	{29, "29 И ако сте Христови, то вие сте Авраамово потомство и наследници по обещание."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 Казвам още: дотогава, докогато наследникът е малолетен, той не се различава в нищо от роб, макар и да е господар на всичко,"},
	{2, "2 а е под настойници и управители до назначения от бащата срок."},
	{3, "3 Така и ние, когато бяхме малолетни, бяхме поробени под първоначалните неща на света;"},
	{4, "4 но когато се изпълни времето, Бог изпрати Сина Си, който се роди от жена, роди се и под закона,"},
	{5, "5 за да изкупи онези, които бяха под закона, за да получим осиновението."},
	{6, "6 И понеже сте синове, Бог изпрати в сърцата ви Духа на Своя Син, който вика: Авва, Отче!"},
	{7, "7 Затова не си вече роб, а син; и ако си син, то си Божи наследник чрез Христос."},
	{8, "8 Но тогава, когато не познавахте Бога, вие робувахте на онези, които по природа не са богове;"},
	{9, "9 а сега, като познахте Бога, или по-скоро като бяхте познати от Бога, как се връщате отново назад към слабите и безпомощни първоначални неща, на които отново желаете да робувате?"},
	{10, "10 Вие наблюдавате дните, месеците, времената и годините."},
	{11, "11 Боя се за вас, да не би да съм се трудил сред вас напразно."},
	{12, "12 Моля ви, братя, бъдете като мен, защото и аз съм като вас. Не сте ми сторили никаква неправда."},
	{13, "13 Вие знаете как първия път ви проповядвах благовестието вследствие на телесна слабост;"},
	{14, "14 и вие не презряхте това, което беше изкушение за вас в плътта ми, и не се погнусихте от него, а ме приехте като Божи ангел, като Христос Иисус."},
	{15, "15 Тогава къде е онази ваша благословеност? Защото свидетелствам за вас, че ако беше възможно, очите си бихте извадили и бихте ми ги дали."},
	{16, "16 И така, неприятел ли ви станах, понеже ви говоря истината?"},
	{17, "17 Тези учители са ревностни за вас, но не по добър начин — те желаят да ви отлъчат от нас, за да сте ревностни за тях."},
	{18, "18 Но добре е да сте ревностни за това, което е добро, и то винаги, а не само когато аз се намирам между вас."},
	{19, "19 Дечица мои, за които пак съм в родилни мъки, докато се изобрази Христос във вас,"},
	{20, "20 желал бих да съм сега при вас и да променя тона си, защото съм в недоумение за вас."},
	{21, "21 Кажете ми вие, които желаете да бъдете под закона, не чувате ли какво казва законът?"},
	{22, "22 Защото е писано, че Авраам имаше двама сина – един от слугинята и един от свободната;"},
	{23, "23 но този, който беше от слугинята, се роди по плът, а онзи, който беше от свободната – по обещание."},
	{24, "24 И това има образен смисъл, защото тези жени представляват два завета – единият от Синайската планина, който ражда деца за робство, и това е Агар;"},
	{25, "25 и тази Агар представлява планината Синай в Арабия и съответства на днешния Ерусалим, защото е в робство с децата си;"},
	{26, "26 а горният Ерусалим е свободен, който е майка на (всички) нас."},
	{27, "27 Защото е писано: ?Весели се, неплодна, която не раждаш; възгласи и извикай, ти, която не си била в родилни болки; защото повече са децата на самотната, отколкото децата на омъжената.“"},
	{28, "28 Но ние, братя, сме като Исаак деца по обещание."},
	{29, "29 Но както тогава роденият по плът гонеше родения по Дух, така е и сега."},
	{30, "30 Обаче какво казва Писанието? ?Изпъдй слугинята и сина й, защото синът на слугинята няма да наследи със сина на свободната.“"},
	{31, "31 И така, братя, ние не сме деца на слугинята, а на свободната."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct bg5 poems[] = {
	{1, "1 И така, стойте твърдо в свободата, за която Христос ни освободи, и не се заплитайте отново в робско иго."},
	{2, "2 Ето, аз, Павел, ви казвам, че ако се обрязвате, Христос никак няма да ви ползва."},
	{3, "3 Да! Повторно заявявам на всеки човек, който се обрязва, че е длъжен да изпълни целия закон."},
	{4, "4 Вие, които искате да се оправдаете чрез закона, сте се отлъчили от Христос, отпаднали сте от благодатта."},
	{5, "5 Защото ние чрез Духа очакваме изпълнението на надеждата за правдата чрез вяра."},
	{6, "6 Понеже в Христос Иисус нито обрязването има някаква сила, нито необрязването, а вярата, която действа чрез любовта."},
	{7, "7 Вие вървяхте добре; кой ви попречи, че да не бъдете послушни на истината?"},
	{8, "8 Това убеждение не е от Онзи, който ви призовава."},
	{9, "9 Малко квас заквасва цялото тесто."},
	{10, "10 Аз ви имам доверие в Господа, че няма да помислите другояче; а който ви смущава, той ще понесе своята присъда, който и да бил той."},
	{11, "11 И аз, братя, ако продължавах да проповядвам обрязване, защо да бъда гонен? Защото тогава спънката на кръста би се махнала."},
	{12, "12 Дано се отсечеха онези, които ви разколебават!"},
	{13, "13 Защото вие, братя, на свобода бяхте призовани; само че не използвайте свободата си като повод за угаждане на плътта, а си служете един на друг с любов."},
	{14, "14 Защото целият закон се изпълнява в една дума, в тази: ?Да любиш ближния си както себе си.“"},
	{15, "15 Но ако се хапете и се ядете един друг, пазете се да не би един друг да се изядете."},
	{16, "16 И така, казвам: ходете по Духа, и няма да угаждате на плътските страсти."},
	{17, "17 Защото плътта силно желае противното на Духа, а Духът – противното на плътта; понеже те се противят едно на друго, за да не правите това, което искате."},
	{18, "18 Но ако се водите от Духа, не сте под закон."},
	{19, "19 А делата на плътта са явни. Те са: блудство, нечистота, разпътство,"},
	{20, "20 идолопоклонство, чародейство, вражди, разпри, ревнувания, ярости, партизанства, раздори, разцепления,"},
	{21, "21 зависти, пиянства, пирувания и други подобни; за които ви предупреждавам, както ви и предупредих, че които вършат такива работи, няма да наследят Божието царство."},
	{22, "22 А плодът на Духа е: любов, радост, мир, дълготърпение, благост, милост, вярност,"},
	{23, "23 кротост, себеобуздание; против такива няма закон."},
	{24, "24 А които са Иисус Христови, са разпънали плътта заедно със страстите и пожеланията й."},
	{25, "25 Ако по Духа живеем, по Духа и да ходим."},
	{26, "26 Да не ставаме тщеславни, да не се дразним един друг и да не си завиждаме един на друг."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct bg6 poems[] = {
	{1, "1 Братя, и ако човек падне в някое прегрешение, вие, духовните, поправяйте такъв с кротък дух. Но казвам: пази себе си, да не би и ти да бъдеш изкушен."},
	{2, "2 Носете си товара един на друг и така ще изпълните Христовия закон."},
	{3, "3 Защото, ако някой мисли себе си за нещо, а не е нищо, той мами себе си."},
	{4, "4 Но нека всеки изпитва своята работа, и тогава ще може да се хвали само със себе си, а не с другиго;"},
	{5, "5 защото всеки ще носи своя си товар."},
	{6, "6 А този, който се поучава в Божието слово, нека прави участник във всичките си блага онзи, който го учи."},
	{7, "7 Не се лъжете, Бог не е за подиграване! Понеже, каквото посее човек, това и ще пожъне."},
	{8, "8 Защото, който сее за плътта си, от плътта си ще пожъне тление, а който сее за Духа, от Духа ще пожъне вечен живот."},
	{9, "9 Нека не ни дотяга да вършим добро, защото, ако не се уморяваме, своевременно ще пожънем."},
	{10, "10 И така, като имаме случай, нека правим добро на всички, а най-вече – на своите по вяра."},
	{11, "11 Вижте с колко едри букви ви писах със собствената си ръка!"},
	{12, "12 Онези, които желаят да се представят добре по плът, те ви заставят да се обрязвате, само за да не бъдат гонени за Христовия кръст."},
	{13, "13 Защото и самите тези, които са обрязани, не пазят закона, а желаят да се обрязвате вие, за да могат да се хвалят с вашата плът."},
	{14, "14 А далеч от мен да се хваля с друго освен с кръста на нашия Господ Иисус Христос, чрез който светът за мен е разпънат, и аз – за света."},
	{15, "15 Защото в Христос Иисус нито обрязването е нещо, нито необрязването, а новото създание."},
	{16, "16 И на всички, които живеят по това правило, мир и милост да бъде на тях и на Божия Израил."},
	{17, "17 Отсега нататък никой да не ми досажда, защото аз нося на тялото си белезите на (Господ) Иисус."},
	{18, "18 Братя, благодатта на нашия Господ Иисус Христос да бъде с вашия дух. Амин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};