#include <map>
#include <string>
class Bible17
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
	struct bg5	{ int val; const char *msg; };
	struct bg6	{ int val; const char *msg; };
	struct bg7	{ int val; const char *msg; };
	struct bg8	{ int val; const char *msg; };
	struct bg9	{ int val; const char *msg; };
	struct bg10	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 А в дните на Асуир — онзи Асуир, който царуваше от Индия чак до Етиопия над сто двадесет и седем области —"},
	{2, "2 в онези дни, когато цар Асуир беше седнал на царския си престол в крепостта Суса,"},
	{3, "3 в третата година от царуването си, той направи угощение на всичките си началници и на слугите си, и пред него бяха военачалниците на Персия и Мидия, благородните и князете на областите,"},
	{4, "4 и за дълго време, сто и осемдесет дни, показваше славното богатство на царството си и превъзходния блясък на величието си."},
	{5, "5 И когато тези дни се изпълниха, царят направи седемдневно угощение на целия народ, който се намери в крепостта Суса, от голям до малък, в двора на градината на царския дворец,"},
	{6, "6 който беше украсен със завеси от бял и син памук, окачени с шнурове от висон и пурпур със сребърни колелца на колони от бял мрамор, и със златни и сребърни канапета върху мозаечна настилка от порфир и от бял мрамор, от алабастър и от черен мрамор."},
	{7, "7 И им наливаха в златни чаши, като всички чаши бяха различни, и имаше изобилно царско вино, както подобаваше на царя."},
	{8, "8 А пиенето ставаше според заповедта никой да не принуждава никого, защото царят беше заповядал така на всичките настойници на дома си, да постъпват според волята на всекиго."},
	{9, "9 А и царица Астин направи на жените угощение в царската къща на цар Асуир."},
	{10, "10 И на седмия ден, когато ??ърцето на царя се беше развеселило от ви??ото, той заповяда на Меунам, Визата, Арвона, Вигта и Авагта, Зетар и Харкас, седемте скопци, които слугуваха пред цар Асуир,"},
	{11, "11 да доведат пред царя царица Астин с царската корона, за да покаже красотата й на народите и на началниците; защото тя беше красива на глед."},
	{12, "12 Но царица Астин отказа да дойде по заповедта на царя, предадена чрез скопците; затова царят много се разгневи и яростта му пламна в него."},
	{13, "13 И царят каза на мъдреците, които познаваха времената — защото така се разглеждаха делата на царя, пред всички, които знаеха закон и съд —"},
	{14, "14 а приближените му бяха Карсена, Сетар, Адмата, Тарсис, Мерес, Марсена и Мемукан, седемте князе на Персия и Мидия, които гледаха лицето на царя и заемаха първо място в царството:"},
	{15, "15 Какво трябва да се направи според закона на царица Астин за това, че не изпълни заповедта на цар Асуир, предадена чрез скопците?"},
	{16, "16 Тогава Мемукан говори пред царя и първенците: Царица Астин е обидила не само царя, но и всичките князе и всичките народи, които са по всичките области на цар Асуир."},
	{17, "17 Защото постъпката на царицата ще се разчуе между всичките жени и ще направи мъжете им презрени пред очите им, понеже ще кажат: Цар Асуир заповядал да се доведе пред него царица Астин, а тя не дошла!"},
	{18, "18 И в този ден княгините на Персия и Мидия, които са чули за постъпката на царицата, ще говорят така на всичките царски началници; и от това ще произлезе голямо презрение и гняв."},
	{19, "19 Ако е угодно на царя, нека се издаде от него царска заповед и нека се впише между персийските и мидийските закони, за да не се отменя, според която Астин да не идва вече пред цар Асуир; и царят да даде царското й достойнство на друга, по-добра от нея."},
	{20, "20 И когато заповедта, която царят ще издаде, се разчуе по цялото му царство — защото е голямо — всичките жени ще отдават почит на мъжете си, от голям до малък."},
	{21, "21 И това слово се хареса на царя и на началниците; и царят направи както каза Мемукан."},
	{22, "22 Той изпрати писма по всичките царски области, във всяка област според писмеността й и на всеки народ според езика му: всеки мъж да бъде господар в дома си и да говори на езика на народа си."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 След тези събития, когато се укроти яростта на цар Асуир, той си спомни за Астин и за онова, което беше сторила, и какво беше решено против нея."},
	{2, "2 Тогава слугите, които слугуваха на царя, казаха: Нека се потърсят за царя красиви млади девици."},
	{3, "3 И нека царят назначи чиновници по всичките области на царството си, които да съберат всички красиви млади девици в крепостта Суса, в женската къща, под надзора на царския скопец Игай, пазача на жените; и нека им се дадат необходимите средства за разкрасяване."},
	{4, "4 И девойката, която се хареса на царя, нека стане царица вместо Астин. И това се хареса на царя и той направи така."},
	{5, "5 А в крепостта Суса имаше един юдеин на име Мардохей, син на Яир, син на Семей, син на Кис, вениаминец,"},
	{6, "6 който беше отведен в плен от Ерусалим с пленниците, които бяха отведени в плен с юдовия цар Йехония, които вавилонският цар Навуходоносор беше отвел в плен."},
	{7, "7 И той беше настойник на Адаса, която е Естир, дъщерята на чичо си, защото тя нямаше нито баща, нито майка. Момичето беше стройно и красиво; и когато баща му и майка му умряха, Мардохей го взе за своя дъщеря."},
	{8, "8 И така, когато се разчу заповедта и разпоредбата на царя и когато бяха събрани много момичета в крепостта Суса под надзора на Игай, доведоха и Естир в царската къща, под надзора на Игай, пазача на жените."},
	{9, "9 И момичето му се хареса и придоби благоволението му; и той побърза да й даде от царската къща средствата й за разкрасяване, както и дяловете й, даде й също и седемте най-отбрани момичета от царския дворец и я премести с момичетата й в най-доброто помещение на женската къща."},
	{10, "10 Естир не беше открила народа си и рода си, защото Мардохей й беше поръчал да не го открива."},
	{11, "11 И Мардохей ходеше всеки ден пред двора на женската къща, за да научава как е Естир и какво става с нея."},
	{12, "12 А когато дойдеше редът на всяка девойка да дойде при цар Асуир, след като беше стояла дванадесет месеца в женската къща според нареденото за жените — защото така се изпълваше времето за разкрасяването им: шест месеца се мажеха със смирнено масло, и шест месеца с аромати и с други средства за разкрасяване на жените —"},
	{13, "13 тогава девойката влизаше така при царя и всичко, което поискаше, й се даваше да го занесе със себе си от женската къща в къщата на царя."},
	{14, "14 Вечер влизаше, а сутрин се връщаше във втората женска къща под надзора на Саасгаз, царския скопец, който пазеше наложниците; тя не влизаше вече при царя освен ако царят я поискаше и бъдеше повикана по име."},
	{15, "15 А когато дойде редът да влезе при царя Естир, дъщерята на Авихаил, чичото на Мардохей, която той беше взел за своя дъщеря, тя не поиска друго освен каквото й каза царският скопец Игай, пазачът на жените. И Естир придобиваше благоволението на всички, които я видеха."},
	{16, "16 И Естир беше заведена при цар Асуир в царската му къща в десетия месец, който е месец Тавет, в седмата година от царуването му."},
	{17, "17 И царят обикна Естир повече от всичките жени и тя придоби неговото благоволение и милост повече от всичките девици. И той сложи царската корона на главата й и я направи царица вместо Астин."},
	{18, "18 Тогава царят направи голямо угощение на всичките си началници и на слугите си, угощение в чест на Естир; и направи облекчение на областите и даде подаръци, както подобаваше на царя."},
	{19, "19 И когато за втори път се събираха девици, Мардохей седеше в царската порта."},
	{20, "20 Естир не бе открила рода си и народа си, както й беше поръчал Мардохей; и Естир изпълняваше заповедта на Мардохей, както когато беше под неговото настойничество."},
	{21, "21 В тези дни, когато Мардохей седеше в царската порта, Вихтан и Терес, двама царски скопци, от онези които пазеха входа, се разгневиха и поискаха да вдигнат ръка срещу цар Асуир."},
	{22, "22 И това стана известно на Мардохей и той го съобщи на царица Естир, а Естир каза на царя от името на Мардохей."},
	{23, "23 И работата се разследва и се намери, че беше истина, и двамата бяха обесени на дърво; и това се записа в книгата на летописите пред царя."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 След тези събития цар Асуир повиши агагеца Аман, сина на Амидата, издигна го и постави стола му над столовете на всичките началници, които бяха около него."},
	{2, "2 И всички царски слуги, които бяха в царската порта, коленичеха и се кланяха на Аман, защото царят беше заповядал така за него. Но Мардохей не коленичеше и не му се кланяше."},
	{3, "3 Затова царските слуги, които бяха в царската порта, казаха на Мардохей: Ти защо престъпваш заповедта на царя?"},
	{4, "4 И като му говореха ден след ден, а той не ги слушаше, съобщиха на Аман, за да видят дали думите на Мардохей ще устоят, тъй като им беше открил, че е юдеин."},
	{5, "5 И когато Аман видя, че Мардохей не коленичеше и не му се кланяше, Аман се изпълни с ярост."},
	{6, "6 Но му се виждаше нищожно да сложи ръка само на Мардохей, защото му бяха казали от кой народ беше Мардохей; затова Аман поиска да изтреби народа на Мардохей, всичките юдеи, които бяха в цялото царство на Асуир."},
	{7, "7 В първия месец, който е месец Нисан, в дванадесетата година на цар Асуир, хвърлиха пур, което е жребий, пред Аман последователно за всеки ден от всеки месец до дванадесетия месец, който е месец Адар."},
	{8, "8 И Аман каза на цар Асуир: Има един народ, пръснат и разсеян между народите по всичките области на твоето царство; и законите им се различават от тези на всеки друг народ и те не изпълняват законите на царя; и не е добре за царя да ги търпи."},
	{9, "9 Ако е угодно на царя, нека се напише заповед да се унищожат; и аз ще броя десет хиляди таланта сребро в ръцете на настоятелите, за да го внесат в царските съкровищници."},
	{10, "10 Тогава царят извади пръстена си от ръката си и го даде на агагеца Аман, сина на Амидата, притеснителя на юдеите."},
	{11, "11 И царят каза на Аман: Дава ти се среброто, а също и този народ, да направиш с него както ти се вижда добре."},
	{12, "12 Тогава, на тринадесетия ден от първия месец, повикаха царските писари и се писа точно според това, което заповяда Аман, на царските сатрапи и на областните управители на всяка област, и на началниците на всеки народ; на всяка област според писмеността й и на всеки народ според езика му; писа се в името на цар Асуир и се подпечата с царския пръстен."},
	{13, "13 И писмата се изпратиха с бързоходци по всичките царски области, за да се изтребят, избият и унищожат всичките юдеи, от момче до старец, и деца и жени, в един ден, тринадесетия от дванадесетия месец, който е месец Адар, и да разграбят имота им."},
	{14, "14 И за да се издаде заповедта във всяка област, преписът от писмото се оповести между всичките народи, за да бъдат готови за онзи ден."},
	{15, "15 Бързоходците излязоха и бързаха според царската заповед. Разпоредбата се издаде в крепостта Суса. И царят и Аман седнаха да пируват, а градът Суса се смути."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 И когато Мардохей научи всичко, което беше станало, той раздра дрехите си, облече се във вретище с пепел и излезе сред града, и завика силно и горчиво."},
	{2, "2 И дойде пред царската порта, защото никой, облечен във вретище, не можеше да влезе вътре в царската порта."},
	{3, "3 И във всяка област, където стигна заповедта на царя и разпоредбата му, настана голяма скръб между юдеите и пост, и плач, и ридание; и мнозина имаха под себе си вретище и пепел."},
	{4, "4 И момичетата на Естир и скопците й дойдоха и й съобщиха това; и царицата много се уплаши. И изпрати дрехи, за да облекат Мардохей и да свалят вретището от него, но той не прие."},
	{5, "5 Тогава Естир повика Атах, един от скопците на царя, когото той беше определил да й слугува, и му поръча да отиде при Мардохей да разбере какво е това и защо е."},
	{6, "6 И Атах излезе при Мардохей на градския площад, който беше пред царската порта."},
	{7, "7 И Мардохей му съобщи всичко, което му се беше случило, и количеството на среброто, което Аман беше обещал да внесе в царските съкровищници за юдеите, за да ги унищожи."},
	{8, "8 Даде му и препис от писаната заповед, която беше издадена в Суса за погубването им, за да го покаже на Естир и да й извести, и да й поръча да влезе при царя, за да му се помоли за милост и да го умолява за народа си."},
	{9, "9 И Атах дойде и съобщи на Естир думите на Мардохей."},
	{10, "10 И Естир говори на Атах и му поръча да каже на Мардохей:"},
	{11, "11 Всички царски слуги и народът от царските области знаят, че за всекиго, мъж или жена, който влезе при царя във вътрешния двор, без да е повикан, има един закон — да се умъртви, освен ако царят простре към него златния скиптър, за да остане жив. А аз вече тридесет дни не съм викана да вляза при царя."},
	{12, "12 И съобщиха на Мардохей думите на Естир."},
	{13, "13 Тогава Мардохей каза да отговорят на Естир: Не мисли в себе си, че от всичките юдеи само ти ще се избавиш в царския дом!"},
	{14, "14 Защото ако наистина си замълчиш в това време, от другаде ще дойде помощ и избавление на юдеите, но ти и бащиният ти дом ще погинете. А кой знае дали ти не си се издигнала до царско достойнство за време като това?"},
	{15, "15 Тогава Естир каза да отговорят на Мардохей:"},
	{16, "16 Иди, събери всичките юдеи, които се намират в Суса, и постете за мен! Не яжте и не пийте три дни, нощем и денем; и аз и момичетата ми ще постим също така. И после ще вляза при царя, което не е според закона, и ако загина, нека загина!"},
	{17, "17 И Мардохей отиде и извърши всичко, което му беше заповядала Естир."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct bg5 poems[] = {
	{1, "1 И на третия ден Естир се облече в царските си одежди и застана във вътрешния двор на царската къща, срещу царската къща. А царят седеше на царския си престол в царската къща, срещу входа на къщата."},
	{2, "2 И когато царят видя царица Естир да стои в двора, тя придоби благоволението му и царят простря към Естир златния скиптър, който беше в ръката му. И Естир се приближи и докосна края на скиптъра."},
	{3, "3 И царят й каза: Какво ти е, царице Естир? И какво е желанието ти? И до половината от царството ще ти се даде!"},
	{4, "4 А Естир каза: Ако е угодно на царя, нека царят дойде днес с Аман на угощението, което съм му приготвила."},
	{5, "5 И царят каза: Повикайте бързо Аман, за да направим, както каза Естир! И царят и Аман дойдоха на угощението, което Естир беше приготвила."},
	{6, "6 И като пиеха вино на угощението, царят каза на Естир: Каква е молбата ти? Ще ти се удовлетвори. И какво е желанието ти? И до половината от царството — ще се изпълни!"},
	{7, "7 Тогава Естир в отговор каза: Молбата ми и желанието ми е това:"},
	{8, "8 Ако съм придобила благоволението на царя и ако е угодно на царя да удовлетвори молбата ми и да изпълни желанието ми, нека царят дойде с Аман на угощението, което ще приготвя за тях; и утре ще направя според думата на царя."},
	{9, "9 И в този ден Аман излезе радостен и с весело сърце. Но когато Аман видя Мардохей в царската порта, че не стана, нито се помръдна пред него, Аман се изпълни с ярост против Мардохей."},
	{10, "10 Но Аман се въздържа и отиде у дома си. И прати да повикат приятелите му и жена му Зереса,"},
	{11, "11 и Аман им разказа за славата на богатството си и за многото си синове, и всичко, как царят го бе повишил и го беше издигнал над началниците и царските слуги."},
	{12, "12 И Аман каза: Даже и царица Естир не покани никого другиго с царя на угощението, което приготви, а само мен; и утре също съм поканен с царя у нея."},
	{13, "13 Но всичко това не ме задоволява, докато гледам юдеина Мардохей да седи в царската порта!"},
	{14, "14 Тогава жена му Зереса и всичките му приятели казаха: Нека се приготви една бесилка, петдесет лакътя висока, и утре кажи на царя да бъде обесен Мардохей на нея. И тогава иди радостен с царя на угощението. И думата се хареса на Аман и той заповяда да се приготви бесилката."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct bg6 poems[] = {
	{1, "1 През онази нощ сънят побягна от царя. И той заповяда да донесат книгата на паметните събития, на летописите; и те се прочетоха пред царя."},
	{2, "2 И се намери, че Мардохей беше съобщил за Вихтан и Терес, двамата царски скопци, от онези, които пазеха входа, че бяха поискали да вдигнат ръка против цар Асуир."},
	{3, "3 И царят каза: Каква почест и отличие е дадено на Мардохей за това? И слугите на царя, които му прислужваха, казаха: Нищо не е направено за него."},
	{4, "4 Тогава царят каза: Кой е в двора? А Аман беше дошъл във вътрешния двор на царската къща, за да каже на царя да се обеси Мардохей на бесилката, която беше приготвил за него."},
	{5, "5 И слугите на царя му казаха: Ето, Аман стои в двора. И царят каза: Да влезе!"},
	{6, "6 И Аман влезе и царят му каза: Какво да се направи на човека, когото царят благоволява да почете? Тогава Аман помисли в сърцето си: Кого другиго би благоволил царят да почете освен мен?"},
	{7, "7 И Аман каза на царя: За човека, когото царят благоволява да почете,"},
	{8, "8 нека донесат царска одежда, с която се облича царят, и кон, на който язди царят, на чиято глава се слага царска корона,"},
	{9, "9 и одеждата и конят да се дадат в ръката на един от най-видните царски началници. И нека облекат човека, когото царят благоволява да почете, и да го разведат възседнал на коня по градския площад и да викат пред него: Така ще се направи на човека, когото царят благоволява да почете!"},
	{10, "10 Тогава царят каза на Аман: Бързо вземи одеждата и коня, както каза, и направи така на юдеина Мардохей, който седи в царската порта! Да не пропуснеш нищо от всичко, което каза!"},
	{11, "11 И Аман взе одеждата и коня и облече Мардохей, и го разведе възседнал на коня по градския площад и викаше пред него: Така ще се направи на човека, когото царят благоволява да почете!"},
	{12, "12 После Мардохей се върна в царската порта. А Аман изтича у дома си наскърбен и с покрита глава."},
	{13, "13 И Аман разказа на жена си Зереса и на всичките си приятели всичко, което му се беше случило. Тогава съветниците му и жена му Зереса му казаха: Ако Мардохей, пред когото си започнал да падаш, е от рода на юдеите, няма да му надвиеш, а със сигурност ще паднеш пред него."},
	{14, "14 Докато още говореха с него, дойдоха царските скопци и бързо отведоха Аман на угощението, което Естир беше приготвила."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct bg7 poems[] = {
	{1, "1 И царят и Аман дойдоха да пируват при царица Естир."},
	{2, "2 И на втория ден, когато пиеха вино, царят пак каза на Естир: Каква е молбата ти, царице Естир? Ще ти се удовлетвори. И какво е желанието ти? И до половината от царството — ще се изпълни!"},
	{3, "3 Тогава царица Естир в отговор каза: Ако съм придобила твоето благоволение, царю, и ако е угодно на царя, нека ми се подари животът ми по молбата ми и народът ми по желанието ми —"},
	{4, "4 защото сме продадени, аз и народът ми, да бъдем изтребени, избити и унищожени. Ако бяхме продадени като роби и робини, бих премълчала, въпреки че притеснителят не би могъл да възстанови щетата на царя."},
	{5, "5 Тогава цар Асуир проговори и каза на царица Естир: Кой е този и къде е този, който е дръзнал в сърцето си да направи така?"},
	{6, "6 И Естир каза: Притеснителят и врагът е този зъл Аман! Тогава Аман се ужаси пред царя и царицата."},
	{7, "7 А в яростта си царят стана от пируването и отиде в градината на двореца. А Аман остана, за да изпроси живота си от царица Естир, защото видя, че злото против него беше решено от царя."},
	{8, "8 И когато царят се върна от градината на двореца на мястото на пируването, Аман беше паднал на канапето, на което беше Естир. И царят каза: Даже и царицата ли иска да изнасили пред мен у дома? Щом думата излезе от устата на царя, покриха лицето на Аман."},
	{9, "9 Тогава Арвона, един от скопците, които служеха пред царя, каза: Ето пред къщата на Аман и бесилката, петдесет лакътя висока, която Аман направи за Мардохей, който говори добро за царя. И царят каза: Обесете го на нея!"},
	{10, "10 И обесиха Аман на бесилката, която беше приготвил за Мардохей. И яростта на царя утихна."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct bg8 poems[] = {
	{1, "1 В същия ден цар Асуир даде на царица Естир дома на Аман, притеснителя на юдеите. И Мардохей дойде пред царя, защото Естир му беше открила какъв й е той."},
	{2, "2 И царят извади пръстена си, който беше взел от Аман, и го даде на Мардохей. А Естир постави Мардохей над дома на Аман."},
	{3, "3 И Естир говори отново пред царя и падна в краката му, и го моли със сълзи да отвърне злото на агагеца Аман и замисъла, който беше замислил против юдеите."},
	{4, "4 И царят простря към Естир златния скиптър. Тогава Естир се изправи и застана пред царя, и каза:"},
	{5, "5 Ако е угодно на царя и ако съм придобила неговото благоволение, и това се вижда право на царя, и ако съм му угодна, нека се напише да се отменят писмата, замисъла на агагеца Аман, сина на Амидата, които той писа, за да се унищожат юдеите, които са по всичките царски области,"},
	{6, "6 защото как бих могла да гледам злото, което ще сполети народа ми? И как бих могла да гледам унищожението на рода си?"},
	{7, "7 И цар Асуир каза на царица Естир и на юдеина Мардохей: Ето, дадох на Естир дома на Аман, а него обесиха на бесилката, защото вдигна ръката си против юдеите."},
	{8, "8 Сега вие пишете по отношение на юдеите, каквото ви се вижда добро, в името на царя, и го подпечатайте с царския пръстен, защото писмо, писано в името на царя и подпечатано с царския пръстен, не може да се отмени."},
	{9, "9 Тогава, в онова време, на двадесет и третия ден от третия месец, който е месец Сиван, повикаха царските писари и се писа точно според това, което заповяда Мардохей, на юдеите и на сатрапите, и на областните управители, и на началниците на областите, от Индия до Етиопия, сто двадесет и седем области; на всяка област според писмеността й и на всеки народ според езика му, и на юдеите според писмеността им и според езика им."},
	{10, "10 И Мардохей писа в името на цар Асуир и подпечата с царския пръстен, и изпрати писмата с бързоходци, конници, които яздеха на бързи коне, употребявани в царската служба, от отбрани кобили,"},
	{11, "11 писма, чрез които царят разрешаваше на юдеите, които са във всеки град, да се съберат и да защитят живота си, да изтребят, да избият и да унищожат всичките сили на онзи народ и на онази област, които биха ги нападнали, и децата и жените им, и да разграбят имота им;"},
	{12, "12 в един ден по всичките области на цар Асуир, на тринадесетия ден от дванадесетия месец, който е месец Адар."},
	{13, "13 И за да се издаде заповедта във всяка област, преписът от писмото се оповести между всичките народи, за да бъдат юдеите готови за онзи ден, за да отмъстят на враговете си."},
	{14, "14 Бързоходците, които яздеха на бързи коне, употребявани в царската служба, излязоха бързо, принудени от царската заповед. Разпоредбата се издаде в крепостта Суса."},
	{15, "15 А Мардохей излезе от присъствието на царя в царско облекло от син и бял памук и с голяма златна корона, и с наметало от висон и пурпур. А градът Суса ликуваше и се веселеше."},
	{16, "16 И юдеите имаха светлина и веселие, и радост, и почест."},
	{17, "17 И във всяка област и във всеки град, навсякъде, където стигна заповедта на царя и разпоредбата му, имаше веселие и радост за юдеите, пируване и празник. И мнозина от народите на земята станаха юдеи, защото ги обзе страх от юдеите."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct bg9 poems[] = {
	{1, "1 А на тринадесетия ден от дванадесетия месец, който е месец Адар, когато трябваше да се изпълни заповедта на царя и разпоредбата му, в деня когато враговете на юдеите се надяваха да вземат власт над тях, но стана обратното — че юдеите взеха власт над онези, които ги мразеха —"},
	{2, "2 юдеите се събраха в градовете си по всичките области на цар Асуир, за да сложат ръка на онези, които искаха злото им. И никой не можеше да им противостои, защото страх от тях беше обзел всичките народи."},
	{3, "3 И всичките началници на областите и сатрапите, и областните управители, и царските настоятели помагаха на юдеите, защото ги беше обзел страх от Мардохей."},
	{4, "4 Понеже Мардохей беше велик в царския дом и славата му се разнесе по всичките области, защото човекът Мардохей ставаше все по-велик и по-велик."},
	{5, "5 И юдеите нанесоха поражение на всичките си врагове с клане с меч, убиване и унищожение; и направиха каквото искаха на онези, които ги мразеха."},
	{6, "6 И в крепостта Суса юдеите избиха и погубиха петстотин мъже."},
	{7, "7 Убиха Фарсандата и Далфон, и Аспата,"},
	{8, "8 и Пората, и Адалия, и Аридата,"},
	{9, "9 и Фармаста, и Арисай, и Аридай, и Ваезета,"},
	{10, "10 десетте сина на притеснителя на юдеите Аман, сина на Амидата. Но на плячка не сложиха ръка."},
	{11, "11 В същия ден докладваха пред царя броя на убитите в крепостта Суса."},
	{12, "12 И царят каза на царица Естир: В крепостта Суса юдеите са избили и погубили петстотин мъже и десетте сина на Аман. А какво ли са направили и в другите царски области! Сега каква е молбата ти? Ще ти се удовлетвори. И какво е още желанието ти? Ще се изпълни!"},
	{13, "13 И Естир каза: Ако е угодно на царя, нека се разреши на юдеите, които са в Суса, да направят и утре според днешната заповед. И да обесят на дърво десетте сина на Аман."},
	{14, "14 Тогава царят заповяда да стане така. И заповедта се издаде в Суса, а десетте сина на Аман бяха обесени."},
	{15, "15 И юдеите, които бяха в Суса, се събраха и на четиринадесетия ден от месец Адар и избиха триста мъже в Суса. Но на плячка не сложиха ръка."},
	{16, "16 И останалите юдеи, които бяха по царските области, се събраха и защитиха живота си и се успокоиха от враговете си, и избиха седемдесет и пет хиляди души от онези, които ги мразеха. Но на плячка не сложиха ръка."},
	{17, "17 Това стана на тринадесетия ден от месец Адар; а на четиринадесетия му ден си почиваха и го направиха ден за пируване и веселие."},
	{18, "18 Но юдеите, които бяха в Суса, се събраха и на тринадесетия му ден, и на четиринадесетия му ден, а на петнадесетия му ден почиваха и го направиха ден за пируване и веселие."},
	{19, "19 Затова юдеите от селата, които живеят в неоградени градове, празнуват четиринадесетия ден от месец Адар с веселие и пируване и като празник и си изпращат подаръци едни на други."},
	{20, "20 И Мардохей записа тези събития и изпрати писма до всичките юдеи, които бяха по всичките области на цар Асуир, до близките и далечните,"},
	{21, "21 с които им определи да пазят четиринадесетия ден от месец Адар и петнадесетия му ден година след година,"},
	{22, "22 като дните, в които юдеите се успокоиха от враговете си, и месеца, в който скръбта им се обърна на радост и плачът им — на празник, да ги празнуват като дни за пируване и веселие и за пращане на подаръци едни на други, и за даване на милостиня на сиромасите."},
	{23, "23 И юдеите възприеха това, което бяха започнали да правят, и което Мардохей им беше писал."},
	{24, "24 Защото агагецът Аман, синът на Амидата, притеснителят на всичките юдеи, беше замислил против юдеите да ги унищожи и беше хвърлил пур, което е жребий, да ги изтреби и да ги унищожи,"},
	{25, "25 но когато Естир дойде пред царя, той заповяда с писмо да се върне върху неговата глава замисленото зло, което беше скроил против юдеите, и да се обесят на бесилката той и синовете му."},
	{26, "26 Затова нарекоха онези дни Пурим, от името пур. Затова, поради всичките думи на това писмо, както и поради това, което сами бяха видели от това, и което ги беше постигнало,"},
	{27, "27 юдеите постановиха и възприеха за себе си и за потомството си, и за всички, които биха се присъединили към тях, да не престанат никога да празнуват тези два дни според предписаното за тях и в определеното време всяка година;"},
	{28, "28 и тези дни да се помнят и да се празнуват във всяко поколение, във всеки род, във всяка област и във всеки град; и тези дни Пурим да не се изоставят от юдеите и да не изчезне споменът им между потомството им."},
	{29, "29 И царица Естир, дъщерята на Авихаил, и юдеинът Мардохей писаха с пълна власт, за да утвърдят това второ писмо за Пурим."},
	{30, "30 И Мардохей изпрати писма до всичките юдеи в сто двадесет и седемте области на царството на Асуир с думи на мир и истина,"},
	{31, "31 за да утвърди тези дни Пурим в определените им времена, както юдеинът Мардохей и царица Естир им бяха определили, и както и те си бяха определили за себе си и за потомството си с наредбата за постите и плача си."},
	{32, "32 И тази наредба за Пурим се утвърди със заповедта на Естир и се записа в книгата."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct bg10 poems[] = {
	{1, "1 И цар Асуир наложи данък на земята и на морските острови."},
	{2, "2 А всичките дела на силата и могъществото му и описанието на величието на Мардохей, до което царят го издигна, не са ли записани в Книгата на летописите на мидийските и персийските царе?"},
	{3, "3 Защото юдеинът Мардохей стана втори след цар Асуир, велик между юдеите и благоприятен на многото си братя. Той търсеше доброто на народа си и говореше за мир за целия си род."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};