#include <map>
#include <string>
class Bible34
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Пророчество, наложено за Ниневия. Книгата на видението на елкусеянина Наум."},
	{2, "2 ГОСПОД е Бог ревнив и отмъщава; отмъстител е ГОСПОД и изпълнен с ярост; ГОСПОД отмъщава на противниците Си и пази гняв за враговете Си."},
	{3, "3 ГОСПОД е дълготърпелив и велик в сила и никак няма да изкара невинен виновния. ГОСПОД — пътят Му е във вихрушка и буря и облаците са праха на краката Му."},
	{4, "4 Смъмря морето и го изсушава и пресушава всичките реки. Васан и Кармил повяхват и повяхва цветът на Ливан."},
	{5, "5 Планините треперят от Него и хълмовете се разтопяват, и земята се надига от присъствието Му и светът, и всичките му жители."},
	{6, "6 Пред негодуванието Му кой ще устои и кой ще застане пред пламналия Му гняв? Яростта Му се излива като огън и скалите се разпадат пред Него."},
	{7, "7 ГОСПОД е добър, Той е сила в ден на бедствие и познава тези, които се уповават на Него."},
	{8, "8 Но с помитащо наводнение ще изличи напълно мястото й и мрак ще преследва враговете Му."},
	{9, "9 Какво замисляте против ГОСПОДА? Той ще изличи напълно, бедствието няма да се надигне два пъти."},
	{10, "10 Защото и да са сплетени като тръни и пияни от питието си, ще бъдат напълно погълнати като суха слама."},
	{11, "11 От теб излезе един, който замисля зло против ГОСПОДА, негоден съветник."},
	{12, "12 Така казва ГОСПОД: Ако и да са в благополучието си и толкова многобройни, пак ще бъдат посечени, когато премине. Ако и да те унижих, вече няма да те унижавам."},
	{13, "13 Още сега ще строша ярема му от теб и ще разкъсам връзките ти."},
	{14, "14 Но за теб, Ниневия, ГОСПОД заповяда да не се посее вече потомство от името ти. От капището на боговете ти ще отсека изваяния и излян идол; ще ти приготвя гроб, защото не струваш нищо."},
	{15, "15 Ето на планините краката на онзи, който благовества, който прогласява мир! Празнувай, Юда, празниците си, изпълнявай обреците си, защото злият няма вече да мине през теб, той е напълно унищожен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 Разсипникът се изкачи против теб. Пази крепостта, бди за пътя, стегни слабините си, събери цялата си сила,"},
	{2, "2 понеже ГОСПОД възстановява величието на Яков както величието на Израил — защото грабителите ги ограбиха и съсипаха лозовите им пръчки."},
	{3, "3 Щитът на силните му е оцветен в червено, силните мъже са облечени в червеникаво, колесниците блестят от стомана в деня на приготовлението му и елховите копия се размахват."},
	{4, "4 Колесниците препускат из улиците, изпреварват се по площадите; видът им е като факли, стрелкат се като светкавици."},
	{5, "5 Той си спомня за своите благородни — те се препъват в пътя си, бързат към стената й и защитният покрив е приготвен."},
	{6, "6 Портите на реките се отварят и дворецът се разрушава."},
	{7, "7 Решено е — ще се оголи Ниневия, ще се плени. И слугините й стенат като с гласа на гълъбите и се бият по гърдите."},
	{8, "8 Ниневия отдавна е била пълна с мъже като езеро с вода, но те пак бягат. Стойте! Стойте! Но никой не се обръща назад."},
	{9, "9 Грабете сребро, грабете злато, защото запасът е безкраен, богатството на всякакви скъпоценни вещи."},
	{10, "10 Празнота и изпразване, и запустение! Сърцето се топи и колената се тресат, болки във всички слабини и лицата на всички са побледнели."},
	{11, "11 Къде е бърлогата на лъвовете и мястото, където се хранеха младите лъвове, където ходеше лъвът, лъвицата и малкото лъвче и нямаше кой да ги плаши?"},
	{12, "12 Къде е лъвът, който разкъсваше достатъчно за лъвчетата си и давеше за лъвиците си, и пълнеше пещерите си с плячка и бърлогите си — с грабеж?"},
	{13, "13 Ето, Аз съм против теб, заявява ГОСПОД на Войнствата. И ще изгоря в дим колесниците й, и мечът ще пояде младите ти лъвове; ще отсека плячката ти от земята и гласът на пратениците ти няма да се чуе вече."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 Горко на кръвопролитния град! Цял е пълен с лъжа и насилие, грабежът не престава!"},
	{2, "2 Плющене на бичове и шум от тропот на колела, тичащи коне и подскачащи колесници!"},
	{3, "3 Налитащи конници и бляскав меч, и святкащо копие! Множество убити и купища мъртви, и няма край на труповете — в труповете им се спъват!"},
	{4, "4 Това е заради многото блудства на привлекателната блудница, господарка на заклинания, която продава народи с блудствата си и племена — със заклинанията си."},
	{5, "5 Ето, Аз съм против теб, заявява ГОСПОД на Войнствата. Ще вдигна полите ти върху лицето ти и ще покажа на народите голотата ти и на царствата — срама ти."},
	{6, "6 Ще хвърля върху теб гнусотии и ще те направя презряна, и ще те изложа на показ."},
	{7, "7 И всички, които те гледат, ще бягат от теб и ще казват: Ниневия запустя! Кой ще й съчувства? Откъде да ти потърся утешители?"},
	{8, "8 Ти по-добра ли си от Но-Амон, който беше разположен на реките, обграден от води? Морето беше предстението му и от море беше стената му."},
	{9, "9 Етиопия беше силата му и Египет също — безгранична беше; Фут и ливийците бяха твои помощници."},
	{10, "10 Но и той беше откаран, отиде в плен и неговите малки деца бяха смазани по ъглите на всички улици. За почитаните му хвърлиха жребий и всичките му големци бяха вързани с вериги."},
	{11, "11 И ти ще се опиеш, ще бъдеш обгърната от нощ, ще потърсиш и ти защита от врага."},
	{12, "12 Всичките ти крепости са смокинови дървета с първозрели смокини — щом се разтърсят, падат в устата на ядящия."},
	{13, "13 Ето, народът ти е жени сред теб, портите на земята ти са широко отворени за враговете ти, огън пояжда резетата ти."},
	{14, "14 Извади си вода за обсадата, усили укрепленията си, влез в калта и стъпчи глината, поправи тухлената пещ."},
	{15, "15 Там ще те пояде огън, ще те посече меч, ще те изяде като скакалеца. Множи се като скакалеца, множи се като изедника!"},
	{16, "16 Умножила си търговците си повече от небесните звезди. Скакалецът опустоши и отлетя."},
	{17, "17 Твоите короновани са като скакалци и военачалниците ти — като ято скакалци, които кацат по оградите в студен ден — щом изгрее слънцето, избягват и мястото им не се знае. Къде са?"},
	{18, "18 Твоите пастири дремят, царю на Асирия, лежат благородните ти; народът ти се разпръсна по планините и няма кой да го събира."},
	{19, "19 Няма лек за язвата ти, раната ти е смъртоносна. Всички, които чуят вестта за теб, пляскат с ръце заради теб — защото върху кого не е падало всякога нечестието ти?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};