#include <map>
#include <string>
class Bible54
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
	struct bg5	{ int val; const char *msg; };
	struct bg6	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Павел, апостол на Иисус Христос по заповед на Бога, нашия Спасител, и на Христос Иисус, нашата надежда,"},
	{2, "2 до Тимотей, моето истинско дете във вярата: Благодат, милост и мир от Бог Отец и от Христос Иисус, нашия Господ."},
	{3, "3 Както те помолих, когато отивах в Македония, да останеш в Ефес, за да заръчаш на някои да не предават други учения"},
	{4, "4 и да не се занимават с измислици и безкрайни родословия, които повече способстват за спорове, отколкото за Божията наредба, която е чрез вяра, така правй."},
	{5, "5 А целта на тази заръка е любов от чисто сърце, чиста съвест и нелицемерна вяра,"},
	{6, "6 от което някои, като не улучиха целта, се отклониха в празнословие,"},
	{7, "7 искайки да бъдат законоучители, без да разбират нито какво говорят, нито какво твърдят уверено."},
	{8, "8 А ние знаем, че законът е добър, ако го употребява някой законно,"},
	{9, "9 като знае това, че законът не се налага за праведния, а за беззаконните и непокорните, за безбожните и грешните, за богоненавистниците и нечистите, за убийците на бащи и убийците на майки, за убийците на хора,"},
	{10, "10 за блудниците, за хомосексуалистите, за търгуващите с роби, за лъжците, за клетвопрестъпниците и за всичко друго, което се противопоставя на здравото учение;"},
	{11, "11 според благовестието на славата на блажения Бог, което ми беше поверено."},
	{12, "12 Благодаря на Христос Иисус, нашия Господ, който ми даде сила, че ме счете за верен и ме постави на това служение –"},
	{13, "13 мен, който преди това бях хулител, гонител и притеснител, но придобих милост, понеже като невеж сторих това в неверие,"},
	{14, "14 но благодатта на нашия Господ беше изобилна с вяра и любов в Христос Иисус."},
	{15, "15 Вярно е това слово и заслужава пълно приемане, че Христос Иисус дойде на света да спаси грешните, от които главният съм аз."},
	{16, "16 Но затова придобих милост, за да покаже Иисус Христос цялото си дълготърпение в мен, главния грешник, за пример на онези, които ще повярват в Него за вечен живот."},
	{17, "17 А на Царя на вековете, на нетленния, невидимия, единствения Бог, да бъде чест и слава до вечни векове. Амин."},
	{18, "18 Тази заръка предавам на теб, сине Тимотее, според по-раншните пророчества за теб, за да воюваш съобразно с тях в добрата война,"},
	{19, "19 имайки вяра и чиста съвест, която някои, като отхвърлиха, претърпяха корабокрушение спрямо вярата;"},
	{20, "20 от които са Именей и Александър, които предадох на Сатана, за да се научат да не богохулстват."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 И така, напътствам преди всичко да се отправят молби, молитви, искания, благодарения за всички хора,"},
	{2, "2 за царе и за всички, които са на власт, за да водим тих и спокоен живот в пълно благочестие и сериозност."},
	{3, "3 Защото това е добро и угодно пред Бога, нашия Спасител,"},
	{4, "4 който иска да се спасят всичките хора и да дойдат до познаването на истината."},
	{5, "5 Защото има само един Бог и един Посредник между Бога и хората – Човекът Христос Иисус,"},
	{6, "6 който, като свидетелство за това, на определеното Си време даде Себе Си откуп за всички;"},
	{7, "7 за което аз бях поставен проповедник и апостол – говоря истината в Христос, не лъжа – учител на езичниците във вяра и истина."},
	{8, "8 И така, искам мъжете да се молят на всяко място, като издигат свети ръце без гняв и съмнения."},
	{9, "9 Така и жените да украсяват себе си с достойно държание, със скромност и целомъдрие, а не с плетене на косата или злато, или бисери, или скъпи дрехи,"},
	{10, "10 а с добри дела, както прилича на жени, които изповядват страх от Бога."},
	{11, "11 Жената да се учи мълчаливо, с пълно подчинение."},
	{12, "12 А на жената не позволявам да поучава, нито да владее над мъжа, а да бъде мълчалива."},
	{13, "13 Защото първо Адам бе създаден, а после Ева."},
	{14, "14 И Адам не беше измамен, а жената беше измамена и падна в престъпление."},
	{15, "15 Но тя ще се спаси чрез раждане на деца, ако останат във вяра и любов, и святост, с целомъдрие."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 Вярно е това слово: ако някой се стреми към надзорничество, добро дело желае."},
	{2, "2 Надзорникът обаче трябва да бъде непорочен, мъж на една жена, самообладан, разбран, порядъчен, гостолюбив, способен да поучава,"},
	{3, "3 не пияница, не побойник, а кротък, не скандалджия, не сребролюбец,"},
	{4, "4 който управлява добре своя дом и държи децата си в послушание с пълна сериозност,"},
	{5, "5 защото, ако човек не знае да управлява своя дом, как ще се грижи за Божията църква?"},
	{6, "6 Да не е нов във вярата, за да не се възгордее и падне под осъждането на дявола."},
	{7, "7 Освен това той трябва да има добро име и сред външните, за да не бъде укоряван и да падне в примката на дявола."},
	{8, "8 Така и служителите трябва да са сериозни, не двулични, не пристрастени към много вино, не лакоми за гнусна печалба,"},
	{9, "9 да държат тайната на вярата с чиста съвест."},
	{10, "10 Също и те първо да се изпитват, и после да стават служители, ако са безупречни."},
	{11, "11 Така и жените трябва да са сериозни, не клеветници, самообладани, верни във всичко."},
	{12, "12 Всеки от служителите да е мъж на една жена и да управляват добре децата си и домовете си."},
	{13, "13 Защото тези, които са служили добре като служители, придобиват за себе си добро положение и голямо дръзновение във вярата в Христос Иисус."},
	{14, "14 Надявам се скоро да дойда при теб, но това ти пиша"},
	{15, "15 в случай, че закъснея, за да знаеш как трябва да се държат в Божия дом, който е църквата на живия Бог, стълбът и основата на истината."},
	{16, "16 И както е признато, велика е тайната на благочестието: Този, който се яви в плът, оправдан в Духа, видян от ангели, проповядван между нациите, повярван в света, възнесен в слава."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 А Духът изрично казва, че в по-късните времена някои ще отстъпят от вярата и ще слушат измамни духове и демонични учения"},
	{2, "2 чрез лицемерието на онези, които говорят лъжа, чиято съвест е прегоряла,"},
	{3, "3 които забраняват жененето и заповядват въздържане от ястия, които Бог създаде, за да се приемат с благодарение от онези, които вярват и познават истината."},
	{4, "4 Защото всичко създадено от Бога е добро и нищо не е за отхвърляне, ако се приема с благодарение,"},
	{5, "5 понеже се освещава чрез Божието слово и молитва."},
	{6, "6 В това като съветваш братята, ще бъдеш добър служител на Иисус Христос, хранен с думите на вярата и доброто учение, което си последвал."},
	{7, "7 А нечистите и бабешките басни отхвърляй и обучавай себе си в благочестие."},
	{8, "8 Защото телесното упражнение е полезно за малко, а благочестието е полезно за всичко, тъй като има обещанието и за сегашния, и за бъдещия живот."},
	{9, "9 Това слово е вярно и заслужава пълно приемане,"},
	{10, "10 понеже за това се трудим и търпим укори – защото се надяваме на живия Бог, който е Спасител на всички хора, а най-вече на вярващите."},
	{11, "11 Това заръчвай и учи."},
	{12, "12 Никой да не презира твоята младост; но ти бъди на вярващите пример в слово, в поведение, в любов, във вяра, в чистота."},
	{13, "13 Докато дойда, обърни внимание на прочитането, на увещаването и на поучаването."},
	{14, "14 Не пренебрегвай дарбата, която имаш, която ти се даде чрез пророчество с полагането на ръце от старейшинството."},
	{15, "15 Върху това размишлявай, на това се предавай, за да стане явен на всички твоят напредък."},
	{16, "16 Внимавай на себе си и на учението и постоянствай в това, защото, като правиш това, ще спасиш и себе си, и тези, които те слушат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct bg5 poems[] = {
	{1, "1 Стар човек не укорявай остро, а го увещавай като баща; по-младите – като братя;"},
	{2, "2 старите жени – като майки; по-младите – като сестри, със съвършена чистота."},
	{3, "3 Почитай вдовиците, които наистина са вдовици."},
	{4, "4 Но ако някоя вдовица има деца или внуци, те нека се учат първо да показват благочестие към домашните си и да отдават дължимото на родителите си, защото това е угодно пред Бога."},
	{5, "5 А която е истинска вдовица и е останала сама, тя се надява на Бога и постоянства в молби и в молитви нощем и денем."},
	{6, "6 Но онази, която живее разпуснато, тя е жива умряла."},
	{7, "7 Заръчвай и това, за да бъдат непорочни."},
	{8, "8 Но ако някой не се грижи за своите и най-вече за домашните си, той се е отрекъл от вярата и е по-лош от невярващ."},
	{9, "9 Да се записва само такава вдовица, която не е по-малко от шестдесет години, която е била жена на един мъж,"},
	{10, "10 известна с добрите си дела, ако е отгледала деца, ако е приемала странници, ако е умивала краката на светии, ако е помагала на страдащи, ако се е предавала на всякакво добро дело."},
	{11, "11 Но по-младите вдовици не приемай, защото, когато страстите им вземат връх над Христос, искат да се омъжват"},
	{12, "12 и попадат под осъждане, защото са се отметнали от първото си обещание;"},
	{13, "13 и освен това се научават да бъдат безделни, като ходят от къща на къща, и не само безделни, но и бъбриви, и да се занимават с празни работи, като говорят това, което не трябва да се говори."},
	{14, "14 По тази причина искам по-младите вдовици да се омъжват, да раждат деца, да управляват дом, да не дават никаква причина на противника да хули;"},
	{15, "15 защото някои вече са се отклонили и отишли след Сатана."},
	{16, "16 Ако някой вярващ или вярваща има роднини вдовици, нека се грижи за тях, за да не се обременява църквата и да може да се грижи за истинските вдовици."},
	{17, "17 Нека старейшините, които управляват добре, да се удостояват с двойна почит – особено онези, които се трудят в словото и поучението;"},
	{18, "18 защото Писанието казва: ?Да не обвързваш устата на вола, когато вършее“; и: ?Работникът заслужава заплатата си.“"},
	{19, "19 Против старейшина не приемай обвинение, освен ако не е отправено от двама или трима свидетели."},
	{20, "20 Онези, които съгрешават, изобличавай пред всички, за да имат и другите страх."},
	{21, "21 Тържествено ти заявявам пред Бога, пред Христос Иисус и пред избраните ангели да пазиш тези заповеди без предразсъдък и нищо да не вършиш от пристрастие."},
	{22, "22 Не прибързвай да полагаш ръце на никого и не участвай в чужди грехове. Пази себе си чист."},
	{23, "23 Не пий вече само вода, но употребявай малко вино заради стомаха си и заради честите си боледувания."},
	{24, "24 Греховете на някои хора са явни отпреди и ги изпреварват на съда, а на други идват след тях."},
	{25, "25 Така и добрите дела са явни; а и онези, които не са, не могат да се укрият."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct bg6 poems[] = {
	{1, "1 Нека тези, които са под робско иго, да считат господарите си достойни за всяка почит, за да не се хули Божието Име и учението."},
	{2, "2 И нека онези, които имат вярващи господари, да не ги презират за това, че са братя, а да им служат още по-усърдно, защото онези, които се ползуват от усърдието им, са вярващи и възлюбени. Това поучавай и увещавай."},
	{3, "3 И ако някой предава друго учение и не се съобразява със здравите думи на нашия Господ Иисус Христос и учението, което е според благочестието,"},
	{4, "4 той се е възгордял, без да знае нищо, и има нездраво желание за разисквания и празни спорове, от които произлизат завист, разпри, хули, зли подозрения,"},
	{5, "5 постоянни караници между хора с покварен ум и лишени от истината, които мислят, че благочестието е средство за печалба."},
	{6, "6 А благочестието със скромност е голяма печалба."},
	{7, "7 Защото не сме внесли нищо в света, нито можем да изнесем нещо;"},
	{8, "8 но като имаме храна и облекло, нека да бъдем доволни с това."},
	{9, "9 А които ламтят за обогатяване, падат в изкушение и в примка, и в много глупави и вредни страсти, които потапят хората в разорение и гибел."},
	{10, "10 Защото сребролюбието е корен на всякакви злини, към което, като се стремяха някои, се отклониха от вярата и пронизаха себе си с много болки."},
	{11, "11 Но ти, Божи човече, бягай от тези неща и се стреми към правдата, благочестието, вярата, любовта, търпението, кротостта."},
	{12, "12 Борй се в добрата борба на вярата, сграбчй вечния живот, на който си бил призван, като си направил добрата изповед пред мнозина свидетели."},
	{13, "13 Заръчвам ти пред Бога, който оживотворява всичко, и пред Христос Иисус, който пред Понтийски Пилат засвидетелства добрата изповед,"},
	{14, "14 да пазиш заповедта чисто и безукорно до явяването на нашия Господ Иисус Христос,"},
	{15, "15 което в определеното време ще покаже блажения и единствен Владетел, Цар на царете и Господар на господарите,"},
	{16, "16 който единствен притежава безсмъртие, обитавайки в непристъпна светлина, когото никой човек не е видял, нито може да види, на когото да бъде чест и вечна власт. Амин."},
	{17, "17 На онези, които имат богатството на този свят, заръчвай да не бъдат високомерни, нито да се надяват на несигурното богатство, а на Бога, който ни дава всичко изобилно, за да се наслаждаваме,"},
	{18, "18 да правят добро, да богатеят на добри дела, да бъдат щедри, да дават на драго сърце,"},
	{19, "19 като събират за себе си добра основа за в бъдеще, за да сграбчат истинския живот."},
	{20, "20 О, Тимотее, пази това, което ти е поверено, като избягваш нечистите празнословия и възраженията на лъжливо нареченото познание,"},
	{21, "21 което някои, като изповядаха, се отклониха от вярата. Благодат да бъде с вас. (Амин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};