#include <map>
#include <string>
class Bible50
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Павел и Тимотей, слуги на Иисус Христос, до всичките светии в Христос Иисус, които са във Филипи, заедно с надзорниците и служителите:"},
	{2, "2 Благодат и мир да бъде на вас от Бога, нашия Отец, и от Господ Иисус Христос."},
	{3, "3 Благодаря на моя Бог всеки път, когато си спомням за вас,"},
	{4, "4 винаги, във всяка моя молитва, като се моля за всички вас с радост,"},
	{5, "5 за вашето участие в делото на благовестието от първия ден досега,"},
	{6, "6 като съм уверен точно в това, че Онзи, който е започнал едно добро дело във вас, ще го завърши докрай до Деня на Иисус Христос."},
	{7, "7 И за мен е добре да мисля това за всички вас, понеже ви имам в сърцето си, тъй като вие всички участвате заедно с мен в благодатта – както в оковите ми, така и в защитата и утвърждаването на благовестието."},
	{8, "8 Защото Бог ми е свидетел как копнея за всички вас със сърдечната любов на Иисус Христос."},
	{9, "9 И за това се моля: любовта ви да изобилства все повече и повече с познаване и всякакво разбиране,"},
	{10, "10 за да разпознавате най-доброто и да бъдете искрени и без препънка за Деня на Христос,"},
	{11, "11 изпълнени с плода на правдата, който е чрез Иисус Христос, за слава и хвала на Бога."},
	{12, "12 А желая да знаете, братя, че това, което се случи с мен, спомогна още повече за успеха на благовестието,"},
	{13, "13 така че моите окови за Христос станаха известни на цялата претория и на всички други;"},
	{14, "14 и повечето от братята, доверявайки се на Господа благодарение на моите окови, станаха много по-смели да говорят Божието слово без страх."},
	{15, "15 Някои наистина проповядват Христос дори от завист и от желание за препирни, а някои и от добра воля."},
	{16, "16 Едните правят това от любов, като знаят, че съм поставен да защитавам благовестието,"},
	{17, "17 но другите възвестяват Христос от партизанщина, неискрено, като мислят да прибавят тъга на моите окови."},
	{18, "18 Тогава какво? Само това, че по всякакъв начин – било престорено, или истинно – се проповядва Христос; и затова аз се радвам, и ще се радвам."},
	{19, "19 Защото зная, че това ще послужи за моето спасение чрез вашата молитва и чрез подкрепата на Духа на Иисус Христос"},
	{20, "20 според усърдното ми очакване и надежда, че няма в нищо да се посрамя, а както винаги, така и сега, с пълно дръзновение ще бъде възвеличен Христос в тялото ми – било чрез живот или чрез смърт."},
	{21, "21 Защото животът за мен е Христос, а смъртта – придобивка."},
	{22, "22 Но ако живея в плътта, това означава плод от моя труд. И не зная какво да избера,"},
	{23, "23 защото съм притиснат между двете; понеже имам желание да си отида и да бъда с Христос, което е много по-добре,"},
	{24, "24 но да остана в плътта е по-нужно за вас."},
	{25, "25 И като имам тази увереност, зная, че ще остана и ще продължа с всички вас за вашето напредване и радост във вярата,"},
	{26, "26 така че вашата похвала в Иисус Христос да бъде още по-изобилна чрез мен, когато дойда пак при вас."},
	{27, "27 Само се дръжте достойно за Христовото благовестие, така че – независимо дали идвам да ви видя, или отсъствам от вас – да чуя за вас, че стоите твърдо в един дух и че се борите единодушно за вярата на благовестието,"},
	{28, "28 и че в нищо не се плашите от противниците; което за тях е доказателство за тяхната гибел, а за вас – за спасение, и то от Бога."},
	{29, "29 Защото на вас ви е дадено относно Христос не само да вярвате в Него, но и да страдате заради Него,"},
	{30, "30 като имате същата борба, която сте видели в мен и сега чувате за мен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 И така, ако има някоя утеха в Христос или някое успокоение от любов, или някое общение на Духа, или някое милосърдие и състрадание,"},
	{2, "2 направете радостта ми пълна, като имате един и същ ум и една и съща любов, като бъдете единодушни и единомислени."},
	{3, "3 Не правете нищо от партизанство или от тщеславие, но със смирение нека всеки счита другия за по-горен от себе си."},
	{4, "4 Не гледайте всеки само за своето, а всеки и за чуждото."},
	{5, "5 Имайте в себе си същия стремеж на ума, който беше и в Христос Иисус;"},
	{6, "6 който, като беше в Божия образ, пак не счете, че трябва да държи като плячка равенството с Бога,"},
	{7, "7 а ограби Себе Си, като взе образа на слуга и стана подобен на хората,"},
	{8, "8 и като се намери в човешки образ, смири Себе Си и стана послушен до смърт, даже смърт на кръст."},
	{9, "9 Затова и Бог Го възвиси най-високо и Му даде Името, което е над всяко друго име;"},
	{10, "10 така че в Името на Иисус да се поклони всяко коляно от небесните и земните, и подземните същества"},
	{11, "11 и всеки език да изповяда, че Иисус Христос е Господ, за слава на Бог Отец."},
	{12, "12 Затова, възлюбени мои, както сте били винаги послушни – не само в моето присъствие, но сега много повече в моето отсъствие – изработвайте спасението си със страх и трепет,"},
	{13, "13 защото Бог е Този, който действа във вас, за да желаете и да постъпвате според Неговото благоволение."},
	{14, "14 Вършете всичко без ропот и без съмнение,"},
	{15, "15 за да бъдете непорочни и чисти, безукорни Божии деца сред опако и извратено поколение, между които блестите като светила на света,"},
	{16, "16 като държите словото на живота, за да имам с какво да се хваля в Деня на Христос – че не съм тичал напразно, нито съм се трудил напразно."},
	{17, "17 Но макар и да се принасям като възлияние върху жертвата и служението на вашата вяра, радвам се, и се радвам заедно с всички вас."},
	{18, "18 Подобно и вие се радвайте, и се радвайте заедно с мен."},
	{19, "19 А надявам се на Господ Иисус да ви изпратя скоро Тимотей, така че и аз да се утеша, като узная вашето състояние."},
	{20, "20 Защото нямам никой друг единомислен, който да се погрижи искрено за вас."},
	{21, "21 Понеже всички търсят своето си, а не онова, което е на Иисус Христос."},
	{22, "22 А вие знаете неговата изпитана вярност – че той е служил заедно с мен на благовестието така, както дете – на баща си."},
	{23, "23 Затова се надявам да го изпратя веднага, щом разбера какво ще стане с мен."},
	{24, "24 Но съм уверен в Господа, че и аз самият скоро ще дойда."},
	{25, "25 Счетох обаче за нужно да ви изпратя брат Епафродит, моя съработник и сподвижник, изпратен от вас да ми послужи в моите нужди,"},
	{26, "26 понеже копнееше за всички вас и беше обезпокоен, защото бяхте чули, че бил болен."},
	{27, "27 И наистина, той боледува почти до смърт, но Бог се смили над него; и не само над него, но и над мен, за да нямам скръб върху скръб."},
	{28, "28 Затова и по-скоро го изпратих, така че като го видите, да се зарадвате, а и аз да бъда по-малко тъжен."},
	{29, "29 И така, приемете го в Господа с пълна радост и имайте почит към такива братя,"},
	{30, "30 понеже заради делото на Христос той дойде близо до смърт, като рискува живота си, за да запълни недостига на вашето служение за мен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 И така, братя мои, радвайте се в Господа. За мен не е досадно да ви пиша едно и също, а за вас е за предпазване."},
	{2, "2 Пазете се от псетата, пазете се от злите работници, пазете се от лъжливото обрязване."},
	{3, "3 Защото ние сме обрязаните, които служим в Божия Дух и се хвалим с Христос Иисус, и не се уповаваме на плътта."},
	{4, "4 Макар че аз бих могъл и на плътта да се уповавам. Ако някой друг мисли, че може да се уповава на плътта, то аз повече:"},
	{5, "5 обрязан съм бил на осмия ден, от израилевия род съм, от вениаминовото племе, евреин от евреи, според закона – фарисей,"},
	{6, "6 според ревностното ми желание – гонител на църквата, според правдата на закона – непорочен."},
	{7, "7 Но това, което беше за мен придобивка, го счетох като загуба заради Христос."},
	{8, "8 А освен това всичко считам като загуба заради това превъзходно нещо – познаването на моя Господ Христос Иисус, заради когото изгубих всичко и считам всичко за измет, за да придобия Христос"},
	{9, "9 и да се намеря в Него, като нямам моята правда, която е от закона, а тази, която е чрез вярата в Христос – правдата, която е от Бога въз основа на вяра,"},
	{10, "10 за да позная Него и силата на Неговото възкресение, и общението в Неговите страдания, като стана съобразен с Неговата смърт,"},
	{11, "11 за да мога някак да достигна до възкресението на мъртвите."},
	{12, "12 Не че съм уловил вече, нито съм станал вече съвършен, но гоня, дано и аз да уловя, защото и аз бях уловен от Христос Иисус."},
	{13, "13 Братя, аз не считам, че съм уловил, но едно правя – като забравям задното и се простирам към предното,"},
	{14, "14 гоня целта за наградата на горното призвание от Бога в Христос Иисус."},
	{15, "15 И така, нека ние, колкото от нас са съвършени, да мислим така; и ако вие мислите за нещо по друг начин, Бог и това ще ви открие."},
	{16, "16 И така, дотам, докъдето сме достигнали, нека ходим (според това правило, като мислим същото)."},
	{17, "17 Братя, бъдете всички мои подражатели и внимавайте на тези, които живеят според примера, който ние ви дадохме."},
	{18, "18 Защото мнозина живеят, за които много пъти съм ви казвал, а сега и с плач ви казвам, че са враговете на Христовия кръст,"},
	{19, "19 чийто край е погибел, чийто бог е коремът, чиято слава е в техния позор, които отдават ума си на земните неща."},
	{20, "20 Защото нашето гражданство е на небето, откъдето и очакваме Спасител – Господ Иисус Христос,"},
	{21, "21 който ще преобрази нашето унижено тяло, за да стане съобразно с Неговото славно тяло според действието на Неговата сила, с която Той може да покори всичко на Себе Си."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 И така, възлюбени и много желани мои братя, моя радост и мой венец, стойте така твърдо в Господа, възлюбени!"},
	{2, "2 Напътствам Еводия, напътствам и Синтихия да бъдат единомислени в Господа."},
	{3, "3 Също и теб умолявам, искрени ми съработнико, помагай на тези жени, които се бориха заедно с мен за благовестието заедно с Климент и с други мои съработници, чиито имена са в книгата на живота."},
	{4, "4 Винаги се радвайте в Господа! Пак казвам: Радвайте се!"},
	{5, "5 Нека вашата кротост да бъде позната на всички хора. Господ е близо."},
	{6, "6 Не се безпокойте за нищо, но във всяко нещо с молитва и молба изказвайте молбите си на Бога с благодарение;"},
	{7, "7 и Божият мир, който превъзхожда всеки разум, ще пази сърцата ви и мислите ви в Христос Иисус."},
	{8, "8 Най-накрая, братя, всичко, което е истинно, което е честно, което е праведно, което е чисто, което е достойно за обич, което е благодатно, ако има нещо добродетелно и ако има нещо похвално, това зачитайте."},
	{9, "9 Това, което сте и научили, и приели, и чули, и видели в мен, него вършете; и Бог на мира ще бъде с вас."},
	{10, "10 Но аз много се радвах в Господа, че сега най-после направихте отново да се прояви вашата грижа към мен; за което наистина сте се грижили, но не сте имали благоприятна възможност."},
	{11, "11 Не казвам това поради оскъдност, защото се научих да съм доволен в каквото и състояние да съм."},
	{12, "12 Зная и в оскъдност да живея, зная и в изобилие да живея; навсякъде и във всичко съм посветен в тайната да мога да живея и сит, и гладен, и в изобилие, и в оскъдност."},
	{13, "13 Всичко мога чрез Онзи, който ме укрепва."},
	{14, "14 Но въпреки това направихте добре, като взехте участие в скръбта ми."},
	{15, "15 А и вие, филипяни, знаете, че в началото на делото на благовестието, когато излязох от Македония, нито еда църква не влезе във връзка с мен за даване и взимане, освен единствено вие."},
	{16, "16 Защото и в Солун един и два пъти ми пращахте за нуждата ми."},
	{17, "17 Не че търся подаръка, но искам плода, който се умножава за ваша сметка."},
	{18, "18 Но получих всичко и имам изобилно. Наситих се, като получих от Епафродит изпратеното от вас, благоуханна миризма, жертва приятна, благоугодна на Бога."},
	{19, "19 И моят Бог ще снабди всяка ваша нужда според Своите богатства в слава в Христос Иисус."},
	{20, "20 А на нашия Бог и Отец да бъде слава за вечни векове. Амин."},
	{21, "21 Поздравете всеки светия в Христос Иисус. Поздравяват ви братята, които са с мен."},
	{22, "22 Поздравяват ви всичките светии, а особено тези, които са от императорския дом."},
	{23, "23 Благодатта на нашия Господ Иисус Христос да бъде с вашия дух. (Амин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};