#include <map>
#include <string>
class Bible49
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
	struct bg5	{ int val; const char *msg; };
	struct bg6	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Павел, с Божията воля апостол на Иисус Христос, до светиите и верните в Христос Иисус, които са в Ефес:"},
	{2, "2 Благодат да бъде на вас и мир от Бога, нашия Отец, и от Господ Иисус Христос!"},
	{3, "3 Благословен да бъде Бог и Отец на нашия Господ Иисус Христос, който в Христос ни е благословил с всяко духовно благословение в небесните места;"},
	{4, "4 както ни е избрал в Него преди основаването на света, за да бъдем свети и без недостатък пред Него в любов;"},
	{5, "5 като ни е предопределил да бъдем осиновени за Него чрез Иисус Христос по благоволението на Своята воля,"},
	{6, "6 за похвала на славата на Своята благодат, с която ни е дарил във Възлюбения Си."},
	{7, "7 В Него имаме изкупление чрез Неговата кръв, прощението на прегрешенията според богатството на Неговата благодат,"},
	{8, "8 която е направил да изобилства за нас във всяка мъдрост и разбиране,"},
	{9, "9 като ни е открил тайната на волята Си според благоволението, което е положил в Себе Си,"},
	{10, "10 за да се приложи, когато се изпълнят времената: да се обедини като цяло в Христос всичко – и това, което е на небесата, и това, което е на земята – в Него."},
	{11, "11 В Него и ние бяхме взети за наследство, като бяхме предопределени за това според намерението на Бога, който върши всичко по решението на Своята воля,"},
	{12, "12 така че да бъдем за похвала на Неговата слава – ние, които отпреди се надявахме на Христос."},
	{13, "13 В Него и вие, като чухте словото на истината – благовестието на вашето спасение – и като повярвахте в Него, бяхте запечатани със Светия Дух на обещанието,"},
	{14, "14 който е залог за нашето наследство, докато бъде изкупено притежанието на Бога за похвала на Неговата слава."},
	{15, "15 Затова и аз, като чух за вярата ви в Господ Иисус и за любовта към всичките светии,"},
	{16, "16 не преставам да благодаря за вас и да ви споменавам в молитвите си;"},
	{17, "17 така че Бог на нашия Господ Иисус Христос, Отец на славата, да ви даде дух на мъдрост и откровение в познаването на Него Самия,"},
	{18, "18 като просветли очите на сърцето ви, за да знаете каква е надеждата на Неговото призоваване, какво е богатството на славата на Неговото наследство в светиите"},
	{19, "19 и какво е превъзходното величие на Неговата мощ към нас, вярващите, според действието на мощта на Неговата сила."},
	{20, "20 С нея Той подейства в Христос, като Го възкреси от мъртвите и Го сложи да седне от дясната си страна на небесата,"},
	{21, "21 далеч над всяко началство и власт, и сила, и господство, и всяко име, с което се наименуват, не само в този свят, но и в бъдещия."},
	{22, "22 И покори всичко под краката Му и Го постави да бъде глава над всичко за църквата,"},
	{23, "23 което е Неговото тяло, пълнотата на Този, който изпълва всичко във всичко."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 И съживи вас, които бяхте мъртви във вашите престъпления и грехове,"},
	{2, "2 в които сте ходили някога според вървежа на този свят, според княза на въздушната власт, на духа, който сега действа в синовете на непокорството,"},
	{3, "3 между които и ние всички сме живели някога в своите плътски страсти, като сме изпълнявали волята на плътта и на помислите, и по естество сме били деца на гнева, както и другите."},
	{4, "4 Бог обаче, който е богат на милост, поради голямата любов, с която ни възлюби,"},
	{5, "5 въпреки че бяхме мъртви в престъпленията си, ни съживи заедно с Христос – по благодат сте спасени –"},
	{6, "6 и като ни съвъзкреси, ни сложи да седим заедно с Него в небесни места в Христос Иисус,"},
	{7, "7 за да показва през идните векове изобилните богатства на своята благодат чрез добрината си към нас в Христос Иисус."},
	{8, "8 Защото по благодат сте спасени чрез вяра, и то не от сами вас – това е дар от Бога —"},
	{9, "9 не чрез дела, за да не се похвали никой."},
	{10, "10 Защото сме Негово творение, създадено в Христос Иисус за добри дела, които Бог отнапред е наредил, за да ходим в тях."},
	{11, "11 Затова помнете, че вие, някога езичници по плът, наричани необрязани от тези, които се наричат обрязани – с обрязване на плътта, което се извършва с ръце –"},
	{12, "12 в онова време бяхте без Христос, отлъчени от израилевото гражданство и чужди на заветите на обещанието, без да имате никаква надежда и без Бог на света."},
	{13, "13 Но сега в Христос Иисус вие, които някога сте били далеч, сте поставени близо чрез кръвта на Христос."},
	{14, "14 Защото Той е нашият мир, който направи двете едно и събори средната стена, която ги разделяше,"},
	{15, "15 като в плътта си унищожи враждата, тоест закона със заповедите му изразени в постановления, за да създаде в Себе Си от двата един нов човек и така да въдвори мир,"},
	{16, "16 и в едно тяло да примири и двата с Бога чрез кръста, като уби на него враждата."},
	{17, "17 И като дойде, благовества мир на вас, далечните, и мир на близките."},
	{18, "18 Защото чрез Него и едните, и другите имаме достъп в един Дух до Отца."},
	{19, "19 И така, вие не сте вече странници и чужденци, а сте съграждани на светиите и членове на Божието семейство;"},
	{20, "20 защото сте съградени върху основата на апостолите и пророците, като Сам Христос Иисус е крайъгълен камък,"},
	{21, "21 в когото сглобено, цялото здание расте за свят храм в Господа,"},
	{22, "22 в който вие също се вграждате заедно в Духа за Божие обиталище."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 Затова аз, Павел, съм затворник за Иисус Христос заради вас, езичниците,"},
	{2, "2 понеже сте чули за настойничеството на Божията благодат, която ми е дадена за вас,"},
	{3, "3 че по откровение ми беше известена тайната – както ви писах накратко и по-горе,"},
	{4, "4 от което, като прочетете, можете да разберете моето проумяване на тайната на Христос –"},
	{5, "5 която в други поколения не беше известена на човешките синове, както сега се откри на Неговите свети апостоли и пророци чрез Духа,"},
	{6, "6 а именно, че езичниците са сънаследници и са от същото тяло, и са съпричастници на (Неговото) обещание в Христос Иисус чрез благовестието,"},
	{7, "7 на което станах служител според дара на Божията благодат, който ми е даден според действието на Неговата сила."},
	{8, "8 На мен, най-нищожния от всички светии, се даде тази благодат – да благовествам сред езичниците неизследимото богатство на Христос"},
	{9, "9 и да осветлявам всички относно настойничеството на тайната, която от векове е била скрита у Бога, който е Създателят на всичко,"},
	{10, "10 така че многообразната премъдрост на Бога да стане позната на небесните началства и власти сега чрез църквата"},
	{11, "11 според вечното намерение, което Той изпълни в Христос Иисус, нашия Господ,"},
	{12, "12 в когото ние имаме дръзновение и достъп с увереност чрез вярата в Него."},
	{13, "13 Затова аз ви моля да не се обезсърчавате от моите скърби заради вас, които са ваша слава."},
	{14, "14 Поради това аз прекланям коленете си пред Отца (на нашия Господ Иисус Христос),"},
	{15, "15 от когото носи името си всеки род на небесата и на земята,"},
	{16, "16 да ви даде според богатствата на Неговата слава да се утвърдите здраво чрез Неговия Дух във вътрешния човек,"},
	{17, "17 чрез вяра да се всели Христос във вашите сърца, така че, вкоренени и основани в любовта,"},
	{18, "18 да бъдете в състояние да разберете заедно с всичките светии какво е широчината и дължината, височината и дълбочината"},
	{19, "19 и да познаете Христовата любов, която превъзхожда всяко знание, за да се изпълните в цялата Божия пълнота."},
	{20, "20 А на Този, който може да направи несравнимо повече, отколкото молим или мислим, според действащата в нас сила –"},
	{21, "21 на Него да бъде слава в църквата и в Христос Иисус през всичките поколения от векове и за векове. Амин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 И така, аз, затворникът в Господа, ви моля да живеете достойно за званието, на което бяхте призовани,"},
	{2, "2 със съвършено смирение и кротост, и дълготърпение, като си претърпявате един на друг с любов"},
	{3, "3 и се стараете да запазите единството на Духа във връзката на мира."},
	{4, "4 Има едно тяло и един Дух, както и бяхте призовани към една надежда на вашето звание;"},
	{5, "5 един Господ, една вяра, едно кръщение,"},
	{6, "6 един Бог и Отец на всички, който е над всички, чрез всички и във всички."},
	{7, "7 А на всеки от нас се даде благодат според мярката на Христовия дар."},
	{8, "8 Затова казва: ?Като се изкачи на високо, плени плен и даде дарове на хората.“"},
	{9, "9 А това ?изкачи“ какво друго значи, освен че (първо) слезе в по-долните части на земята?"},
	{10, "10 Този, който слезе, е Същият, който и възлезе над всички небеса, за да изпълни всичко."},
	{11, "11 И Той даде едни да бъдат апостоли, други – пророци, други – благовестители, а други – пастири и учители"},
	{12, "12 с цел да се усъвършенстват светиите за делото на служението, за изграждането на Христовото тяло,"},
	{13, "13 докато ние всички достигнем в единството на вярата и на познаването на Божия Син, в пълнолетно мъжество, в мярката на ръста на Христовата пълнота,"},
	{14, "14 за да не бъдем вече деца, блъскани и завличани от всеки вятър на някое учение, по човешка измама, в лукавство, по хитро измислени заблуди,"},
	{15, "15 а като сме истинни в любов, да пораснем по всичко към Него, който е главата, Христос,"},
	{16, "16 от когото цялото тяло, сглобено и свързано чрез службата на всяка става, според съразмерното действие на всяка една част, изработва растежа на тялото за неговото изграждане в любовта."},
	{17, "17 И така, това казвам и заявявам в Господа: да не живеете вече така, както живеят езичниците – по своя суетен ум,"},
	{18, "18 помрачени в разума и отчуждени от Божия живот поради невежеството, което е в тях, и поради закоравяването на тяхното сърце,"},
	{19, "19 които, изгубили всякакво чувство, са се предали на разпътство, за да вършат ненаситно всякаква нечистота."},
	{20, "20 Но вие не така сте познали Христос;"},
	{21, "21 ако наистина сте Го чули и сте научени в Него, както е истината в Иисус,"},
	{22, "22 че, що се отнася до предишното ви поведение, вие сте съблекли стария човек, който тлее в измамните страсти,"},
	{23, "23 и бивате обновявани в духа на своя ум,"},
	{24, "24 и сте облекли новия човек, създаден по образа на Бога в истинска правда и святост."},
	{25, "25 Затова, като отхвърлите лъжата, говорете всеки с ближния си истина; защото ние сме части един на друг."},
	{26, "26 Гневете се, но не съгрешавайте, слънцето да не залезе в разгневяването ви;"},
	{27, "27 и не давайте място на дявола."},
	{28, "28 Който е крал, да не краде вече, а по-добре да се труди, като върши с ръцете си доброто, за да има да отдели и за този, който има нужда."},
	{29, "29 Никаква гнила дума да не излиза от устата ви, а само онова, което е добро за изграждане според нуждата, за да принесе благодат на тези, които слушат."},
	{30, "30 И не наскърбявайте Светия Божи Дух, в когото сте запечатани за деня на изкуплението."},
	{31, "31 Нека всякакво огорчение, ярост, гняв, вик и хула заедно с всяка злоба да се махнат от вас;"},
	{32, "32 и бъдете благи един към друг, милостиви; прощавайте си един на друг, също както и Бог в Христос е простил на вас."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct bg5 poems[] = {
	{1, "1 И така, бъдете подражатели на Бога като възлюбени деца"},
	{2, "2 и живейте в любов, както и Христос ни възлюби и предаде Себе Си за нас като принос и жертва на Бога за благоуханна миризма."},
	{3, "3 А блудство и всякаква нечистота или сребролюбие да не се даже споменават между вас, както прилича на светии,"},
	{4, "4 нито срамни или празни приказки, нито подигравки, които са неприлични неща, а по-добре благодарете."},
	{5, "5 Защото знайте със сигурност, че нито един блудник или нечист, или сребролюбец – който е идолопоклонник – няма наследство в царството на Христос и на Бога."},
	{6, "6 Никой да не ви мами с празни думи, защото поради тези неща идва Божият гняв върху синовете на непокорството."},
	{7, "7 И така, не ставайте техни съучастници."},
	{8, "8 Защото някога бяхте тъмнина, но сега сте светлина в Господа. Живейте като деца на светлината –"},
	{9, "9 защото плодът на светлината се състои във всяка доброта, правда и истина –"},
	{10, "10 като опитвате кое е благоугодно на Господа."},
	{11, "11 И нямайте нищо общо с безплодните дела на тъмнината, а по-добре ги изобличавайте,"},
	{12, "12 защото е срамно дори да се говори за това, което те скришно вършат."},
	{13, "13 А всичко, което се изобличава, става явно чрез светлината, понеже всяко нещо, което става явно, е светлина."},
	{14, "14 Затова е казано: ?Събуди се ти, който спиш, и стани от мъртвите, и ще те осветли Христос.“"},
	{15, "15 И така, внимавайте добре как се държите – не като глупави, а като мъдри,"},
	{16, "16 като изкупувате благоприятното време, понеже дните са лоши."},
	{17, "17 Затова не бъдете неразумни, а проумявайте каква е Господната воля."},
	{18, "18 И не се опивайте с вино, следствието от което е разпътство, а се изпълвайте с Духа;"},
	{19, "19 като си говорите с псалми и химни, и духовни песни, като пеете и възпявате в сърцето си Господа;"},
	{20, "20 като винаги благодарите за всичко на Бог и Отец в Името на нашия Господ Иисус Христос;"},
	{21, "21 подчинявайте се един на друг в страх от Христос:"},
	{22, "22 жените – на своите мъже, както на Господа,"},
	{23, "23 защото мъжът е глава на жената, както и Христос е глава на църквата, като Той е Спасител на тялото."},
	{24, "24 Но както църквата се подчинява на Христос, така и жените нека се подчиняват във всичко на мъжете си."},
	{25, "25 Мъже, любете жените си, както и Христос възлюби църквата и предаде Себе Си за нея,"},
	{26, "26 за да я освети, като я очисти с водно умиване чрез словото,"},
	{27, "27 за да я представи на Себе Си църква славна, без петно или бръчка, или друго такова нещо, а да бъде свята и непорочна."},
	{28, "28 Така са длъжни и мъжете да любят жените си, както своите тела. Който люби жена си, себе си люби."},
	{29, "29 Защото никой никога не е намразил своята собствена плът, а я храни и се грижи за нея, както и Христос за църквата."},
	{30, "30 Защото ние сме части на Неговото тяло, (от Неговата плът и от Неговите кости)."},
	{31, "31 ?Затова ще остави човек баща си и майка си и ще се привърже към жена си, и двамата ще станат една плът.“"},
	{32, "32 Тази тайна е голяма; но аз казвам това за Христос и за църквата."},
	{33, "33 Така нека всеки един от вас да люби своята жена, както себе си; а жената да се бои от мъжа си."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct bg6 poems[] = {
	{1, "1 Деца, покорявайте се на родителите си в Господа, защото това е правилно."},
	{2, "2 ?Почитай баща си и майка си“ – което е първата заповед с обещание –"},
	{3, "3 ?за да ти бъде добре и да живееш много години на земята.“"},
	{4, "4 И вие, бащи, не дразнете децата си, а ги възпитавайте в Господното възпитание и наставление."},
	{5, "5 Слуги, покорявайте се на земните си господари със страх и трепет, с простота на сърцето си, като на Христос;"},
	{6, "6 не само за пред очи, като че угаждате на хора, а като Христови слуги, изпълняващи от душа Божията воля;"},
	{7, "7 и служете с добра воля, като на Господа, а не като на хора,"},
	{8, "8 като знаете, че всеки, каквото добро направи, това ще получи от Господа – бил той роб или свободен."},
	{9, "9 И вие, господари, правете същото на тях, като се въздържате от заплашване, като знаете, че и вашият, и техният Господар е Един и Същ на небесата и в Него няма пристрастие."},
	{10, "10 Най-накрая, братя мои, заяквайте в Господа и в силата на Неговото могъщество."},
	{11, "11 Облечете се в пълното Божие въоръжение, за да можете да устоите срещу хитростите на дявола."},
	{12, "12 Защото нашата борба не е срещу кръв и плът, а срещу началствата, срещу властите, срещу световните владетели на мрака на този свят, срещу духовете на злото в небесните места."},
	{13, "13 Затова вземете пълното Божие въоръжение, за да можете да противостоите в злия ден и като победите, да устоите."},
	{14, "14 И така, стойте препасани с истина през кръста си и облечени в бронения нагръдник на правдата,"},
	{15, "15 и с краката си обути с готовност за проповядване на благовестието на мира."},
	{16, "16 А освен всичко това, вземете щита на вярата, с който ще можете да угасите всичките огнени стрели на лукавия."},
	{17, "17 Вземете също шлема на спасението и меча на Духа, който е Божието слово."},
	{18, "18 Молете се в Духа по всяко време с всякаква молитва и молба, бодърствайте с неуморно постоянство и молби за всички светии"},
	{19, "19 и за мен, за да ми се даде слово, когато отворя устата си, с дръзновение да известявам тайната на благовестието,"},
	{20, "20 за което съм посланик в окови, така че да говоря за него дръзновено, както подобава да говоря."},
	{21, "21 Но за да знаете и вие за моите работи и как съм, Тихик, моят възлюбен брат и верен служител в Господа, ще ви каже всичко,"},
	{22, "22 когото изпратих до вас точно с тази цел – за да узнаете нашето състояние и той да утеши сърцата ви."},
	{23, "23 Мир на братята и любов с вяра от Бог Отец и Господ Иисус Христос."},
	{24, "24 Благодатта да бъде с всички, които неизменно любят нашия Господ Иисус Христос. (Амин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};