#include <map>
#include <string>
class Bible55
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Павел, с Божията воля апостол на Иисус Христос според обещанието на живота, който е в Христос Иисус,"},
	{2, "2 до Тимотей, възлюбеното ми дете: Благодат, милост, мир от Бог Отец и от Христос Иисус, нашия Господ."},
	{3, "3 Благодаря на Бога, на когото още от прародителите си служа с чиста съвест, като непрестанно те споменавам в молитвите си нощ и ден,"},
	{4, "4 и като си спомням сълзите ти, копнея да те видя, за да се изпълня с радост."},
	{5, "5 Понеже си припомням за твоята нелицемерна вяра, която първо се намираше в баба ти Лоида и в майка ти Евникия, а както съм уверен – и в теб."},
	{6, "6 По тази причина ти напомням да разпалваш дарбата от Бога, която имаш чрез полагането на моите ръце."},
	{7, "7 Защото Бог ни е дал дух не на плахост, а на сила, любов и себевладеене."},
	{8, "8 И така, не се срамувай от свидетелството на нашия Господ, нито от мен, затворника за Него, а участвай в страданията за благовестието според силата на Бога,"},
	{9, "9 който ни е спасил и призовал със свято призвание – не според нашите дела, а според Своето намерение и според благодатта, дадена ни в Христос Иисус преди вечните времена,"},
	{10, "10 но която сега откри чрез явяването на нашия Спасител Христос Иисус, който унищожи смъртта и извади на светлина живота и нетлението чрез благовестието,"},
	{11, "11 на което аз бях поставен като проповедник, апостол и учител (на езичниците),"},
	{12, "12 по която причина и страдам това. Но не се срамувам, защото зная в кого съм повярвал и съм уверен, че Той е силен да опази до онзи Ден онова, което съм Му поверил."},
	{13, "13 Дръж образеца на здравите думи, които си чул от мен, във вяра и любов в Христос Иисус."},
	{14, "14 Опази чрез Светия Дух, който живее в нас, онова добро нещо, което ти е поверено."},
	{15, "15 Ти знаеш, че всички, които са в Азия, от които са Фигел и Ермоген, се отвърнаха от мен."},
	{16, "16 Господ да покаже милост към дома на Онисифор, защото той много пъти ме ободряваше и не се засрами от оковите ми,"},
	{17, "17 а когато беше в Рим, ме потърси старателно и ме намери."},
	{18, "18 Господ да му даде да намери милост от Господа в онзи Ден; а колко служи в Ефес, ти знаеш много добре."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 И така, ти, дете мое, заяквай в благодатта, която е в Христос Иисус."},
	{2, "2 И каквото си чул от мен при много свидетели, това предай на верни хора, които да са способни да научат и други."},
	{3, "3 Бъди съучастник в страданията като добър войник на Иисус Христос."},
	{4, "4 Никой, който служи като войник, не се заплита в житейски работи, за да угоди на този, който го е записал за войник."},
	{5, "5 И ако някой се състезава в игрите, той не получава победен венец, ако не се е състезавал законно."},
	{6, "6 Усилно трудещият се земеделец пръв трябва да вкуси от плодовете."},
	{7, "7 Размишлявай върху това, което ти казвам, и Господ ще ти даде да разбереш всичко."},
	{8, "8 Помни Иисус Христос от Давидовото потомство, който възкръсна от мъртвите според моето благовестие,"},
	{9, "9 за което страдам дотам, че съм в окови като злодей; но Божието слово не е вързано."},
	{10, "10 Затова аз всичко издържам заради избраните – за да получат и те спасението, което е в Христос Иисус, с вечна слава."},
	{11, "11 Вярно е това слово. Защото, ако сме умрели с Него, то и ще живеем с Него."},
	{12, "12 Ако устоим, то и ще царуваме с Него. Ако се отричаме от Него, и Той ще се отрече от нас."},
	{13, "13 Ако сме неверни, Той остава верен, защото не може да се отрече от Себе Си."},
	{14, "14 Това напомняй и заръчвай пред Господа – да не влизат в словесни спорове, което никак не ползува, а само погубва слушателите."},
	{15, "15 Старай се да се предоставиш на Бога одобрен работник, който няма от какво да се срамува, като излагаш право словото на истината."},
	{16, "16 Но избягвай нечистите празнословия, защото те ще отиват още по-далеч в безбожието"},
	{17, "17 и тяхното слово ще разяжда като гангрена; от които са Именей и Филет,"},
	{18, "18 които се отклониха от истината, като казват, че възкресението вече е станало, и събарят вярата на някои."},
	{19, "19 Но твърдата основа на Бога стои, имайки този печат: Господ познава Своите Си; и: Всеки, който изповяда Господното Име, да отстъпи от неправдата."},
	{20, "20 А в един голям дом съдовете не са само златни и сребърни, но и дървени, и пръстени; и едни са за почтена употреба, а други за непочтена."},
	{21, "21 Обаче ако някой очисти себе си от тези, той ще бъде съд за почтена употреба, осветен, полезен на стопанина, приготвен за всяко добро дело."},
	{22, "22 Избягвай младежките страсти и заедно с тези, които призовават Господа от чисто сърце, се стреми към правдата, вярата, любовта, мира."},
	{23, "23 Отказвай се от глупавите и невежи спорове, като знаеш, че пораждат караници."},
	{24, "24 А Господният слуга не бива да се кара, а трябва да бъде кротък към всички, способен да поучава, търпелив,"},
	{25, "25 с кротост да увещава онези, които се противопоставят, та дано Бог да им даде покаяние, за познаване на истината"},
	{26, "26 и да изтрезнеят, и се освободят от примката на дявола, от когото са били уловени, за да вършат неговата воля."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 И това да знаеш, че в последните дни ще настанат тежки времена."},
	{2, "2 Защото хората ще бъдат себелюбиви, сребролюбиви, надменни, горделиви, хулители, непокорни на родителите, неблагодарни, богоненавистници,"},
	{3, "3 безсърдечни, неотстъпчиви, клеветници, невъздържани, свирепи, необичащи доброто,"},
	{4, "4 предатели, буйни, надути, повече обичащи удоволствията, отколкото Бога,"},
	{5, "5 имащи вид на благочестие, но отрекли се от силата му; и от такива се отвръщай."},
	{6, "6 Защото от тях са онези, които се вмъкват в домовете и подмамват обременени с грехове женища, водени от различни страсти,"},
	{7, "7 които винаги се учат, но никога не могат да стигнат до познаването на истината."},
	{8, "8 И както Яний и Ямврий се възпротивиха на Мойсей, така и те се противят на истината, хора с покварен ум, показали се негодни относно вярата."},
	{9, "9 Но те няма да успеят повече, защото безумието им ще стане явно на всички, както стана и с онези."},
	{10, "10 А ти си последвал изцяло учението ми, поведението, целта, вярата, дълготърпението, любовта, твърдостта,"},
	{11, "11 гоненията, страданията, които ме сполетяха в Антиохия, в Икония, в Листра. Какви гонения издържах, и от всички тях ме избави Господ!"},
	{12, "12 Но и всички, които искат да живеят благочестиво в Христос Иисус, ще бъдат гонени."},
	{13, "13 А злите хора и измамници ще напредват към по-лошо, като мамят и бъдат мамени."},
	{14, "14 Но ти постоянствай в това, което си научил и в което си се убедил, като знаеш от кого си го научил"},
	{15, "15 и че от детинство знаеш Свещените Писания, които имат сила да те направят мъдър за спасение чрез вяра в Христос Иисус."},
	{16, "16 Цялото Писание е боговдъхновено и полезно за поука, за изобличение, за поправяне, за наставление в правдата;"},
	{17, "17 за да бъде Божият човек усъвършенстван, съвършено подготвен за всяко добро дело."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 Тържествено ти заръчвам пред Бога и пред Христос Иисус, който ще съди живи и мъртви съобразно Своето явяване и царството Си:"},
	{2, "2 проповядвай словото, бъди готов в подходящо и неподходящо време, изобличавай, порицавай, увещавай с голямо търпение и поучаване."},
	{3, "3 Защото ще дойде време, когато няма да търпят здравото учение, а ще си натрупат учители по своите страсти, за да им гъделичкат ушите,"},
	{4, "4 и като отвърнат ушите си от истината, ще се обърнат към басните."},
	{5, "5 Но ти бъди трезв във всичко, понасяй страдания, върши работата на благовестител, изпълни докрай службата си."},
	{6, "6 Защото аз вече ставам възлияние и времето на отиването ми наближи."},
	{7, "7 Аз се борих в добрата борба, пътя свърших, вярата опазих;"},
	{8, "8 отсега нататък за мен се пази венецът на правдата, с който Господ, праведният Съдия, ще ме възнагради в онзи Ден; и не само мен, но и всички, които са възлюбили Неговото явяване."},
	{9, "9 Побързай да дойдеш скоро при мен,"},
	{10, "10 защото Димас ме остави, като възлюби сегашния свят и отиде в Солун, Крискент – в Галатия, а Тит – в Далмация."},
	{11, "11 Само Лука е при мен. Вземи Марк и го доведи със себе си, защото ми е полезен в служението."},
	{12, "12 А Тихик изпратих в Ефес."},
	{13, "13 Когато дойдеш, донеси наметалото, което оставих в Троада при Карп, и книгите, а особено пергаментите."},
	{14, "14 Ковачът Александър ми стори много зло; Господ ще му върне според делата му;"},
	{15, "15 и ти се пази от него, защото той много се противопостави на нашите думи."},
	{16, "16 При първата ми защита никой не взе моята страна, а всички ме изоставиха; дано не им се счете за грях."},
	{17, "17 Но Господ беше с мен и ме укрепи, за да се оповести напълно посланието чрез мен и да чуят всички езичници; и аз бях избавен от лъвови уста."},
	{18, "18 И Господ ще ме избави от всяко зло дело и ще ме спаси и въведе в Небесното Си царство, на когото да бъде слава за вечни векове. Амин."},
	{19, "19 Поздрави Прискила и Акила и дома на Онисифор."},
	{20, "20 Ераст остана в Коринт, а Трофим оставих болен в Милит."},
	{21, "21 Бързай да дойдеш преди зимата. Поздравяват те Евул, Пуд, Лин, Клавдия и всичките братя."},
	{22, "22 Господ Иисус Христос да бъде с твоя дух. Благодат да бъде с вас. (Амин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};