#include <map>
#include <string>
class Bible37
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Във втората година на цар Дарий, в шестия месец, на първия ден от месеца, ГОСПОДНОТО слово беше чрез пророк Агей към управителя на Юда Зоровавел, сина на Салатиил, и към първосвещеника Иисус, сина на Йоседек, и каза:"},
	{2, "2 Така говори ГОСПОД на Войнствата и казва: Този народ казва: Не е дошло времето, времето да се построи ГОСПОДНИЯТ дом."},
	{3, "3 И ГОСПОДНОТО слово беше чрез пророк Агей и каза:"},
	{4, "4 Време ли е за самите вас да живеете в своитЕ обковани с дъски къщи, докато този дом пустее?"},
	{5, "5 И сега, така казва ГОСПОД на Войнствата: Внимавайте в пътищата си!"},
	{6, "6 Посяхте много, но събрахте малко; ядете, но не се насищате; пиете, но не се напивате; обличате се, но не се стопляте; и надничарят получава надницата си в пробита кесия."},
	{7, "7 Така казва ГОСПОД на Войнствата: Внимавайте в пътищата си!"},
	{8, "8 Изкачете се на планината и докарайте дървета, и постройте дома; и Аз ще благоволя в него и ще се прославя, казва ГОСПОД."},
	{9, "9 Оглеждахте се за много, а ето, стана малко и когато го донесохте у дома, Аз духнах на него. Заради какво? — заявява ГОСПОД на Войнствата. — Заради Моя дом, който пустее, а вие тичате всеки за дома си."},
	{10, "10 Затова, заради вас небето задържа росата и земята задържа добива си."},
	{11, "11 И Аз повиках суша над земята и над горите, и над житото, и над младото вино, и над маслиненото масло, и над всичко, което произвежда земята, и над човек, и над животно, и над всеки труд на човешките ръце."},
	{12, "12 И Зоровавел, синът на Салатиил, и първосвещеникът Иисус, синът на Йоседек, и целият остатък от народа послушаха гласа на ГОСПОДА, своя Бог, и думите на пророк Агей, както го беше изпратил ГОСПОД, техният Бог; и народът се убоя пред ГОСПОДА."},
	{13, "13 И Агей, ГОСПОДНИЯТ пратеник, говори на народа съгласно ГОСПОДНОТО послание, и каза: Аз съм с вас, заявява ГОСПОД."},
	{14, "14 И ГОСПОД подбуди духа на управителя на Юда Зоровавел, сина на Салатиил, и духа на първосвещеника Иисус, сина на Йоседек, и духа на целия остатък от народа и те дойдоха и се заеха с работата в дома на ГОСПОДА на Войнствата, своя Бог,"},
	{15, "15 на двадесет и четвъртия ден от шестия месец, във втората година на цар Дарий."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 В седмия месец, на двадесет и първия ден от месеца, ГОСПОДНОТО слово беше чрез пророк Агей и каза:"},
	{2, "2 Говори сега на управителя на Юда Зоровавел, сина на Салатиил, и на първосвещеника Иисус, сина на Йоседек, и на остатъка от народа, и кажи:"},
	{3, "3 Кой остана между вас, който е видял този дом в първата му слава? А какъв го виждате сега? Не е ли такъв дом като нищо в очите ви?"},
	{4, "4 Но сега, бъди силен, Зоровавеле, заявява ГОСПОД; и бъди силен, ти първосвещенико, Иисусе, сине на Йоседек; и бъдете силни, цели народе на земята, заявява ГОСПОД, и работете, защото Аз съм с вас, заявява ГОСПОД на Войнствата."},
	{5, "5 Според словото на завета Ми с вас, когато излязохте от Египет, Духът Ми ще стои между вас; не бойте се!"},
	{6, "6 Защото така казва ГОСПОД на Войнствата: Още веднъж, след малко, и Аз ще разтърся небесата и земята, и морето, и сушата."},
	{7, "7 И ще разтърся всичките народи и скъпоценните неща на всичките народи ще дойдат, и Аз ще изпълня този дом със слава, казва ГОСПОД на Войнствата."},
	{8, "8 Мое е среброто и Мое е златото, заявява ГОСПОД на Войнствата."},
	{9, "9 Последната слава на този дом ще бъде по-голяма от първата, заявява ГОСПОД на Войнствата, и на това място ще дам мир, казва ГОСПОД на Войнствата."},
	{10, "10 На двадесет и четвъртия ден от деветия месец, във втората година на Дарий, ГОСПОДНОТО слово беше към пророк Агей и каза:"},
	{11, "11 Така казва ГОСПОД на Войнствата: Попитай сега свещениците за закона, като кажеш:"},
	{12, "12 Ако носи някой осветено месо в полата на дрехата си, и с полата допре хляб или вариво, или вино, или маслинено масло, или каквото и да било ястие, то ще се освети ли? И свещениците отговориха и казаха: Не."},
	{13, "13 И Агей каза: Ако някой нечист от мъртво тяло се допре до някое от тези, то ще стане ли нечисто? И свещениците отговориха и казаха: Ще стане нечисто."},
	{14, "14 И Агей отговори и каза: Така е този народ и така е тази нация пред Мен, заявява ГОСПОД. Така е и всяко дело на ръцете им, и каквото принасят там е нечисто."},
	{15, "15 И сега, внимавайте от този ден и нататък, преди да е положен камък върху камък в ГОСПОДНИЯ храм!"},
	{16, "16 Преди това, когато някой отидеше при житен куп от двадесет мери, бяха десет; когато отидеше при лина да източи петдесет мери, бяха двадесет."},
	{17, "17 Поразих ви с главня и мана, и с градушка във всичките дела на ръцете ви, но вие не се обърнахте към Мен, заявява ГОСПОД."},
	{18, "18 Но сега, внимавайте от този ден и нататък — от двадесет и четвъртия ден на деветия месец, от деня, когато се положи основата на ГОСПОДНИЯ храм — внимавайте!"},
	{19, "19 Семето още ли е в житницата? Дори лозата, смокинята, нарът и маслиновото дърво още не са родили. От този ден ще ви благословя."},
	{20, "20 И ГОСПОДНОТО слово беше втори път към Агей на двадесет и четвъртия ден от месеца и каза:"},
	{21, "21 Говори на управителя на Юда Зоровавел и кажи: Аз ще разтърся небето и земята."},
	{22, "22 Ще преобърна престола на царствата и ще унищожа силата на царствата на народите; и ще преобърна колесниците и ездачите им; и конете и ездачите им ще паднат, всеки от меча на брат си."},
	{23, "23 В онзи ден, заявява ГОСПОД на Войнствата, ще те взема, Зоровавеле, сине на Салатиил, служителю Мой, заявява ГОСПОД, и ще те положа като печат, защото теб избрах, заявява ГОСПОД на Войнствата."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};