#include <map>
#include <string>
class Bible66
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
	struct bg4	{ int val; const char *msg; };
	struct bg5	{ int val; const char *msg; };
	struct bg6	{ int val; const char *msg; };
	struct bg7	{ int val; const char *msg; };
	struct bg8	{ int val; const char *msg; };
	struct bg9	{ int val; const char *msg; };
	struct bg10	{ int val; const char *msg; };
	struct bg11	{ int val; const char *msg; };
	struct bg12	{ int val; const char *msg; };
	struct bg13	{ int val; const char *msg; };
	struct bg14	{ int val; const char *msg; };
	struct bg15	{ int val; const char *msg; };
	struct bg16	{ int val; const char *msg; };
	struct bg17	{ int val; const char *msg; };
	struct bg18	{ int val; const char *msg; };
	struct bg19	{ int val; const char *msg; };
	struct bg20	{ int val; const char *msg; };
	struct bg21	{ int val; const char *msg; };
	struct bg22	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Откровението на Иисус Христос, което Му даде Бог, за да покаже на слугите Си онова, което скоро трябва да стане, и изпрати и го извести чрез ангела Си на Своя слуга Йоан,"},
	{2, "2 който засвидетелства Божието слово и свидетелството на Иисус Христос, и всичко, което е видял."},
	{3, "3 Блажен този, който чете, и онези, които слушат думите на това пророчество и пазят написаното в него, защото времето е близо."},
	{4, "4 Йоан до седемте църкви, които са в Азия: Благодат и мир да бъде на вас от Онзи, който е и който е бил, и който идва, и от седемте Духове, които са пред Неговия престол,"},
	{5, "5 и от Иисус Христос, верния Свидетел, Първородния на мъртвите и Началника на земните царе. На Този, който ни люби и ни е освободил от нашите грехове чрез кръвта Си,"},
	{6, "6 и който ни е направил царство и свещеници на Своя Бог и Отец, на Него да бъде слава и господство за вечни векове! Амин."},
	{7, "7 Ето, идва с облаците; и ще Го види всяко око, и онези, които Го прободоха; и всички земни племена ще заридаят заради Него. Да, амин."},
	{8, "8 Аз съм Алфа и Омега, (Началото и Краят) – казва Господ Бог, който е и който е бил, и който идва, Всемогъщият."},
	{9, "9 Аз, Йоан, ваш брат и участник заедно с вас в скръбта и в царството, и в търпението, които са в Иисус (Христос), бях на острова, наречен Патмос, заради Божието слово и свидетелството на Иисус (Христос)."},
	{10, "10 В Господния Ден бях в Духа и чух зад себе си силен глас като от тръба,"},
	{11, "11 който казваше: Това, което виждаш, напиши на книга и го изпрати до седемте църкви: до Ефес и до Смирна, и до Пергам, и до Тиатир, и до Сардис, и до Филаделфия, и до Лаодикия."},
	{12, "12 И се обърнах да видя гласа, който ми говореше. И като се обърнах, видях седем златни светилника"},
	{13, "13 и по средата на седемте светилника – Един, като Човешкия Син, облечен с дълга до петите дреха и препасан със златен пояс около гърдите."},
	{14, "14 А главата и косата Му бяха бели като бяла вълна, като сняг, и очите Му – като огнен пламък,"},
	{15, "15 и краката Му – като лъскав бронз, нажежен в пещ, а гласът Му – като звук от много води."},
	{16, "16 И в дясната Си ръка имаше седем звезди, и от устата Му излизаше меч, остър и от двете страни, и лицето Му светеше, както свети слънцето в силата си."},
	{17, "17 И когато Го видях, паднах при краката Му като мъртъв; а Той сложи дясната Си ръка върху мен и каза: Не се бой, Аз съм Първият и Последният, и Живият;"},
	{18, "18 и бях мъртъв, и ето, живея за вечни векове; и имам ключовете на смъртта и на ада."},
	{19, "19 Напиши това, което си видял, и това, което е, и това, което ще бъде след това."},
	{20, "20 Тайната на седемте звезди, които видя в дясната Ми ръка, и на седемте златни светилника: седемте звезди са ангелите на седемте църкви, а седемте светилника са седемте църкви."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 До ангела на ефеската църква пиши: Това казва Онзи, който държи седемте звезди в дясната Си ръка, който ходи сред седемте златни светилника:"},
	{2, "2 Зная твоите дела, твоя труд и твоето търпение, и че не можеш да търпиш злите хора; и си изпитал онези, които наричат себе си апостоли, а не са, и си ги намерил лъжливи;"},
	{3, "3 и имаш търпение и за Моето Име си издържал, и не си се уморил."},
	{4, "4 Но имам това против теб, че си оставил първата си любов."},
	{5, "5 И така, спомни си откъде си паднал и се покай, и върши първите си дела; ако ли не, ще дойда при теб (скоро) и ще отместя светилника ти от мястото му, ако не се покаеш."},
	{6, "6 Но имаш това, че мразиш делата на николаитите, които и Аз мразя."},
	{7, "7 Който има ухо, нека слуша какво казва Духът на църквите! На този, който победи, ще дам да яде от дървото на живота, което е (сред) Божия рай."},
	{8, "8 До ангела на смирненската църква пиши: Това казва Първият и Последният, който беше мъртъв и оживя:"},
	{9, "9 Зная твоите дела, скръб и бедност – но ти пак си богат – и как те хулят онези, които наричат себе си юдеи, а не са, а са сатанинска синагога."},
	{10, "10 Не се страхувай от това, което ще пострадаш. Ето, дяволът скоро ще хвърли някои от вас в тъмница, за да бъдете изпитани, и ще имате скръб десет дни. Бъди верен до смърт, и Аз ще ти дам венеца на живота."},
	{11, "11 Който има ухо, нека слуша какво казва Духът на църквите! Който победи, няма да бъде повреден от втората смърт."},
	{12, "12 До ангела на пергамската църква пиши: Това казва Този, който има острия от двете страни меч:"},
	{13, "13 Зная къде живееш – там, където е престолът на Сатана, и държиш здраво Името Ми, и не си се отрекъл от Моята вяра даже в дните на Моя верен свидетел Антипа, когото убиха между вас, където живее Сатана."},
	{14, "14 Но имам малко против теб, защото имаш там някои, които държат учението на Валаам, който учеше Валак да постави примка пред израилевите синове, за да ядат идоложертвено и да блудстват."},
	{15, "15 Така също и ти имаш някои, които държат учението на николаитите, което мразя."},
	{16, "16 Покай се! Ако ли не, ще дойда при теб скоро и ще воювам против тях с меча, който излиза от устата Ми."},
	{17, "17 Който има ухо, нека слуша какво казва Духът на църквите! На този, който победи, ще дам да яде от скритата манна; ще му дам и бяло камъче, и на камъчето написано ново име, което никой не познава освен този, който го получава."},
	{18, "18 До ангела на тиатирската църква пиши: Това казва Божият Син, който има очи като огнен пламък и чиито крака приличат на лъскав бронз:"},
	{19, "19 Зная твоите дела и любовта, и вярата, и служението, и твоето търпение, и че последните ти дела са повече от първите."},
	{20, "20 Но имам против теб това, че търпиш жената Езавел, която нарича себе си пророчица и учи и прилъгва Моите слуги да блудстват и да ядат идоложертвено."},
	{21, "21 И Аз й дадох време да се покае за блудството си, но тя не се покая."},
	{22, "22 Ето, Аз скоро ще я тръшна на легло; и онези, които прелюбодействат с нея, ще хвърля в голяма скръб, освен ако не се покаят от нейните дела;"},
	{23, "23 и децата й ще убия с мор. И всичките църкви ще познаят, че Аз съм Този, който изпитвам вътрешностите и сърцата; и ще дам на всеки от вас според делата му."},
	{24, "24 А казвам на вас, останалите в Тиатир, които не държат това учение и които не са познали дълбочините на Сатана, както казват: няма да наложа на вас друг товар,"},
	{25, "25 но дръжте онова, което имате, докато дойда."},
	{26, "26 А на този, който победи и който пази Моите дела докрай, ще дам власт над нациите;"},
	{27, "27 ?и ще ги пасе с желязна тояга и те ще се строшат като грънчарски съдове“, както и Аз получих от Своя Отец."},
	{28, "28 И ще му дам зорницата."},
	{29, "29 Който има ухо, нека слуша какво казва Духът на църквите!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 До ангела на сардикийската църква пиши: Това казва Онзи, който има седемте Божии Духове и седемте звезди: Зная твоите дела, че на име си жив, а всъщност си мъртъв."},
	{2, "2 Събуди се и укрепи останалото, което е близо до умиране; защото не намерих твоите дела съвършени пред Моя Бог."},
	{3, "3 Затова помни как си приел и чул, и го пази, и се покай! И така, ако не бодърстваш, ще дойда като крадец и няма да знаеш в кой час ще дойда върху теб."},
	{4, "4 Но имаш няколко души в Сардис, които не са осквернили дрехите си и ще ходят с Мен в бяло, защото са достойни."},
	{5, "5 Който победи, ще се облече така в бели дрехи и Аз никога няма да излича името му от книгата на живота, а ще изповядам името му пред Моя Отец и пред Неговите ангели."},
	{6, "6 Който има ухо, нека слуша какво казва Духът на църквите!"},
	{7, "7 До ангела на филаделфийската църква пиши: Това казва Светият, Истинният, у когото е Давидовият ключ; който отваря, и никой няма да затваря; и затваря, и никой няма да отваря:"},
	{8, "8 Зная твоите дела. Ето, поставих пред теб отворена врата, която никой не може да затвори, защото ти имаш малко сила, и пак си опазил Моето слово и не си се отрекъл от Моето Име."},
	{9, "9 Ето, давам ти от сатанинската синагога онези, които наричат себе си юдеи, но не са, а лъжат; ето, ще ги накарам да дойдат и да се поклонят пред твоите крака, и да познаят, че Аз те възлюбих."},
	{10, "10 Понеже си опазил словото на Моето търпение, и Аз ще те опазя от часа на изпитанието, което ще дойде върху цялата вселена, за да изпита земните жители."},
	{11, "11 (Ето), идвам скоро; дръж здраво то??а, което имаш, за да не ти отнеме никой венеца."},
	{12, "12 Който победи, ще го нап??авя стълб в храма на Моя Бог и той няма вече да излезе вън; и ще напиша на него Името на Моя Бог и името на града на Моя Бог, новия Ерусалим, който слиза от небето от Моя Бог; ще напиша и Моето ново Име."},
	{13, "13 Който има ухо, нека слуша какво казва Духът на църквите!"},
	{14, "14 До ангела на лаодикийската църква пиши: Това казва Амин, верният и истинен Свидетел, Началото на Божието творение:"},
	{15, "15 Зная твоите дела, че не си нито студен, нито горещ. О, да беше или студен, или горещ!"},
	{16, "16 А така, понеже си хладък – нито студен, нито горещ – ще те изплюя от устата Си."},
	{17, "17 Понеже казваш: Богат съм, забогатях и нямам нужда от нищо, а не знаеш, че си окаян, нещастен, беден, сляп и гол;"},
	{18, "18 то съветвам те да си купиш от Мен злато, пречистено през огън, за да забогатееш; и бели дрехи, за да се облечеш и да не стане явен срамът на твоята голота; и очен мехлем да помажеш очите си, за да виждаш."},
	{19, "19 Онези, които любя, Аз ги изобличавам и наказвам; затова бъди ревностен и се покай!"},
	{20, "20 Ето, стоя на вратата и чукам; ако някой чуе гласа Ми и отвори вратата, ще вляза при него и ще вечерям с него, и той – с Мен."},
	{21, "21 На този, който победи, ще дам да седне с Мен на Моя престол, както и Аз победих и седнах със Своя Отец на Неговия престол."},
	{22, "22 Който има ухо, нека слуша какво казва Духът на църквите!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct bg4 poems[] = {
	{1, "1 След това погледнах, и ето, врата, отворена в небето; и първият глас, който бях чул да говори с мен като тръба, каза: Ела тук, горе, и ще ти покажа това, което трябва да стане след това."},
	{2, "2 И аз веднага бях в Духа, и ето, на небето стоеше престол и на престола седеше Един."},
	{3, "3 И Седналият изглеждаше на вид като камък яспис и сардис и около престола имаше дъга на вид като смарагд."},
	{4, "4 И около престола имаше двадесет и четири престола и на престолите седяха двадесет и четирима старейшини облечени в бели дрехи, и имаха на главите си златни венци."},
	{5, "5 И от престола излизаха светкавици и гърмежи, и гласове. И пред престола горяха седем огнени светила, които са седемте Божии Духове."},
	{6, "6 И пред престола имаше като стъклено море, подобно на кристал, а сред престола и около него – четири живи същества, пълни с очи и отпред, и отзад."},
	{7, "7 Първото живо същество приличаше на лъв, второто живо същество приличаше на теле, третото живо същество имаше лице като на човек и четвъртото живо същество приличаше на летящ орел."},
	{8, "8 И четирите живи същества, всяко едно от тях, имаха по шест крила; и наоколо, и отвътре бяха пълни с очи. И ден и нощ те не престават да казват: Свят, свят, свят е Господ Бог Всемогъщ, който е бил, който е, и който идва."},
	{9, "9 И когато живите същества принасят слава, почит и благодарение на Седящия на престола, който живее за вечни векове,"},
	{10, "10 двадесет и четиримата старейшини падат пред Седящия на престола и се кланят на Онзи, който живее за вечни векове, и хвърлят венците си пред престола, като казват:"},
	{11, "11 Достоен си, Господи и Боже наш, да приемеш славата, почитта и властта, защото Ти си създал всичко и заради Твоята воля всичко е съществувало и е било създадено."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct bg5 poems[] = {
	{1, "1 И видях в дясната ръка на Седящия на престола книга, написана отвътре и отзад, запечатана със седем печата."},
	{2, "2 И видях един силен ангел, който прогласяваше на висок глас: Кой е достоен да отвори книгата и разпечата печатите й?"},
	{3, "3 И никой – нито на небето, нито на земята, нито под земята – не можеше да отвори книгата, нито да я гледа."},
	{4, "4 И аз плаках много, защото никой не се намери достоен да отвори книгата, нито да я гледа."},
	{5, "5 Но един от старейшините ми каза: Не плачи; ето, Лъвът, който е от юдовото племе, Давидовият корен, Той победи, за да отвори книгата и да разпечата нейните седем печата."},
	{6, "6 И видях сред престола и четирите живи същества, и сред старейшините, че стоеше Агне, като заклано, което имаше седем рога и седем очи, които са седемте Божии Духове, разпратени по цялата земя."},
	{7, "7 И То дойде и взе книгата от дясната ръка на Седящия на престола."},
	{8, "8 И когато взе книгата, четирите живи същества и двадесет и четиримата старейшини паднаха пред Агнето, като всеки държеше арфа и златни чаши, пълни с тамян, които са молитвите на светиите."},
	{9, "9 И пееха нова песен, като казваха: Ти си достоен да вземеш книгата и да отвориш печатите й, защото си бил заклан и със Своята кръв си изкупил за Бога хора от всяко племе, език, народ и нация,"},
	{10, "10 и си ги направил царство и свещеници на нашия Бог; и те ще царуват над земята."},
	{11, "11 И видях и чух глас от много ангели около престола и живите същества и старейшините; и броят им беше десетки хиляди по десетки хиляди и хиляди по хиляди;"},
	{12, "12 и казваха с висок глас: Достойно е Агнето, което е било заклано, да приеме власт и богатство, и мъдрост, и сила, и почит, и слава, и благословение."},
	{13, "13 И всяко създание, което е на небето, на земята и под земята, и по морето, и всичко, което е в тях, чух да казва: На Седящия на престола и на Агнето да бъде благословение и почит, и слава, и господство за вечни векове!"},
	{14, "14 И четирите живи същества казаха: Амин! И старейшините паднаха и се поклониха."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct bg6 poems[] = {
	{1, "1 И видях, когато Агнето отвори един от седемте печата, и чух едно от четирите живи същества да казва като с глас от гръм: Ела (и виж)!"},
	{2, "2 И видях, и ето, бял кон; и яздещият на него имаше лък; и му се даде венец и той излезе побеждавайки и за да победи."},
	{3, "3 И когато отвори втория печат, чух второто живо същество да казва: Ела (и виж)!"},
	{4, "4 И излезе друг кон, червен; и на яздещия на него се даде да вдигне мира от земята, така че хората да се избият един друг; и му се даде голям меч."},
	{5, "5 И когато отвори третия печат, чух третото живо същество да казва: Ела (и виж)! И видях, и ето, черен кон; и яздещият на него имаше везни в ръката си."},
	{6, "6 И от средата на четирите живи същества чух като глас, който казваше: Един хиникс пшеница за един динарий и три хиникса ечемик за един динарий; и не повреждай маслиненото масло и виното."},
	{7, "7 И когато отвори четвъртия печат, чух гласа на четвъртото живо същество, което казваше: Ела (и виж)!"},
	{8, "8 И видях, и ето, блед кон и името на яздещия на него беше смърт, и адът го следваше. И даде им се власт над четвъртата част от земята, за да убиват с меч, с глад, с мор и със земните зверове."},
	{9, "9 И когато отвори петия печат, видях под олтара душите на онези, които са били заклани за Божието слово и за свидетелството, което държаха."},
	{10, "10 И те викаха с висок глас и казваха: Докога, Владетелю свети и истинни, няма да съдиш и отмъстиш за нашата кръв на земните жители?"},
	{11, "11 И на всеки от тях се даде по една бяла дреха и им се каза, че трябва да почиват още малко време, докато се изпълни числото на техните съслужители и братя, които щяха да бъдат убити като тях."},
	{12, "12 И видях, когато отвори шестия печат; и ето, стана голямо земетресение; слънцето почерня като козяк и цялата луна стана като кръв;"},
	{13, "13 небесните звезди паднаха на земята, както когато смокинята, разклащана от силен вятър, хвърля късните си смокини;"},
	{14, "14 небето изчезна като свитък, когато се навива; и всички планини и острови се отместиха от местата си."},
	{15, "15 И земните царе, големците и военачалниците, богатите и силните, всеки роб и свободен се скриха в пещерите и в скалите на планините;"},
	{16, "16 и казаха на планините и на скалите: Паднете върху нас и ни скрийте от лицето на Седящия на престола и от гнева на Агнето,"},
	{17, "17 защото е дошъл великият ден на Неговия гняв, и кой може да устои?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct bg7 poems[] = {
	{1, "1 След това видях четири ангела, стоящи на четирите ъгъла на земята и държащи четирите земни ветрища, за да не духа никакъв вятър нито по земята, нито по морето, нито върху някое дърво."},
	{2, "2 И видях друг ангел да се издига от изгрев-слънце, у когото беше печатът на живия Бог; и той извика с висок глас на четирите ангела, на които беше дадено да повредят земята и морето, и каза:"},
	{3, "3 Не повреждайте земята, нито морето, нито дърветата, преди да ударим печат върху челата на слугите на нашия Бог."},
	{4, "4 И чух броя на подпечатаните – сто четиридесет и четири хиляди подпечатани от всичките племена на израилевите синове:"},
	{5, "5 от юдовото племе – дванадесет хиляди подпечатани; от рувимовото племе – дванадесет хиляди; от гадовото племе – дванадесет хиляди;"},
	{6, "6 от асировото племе – дванадесет хиляди; от нефталимовото племе – дванадесет хиляди; от манасиевото племе – дванадесет хиляди;"},
	{7, "7 от симеоновото племе – дванадесет хиляди; от левиевото племе – дванадесет хиляди; от исахаровото племе – дванадесет хиляди;"},
	{8, "8 от завулоновото племе – дванадесет хиляди; от йосифовото племе – дванадесет хиляди; от вениаминовото племе – дванадесет хиляди подпечатани."},
	{9, "9 След това видях, и ето, голямо множество, което никой не можеше да изброи, от всяка нация и от всички племена, народи и езици, стояха пред престола и пред Агнето, облечени в бели дрехи, с палмови клони в ръцете си,"},
	{10, "10 и викаха с висок глас, казвайки: Спасение на нашия Бог, който седи на престола, и на Агнето!"},
	{11, "11 И всичките ангели стояха около престола и старейшините, и четирите живи същества; и паднаха на лицата си пред престола и се поклониха на Бога, и казаха:"},
	{12, "12 Амин! Благословение и слава, и мъдрост, и благодарение, и почит, и сила, и могъщество на нашия Бог за вечни векове! Амин."},
	{13, "13 Тогава един от старейшините проговори, като ми каза: Тези, облечените в бели дрехи, кои са и откъде са дошли?"},
	{14, "14 И аз му казах: Господине, ти знаеш. А той ми каза: Това са онези, които идват от голямата скръб; и са изпрали дрехите си и са ги избелили в кръвта на Агнето."},
	{15, "15 Затова са пред престола на Бога и Му служат денем и нощем в Неговия храм, и Седящият на престола ще разпростре скинията си върху тях."},
	{16, "16 Няма да огладнеят вече, нито да ожаднеят вече, нито ще ги удари слънцето, нито някой пек,"},
	{17, "17 защото Агнето, което е по средата на престола, ще ги пасе и ще ги заведе при извори на водите на живота, и Бог ще избърше всяка сълза от очите им."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct bg8 poems[] = {
	{1, "1 И когато отвори седмия печат, настана мълчание на небето за около половин час."},
	{2, "2 И видях седемте ангела, които стояха пред Бога, и им се дадоха седем тръби."},
	{3, "3 И дойде друг ангел и застана пред олтара, държейки златна кадилница; и на него се даде много тамян, за да го прибави към молитвите на всичките светии върху златния олтар, който беше пред престола."},
	{4, "4 И димът от тамяна заедно с молитвите на светиите се издигна от ръката на ангела пред Бога."},
	{5, "5 И ангелът взе кадилницата, напълни я с огън от олтара и я хвърли на земята; и настанаха гръмове и гласове, и светкавици, и земетресение."},
	{6, "6 И седемте ангела, които държаха седемте тръби, се приготвиха да затръбят."},
	{7, "7 И затръби първият ангел; и дойде град и огън, размесени с кръв, и бяха хвърлени на земята; и третата част от земята изгоря и третата част от дърветата изгоря, изгоря и всяка зелена трева."},
	{8, "8 И затръби вторият ангел; и нещо като голяма планина, пламнала в огън, беше хвърлена в морето; и третата част от морето стана кръв"},
	{9, "9 и третата част от одушевените същества, които бяха в морето, измря, и третата част от корабите беше унищожена."},
	{10, "10 И затръби третият ангел; и падна от небето голяма звезда, която гореше като факла; и падна върху третата част от реките и върху водните извори."},
	{11, "11 А името на звездата е Пелин, и третата част от водите стана пелин; и много хора измряха от водите, защото те станаха горчиви."},
	{12, "12 И затръби четвъртият ангел; и третата част от слънцето и третата част от луната, и третата част от звездите беше поразена, така че да потъмнее третата част от тях; и третата част от деня да не свети, както и от нощта."},
	{13, "13 И видях и чух един орел, който летеше посред небето и казваше с висок глас: Горко, горко, горко на земните жители поради останалите тръбни гласове от тримата ангели, които още има да затръбят!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct bg9 poems[] = {
	{1, "1 И затръби петият ангел; и видях една звезда, паднала от небето на земята, на която се даде ключа от кладенеца на бездната."},
	{2, "2 И тя отвори кладенеца на бездната и от кладенеца се издигна дим като дим от голяма пещ; и слънцето и въздухът потъмняха от дима на кладенеца."},
	{3, "3 И от дима излязоха скакалци по земята; и им се даде власт, като властта, която имат земните скорпиони."},
	{4, "4 И им се каза да не повреждат тревата по земята, нито някое зелено растение, нито някое дърво, а само такива хора, които нямат Божия печат на челата си."},
	{5, "5 И им се даде да не ги убиват, а да ги мъчат пет месеца; и мъчението им беше като мъчение от скорпион, когато ужили човек."},
	{6, "6 През онези дни хората ще потърсят смъртта, но няма да я намерят; и ще пожелаят да умрат, но смъртта ще побегне от тях."},
	{7, "7 И на вид скакалците приличаха на коне, приготвени за война, и на главите си имаха нещо подобно на венци като злато, и лицата им бяха като човешки лица."},
	{8, "8 И имаха коса като косата на жените и зъбите им бяха като зъби на лъв."},
	{9, "9 И имаха нагръдници като нагръдници от желязо и шумът на крилата им беше като шум от колесници с много коне, когато тичат на бой."},
	{10, "10 Имаха и опашки като скорпиони и жилата им бяха в опашките им; и имаха власт да повреждат хората пет месеца."},
	{11, "11 И имаха над себе си цар – ангела на бездната, който на еврейски се нарича Авадон, а на гръцки името му е Аполион."},
	{12, "12 Едното горко мина, но ето, още две горки идват след това."},
	{13, "13 И затръби шестият ангел; и чух един глас от четирите рога на златния олтар, който беше пред Бога,"},
	{14, "14 който казваше на шестия ангел, който държеше тръбата: Развържи четирите ангела, които са вързани при голямата река Ефрат."},
	{15, "15 И четирите ангела, които бяха приготвени за този час и ден, и месец, и година, се развързаха, за да убият третата част от хората."},
	{16, "16 И числото на конните войски беше два пъти по десет хиляди по десет хиляди; и аз чух числото им."},
	{17, "17 И така видях във видението конете и яздещите на тях: те носеха нагръдници като от огън, яцинт и сяра; и главите на конете бяха като глави на лъвове и от устата им излизаше огън, дим и сяра."},
	{18, "18 От тези три язви – от огъня, от дима и от сярата, които излизаха от устата им – беше избита третата част от хората."},
	{19, "19 Защото властта на конете е в устата им и в опашките им; понеже опашките им приличат на змии и имат глави, и с тях повреждат."},
	{20, "20 А останалите хора, които не бяха избити от тези язви, не се покаяха от делата на ръцете си, да не се кланят на демони и на златни, сребърни, бронзови, каменни и дървени идоли, които не могат нито да виждат, нито да чуват, нито да ходят;"},
	{21, "21 и не се покаяха от убийствата си, нито от чародействата си, нито от блудствата си, нито от кражбите си."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct bg10 poems[] = {
	{1, "1 И видях друг силен ангел, който слизаше от небето облечен в облак и над главата му имаше дъга, лицето му беше като слънцето и краката му – като огнени стълбове."},
	{2, "2 И в ръката си държеше отворена книжка. И той сложи десния си крак на морето, а левия – на земята"},
	{3, "3 и извика със силен глас, както реве лъв. И когато извика, седемте гърма проговориха със своите гласове."},
	{4, "4 И след като седемте гърма проговориха, аз щях да пиша, но чух глас от небето, който каза: Запечатай това, което изговориха седемте гърма, и не го пиши."},
	{5, "5 И ангелът, когото видях да стои на морето и на земята, издигна дясната си ръка към небето"},
	{6, "6 и се закле в Този, който живее за вечни векове, който е създал небето и това, което е в него; земята и това, което е на нея; и морето и това, което е в него, че няма вече да има бавене,"},
	{7, "7 но че в дните на гласа на седмия ангел, когато той се приготви да затръби, тогава ще се изпълни тайната на Бога, както Той е благовестил на Своите слуги, пророците."},
	{8, "8 И гласът, който чух от небето, пак заговори с мен и каза: Иди, вземи отворената книжка, която е в ръката на ангела, който стои на морето и на земята."},
	{9, "9 И аз отидох при ангела и му казах да ми даде книжката. И той ми каза: Вземи и я изяж; и в корема ти ще стане горчиво, но в устата ти ще бъде сладка като мед."},
	{10, "10 И така, взех книжката от ръката на ангела и я изядох. И в устата ми беше сладка като мед, но като я изядох, коремът ми се вгорчи."},
	{11, "11 Тогава ми се каза: Трябва пак да пророкуваш за много народи и нации, и езици, и царе."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct bg11 poems[] = {
	{1, "1 И даде ми се тръстика като тояга и ми се каза: Стани и измери Божия храм и олтара, и онези, които се кланят в него;"},
	{2, "2 но двора, който е извън храма, остави и не го измервай, защото той се даде на нациите, които ще тъпчат светия град четиридесет и два месеца."},
	{3, "3 А на двамата си свидетели ще дам да пророкуват хиляда двеста и шестдесет дни облечени във вретища."},
	{4, "4 Те са двете маслинени дървета и двата светилника, които стоят пред Господаря на земята."},
	{5, "5 И ако някой поиска да ги повреди, огън излиза от устата им и поглъща неприятелите им. И ако някой поиска да ги повреди, така той трябва да бъде убит."},
	{6, "6 Те имат власт да заключат небето, за да не вали никакъв дъжд през времето на тяхното пророкуване, и имат власт над водите, да ги превръщат в кръв и да поразяват земята с всяка язва, колкото пъти биха поискали."},
	{7, "7 И когато те свършат да свидетелстват, звярът, който излиза от бездната, ще воюва против тях, ще ги победи и ще ги убие."},
	{8, "8 И труповете им ще лежат на улицата на големия град, който духовно се нарича Содом и Египет, където беше разпънат и техният Господ."},
	{9, "9 И мнозина от народите, племената, езиците и нациите ще гледат труповете им три дни и половина и няма да позволят труповете им да бъдат положени в гроба."},
	{10, "10 И земните жители ще се зарадват за тях, ще се развеселят и един на друг ще си пратят подаръци, защото тези двама пророци са мъчили земните жители."},
	{11, "11 А след трите и половина дни в тях влезе дух на живот от Бога и те се изправиха на краката си; и голям страх обзе онези, които ги гледаха."},
	{12, "12 А те чуха силен глас от небето, който им казваше: Качете се тук. И те се изкачиха на небето в облак; и неприятелите им ги видяха."},
	{13, "13 И в онзи час стана голямо земетресение и десетата част от града падна; и в земетресението измряха седем хиляди човека; и останалите се уплашиха и отдадоха слава на небесния Бог."},
	{14, "14 Второто горко премина; ето, скоро идва третото горко."},
	{15, "15 И затръби седмият ангел; и на небето имаше силни гласове, които казваха: Световното царство стана царство на нашия Господ и на Неговия Христос, и Той ще царува за вечни векове."},
	{16, "16 И двадесет и четиримата старейшини, седящи пред Бога на престолите си, паднаха на лицата си и се поклониха на Бога, и казаха:"},
	{17, "17 Благодарим Ти, Господи Боже Всемогъщи, който си и който си бил, затова че си взел голямата Си власт и си се възцарил."},
	{18, "18 Нациите се разгневиха, и дойде Твоят гняв и времето да се съдят мъртвите и да дадеш наградата на Своите слуги, пророците, и на светиите, и на онези, които се боят от Твоето Име, малки и големи, и да унищожиш онези, които унищожават земята."},
	{19, "19 И Божият храм на небето се отвори, и в храма се видя ковчегът на Неговия завет; и настанаха светкавици и гласове, и гръмове, и земетресение, и силен град."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct bg12 poems[] = {
	{1, "1 И голямо знамение се яви на небето: жена, облечена със слънцето, с луната под краката й, и на главата й – корона от дванадесет звезди."},
	{2, "2 Тя беше бременна и викаше от родилни болки, като се мъчеше да роди."},
	{3, "3 И друго знамение се яви на небето: и ето, голям червен змей, който имаше седем глави и десет рога, и на главата му – седем корони."},
	{4, "4 И опашката му повлече третата част от небесните звезди и ги хвърли на земята. И змеят застана пред жената, която щеше да роди, за да погълне детето й, щом роди."},
	{5, "5 И тя роди син, мъжко дете, което щеше да пасе всичките народи с желязна тояга. И детето й беше грабнато и занесено при Бога и при Неговия престол."},
	{6, "6 И жената побягна в пустинята, където имаше място, приготвено от Бога, за да я хранят там хиляда двеста и шестдесет дни."},
	{7, "7 И стана война на небето: Михаил и неговите ангели воюваха против змея; и змеят воюва заедно със своите ангели,"},
	{8, "8 но те не надвиха и не се намери място за тях на небето."},
	{9, "9 И беше хвърлен големият змей, старовременната змия, наричан дявол и Сатана, който мами целия свят; хвърлен беше на земята и ангелите му бяха хвърлени заедно с него."},
	{10, "10 И чух силен глас на небето, който казваше: Сега дойде спасението, силата и царството на нашия Бог и властта на Неговия Христос, защото се хвърли долу обвинителят на нашите братя, който ги обвинява денем и нощем пред нашия Бог."},
	{11, "11 А те го победиха заради кръвта на Агнето и заради словото на тяхното свидетелство и не възлюбиха живота си дори до смърт."},
	{12, "12 Затова веселете се, небеса, и вие, които живеете в тях! Но горко на земята и морето, защото дяволът слезе при вас много разярен, понеже знае, че му остава малко време."},
	{13, "13 И когато змеят видя, че беше хвърлен на земята, той започна да преследва жената, която беше родила мъжкото дете."},
	{14, "14 И на жената се дадоха двете крила на големия орел, за да отлети до мястото си в пустинята – там, където я хранят за време и времена, и половин време, скрита от лицето на змията."},
	{15, "15 И змията изпусна от устата си вода като река след жената, за да направи да я завлече реката."},
	{16, "16 И земята помогна на жената, и земята отвори устата си и погълна реката, която змеят беше изпуснал от устата си."},
	{17, "17 Тогава змеят се разгневи срещу жената и отиде да воюва против останалите от нейното потомство, които пазят Божиите заповеди и държат свидетелството за Иисус. И застана на морския пясък."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct bg13 poems[] = {
	{1, "1 И видях звяр, който излизаше от морето и имаше седем глави и десет рога; и на роговете му – десет корони; и на главите му – богохулни имена."},
	{2, "2 И звярът, който видях, приличаше на леопард и краката му бяха като крака на мечка, устата му – като уста на лъв; и змеят му даде силата си, престола си и голяма власт."},
	{3, "3 И видях една от главите му, като че ли смъртно ранена, но смъртоносната му рана оздравя; и цялата земя се удивляваше след звяра;"},
	{4, "4 и се поклониха на змея, защото даде власт на звяра; и се поклониха и на звяра, като казваха: Кой е като този звяр? Кой може да воюва против него?"},
	{5, "5 И му се даде уста да говори големи неща и богохулства; и му се даде власт да действа четиридесет и два месеца."},
	{6, "6 И той отвори устата си за хули против Бога, за да хули Неговото Име и Неговата скиния, и онези, които живеят на небето."},
	{7, "7 И му се даде да воюва против светиите и да ги победи; и му се даде власт над всяко племе и народ, и език, и нация."},
	{8, "8 И ще му се поклонят всички земни жители, всеки, чието име не е записано в книгата на живота на закланото Агне от създаването на света."},
	{9, "9 Ако някой има ухо, нека слуша."},
	{10, "10 Ако някой откарва в плен, и той ще отиде в плен. Ако някой убива с меч, и той трябва да бъде убит с меч. Тук е нужно търпението и вярата на светиите."},
	{11, "11 И видях друг звяр, който излизаше от земята. И той имаше два рога, като агнешки, и говореше като змей."},
	{12, "12 Той упражняваше цялата власт на първия звяр пред него и принуди земята и живеещите на нея да се поклонят на първия звяр, чиято смъртоносна рана бе оздравяла."},
	{13, "13 И вършеше големи знамения, дотам че направи и огън да слиза от небето на земята пред хората."},
	{14, "14 И мамеше земните жители чрез знаменията, които му се даде да извърши пред звяра, като казваше на земните жители да направят образ на звяра, който беше ранен от меча и оживя."},
	{15, "15 И му се даде да даде дишане на образа на звяра, така че образът на звяра дори да проговори и да направи да бъдат избити онези, които не се покланят на образа на звяра."},
	{16, "16 И принуждаваше всички – малки и големи, богати и бедни, свободни и роби – да им се сложи белег на дясната ръка или на челата им,"},
	{17, "17 за да не може никой да купува или да продава освен онзи, който носи белега, името на звяра или числото на неговото име."},
	{18, "18 Тук е нужна мъдрост; който е разумен, нека сметне числото на звяра, защото е число на човек; а числото му е шестстотин шестдесет и шест."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct bg14 poems[] = {
	{1, "1 И видях, и ето: Агнето стоеше на хълма Сион и с Него сто четиридесет и четири хиляди, които носеха Неговото Име и Името на Неговия Отец написано на челата им."},
	{2, "2 И чух глас от небето, като глас от много води и като глас от гръм; и гласът, който чух, беше като глас на арфисти, които свиреха с арфите си."},
	{3, "3 И пееха като че ли нова песен пред престола и пред четирите живи същества и старейшините; и никой не можеше да научи тази песен освен сто и четиридесет и четирите хиляди, които са били изкупени от земята."},
	{4, "4 Те са онези, които не са се осквернили с жени, защото са девственици. Те са онези, които следват Агнето, където и да отива. Те са били изкупени измежду хората като първи плодове за Бога и за Агнето."},
	{5, "5 И в устата им не се намери лъжа, те са непорочни."},
	{6, "6 И видях друг ангел да лети сред небето, който имаше вечното евангелие, за да го благовести на земните жители и на всяка нация и племе, и език, и народ."},
	{7, "7 И каза със силен глас: Бойте се от Бога и Му въздайте слава, защото часът на Неговия съд настана; и поклонете се на Този, който е направил небето и земята, и морето, и водните извори!"},
	{8, "8 И друг, втори ангел, следваше отзад и казваше: Падна, падна великият Вавилон, който напои всичките нации с виното на своето разпалено блудстване."},
	{9, "9 И друг, трети ангел, ги следваше и казваше със силен глас: Ако някой се поклони на звяра и на неговия образ и приеме белег на челото си или на ръката си,"},
	{10, "10 той също ще пие от виното на Божията ярост, което е приготвено чисто в чашата на гнева Му, и ще бъде мъчен с огън и сяра пред светите ангели и пред Агнето."},
	{11, "11 И димът от тяхното мъчение ще се издига за вечни векове; и онези, които се покланят на звяра и образа му, няма да имат покой ни денем, ни нощем, нито който и да е друг, който приема белега на името му."},
	{12, "12 Тук е нужно търпението на светиите; на тези, които пазят Божиите заповеди и вярата в Иисус."},
	{13, "13 И чух глас от небето, който казваше: Напиши: Блажени мъртвите, които отсега нататък умират в Господа. Да! – казва Духът – за да си починат от трудовете си, защото делата им ги следват."},
	{14, "14 И видях, и ето, бял облак, и на облака седеше Един, който приличаше на Човешкия Син, и имаше на главата Си златен венец и в ръката Си – остър сърп."},
	{15, "15 И друг ангел излезе от храма и викаше със силен глас на Този, който седеше на облака: Прати сърпа си и жъни, защото е настанал часът да жънеш, понеже жетвата на земята е презряла."},
	{16, "16 И Онзи, който седеше на облака, хвърли сърпа Си на земята и земята беше ожъната."},
	{17, "17 И друг ангел излезе от храма, който е на небето, като и той държеше остър сърп."},
	{18, "18 И още един ангел, който имаше власт над огъня, излезе от олтара и извика със силен глас на този, който държеше острия сърп, като каза: Прати острия си сърп и обери гроздовете на земното лозе, защото гроздето му е вече узряло."},
	{19, "19 И ангелът хвърли сърпа си на земята, обра земното лозе и хвърли набраното в големия лин на Божията ярост."},
	{20, "20 И линът бе изтъпкан вън от града и кръв потече от лина и стигна дори до юздите на конете на едно разстояние от хиляда и шестстотин стадии."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct bg15 poems[] = {
	{1, "1 И видях на небето друго знамение, голямо и чудно: седем ангела, които държаха последните седем язви, защото с тях се изчерпва Божията ярост."},
	{2, "2 И видях нещо като стъклено море, размесено с огън; и тези, които бяха победили звяра и неговия образ, и числото на неговото име, стояха при стъкленото море, като държаха Божии арфи."},
	{3, "3 И те пееха песента на Божия слуга Мойсей и песента на Агнето и казваха: Велики и чудесни са Твоите дела, Господи, Боже Всемогъщи; праведни и истинни са Твоите пътища, Царю на нациите!"},
	{4, "4 Кой няма да се бои от Теб, Господи, и няма да прослави Името Ти? Защото само Ти си свят. Всички народи ще дойдат и ще се поклонят пред Теб, защото се явиха Твоите праведни дела."},
	{5, "5 И след това видях, че на небето се отвори храмът на скинията на свидетелството."},
	{6, "6 И седемте ангела, които държаха седемте язви, излязоха от храма облечени в чисти и блестящи ленени дрехи и препасани през гърдите със златни пояси."},
	{7, "7 И едно от четирите живи същества даде на седемте ангела седем златни чаши, пълни с яростта на Бога, който живее за вечни векове."},
	{8, "8 И храмът се изпълни с дим от славата на Бога и от Неговото могъщество и никой не можеше да влезе в храма, преди да се свършат седемте язви на седемте ангела."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct bg16 poems[] = {
	{1, "1 И чух от храма силен глас, който казваше на седемте ангела: Идете и излейте на земята седемте чаши на Божията ярост!"},
	{2, "2 И първият отиде и изля чашата си на земята; и се появи лоша и люта рана по онези хора, които носеха белега на звяра и които се покланяха на неговия образ."},
	{3, "3 И вторият ангел изля чашата си в морето; и то стана като кръв на мъртвец и всяка жива душа в морето умря."},
	{4, "4 И третият ангел изля чашата си в реките и във водните извори; и водата им стана кръв."},
	{5, "5 И чух ангела на водите да казва: Праведен си Ти, Пресвети, който си, и който си бил, затова че си отсъдил така;"},
	{6, "6 понеже те проляха кръвта на светиите и на пророците, Ти си им дал да пият кръв; защото те заслужават това."},
	{7, "7 И чух (друг от) олтара да казва: Да, Господи Боже Всемогъщи, истинни и праведни са Твоите присъди."},
	{8, "8 И четвъртият ангел изля чашата си върху слънцето, на което се даде да гори хората с огън."},
	{9, "9 И хората се опекоха от голямата горещина и похулиха Името на Бога, който има власт над тези язви, и не се покаяха да Му отдадат слава."},
	{10, "10 И петият ангел изля чашата си върху престола на звяра; и царството му беше помрачено; и хората хапеха езиците си от болка"},
	{11, "11 и похулиха небесния Бог заради болките си и раните си, и не се покаяха за делата си."},
	{12, "12 И шестият ангел изля чашата си върху голямата река Ефрат; и водата й пресъхна, за да се приготви пътят на царете от изгрев слънце."},
	{13, "13 И видях от устата на змея и от устата на звяра, и от устата на лъжепророка да излизат три нечисти духа, приличащи на жаби;"},
	{14, "14 защото те са духове на демони, които вършат знамения, и отиват при царете на целия свят, за да ги събират за войната във великия Ден на всемогъщия Бог."},
	{15, "15 – Ето, идвам като крадец. Блажен онзи, който бди и пази дрехите си, за да не ходи гол и да не гледат неговия срам. –"},
	{16, "16 И ги събра на мястото, което на еврейски се нарича Армагедон."},
	{17, "17 И седмият ангел изля чашата си във въздуха; и от храма дойде силен глас от престола и каза: Сбъдна се."},
	{18, "18 И излязоха светкавици и гласове, и гръмове, и стана силно земетресение, каквото не е било откакто има човек на земята – такова голямо земетресение, толкова силно!"},
	{19, "19 И великият град се разцепи на три части и градовете на нациите паднаха, и великият Вавилон беше припомнен пред Бога, за да му даде чашата с виното на яростта на Неговия гняв."},
	{20, "20 И всеки остров изчезна и планините не се намериха."},
	{21, "21 И от небето падна върху хората едър град, всяко парче тежеше като един талант. И хората похулиха Бога заради язвата от града, защото язвата от него беше твърде голяма."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct bg17 poems[] = {
	{1, "1 И дойде един от седемте ангела, които държаха седемте чаши, и говори с мен, и каза: Ела, ще ти покажа съда над голямата блудница, която седи на много води,"},
	{2, "2 с която блудстваха земните царе, и земните жители се опиха от виното на нейното блудстване."},
	{3, "3 И така, той ме заведе в Духа в една пустиня. И видях жена, седяща на червен звяр, пълен с богохулни имена, който имаше седем глави и десет рога."},
	{4, "4 Жената беше облечена в пурпурно и червено и позлатена със злато и скъпоценни камъни, и бисери, и държеше в ръката си златна чаша, пълна с мръсотии и с нечистотии от нейното блудстване."},
	{5, "5 И на челото й беше написано име, тайна: Вавилон, великата, майка на блудниците и гнусотиите на земята."},
	{6, "6 И видях, че жената се беше опила от кръвта на светиите и от кръвта на Иисусовите свидетели; и като я видях, се зачудих твърде много."},
	{7, "7 И ангелът ми каза: Защо се зачуди? Аз ще ти кажа тайната на жената и на звяра, който я носи, който има седемте глави и десетте рога."},
	{8, "8 Звярът, който си видял, беше и го няма, и скоро ще излезе от бездната и ще отиде в погибел. И земните жители – всеки, чието име не е написано в книгата на живота от създаването на света – ще се зачудят, когато видят, че звярът беше и го няма, и пак ще дойде."},
	{9, "9 Тук е нужен разум, който има мъдрост: седемте глави са седем хълма, на които седи жената."},
	{10, "10 Те са и седем царе, от които пет паднаха, единият е сега, а другият още не е дошъл; и когато дойде, само малко трябва да остане."},
	{11, "11 И звярът, който беше и го няма, сам е осми, както е и един от седемте, и отива в погибел."},
	{12, "12 И десетте рога, които си видял, са десет царе, които още не са получили царска власт, но получават власт като царе за един час заедно със звяра."},
	{13, "13 Те са единомислени и предават своята власт и сила на звяра."},
	{14, "14 Те ще воюват срещу Агнето и Агнето ще ги победи, защото е Господар на господарите и Цар на царете; също и тези, които са с Него, са призвани, избрани и верни."},
	{15, "15 Каза ми още: Водите, които ти видя, там, където седи блудницата, са народи и множества, и нации, и езици."},
	{16, "16 И десетте рога, които ти видя – те и звярът – ще намразят блудницата и ще я направят пуста и гола, и ще изядат месата й, а нея ще изгорят с огън."},
	{17, "17 Защото Бог сложи в сърцата им да извършат Неговата воля, като действат единомислено и предадат царската си власт на звяра, докато се изпълнят Божиите думи."},
	{18, "18 И жената, която видя, е големият град, който царува над земните царе."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct bg18 poems[] = {
	{1, "1 След това видях друг ангел, който слизаше от небето и имаше голяма власт; и земята се осветли от неговата слава."},
	{2, "2 Той извика със силен глас и каза: Падна, падна Вавилон, великата блудница, и стана жилище на демони, затвор на всякакъв нечист дух и затвор на всякаква нечиста и омразна птица;"},
	{3, "3 защото всички нации пиха от виното на гнева на нейното блудстване и земните царе блудстваха с нея, и земните търговци се обогатиха от могъществото на нейния разкош."},
	{4, "4 И чух друг глас от небето, който казваше: Излезте от нея, народе Мой, за да не участвате в греховете й и да не споделите язвите й;"},
	{5, "5 защото греховете й стигнаха до небето и Бог си спомни нейните беззакония."},
	{6, "6 Отплатете й това, което и тя е отплатила; да, отплатете й двойно на делата й; почерпете й двойно с чашата, с която тя е черпила."},
	{7, "7 Толкова мъка и печал й дайте, колкото се е прославила и живяла разкошно, защото в сърцето си казва: Седя като царица и не съм вдовица, и печал няма да видя."},
	{8, "8 Затова язвите й ще дойдат в един ден: смърт, печал и глад, и тя ще бъде изгорена с огън; защото могъщ е Господ Бог, който я съди."},
	{9, "9 И земните царе, които са блудствали и живели разкошно с нея, ще заплачат и заридаят за нея, когато видят дима от изгарянето й."},
	{10, "10 Ще стоят надалеч от страх от мъките й и ще казват: Горко, горко на теб, велики граде Вавилоне, могъщи граде, понеже съдът ти в един час дойде!"},
	{11, "11 И земните търговци ще плачат и жалеят за нея, защото никой вече няма да купува стоките им,"},
	{12, "12 стоки от злато и сребро, скъпоценни камъни и бисери, висон и пурпур, коприна и червен плат, и всякакво благоуханно дърво, и всякакви изделия от слонова кост, и всякакви изделия от скъпоценно дърво и от бронз, от желязо и от мрамор,"},
	{13, "13 и канела, аромати, тамян, миро и ливан, вино и маслинено масло, чисто брашно и пшеница, добитък и овце, коне, колесници и роби, и човешки души."},
	{14, "14 Плодовете, за които душата ти копнееше, изчезнаха от теб и всеки разкош и блясък си отиде от теб и няма вече да се намери."},
	{15, "15 Търговците на тези неща, които се обогатиха от нея, ще застанат надалеч от страх от мъките й и ще плачат и ще жалеят,"},
	{16, "16 като казват: Горко, горко, граде велики, облечен във висон, пурпур и червено и позлатен със злато, скъпоценни камъни и бисери!"},
	{17, "17 Защото за един час беше опустошено такова голямо богатство! И всеки морски капитан и всички, които пътуваха по море, моряците и всички, които се препитават от морето, застанаха отдалеч"},
	{18, "18 и викаха, като гледаха дима от нейното изгаряне, и казваха: Имаше ли друг град, който да прилича на великия град?"},
	{19, "19 И посипаха с пръст главите си и викаха с плач и жалеене и казваха: Горко, горко, на великия град, в който всички, които имаха кораби по морето, се обогатиха от нейното великолепие; защото за един час беше опустошена!"},
	{20, "20 Веселете се заради нея, небеса и вие светии, апостоли и пророци, защото Бог изпълни присъдата над нея заради вас."},
	{21, "21 И един силен ангел взе камък, голям като воденичен камък, хвърли го в морето и каза: Така стремително ще бъде сринат Вавилон, великият град, и няма да се намери вече."},
	{22, "22 И гласът на арфистите и на певците, на свирачите и на тръбачите няма да се чува вече в теб и никакъв художник от каквото и да било изкуство няма да се намери вече в теб, и шум на воденица няма да се чува вече в теб,"},
	{23, "23 и светлина на светило няма да свети вече в теб, и глас на младоженец и на невяста няма да се чува вече в теб, защото твоите търговци бяха големците на земята, защото чрез твоите чародейства бяха измамени всичките народи."},
	{24, "24 И в нея беше намерена кръвта на пророците и на светиите, и на всичките убити на земята."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct bg19 poems[] = {
	{1, "1 След това чух нещо като силен глас от голямо множество на небето, който казваше: Алилуя! Спасението, славата и силата принадлежат на нашия Бог!"},
	{2, "2 Защото Неговите присъди са истинни и праведни, понеже Той осъди великата блудница, която е покварила земята със своето блудство, и прати върху нея възмездие за кръвта на Своите слуги."},
	{3, "3 И те втори път казаха: Алилуя! И димът й се издигна за вечни векове."},
	{4, "4 И двадесет и четиримата старейшини и четирите живи същества паднаха и се поклониха на Бога, който седи на престола, и казаха: Амин! Алилуя!"},
	{5, "5 И от престола излезе глас, който казваше: Хвалете нашия Бог, всички Негови слуги, вие, които Му се боите, малки и големи!"},
	{6, "6 И чух нещо като глас от огромно множество, като глас от много води и като глас от силни гръмове, които казваха: Алилуя! Защото Господ, нашият Бог, Всемогъщият, се възцари!"},
	{7, "7 Нека се радваме и се веселим и нека Му отдадем слава, защото дойде сватбата на Агнето и Неговата жена се е приготвила."},
	{8, "8 И на нея се даде да се облече в блестящ и чист висон, защото висонът са праведните дела на светиите."},
	{9, "9 И ми каза: Напиши: Блажени са тези, които са поканени на сватбената вечеря на Агнето. И ми каза: Тези са истинните Божии думи."},
	{10, "10 Тогава аз паднах пред краката му, за да му се поклоня, но той ми каза: Недей; аз съм служител заедно с теб и с братята ти, които имат Иисусовото свидетелство. Поклони се на Бога; защото Иисусовото свидетелство е духът на пророчеството."},
	{11, "11 След това видях небето отворено, и ето, бял кон, и Онзи, който яздеше на него, се наричаше Верен и Истинен, и Той съди и воюва в справедливост."},
	{12, "12 Очите Му бяха като огнен пламък и на главата Му бяха много корони, и имаше написано едно име, което никой не знаеше освен Него."},
	{13, "13 И беше облечен в дреха, натопена в кръв; и Името Му е Божието Слово."},
	{14, "14 И небесните войски Го следваха на бели коне, облечени в бял и чист висон."},
	{15, "15 От устата Му излизаше остър меч, с който да порази нациите; и Той ще ги пасе с желязна тояга и ще стъпче лина на яростния гняв на Всемогъщия Бог."},
	{16, "16 И на дрехата и на бедрото Му имаше написано име: Цар на царете и Господар на господарите."},
	{17, "17 И видях един ангел, който стоеше в слънцето, и извика със силен глас, като каза на всичките птици, които летят посред небето: Елате и се съберете за великата Божия вечеря,"},
	{18, "18 за да ядете месата на царе и месата на военачалници, месата на юнаци и месата на коне, и на онези, които яздят на тях, и месата на всички хора, свободни и роби, малки и големи!"},
	{19, "19 И видях звяра и земните царе, и войските им, събрани да воюват против Яздещия на коня и против Неговото войнство."},
	{20, "20 И звярът беше хванат и с него и лъжепророкът, който беше вършил пред него знамения, с които измами онези, които бяха приели белега на звяра и които се покланяха на неговия образ. Те двамата бяха хвърлени живи в огненото езеро, което гори със сяра."},
	{21, "21 А останалите бяха избити с меча на Яздещия на коня, с меча, който излизаше от устата Му. И всичките птици се наситиха с месата им."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct bg20 poems[] = {
	{1, "1 И видях, че слизаше от небето един ангел, който държеше в ръката си ключа на бездната и една голяма верига."},
	{2, "2 Той улови змея, старовременната змия, която е дяволът и Сатана, и го върза за хиляда години,"},
	{3, "3 и го хвърли в бездната, и я заключи, и я запечата над него, за да не мами вече нациите, докато се свършат хилядата години, след което той трябва да бъде пуснат за малко време."},
	{4, "4 И видях престоли; и седнаха на тях, и им се даде да съдят. Видях и душите на онези, които бяха обезглавени заради Иисусовото свидетелство и заради Божието слово и които не се бяха поклонили на звяра, нито на неговия образ, и не бяха приели белега на челото си и на ръката си. И те оживяха и царуваха с Христос хиляда години."},
	{5, "5 Другите мъртви не оживяха, докато не се свършиха хилядата години. Това е първото възкресение."},
	{6, "6 Блажен и свят онзи, който участва в първото възкресение. Над такива втората смърт няма да има власт, а те ще бъдат свещеници на Бога и на Христос и ще царуват с Него хиляда години."},
	{7, "7 И когато се свършат хилядата години, Сатана ще бъде пуснат от неговата тъмница"},
	{8, "8 и ще излезе да мами нациите по четирите краища на земята, Гог и Магог, за да ги събере за война; чието число е като морския пясък."},
	{9, "9 И те се разпростряха по цялата ширина на земята и обиколиха стана на светиите и възлюбения град; и огън падна (от Бога) от небето и ги погълна."},
	{10, "10 И дяволът, който ги мамеше, беше хвърлен в езерото от огън и сяра, където са и звярът, и лъжепророкът; и ще бъдат мъчени денем и нощем в цялата вечност."},
	{11, "11 И видях един голям бял престол и Седящия на него, от Чието лице побягнаха земята и небето и не се намери място за тях."},
	{12, "12 Видях и мъртвите, големи и малки, да стоят пред престола; и се разгънаха едни книги; и се разгъна и друга книга, която е книгата на живота; и мъртвите бяха съдени според написаното в книгите – според делата си."},
	{13, "13 И морето предаде мъртвите, които бяха в него, и смъртта и адът предадоха мъртвите, които бяха в тях; и те бяха съдени – всеки според делата си."},
	{14, "14 И смъртта и адът бяха хвърлени в огненото езеро. Това е втората смърт."},
	{15, "15 И ако някой не се намери записан в книгата на живота, той беше хвърлен в огненото езеро."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct bg21 poems[] = {
	{1, "1 И видях ново небе и нова земя; защото първото небе и първата земя преминаха и море няма вече."},
	{2, "2 И видях и светия град, новия Ерусалим, да слиза от небето от Бога, приготвен като невяста, украсена за мъжа си."},
	{3, "3 И чух силен глас от престола, който казваше: Ето, скинията на Бога е с хората и Той ще обитава с тях; и те ще бъдат Негов народ и Сам Бог ще бъде с тях – техен Бог."},
	{4, "4 Той ще избърше всяка сълза от очите им и смърт няма да има вече, няма да има вече нито жалеене, нито писък, нито болка; първото премина."},
	{5, "5 И Седящият на престола каза: Ето, правя всичко ново. И ми каза: Запиши, защото тези думи са верни и истинни."},
	{6, "6 И ми каза: Сбъдна се! Аз съм Алфа и Омега, Началото и Краят. На жадния ще дам даром от извора на водата на живота."},
	{7, "7 Който победи, ще наследи всичко това и Аз ще му бъда Бог, и той ще Ми бъде син."},
	{8, "8 А колкото за страхливите, невярващите, нечистите, убийците, блудниците, чародеите, идолопоклонниците и всичките лъжци, техният дял ще бъде в езерото, което гори с огън и сяра. Това е втората смърт."},
	{9, "9 Тогава дойде един от седемте ангела, които държаха седемте чаши, пълни със седемте последни язви, и ми говори, като каза: Ела, ще ти покажа невястата, жената на Агнето."},
	{10, "10 И ме отведе в Духа на една голяма и висока планина и ми показа светия град, Ерусалим, слизащ от небето от Бога,"},
	{11, "11 и имаше славата на Бога, като блестеше, както блести някой много скъпоценен камък, като яспис, прозрачен като кристал."},
	{12, "12 Градът имаше голяма и висока стена с дванадесет порти и на портите – дванадесет ангела, и върху портите – написани имена, които са имената на дванадесетте племена на израилевите синове:"},
	{13, "13 на изток – три порти, на север – три порти, на юг – три порти и на запад – три порти."},
	{14, "14 И градската стена имаше дванадесет основни камъка и на тях – имената на дванадесетте апостоли на Агнето."},
	{15, "15 И този, който ми говореше, имаше за мярка златна тръстика, с която да измери града, портите и стената му."},
	{16, "16 Градът беше четвъртит, с дължина равна на ширината му; и като измери града с тръстиката, той излезе дванадесет хиляди стадия. Дължината, ширината и височината му са еднакви."},
	{17, "17 Измери и стената му, която излезе сто четиридесет и четири лакти; а това беше човешка мярка, която е ангелска."},
	{18, "18 Стената му беше изградена от яспис, а градът – от чисто злато, подобно на чисто стъкло."},
	{19, "19 Основните камъни на градската стена бяха украсени с всякакви скъпоценни камъни: първият основен камък беше яспис, вторият – сапфир, третият – халкидон, четвъртият – смарагд,"},
	{20, "20 петият – сардоникс, шестият – сард, седмият – хрисолит, осмият – вирил, деветият – топаз, десетият – хрисопрас, единадесетият – яцинт, дванадесетият – аметист."},
	{21, "21 И дванадесетте порти бяха дванадесет бисера, всяка една порта беше от един бисер; и улицата на града беше от чисто злато, като прозрачно стъкло."},
	{22, "22 И не видях храм в него, защото неговият храм е Господ Бог Всемогъщ и Агнето."},
	{23, "23 И градът нямаше нужда от слънце, нито от луна, за да го осветява, защото Божията слава го осветляваше и неговото светило е Агнето."},
	{24, "24 И народите ще ходят в неговата светлина и земните царе ще донасят в него своята слава."},
	{25, "25 Портите му няма да се затварят през деня, защото нощ няма да има там."},
	{26, "26 И ще донасят в него славата и почитта на нациите."},
	{27, "27 И в него няма да влезе нищо нечисто, нито онзи, който върши мерзост или който лъже, а само тези, които са записани в книгата на живота на Агнето."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct bg22 poems[] = {
	{1, "1 След това ми показа реката с водата на живота, блестяща като кристал, която извираше от престола на Бога и на Агнето."},
	{2, "2 И по средата на улицата му и на реката, оттук и оттам, имаше дърво на живота, което раждаше дванадесет пъти плодове, като даваше плод всеки месец. И листата на дървото бяха за изцеление на нациите."},
	{3, "3 И вече няма да има никакво проклятие. И престолът на Бога и на Агнето ще бъде в него и Неговите слуги ще Му служат."},
	{4, "4 Те ще гледат лицето Му и Неговото Име ще бъде на челата им."},
	{5, "5 Нощ няма да има вече и няма да имат нужда от светене на светило или от слънчева светлина, защото Господ Бог ще свети над тях. И те ще царуват за вечни векове."},
	{6, "6 И той ми каза: Тези думи са верни и истинни; и Господ Бог на духовете на пророците изпрати ангела Си да покаже на Своите слуги това, което трябва скоро да стане."},
	{7, "7 И ето, идвам скоро. Блажен онзи, който пази думите на пророчеството на тази книга."},
	{8, "8 Аз, Йоан, съм този, който чух и видях тези неща. И когато чух и видях, паднах да се поклоня пред краката на ангела, който ми беше показал това."},
	{9, "9 Но той ми каза: Недей! Аз съм служител заедно с теб и с братята ти, пророците, и с тези, които пазят думите на тази книга. Поклони се на Бога!"},
	{10, "10 Каза ми още: Не запечатвай думите на пророчеството на тази книга, защото времето е близо."},
	{11, "11 Който върши неправда, нека върши още неправда; и който е нечист, нека бъде още нечист; и праведният нека върши още правда; и светият нека още се освещава."},
	{12, "12 Ето, идвам скоро и Моята награда е с Мен, и ще отплатя на всекиго според делото му."},
	{13, "13 Аз съм Алфа и Омега, Първият и Последният, Началото и Краят."},
	{14, "14 Блажени тези, които изперат дрехите си, за да имат право на дървото на живота и да влязат през портите в града."},
	{15, "15 А отвън са псетата, чародейците, блудниците, убийците, идолопоклонниците и всеки, който обича лъжата и лъже."},
	{16, "16 Аз, Иисус, изпратих ангела Си да ви засвидетелства това за църквите. Аз съм Коренът и Родът на Давид, светлата Утринна Звезда."},
	{17, "17 И Духът, и невястата казват: Ела! И който чуе, нека каже: Ела! И който е жаден, нека дойде! И който иска, нека вземе даром от водата на живота!"},
	{18, "18 Аз свидетелствам на всекиго, който слуша думите на пророчеството на тази книга: ако някой прибави нещо към тях, Бог ще прибави върху него язвите, написани в тази книга."},
	{19, "19 И ако някой отнеме от думите на книгата на това пророчество, Бог ще му отнеме дела от дървото на живота и от светия град, за които е писано в тази книга."},
	{20, "20 Онзи, който свидетелства за това, казва: Да, идвам скоро. Амин! Ела, Господи Иисусе!"},
	{21, "21 Благодатта на Господ Иисус Христос да бъде със светиите. Амин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};