#include <map>
#include <string>
class Bible56
{
	struct bg1	{ int val; const char *msg; };
	struct bg2	{ int val; const char *msg; };
	struct bg3	{ int val; const char *msg; };
public:
static void view1() {
struct bg1 poems[] = {
	{1, "1 Павел, слуга на Бога и апостол на Иисус Христос според вярата на Божиите избрани и познаването на истината, която е според благочестието,"},
	{2, "2 в надежда за вечен живот, който Бог, който не лъже, е обещал преди вечни времена,"},
	{3, "3 но в определеното време яви словото Си чрез посланието, поверено на мен по заповед на Бога, нашия Спасител,"},
	{4, "4 до Тит, моето истинско по общата ни вяра дете: Благодат и мир от Бог Отец и Господ Иисус Христос, нашия Спасител!"},
	{5, "5 Оставих те в Крит по тази причина – да сложиш в ред недовършеното и да поставиш старейшини във всеки град, както ти поръчах:"},
	{6, "6 ако някой е непорочен, мъж на една жена и има верни деца, които не са обвинени в разпуснат живот или непокорство."},
	{7, "7 Защото надзорникът трябва да е безупречен, като Божи управител, не своеволен, нито сприхав, нито да се заседява при виното, нито побойник, нито да е лаком за пагубна печалба,"},
	{8, "8 а гостолюбив, обичащ доброто, разбран, справедлив, благочестив, самообладан,"},
	{9, "9 който здраво държи вярното слово така, както е бил научен, за да може и да увещава със здравото учение, и да изобличава онези, които противоречат."},
	{10, "10 Защото има много непокорни, празнословци и измамници, особено от обрязаните,"},
	{11, "11 чиито уста трябва да се запушат, които съсипват цели домове, като поучават заради гнусна печалба това, което не трябва."},
	{12, "12 Един от тях, техен собствен пророк, е казал: Критяните са винаги лъжци, зли зверове, лениви търбуси."},
	{13, "13 Това свидетелство е вярно. По тази причина ги изобличавай строго, за да бъдат здрави във вярата,"},
	{14, "14 като не обръщат внимание на юдейски басни и на заповеди от хора, които се отвръщат от истината."},
	{15, "15 За чистите всичко е чисто, а за осквернените и невярващите няма нищо чисто, а даже и умът им и съвестта им са осквернени."},
	{16, "16 Твърдят, че познават Бога, но с делата си Го отричат, като са отвратителни и непокорни, и негодни за никакво добро дело."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct bg2 poems[] = {
	{1, "1 Но ти говори това, което приляга на здравото учение:"},
	{2, "2 старите мъже да бъдат трезви, сериозни, разбрани, здрави във вярата, в любовта, в търпението."},
	{3, "3 Така също и старите жени да имат поведение съответно на светостта, да не са клеветници, нито отдадени много на вино, да поучават това, което е добро,"},
	{4, "4 за да учат младите жени да обичат мъжете си и децата си,"},
	{5, "5 да са разбрани, целомъдрени, да работят по домовете си, да са благи, подчинени на мъжете си, за да не се хули Божието слово."},
	{6, "6 Така също увещавай и младите мъже да бъдат разбрани,"},
	{7, "7 като във всичко показваш себе си пример за добри дела – в поучението си показвай непоквареност, сериозност,"},
	{8, "8 здраво и безукорно говорене, за да се засрами този, който се противопоставя, като няма какво лошо да каже за нас."},
	{9, "9 Увещавай слугите да се подчиняват на господарите си, да им угаждат във всичко, като не им противоречат,"},
	{10, "10 да не присвояват чуждо, а да показват винаги съвършена вярност, за да украсяват във всичко учението на Бога, нашия Спасител."},
	{11, "11 Защото се яви Божията благодат, която носи спасение за всичките хора,"},
	{12, "12 като ни учи да се отречем от нечестието и светските страсти и да живеем разбрано, праведно и благочестиво в настоящия свят,"},
	{13, "13 като очакваме блажената надежда и явяването на славата на нашия велик Бог и Спасител Иисус Христос,"},
	{14, "14 който даде Себе Си заради нас, за да ни изкупи от всяко беззаконие и да очисти за Себе Си народ за Свое притежание, ревностен за добри дела."},
	{15, "15 Така говори, увещавай и изобличавай с абсолютна настойчивост! Никой да не те презира!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct bg3 poems[] = {
	{1, "1 Напомняй им да се покоряват на държавните началства и власти, да се подчиняват и да бъдат готови за всяко добро дело,"},
	{2, "2 да не хулят никого, да не бъдат свадливи, а тихи и да показват съвършена кротост към всички хора."},
	{3, "3 Защото и ние някога бяхме неразумни, непокорни, заблудени, робуващи на разни желания и страсти, живеещи в злоба и завист, мразени и мразещи се един друг."},
	{4, "4 Но когато се яви благостта и човеколюбието на Бога, нашия Спасител,"},
	{5, "5 Той ни спаси не чрез праведни дела, които сме извършили, а по Своята милост, чрез окъпването на новорождението и обновяването на Светия Дух,"},
	{6, "6 когото изля изобилно върху нас чрез Иисус Христос, нашия Спасител,"},
	{7, "7 така че, като сме оправдани чрез Неговата благодат, да станем наследници според надеждата на вечния живот."},
	{8, "8 Вярно е това слово. И желая да държиш твърдо на това, с цел онези, които са повярвали в Бога, да бъдат старателни да вършат добри дела. Това е добро и полезно за хората."},
	{9, "9 И избягвай глупавите разисквания, родословия, спорове и караници върху закона, защото те са безполезни и суетни."},
	{10, "10 След като напътстваш един и два пъти човек, който е еретик, го отстрани,"},
	{11, "11 като знаеш, че този, който е такъв, се е извратил и съгрешава, като от само себе си е осъден."},
	{12, "12 Когато изпратя при теб Артема или Тихик, побързай да дойдеш при мен в Никопол, защото съм решил там да презимувам."},
	{13, "13 Погрижи се да изпратиш на път законника Зина и Аполос, така че да не им липсва нищо."},
	{14, "14 Нека и нашите се учат да се стараят в добри дела за посрещане на необходимите потребности, за да не бъдат безплодни."},
	{15, "15 Поздравяват те всички, които са с мен. Поздрави онези, които ни обичат във вярата. Благодат да бъде с всички вас. (Амин.)"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};