#include <map>
#include <string>
class Bible63
{
	struct sr1	{ int val; const char *msg; };
public:
static void view1() {
struct sr1 poems[] = {
	{1, "1 Од старешине изабраној госпођи и деци њеној коју ја љубим ва истину, и не само ја него сви који познаше истину,"},
	{2, "2 За истину која у нама стоји и биће с нама довека:"},
	{3, "3 Да буде с вама благодат, милост, мир од Бога Оца и од Господа Исуса Христа, Сина Очевог, у истини и у љубави."},
	{4, "4 Обрадовах се врло што нађох неке од твоје деце који ходе у истини, као што примисмо заповест од Оца."},
	{5, "5 И сад молим те, госпођо, не као да ти нову заповест пишем, него коју имамо испочетка, да имамо љубав међу собом."},
	{6, "6 И ова је љубав да живимо по заповестима Његовим. Ова је заповест, као што чусте испочетка, да у њој живите."},
	{7, "7 Јер многе варалице изиђоше на свет који не признају Исуса Христа да је дошао у телу; ово је варалица и антихрист."},
	{8, "8 Чувајте се да не изгубимо шта смо зарадили, него да примимо плату потпуно."},
	{9, "9 Који год преступа и не стоји у науци Христовој онај нема Бога; а који стоји у науци Христовој онај има и Оца и Сина."},
	{10, "10 Ако ко долази к вама и ове науке не доноси, не примајте га у кућу, и не поздрављајте се с њим;"},
	{11, "11 Јер ко се поздрави с њим, прима део у његовим злим делима."},
	{12, "12 Много бих вам имао писати, али не хтедох хартијом и мастилом; јер се надам да ћу доћи к вама и из уста говорити, да радост ваша буде испуњена."},
	{13, "13 Поздрављају те деца твоје сестре изабране. Амин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};