#include <map>
#include <string>
class Bible64
{
	struct sr1	{ int val; const char *msg; };
public:
static void view1() {
struct sr1 poems[] = {
	{1, "1 Од старешине Гају љубазном, ког ја љубим ва истину."},
	{2, "2 Љубазни! Молим се Богу да ти у свему буде добро, и да будеш здрав, као што је твојој души добро."},
	{3, "3 Обрадовах се врло кад дођоше браћа и посведочише твоју истину, како ти у истини живиш."},
	{4, "4 Немам веће радости од ове да чујем моја деца у истини да ходе."},
	{5, "5 Љубазни! Верно радиш што чиниш браћи и гостима,"},
	{6, "6 Који посведочише твоју љубав пред црквом; и добро ћеш учинити ако их спремиш као што треба пред Богом."},
	{7, "7 Јер имена Његовог ради изиђоше не примивши ништа од незнабожаца."},
	{8, "8 Ми смо, дакле, дужни примати такве, да будемо помагачи истини."},
	{9, "9 Ја писах цркви; али Диотреф, који жели да буде најстарији међу нама, не прима нас."},
	{10, "10 Зато, ако дођем, споменућу његова дела која твори ружећи нас злим речима; и није му то доста, него сам браће не прима, и забрањује онима који би хтели да их примају, и изгони их из цркве."},
	{11, "11 Љубазни! Не угледај се на зло, него на добро: који добро чини од Бога је, а који зло чини не виде Бога."},
	{12, "12 Димитрију сведочише сви, и сама истина; а и ми сведочимо; и знате да је сведочанство наше истинито."},
	{13, "13 Много имадох да пишем; али нећу мастилом и пером да ти пишем;"},
	{14, "14 Него се надам да ћу те скоро видети; и из уста говорити. [1:15] Мир ти! Поздрављају те пријатељи. Поздрави пријатеље по имену. Амин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};