#include <map>
#include <string>
class Bible34
{
	struct sr1	{ int val; const char *msg; };
	struct sr2	{ int val; const char *msg; };
	struct sr3	{ int val; const char *msg; };
public:
static void view1() {
struct sr1 poems[] = {
	{1, "1 Бреме Ниневији; књига од утваре Наума Елкошанина."},
	{2, "2 Бог је ревнитељ и Господ је осветник; осветник је Господ и гневи се; Господ се свети противницима својим, и држи гнев према непријатељима својим."},
	{3, "3 Господ је спор на гнев и велике је моћи; али никако не правда кривца; пут је Господњи у вихору и бури, и облаци су прах од ногу Његових."},
	{4, "4 Запрећује мору и исушује га, и све реке исушује, вене Васан и Кармил, и цвет васански вене."},
	{5, "5 Горе се тресу од Њега, и хумови се растапају, а земља гори пред Њим и васиљена и све што живи у њој."},
	{6, "6 Пред гневом Његовим ко ће се одржати? И ко ће се опрети јарости гнева Његовог? Јарост се Његова излива као огањ, и стене се распадају пред Њим."},
	{7, "7 Добар је Господ, град је у невољи, и познаје оне који се уздају у Њ."},
	{8, "8 Али ће силном поплавом учинити крај месту њеном, и тама ће гонити непријатеље Његове."},
	{9, "9 Шта смишљате Господу? Он ће учинити крај; неће се два пута подигнути погибао."},
	{10, "10 Јер као трње сплетени и као од вина пијани прождреће се као сува слама."},
	{11, "11 Из тебе је изашао који смишља зло Господу, саветник неваљао."},
	{12, "12 Овако вели Господ: Ако и јесу у сили и много их има, опет ће се исећи и проћи. Мучио сам те, нећу те више мучити."},
	{13, "13 Него ћу сада сломити јарам његов с тебе, и покидаћу твоје окове."},
	{14, "14 Али за тебе заповеди Господ да се не сеје више име твоје; из дома богова твојих истребићу ликове резане и ливене; начинићу ти од њега гроб кад будеш презрен."},
	{15, "15 Ето, на горама ноге оног који носи добре гласе, који оглашује мир. Празнуј, Јуда, своје празнике, испуњај завете своје, јер зликовац неће више пролазити по теби; сасвим се затро."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct sr2 poems[] = {
	{1, "1 Изађе затирач на те, чувај град, пази на пут, утврди бедра, укрепи се добро."},
	{2, "2 Јер Господ поврати славу Јаковљеву као славу Израиљеву, јер их пустошници опустошише и лозе им потрше."},
	{3, "3 Штит је јунака његових црвен, војници су у скерлету; кола ће му бити као запаљени лучеви на дан кад се уврста, и јеле ће се љуљати страшно."},
	{4, "4 Кола ће праскати по улицама и ударати једна о друга по путевима, биће као лучеви, и трчаће као муње."},
	{5, "5 Помињаће јунаке своје, а они ће падати идући, похитаће к зидовима његовим, и заклон ће бити готов."},
	{6, "6 Врата ће се рекама отворити, и двор ће се развалити."},
	{7, "7 И која стоји, заробиће се и одвешће се, девојке њене пратиће је уздишући као голубице, бијући се у прси."},
	{8, "8 Ниневија беше као језеро водено откако јесте; али беже. Станите, станите. Али се нико не обзире."},
	{9, "9 Грабите сребро, грабите злато; благу нема краја, мноштво је свакојаких драгих заклада."},
	{10, "10 Испразни се, и оголе, и опусте; и срце се растопи, колена ударају једна о друго, и бол је у свим бедрима, и лица су свима поцрнела."},
	{11, "11 Где је ложа лавовима и пасиште лавићима, куда иђаше лав и лавица и лавић, и никога не беше да плаши."},
	{12, "12 Лав ловљаше својим лавићима доста, и дављаше лавицама својим, и пуњаше пећине своје лова и ложе своје грабежа."},
	{13, "13 Ево ме на те, говори Господ над војскама, и попалићу кола твоја у дим, и мач ће прождрети лавиће твоје, и истребићу са земље грабеж твој, и неће се чути глас посланика твојих."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct sr3 poems[] = {
	{1, "1 Тешко граду крвничком, сав је пун лажи и отимања, грабеж не избива из њега."},
	{2, "2 Пуцају бичеви, и точкови праште, и коњи топоћу, и кола скачу."},
	{3, "3 Коњаници поскакују, и мачеви се сјају, и копља севају, и мноштво је побијених и сила мртвих телеса, нема броја мртвацима, и пада се преко мртваца."},
	{4, "4 За мноштво курварства љупке курве, веште бајачице, која продаје народе својим курвањем и племена врачањем својим."},
	{5, "5 Ево ме на те, говори Господ над војскама, и узгрнућу ти скуте твоје на лице, и показаћу народима голотињу твоју и царствима срамоту твоју."},
	{6, "6 И бацићу на тебе гадове и наружићу те, и начинићу од тебе углед."},
	{7, "7 И ко те год види, бежаће од тебе, и говориће: Опусте Ниневија; ко ће је жалити? Где ћу тражити оне који би те тешили?"},
	{8, "8 Јеси ли боља од Но-Амона, који лежаше међу рекама, опточен водом, коме предња кула беше море и зидови му беху море?"},
	{9, "9 Јачина му беше хуска земља и Мисир и народи без броја; Футеји и Ливеји беху ти помоћници."},
	{10, "10 И он би пресељен, отиде у ропство, и деца његова бише размрскана по угловима свих улица; и за главаре његове бацаше жреб, и сви властељи његови бише оковани у пута."},
	{11, "11 И ти ћеш се опити и крићеш се, и ти ћеш тражити заклон од непријатеља."},
	{12, "12 Сви ће градови твоји бити као смокве с раним родом; кад се тресну, падају у уста ономе ко хоће да једе."},
	{13, "13 Ето, народ су ти жене усред тебе; непријатељима ће твојим бити широм отворена врата од земље твоје, огањ ће прождрети преворнице твоје."},
	{14, "14 Нахватај себи воде за опсаду, утврди ограде своје; уђи у као и угази блато, оправи пећ за опеке."},
	{15, "15 Онде ће те прождрети огањ, мач ће те исећи, изјешће те као хрушт; нека вас је много као хруштева, нека вас је много као скакаваца."},
	{16, "16 Имаш трговаца више него што је звезда на небу; хруштеви падоше, па одлетеше."},
	{17, "17 Главари су твоји као скакавци и војводе твоје као велики скакавци, који падају по плотовима кад је студено, а кад сунце гране, одлећу, и место им се не познаје где беху."},
	{18, "18 Задремаше твоји пастири, царе асирски, полегаше јунаци твоји, народ се твој распрша по горама, и нема никога да их збере."},
	{19, "19 Нема лека полому твом, љута је рана твоја; ко год чује глас о теби, пљескаће рукама над тобом, јер кога није стизала злоћа твоја једнако?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};