#include <map>
#include <string>
class Bible54
{
	struct sr1	{ int val; const char *msg; };
	struct sr2	{ int val; const char *msg; };
	struct sr3	{ int val; const char *msg; };
	struct sr4	{ int val; const char *msg; };
	struct sr5	{ int val; const char *msg; };
	struct sr6	{ int val; const char *msg; };
public:
static void view1() {
struct sr1 poems[] = {
	{1, "1 Од Павла, апостола Исуса Христа, по заповести Бога, Спаса нашег и Господа Исуса Христа, наде наше,"},
	{2, "2 Тимотију, правом сину у вери, благодат, милост, мир од Бога Оца нашег и Христа Исуса, Господа нашег."},
	{3, "3 Као што те молих да останеш у Ефесу, кад иђах у Македонију, да заповедиш некима да не уче другачије,"},
	{4, "4 Нити да гледају на лажи и на тефтере од племена којима нема краја, и који пре чине препирања неголи Божји напредак у вери."},
	{5, "5 А намера је заповести љубав од чистог срца и добре савести и вере нелицемерне;"},
	{6, "6 У којима неки погрешивши сврнуше у празне говоре,"},
	{7, "7 И хтели би да буду законици, а не разумеју ни шта говоре, ни шта утврђују."},
	{8, "8 А знамо да је закон добар ако га ко држи као што треба."},
	{9, "9 Знајући ово да праведнику закон није постављен, него безаконицима и непокорнима и безбожницима и грешницима, неправеднима и поганима, крвницима оца и матере, крвницима људским,"},
	{10, "10 Курварима, мужеложницима, људокрадицама, лажљивцима, клетвопреступницима, и ако шта има противно здравој науци,"},
	{11, "11 По јеванђељу славе блаженог Бога, које је мени поверено."},
	{12, "12 И захваљујем Христу Исусу, Господу нашем, који ми даје моћ, што ме за верног прими и постави ме у службу,"},
	{13, "13 Који сам пре био хулник и гонитељ и силеџија; али бих помилован, јер не знајући учиних, у неверству."},
	{14, "14 Али се још већма умножи благодат Господа нашег Исуса Христа с вером и љубави у Христу Исусу."},
	{15, "15 Истинита је реч и сваког примања достојна да Христос Исус дође на свет да спасе грешнике, од којих сам први ја."},
	{16, "16 Али тога ради ја бих помилован да на мени првом покаже све трпљење Исус Христос за углед онима који Му хоће веровати за живот вечни."},
	{17, "17 А Цару вечном, Нераспадљивом, који се не види, једином премудром Богу част и слава ва век века. Амин."},
	{18, "18 Ову пак заповест предајем ти, сине Тимотије, по пређашњим пророштвима за тебе: да ратујеш у у њима добар рат,"},
	{19, "19 Имајући веру и добру савест, коју неки одбацивши отпадоше од вере;"},
	{20, "20 Међу којима су Именеј и Александар које предадох сотони да се науче не хулити."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct sr2 poems[] = {
	{1, "1 Молим, дакле, пре свега да се чине искања, молитве, мољења, захваљивања за све људе,"},
	{2, "2 За цареве, и за све који су у власти, да тихи и мирни живот поживимо у свакој побожности и поштењу."},
	{3, "3 Јер је ово добро и пријатно пред Спаситељем нашим Богом,"},
	{4, "4 Који хоће да се сви људи спасу, и да дођу у познање истине."},
	{5, "5 Јер је један Бог, и један посредник Бога и људи, човек Христос Исус,"},
	{6, "6 Који себе даде у откуп за све, за сведочанство у своје време,"},
	{7, "7 За које сам постављен проповедник и апостол (истину говорим у Христу, не лажем), учитељ незнабожаца, у вери и истини."},
	{8, "8 Хоћу, дакле, да молитве чине људи на свакоме месту, подижући свете руке без гнева и премишљања."},
	{9, "9 Тако и жене у пристојном оделу, са стидом и поштењем да украшују себе, не плетеницама, ни златом, или бисером, или хаљинама скупоценим,"},
	{10, "10 Него добрим делима као што се пристоји женама које се обећавају побожности."},
	{11, "11 Жена на миру да се учи са сваком покорношћу."},
	{12, "12 Али жени не допуштам да учи нити да влада мужем, него да буде мирна."},
	{13, "13 Јер је Адам најпре саздан па онда Ева;"},
	{14, "14 И Адам се не превари, а жена преваривши се постаде преступница;"},
	{15, "15 Али ће се спасти рађањем деце, ако остане у вери и љубави и у светињи с поштењем."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct sr3 poems[] = {
	{1, "1 Истинита је реч: ако ко владичанство жели добру ствар жели."},
	{2, "2 Али владика треба да је без мане, једне жене муж, трезан, паметан, поштен, гостољубив, вредан да учи;"},
	{3, "3 Не пијаница, не бојац, не лаком, него кротак, миран, не среброљубац;"},
	{4, "4 Који својим домом добро управља, који има послушну децу са сваким поштењем;"},
	{5, "5 А ако ко не уме својим домом управљати, како ће се моћи старати за цркву Божију?"},
	{6, "6 Не новокрштен, да се не би надуо, и упао у суд ђавољи."},
	{7, "7 А ваља да има и добро сведочанство од оних који су напољу, да не би упао у срамоту и у замку ђавољу."},
	{8, "8 Тако и ђакони треба да буду поштени, не двојезични, не који много вина пију, не лакоми на добитак поган,"},
	{9, "9 Који имају тајну вере у чистој савести."},
	{10, "10 А и ови да се кушају најпре, па онда да служе, ако су без мане."},
	{11, "11 Тако и жене треба да су поштене, не које опадају, трезне, верне у свему."},
	{12, "12 Ђакони да бивају јединих жена мужеви, који добро управљају децом и својим домовима."},
	{13, "13 Јер који добро служе они добијају себи добар поступ, и велику слободу у вери Исуса Христа."},
	{14, "14 Ово ти пишем надајући се да ћу скоро доћи к теби."},
	{15, "15 Ако ли се забавим, да знаш како треба живети у дому Божијем, који је црква Бога Живога, ступ и тврђа истине."},
	{16, "16 И, као што је признато, велика је тајна побожности: Бог се јави у телу, оправда се у Духу, показа се анђелима, проповеди се незнабошцима, верова се на свету, узнесе се у слави."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct sr4 poems[] = {
	{1, "1 А Дух разговетно говори да ће у последња времена одступити неки од вере слушајући лажне духове и науке ђаволске,"},
	{2, "2 У лицемерју лажа, жигосаних на својој савести,"},
	{3, "3 Који забрањују женити се, и заповедају уздржавати се од јела која Бог створи за јело са захвалношћу вернима и онима који познаше истину."},
	{4, "4 Јер је свако створење Божије добро и ништа није на одмет кад се прима са захвалношћу."},
	{5, "5 Јер се освећује речју Божијом и молитвом."},
	{6, "6 Ово све казујући браћи бићеш добар слуга Исуса Христа, одгајен речима вере и добром науком коју си примио."},
	{7, "7 А поганих и бапских гаталица клони се; а обучавај се у побожности."},
	{8, "8 Јер телесно обучавање мало је корисно, а побожност је корисна за свашта, имајући обећање живота садашњег и оног који иде."},
	{9, "9 Ово је истинита реч и достојна сваког примања."},
	{10, "10 Јер се зато и трудимо и бивамо срамотни, јер се уздамо у Бога Живог, који је Спаситељ свим људима, а особито вернима."},
	{11, "11 Ово заповедај и учи."},
	{12, "12 Нико да не постане немарљив за твоју младост; него буди углед вернима у речи, у живљењу, у љубави, у духу, у вери, у чистоти."},
	{13, "13 Докле дођем пази на читање, утешавање и учење."},
	{14, "14 Не пусти у немар дар у себи који ти је дан по пророштву метнувши старешине руке на тебе."},
	{15, "15 У овом се поучавај, у овом стој, да се напредак твој покаже у свему."},
	{16, "16 Пази на себе и на науку, и стој у томе; јер ово чинећи спашћеш и самог себе и оне који те слушају."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct sr5 poems[] = {
	{1, "1 Старца не карај, него му говори као оцу; момцима као браћи;"},
	{2, "2 Старицама као матерама; младима као сестрама, са сваком чистотом."},
	{3, "3 Удовице поштуј, које су праве удовице."},
	{4, "4 Ако ли која удовица има децу или унучад, да се уче најпре свој дом поштовати, и зајам враћати родитељима; јер је ово угодно пред Богом."},
	{5, "5 А права удовица и усамљена узда се у Бога, и живи у молитвама и у мољењу дан и ноћ."},
	{6, "6 А која живи у сладостима, жива је умрла."},
	{7, "7 И ово заповедај, да буду без мане."},
	{8, "8 Ако ли ко за своје, а особито за домаће, не промишља, одрекао се вере, и гори је од незнабошца."},
	{9, "9 А удовица да се не прима млађа од шездесет година, и која је била једном мужу жена;"},
	{10, "10 И која има сведочанство у добрим делима, ако је децу одгајила, ако је гостољубива била, ако је светима ноге прала, ако је невољнима помагала, ако је ишла за сваким добрим делом."},
	{11, "11 А младих удовица прођи се; јер кад побесне против Христа, хоће да се удају,"},
	{12, "12 И имају грех што прву веру одбацише."},
	{13, "13 А к томе и беспослене уче се скитати по кућама, не само пак беспослене, него и језичне и свезнале, па говоре шта не треба."},
	{14, "14 Хоћу, дакле, да се младе удовице удају, децу рађају, кућу куће, а никакав узрок да не дају противнику за хуљење."},
	{15, "15 Јер се, ево, неке окренуше за сотоном."},
	{16, "16 Ако који верни или верна има удовице, нека се стара за њих, и да не досађују цркви да оне које су праве удовице може задовољити."},
	{17, "17 А свештеницима који се добро старају да се даје двогуба част, а особито онима који се труде у речи и у науци."},
	{18, "18 Јер писмо говори: Волу који врше не завезуј уста, и: Радин је достојан своје плате."},
	{19, "19 На свештеника не примај тужбе, осим кад имају два или три сведока."},
	{20, "20 А који греше покарај их пред свима, да и други имају страх."},
	{21, "21 Заклињем те пред Богом и Господом Исусом Христом и изабраним Његовим анђелима да ово држиш без лицемерја, не чинећи ништа по хатеру."},
	{22, "22 Руку одмах не мећи ни на кога, нити пристај у туђе грехе. Држи себе чиста."},
	{23, "23 Више не пиј воде, него пиј по мало вина, желуца ради свог и честих својих болести."},
	{24, "24 А неких су људи греси познати који напред воде на суд, а неких иду за њима."},
	{25, "25 Тако су и добра дела позната, и која су другачија не могу се сакрити."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct sr6 poems[] = {
	{1, "1 Робови који су год под јармом да показују сваку част својим господарима, да се не хули на име Божије и на науку."},
	{2, "2 А који имају крштене господаре, да не постају немарљиви за њих што су браћа, него још боље да служе, јер су верни и љубазни, заједничари у благодати. Ово учи и саветуј."},
	{3, "3 Ако ли ко другачије учи, и не пристаје на здраве речи Господа нашег Исуса Христа и на науку побожну,"},
	{4, "4 Наду се не знајући ништа, него болујући од запиткивања и празних препирања, ода шта постаје завист, свађа, хуљење, зле мисли,"},
	{5, "5 Залудна препирања онаквих људи који имају ум изопачен и немају истине, који мисле да је побожност трговина. Клони се таквих."},
	{6, "6 Али јесте велика трговина побожност са задовољством."},
	{7, "7 Јер ништа не донесосмо на овај свет, дакле не можемо ништа ни однети."},
	{8, "8 А кад имамо храну и одећу, овим да будемо довољни."},
	{9, "9 А који хоће да се обогате они упадају у напасти и замке, и у многе луде шкодљиве жеље, које потапају човека у пропаст и погибао."},
	{10, "10 Јер је корен свих зала среброљубље коме неки предавши се зађоше од вере и на себе навукоше муке велике."},
	{11, "11 А ти, о човече Божији! Бежи од овог, а иди за правдом, побожности, вером, љубави, трпљењем, кротости."},
	{12, "12 Бори се у доброј борби вере, мучи се за вечни живот на који си и позван, и признао си добро признање пред многим сведоцима."},
	{13, "13 Заповедам ти пред Богом који све оживљује, и Христом Исусом који сведочи за владања Понтија Пилата добро признање,"},
	{14, "14 Да држиш заповест чисту и незазорну до доласка Господа нашег Исуса Христа,"},
	{15, "15 Који ће у своје време показати, Блажени и једини Силни Цар над царевима и Господар над господарима,"},
	{16, "16 Који сам има бесмртност, и живи у светлости којој се не може приступити, ког нико од људи није видео, нити може видети, коме част и држава вечна. Амин."},
	{17, "17 Богатима на овом свету заповедај да се не поносе нити уздају у богатство пропадљиво, него у Бога Живога, који нам све даје изобилно за ужитак;"},
	{18, "18 Нека добро чине, нека се богате у добрим делима, нека буду подашни, заједнични,"},
	{19, "19 Сабирајући себи темељ добар за унапредак, да приме живот вечни."},
	{20, "20 О Тимотије! Сачувај што ти је предано, клони се поганих, празних разговора и препирања лажно названог разума,"},
	{21, "21 Којим се неки хвалећи отпадоше од вере. Благодат с тобом. Амин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};