#include <map>
#include <string>
class Bible19
{
	struct sr1	{ int val; const char *msg; };
	struct sr2	{ int val; const char *msg; };
	struct sr3	{ int val; const char *msg; };
	struct sr4	{ int val; const char *msg; };
	struct sr5	{ int val; const char *msg; };
	struct sr6	{ int val; const char *msg; };
	struct sr7	{ int val; const char *msg; };
	struct sr8	{ int val; const char *msg; };
	struct sr9	{ int val; const char *msg; };
	struct sr10	{ int val; const char *msg; };
	struct sr11	{ int val; const char *msg; };
	struct sr12	{ int val; const char *msg; };
	struct sr13	{ int val; const char *msg; };
	struct sr14	{ int val; const char *msg; };
	struct sr15	{ int val; const char *msg; };
	struct sr16	{ int val; const char *msg; };
	struct sr17	{ int val; const char *msg; };
	struct sr18	{ int val; const char *msg; };
	struct sr19	{ int val; const char *msg; };
	struct sr20	{ int val; const char *msg; };
	struct sr21	{ int val; const char *msg; };
	struct sr22	{ int val; const char *msg; };
	struct sr23	{ int val; const char *msg; };
	struct sr24	{ int val; const char *msg; };
	struct sr25	{ int val; const char *msg; };
	struct sr26	{ int val; const char *msg; };
	struct sr27	{ int val; const char *msg; };
	struct sr28	{ int val; const char *msg; };
	struct sr29	{ int val; const char *msg; };
	struct sr30	{ int val; const char *msg; };
	struct sr31	{ int val; const char *msg; };
	struct sr32	{ int val; const char *msg; };
	struct sr33	{ int val; const char *msg; };
	struct sr34	{ int val; const char *msg; };
	struct sr35	{ int val; const char *msg; };
	struct sr36	{ int val; const char *msg; };
	struct sr37	{ int val; const char *msg; };
	struct sr38	{ int val; const char *msg; };
	struct sr39	{ int val; const char *msg; };
	struct sr40	{ int val; const char *msg; };
	struct sr41	{ int val; const char *msg; };
	struct sr42	{ int val; const char *msg; };
	struct sr43	{ int val; const char *msg; };
	struct sr44	{ int val; const char *msg; };
	struct sr45	{ int val; const char *msg; };
	struct sr46	{ int val; const char *msg; };
	struct sr47	{ int val; const char *msg; };
	struct sr48	{ int val; const char *msg; };
	struct sr49	{ int val; const char *msg; };
	struct sr50	{ int val; const char *msg; };
	struct sr51	{ int val; const char *msg; };
	struct sr52	{ int val; const char *msg; };
	struct sr53	{ int val; const char *msg; };
	struct sr54	{ int val; const char *msg; };
	struct sr55	{ int val; const char *msg; };
	struct sr56	{ int val; const char *msg; };
	struct sr57	{ int val; const char *msg; };
	struct sr58	{ int val; const char *msg; };
	struct sr59	{ int val; const char *msg; };
	struct sr60	{ int val; const char *msg; };
	struct sr61	{ int val; const char *msg; };
	struct sr62	{ int val; const char *msg; };
	struct sr63	{ int val; const char *msg; };
	struct sr64	{ int val; const char *msg; };
	struct sr65	{ int val; const char *msg; };
	struct sr66	{ int val; const char *msg; };
	struct sr67	{ int val; const char *msg; };
	struct sr68	{ int val; const char *msg; };
	struct sr69	{ int val; const char *msg; };
	struct sr70	{ int val; const char *msg; };
	struct sr71	{ int val; const char *msg; };
	struct sr72	{ int val; const char *msg; };
	struct sr73	{ int val; const char *msg; };
	struct sr74	{ int val; const char *msg; };
	struct sr75	{ int val; const char *msg; };
	struct sr76	{ int val; const char *msg; };
	struct sr77	{ int val; const char *msg; };
	struct sr78	{ int val; const char *msg; };
	struct sr79	{ int val; const char *msg; };
	struct sr80	{ int val; const char *msg; };
	struct sr81	{ int val; const char *msg; };
	struct sr82	{ int val; const char *msg; };
	struct sr83	{ int val; const char *msg; };
	struct sr84	{ int val; const char *msg; };
	struct sr85	{ int val; const char *msg; };
	struct sr86	{ int val; const char *msg; };
	struct sr87	{ int val; const char *msg; };
	struct sr88	{ int val; const char *msg; };
	struct sr89	{ int val; const char *msg; };
	struct sr90	{ int val; const char *msg; };
	struct sr91	{ int val; const char *msg; };
	struct sr92	{ int val; const char *msg; };
	struct sr93	{ int val; const char *msg; };
	struct sr94	{ int val; const char *msg; };
	struct sr95	{ int val; const char *msg; };
	struct sr96	{ int val; const char *msg; };
	struct sr97	{ int val; const char *msg; };
	struct sr98	{ int val; const char *msg; };
	struct sr99	{ int val; const char *msg; };
	struct sr100	{ int val; const char *msg; };
	struct sr101	{ int val; const char *msg; };
	struct sr102	{ int val; const char *msg; };
	struct sr103	{ int val; const char *msg; };
	struct sr104	{ int val; const char *msg; };
	struct sr105	{ int val; const char *msg; };
	struct sr106	{ int val; const char *msg; };
	struct sr107	{ int val; const char *msg; };
	struct sr108	{ int val; const char *msg; };
	struct sr109	{ int val; const char *msg; };
	struct sr110	{ int val; const char *msg; };
	struct sr111	{ int val; const char *msg; };
	struct sr112	{ int val; const char *msg; };
	struct sr113	{ int val; const char *msg; };
	struct sr114	{ int val; const char *msg; };
	struct sr115	{ int val; const char *msg; };
	struct sr116	{ int val; const char *msg; };
	struct sr117	{ int val; const char *msg; };
	struct sr118	{ int val; const char *msg; };
	struct sr119	{ int val; const char *msg; };
	struct sr120	{ int val; const char *msg; };
	struct sr121	{ int val; const char *msg; };
	struct sr122	{ int val; const char *msg; };
	struct sr123	{ int val; const char *msg; };
	struct sr124	{ int val; const char *msg; };
	struct sr125	{ int val; const char *msg; };
	struct sr126	{ int val; const char *msg; };
	struct sr127	{ int val; const char *msg; };
	struct sr128	{ int val; const char *msg; };
	struct sr129	{ int val; const char *msg; };
	struct sr130	{ int val; const char *msg; };
	struct sr131	{ int val; const char *msg; };
	struct sr132	{ int val; const char *msg; };
	struct sr133	{ int val; const char *msg; };
	struct sr134	{ int val; const char *msg; };
	struct sr135	{ int val; const char *msg; };
	struct sr136	{ int val; const char *msg; };
	struct sr137	{ int val; const char *msg; };
	struct sr138	{ int val; const char *msg; };
	struct sr139	{ int val; const char *msg; };
	struct sr140	{ int val; const char *msg; };
	struct sr141	{ int val; const char *msg; };
	struct sr142	{ int val; const char *msg; };
	struct sr143	{ int val; const char *msg; };
	struct sr144	{ int val; const char *msg; };
	struct sr145	{ int val; const char *msg; };
	struct sr146	{ int val; const char *msg; };
	struct sr147	{ int val; const char *msg; };
	struct sr148	{ int val; const char *msg; };
	struct sr149	{ int val; const char *msg; };
	struct sr150	{ int val; const char *msg; };
public:
static void view1() {
struct sr1 poems[] = {
	{1, "1 Благо човеку који не иде на веће безбожничко, и на путу грешничком не стоји, и у друштву неваљалих људи не седи,"},
	{2, "2 Него му је омилео закон Господњи и о закону Његовом мисли дан и ноћ!"},
	{3, "3 Он је као дрво усађено крај потока, које род свој доноси у своје време, и коме лист не вене: шта год ради, у свему напредује."},
	{4, "4 Нису такви безбожници, него су као прах који расипа ветар."},
	{5, "5 Зато се неће безбожници одржати на суду, ни грешници на збору праведничком."},
	{6, "6 Јер Господ зна пут праведнички; а пут безбожнички пропашће."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct sr2 poems[] = {
	{1, "1 Зашто се буне народи и племена помишљају залудне ствари?"},
	{2, "2 Устају цареви земаљски, и кнезови се скупљају на Господа и на помазаника Његовог."},
	{3, "3 'Раскинимо свезе њихове и збацимо са себе јарам њихов.'"},
	{4, "4 Онај, што живи на небесима, смеје се, Господ им се подсмева."},
	{5, "5 Па им говори у гневу свом и јарошћу својом збуњује их:"},
	{6, "6 'Ја сам помазао цара свог на Сиону, на светој гори својој.'"},
	{7, "7 Казаћу наредбу Господњу; Он рече мени: 'Ти си син мој, ја те сад родих."},
	{8, "8 Ишти у мене, и даћу ти народе у наследство, и крајеве земаљске теби у државу."},
	{9, "9 Ударићеш их гвозденом палицом; разбићеш их као лончарски суд.'"},
	{10, "10 Сад, цареви, оразумите се; научите се судије земаљске!"},
	{11, "11 Служите Господу са страхом, и радујте се с трепетом."},
	{12, "12 Поштујте сина, да се не разгневи, и ви не изгинете на путу свом; јер ће се гнев Његов брзо разгорети. Благо свима који се у Њ уздају!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct sr3 poems[] = {
	{1, "1 Господе! Како је много непријатеља мојих! Многи устају на ме."},
	{2, "2 Многи говоре за душу моју: Нема му помоћи од Бога."},
	{3, "3 Али Ти си, Господе, штит који ме заклања, слава моја; Ти подижеш главу моју."},
	{4, "4 Гласом својим вичем ка Господу, и чује ме са свете горе своје."},
	{5, "5 Ја лежем, спавам и устајем, јер ме Господ чува."},
	{6, "6 Не бојим се много хиљада народа што са свих страна наваљује на ме."},
	{7, "7 Устани, Господе! Помози ми, Боже мој! Јер Ти удараш по образу све непријатеље моје; разбијаш зубе безбожницима."},
	{8, "8 Од Господа је спасење; нека буде на народу Твом благослов Твој!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct sr4 poems[] = {
	{1, "1 Кад Те зовем чуј ме, Боже, правдо моја! У тескоби дај ми простор; смилуј се на ме и услиши молитву моју."},
	{2, "2 Синови човечији! Докле ће слава моја бити у срамоти? Докле ћете љубити ништавило и тражити лажи?"},
	{3, "3 Знајте да Господ дивно чува светог свог; Господ чује кад Га зовем."},
	{4, "4 Гневећи се не грешите; размислите у срцима својим на постељама својим, и утолите."},
	{5, "5 Принесите жртву за правду, и уздајте се у Господа."},
	{6, "6 Многи говоре: Ко ће нам показати шта је добро? Обрати к нама, Господе, светло лице своје."},
	{7, "7 А мени си дао у срце радост већу него што је они имају, кад им роди пшеница и вино."},
	{8, "8 Ја мирно лежем и спавам; јер Ти, Господе, сам дајеш ми, те сам без страха."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct sr5 poems[] = {
	{1, "1 Чуј, Господе, речи моје, разуми помисли моје."},
	{2, "2 Слушај вику моју, царе мој и Боже мој! Јер се Теби молим, Господе!"},
	{3, "3 Ујутру слушаш глас мој, ујутру стојим пред Тобом, и чекам."},
	{4, "4 Јер си Ти Бог који неће безакоња; у Тебе нема места ко је зао."},
	{5, "5 Безбожници неће изаћи пред очи Твоје; Ти ненавидиш све који чине безакоње."},
	{6, "6 Потиреш лажљивце; на крвопиоце и лукаве мрзи Господ."},
	{7, "7 А ја по великој милости Твојој улазим у дом Твој, и клањам се у светој цркви Твојој са страхом Твојим."},
	{8, "8 Господе! Води ме у правди својој; ради непријатеља мојих поравни преда мном пут свој."},
	{9, "9 Јер нема у устима њиховим истине; у њима је неваљалство; грло им је гроб отворен; на језику им је дволичење."},
	{10, "10 Боже! Не дај им напретка, нека се разбију помисли њихове. За многа неваљалства њихова обори их, јер се побунише на Тебе."},
	{11, "11 Па ће се радовати сви који се у Те уздају; довека ће се веселити које Ти заклањаш; дичиће се који љубе име Твоје."},
	{12, "12 Јер Ти, Господе, благосиљаш праведника, као штитом заклањаш га милошћу својом."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct sr6 poems[] = {
	{1, "1 Господе! Немој ме покарати у јарости својој, нити ме у гневу свом наказити."},
	{2, "2 Смилуј се на ме, Господе, јер сам изнемогао; исцели ме, јер су кости моје устрептале,"},
	{3, "3 И душа се моја врло уздрхтала. А Ти, Господе, докле ћеш."},
	{4, "4 Обрати се, Господе, избави душу моју, помози ми ради милости своје."},
	{5, "5 Јер мртви не спомињу Тебе; у гробу ко ће Те славити?"},
	{6, "6 Изнемогох уздишући; сваку ноћ квасим одар свој, сузама својим натапам постељу своју."},
	{7, "7 Усахну од жалости око моје, постара се од множине непријатеља мојих."},
	{8, "8 Идите од мене сви који чините безакоње, јер Господ чу плач мој."},
	{9, "9 Чу Господ молбу моју, Господ молитву моју прими."},
	{10, "10 Нек се постиде и препадну сви непријатељи моји, нека се поврате и постиде одмах."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct sr7 poems[] = {
	{1, "1 Господе, Боже мој! У Тебе се уздам, сачувај ме од свих који ме гоне, и избави ме."},
	{2, "2 Да ми непријатељ не ишчупа душу као лав. Чупа, а нема ко да избави."},
	{3, "3 Господе, Боже мој! Ако сам то учинио, ако је неправда у рукама мојим,"},
	{4, "4 Ако сам зло вратио пријатељу свом, или криво учинио онима који на ме на правди нападаху;"},
	{5, "5 Нека гони непријатељ душу моју, и нека је стигне, и погази на земљу живот мој и славу моју у прах обрати."},
	{6, "6 Устани, Господе, у гневу свом; дигни се на жестину непријатеља мојих; пробуди се мени на помоћ, и отвори суд."},
	{7, "7 И људство ће се слећи око Тебе; изнад њега изађи у висину."},
	{8, "8 Господ суди народима. Суди ми, Господе, по правди мојој, и по безазлености мојој нека ми буде."},
	{9, "9 Нек се прекине злоћа безбожничка, а праведника потпомози, јер Ти испитујеш срца и утробе, Боже праведни!"},
	{10, "10 Штит је мени у Бога, који чува оне који су правог срца."},
	{11, "11 Бог је праведан судија, и Бог је сваки дан готов на гнев."},
	{12, "12 Ако се неће безбожник да обрати, Он оштри мач свој, натеже лук свој, и наперује га;"},
	{13, "13 И запиње смртну стрелу, чини стреле своје да пале."},
	{14, "14 Гле, безбожник заче неправду, трудан беше злочинством, и роди себи превару."},
	{15, "15 Копа јаму и ископа, и паде у јаму коју је начинио."},
	{16, "16 Злоба његова обрати се на његову главу, и злочинство његово паде на теме његово."},
	{17, "17 Хвалим Господа за правду Његову, и певам имену Господа Вишњег."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct sr8 poems[] = {
	{1, "1 Господе, Господе наш! Како је величанствено име Твоје по свој земљи! Подигао си славу своју више небеса."},
	{2, "2 У устима мале деце и која сисају чиниш себи хвалу насупрот непријатељима својим, да би учинио да замукне непријатељ и немирник."},
	{3, "3 Кад погледам небеса Твоја, дело прста Твојих, месец и звезде, које си Ти поставио;"},
	{4, "4 Шта је човек, те га се опомињеш, или син човечји, те га полазиш?"},
	{5, "5 Учинио си га мало мањег од анђела, славом и чашћу венчао си га;"},
	{6, "6 Поставио си га господарем над делима руку својих, све си метнуо под ноге његове,"},
	{7, "7 Овце и волове све, и дивље звериње,"},
	{8, "8 Птице небеске и рибе морске, шта год иде морским путевима."},
	{9, "9 Господе, Господе наш! Како је величанствено име Твоје по свој земљи!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct sr9 poems[] = {
	{1, "1 Хвалим Те, Господе, из свега срца свог, казујем сва чудеса Твоја."},
	{2, "2 Радујем се и веселим се о Теби, певам имену Твом, Вишњи!"},
	{3, "3 Непријатељи се моји вратише натраг, спотакоше се и неста их испред лица Твог;"},
	{4, "4 Јер си свршио суд мој и одбранио ме; сео си на престо, судија праведни."},
	{5, "5 Расрдио си се на народе и убио безбожника, име си им затро довека, за свагда."},
	{6, "6 Непријатељу неста мачева сасвим; градове Ти си развалио; погибе спомен њихов."},
	{7, "7 Али Господ увек живи; спремио је за суд престо свој."},
	{8, "8 Он ће судити васионом свету по правди, усудиће народима право."},
	{9, "9 Господ је уточиште убогоме, уточиште у невољи."},
	{10, "10 У Тебе се уздају који знају име Твоје, јер не остављаш оних који Те траже, Господе!"},
	{11, "11 Појте Господу, који живи на Сиону; казујте народу дела Његова;"},
	{12, "12 Јер Он освећује крв, памти је; не заборавља јаук невољних."},
	{13, "13 Смилуј се на ме, Господе; погледај како страдам од непријатеља својих, Ти, који ме подижеш од врата смртних,"},
	{14, "14 Да бих казивао све хвале Твоје на вратима кћери Сионове, и славио спасење Твоје."},
	{15, "15 Попадоше народи у јаму, коју су ископали; у замку, коју су сами наместили, ухвати се нога њихова."},
	{16, "16 Познаше Господа; Он је судио; у дела руку својих заплете се безбожник."},
	{17, "17 Вратиће се у пакао безбожници, сви народи који заборављају Бога;"},
	{18, "18 Јер неће свагда бити заборављен убоги, и нада невољницима неће никад погинути."},
	{19, "19 Устани, Господе, да се не посили човек, и да приме народи суд пред Тобом."},
	{20, "20 Пусти, Господе, страх на њих; нека познају народи да су људи."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct sr10 poems[] = {
	{1, "1 Зашто, Господе, стојиш далеко, кријеш се кад је невоља?"},
	{2, "2 С охолости безбожникове мучи се убоги; хватају се убоги преваром коју измишљају безбожници."},
	{3, "3 Јер се безбожник дичи жељом душе своје, грабљивца похваљује."},
	{4, "4 Безбожник у обести својој не мари за Господа: 'Он не види.' Нема Бога у мислима његовим."},
	{5, "5 Свагда су путеви његови криви; за судове Твоје не зна; на непријатеље своје неће ни да гледа."},
	{6, "6 У срцу свом каже: Нећу посрнути; зло неће доћи никад."},
	{7, "7 Уста су му пуна неваљалих речи, преваре и увреде, под језиком је његовим мука и погибао."},
	{8, "8 Седи у заседи иза куће; у потаји убија правога; очи његове вребају убогога."},
	{9, "9 Седи у потаји као лав у пећини; седи у заседи да ухвати убогога; хвата убогога увукавши га у мрежу своју."},
	{10, "10 Притаји се, прилегне, и убоги падају у јаке нокте његове."},
	{11, "11 Каже у срцу свом: 'Бог је заборавио, окренуо је лице своје, неће видети никад.'"},
	{12, "12 Устани Господе! Дигни руку своју, не заборави невољних."},
	{13, "13 Зашто безбожник да не мари за Бога говорећи у срцу свом да Ти нећеш видети?"},
	{14, "14 Ти видиш; јер гледаш увреде и муке и пишеш их на руци. Теби предаје себе убоги; сироти Ти си помоћник."},
	{15, "15 Сатри мишицу безбожном и злом, да се тражи и не нађе безбожност његова."},
	{16, "16 Господ је цар свагда, довека, нестаће незнабожаца са земље његове."},
	{17, "17 Господе! Ти чујеш жеље ништих; утврди срце њихово; отвори ухо своје,"},
	{18, "18 Да даш суд сироти и невољнику, да престану гонити човека са земље."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct sr11 poems[] = {
	{1, "1 У Господа се уздам; зашто говорите души мојој: 'Лети у гору као птица;"},
	{2, "2 Јер ево грешници натегоше лук, запеше стрелу своју за тетиву, да из мрака стрељају праве срцем."},
	{3, "3 Кад су раскопани темељи, шта ће учинити праведник?'"},
	{4, "4 Господ је у светом двору свом, престо је Господњи на небесима; очи Његове гледају; веђе Његове испитују синове човечије."},
	{5, "5 Господ испитује праведнога; а безбожнога и коме је мило чинити зло ненавиди душа Његова."},
	{6, "6 Пустиће на безбожнике дажд од живог угљевља, огња и сумпора; и огњени ветар биће им део из чаше;"},
	{7, "7 Јер је Господ праведан, љуби правду; лице ће Његово видети праведници."},
	{8, "1 Милост и правду певам; Тебе, Господе, славим."},
	{9, "2 Размишљам о путу правом, кад би год дошао к мени, ходим у безазлености срца свог у дому свом."},
	{10, "3 Не стављам пред очи своје речи непотребне, мрзим на дела која су против закона, не пристајем за њима."},
	{11, "4 Срце покварено далеко је од мене; злих не знам."},
	{12, "5 Ко тајно опада ближњег свог, тог изгоним; ко је охолог ока и надутог срца, тог не трпим."},
	{13, "6 Очи су моје обраћене на верне на земљи, да би седели са мном. Ко ходи путем правим, тај служи мени."},
	{14, "7 Не живи у дому мом који ради лукаво; који говори лаж, не стоји пред очима мојим."},
	{15, "8 Јутром затирем све безбожнике на земљи, да бих истребио из града Господњег све који чине безакоње."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct sr12 poems[] = {
	{1, "1 Помагај, Господе; јер неста светих, јер је мало верних међу синовима човечијим"},
	{2, "2 Лаж говоре један другом, уснама лажљивим говоре из срца дволичног."},
	{3, "3 Истребиће Господ сва уста лажљива, језик величави,"},
	{4, "4 Људе, који говоре: Језиком смо јаки, уста су наша у нас, ко је господар над нама?"},
	{5, "5 Видећи страдање невољних и уздисање ништих, сад ћу устати, вели Господ, и избавити оног коме злобе"},
	{6, "6 Речи су Господње речи чисте, сребро у ватри очишћено од земље, седам пута претопљено."},
	{7, "7 Ти ћеш нас, Господе, одбранити, и сачувати нас од рода овог довека."},
	{8, "8 Безбожници иду наоколо; кад се они подижу, срамоте се синови човечији."},
	{9, "1 Господе! Чуј молитву моју, и вика моја нек изађе преда Те."},
	{10, "2 Немој одвратити лице своје од мене; у дан кад сам у невољи пригни к мени ухо своје, у дан кад Те призивам, похитај, услиши ме."},
	{11, "3 Јер прођоше као дим дани моји, кости моје као топионица огореше."},
	{12, "4 Покошено је као трава и посахло срце моје, да заборавих јести хлеб свој."},
	{13, "5 Од уздисања мог приону кост моја за месо моје."},
	{14, "6 Постадох као гем у пустињи; ја сам као сова на зидинама."},
	{15, "7 Не спавам, и седим као птица без друга на крову."},
	{16, "8 Сваки дан руже ме непријатељи моји, и који су се помамили на мене, мном се уклињу."},
	{17, "9 Једем пепео као хлеб, и пиће своје растварам сузама."},
	{18, "10 Од гнева Твог и срдње Твоје; јер подигавши ме бацио си ме."},
	{19, "11 Дани су моји као сен, који пролази, и ја као трава осуших се."},
	{20, "12 А Ти, Господе, остајеш довека, и спомен Твој од колена до колена."},
	{21, "13 Ти ћеш устати, смиловаћеш се на Сион, јер је време смиловати се на њ, јер је дошло време;"},
	{22, "14 Јер слугама Твојим омиле и камење његово, и прах његов жале."},
	{23, "15 Тада ће се незнабошци бојати имена Господњег, и сви цареви земаљски славе Његове;"},
	{24, "16 Јер ће Господ сазидати Сион, и јавити се у слави својој;"},
	{25, "17 Погледаће на молитву оних који немају помоћи, и неће се оглушити молбе њихове."},
	{26, "18 Написаће се ово потоњем роду, и народ наново створен хвалиће Господа."},
	{27, "19 Што је приникао са свете висине своје, Господ погледао с неба на земљу."},
	{28, "20 Да чује уздисање сужњево, и одреши синове смртне;"},
	{29, "21 Да би казивали на Сиону име Господње и хвалу Његову у Јерусалиму,"},
	{30, "22 Кад се скупе народи и царства да служе Господу."},
	{31, "23 Строшио је на путу крепост моју, скратио дане моје."},
	{32, "24 Рекох: Боже мој! Немој ме узети у половини дана мојих. Твоје су године од колена до колена."},
	{33, "25 Давно си поставио земљу, и небеса су дело руку Твојих."},
	{34, "26 То ће проћи, а Ти ћеш остати; све ће то као хаљина оветшати, као хаљину променићеш их и промениће се."},
	{35, "27 Али Ти си тај исти и године Твоје неће истећи."},
	{36, "28 Синови ће слуга Твојих живети, и семе ће се њихово утврдити пред лицем Твојим."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct sr13 poems[] = {
	{1, "1 Докле ћеш ме, Господе, сасвим заборављати? Докле ћеш одвраћати лице своје од мене?"},
	{2, "2 Докле ћу се домишљати у души својој, мутити се у срцу свом дан и ноћ? Докле ће се непријатељ мој подизати нада мном?"},
	{3, "3 Погледај, услиши ме, Господе, Боже мој! Просветли очи моје да не заспим на смрт."},
	{4, "4 Да не рече непријатељ мој: Надвладао сам га; да се не радују који ме гоне, ако посрнем."},
	{5, "5 А ја се уздам у милост Твоју; радоваће се срце моје за спасење Твоје."},
	{6, "6 Певаћу Господу, који ми добро чини."},
	{7, "1 Благосиљај, душо моја, Господа, и све што је у мени свето име Његово."},
	{8, "2 Благосиљај, душо моја, Господа, и не заборављај ниједно добро што ти је учинио."},
	{9, "3 Он ти прашта све грехе и исцељује све болести твоје;"},
	{10, "4 Избавља од гроба живот твој, венчава те добротом и милошћу;"},
	{11, "5 Испуња добрим жеље твоје, понавља се као у орла младост твоја."},
	{12, "6 Господ твори правду и суд свима којима се криво чини."},
	{13, "7 Показа путеве своје Мојсију, синовима Израиљевим дела своја."},
	{14, "8 Милостив је и добар Господ, спор на гнев и веома благ."},
	{15, "9 Не гневи се једнако, нити се довека срди."},
	{16, "10 Не поступа с нама по гресима нашим, нити нам враћа по неправдама нашим."},
	{17, "11 Него колико је небо високо од земље, толика је милост Његова к онима који Га се боје."},
	{18, "12 Колико је исток далеко од запада, толико удаљује од нас безакоња наша."},
	{19, "13 Како отац жали синове, тако Господ жали оне који Га се боје."},
	{20, "14 Јер зна грађу нашу, опомиње се да смо прах."},
	{21, "15 Дани су човечији као трава; као цвет у пољу, тако цвета."},
	{22, "16 Дуне ветар на њ, и нестане га, нити ће га више познати место његово."},
	{23, "17 Али милост Господња остаје од века и довека на онима који Га се боје, и правда Његова на синовима синова,"},
	{24, "18 Који држе завет Његов, и памте заповести Његове, да их извршују."},
	{25, "19 Господ на небесима постави престо свој, и царство Његово свим влада."},
	{26, "20 Благосиљајте Господа анђели Његови, који сте силни крепошћу, извршујете реч Његову слушајући глас речи Његове."},
	{27, "21 Благосиљајте Господа све војске Његове, слуге Његове, које творите вољу Његову."},
	{28, "22 Благосиљајте Господа сва дела Његова, по свим местима владе Његове! Благосиљај, душо моја Господа!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct sr14 poems[] = {
	{1, "1 Рече безумник у срцу свом: Нема Бога; неваљали су, гадна су дела њихова; нема никога да добро твори."},
	{2, "2 Господ погледа с неба на синове човечије, да види има ли који разуман, тражи ли који Бога."},
	{3, "3 Сви су зашли, сви се покварили, нема никога добро да твори, нема ни једног."},
	{4, "4 Зар се неће опаметити који чине безакоње, једу народ мој као што једу хлеб, не призивају Господа?"},
	{5, "5 Онде ће задрхтати од страха; јер је Господ у роду праведном."},
	{6, "6 Смејете се ономе што убоги ради; али Господ њега заклања."},
	{7, "7 Ко ће послати са Сиона помоћ Израиљу? Кад Господ поврати заробљени народ свој, онда ће се радовати Јаков и веселиће се Израиљ."},
	{8, "1 Благосиљај, душо моја, Господа! Господе, Боже мој, велик си веома, обукао си се у величанство и красоту."},
	{9, "2 Обукао си светлост као хаљину, разапео небо као шатор;"},
	{10, "3 Водом си покрио дворове своје, облаке начинио си да су Ти кола, идеш на крилима ветреним."},
	{11, "4 Чиниш ветрове да су Ти анђели, пламен огњени да су Ти слуге."},
	{12, "5 Утврдио си земљу на темељима њеним, да се не помести на век века."},
	{13, "6 Безданом као хаљином оденуо си је; на горама стоје воде."},
	{14, "7 Од претње Твоје беже, од громовног гласа Твог теку."},
	{15, "8 Излазе на горе и силазе у долине, на место које си им утврдио."},
	{16, "9 Поставио си међу, преко које не прелазе, и не враћају се да покрију земљу."},
	{17, "10 Извео си изворе по долинама, између гора теку воде."},
	{18, "11 Напајају све звери пољске; дивљи магарци гасе жеђ своју."},
	{19, "12 На њима птице небеске живе; кроз гране разлеже се глас њихов."},
	{20, "13 Напајаш горе с висина својих, плодовима дела Твојих сити се земља."},
	{21, "14 Дајеш те расте трава стоци, и зелен на корист човеку, да би извадио хлеб из земље."},
	{22, "15 И вино весели срце човеку, и лице се светли од уља, и хлеб срце човеку крепи."},
	{23, "16 Сите се дрвета Божија, кедри ливански, које си посадио."},
	{24, "17 На њима птице вију гнезда; станак је родин на јелама."},
	{25, "18 Горе високе дивокозама, камен је уточиште зечевима."},
	{26, "19 Створио си месец да показује времена, сунце познаје запад свој."},
	{27, "20 Стереш таму, и бива ноћ, по којој излази све зверје шумско;"},
	{28, "21 Лавови ричу за пленом, и траже од Бога хране себи."},
	{29, "22 Сунце гране, и они се сакривају и лежу у ложе своје."},
	{30, "23 Излази човек на посао свој, и на рад свој до вечера."},
	{31, "24 Како је много дела Твојих, Господе! Све си премудро створио; пуна је земља блага Твог."},
	{32, "25 Гле, море велико и широко, ту гмижу без броја, животиња мала и велика;"},
	{33, "26 Ту лађе плове, крокодил, ког си створио да се игра по њему."},
	{34, "27 Све Тебе чека, да им дајеш пићу на време."},
	{35, "28 Дајеш им, примају; отвориш руку своју, сите се добра."},
	{36, "29 Одвратиш лице своје, жалосте се; узмеш им дух, гину, и у прах свој враћају се."},
	{37, "30 Пошаљеш дух свој, постају, и понављаш лице земљи."},
	{38, "31 Слава Господу увек; нек се весели Господ за дела своја!"},
	{39, "32 Он погледа на земљу, и она се тресе; дотакне се гора, и диме се."},
	{40, "33 Певаћу Господу за живота свог; хвалићу Бога свог док сам год."},
	{41, "34 Нека Му буде мила беседа моја! Веселићу се о Господу."},
	{42, "35 Нека нестане грешника са земље, и безбожника нека не буде више! Благосиљај, душо моја, Господа! Алилуја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct sr15 poems[] = {
	{1, "1 Господе! Ко може седети у сеници Твојој? Ко може наставати на светој гори Твојој?"},
	{2, "2 Ко ходи без мане, твори правду, и говори истину из срца свог;"},
	{3, "3 Ко не опада језиком својим, не чини другом зло, и не ружи ближњег свог;"},
	{4, "4 Ко не гледа оног кога је Бог одбацио, него поштује оне који се боје Господа; ко се куне ближњему па не пориче;"},
	{5, "5 Ко не даје сребро своје на добит, и не прима мито на правога. Ко овако ради, неће посрнути довека."},
	{6, "1 Хвалите Господа; гласите име Његово; јављајте по народима дела Његова."},
	{7, "2 Певајте Му и славите Га; казујте сва чудеса Његова."},
	{8, "3 Хвалите се светим именом Његовим; нек се весели срце оних који траже Господа."},
	{9, "4 Тражите Господа и силу Његову, тражите лице Његово без престанка."},
	{10, "5 Памтите чудеса Његова која је учинио, знаке Његове и судове уста Његових."},
	{11, "6 Семе Аврамово слуге су Његове, синови Јаковљеви изабрани Његови."},
	{12, "7 Он је Господ Бог наш, по свој су земљи судови Његови."},
	{13, "8 Памти увек завет свој, реч, коју је дао на хиљаду колена."},
	{14, "9 Шта је заветовао Авраму, и за шта се клео Исаку."},
	{15, "10 То је поставио Јакову за закон, и Израиљу за завет вечни,"},
	{16, "11 Говорећи: Теби ћу дати земљу хананску у наследни део."},
	{17, "12 Тада их још беше мало на број, беше их мало, и беху дошљаци."},
	{18, "13 Иђаху од народа до народа, из једног царства к другом племену."},
	{19, "14 Не даде никоме да им науди, и караше за њих цареве:"},
	{20, "15 'Не дирајте у помазанике моје, и пророцима мојим не чините зла.'"},
	{21, "16 И пусти глад на ону земљу; и потре сав хлеб што је за храну."},
	{22, "17 Посла пред њима човека; у робље продан би Јосиф."},
	{23, "18 Оковима стегоше ноге његове, гвожђе тишташе душу његову,"},
	{24, "19 Док се стече реч његова, и реч Господња прослави га."},
	{25, "20 Посла цар и одреши га; господар над народима, и пусти га."},
	{26, "21 Постави га господарем над домом својим, и заповедником над свим што имаше."},
	{27, "22 Да влада над кнезовима његовим по својој вољи, и старешине његове уразумљује."},
	{28, "23 Тада дође Израиљ у Мисир, и Јаков се пресели у земљу Хамову."},
	{29, "24 И намножи Бог народ свој и учини га јачег од непријатеља његових."},
	{30, "25 Преврну се срце њихово те омрзнуше на народ Његов, и чинише лукавство слугама Његовим."},
	{31, "26 Посла Мојсија, слугу свог, Арона изабраника свог."},
	{32, "27 Показаше међу њима чудотворну силу Његову и знаке Његове у земљи Хамовој."},
	{33, "28 Пусти мрак и замрачи, и не противише се речи Његовој."},
	{34, "29 Претвори воду њихову у крв, и помори рибу њихову."},
	{35, "30 Провре земља њихова жабама, и клети царева њихових."},
	{36, "31 Рече, и дођоше бубине, уши по свим крајевима њиховим."},
	{37, "32 Место дажда посла на њих град, живи огањ на земљу њихову."},
	{38, "33 И поби чокоте њихове и смокве њихове, и потре дрвета у крајевима њиховим."},
	{39, "34 Рече, и дођоше скакавци и гусенице небројене;"},
	{40, "35 И изједоше сву траву по земљи њиховој, и поједоше род у пољу њихову."},
	{41, "36 И поби све првенце у земљи њиховој, првине сваког труда њиховог."},
	{42, "37 Изведе Израиљце са сребром и златом, и не беше сустала у племенима њиховим."},
	{43, "38 Обрадова се Мисир изласку њиховом, јер страх њихов беше на њ пао."},
	{44, "39 Разастре им облак за покривач, и огањ да светли ноћу."},
	{45, "40 Молише, и посла им препелице, и хлебом их небеским храни."},
	{46, "41 Отвори камен и протече вода, реке протекоше по сувој пустињи."},
	{47, "42 Јер се опомињаше свете речи своје к Авраму, слузи свом."},
	{48, "43 И изведе народ свој у радости, избране своје у весељу."},
	{49, "44 И даде им земљу народа и труд туђинаца у наследство."},
	{50, "45 Да би чували заповести Његове, и законе Његове пазили. Алилуја."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct sr16 poems[] = {
	{1, "1 Чувај ме, Боже; јер се у Те уздам."},
	{2, "2 Рекох Господу: Ти си Господ мој, немам добра осим Тебе."},
	{3, "3 У светима који су на земљи и у великима сва је утеха моја."},
	{4, "4 Нека други умножавају идоле своје, нека трче к туђима; ја им нећу лити крваве наливе, нити ћу метнути имена њихова у уста своја."},
	{5, "5 Господ је мој део наследства и чаше; Ти подижеш достојање моје."},
	{6, "6 Уже ми је захватило прекрасна места, и део ми је мој мио."},
	{7, "7 Благосиљам Господа, који ме уразумљује; томе ме и ноћу учи шта је у мени."},
	{8, "8 Свагда видим пред собом Господа: Он ми је с десне стране да не посрнем."},
	{9, "9 Тога ради радује се срце моје, и весели се језик мој, још ће се и тело моје смирити у уздању;"},
	{10, "10 Јер нећеш оставити душу моју у паклу, нити ћеш дати да Светац Твој види трулост."},
	{11, "11 Показаћеш ми пут животни: обиље је радости пред лицем Твојим, утеха у десници Твојој довека."},
	{12, "1 Хвалите Господа, јер је добар, јер је довека милост Његова."},
	{13, "2 Ко ће исказати силу Господњу? Испричати сву славу Његову?"},
	{14, "3 Благо онима који држе истину и творе право свагда!"},
	{15, "4 Опомени ме се, Господе, по својој милости к народу свом; походи ме помоћу својом,"},
	{16, "5 Да бих видео у добру изабране Твоје, веселио се у весељу народа Твог, хвалио се заједно с наследством Твојим."},
	{17, "6 Згрешисмо с оцима својим, постасмо кривци, безаконици."},
	{18, "7 Оци наши у Мисиру не разумеше чудеса Твојих, не опомињаше се великих милости Твојих, и викаше крај мора, крај Црвеног Мора."},
	{19, "8 Али им Он поможе имена свог ради, да би показао силу своју."},
	{20, "9 Запрети Црвеном Мору, и пресахну; и преведе их преко бездане као преко пустиње;"},
	{21, "10 И сачува их од руке ненавидникове, и избави их из руке непријатељеве."},
	{22, "11 Покри вода непријатеље њихове, ниједан од њих не оста."},
	{23, "12 Тада вероваше речима Његовим, и певаше Му хвалу."},
	{24, "13 Али брзо заборавише дела Његова, и не почекаше воље Његове."},
	{25, "14 Полакомише се у пустињи, и стадоше кушати Бога у земљи где се не живи."},
	{26, "15 Он испуни молбу њихову, али посла погибао на душу њихову."},
	{27, "16 Позавидеше Мојсију и Арону, ког беше Господ осветио."},
	{28, "17 Раседе се земља, и прождре Датана и затрпа чету Авиронову."},
	{29, "18 И спали огањ чету њихову, и пламен сажеже безбожнике."},
	{30, "19 Начинише теле код Хорива, и клањаху се кипу."},
	{31, "20 Мењаху славу своју на прилику вола, који једе траву."},
	{32, "21 Заборавише Бога, Спаситеља свог, који је учинио велика дела у Мисиру,"},
	{33, "22 Дивна у земљи Хамовој, страшна на Црвеном Мору."},
	{34, "23 И хтеде их истребити, да Мојсије изабраник Његов не стаде као у раселини пред Њим, и не одврати јарост Његову да их не истреби."},
	{35, "24 После не марише за земљу жељену, не вероваше речи Његовој."},
	{36, "25 Побунише се у шаторима својим, не слушаше глас Господњи."},
	{37, "26 И Он подиже руку своју на њих, да их побије у пустињи,"},
	{38, "27 Да побије племе њихово међу народима, и расеје их по земљама."},
	{39, "28 И присташе за Велфегором, и једоше принесено на жртву мртвима."},
	{40, "29 И расрдише Бога делима својим, и удари у њих погибао."},
	{41, "30 И устаде Финес, и умилостиви, и престаде погибао."},
	{42, "31 И то му се прими у правду, од колена до колена довека."},
	{43, "32 И разгневише Бога на води Мериви, и Мојсије пострада њих ради;"},
	{44, "33 Јер дотужише духу његовом, и погреши устима својим."},
	{45, "34 Не истребише народе, за које им је Господ рекао;"},
	{46, "35 Него се помешаше с незнабошцима, и научише дела њихова."},
	{47, "36 Стадоше служити идолима њиховим, и они им бише замка."},
	{48, "37 Синове своје и кћери своје приносише на жртву ђаволима."},
	{49, "38 Проливаше крв праву; крв синова својих и кћери својих, које приношаху на жртву идолима хананским, и оскврни се земља крвним делима."},
	{50, "39 Оскврнише себе делима својим, и чинише прељубу поступањем својим."},
	{51, "40 И плану гнев Господњи на народ Његов, и омрзну Му део Његов."},
	{52, "41 И предаде их у руке незнабожачке, и ненавидници њихови стадоше господарити над њима."},
	{53, "42 Досађиваше им непријатељи њихови, и они бише покорени под власт њихову."},
	{54, "43 Много их је пута избављао, али Га они срдише намерама својим, и бише поништени за безакоње своје."},
	{55, "44 Али Он погледа на невољу њихову, чувши тужњаву њихову,"},
	{56, "45 И опомену се завета свог с њима, и покаја се по великој милости својој;"},
	{57, "46 И учини, те их стадоше жалити сви који их беху заробили."},
	{58, "47 Спаси нас, Господе Боже наш, и покупи нас из незнабожаца, да славимо свето име Твоје, да се хвалимо Твојом славом!"},
	{59, "48 Благословен Господ Бог Израиљев од века и довека! И сав народ нека каже: Амин! Алилуја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct sr17 poems[] = {
	{1, "1 Услиши, Господе, правду, чуј глас мој, прими у уши молитву моју не из уста лажљивих."},
	{2, "2 Од лица Твог нека изађе суд мој, очи Твоје нека погледају на правицу."},
	{3, "3 Испитај срце моје, обиђи ноћу; у огњу ме окушај, и нећеш наћи неправде моје."},
	{4, "4 Уста се моја не дохватају дела људских; ради речи уста Твојих држим се путева оштрих."},
	{5, "5 Утврди стопе моје на стазама својим да не залазе кораци моји."},
	{6, "6 Тебе призивам, јер ћеш ме услишити Боже! Пригни к мени ухо своје, и чуј речи моје."},
	{7, "7 Покажи дивну милост своју, који избављаш оне који се у Те уздају од оних који се противе десници Твојој."},
	{8, "8 Чувај ме као зеницу ока: сеном крила својих заклони ме"},
	{9, "9 Од безбожника који ме нападају, од непријатеља душе моје, који су ме опколили."},
	{10, "10 Срце своје затворише; устима својим говоре охоло."},
	{11, "11 Изагнавши ме опет су око мене; очи су своје упрли да ме оборе на земљу."},
	{12, "12 Они су као лав који хоће да растрже, и као лавић који седи у потаји."},
	{13, "13 Устани, Господе, претеци их, обори их. Одбрани душу моју мачем својим од безбожника,"},
	{14, "14 Руком својом, Господе, од људи ових, од људи овог света, којима је део овај живот, којима си трбух напунио свог богатства, да ће им и синови бити сити и остатак оставити својој деци."},
	{15, "15 А ја ћу у правди гледати лице Твоје; кад се пробудим, бићу сит од прилике Твоје."},
	{16, "1 Хвалите Господа, јер је добар; јер је довека милост Његова."},
	{17, "2 Тако нека кажу које је избавио Господ, које је избавио из руке непријатељеве,"},
	{18, "3 Скупио их из земаља, од истока и запада, од севера и мора."},
	{19, "4 Луташе по пустињи где се не живи, пута граду насељеном не находише;"},
	{20, "5 Беху гладни и жедни, и душа њихова изнемагаше у њима;"},
	{21, "6 Али завикаше ка Господу у тузи својој; и избави их из невоље њихове."},
	{22, "7 И изведе их на прав пут, који иде у град насељени."},
	{23, "8 Нека хвале Господа за милост Његову, и за чудеса Његова ради синова људских!"},
	{24, "9 Јер сити душу ташту, и душу гладну пуни добра."},
	{25, "10 Седеше у тами и у сену смртном, оковани у тугу и у гвожђе;"},
	{26, "11 Јер не слушаше речи Божијих, и не марише за вољу Вишњег."},
	{27, "12 Он поништи срце њихово страдањем; спотакоше се, и не беше кога да помогне."},
	{28, "13 Али завикаше ка Господу у тузи својој, и избави их из невоље њихове;"},
	{29, "14 Изведе их из таме и сена смртног, и раскиде окове њихове."},
	{30, "15 Нека хвале Господа за милост Његову, и за чудеса Његова ради синова људских!"},
	{31, "16 Јер разби врата бронзана, и преворнице гвоздене сломи."},
	{32, "17 Безумници страдаше за неваљале путеве своје, и за неправде своје."},
	{33, "18 Свако се јело гадило души њиховој, и дођоше до врата смртних."},
	{34, "19 Али завикаше ка Господу у тузи својој, и избави их из невоље њихове."},
	{35, "20 Посла реч своју и исцели их, и избави их из гроба њиховог."},
	{36, "21 Нека хвале Господа за милост Његову, и за чудеса Његова ради синова људских!"},
	{37, "22 И нека принесу жртву за хвалу, и казују дела Његова у песмама!"},
	{38, "23 Који плове по мору на корабљима, и раде на великим водама,"},
	{39, "24 Они су видели дела Господња, и чудеса Његова у дубини."},
	{40, "25 Каже, и диже се силан ветар, и устају вали на њему,"},
	{41, "26 Дижу се до небеса и спуштају до бездана: душа се њихова у невољи разлива;"},
	{42, "27 Посрћу и љуљају се као пијани; све мудрости њихове нестаје."},
	{43, "28 Али завикаше ка Господу у тузи својој, и изведе их из невоље њихове."},
	{44, "29 Он обраћа ветар у тишину, и вали њихови умукну."},
	{45, "30 Веселе се кад се стишају, и води их у пристаниште које желе."},
	{46, "31 Нека хвале Господа за милост Његову, и за чудеса Његова ради синова људских!"},
	{47, "32 Нека Га узвишују на сабору народном, на скупштини старешинској славе Га!"},
	{48, "33 Он претвара реке у пустињу, и изворе водене у сухоту,"},
	{49, "34 Родну земљу у слану пустару за неваљалство оних који живе на њој."},
	{50, "35 Он претвара пустињу у језера, и суву земљу у изворе водене,"},
	{51, "36 И насељава онамо гладне. Они зидају градове за живљење;"},
	{52, "37 Сеју поља, саде винограде и сабирају летину."},
	{53, "38 Благосиља их и множе се јако, и стоке им не умањује."},
	{54, "39 Пре их беше мало, падаху од зла и невоље, што их стизаше."},
	{55, "40 Он сипа срамоту на кнезове, и оставља их да лутају по пустињи где нема путева."},
	{56, "41 Он извлачи убогога из невоље, и племена множи као стадо."},
	{57, "42 Добри виде и радују се, а свако неваљалство затискује уста своја."},
	{58, "43 Ко је мудар, нека запамти ово, и нека познају милости Господње."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct sr18 poems[] = {
	{1, "1 Љубићу Те, Господе, крепости моја,"},
	{2, "2 Господе, Граде мој, Заклоне мој, који се оборити не може, Избавитељу мој, Боже мој, Камена горо, на којој се не бојим зла, Штите мој, Роже спасења мог, Уточиште моје!"},
	{3, "3 Призивам Господа, коме се клањати ваља, и опраштам се непријатеља својих."},
	{4, "4 Обузеше ме смртне болести, и потоци неваљалих људи уплашише ме."},
	{5, "5 Опколише ме болести паклене, стегоше ме замке смртне."},
	{6, "6 У својој тескоби призвах Господа, и к Богу свом повиках; Он чу из двора свог глас мој, и вика моја дође Му до ушију."},
	{7, "7 Затресе се и поколеба се земља, задрмаше се и померише из темеља горе, јер се Он разљути."},
	{8, "8 Подиже се дим од гнева Његовог, из уста Његових огањ, који прождире и живо угљевље одскакаше од Њега."},
	{9, "9 Сави небеса и сиђе. Мрак беше под ногама Његовим."},
	{10, "10 Седе на херувима и подиже се, и полете на крилима ветреним."},
	{11, "11 Од мрака начини себи кров, сеницу око себе, од мрачних вода, облака ваздушних."},
	{12, "12 Од севања пред Њим кроз облаке Његове удари град и живо угљевље."},
	{13, "13 Загрме на небесима Господ, и Вишњи пусти глас свој, град и живо угљевље."},
	{14, "14 Пусти стреле своје, и разметну их; силу муња, и расу их."},
	{15, "15 И показаше се извори водени, и открише се темељи васиљени од претње Твоје, Господе, од дихања духа гнева Твог."},
	{16, "16 Тада пружи с висине руку, ухвати ме, извуче ме из воде велике."},
	{17, "17 Избави ме од непријатеља мог силног и од мојих ненавидника, кад беху јачи од мене."},
	{18, "18 Усташе на ме у дан невоље моје, али ми Господ би потпора."},
	{19, "19 Изведе ме на пространо место, и избави ме, јер сам Му мио."},
	{20, "20 Даде ми Господ по правди мојој, и за чистоту руку мојих дарива ме."},
	{21, "21 Јер се држах путева Господњих, и не одметнух се Бога свог,"},
	{22, "22 Него су сви закони Његови преда мном, и заповести Његове не уклањам од себе."},
	{23, "23 Бих Му веран, и чувах се од безакоња свог."},
	{24, "24 Даде ми Господ по правди мојој, по чистоти руку мојих пред очима Његовим."},
	{25, "25 Са светима поступаш свето, с човеком верним верно,"},
	{26, "26 С чистим чисто, а с неваљалим насупрот њему."},
	{27, "27 Јер Ти помажеш људима невољним, а очи поносите понижаваш."},
	{28, "28 Ти распаљујеш видело моје; Господ мој просветљује таму моју."},
	{29, "29 С Тобом разбијам војску, и с Богом својим скачем преко зида."},
	{30, "30 Пут је Господњи веран, реч Господња чиста. Он је штит свима који се у Њ уздају."},
	{31, "31 Јер ко је Бог осим Господа, и ко је одбрана осим Бога нашег?"},
	{32, "32 Овај Бог опасује ме снагом, и чини ми веран пут."},
	{33, "33 Даје ми ноге као у јелена, и на висине ставља ме."},
	{34, "34 Учи руке моје боју, и мишице моје чини да су лук од бронзе."},
	{35, "35 Ти ми дајеш штит спасења свог; десница Твоја држи ме, и милост Твоја чини ме велика."},
	{36, "36 Ти шириш корак мој, те се не спотичу ноге моје."},
	{37, "37 Терам непријатеље своје и стижем их, и не враћам се док их не истребим."},
	{38, "38 Обарам их, и не могу устати, падају под ноге моје."},
	{39, "39 Јер ме Ти опасујеш снагом за бој, и који устану на ме, обараш их преда мном."},
	{40, "40 Непријатеља мојих плећи Ти ми обраћаш, и потирем ненавиднике своје."},
	{41, "41 Они вичу, али немају помагача, ка Господу, али их Он не слуша."},
	{42, "42 Расипам их као прах по ветру, као блато по улицама газим их."},
	{43, "43 Ти ме избављаш од буне народне, постављаш ме да сам глава туђим племенима; народ ког не познавах, служи ми."},
	{44, "44 По самом чувењу слушају ме, туђини покорни су ми."},
	{45, "45 Туђини бледе, дрхћу у градовима својим."},
	{46, "46 Жив је Господ, и да је благословен бранич мој! Да се узвиси Бог спасења мог,"},
	{47, "47 Бог, који ми даје освету, и покорава ми народе,"},
	{48, "48 Који ме избавља од непријатеља, подиже ме над оне који устају на ме и од човека жестоког избавља ме!"},
	{49, "49 Тога ради хвалим Те, Господе, пред народима, и певам имену Твом,"},
	{50, "50 Који славно избављаш цара свог, и чиниш милост помазанику свом Давиду и наслеђу његовом довека."},
	{51, "1 Готово је срце моје, Боже; певаћу и хвалићу заједно са славом својом."},
	{52, "2 Прени се псалтире и гусле, устаћу рано."},
	{53, "3 Славићу Тебе, Господе, по народима, појаћу Теби по племенима."},
	{54, "4 Јер је сврх небеса милост Твоја и до облака истина Твоја."},
	{55, "5 Узвиси се више небеса, Боже, и по свој земљи нека буде слава Твоја!"},
	{56, "6 Да би се избавили мили Твоји, помози десницом својом, и услиши ме."},
	{57, "7 Бог рече у светињи својој: 'Веселићу се, разделићу Сихем, и долину Сокот размерићу."},
	{58, "8 Мој је Галад, мој је Манасија, Јефрем је крепост главе моје, Јуда скиптар мој."},
	{59, "9 Моав је чаша из које се умивам, Едому ћу пружити обућу своју; над земљом филистејском попеваћу.'"},
	{60, "10 Ко ће ме одвести у тврди град? Ко ће ме отпратити до Едома?"},
	{61, "11 Зар нећеш Ти, Боже, који си нас одбацио, и не идеш, Боже, с војскама нашим?"},
	{62, "12 Дај нам помоћ у тескоби, одбрана је човечија узалуд."},
	{63, "13 Богом смо јаки; Он гази непријатеље наше."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct sr19 poems[] = {
	{1, "1 Небеса казују славу Божју, и дела руку Његових гласи свод небески."},
	{2, "2 Дан дану доказује, и ноћ ноћи јавља."},
	{3, "3 Нема језика, нити има говора, где се не би чуо глас њихов."},
	{4, "4 По свој земљи иде казивање њихово и речи њихове на крај васиљене. Сунцу је поставио стан на њима;"},
	{5, "5 И оно излази као женик из ложнице своје, као јунак весело тече путем."},
	{6, "6 Излазак му је накрај неба, и ход му до краја његовог; и нико није сакривен од топлоте његове."},
	{7, "7 Закон је Господњи савршен, крепи душу; сведочанство је Господње верно, даје мудрост невештоме."},
	{8, "8 Наредбе су Господње праведне, веселе срце. Заповест је Господња светла, просветљује очи."},
	{9, "9 Страх је Господњи чист, остаје довека. Судови су Његови истинити, праведни свиколики."},
	{10, "10 Бољи су од злата и драгог камења, слађи од меда који тече из саћа."},
	{11, "11 И слугу Твог они су просветлили; ко их држи има велику плату."},
	{12, "12 Ко ће знати све своје погрешке? Очисти ме и од тајних;"},
	{13, "13 И од вољних сачувај слугу свог, да не овладају мноме. Тада ћу бити савршен и чист од великог преступа."},
	{14, "14 Да су Му речи уста мојих угодне, и помисао срца мог пред Тобом, Господе, крепости моја и Избавитељу мој!"},
	{15, "1 Боже, славо моја, немој ћутати,"},
	{16, "2 Јер се уста безбожничка и уста лукава на ме отворише; говоре са мном језиком лажљивим."},
	{17, "3 Речима злобним са свих страна гоне ме, и оружају се на ме низашта."},
	{18, "4 За љубав моју устају на мене, а ја се молим."},
	{19, "5 Враћају ми зло за добро, и мржњу за љубав моју."},
	{20, "6 Постави над њим старешину безбожника, и противник нека му стане с десне стране."},
	{21, "7 Кад се стане судити, нека изађе крив, и молитва његова нека буде грех."},
	{22, "8 Нека буду дани његови кратки, и власт његову нека добије други."},
	{23, "9 Деца његова нек буду сироте, и жена његова удовица."},
	{24, "10 Деца његова нек се потуцају и просе, и нека траже хлеба изван својих пустолина."},
	{25, "11 Нека му узме дужник све што има, и нека разграбе туђини муку његову."},
	{26, "12 Нек се не нађе нико ко би га љубио, ни ко би се смиловао на сироте његове."},
	{27, "13 Наслеђе његово нек се затре, у другом колену нека погине име њихово."},
	{28, "14 Безакоње старих његових нек се спомене у Господа, и грех матере његове нек се не избрише."},
	{29, "15 Нека буду свагда пред Господом, и Он нека истреби спомен њихов на земљи;"},
	{30, "16 Зато што се није сећао чинити милост, него је гонио човека ништег и убогог, и тужном у срцу тражио смрт."},
	{31, "17 Љубио је клетву, нека га и стигне; није марио за благослов, нека и отиде од њега."},
	{32, "18 Нек се обуче у клетву као у хаљину, и она нек уђе у њега као вода, и као уље у кости његове."},
	{33, "19 Нек му она буде као хаљина, у коју се облачи, и као појас, којим се свагда паше."},
	{34, "20 Таква плата нек буде од Господа онима који ме ненавиде, и који говоре зло на душу моју."},
	{35, "21 А мени, Господе, Господе, учини шта приличи имену Твом. Ти си добар, милошћу својом избави ме."},
	{36, "22 Јер сам невољан и ништ, и срце је моје рањено у мени."},
	{37, "23 Нестаје ме као сена, кад се одмиче; терају ме као скакавце."},
	{38, "24 Колена моја изнемогоше од поста, и тело моје омрша."},
	{39, "25 Постадох подсмех њима; видећи ме машу главом својом."},
	{40, "26 Помози ми, Господе, Боже мој, спаси ме по милости својој."},
	{41, "27 Нека познају да је ово Твоја рука, и Ти, Господе, да си ово учинио."},
	{42, "28 Они куну, а Ти благослови; устају, али нек се постиде, и слуга се Твој обрадује."},
	{43, "29 Нек се противници моји обуку у срамоту, и као хаљином нек се покрију стидом својим."},
	{44, "30 Хвалићу Господа веома устима својим, и усред многих славићу Га,"},
	{45, "31 Јер стоји с десне стране убогоме, да би га спасао од оних који осуђују душу његову."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct sr20 poems[] = {
	{1, "1 Да те услиши Господ у дан жалосни, да те заштити име Бога Јаковљевог."},
	{2, "2 Да ти пошаље помоћ из светиње, и са Сиона да те поткрепи."},
	{3, "3 Да се опомене свих приноса твојих, и жртва твоја паљеница да се нађе претила."},
	{4, "4 Да ти да Господ по срцу твом; шта год почнеш, да ти изврши."},
	{5, "5 Радоваћемо се за спасење твоје, и у име Бога свог подигнућемо заставу. Да испуни Господ све молбе твоје."},
	{6, "6 Сад видим да Господ чува помазаника свог; слуша га са светог неба свог; јака је десница Његова, која спасава."},
	{7, "7 Једни се хвале колима, други коњима, а ми именом Господа Бога свог."},
	{8, "8 Они посрћу и падају, а ми стојимо и не колебамо се."},
	{9, "9 Господе! Помози цару, и услиши нас кад Те зовемо."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct sr21 poems[] = {
	{1, "1 Господе! С Твоје се силе весели цар; и како му је велика радост што Ти помажеш!"},
	{2, "2 Шта му је срце желело, дао си му, и молитве уста његових ниси одбио."},
	{3, "3 Јер си га дочекао благословима милосним, метнуо си му на главу венац од драгог камења."},
	{4, "4 Молио Те је за живот и дао си му да му се продуже дани довека."},
	{5, "5 Велика је слава његова Твојом помоћу; славу си и красоту метнуо на њ."},
	{6, "6 Дао си му благослове довека, развеселио си га радошћу лица свог."},
	{7, "7 Јер се цар узда у Господа и у милост Вишњег; и не колеба се."},
	{8, "8 Наћи ће рука Твоја све непријатеље Твоје, наћи ће десница Твоја оне који мрзе на Тебе."},
	{9, "9 Учинићеш их као пећ зажарену, кад се разгневиш; гнев ће их Господњи прогутати, и огањ ће их прождрети."},
	{10, "10 Род њихов истребићеш са земље, и семе њихово између синова човечијих;"},
	{11, "11 Јер подигоше на Тебе зло, смислише и не могоше извршити."},
	{12, "12 Јер ћеш их метнути за белегу, из лукова својих пустићеш стреле у лице њихово."},
	{13, "13 Подигни се Господе, силом својом; ми ћемо певати и славити јакост Твоју."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct sr22 poems[] = {
	{1, "1 Боже, Боже мој! Зашто си ме оставио удаљивши се од спасења мог, од речи вике моје?"},
	{2, "2 Боже мој! Вичем дању, а Ти ме не слушаш, и ноћу али немам мира."},
	{3, "3 Свети, који живиш у похвалама Израиљевим!"},
	{4, "4 У Тебе се уздаше оци наши, уздаше се, и Ти си их избављао."},
	{5, "5 Тебе призиваше, и спасаваше се; у Тебе се уздаше, и не осташе у срамоти."},
	{6, "6 А ја сам црв, а не човек; подсмех људима и руг народу."},
	{7, "7 Који ме виде, сви ми се ругају, разваљују уста, машу главом,"},
	{8, "8 И говоре ослонио се на Господа, нека му помогне, нека га избави, ако га милује."},
	{9, "9 Та, Ти си ме извадио из утробе; Ти си ме умирио на сиси матере моје."},
	{10, "10 За Тобом пристајем од рођења, од утробе матере моје Ти си Бог мој."},
	{11, "11 Не удаљуј се од мене; јер је невоља близу, а нема помоћника."},
	{12, "12 Оптече ме мноштво телаца; јаки волови васански опколише ме;"},
	{13, "13 Развалише на ме уста своја. Лав је гладан и риче."},
	{14, "14 Као вода разлих се; расуше се све кости моје; срце моје поста као восак, растопило се у мени."},
	{15, "15 Сасуши се као цреп крепост моја, и језик мој приону за грло, и у прах смртни мећеш ме."},
	{16, "16 Опколише ме пси многи; чета зликоваца иде око мене, прободоше руке моје и ноге моје."},
	{17, "17 Могао бих избројати све кости своје. Они гледају, и од мене начинише ствар за гледање."},
	{18, "18 Деле хаљине моје међу собом, и за доламу моју бацају жреб."},
	{19, "19 Али Ти, Господе, не удаљуј се. Сило моја, похитај ми у помоћ."},
	{20, "20 Избави од мача душу моју, од пса јединицу моју."},
	{21, "21 Сачувај ме од уста лавових, и од рогова биволових, чувши, избави ме."},
	{22, "22 Казујем име Твоје браћи; усред скупштине хвалићу Те."},
	{23, "23 Који се бојите Господа, хвалите Га. Све семе Јаковљево! Поштуј Га. Бој Га се, све семе Израиљево!"},
	{24, "24 Јер се не оглуши молитве ништег нити је одби; не одврати од њега лице своје, него га услиши кад Га зазва."},
	{25, "25 Тебе ћу хвалити на скупштини великој; завете своје свршићу пред онима који се Њега боје."},
	{26, "26 Нека једу убоги и насите се, и нека хвале Господа који Га траже; живо да буде срце ваше довека."},
	{27, "27 Опоменуће се и обратиће се ка Господу сви крајеви земаљски, и поклониће се пред Њим сва племена незнабожачка."},
	{28, "28 Јер је Господње царство; Он влада народима."},
	{29, "29 Јешће и поклониће се сви претили на земљи; пред Њим ће пасти сви који силазе у прах, који не могу сачувати душу своју у животу."},
	{30, "30 Семе ће њихово служити Њему. Казиваће се за Господа роду потоњем."},
	{31, "31 Доћи ће, и казиваће правду Његову људима његовим, који ће се родити; јер је Он учинио ово."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view23() {
struct sr23 poems[] = {
	{1, "1 Господ је пастир мој, ништа ми неће недостајати."},
	{2, "2 На зеленој паши пасе ме, води ме на тиху воду."},
	{3, "3 Душу моју опоравља, води ме стазама праведним имена ради свог."},
	{4, "4 Да пођем и долином сена смртнога, нећу се бојати зла; јер си Ти са мном; штап Твој и палица Твоја теши ме."},
	{5, "5 Поставио си преда мном трпезу на видику непријатељима мојим; намазао си уљем главу моју, и чаша је моја препуна."},
	{6, "6 Да! Доброта и милост Твоја пратиће ме у све дане живота мог, и ја ћу наставати у дому Господњем задуго."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view24() {
struct sr24 poems[] = {
	{1, "1 Господња је земља и шта је год у њој, васиљена и све што живи на њој."},
	{2, "2 Јер је Он на морима основа, и посред река утврди је."},
	{3, "3 Ко ће изаћи на гору Господњу? И ко ће стати на светом месту његовом?"},
	{4, "4 У кога су чисте руке и срце безазлено, ко не изриче име Његово узалуд и не куне се лажно."},
	{5, "5 Он ће добити благослов од Господа, и милост од Бога, спаса свог."},
	{6, "6 Такав је род оних који Га траже, и који су ради стајати пред лицем Твојим, Боже Јаковљев!"},
	{7, "7 Врата! Узвисите врхове своје, узвисите се врата вечна! Иде цар славе."},
	{8, "8 Ко је тај цар славе? Господ крепак и силан, Господ силан у боју."},
	{9, "9 Врата! Узвисите врхове своје, узвисите се врата вечна! Иде цар славе."},
	{10, "10 Ко је тај цар славе! Господ над војскама; Он је цар славе."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view25() {
struct sr25 poems[] = {
	{1, "1 К Теби, Господе, подижем душу своју."},
	{2, "2 Боже мој! У Тебе се уздам; не дај да се осрамотим, да ми се не свете непријатељи моји."},
	{3, "3 И који се год у Те уздају, неће се осрамотити; осрамотиће се они који се одмећу од Тебе беспутно."},
	{4, "4 Покажи ми, Господе, путеве своје, научи ме ходити стазама Твојим."},
	{5, "5 Упути ме истини својој, и научи ме; јер си Ти Бог спасења мог, Теби се надам сваки дан."},
	{6, "6 Опомени се милосрђа свог, Господе, и милости своје; јер су откако је века."},
	{7, "7 Грехова младости моје, и мојих преступа не помињи; по милости својој помени мене, ради доброте своје, Господе!"},
	{8, "8 Добар је и праведан Господ; тога ради показује грешницима пут."},
	{9, "9 Упућује кротке истини, учи кротке ходити путем Његовим."},
	{10, "10 Сви су путеви Господњи милост и истина онима који држе завет Његов и откривење Његово."},
	{11, "11 Ради имена свог, Господе, опрости грех мој, јер је велик."},
	{12, "12 Који се човек боји Господа? Он ће му показати који пут да изабере."},
	{13, "13 Душа ће његова у добру почивати, и семе ће његово владати земљом."},
	{14, "14 Тајна је Господња у оних који Га се боје, и завет свој јавља им."},
	{15, "15 Очи су ми свагда управљене ка Господу, јер Он извлачи из замке ноге моје."},
	{16, "16 Погледај ме и смилуј се на ме, јер сам инокосан и невољник."},
	{17, "17 Нек се рашири стиснуто срце моје, из тескобе моје извади ме."},
	{18, "18 Види јаде моје и муку моју, и опрости ми све грехове моје."},
	{19, "19 Погледај непријатеље моје како их је много и каквом ме пакосном ненавишћу ненавиде."},
	{20, "20 Сачувај душу моју и избави ме; не дај да се осрамотим, јер се у Тебе уздам."},
	{21, "21 Безазленост и правда нека ме сачува, јер се у Тебе уздам."},
	{22, "22 Избави, Боже, Израиља од свих невоља његових."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view26() {
struct sr26 poems[] = {
	{1, "1 Суди ми, Господе, јер у простоти својој ходим и у Господа се уздам; нећу се поколебати."},
	{2, "2 Испитај ме, Господе, и искушај ме; претопи шта је у мени и срце моје."},
	{3, "3 Јер је милост Твоја пред очима мојим, и ходим у истини Твојој."},
	{4, "4 Не седим с безумницима, и с лукавима се не мешам."},
	{5, "5 Ненавидим друштво безаконичко, и с безбожницима не седим."},
	{6, "6 Умивам правдом руке своје, и идем око жртвеника Твог, Господе,"},
	{7, "7 Да разглашујем хвалу Твоју и казујем сва чудеса Твоја."},
	{8, "8 Господе! Омилео ми је стан дома Твог, и место насеља славе Твоје."},
	{9, "9 Немој душу моју погубити, ни живот мој с крвопиоцима,"},
	{10, "10 Којима је злочинство у рукама, и којима је десница пуна мита."},
	{11, "11 А ја ходим у простоти својој, избави ме, и смилуј се на ме."},
	{12, "12 Нога моја стоји на правом путу; на скупштинама ћу благосиљати Господа."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view27() {
struct sr27 poems[] = {
	{1, "1 Господ је видело моје и спасење моје; кога да се бојим? Господ је крепост живота мог; кога да се страшим?"},
	{2, "2 Ако навале на ме зликовци да поједу тело моје, противници и непријатељи моји, спотаћи ће се и пашће."},
	{3, "3 Ако против мене војска у логор стане, неће се уплашити срце моје; ако се на ме рат дигне, ја се ни онда нећу бојати."},
	{4, "4 За једно само молим Господа, само то иштем, да живим у дому Господњем све дане живота свог, да гледам красоту Господњу и раним у цркву Његову."},
	{5, "5 Јер би ме сакрио у колиби својој у зло доба; склонио би ме под кровом шатора свог; на камену гору попео би ме."},
	{6, "6 Тада бих подигао главу своју пред непријатељима који би ме опколили; принео бих у Његовом шатору жртву хвале; запевао бих и хвалио Господа."},
	{7, "7 Чуј, Господе, глас мој, Тебе призивам, смилуј се на ме и услиши ме."},
	{8, "8 Срце моје говори пред Тобом што си рекао: 'Тражите лице моје.' Тражим лице Твоје, Господе!"},
	{9, "9 Немој одвратити од мене лице своје, немој у гневу оставити слугу свог; буди Помоћник мој; немој ме одбити, и немој ме оставити, Боже, Спаситељу мој!"},
	{10, "10 Јер отац мој и мати моја оставише ме; али Господ нека ме прихвати."},
	{11, "11 Упути ме, Господе, на пут свој и води ме правом стазом поради оних који ме вребају."},
	{12, "12 Немој ме дати на вољу непријатељима мојим; јер усташе на ме лажни сведоци; али злоба говори сама против себе."},
	{13, "13 Верујем да ћу видети доброту Господњу на земљи живих."},
	{14, "14 Уздај се у Господа, буди слободан; нека буде срце твоје крепко, уздај се у Господа."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view28() {
struct sr28 poems[] = {
	{1, "1 К Теби, Господе, вичем; граде мој, немој ми ћутати, да не бих, ако заћутиш, био као они који одлазе у гроб."},
	{2, "2 Чуј молитвени глас мој, кад вапим к Теби, кад дижем руке своје к светој цркви Твојој."},
	{3, "3 Немој ме захватити с грешницима, и с онима који чине неправду, који с ближњима својим мирно говоре, а у срцу им је зло."},
	{4, "4 Подај им, Господе, по делима њиховим, по злом поступању њиховом; по делима руку њихових подај им, подај им шта су заслужили."},
	{5, "5 Јер не пазе на дела Господња, и на дела руку Његових. Да их разори и не сазида."},
	{6, "6 Да је благословен Господ, јер услиши глас мољења мог!"},
	{7, "7 Господ је крепост моја и штит мој; у Њега се поузда срце моје, и Он ми поможе. Зато се весели срце моје, и песмом својом славим Га."},
	{8, "8 Господ је крепост народа свог, и обрана која спасава помазаника Његовог."},
	{9, "9 Спаси народ свој, благослови достојање своје; спаси их и уздижи их довека."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view29() {
struct sr29 poems[] = {
	{1, "1 Дајте Господу, синови Божји, дајте Господу славу и част."},
	{2, "2 Дајте Господу славу имена Његовог. Поклоните се Господу у светој красоти."},
	{3, "3 Глас је Господњи над водом, Бог славе грми, Господ је над водом великом."},
	{4, "4 Глас је Господњи силан, глас је Господњи славан."},
	{5, "5 Глас Господњи ломи кедре, Господ ломи кедре ливанске."},
	{6, "6 Као теле скачу од Њега; Ливан и Сирион као млад биво."},
	{7, "7 Глас Господњи сипа пламен огњени."},
	{8, "8 Глас Господњи потреса пустињу, потреса Господ пустињу Кадес."},
	{9, "9 Глас Господњи опрашта кошуте бремена, и са шума скида одело; и у цркви Његовој све говори о слави Његовој."},
	{10, "10 Господ је седео над потопом, и седеће Господ као цар увек."},
	{11, "11 Господ ће дати силу народу свом, Господ ће благословити народ свој миром."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view30() {
struct sr30 poems[] = {
	{1, "1 Узвишаваћу Те, Господе, јер си ме отео, и ниси дао непријатељима мојим да ми се свете."},
	{2, "2 Господе, Боже мој! Завиках к Теби, и исцелио си ме."},
	{3, "3 Господе! Извео си из пакла душу моју, и оживео си ме да не сиђем у гроб."},
	{4, "4 Појте Господу, свеци Његови, и славите свето име Његово."},
	{5, "5 Гнев је Његов за тренуће ока, а до живота милост Његова, вечером долази плач, а јутром радост."},
	{6, "6 И ја рекох у добру свом: Нећу посрнути довека."},
	{7, "7 Ти хтеде, Господе, те гора моја стајаше тврдо. Ти одврати лице своје, и ја се сметох."},
	{8, "8 Тада Тебе, Господе, зазивах, и Господа молих:"},
	{9, "9 'Каква је корист од крви моје, да сиђем у гроб? Хоће ли Те прах славити или казивати истину Твоју?"},
	{10, "10 Чуј, Господе, и смилуј се на ме; Господе буди ми помоћник.'"},
	{11, "11 И Ти промени плач мој на радост, скиде с мене врећу. опаса ме весељем."},
	{12, "12 Зато ће Ти певати слава моја и неће умукнути; Господе, Боже мој! Довека ћу Те хвалити."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view31() {
struct sr31 poems[] = {
	{1, "1 У Тебе се, Господе, уздам; немој ме оставити под срамотом довека, по правди својој избави ме."},
	{2, "2 Пригни к мени ухо своје, похитај, помози ми. Буди ми камени град, тврда ограда, где бих се спасао."},
	{3, "3 Јер си Ти камена гора моја и ограда моја, имена свог ради води ме и управљај мном."},
	{4, "4 Извади ме из мреже коју ми тајно заместише; јер си Ти крепост моја."},
	{5, "5 У Твоју руку предајем дух свој; избављао си ме, Господе, Боже истинити!"},
	{6, "6 Ненавидим оне који поштују пропадљиве идоле; ја се у Господа уздам."},
	{7, "7 Радоваћу се и веселити се о милости Твојој, кад погледаш на моју муку, познаш тугу душе моје,"},
	{8, "8 Не даш ме у руку непријатељу, поставиш ноге моје на пространом месту."},
	{9, "9 Смилуј се на ме, Господе; јер ме је туга, од јада изнеможе око моје, душа моја и срце моје;"},
	{10, "10 Ишчиле у жалости живот мој, и године моје у уздисању; ослаби од муке крепост моја, и кости моје сасахнуше."},
	{11, "11 Од мноштва непријатеља својих постадох подсмех и суседима својим, и страшило знанцима својим; који ме виде на улици беже од мене."},
	{12, "12 Заборављен сам као мртав, нема ме у срцима; ја сам као разбијен суд."},
	{13, "13 Јер слушам грдњу од многих, од свуда страх, кад се договарају на ме, мисле ишчупати душу моју."},
	{14, "14 А ја се, Господе, у Тебе уздам и велим: Ти си Бог мој."},
	{15, "15 У Твојој су руци дани моји; отми ме из руку непријатеља мојих, и од оних, који ме гоне."},
	{16, "16 Покажи светло лице своје слузи свом; спаси ме милошћу својом."},
	{17, "17 Господе! Немој ме оставити под срамотом; јер Тебе призивам. Нек се посраме безбожници, нека замукну и падну у пакао."},
	{18, "18 Нека онеме уста лажљива, која говоре на праведника обесно, охоло и с поругом."},
	{19, "19 Како је много у Тебе добра, које чуваш за оне који Те се боје, и које дајеш онима који се у Те уздају пред синовима човечијим!"},
	{20, "20 Сакриваш их под кров лица свог од буна људских; склањаш их под сен од свадљивих језика."},
	{21, "21 Да је благословен Господ, што ми показа дивну милост као да ме уведе у тврд град!"},
	{22, "22 Ја рекох у сметњи својој: Одбачен сам од очију Твојих; али Ти чу молитвени глас мој кад Те призвах."},
	{23, "23 Љубите Господа сви свети Његови; Господ држи веру; и увршено враћа онима који поступају охоло."},
	{24, "24 Будите слободни, и нека буде јако срце ваше, сви који се у Господа уздате."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view32() {
struct sr32 poems[] = {
	{1, "1 Благо ономе, коме је опроштена кривица, коме је грех покривен."},
	{2, "2 Благо човеку, коме Господ не прима грехе и у чијем духу нема лукавства."},
	{3, "3 Кад ћутах, посахнуше кости моје од уздисања мог по вас дан."},
	{4, "4 Јер дан и ноћ тишташе ме рука Твоја; неста сока у мени као на летњој припеци."},
	{5, "5 Грех свој казах Теби, и кривице своје не затајих; рекох: Исповедам Господу преступе своје; и Ти скиде с мене кривицу греха мог."},
	{6, "6 Зато нека Ти се моли сваки светац, кад се можеш наћи; и онда потоп велике воде неће га стигнути."},
	{7, "7 Ти си заклон мој, Ти ме чуваш од тескобе; окружаваш ме радостима у избављању."},
	{8, "8 Уразумићу те, и показаћу ти пут којим да идеш; саветоваћу те, око је моје на теби."},
	{9, "9 Немојте бити као коњ, као мазга без разума, којима уздом и жвалама ваља обуздати губицу, кад не иду к Теби."},
	{10, "10 Много муке има безбожник, а који се узда у Господа, око Њега је милост."},
	{11, "11 Радујте се о Господу, и певајте, праведници; веселите се сви који сте правог срца."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view33() {
struct sr33 poems[] = {
	{1, "1 Веселите се праведници пред Господом; праведнима доликује славити."},
	{2, "2 Славите Господа гуслама, ударајте Му у псалтир од десет жица."},
	{3, "3 Певајте Му песму нову, сложно ударајте подвикујући;"},
	{4, "4 Јер је права реч Господња, и свако дело Његово истинито."},
	{5, "5 Он љуби правду и суд, доброте је Господње пуна земља."},
	{6, "6 Речју Господњом небеса се створише, и духом уста Његових сва војска њихова."},
	{7, "7 Као у гомилу сабра воду морску, и пропасти метну у спреме."},
	{8, "8 Нек се боји Господа сва земља, и нека стрепи пред Њим све што живи по васиљени;"},
	{9, "9 Јер Он рече, и постаде; Он заповеди, и показа се."},
	{10, "10 Господ разбија намере незнабошцима, уништава помисли народима."},
	{11, "11 Намера је Господња тврда довека, мисли срца његова од колена на колено."},
	{12, "12 Благо народу, коме је Бог Господ, племену, које је Он изабрао себи за наслеђе."},
	{13, "13 С неба гледа Господ, види све синове људске;"},
	{14, "14 С престола, на коме седи, погледа на све који живе на земљи."},
	{15, "15 Он је створио сва срца њихова, Он и зна сва дела њихова."},
	{16, "16 Неће помоћи цару велика сила, неће заштитити јакога велика снага;"},
	{17, "17 Није у коњу уздање да ће помоћи; ако му је и велика снага; неће избавити."},
	{18, "18 Гле, око је Господње на онима који Га се боје, и на онима који чекају милост Његову."},
	{19, "19 Он ће душу њихову избавити од смрти, и прехранити их у гладне године."},
	{20, "20 Душа се наша узда у Господа; Он је помоћ наша и штит наш."},
	{21, "21 О Њему се весели срце наше; јер се у свето име Његово уздамо."},
	{22, "22 Да буде милост Твоја, Господе, на нама, као што се уздамо у Тебе."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view34() {
struct sr34 poems[] = {
	{1, "1 Благосиљам Господа у свако доба, хвала је Његова свагда у устима мојим."},
	{2, "2 Господом се хвали душа моја; нека чују који страдају, па нека се радују."},
	{3, "3 Величајте Господа са мном, узвишујмо име Његово заједно."},
	{4, "4 Тражих Господа, и чу ме, и свих невоља мојих опрости ме."},
	{5, "5 Који у Њега гледају просветљују се, и лица се њихова неће постидети."},
	{6, "6 Овај страдалац завика, и Господ га чу, и опрости га свих невоља његових."},
	{7, "7 Анђели Господњи станом стоје око оних који се Њега боје, и избављају их."},
	{8, "8 Испитајте и видите како је добар Господ; благо човеку који се узда у Њ."},
	{9, "9 Бојте се Господа, свети Његови; јер који се Њега боје, њима нема оскудице."},
	{10, "10 Лавови су убоги и гладни, а који траже Господа, не недостаје им ниједног добра."},
	{11, "11 Ходите, децо, послушајте ме; научићу вас страху Господњем."},
	{12, "12 Који човек жели живот, љуби дане да би видео добро?"},
	{13, "13 Устављај језик свој ода зла, и уста своја од преварне речи."},
	{14, "14 Клони се ода зла, и чини добро, тражи мир и иди за њим."},
	{15, "15 Очи су Господње обраћене на праведнике, и уши Његове на јаук њихов."},
	{16, "16 Али је страшно лице Господње за оне који чине зло, да би истребио на земљи спомен њихов."},
	{17, "17 Вичу праведни, и Господ их чује, и избавља их од свих невоља њихових."},
	{18, "18 Господ је близу оних који су скрушеног срца, и помаже онима који су смерног духа."},
	{19, "19 Много невоље има праведник, али га од свих избавља Господ."},
	{20, "20 Чува Господ све кости његове, ни једна се од њих неће сломити."},
	{21, "21 Безбожника убиће зло, и који ненавиде праведника превариће се."},
	{22, "22 Господ искупљује душу слуга својих, и који се год у Њега уздају, неће се преварити."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view35() {
struct sr35 poems[] = {
	{1, "1 Господе! Буди супарник супарницима мојим; удри оне који ударају на ме."},
	{2, "2 Узми оружје и штит, и дигни се мени у помоћ."},
	{3, "3 Потегни копље, и пресеци пут онима који ме гоне, реци души мојој: Ја сам спасење твоје."},
	{4, "4 Нека се постиде и посраме који траже душу моју; нека се одбију натраг и постиде који ми зло хоће."},
	{5, "5 Нека буду као прах пред ветром, и анђео Господњи нека их прогони."},
	{6, "6 Нека буде пут њихов таман и клизав, и анђео Господњи нека их тера."},
	{7, "7 Јер низашта застреше мрежом јаму за мене, низашта ископаше јаму души мојој."},
	{8, "8 Нека дође на њега погибао ненадна, и мрежа коју је наместио нека улови њега, нека он у њу падне на погибао."},
	{9, "9 А душа ће се моја радовати о Господу, и веселиће се за помоћ Његову."},
	{10, "10 Све ће кости моје рећи: Господе! Ко је као Ти, који избављаш страдалца од оног који му досађује, и ништега и убогога од оног који га упропашћује?"},
	{11, "11 Усташе на ме лажни сведоци; шта не знам, за оно ме питају."},
	{12, "12 Плаћају ми зло за добро, и сиротовање души мојој."},
	{13, "13 Ја се у болести њиховој облачих у врећу, мучих постом душу своју, и молитва се моја враћаше у прсима мојим."},
	{14, "14 Као пријатељ, као брат поступах; бејах сетан и с обореном главом као онај који за матером жали."},
	{15, "15 А они се радују кад се ја спотакнем, и купе се, купе се на ме, задају ране, не знам зашто, чупају и не престају."},
	{16, "16 С неваљалим и подругљивим беспосличарима шкргућу на ме зубима својим."},
	{17, "17 Господе! Хоћеш ли дуго гледати? Отми душу моју од нападања њиховог, од ових лавова јединицу моју."},
	{18, "18 Признаћу Те у сабору великом, усред многог народа хвалићу Те."},
	{19, "19 Да ми се не би светили који ми злобе неправедно, и намигивали очима који мрзе на ме низашта."},
	{20, "20 Јер они не говоре о миру, него на мирне на земљи измишљају лажне ствари."},
	{21, "21 Разваљују на ме уста своја, и говоре: Добро! Добро! Види око наше."},
	{22, "22 Видиш, Господе! Немој ћутати; Господе! Немој одступити од мене."},
	{23, "23 Пробуди се, устани на суд мој, Боже мој и Господе, и на парницу моју."},
	{24, "24 Суди ми по правди својој, Господе, Боже мој, да ми се не свете."},
	{25, "25 Не дај да говоре у срцу свом: Добро! То смо хтели! Не дај да говоре: Прождресмо га."},
	{26, "26 Нек се постиде и посраме сви који се радују злу мом, нек се обуку у стид и у срам који се размећу нада мном."},
	{27, "27 Нека се радују и веселе који ми желе правду, и говоре једнако: Велик Господ, који жели мира слузи свом!"},
	{28, "28 И мој ће језик казивати правду Твоју, и хвалу Теби сваки дан."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view36() {
struct sr36 poems[] = {
	{1, "1 Безаконику је безбожна реч у срцу; нема страха Божијег пред очима његовим."},
	{2, "2 Али лаже себи у очи, место да призна своје безакоње и омрзне на њ."},
	{3, "3 Речи су уста његових неправда и лукавство, неће да се опамети да твори добро."},
	{4, "4 Безакоње смишља на постељи својој, стоји на путу рђавом, зло му није мрско."},
	{5, "5 Господе! До неба је милост Твоја, и истина Твоја до облака."},
	{6, "6 Правда је Твоја као горе Божије, судови Твоји бездана велика; људе и стоку Ти чуваш, Господе!"},
	{7, "7 Како је драгоцена милост Твоја, Боже! Синови људски у сену крила Твојих не боје се."},
	{8, "8 Хране се од изобила дома Твог, и из потока сладости својих Ти их напајаш."},
	{9, "9 Јер је у Тебе извор животу, Твојом светлошћу видимо светлост."},
	{10, "10 Рашири милост своју на оне који Те знају, и правду своју на добра срца."},
	{11, "11 Не дај да стане на мене нога охола, и рука безбожничка да ме заљуља."},
	{12, "12 Онамо нека падну који чине безакоње, нека се стропоштају и не могу устати."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view37() {
struct sr37 poems[] = {
	{1, "1 Немој се жестити гледајући неваљале, немој завидети онима који чине безакоње."},
	{2, "2 Јер се као трава брзо косе, и као зелено биље вену."},
	{3, "3 Уздај се у Господа и твори добро; живи на земљи и храни истину."},
	{4, "4 Теши се Господом, и учиниће ти шта ти срце жели."},
	{5, "5 Предај Господу пут свој, и уздај се у Њега, Он ће учинити."},
	{6, "6 И извешће као видело правду твоју, и правицу твоју као подне."},
	{7, "7 Ослони се на Господа, и чекај Га. Немој се жестити гледајући кога где напредује на путу свом, човека, који ради шта намисли."},
	{8, "8 Утишај гнев, и остави јарост; немој се дражити да зло чиниш."},
	{9, "9 Јер ће се истребити који чине зло, а који чекају Господа наследиће земљу."},
	{10, "10 Још мало, па неће бити безбожника; погледаћеш на место његово, а њега нема."},
	{11, "11 А смерни ће наследити земљу, и наслађиваће се множином мира."},
	{12, "12 Зло мисли безбожник праведнику, и шкргуће на њ зубима својим."},
	{13, "13 Али му се Господ смеје, јер види да се примиче дан његов."},
	{14, "14 Мач потежу безбожници, запињу лук свој, да оборе убогога и ништега и покољу оне који иду правим путем."},
	{15, "15 Мач ће њихов ударити у њихово срце, и лукови њихови поломиће се."},
	{16, "16 Боље је мало у праведника него богатство многих безбожника."},
	{17, "17 Јер ће се мишице безбожницима потрти, а праведнике утврђује Господ."},
	{18, "18 Зна Господ дане безазленима, и део њихов траје довека."},
	{19, "19 Неће се постидети у зло доба, у дане гладне биће сити."},
	{20, "20 А безбожници гину, и непријатељи Господњи као лепота шумска пролазе, као дим пролазе."},
	{21, "21 Безбожник узаима и не враћа, а праведник поклања и даје."},
	{22, "22 Јер које Он благослови, они наследе земљу, а које Он прокуне, они се истребе."},
	{23, "23 Господ утврђује кораке сваког човека и мио Му је пут његов."},
	{24, "24 Кад посрне да падне, неће пасти, јер га Господ држи за руку."},
	{25, "25 Бејах млад и остарех, и не видех праведника остављеног, ни деце његове да просе хлеба."},
	{26, "26 Сваки дан поклања и даје у зајам, и на наслеђу је његовом благослов."},
	{27, "27 Уклањај се ода зла, и чини добро, и живи довека."},
	{28, "28 Јер Господ љуби праведни суд, и не оставља свеце своје; увек се они чувају; а племе ће се безбожничко истребити."},
	{29, "29 Праведници ће наследити земљу, и живеће на њој довека."},
	{30, "30 Уста праведникова говоре мудрост, и језик његов казује истину."},
	{31, "31 Закон је Бога његовог њему у срцу, стопала се његова не спотичу."},
	{32, "32 Безбожник вреба праведника, и тражи да га убије;"},
	{33, "33 Али га Господ неће пустити у руке његове, нити ће дати да га окриве кад се стану судити."},
	{34, "34 Чекај Господа и држи се пута Његовог, и Он ће те поставити да владаш земљом; видећеш како ће се истребити безбожници."},
	{35, "35 Видех безбожника страшног који се рашириваше као гранато дрво;"},
	{36, "36 Али прође, и ево нема га; тражим га и не находим."},
	{37, "37 Храни чистоту и пази правду, јер ће у човека мирног остати наслеђе."},
	{38, "38 А безаконика ће нестати сасвим; наслеђе ће се безбожничко затрти."},
	{39, "39 Од Господа је спасење праведницима; Он је крепост њихова у невољи."},
	{40, "40 Господ ће им помоћи, и избавиће их; избавиће их од безбожника, и сачуваће их, јер се у Њега уздају."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view38() {
struct sr38 poems[] = {
	{1, "1 Господе! Немој ме карати у гневу свом, нити ме наказити у јарости својој."},
	{2, "2 Јер стреле Твоје устрелише ме, и рука ме Твоја тишти."},
	{3, "3 Нема здравог места на телу мом од гнева Твог; нема мира у костима мојим од греха мог."},
	{4, "4 Јер безакоња моја изађоше врх главе моје, као тешко бреме отежаше ми."},
	{5, "5 Усмрдеше се и загнојише се ране моје од безумља мог."},
	{6, "6 Згрчио сам се и погурио веома, сав дан идем сетан;"},
	{7, "7 Јер сам изнутра пун огња, и нема здравог места на телу мом."},
	{8, "8 Изнемогох и веома ослабих, ричем од трзања срца свог."},
	{9, "9 Господе! Пред Тобом су све жеље моје, и уздисање моје није од Тебе сакривено."},
	{10, "10 Срце моје јако куца, остави ме снага моја, и вид очију мојих, ни њега ми нема."},
	{11, "11 Другови моји и пријатељи моји видећи ране моје одступише, далеко стоје ближњи моји."},
	{12, "12 Који траже душу моју намештају замку, и који су ми злу ради, говоре о погибли и по сав дан мисле о превари."},
	{13, "13 А ја као глув не чујем и као нем који не отвара уста своја."},
	{14, "14 Ја сам као човек који не чује или нема у устима својим правдања."},
	{15, "15 Јер Тебе, Господе, чекам, Ти одговарај за мене, Господе, Боже мој!"},
	{16, "16 Јер рекох: Да ми се не свете, и да се не размећу нада мном, кад се спотакне нога моја."},
	{17, "17 Јер сам готов пасти, и туга је моја свагда са мном."},
	{18, "18 Признајем кривицу своју, и тужим ради греха свог."},
	{19, "19 Непријатељи моји живе, јаки су, и сила их има што ме ненавиде на правди."},
	{20, "20 Који ми враћају зло за добро, непријатељи су ми зато што сам пристао за добрим."},
	{21, "21 Немој ме оставити, Господе, Боже мој! Немој се удаљити од мене."},
	{22, "22 Похитај у помоћ мени, Господе, Спаситељу мој!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view39() {
struct sr39 poems[] = {
	{1, "1 Рекох: Чуваћу се на путевима својим да не згрешим језиком својим; зауздаваћу уста своја, док је безбожник преда мном."},
	{2, "2 Бејах нем и глас не пустих; ћутах и о добру. Али се туга моја подиже,"},
	{3, "3 Запали се срце моје у мени, у мислима мојим разгоре се огањ; проговорих језиком својим:"},
	{4, "4 Кажи ми, Господе, крај мој, и докле ће трајати дани моји? Да знам како сам ништа."},
	{5, "5 Ево с педи дао си ми дане, и век је мој као ништа пред Тобом. Баш је ништа сваки човек жив."},
	{6, "6 Баш ходи човек као утвара; баш се узалуд кида, сабира, а не зна коме ће допасти."},
	{7, "7 Па шта да чекам, Господе? Нада је моја у Теби."},
	{8, "8 Из свега безакоња мог избави ме, не дај ме безумноме на подсмех."},
	{9, "9 Нем сам, нећу отворити уста својих; јер си ме Ти ударио."},
	{10, "10 Олакшај ми ударац свој, силна рука Твоја уби ме."},
	{11, "11 Ако ћеш карати човека за преступе, расточиће се као од мољаца красота његова. Баш је ништа сваки човек."},
	{12, "12 Слушај молитву моју, Господе, и чуј јаук мој. Гледајући сузе моје немој ћутати. Јер сам гост у Тебе и дошљак као и сви стари моји."},
	{13, "13 Немој ме више гневно гледати, па ћу одахнути пре него отидем и више ме не буде."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view40() {
struct sr40 poems[] = {
	{1, "1 Дуго чеках Господа, и саже се к мени, и чу вику моју."},
	{2, "2 Извади ме из јаме, која бучи, и из глиба, и постави на камен ноге моје, и утврди стопе моје."},
	{3, "3 И метну у уста моја песму нову, хвалу Богу нашем. Виде многи, и почињу се бојати Господа, и уздати се у Њега."},
	{4, "4 Благо ономе који на Господа ставља надање своје, и не обраћа се охолима и оним који теже на лаж."},
	{5, "5 Многа су чудеса Твоја, која си учинио Господе, Боже мој, и многе су мисли Твоје с нама. Нема Ти равна. Хтео бих јављати и казивати, али им броја нема."},
	{6, "6 Жртве и дарове нећеш; Ти си ми уши отворио; жртву паљеницу и која се за грех приноси не тражиш."},
	{7, "7 И по томе рекох: Ево идем, као што је у књизи писано за мене;"},
	{8, "8 Хоћу чинити вољу Твоју, Боже мој, и закон је Твој мени у срцу."},
	{9, "9 Казујем правду на сабору великом; ево, уста својих не устављам; Господе, Ти знаш."},
	{10, "10 Правде Твоје не сакривам у срцу свом, казујем верност Твоју и спасење Твоје; и не тајим милости Твоје и истине Твоје од сабора великог."},
	{11, "11 Господе, немој затворити срца свог од мене; милост Твоја и истина Твоја једнако нека ме чувају."},
	{12, "12 Јер ме опколише зла небројена; стигоше ме неправде моје, да не могу гледати; има их више него косе на глави мојој, срце ме моје остави."},
	{13, "13 Господе, вољан буди избавити ме, Господе, похитај ми у помоћ."},
	{14, "14 Нек се постиде и посраме сви који траже погибао души мојој! Нек се врате натраг и постиде који ми желе зло."},
	{15, "15 Нек се поврате у сметњи својој који ми говоре: Ха! Ха!"},
	{16, "16 Нека се теше и веселе Тобом сви који траже Тебе Господе, и који љубе спасење Твоје, нека једнако говоре: Велик Господ!"},
	{17, "17 Ја сам несрећан и ништ, нека се Господ постара за ме! Ти си помоћ моја и Избавитељ мој, Боже мој, не часи."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view41() {
struct sr41 poems[] = {
	{1, "1 Благо ономе који разуме ништега! Господ ће га избавити у зли дан."},
	{2, "2 Господ ће га сачувати и поживеће га; биће блажен на земљи. Нећеш га дати на вољу непријатељима његовим."},
	{3, "3 Господ ће га укрепити болног на одру. Сасвим мењаш постељу његову у болести његовој."},
	{4, "4 Ја вичем: Господе! Смилуј се на ме, исцели душу моју, сагреших Ти."},
	{5, "5 Непријатељи моји говоре злобно за мене: 'Кад ће умрети, и име његово погинути?'"},
	{6, "6 И ако ко дође да ме види, ласка; срце његово слаже у себи неправду, и отишавши казује."},
	{7, "7 Шапћу о мени међу собом непријатељи моји, и мисле ми зло:"},
	{8, "8 'Зла ствар дође на њега, легао је; неће више устати.'"},
	{9, "9 И човек мира мог, у ког се уздах, који јеђаше хлеб мој, подиже на ме пету."},
	{10, "10 Али Ти, Господе, смилуј се на ме, и подигни ме; а ја ћу им вратити."},
	{11, "11 По томе ћу познати да сам Ти мио, ако се не узрадује непријатељ мој нада мном."},
	{12, "12 А мене целог сачувај, и дај ми да стојим пред лицем Твојим довека."},
	{13, "13 Благословен Бог Израиљев од века до века. Амин, амин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view42() {
struct sr42 poems[] = {
	{1, "1 Као што кошута тражи потоке, тако душа моја тражи Тебе, Боже!"},
	{2, "2 Жедна је душа моја Бога, Бога Живога, кад ћу доћи и показати се лицу Божијем?"},
	{3, "3 Сузе су ми хлеб дан и ноћ, кад ми сваки дан говоре: Где је Бог твој?"},
	{4, "4 Душа се моја пролива кад се опомињем како сам ходио сред многог људства; ступао у дом Божји, а људство празнујући певаше и подвикиваше."},
	{5, "5 Што си клонула, душо моја, и што си жалосна? Уздај се у Бога; јер ћу Га још славити, Спаситеља мог и Бога мог."},
	{6, "6 Клонула је у мени душа зато што Те помињем у земљи јорданској, на Ермону, на гори малој."},
	{7, "7 Бездана бездану дозива гласом слапова Твојих; све воде Твоје и вали Твоји на мене навалише."},
	{8, "8 Дању је јављао Господ милост своју, а ноћу Му је песма у мене, молитва Богу живота мог."},
	{9, "9 Рећи ћу Богу, граду свом: Зашто си ме заборавио? Зашто идем сетан од пакости непријатељеве?"},
	{10, "10 Који ми пакосте, пребијајући кости моје, ругају ми се говорећи ми сваки дан: Где ти је Бог?"},
	{11, "11 Што си клонула, душо моја, и што си жалосна? Уздај се у Бога; јер ћу Га још славити, Спаситеља мог и Бога мог."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view43() {
struct sr43 poems[] = {
	{1, "1 Суди ми, Боже, и расправи парбу моју с народом рђавим! Од човека неправедног и лукавог избави ме."},
	{2, "2 Јер си Ти Бог крепости моје; зашто си ме одбацио? Зашто идем сетан од пакости непријатељеве?"},
	{3, "3 Пошљи видело своје и истину своју, нека ме воде, и изведу на свету гору Твоју и у дворове Твоје."},
	{4, "4 Онда ћу приступити к жртвенику Божијем, к Богу радости и весеља свог, и уз гусле славићу Те, Боже, Боже мој!"},
	{5, "5 Што си клонула, душо моја, и што си жалосна? Уздај се у Бога; јер ћу Га још славити, Спаситеља мог и Бога мог."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view44() {
struct sr44 poems[] = {
	{1, "1 Боже, својим ушима слушасмо, оци нам наши приповедаше дело које си учинио у њихово време, у старо време."},
	{2, "2 Руком својом изгнао си народе, а њих посадио; искоренио си племена, а њих намножио."},
	{3, "3 Јер не задобише земље својим мачем, нити им мишица њихова поможе, него Твоја десница и Твоја мишица, и светлост лица Твог, јер Ти беху омилели."},
	{4, "4 Боже, царе мој, Ти си онај исти, пошљи помоћ Јакову!"},
	{5, "5 С Тобом ћемо избости непријатеље своје, и с именом Твојим изгазићемо оне који устају на нас."},
	{6, "6 Јер се не уздам у лук свој, нити ће ми мач мој помоћи."},
	{7, "7 Него ћеш нас Ти избавити од непријатеља наших, и ненавиднике наше посрамићеш."},
	{8, "8 Богом ћемо се хвалити сваки дан, и име Твоје славићемо довека."},
	{9, "9 Али сад си нас повргао и посрамио, и не идеш с војском нашом."},
	{10, "10 Обраћаш нас те бежимо испред непријатеља, и непријатељи нас наши харају."},
	{11, "11 Дао си нас као овце да нас једу, и по народима расејао си нас."},
	{12, "12 У бесцење си продао народ свој, и ниси му подигао цене."},
	{13, "13 Дао си нас на подсмех суседима нашим, да нам се ругају и срамоте нас који живе око нас."},
	{14, "14 Начинио си од нас причу у народа, гледајући нас машу главом туђинци."},
	{15, "15 Сваки је дан срамота моја преда мном, и стид је попао лице моје."},
	{16, "16 Од речи подсмевачевих и ругачевих, и од погледа непријатељевих и осветљивчевих."},
	{17, "17 Све ово снађе нас; али не заборависмо Тебе, нити преступисмо завет Твој."},
	{18, "18 Не одступи натраг срце наше, и стопе наше не зађоше с пута Твог."},
	{19, "19 Кад си нас био у земљи змајевској, и покривао нас сеном смртним,"},
	{20, "20 Онда да бејасмо заборавили име Бога свог и подигли руке своје к Богу туђем,"},
	{21, "21 Не би ли Бог изнашао то? Јер Он зна тајне у срцу."},
	{22, "22 А убијају нас за Тебе сваки дан; с нама поступају као с овцама кланицама."},
	{23, "23 Устани, што спаваш, Господе! Пробуди се, немој одбацити засвагда."},
	{24, "24 Зашто кријеш лице своје? Заборављаш невољу и муку нашу?"},
	{25, "25 Душа наша паде у прах, тело је наше бачено на земљу."},
	{26, "26 Устани, помоћи наша, и избави нас ради милости своје."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view45() {
struct sr45 poems[] = {
	{1, "1 Тече из срца мог реч добра; рекох: Дело је моје за цара; језик је мој трска хитрог писара."},
	{2, "2 Ти си најлепши између синова људских, благодат тече из уста твојих, јер те је благословио Бог довека."},
	{3, "3 Припаши, јуначе, уз бедро своје мач свој, част своју и красоту своју."},
	{4, "4 И тако окићен похитај, седи на кола за истину и кротку правду, и десница ће твоја показати чудеса."},
	{5, "5 Оштре су стреле твоје; народи ће пасти под власт твоју; прострелиће срца непријатеља царевих."},
	{6, "6 Престо је Твој, Боже, вечан и непоколебљив; скиптар је царства Твог скиптар правице."},
	{7, "7 Љубиш правду и мрзиш на безакоње; тога ради помаза те, Боже, Бог Твој уљем радости више него другове Твоје."},
	{8, "8 Све хаљине твоје миришу смирном, алојом и касијом. Који живе у дворима од минијске слонове кости, они те веселе."},
	{9, "9 Царске кћери дворе те; с десне ти стране стоји царица у офирском злату."},
	{10, "10 Чуј, кћери, погледај и обрати к мени ухо своје, заборави народ свој и дом оца свог."},
	{11, "11 И цару ће омилети лепота твоја; јер је Он Господ твој, и Њему се поклони."},
	{12, "12 Кћи Тирова доћи ће с даровима, најбогатији у народу тебе ће молити."},
	{13, "13 Сва је украшена кћи царева изнутра, хаљина јој је златом искићена."},
	{14, "14 У везеној хаљини воде је к цару; за њом воде к теби девојке, друге њене."},
	{15, "15 Воде их весело и радосно, улазе у двор царев."},
	{16, "16 Место отаца твојих биће синови твоји, поставићеш их кнезовима по свој земљи."},
	{17, "17 Учинићу да се не заборавља име твоје од колена на колено; потом ће те славити народи ва век века."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view46() {
struct sr46 poems[] = {
	{1, "1 Бог нам је уточиште и сила, помоћник, који се у невољама брзо налази."},
	{2, "2 Зато се нећемо бојати, да би се земља поместила, и горе се превалиле у срце морима."},
	{3, "3 Нека бучи и кипи вода њихова, нек се планине тресу од вала њихових;"},
	{4, "4 Потоци веселе град Божји, свети стан Вишњег."},
	{5, "5 Бог је усред њега, неће се поместити, Бог му помаже од зоре."},
	{6, "6 Узбучаше народи, задрмаше се царства; али Он пусти глас свој и земља се растапаше."},
	{7, "7 Господ над војскама с нама је, бранич је наш Бог Јаковљев."},
	{8, "8 Ходите и видите дела Господа, који учини чудеса на земљи,"},
	{9, "9 Прекиде ратове до краја земље, лук преби, копље сломи, и кола сажеже огњем."},
	{10, "10 Утолите и познајте да сам ја Бог; ја сам узвишен по народима, узвишен на земљи."},
	{11, "11 Господ над војскама с нама је, бранич је наш Бог Јаковљев."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view47() {
struct sr47 poems[] = {
	{1, "1 Сви народи, запљескајте рукама, покликните Богу гласом радосним."},
	{2, "2 Јер је Вишњи Господ страшан, цар велики над свом земљом."},
	{3, "3 Покори нам народе и племена под ноге наше."},
	{4, "4 Избра нам достојање наше, красоту Јакова, који Му омиле."},
	{5, "5 Иде Бог уз подвикивање, Господ уз глас трубни."},
	{6, "6 Појте Богу, појте; појте цару нашем, појте;"},
	{7, "7 Јер је Бог цар од све земље, појте песму."},
	{8, "8 Бог царује над народима; Бог седи на светом престолу свом."},
	{9, "9 Кнезови народни састављају се с народом Бога Аврамовог. Јер су штитови земаљски Божији. Да је узвишен!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view48() {
struct sr48 poems[] = {
	{1, "1 Велик је Господ и славан веома у граду Бога нашег, на светој гори својој."},
	{2, "2 Прекрасна је висина, утеха свој земљи гора Сион, на северној страни њеној град цара великог."},
	{3, "3 Бог у дворима његовим зна се да је бранич."},
	{4, "4 Јер, гле, цареви се земаљски сабраше, али прођоше сви."},
	{5, "5 Видеше и зачудише се, препадоше се и побегоше."},
	{6, "6 Трепет обузе их онде, мучише се као породиља."},
	{7, "7 Ветром источним разбио си корабље тарсиске."},
	{8, "8 Шта слушамо то и видимо у граду Господа над војскама, у граду Бога нашег, Бог га утврди довека."},
	{9, "9 Казујемо, Боже, милост Твоју усред цркве Твоје."},
	{10, "10 Као што је име Твоје, Боже, тако је и хвала Твоја на крајевима земаљским; правде је пуна десница Твоја."},
	{11, "11 Нек се весели гора Сион, нек се радују кћери јудејске судова ради Твојих."},
	{12, "12 Пођите око Сиона и обиђите га, избројте куле његове;"},
	{13, "13 Погледајте бедеме његове, размотрите дворове његове, да приповедате млађим нараштајима."},
	{14, "14 Јер је овај Бог наш Бог увек и довека, Он ће бити вођ наш довека."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view49() {
struct sr49 poems[] = {
	{1, "1 Слушајте ово сви народи, пазите сви који живите по васиљени,"},
	{2, "2 Простаци и господо, богати и сиромаси."},
	{3, "3 Уста ће моја казати премудрост, и срце моје рећи ће разум."},
	{4, "4 Пригнућу ухо своје к причи, уз гусле ћу отворити загонетку своју."},
	{5, "5 Чега да се бојим у зле дане, кад ме злоба мојих непријатеља опколи?"},
	{6, "6 Који се уздате у силу своју, и хвалите се великим богатством својим!"},
	{7, "7 Човек неће никако брата ослободити, неће дати Богу откуп за њ."},
	{8, "8 Велик је откуп за душу, и неће бити никад"},
	{9, "9 Да ко довека живи, и не види гроба."},
	{10, "10 Сви виде где умиру као и незналица и безумник што гину, и остављају другима имање своје."},
	{11, "11 Они мисле да ће куће њихове трајати довека, и станови њихови од колена на колено; именима својим зову земље;"},
	{12, "12 Али човек у части неће дуго остати, изједначиће се са стоком, коју кољу."},
	{13, "13 Овај им се пут чини пробитачан, и који за њима иду, хвале мисли њихове;"},
	{14, "14 Али ће их као овце затворити у пакао, смрт ће им бити пастир; и ујутру ходиће по њима праведници, и облик њихов збрисаће пакао раставивши их с насељем."},
	{15, "15 Али ће Бог душу моју избавити из руку паклених; јер ме Он прима."},
	{16, "16 Не бој се кад се ко богати; кад расте слава дома његовог."},
	{17, "17 Јер кад умре, неће ништа понети, нити ће поћи за њим слава његова."},
	{18, "18 Јер душу његову благосиљају за живота његовог, и славе тебе, што угађаш себи."},
	{19, "19 Али ће он отићи у стан отаца својих, где света никад не виде."},
	{20, "20 Човек у части, ако није разуман, изједначиће се са стоком, коју кољу."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view50() {
struct sr50 poems[] = {
	{1, "1 Бог над боговима, Господ, говори и дозива земљу од истока сунчаног до запада."},
	{2, "2 Са Сиона, који је врх красоте, јавља се Бог."},
	{3, "3 Иде Бог наш, и не ћути; пред Њим је огањ који прождире, око Њега је бура велика."},
	{4, "4 Дозива небо одозго и земљу, да суди народу свом:"},
	{5, "5 'Скупите ми свеце моје, који су учинили са мном завет на жртви.'"},
	{6, "6 (И небеса огласише правду Његову, јер је тај судија Бог.)"},
	{7, "7 Слушај, народе мој, шта ћу ти казати, Израиљу, шта ћу ти јавити. Ја сам Бог, Бог твој."},
	{8, "8 Нећу те за жртве твоје карати; твоје жртве паљенице свагда су преда мном."},
	{9, "9 Не треба ми узимати телета из дома твог, ни јарића из торова твојих."},
	{10, "10 Јер је моје све горско зверје, и стока по планинама на хиљаде."},
	{11, "11 Знам све птице по горама, и красота пољска преда мном је."},
	{12, "12 Да огладним, не бих теби рекао, јер је моја васиљена и све што је у њој."},
	{13, "13 Зар ја једем месо волујско, или крв јарећу пијем?"},
	{14, "14 Принеси Богу хвалу на жртву, и извршуј Вишњему завете своје."},
	{15, "15 Призови ме у невољи својој, избавићу те, и ти ме прослави."},
	{16, "16 А безбожнику рече Бог: Зашто казујеш уредбе моје и носиш завет мој у устима својим?"},
	{17, "17 А сам мрзиш на науку, и речи моје бацаш за леђа."},
	{18, "18 Кад видиш лупежа, пристајеш с њим, и с прељубочинцима имаш део."},
	{19, "19 Уста си своја пустио да говоре зло, и језик твој плете преваре."},
	{20, "20 Седиш и говориш на брата свог, сина матере своје опадаш."},
	{21, "21 Ти си то чинио, ја ћутах, а ти помисли да сам ја као ти. Обличићу те, метнућу ти пред очи грехе твоје."},
	{22, "22 Разумејте ово који заборављате Бога! Иначе ћу зграбити, па неће нико избавити."},
	{23, "23 Онај мене поштује који приноси хвалу на жртву и који је путем на опазу. Ја ћу му показати спасење Божије."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view51() {
struct sr51 poems[] = {
	{1, "1 Смилуј се на ме, Боже, по милости својој, и по великој доброти својој очисти безакоње моје."},
	{2, "2 Опери ме добро од безакоња мог, и од греха мог очисти ме."},
	{3, "3 Јер ја знам преступе своје, и грех је мој једнако преда мном."},
	{4, "4 Самоме Теби згреших, и на Твоје очи зло учиних, а Ти си праведан у речима својим и чист у суду свом."},
	{5, "5 Гле, у безакоњу родих се, и у греху затрудне мати моја мном."},
	{6, "6 Гле, истину љубиш у срцу, и изнутра јављаш ми мудрост."},
	{7, "7 Покропи ме исопом, и очистићу се; умиј ме, и бићу бељи од снега."},
	{8, "8 Дај ми да слушам радост и весеље, да се прену кости које си потро."},
	{9, "9 Одврати лице своје од греха мојих, и сва безакоња моја очисти."},
	{10, "10 Учини ми, Боже, чисто срце, и дух прав понови у мени."},
	{11, "11 Немој ме одвргнути од лица свог, и Светог Духа свог немој узети од мене."},
	{12, "12 Врати ми радост спасења свог, и дух владалачки нека ме поткрепи."},
	{13, "13 Научићу безаконике путевима Твојим, и грешници к Теби ће се обратити."},
	{14, "14 Избави ме од крви, Боже, Боже, Спаситељу мој, и језик ће мој гласити правду Твоју."},
	{15, "15 Господе! Отвори уста моја, и она ће казати хвалу Твоју."},
	{16, "16 Јер жртву нећеш: ја бих је принео; за жртве паљенице не мариш."},
	{17, "17 Жртва је Богу дух скрушен, срце скрушено и поништено не одбацујеш, Боже."},
	{18, "18 По доброти својој, Господе, чини добро Сиону, подигни зидове јерусалимске."},
	{19, "19 Онда ће Ти бити миле жртве правде, приноси и жртве паљенице; онда ће метати на жртвеник Твој теоце."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view52() {
struct sr52 poems[] = {
	{1, "1 Што се хвалиш неваљалством, силни? Милост је Божија сваки дан са мном."},
	{2, "2 Неправду измишља језик твој; он је у тебе као бритва наоштрена, лукави!"},
	{3, "3 Волиш зло него добро, волиш лагати него истину говорити."},
	{4, "4 Љубиш свакојаке речи од погибли, и језик лукав."},
	{5, "5 Тога ради Бог ће те поразити сасвим, избациће те и ишчупаће те из стана, и корен твој из земље живих."},
	{6, "6 Видеће праведници и побојаће се, и подсмеваће му се:"},
	{7, "7 Гле човека који не држаше у Богу крепости своје, него се уздаше у величину богатства свог и утврђиваше се злоћом својом."},
	{8, "8 А ја, као маслина зелена у дому Господњем, уздам се у милост Божију без престанка и довека."},
	{9, "9 Довека ћу хвалити Тебе, јер добро чиниш, и уздаћу се у име Твоје; јер си добар к свецима својим."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view53() {
struct sr53 poems[] = {
	{1, "1 Рече безумник у срцу свом: Нема Бога; проневаљалише се и загрдеше у безакоњу, нема никога добро да твори."},
	{2, "2 Бог с неба погледа на синове човечије да види има ли који разуман, и тражи ли који Бога."},
	{3, "3 Сви застранише, сви се покварише, нема никога добро да твори, нема ни једног."},
	{4, "4 Зар неће да се оразуме који год чине безакоње, једу народ мој као што једу хлеб, и не призивају Бога?"},
	{5, "5 Дрхтаће од страха где страха нема. Јер ће Бог расути кости оних који устају на тебе. Ти ћеш их посрамити, јер их Бог одврже."},
	{6, "6 Ко ће послати са Сиона спасење Израиљу? Кад Бог поврати заробљени народ свој, радоваће се Јаков, веселиће се Израиљ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view54() {
struct sr54 poems[] = {
	{1, "1 Боже! Именом својим помози ми, и крепошћу својом одбрани ме на суду."},
	{2, "2 Боже! Услиши молитву моју, чуј речи уста мојих."},
	{3, "3 Јер туђини усташе на ме; и силни траже душу моју; немају Бога пред собом."},
	{4, "4 Гле, Бог је помоћник мој, Господ даје снагу души мојој."},
	{5, "5 Обратиће зло на непријатеље моје, истином својом истребиће их."},
	{6, "6 Радо ћу принети жртву, прославићу име Твоје, Господе, јер је добро."},
	{7, "7 Јер ме избављаш од сваке невоље, и на непријатеље моје без страха гледа око моје."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view55() {
struct sr55 poems[] = {
	{1, "1 Услиши, Боже, молитву моју, и немој се сакрити од мољења мог."},
	{2, "2 Пази, и саслушај ме; цвилим у јаду свом и уздишем"},
	{3, "3 Од вике непријатељске и од досаде безбожничке; јер дижу на ме зло, и у гневу гоне ме."},
	{4, "4 Срце је моје уздрхтало у мени, и страх смртни попаде ме;"},
	{5, "5 Страх и трепет дође на ме, и гроза подузе ме."},
	{6, "6 И рекох: Ко би ми дао крила голубиња? Ја бих одлетео и починуо;"},
	{7, "7 Далеко бих побегао, и настанио се у пустињи."},
	{8, "8 Похитао бих да утечем од вихора и од буре."},
	{9, "9 Порази, Господе, и раздели језике њихове, јер видим насиље и свађу у граду;"},
	{10, "10 Дању и ноћу то ходи по зидовима његовим; злочинство је и мука посред њега."},
	{11, "11 Усред њега је погибао, с улице његове не одлази превара и лукавство."},
	{12, "12 Јер не ружи ме непријатељ мој, то бих поднео; не устаје на ме јавни ненавидник, од њега бих се сакрио."},
	{13, "13 Него ти који си ми био то што ја сам, друг мој и знанац мој."},
	{14, "14 С којим ми беше радост делити тајну, и у дом Божији ходих кроз сабор народни."},
	{15, "15 Нека их уграби смрт, нека живи сиђу у пакао, јер је злочинство у стану њиховом и у њима."},
	{16, "16 Ја Бога призивам, и Господ ће ме спасти."},
	{17, "17 Вечером и јутром и у подне тужим и уздишем, и чуће глас мој;"},
	{18, "18 Учиниће, те ће душа моја бити мирна од оних који нападају на ме, јер их много имам."},
	{19, "19 Да услиши, и укроти их Бог, који живи од века; јер се не мењају и не боје се Бога."},
	{20, "20 Дижу руке своје на оне који су с њима у миру, и раскидају своју дружбу."},
	{21, "21 Уста су им мека као масло, а на срцу им је рат. Речи су им блаже од уља, али су голи мачеви."},
	{22, "22 Стави на Господа бреме своје, и Он ће те поткрепити. Неће дати довека праведнику да посрне."},
	{23, "23 Ти ћеш их, Боже, свалити у јаму погибли; крвопије и лукави неће саставити половине дана својих. А ја се у Тебе уздам."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view56() {
struct sr56 poems[] = {
	{1, "1 Смилуј се на ме, Боже, јер човек хоће да ме прогута, непријатељ ме сваки дан притешњује."},
	{2, "2 Непријатељи моји сваки дан траже да ме прогутају; јер многи нападају на ме охоло."},
	{3, "3 Кад ме је страх, јер се у Тебе уздам."},
	{4, "4 Богом се хвалим за реч Његову; у Бога се уздам, не бојим се; шта ће ми учинити тело?"},
	{5, "5 Сваки дан изврћу речи моје; шта год мисле, све мени о злу."},
	{6, "6 Скупљају се, прикривају се, пазе за петама мојим; јер траже душу моју."},
	{7, "7 Код овакве злоће избави од њих, у гневу обори народе, Боже."},
	{8, "8 У Тебе је избројано моје потуцање, сузе се моје чувају у суду код Тебе, оне су у књизи Твојој."},
	{9, "9 Непријатељи моји уступају натраг, кад Тебе призивам; по том знам да је Бог са мном."},
	{10, "10 Богом се хвалим за реч Његову, Господом се хвалим за реч Његову."},
	{11, "11 У Бога се уздам, не бојим се; шта ће ми учинити човек?"},
	{12, "12 Теби сам се, Боже, заветовао; Тебе ћу хвалити;"},
	{13, "13 Јер си избавио душу моју од смрти, ноге моје од спотицања, да бих ходио пред лицем Божјим, у светлости живих."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view57() {
struct sr57 poems[] = {
	{1, "1 Смилуј се на ме, Боже, смилуј се на ме; јер се у Тебе узда душа моја, и под сен крила Твојих склањам се док не прођу невоље."},
	{2, "2 Призивам Бога Вишњег, Бога, који ми добро чини;"},
	{3, "3 Да пошаље с неба и сачува ме, да посрами оног који тражи да ме прождре; да пошаље Бог милост своју и истину своју."},
	{4, "4 Душа је моја међу лавовима, лежим међу онима који дишу пламеном. Зуби су синова људских копља и стреле, и њихов језик мач оштар."},
	{5, "5 Узвиси се више небеса, Боже, по свој земљи нека буде слава Твоја!"},
	{6, "6 Метнуше замку ногама мојим, и стегоше душу моју, ископаше преда мном јаму, и сами падоше у њу."},
	{7, "7 Утврдило се срце моје, Боже, утврдило се срце моје; певаћу Те и славићу."},
	{8, "8 Пробуди се, славо моја, пробуди се, псалтире и гусле; устаћу рано."},
	{9, "9 Хвалићу Господа по народима, певаћу Ти по племенима."},
	{10, "10 Јер је велика до небеса милост Твоја, и истина Твоја до облака."},
	{11, "11 Узвиси се више небеса, Боже, по свој земљи нека буде слава Твоја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view58() {
struct sr58 poems[] = {
	{1, "1 Говорите ли заиста истину, силни, судите ли право, синови човечији?"},
	{2, "2 Та, безакоња састављате у срцу, мећете на мерила злочинства руку својих на земљи."},
	{3, "3 Од самог рођења застранише безаконици, од утробе материне тумарају говорећи лаж."},
	{4, "4 У њима је јед као јед змијињи, као глуве аспиде, која затискује ухо своје,"},
	{5, "5 Која не чује глас бајачев, врачара вештог у врачању."},
	{6, "6 Боже! Поломи им зубе у устима њиховим; разбиј чељусти лавовима, Господе!"},
	{7, "7 Нек се пролију као вода, и нестане их. Кад пусте стреле, нека буду као сломљене."},
	{8, "8 Као пуж, који се рашчиња, нека ишчиле; као дете, које жена побаци, нека не виде сунца."},
	{9, "9 Пре него котлови ваши осете топлоту од потпаљеног трња, и сирово и нагорело нека разнесе вихор."},
	{10, "10 Обрадоваће се праведник кад види освету, опраће ноге своје у крви безбожниковој."},
	{11, "11 И рећи ће људи: Заиста има плода праведнику! Заиста је Бог судија на земљи!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view59() {
struct sr59 poems[] = {
	{1, "1 Избави ме од непријатеља мојих, Боже мој, и од оних, што устају на ме, заклони ме."},
	{2, "2 Избави ме од оних који чине безакоње, и од крвопија сачувај ме."},
	{3, "3 Ево, зло намишљају души мојој, скупљају се на ме силни, без кривице моје и без греха мог, Господе."},
	{4, "4 Без кривице моје стечу се и оружају се; устани за мене, и гледај."},
	{5, "5 Ти, Господе, Боже над војскама, Боже Израиљев, пробуди се, обиђи све ове народе, немој пожалити одметника."},
	{6, "6 Нек се врате увече, лају као пси и иду око града."},
	{7, "7 Ево руже језиком својим, мач им је у устима, јер, веле, ко ће чути?"},
	{8, "8 Али Ти ћеш се, Господе, смејати њима и посрамити све ове народе."},
	{9, "9 Они су јаки, али ја на Тебе погледам, јер си Ти Бог, чувар мој."},
	{10, "10 Бог, који ме милује, иде преда мном, Бог ми даје без страха да гледам непријатеље своје."},
	{11, "11 Немој их побити, да не би заборавио народ мој; распи их силом својом и обори их, Господе, браничу наш,"},
	{12, "12 За грех уста њихових; за речи језика њиховог; нек се ухвате у охолости својој за клетву и лаж коју су говорили."},
	{13, "13 Распи у гневу, распи, да их нема; и нека познају да Бог влада над Јаковом и до крајева земаљских."},
	{14, "14 Нек се врате увече, лају као пси, и иду око града."},
	{15, "15 Нека тумарају тражећи хране, и не наситивши се нека ноћи проводе."},
	{16, "16 А ја ћу певати силу Твоју, рано ујутру гласити милост Твоју; јер си ми био одбрана и уточиште у дан невоље моје."},
	{17, "17 Сило моја! Теби ћу певати, јер си Ти Бог чувар мој, Бог који ме милује."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view60() {
struct sr60 poems[] = {
	{1, "1 Боже, расрдио си се на нас, расуо си нас, гневио си се; поврати нас."},
	{2, "2 Затресао си земљу, и развалио си је; стегни раселине њене, јер се њиха."},
	{3, "3 Дао си народу свом да позна љуту невољу, напојио си нас вина од ког се занесосмо."},
	{4, "4 Подигни заставу за оне који Те се боје, да утеку од лука,"},
	{5, "5 Да се избаве мили Твоји. Помози десницом својом и услиши ме."},
	{6, "6 Бог рече у светињи својој: Веселићу се, разделићу Сихем, и долину Сокот размерићу."},
	{7, "7 Мој је Галад, мој је Манасија, Јефрем је крепост главе моје, Јуда скиптар мој,"},
	{8, "8 Моав чаша моја, из које се умивам, на Едома пружићу обућу своју. Певај ми, филистејска земљо!"},
	{9, "9 Ко ће ме одвести у тврди град? Ко ће ме отпратити до Едома?"},
	{10, "10 Зар нећеш Ти, Боже, који си нас одбацио, и не идеш, Боже, с војском нашом?"},
	{11, "11 Дај нам помоћ у тескоби. А обрана је човечија узалуд."},
	{12, "12 Богом смо јаки: Он гази непријатеље наше."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view61() {
struct sr61 poems[] = {
	{1, "1 Чуј, Боже, вику моју, слушај молитву моју."},
	{2, "2 Од краја земље вичем к Теби, кад клону срце моје. Изведи ме на гору, где се не могу попети."},
	{3, "3 Јер си Ти уточиште моје, тврди заклон од непријатеља."},
	{4, "4 Да живим у стану Твом довека, и починем под кровом крила Твојих."},
	{5, "5 Јер Ти, Боже, чујеш завете моје и дајеш ми достојање оних који поштују име Твоје."},
	{6, "6 Додај дане к данима царевим, и године његове продужи од колена на колено."},
	{7, "7 Нека царује довека пред Богом; заповеди милости и истини нека га чувају."},
	{8, "8 Тако ћу певати имену Твом свагда, извршујући завете своје сваки дан."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view62() {
struct sr62 poems[] = {
	{1, "1 Та, у Бога је мир души мојој, од Њега је спасење моје!"},
	{2, "2 Та, Он је град мој и спасење моје, уточиште моје, нећу посрнути нимало."},
	{3, "3 Докле ћете нападати на човека? Сви хоћете да га оборите као зид наваљен, као ограду испроваљивану."},
	{4, "4 Баш наумише да га свргну с висине, омиле им лаж, устима благосиљају, а у срцу куну."},
	{5, "5 Да, у Богу се смири, душо моја; јер је у Њему нада моја."},
	{6, "6 Он је град мој и спасење моје, уточиште моје, нећу посрнути."},
	{7, "7 У Богу је спасење моје и слава моја, тврди град и пристаниште мени је у Богу."},
	{8, "8 Народе! Уздај се у Њега у свако доба; изливајте пред Њим срце своје; Бог је наше уточиште."},
	{9, "9 Та, синови су простачки ништа, синови су господски лаж, да се метну на мерила, били би лакши него ништа."},
	{10, "10 Не уздајте се у власт ни у отимање, немојте бити ништави; кад расте богатство, не дајте да вам срце прионе за њ."},
	{11, "11 Једном рече Бог и више пута чух, да је крепост у Бога."},
	{12, "12 И у Тебе је, Господе, милост; јер Ти плаћаш свакоме по делима његовим."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view63() {
struct sr63 poems[] = {
	{1, "1 Боже! Ти си Бог мој, к Теби раним, жедна је Тебе душа моја, за Тобом чезне тело моје у земљи сувој, жедној и безводној."},
	{2, "2 Тако бих Те угледао у светињи, да бих видео силу Твоју и славу Твоју."},
	{3, "3 Јер је доброта Твоја боља од живота. Уста би моја хвалила Тебе;"},
	{4, "4 Тако бих Те благосиљао за живота свог, у име Твоје подигао бих руке своје."},
	{5, "5 Као салом и уљем наситила би се душа моја, и радосним гласом хвалила би Те уста моја."},
	{6, "6 Кад Те се сећам на постељи, све ноћне страже размишљам о Теби."},
	{7, "7 Јер си Ти помоћ моја, и у сену крила Твојих веселим се."},
	{8, "8 Душа се моја прилепила за Тебе, десница Твоја држи ме."},
	{9, "9 Који траже погибао души мојој, они ће отићи под земљу."},
	{10, "10 Изгинуће од мача, и допашће лисицама."},
	{11, "11 А цар ће се веселити о Богу, хвалиће се сваки који се куне Њим, кад се затисну уста онима који говоре лаж."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view64() {
struct sr64 poems[] = {
	{1, "1 Чуј, Боже, глас мој у јаду мом; од страшног непријатеља сачувај живот мој."},
	{2, "2 Сакриј ме од гомиле безаконика, од чете злочинаца,"},
	{3, "3 Који наоштрише језик свој као мач, стрељају речима, које задају ране,"},
	{4, "4 Да би из потаје убили правога. Изненада ударају на њ и не боје се;"},
	{5, "5 Утврђују себе у злим намерама, договарају се како ће замке сакрити, веле: Ко ће их видети?"},
	{6, "6 Измишљају злочинства и говоре: Свршено је! Шта ће се радити, смишљено је! А шта је унутра и срце у човека дубоко је."},
	{7, "7 Али ће их Бог поразити; удариће их стрела изненада."},
	{8, "8 Обориће један другог језиком својим. Ко их год види, бежаће од њих."},
	{9, "9 Сви ће се људи бојати и казиваће чудо Божије, и познаће у томе дело Његово."},
	{10, "10 А праведник ће се веселити о Господу и уздаће се у Њега, и хвалиће се сви који су правог срца."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view65() {
struct sr65 poems[] = {
	{1, "1 У Теби је уздање, Боже, Теби припада хвала на Сиону, и Теби се извршују завети."},
	{2, "2 Ти слушаш молитву; к Теби долази свако тело."},
	{3, "3 Безакоња ме притискају, Ти ћеш очистити грехе наше."},
	{4, "4 Благо ономе кога изабираш и примаш, да живи у двору Твом! Наситићемо се добром дома Твог, светињом цркве Твоје."},
	{5, "5 Дивно нам одговараш по правди својој, Боже, Спаситељу наш, узданицо свих крајева земаљских, и народа преко мора далеко."},
	{6, "6 Који си поставио горе својом силом, опасао се јачином,"},
	{7, "7 Који утишаваш хуку морску, хуку вала њихових и буну по народима!"},
	{8, "8 Боје се Твојих чудеса који живе на крајевима земаљским; све што се јавља јутром и вечером Ти будиш да слави Тебе."},
	{9, "9 Надгледаш земљу и заливаш је, обилно је обогаћаваш; поток је Божји пун воде, спремаш за њих жито, јер си тако уредио."},
	{10, "10 Бразде њене напајаш, равниш груде њене, кишним капљама размекшаваш је, благосиљаш је да рађа."},
	{11, "11 Ти венчаваш годину, којој добро чиниш; стопе су Твоје пуне масти."},
	{12, "12 Тију паше по пустињама, и хумови се опасују радошћу."},
	{13, "13 Луке се осипају стадима, и поља се заодевају пшеницом; веселе се и певају."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view66() {
struct sr66 poems[] = {
	{1, "1 Покликни Богу, сва земљо!"},
	{2, "2 Запевајте славу имену Његовом, дајте Му хвалу и славу."},
	{3, "3 Реците Богу: Како си страшан у делима својим! Ради велике силе Твоје ласкају Ти непријатељи Твоји."},
	{4, "4 Сва земља нек се поклони Теби и поје Теби, нека поје имену Твом."},
	{5, "5 Ходите и видите дела Бога страшног у делима својим над синовима људским."},
	{6, "6 Он је претворио море у сухоту, преко реке пређосмо ногама; онде смо се веселили о Њему;"},
	{7, "7 Влада силом својом увек, очи Његове гледају на народе. Бунтовници, да се нисте подигли!"},
	{8, "8 Благосиљајте, народи, Бога нашег, и гласите хвалу Њему."},
	{9, "9 Он је даровао души нашој живот, и није дао да поклизне нога наша."},
	{10, "10 Ти си нас окушао, Боже, претопио си нас, као сребро што се претапа."},
	{11, "11 Увео си нас у мрежу, метнуо си бреме на леђа наша."},
	{12, "12 Дао си нас у јарам човеку, уђосмо у огањ и у воду; али си нас извео на одмор."},
	{13, "13 Ући ћу у дом Твој са жртвама што се сажижу, извршићу Ти завете своје,"},
	{14, "14 Које рекоше уста моја, и каза језик мој у тескоби мојој."},
	{15, "15 Жртве паљенице претиле ћу ту принети с димом од претилине овнујске, принећу Ти теоце с јарићима."},
	{16, "16 Ходите, чујте сви који се бојите Бога, ја ћу вам казати шта је учинио души мојој."},
	{17, "17 К Њему завиках устима својим, и језиком својим прославих Га."},
	{18, "18 Да сам видео у срцу свом безакоње, не би ме услишио Господ."},
	{19, "19 Али Бог услиши, прими глас мољења мог."},
	{20, "20 Благословен Бог, који не одврже молитве моје и не остави ме без милости своје!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view67() {
struct sr67 poems[] = {
	{1, "1 Боже, буди нам милостив и благосиљај нас, обасјавај нас лицем својим."},
	{2, "2 Да би се знао на земљи пут Твој, по свима народима спасење Твоје."},
	{3, "3 Да Те славе народи, Боже, да Те славе сви народи!"},
	{4, "4 Да се веселе и радују племена; јер судиш народима право, и племенима на земљи управљаш."},
	{5, "5 Да Те славе народи, Боже, да Те славе сви народи!"},
	{6, "6 Земља даде плод свој. Да нас благосиља Бог, Бог наш!"},
	{7, "7 Да нас благосиља Бог, и да Га се боје сви крајеви земаљски!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view68() {
struct sr68 poems[] = {
	{1, "1 Устаће Бог, и расуће се непријатељи Његови, и побећи ће од лица Његовог који мрзе на Њ'."},
	{2, "2 Ти ћеш их разагнати као дим што се разгони; као што се восак топи од огња, тако ће безбожници изгинути од лица Божијег."},
	{3, "3 А праведници ће се веселити, радоваће се пред Богом, и славити у радости."},
	{4, "4 Појте Богу, попевајте имену Његовом; равните пут Ономе што иде преко пустиње; Господ Му је име, радујте Му се."},
	{5, "5 Отац је сиротама и судија удовицама Бог у светом стану свом."},
	{6, "6 Бог самцима даје задругу, сужње изводи на места обилна, а непокорни живе где је суша."},
	{7, "7 Боже! Кад си ишао пред народом својим, кад си ишао преко пустиње,"},
	{8, "8 Земља се тресаше, и небо се растапаше од лица Божијег, и овај Синај од лица Бога, Бога Израиљевог."},
	{9, "9 Благодатни си дажд изливао, Боже, и кад изнемагаше достојање Твоје, Ти си га крепио."},
	{10, "10 Стадо Твоје живљаше онде; по доброти својој, Боже, Ти си готовио храну јадноме."},
	{11, "11 Господ даје реч; гласника велико је мноштво."},
	{12, "12 Цареви над војскама беже, беже, а која седи дома, дели плен."},
	{13, "13 Смиривши се у својим крајевима, ви сте као голубица, којој су крила посребрена, а перје јој се златни."},
	{14, "14 Кад је Свемогући расипао цареве на овој земљи, она се блисташе као снег на Селмону."},
	{15, "15 Гора је васанска гора Божија; гора је васанска гора хумовита."},
	{16, "16 Зашто гледате завидљиво, горе хумовите? Ево гора, на којој омиле Богу живети, и на којој ће Господ живети довека."},
	{17, "17 Кола Божијих има сила, хиљаде хиљада. Међу њима је Господ, Синај у светињи."},
	{18, "18 Ти си изашао на висину, довео си робље, примио дарове за људе, а и за оне који се противе да овде наставаш, Господе Боже!"},
	{19, "19 Благословен Господ сваки дан! Ако нас ко претовара, Бог нам помаже."},
	{20, "20 Овај је Бог наш Бог Спаситељ, у власти су Господу врата смртна."},
	{21, "21 Господ сатире главу непријатељима својим и власато теме оног који остаје у безакоњу свом."},
	{22, "22 Рече Господ: Од Васана ћу довести, довешћу из дубине морске,"},
	{23, "23 Да ти огрезне нога у крви непријатељској и језик паса твојих да је лиже."},
	{24, "24 Видеше како идеш, Боже, како свето иде Бог мој, цар мој."},
	{25, "25 Напред иђаху певачи, за њима свирачи сред девојака с бубњевима:"},
	{26, "26 'На сабору благосиљајте Господа Бога, који сте из извора Израиљевог!'"},
	{27, "27 Онде млади Венијамин, старешина њихов; кнезови Јудини, владаоци њихови; кнезови Завулонови, кнезови Нефталимови."},
	{28, "28 Бог твој даровао ти је силу. Утврди, Боже, ово што си учинио за нас!"},
	{29, "29 У цркви Твојој, у Јерусалиму, цареви ће приносити даре."},
	{30, "30 Укроти звер у риту, код волова с теоцима народа, да би попадали пред Тобом са шипкама сребра; распи народе који желе бојеве."},
	{31, "31 Доћи ће властела из Мисира, Етиопија ће пружити руке своје к Богу."},
	{32, "32 Царства земаљска, појте Богу, попевајте Господу,"},
	{33, "33 Који седи на небесима небеса исконских. Ево грми гласом јаким."},
	{34, "34 Дајте славу Богу; величанство је Његово над Израиљем и сила Његова на облацима."},
	{35, "35 Диван си, Боже, у светињи својој! Бог Израиљев даје силу и крепост народу. Благословен Бог!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view69() {
struct sr69 poems[] = {
	{1, "1 Помози ми, Боже, јер дође вода до душе."},
	{2, "2 Пропадам у дубоком глибу, где нема дна; тонем води у дубине, и вали ме затрпавају."},
	{3, "3 Изнемогох вичући, промуче ми грло, побелеше ми очи погледајући Бога."},
	{4, "4 Оних који мрзе на ме низашта има више него косе на глави мојој; осилише који хоће да ме погубе, лажљиви непријатељи моји. Шта нисам отимао, ваља да вратим."},
	{5, "5 Боже! Ти знаш је ли у мени безумље, и кривице моје нису сакривене од Тебе."},
	{6, "6 Немој да се постиде у мени који се уздају у Тебе, Господе, Господе над војскама! Немој да се посраме у мени који траже Тебе, Боже Израиљев!"},
	{7, "7 Јер Тебе ради подносим руг, и срамота попаде лице моје."},
	{8, "8 Туђин постадох браћи својој, и незнан синовима матере своје."},
	{9, "9 Јер ревност за кућу Твоју једе ме и ружења оних који Тебе руже падају на ме."},
	{10, "10 Плачем, постим се душом својом, и то ми се прима за зло;"},
	{11, "11 Место хаљине облачим врећу, и бивам им прича."},
	{12, "12 О мени се разговарају седећи на вратима, пијући вино певају ме."},
	{13, "13 А ја се молим Теби, Господе; време је да се смилујеш, Боже; по великој милости својој услиши ме, јер је истинито спасење Твоје."},
	{14, "14 Извади ме из глиба, да не пропаднем; да се избавим од ненавидника и из дубоке воде;"},
	{15, "15 Да ме не узме вода на матицу, да ме не прождре пучина, и да не склопи јама нада мном ждрела свог."},
	{16, "16 Услиши ме, Господе, јер је благост Твоја милосрдна, по великој доброти својој погледај ме."},
	{17, "17 Немој одвратити лице своје од слуге свог; јер ме је туга; похитај, услиши ме."},
	{18, "18 Приближи се души мојој, избави је; насупрот непријатељима мојим избави ме."},
	{19, "19 Ти знаш под каквим сам ругом, стидом и срамотом; пред Тобом су сви непријатељи моји."},
	{20, "20 Срамота сатре срце моје, изнемогох; чекам хоће ли се коме сажалити, али нема никога; хоће ли ме ко потешити, али не налазим."},
	{21, "21 Дају ми жуч да једем, и у жеђи мојој поје ме оцтом."},
	{22, "22 Трпеза њихова нека им буде мрежа и замка, то нека им буде плата."},
	{23, "23 Нека им потамне очи њихове, да не виде, и њихове бедре раслаби засвагда."},
	{24, "24 Излиј на њих јарост своју, и пламен гнева Твог нека их обузме!"},
	{25, "25 Стан њихов нека опусти, и у њиховим шаторима нека не буде никога да живи."},
	{26, "26 Јер кога си Ти поразио, они гоне, и умножавају јаде онима које си Ти ранио."},
	{27, "27 Мећи на њих кривицу за кривицом, да не дођу до правде Твоје."},
	{28, "28 Нека се избришу из књиге живих, и с праведницима нек не буду записани."},
	{29, "29 А ја сам ништ и болан; помоћ Твоја, Боже, нек ме заклони."},
	{30, "30 Славићу име Божије у песми, величаћу Га у хвали."},
	{31, "31 То је Богу милије од вола, од телета с роговима и с папцима."},
	{32, "32 Видеће ништи и радоваће се. Који тражите Бога, оживеће срце ваше."},
	{33, "33 Јер Бог чује убоге, и сужања својих не оглуша се."},
	{34, "34 Нека Га хвале небеса и земља, мора и све што се у њима миче!"},
	{35, "35 Јер ће Бог спасти Сион, сазидаће градове Јудине; и људи ће се онде населити и наследиће га."},
	{36, "36 И наслеђе ће се слуга Његових утврдити у њему и који љубе име Његово наставаће на њему."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view70() {
struct sr70 poems[] = {
	{1, "1 Боже, похитај да ме избавиш, Господе, да ми помогнеш!"},
	{2, "2 Нек се постиде и посраме који траже душу моју! Нек одступе натраг, и осрамоте се који ми зло желе!"},
	{3, "3 Са стидом нек се врате натраг који ми говоре: Ха! Ха!"},
	{4, "4 Нек се теше и веселе Тобом који траже Тебе, и који љубе спасење Твоје, нека једнако говоре: Велик је Бог!"},
	{5, "5 А ја сам ништ и убог, Боже, похитај к мени! Ти си помоћ моја и Избавитељ мој, Господе, не часи!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view71() {
struct sr71 poems[] = {
	{1, "1 У Тебе се, Господе, уздам, немој ме оставити под срамотом вечном."},
	{2, "2 Правдом својом избави ме, и опрости ме, пригни к мени ухо своје и помози ми."},
	{3, "3 Буди ми град где бих свагда долазио да живим, уреди спасење моје; јер си Ти град мој и крепост моја."},
	{4, "4 Боже мој! Узми ме из руке безбожникове, из руке безаконикове и насилникове."},
	{5, "5 Јер си Ти надање моје, Господ је Господ поуздање моје од младости моје."},
	{6, "6 Тебе се држим од рођења, од утробе матере моје Ти си бранич мој; Тобом се хвалим свагда."},
	{7, "7 Чудо сам многима, а Ти си уточиште моје јако."},
	{8, "8 Уста су моја пуна хвале Твоје, славе Твоје сваки дан."},
	{9, "9 Немој ме одбацити под старост, кад ме издаје снага моја, немој ме оставити."},
	{10, "10 Јер непријатељи моји мисле о мени, и који вребају душу моју договарају се,"},
	{11, "11 Говорећи: Бог га је оставио, потерајте и ухватите га, јер га нема ко избавити."},
	{12, "12 Боже! Не буди далеко од мене; Боже мој! Похитај ми у помоћ."},
	{13, "13 Нек се постиде и погину противници душе моје; нека попадне стид и срамота на оне који ми траже зла!"},
	{14, "14 А ја ћу се свагда уздати, и понављаћу хвале Теби."},
	{15, "15 Уста ће моја казивати правду Твоју, сваки дан доброчинства Твоја, јер им не знам броја."},
	{16, "16 Ући ћу у сили Господа Господа, и славићу само Твоју правду."},
	{17, "17 Боже! Ти си ме учио од младости, и до данас казујем чудеса Твоја."},
	{18, "18 Ни у старости и кад оседех немој ме оставити, Боже, еда бих казивао мишицу Твоју наслеђу, свој омладини силу Твоју,"},
	{19, "19 Правда је Твоја, Боже, до највише висине; у великим делима, која си учинио, Боже, ко је као Ти?"},
	{20, "20 Колико си ме пута бацао у велике и љуте невоље, пак си ме опет оставио међу живима и из бездана ме земаљских опет извадио."},
	{21, "21 Много си ме пута подизао и понављао утехе."},
	{22, "22 И ја Те хвалим уз псалтир, Твоју верност, Боже мој; ударам Ти у гусле, Свече Израиљев!"},
	{23, "23 Радују се уста моја кад певам Теби, и душа моја, коју си избавио."},
	{24, "24 И језик мој сваки дан казује правду Твоју; јер су постиђени и посрамљени они који ми траже зла."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view72() {
struct sr72 poems[] = {
	{1, "1 Боже, дај цару суд свој, и правду своју сину царевом:"},
	{2, "2 Он ће судити народу Твом по правди, и невољницима Твојим по правици."},
	{3, "3 Родиће народу горе миром, и хумови правдом."},
	{4, "4 Он ће судити невољнима у народу, помоћи ће синовима ништега, и насилника ће оборити,"},
	{5, "5 Бојаће се Тебе док је сунца и месеца, од колена до колена."},
	{6, "6 Сићи ће као дажд на покошену ливаду, као капље које порашају земљу."},
	{7, "7 Процветаће у дане његове праведник и свуда мир докле тече месеца."},
	{8, "8 Владаће од мора до мора, и од реке до крајева земаљских."},
	{9, "9 Пред њим ће попадати дивљаци, и непријатељи његови прах ће лизати."},
	{10, "10 Цареви тарсиски и острвљани донеће даре, цареви шавски и савски даће данак."},
	{11, "11 Клањаће му се сви цареви, сви народи биће му покорни."},
	{12, "12 Јер ће избавити убогога који цвили и невољнога који нема помоћника."},
	{13, "13 Биће милостив ништем и убогом, и душе ће јаднима спасти."},
	{14, "14 Од преваре и насиља искупиће душе њихове, и скупа ће бити крв њихова пред очима његовим."},
	{15, "15 Они ће добро живети, и донеће му злато из Шаве; и свагда ће се молити за њега, и сваки ће га дан благосиљати."},
	{16, "16 Биће пшенице на земљи изобила; по врховима горским лелујаће се класје њено као ливанска шума, и по градовима цветаће људи као трава на земљи."},
	{17, "17 Име ће његово бити увек; докле тече сунца, име ће његово расти. Благословиће се у њему, сви ће га народи звати блаженим."},
	{18, "18 Благословен Господ Бог, Бог Израиљев, који један чини чудеса!"},
	{19, "19 И благословено славно име Његово увек! Славе Његове напуниће се сва земља. Аман и амин."},
	{20, "20 Свршише се молитве Давида, сина Јесејевог."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view73() {
struct sr73 poems[] = {
	{1, "1 Та добар је Бог Израиљу, онима који су чиста срца."},
	{2, "2 А ноге моје умало не зађоше, умало не попузнуше стопала моја,"},
	{3, "3 Јер се расрдих на безумнике видећи како безбожници добро живе."},
	{4, "4 Јер не знају за невољу до саме смрти, и тело је њихово претило."},
	{5, "5 На пословима човечијим нема их, и не муче се с другим људима."},
	{6, "6 Тога ради опточени су охолоћу као огрлицом, и обучени у обест као у стајаће рухо."},
	{7, "7 Од дебљине избуљено им је око, срце пуно клапе."},
	{8, "8 Подсмевају се, пакосно говоре о насиљу, охоло говоре."},
	{9, "9 Уста своја дижу у небо, и земљу пролази језик њихов."},
	{10, "10 И зато се онамо навраћају неки из народа његовог, и пију воду из пуног извора."},
	{11, "11 И говоре: Како ће разабрати Бог? Зар Вишњи зна?"},
	{12, "12 Па ето, ови безбожници срећни на свету умножавају богатство."},
	{13, "13 Зар, дакле, узалуд чистим срце своје, и умивам безазленошћу руке своје,"},
	{14, "14 Допадам рана сваки дан, и муке свако јутро?"},
	{15, "15 Кад бих казао: Говорићу као и они, изневерио бих род синова Твојих."},
	{16, "16 И тако стадох размишљати да бих ово разумео; али то беше тешко у очима мојим."},
	{17, "17 Док најпосле не уђох у светињу Божију, и дознах крај њихов."},
	{18, "18 Та на клизавом месту поставио си их, и бацаш их у пропаст!"},
	{19, "19 Како зачас пропадају, гину, нестаје их од ненадне страхоте!"},
	{20, "20 Као сан, кад се човек пробуди, тако пробудивши их, Господе, у ништа обраћаш утвару њихову."},
	{21, "21 Кад кипљаше срце моје и растрзах се у себи,"},
	{22, "22 Тада бејах незналица и не разумевах; као живинче бијах пред Тобом."},
	{23, "23 Али сам свагда код Тебе, Ти ме држиш за десну руку."},
	{24, "24 По својој вољи водиш ме, и после ћеш ме одвести у славу."},
	{25, "25 Кога имам на небу? И с Тобом ништа нећу на земљи."},
	{26, "26 Чезне за Тобом тело моје и срце моје; Бог је град срца мог и део мој довека."},
	{27, "27 Јер ево који одступише од Тебе, гину; Ти истребљаваш сваког који чини прељубу остављајући Тебе."},
	{28, "28 А мени је добро бити близу Бога. На Господа полажем надање своје, и казиваћу сва чудеса Твоја."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view74() {
struct sr74 poems[] = {
	{1, "1 Зашто се, Боже, срдиш на нас дуго; дими се гнев Твој на овце паше Твоје?"},
	{2, "2 Опомени се сабора свог, који си стекао од старине, искупио себи у наследну државу, горе Сиона, на којој си се населио."},
	{3, "3 Подигни стопе своје на старе развалине: све је разрушио непријатељ у светињи."},
	{4, "4 Ричу непријатељи Твоји на месту сабора Твојих, своје обичаје постављају место наших обичаја."},
	{5, "5 Видиш, они су као онај који подиже секиру на сплетене гране у дрвета."},
	{6, "6 Све у њему што је резано разбише секирама и брадвама."},
	{7, "7 Огњем сажегоше светињу Твоју; на земљу обаливши оскврнише стан имена Твог."},
	{8, "8 Рекоше у срцу свом: Потримо их сасвим. Попалише сва места сабора Божијих на земљи."},
	{9, "9 Обичаја својих не видимо, нема више пророка, и нема у нас ко би знао докле ће то трајати."},
	{10, "10 Докле ће се, Боже, ругати насилник? Хоће ли довека противник пркосити имену Твом?"},
	{11, "11 Зашто устављаш руку своју и десницу своју? Пружи из недара својих, и истреби их."},
	{12, "12 Боже, царе мој, који од старине твориш спасење посред земље!"},
	{13, "13 Ти си силом својом раскинуо море, и сатро главе воденим наказама."},
	{14, "14 Ти си размрскао главу крокодилу, дао га онима који живе у пустињи да га једу."},
	{15, "15 Ти си отворио изворе и потоке, Ти си исушио реке које не пресишу."},
	{16, "16 Твој је дан и Твоја је ноћ, Ти си поставио звезде и сунце."},
	{17, "17 Ти си утврдио све крајеве земаљске, лето и зиму Ти си уредио."},
	{18, "18 Опомени се тога, непријатељ се руга Господу, и народ безумни не мари за име Твоје."},
	{19, "19 Не дај зверима душу грлице своје, немој заборавити стадо страдалаца својих засвагда."},
	{20, "20 Погледај на завет; јер су све пећине земаљске пуне станова безакоња."},
	{21, "21 Невољник нек се не врати срамотан, ништи и убоги нека хвале име Твоје."},
	{22, "22 Устани, Боже, брани ствар своју, опомени се како Ти се безумник руга сваки дан!"},
	{23, "23 Не заборави обести непријатеља својих, вике, коју једнако дижу противници Твоји!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view75() {
struct sr75 poems[] = {
	{1, "1 Хвалимо Те, Боже, хвалимо; близу је име Твоје. За Тебе казују чудеса Твоја."},
	{2, "2 'Кад видим да је време, судићу право."},
	{3, "3 Њиха се земља са свима који живе на њој, ја утврђујем ступове њене.'"},
	{4, "4 Кажем хвалишама: Не хвалите се, и безаконицима: Не дижите рог."},
	{5, "5 Не дижите у вис рог свој, не говорите тврдоглаво."},
	{6, "6 Јер узвишавање не долази ни од истока ни од запада ни од пустиње;"},
	{7, "7 Него је Бог судија, једног понижује а другог узвишује."},
	{8, "8 Јер је чаша у руци Господу, вино ври, наточио је пуну, и раздаје из ње. И талог ће њен прогутати, испиће сви безбожници на земљи."},
	{9, "9 А ја ћу казивати довека, певаћу Богу Јаковљевом."},
	{10, "10 'Све ћу рогове безбожницима поломити, а рогови праведникови узвисиће се.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view76() {
struct sr76 poems[] = {
	{1, "1 Зна се у Јудеји за Бога, у Израиља је велико име Његово."},
	{2, "2 У Салиму је стан Његов и насеље Његово на Сиону."},
	{3, "3 Онде је поломио крилате стреле луку, штит и мач и рат."},
	{4, "4 Ти си светао; дивнији од гора хајдучких."},
	{5, "5 Који су јуначког срца посташе плен, заспаше сном својим, и јунаци не нађоше руку својих."},
	{6, "6 Од претње Твоје, Боже Јаковљев, дремљу кола и коњ."},
	{7, "7 Ти си страшан, и ко ће се одржати пред лицем Твојим кад се разгневиш?"},
	{8, "8 С неба јављаш суд; земља се препада и ћути,"},
	{9, "9 Кад Бог устаје на суд, да помогне свима који страдају на земљи."},
	{10, "10 И гнев људски обраћа се у славу Теби, кад се једном опашеш гневом."},
	{11, "11 Полажите и извршујте завете Господу Богу свом; сви који сте око Њега, носите даре Страшноме."},
	{12, "12 Он укроћава дух кнезовима, Он је страшан царевима земаљским."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view77() {
struct sr77 poems[] = {
	{1, "1 Глас мој иде к Богу, и ја призивам Њега; глас мој иде к Богу, и Он ће ме услишити."},
	{2, "2 У дан туге своје тражих Господа; ноћу је рука моја подигнута, и не спушта се; душа моја неће да се утеши."},
	{3, "3 Помињем Бога, и уздишем; размишљам, и трне дух мој."},
	{4, "4 Држим очи своје да су будне; клонуо сам, и не могу говорити."},
	{5, "5 Пребрајам старе дане и године од векова."},
	{6, "6 Опомињем се песама својих ноћу; разговарам се са срцем својим, и испитујем дух свој:"},
	{7, "7 'Зар ће се довека гневити на нас Господ, и неће више љубити?"},
	{8, "8 Зар је засвагда престала милост Његова, и реч се прекинула од колена на колено?"},
	{9, "9 Зар је заборавио милостив бити и у гневу затворио милосрђе своје?'"},
	{10, "10 И рекох: Жалосна је за мене ова промена деснице Вишњега."},
	{11, "11 Памтим дела Господња; памтим пређашње чудо Твоје."},
	{12, "12 Мислио сам о свим делима Твојим, размишљао о радњи Твојој;"},
	{13, "13 Боже! Пут је Твој свет; који је Бог тако велик као Бог наш?"},
	{14, "14 Ти си Бог, који си чинио чудеса, показивао силу своју међу народима;"},
	{15, "15 Мишицом си одбранио народ свој, синове Јаковљеве и Јосифове."},
	{16, "16 Видеше Те воде, Боже, видеше Те воде, и устрепташе, и бездане се задрмаше."},
	{17, "17 Из облака лијаше вода, облаци даваху глас, и стреле Твоје лећаху."},
	{18, "18 Грмљаху громови Твоји по небу; муње Твоје севаху по васиљеној, земља се тресаше и њихаше."},
	{19, "19 По мору беше пут Твој, и стазе Твоје по великој води, и траг Твој не познаваше се."},
	{20, "20 Водио си народ свој као овце руком Мојсијевом и Ароновом."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view78() {
struct sr78 poems[] = {
	{1, "1 Чуј, народе мој, наук мој, пригни ухо своје к речима уста мојих."},
	{2, "2 Отварам за причу уста своја, казаћу старе приповетке."},
	{3, "3 Шта слушасмо и дознасмо, и што нам казиваше оци наши,"},
	{4, "4 Нећемо затајити од деце њихове, нараштају позном јавићемо славу Господњу и силу Његову и чудеса која је учинио."},
	{5, "5 Сведочанство подиже у Јакову, и у Израиљу постави закон, који даде оцима нашим да га предаду деци својој;"},
	{6, "6 Да би знао потоњи нараштај, деца која ће се родити, па и они да би казивали својој деци."},
	{7, "7 Да полажу на Бога надање своје, и не заборављају дела Божијих, и заповести Његове да држе;"},
	{8, "8 И да не буду као оци њихови, род неваљао и упоран, род који не беше чврст срцем својим, нити веран Богу духом својим."},
	{9, "9 Синови Јефремови наоружани, који стрељају из лука, вратише се натраг, кад беше бој."},
	{10, "10 Не сачуваше завет Божји, и по закону Његовом не хтеше ходити."},
	{11, "11 Заборавише дела Његова, и чудеса, која им је показао,"},
	{12, "12 Како пред очима њиховим учини чудеса у земљи мисирској, на пољу Соану;"},
	{13, "13 Раздвоји море, и проведе их, од воде начини зид;"},
	{14, "14 И води их дању облаком, и сву ноћ светлим огњем;"},
	{15, "15 Раскида стене у пустињи, и поји их као из велике бездане;"},
	{16, "16 Изводи потоке из камена, и води воду рекама."},
	{17, "17 Али они још једнако грешише Њему, и гневише Вишњег у пустињи."},
	{18, "18 И кушаше Бога у срцу свом, иштући јела по вољи својој,"},
	{19, "19 И викаше на Бога, и рекоше: 'Може ли Бог зготовити трпезу у пустињи?'"},
	{20, "20 Ево! Он удари у камен, и потече вода, и реке устадоше; може ли и хлеба дати? Хоће ли и меса поставити народу свом?"},
	{21, "21 Господ чу и разљути се, и огањ се разгоре на Јакова, и гнев се подиже на Израиља."},
	{22, "22 Јер не вероваше Богу и не уздаше се у помоћ Његову."},
	{23, "23 Тада заповеди облацима одозго, и отвори врата небеска,"},
	{24, "24 И пусти, те им подажде мана за јело, и хлеб небески даде им."},
	{25, "25 Хлеб анђеоски јеђаше човек; посла им јела до ситости."},
	{26, "26 Пусти небом устоку, и наведе силом својом југ;"},
	{27, "27 И као прахом засу их месом, и као песком морским птицама крилатим;"},
	{28, "28 Побаца их сред логора њиховог, око шатора њихових."},
	{29, "29 И наједоше се и даде им шта су желели."},
	{30, "30 Али их још и не прође жеља, још беше јело у устима њиховим,"},
	{31, "31 Гнев се Божји подиже на њих и помори најјаче међу њима, и младиће у Израиљу поби."},
	{32, "32 Преко свега тога још грешише, и не вероваше чудесима Његовим."},
	{33, "33 И пусти, те дани њихови пролазише узалуд, и године њихове у страху."},
	{34, "34 Кад их убијаше, онда притецаху к Њему, и обраћаху се и искаху Бога;"},
	{35, "35 И помињаху да је Бог одбрана њихова, и Вишњи Избавитељ њихов."},
	{36, "36 Ласкаху Му устима својим, и језиком својим лагаху Му."},
	{37, "37 А срце њихово не беше Њему верно, и не беху тврди у завету Његовом."},
	{38, "38 Али Он беше милостив, и покриваше грех, и не помори их, често заустављаше гнев свој, и не подизаше све јарости своје."},
	{39, "39 Опомињаше се да су тело, ветар, који пролази и не враћа се."},
	{40, "40 Колико Га пута расрдише у пустињи, и увредише у земљи где се не живи!"},
	{41, "41 Све наново кушаше Бога, и Свеца Израиљевог дражише."},
	{42, "42 Не сећаше се руке Његове и дана, у који их избави из невоље,"},
	{43, "43 У који учини у Мисиру знаке своје и чудеса своја на пољу Соану;"},
	{44, "44 И проврже у крв реке њихове и потоке њихове, да не могоше пити."},
	{45, "45 Посла на њих бубине да их кољу, и жабе да их море."},
	{46, "46 Летину њихову даде црву, и муку њихову скакавцима."},
	{47, "47 Винограде њихове поби градом, и смокве њихове сланом."},
	{48, "48 Граду предаде стоку њихову, и стада њихова муњи."},
	{49, "49 Посла на њих огњени гнев свој, јарост, срдњу и мржњу, чету злих анђела."},
	{50, "50 Равни стазу гневу свом, не чува душе њихове од смрти, и живот њихов предаде помору."},
	{51, "51 Поби све првенце у Мисиру, први пород по колибама Хамовим."},
	{52, "52 И поведе народ свој као овце, и води их као стадо преко пустиње."},
	{53, "53 Води их поуздано, и они се не бојаше, а непријатеље њихове затрпа море."},
	{54, "54 И доведе их на место светиње своје, на ову гору, коју задоби десница Његова."},
	{55, "55 Одагна испред лица њиховог народе; жребом раздели њихово достојање, и по шаторима њиховим насели колена Израиљева."},
	{56, "56 Али они кушаше и срдише Бога Вишњег и уредбе Његове не сачуваше."},
	{57, "57 Одусташе и одвргоше се, као и оци њихови, слагаше као рђав лук."},
	{58, "58 Увредише Га висинама својим, и идолима својим раздражише Га."},
	{59, "59 Бог чу и разгневи се и расрди се на Израиља веома."},
	{60, "60 Остави насеље своје у Силому, шатор, у коме живљаше с људима."},
	{61, "61 И оправи у ропство славу своју и красоту своју у руке непријатељеве."},
	{62, "62 И предаде мачу народ свој, и на достојање своје запламте се."},
	{63, "63 Младиће његове једе огањ, и девојкама његовим не певаше сватовских песама;"},
	{64, "64 Свештеници његови падаше од мача, и удовице његове не плакаше."},
	{65, "65 Најпосле, као иза сна пробуди се Господ, прену се као јунак кад се напије вина."},
	{66, "66 И поби непријатеље своје с леђа, вечној срамоти предаде их."},
	{67, "67 И не хте шатор Јосифов, и колено Јефремово не изабра."},
	{68, "68 Него изабра колено Јудино, гору Сион, која Му омиле."},
	{69, "69 И сагради светињу своју као горње своје станове, и као земљу утврди је довека."},
	{70, "70 И изабра Давида, слугу свог, и узе га од торова овчијих,"},
	{71, "71 И од дојилица доведе га да пасе народ Његов, Јакова, и наследство Његово, Израиља."},
	{72, "72 И он их пасе чистим срцем, и води их мудрим рукама."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view79() {
struct sr79 poems[] = {
	{1, "1 Боже! Незнабошци дођоше у достојање Твоје; оскврнише свету цркву Твоју, Јерусалим претворише у зидине."},
	{2, "2 Трупље слуга Твојих дадоше птицама небеским да их једу, тела светаца Твојих зверима земаљским."},
	{3, "3 Пролише крв њихову као воду око Јерусалима, и не беше ко да погребе."},
	{4, "4 Постадосмо подсмех у суседа својих, ругају нам се и срамоте нас који су око нас."},
	{5, "5 Докле ћеш се, Господе, једнако гневити, јарост Твоја горети као огањ?"},
	{6, "6 Излиј гнев свој на народе који Те не знају, и на царства која не призивају Твоје име."},
	{7, "7 Јер изједоше Јакова, и насеље његово опустеше."},
	{8, "8 Не помињи пређашња безакоња наша, већ похитај да нас пресретеш милосрђем својим, јер смо веома олошали."},
	{9, "9 Помози нам, Боже, Спаситељу наш, ради славе имена свог, избави нас и очисти од греха наших ради имена свог."},
	{10, "10 Зашто да говоре незнабошци: Где је Бог њихов? Нека се покаже пред очима нашим освета над незнабошцима за пролиту крв слуга Твојих!"},
	{11, "11 Нека изађу пред лице Твоје уздаси сужањски, силом мишице своје сачувај намењене смрти."},
	{12, "12 Седмином врати у недра суседима нашим ружење, којим Те ружише, Господе!"},
	{13, "13 А ми, народ Твој и овце паше Твоје, довека ћемо Тебе славити и од колена на колено казивати хвалу Твоју."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view80() {
struct sr80 poems[] = {
	{1, "1 Пастире Израиљев, чуј! Који водиш синове Јосифове као овце, који седиш на херувимима, јави се!"},
	{2, "2 Пред Јефремом и Венијамином и Манасијом пробуди крепост своју, и ходи да нам помогнеш."},
	{3, "3 Боже! Поврати нас, нека засја лице Твоје да се спасемо!"},
	{4, "4 Господе, Боже над војскама! Докле ћеш се гневити кад Те моли народ Твој?"},
	{5, "5 Храниш их хлебом сузним, и појиш их сузама троструком мером."},
	{6, "6 Учинио си да се око нас свађају суседи наши, и непријатељи се наши смеју међу собом."},
	{7, "7 Боже над војскама! Поврати нас, нека засја лице Твоје да се спасемо!"},
	{8, "8 Из Мисира си пренео чокот, изагнао народе, и посадио га."},
	{9, "9 Окрчио си за њ, и он пусти жиле, и заузе сву земљу."},
	{10, "10 Горе се покрише његовим сеном, и лозе су му као кедри Божији."},
	{11, "11 Пустио је лозе своје до мора и огранке своје до реке."},
	{12, "12 Зашто си му развалио ограду, да га кида ко год прође?"},
	{13, "13 Горски вепар подгриза га, и пољска звер једе га."},
	{14, "14 Боже над војскама! Обрати се, погледај с неба и види, и обиђи виноград овај,"},
	{15, "15 Сад овај, који је посадила десница Твоја, и сина ког си укрепио себи!"},
	{16, "16 Попаљен је огњем, исечен, од страшног погледа Твог пропаде."},
	{17, "17 Нека буде рука Твоја над човеком деснице Твоје, над сином човечијим ког си утврдио себи!"},
	{18, "18 И нећемо одступити од Тебе, оживи нас, и име Твоје призиваћемо."},
	{19, "19 Господе, Боже над војскама! Поврати нас, нека засја лице Твоје, да се спасемо!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view81() {
struct sr81 poems[] = {
	{1, "1 Радујте се Богу, који нам даје крепост; покликујте Богу Јаковљевом."},
	{2, "2 Подигните песме, дајте бубањ, слатке гусле са псалтиром."},
	{3, "3 Трубите о мени у трубу, о уштапу ради празника нашег."},
	{4, "4 Јер је такав закон у Израиља, наредба од Бога Јаковљевог."},
	{5, "5 За сведочанство постави Јосифу ово, кад иђаше на земљу мисирску. Језик, ког не знах, чух!"},
	{6, "6 'Уклонио сам рамена његова од бремена, руке његове опростише се котарица."},
	{7, "7 У невољи си ме зазвао, и избавих те, услиших те усред грома, на води Мериви искушах те."},
	{8, "8 Слушај, народе мој, и засведочићу ти, Израиљу, о кад би ме послушао:"},
	{9, "9 Да не буде у тебе туђег бога, и богу страном немој се клањати."},
	{10, "10 Ја сам Господ, Бог твој, који сам те извео из земље мисирске; отвори уста своја, и ја ћу их напунити."},
	{11, "11 Али не послуша народ мој глас мој, Израиљ не мари за ме."},
	{12, "12 И ја их пустих на вољу срца њихова, нека ходе по својим мислима."},
	{13, "13 О кад би народ мој слушао мене, и синови Израиљеви ходили путевима мојим!"},
	{14, "14 Брзо бих покорио непријатеље њихове, и на противнике њихове дигао бих руку своју;"},
	{15, "15 Који мрзе на Господа, били би им покорни, и добри дани њихови били би довека;"},
	{16, "16 Најбољом би пшеницом хранио њих, и медом бих из камена ситио их.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view82() {
struct sr82 poems[] = {
	{1, "1 Бог стаде на сабору Божијем, усред богова изрече суд:"},
	{2, "2 'Докле ћете судити неправо, и безбожницима гледати ко је ко?"},
	{3, "3 Судите убогоме и сироти, оног кога гоне и ништега правдајте."},
	{4, "4 Избављајте убогога и ништега, из руке безбожничке отимајте."},
	{5, "5 Не познаше, нити разумеше, ходе по тами; задрмаше се земљи сви темељи."},
	{6, "6 Рекох: Богови сте, и синови Вишњег сви."},
	{7, "7 Али ћете као људи помрети, и као сваки кнез пашћете.'"},
	{8, "8 Устани, Боже, суди земљи; јер су Твоји по наследству сви народи."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view83() {
struct sr83 poems[] = {
	{1, "1 Боже! Немој замукнути, немој ћутати, нити почивај, Боже!"},
	{2, "2 Јер ево непријатељи Твоји узавреше, и који Те ненавиде, подигоше главу."},
	{3, "3 По народ Твој зло наумише, и договарају се на изабране Твоје."},
	{4, "4 Рекоше: Ходите да их истребимо између народа да се више не спомиње име Израиљево."},
	{5, "5 Сложно присташе и супрот Теби веру ухватише:"},
	{6, "6 Насеља Едомова и Исмаиловци, Моав и Агарени,"},
	{7, "7 Гевал и Амон и Амалик, Филистеји с Тирцима;"},
	{8, "8 И Асур удружи се с њима; постадоше мишица синовима Лотовим."},
	{9, "9 Учини им онако као Мадијану, као Сисари, као Јавину на потоку Кисону."},
	{10, "10 Који су истребљени у Аендору, нагнојише собом земљу."},
	{11, "11 Уради с њима, с кнезовима њиховим, као с Оривом и Зивом, и са свима главарима њиховим као са Зевејем и Салманом."},
	{12, "12 Јер говоре: Освојимо насеља Божија."},
	{13, "13 Боже мој! Заповеди нека буду као прах, као песак пред ветром."},
	{14, "14 Као што огањ сажиже шуму, и као пламен што запаљује горе,"},
	{15, "15 Тако их погнај буром својом и вихором својим смети их."},
	{16, "16 Покриј лице њихово срамотом, да би тражили име Твоје, Господе!"},
	{17, "17 Нека се стиде и сраме довека, нека се смету и изгину!"},
	{18, "18 И нека знају да си Ти, коме је име Господ, једини највиши над свом земљом."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view84() {
struct sr84 poems[] = {
	{1, "1 Како су мили станови Твоји, Господе над силама!"},
	{2, "2 Гине душа моја желећи у дворе Господње; срце моје и тело моје отима се к Богу Живом."},
	{3, "3 И птица находи кућу, и ластавица гнездо себи где леже птиће своје, код олтара Твојих, Господе над силама, царе мој и Боже мој!"},
	{4, "4 Благо онима који живе у дому Твом! Они Те хвале без престанка."},
	{5, "5 Благо онима којима је сила у Теби, и којима су у срцу путеви Твоји!"},
	{6, "6 Идући долином плачевном, претварају је у изворе, и дажд је одева благословима."},
	{7, "7 Иду збор за збором, јављају се пред Богом на Сиону."},
	{8, "8 Господе, Боже над силама! Услиши молитву моју, Боже Јаковљев!"},
	{9, "9 Боже, браничу наш! Сагни се и види лице помазаника свог!"},
	{10, "10 Јер је боље један дан у дворима Твојим од хиљаде. Волим бити на прагу дома Божијег него живети у шаторима безбожничким."},
	{11, "11 Јер је Господ Бог сунце и штит, Господ даје благодат и славу; онима који ходе у безазлености не ускраћује ниједног добра."},
	{12, "12 Господе над силама! Благо човеку, који се у Те узда!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view85() {
struct sr85 poems[] = {
	{1, "1 Смиловао си се, Господе, на земљу своју, повратио си робље Јаковљево."},
	{2, "2 Опростио си неправду народу свом, покрио си све грехе његове."},
	{3, "3 Зауставио си сву јарост своју, ублажио жестину гнева свог."},
	{4, "4 Поврати нас Боже, Спаситељу наш, прекини срдњу своју на нас."},
	{5, "5 Зар ћеш се довека гневити на нас, и протегнути гнев свој од колена на колено?"},
	{6, "6 Зар се нећеш повратити и оживети нас, да би се народ Твој радовао о Теби?"},
	{7, "7 Покажи нам, Господе, милост своју, и помоћ своју дај нам."},
	{8, "8 Да послушам шта говори Господ Бог. Он изриче мир народу свом и свецима својим, и онима који се обраћају срцем к Њему."},
	{9, "9 Да, близу је оних који Га се боје помоћ Његова, да би населио славу у земљи нашој!"},
	{10, "10 Милост и истина срешће се, правда и мир пољубиће се."},
	{11, "11 Истина ће никнути из земље и правда ће с неба проникнути."},
	{12, "12 И Господ ће дати добро, и земља наша даће плод свој."},
	{13, "13 Правда ће пред Њим ићи, и поставиће на пут стопе своје."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view86() {
struct sr86 poems[] = {
	{1, "1 Пригни, Господе! Ухо своје и услиши ме, јер сам невољан и ништ."},
	{2, "2 Сачувај душу моју, јер сам Твој поклоник. Спаси слугу свог, Боже мој, који се у Те узда."},
	{3, "3 Смилуј се на ме, Господе, јер к Теби вичем сав дан."},
	{4, "4 Овесели душу слуге свог, јер к Теби, Господе, подижем душу своју."},
	{5, "5 Јер си Ти, Господе, добар и милосрдан и веома милостив свима који Те призивају."},
	{6, "6 Чуј, Господе, молитву моју, и слушај глас мољења мог."},
	{7, "7 У дан туге своје призивам Те, јер ћеш ме услишити."},
	{8, "8 Нема међу боговима таквог какав си Ти, Господе, и нема дела таквих каква су Твоја."},
	{9, "9 Сви народи, које си створио, доћи ће и поклонити се пред Тобом, Господе, и славити име Твоје."},
	{10, "10 Јер си Ти велик и твориш чудеса; Ти си један Бог."},
	{11, "11 Покажи ми, Господе, пут свој, и ићи ћу у истини Твојој; учини нека се мили срцу мом бојати се имена Твог."},
	{12, "12 Славићу Те, Господе Боже мој, свим срцем својим, и поштоваћу име Твоје довека."},
	{13, "13 Јер је милост Твоја велика нада мном, и извадио си душу моју из пакла најдубљег."},
	{14, "14 Боже, охолице усташе на мене, и гомила насилника тражи душу моју, и немају Тебе пред собом."},
	{15, "15 Али Ти, Господе, Боже милостиви и благи, стрпљиви и богати добротом и истином,"},
	{16, "16 Погледај на ме и смилуј ми се, дај силу своју слузи свом, и помози сину слушкиње своје;"},
	{17, "17 Учини са мном чудо доброте. Нека виде који ме ненавиде, и постиде се, што си ми, Господе, помогао и утешио ме."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view87() {
struct sr87 poems[] = {
	{1, "1 Шта је сам основао на горама светим,"},
	{2, "2 Врата сионска љуби Господ више свих станова Јаковљевих,"},
	{3, "3 Славно казују за Тебе, граде Божји!"},
	{4, "4 'Међу оне, који ме знају, бројаћу Мисир и Вавилон. Гле и Филистеји и Тир с етиопском онде су се родили.'"},
	{5, "5 О Сиону ће се говорити: Тај се и тај родио у њему; сам Вишњи утврђује га."},
	{6, "6 Господ ће у препису народа завикати: Овај се родио у њему."},
	{7, "7 И који певају и веселе се, сви су извори моји у Теби."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view88() {
struct sr88 poems[] = {
	{1, "1 Господе Боже, Спаситељу мој, дању вичем и ноћу пред Тобом."},
	{2, "2 Нек изађе преда Те молитва моја, пригни ухо своје к јауку мом;"},
	{3, "3 Јер је душа моја пуна јада, и живот се мој примаче паклу."},
	{4, "4 Изједначих се с онима који у гроб одлазе, постадох као човек без силе,"},
	{5, "5 Као међу мртве бачен, као убијени, који леже у гробу, којих се више не сећаш, и који су од руке Твоје далеко."},
	{6, "6 Метнуо си ме у јаму најдоњу, у таму, у бездану."},
	{7, "7 Отежа ми гнев Твој, и свима валима својим удараш ме."},
	{8, "8 Удаљио си од мене познанике моје, њима си ме омразио; затворен сам, и не могу изаћи."},
	{9, "9 Око моје усахну од јада, вичем Те, Господе, сав дан, пружам к Теби руке своје."},
	{10, "10 Еда ли ћеш на мртвима чинити чудеса? Или ће мртви устати и Тебе славити?"},
	{11, "11 Еда ли ће се у гробу приповедати милост Твоја, и истина Твоја у труљењу?"},
	{12, "12 Еда ли ће у тами познати чудеса Твоја, и правду Твоју где се све заборавља?"},
	{13, "13 Али ја, Господе, к Теби вичем, и јутром молитва моја срета Те."},
	{14, "14 Зашто, Господе, одбацујеш душу моју, и одвраћаш лице своје од мене?"},
	{15, "15 Мучим се и издишем од удараца, подносим страхоте Твоје, без надања сам."},
	{16, "16 Гнев Твој стиже ме, страхоте Твоје раздиру ме."},
	{17, "17 Оптечу ме сваки дан као вода, стежу ме одсвуда."},
	{18, "18 Удаљио си од мене друга и пријатеља; познаници моји сакрили су се у мрак."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view89() {
struct sr89 poems[] = {
	{1, "1 Милости ћу Господње певати увек, од колена на колено јављаћу истину Твоју устима својим."},
	{2, "2 Јер знам да је зававек основана милост, и на небесима да си утврдио истину своју, рекавши:"},
	{3, "3 'Учиних завет с избраним својим, заклех се Давиду, слузи свом:"},
	{4, "4 Довека ћу утврђивати семе твоје и престо твој уређивати од колена до колена.'"},
	{5, "5 Небо казује чудеса Твоја, Господе, и истину Твоју сабор светих."},
	{6, "6 Јер ко је над облацима раван Господу? Ко ће се изједначити с Господом међу синовима Божијим?"},
	{7, "7 Богу се ваља клањати на сабору светих, страшнији је од свих који су око Њега."},
	{8, "8 Господе, Боже над војскама! Ко је силан као Ти, Боже? И истина је Твоја око Тебе."},
	{9, "9 Ти владаш над силом морском; кад подигне вале своје, Ти их укроћаваш."},
	{10, "10 Ти си оборио охоли Мисир као рањеника, крепком мишицом својом расејао си непријатеље своје."},
	{11, "11 Твоје је небо и Твоја је земља; Ти си саздао васиљену и шта је год у њој."},
	{12, "12 Север и југ Ти си створио, Тавор и Ермон о Твом се имену радује."},
	{13, "13 Твоја је мишица крепка, силна је рука Твоја, и висока десница Твоја."},
	{14, "14 Благост је и правда подножје престолу Твом, милост и истина иде пред лицем Твојим."},
	{15, "15 Благо народу који зна трубну поклич! Господе! У светлости лица Твог они ходе;"},
	{16, "16 Именом се Твојим радују сав дан, и правдом Твојом узвишују се."},
	{17, "17 Јер си Ти красота силе њихове, и по милости Твојој узвишује се рог наш."},
	{18, "18 Јер је од Господа одбрана наша, и од Светог Израиљевог цар наш."},
	{19, "19 Тада си говорио у утвари вернима својим, и рекао: 'Послах помоћ јунаку, узвисих избраног свог из народа."},
	{20, "20 Нађох Давида, слугу свог, светим уљем својим помазах га."},
	{21, "21 Рука ће моја бити једнако с њим, и мишица моја крепиће га."},
	{22, "22 Неће га непријатељ надвладати, и син безакоња неће му досадити."},
	{23, "23 Потрћу пред лицем његовим непријатеље његове, и ненавиднике његове поразићу."},
	{24, "24 Истина је моја и милост моја с њим; и у моје име узвисиће се рог његов."},
	{25, "25 Пружићу на море руку његову, и на реке десницу његову."},
	{26, "26 Он ће ме звати: Ти си Отац мој, Бог мој и град спасења мог."},
	{27, "27 И ја ћу га учинити првенцем, вишим од царева земаљских."},
	{28, "28 Довека ћу му хранити милост своју, и завет је мој с њим веран."},
	{29, "29 Продужићу семе његово довека, и престо његов као дане небеске."},
	{30, "30 Ако синови његови оставе закон мој, и не узиду у заповестима мојим;"},
	{31, "31 Ако погазе уредбе моје, и заповести моје не сачувају,"},
	{32, "32 Онда ћу их покарати прутом за непокорност, и ранама за безакоње њихово;"},
	{33, "33 Али милости своје нећу узети од њега, нити ћу преврнути истином својом;"},
	{34, "34 Нећу погазити завет свој, и шта је изашло из уста мојих нећу порећи."},
	{35, "35 Једном се заклех светошћу својом; зар да слажем Давиду?"},
	{36, "36 Семе ће његово трајати довека, и престо његов као сунце преда мном;"},
	{37, "37 Он ће стајати увек као месец и верни сведок у облацима.'"},
	{38, "38 А сад си одбацио и занемарио, разгневио си се на помазаника свог;"},
	{39, "39 Занемарио си завет са слугом својим, бацио си на земљу венац његов."},
	{40, "40 Развалио си све ограде његове, градове његове обратио си у зидине."},
	{41, "41 Плене га сви који пролазе онуда, поста подсмех у суседа својих."},
	{42, "42 Узвисио си десницу непријатеља његових, обрадовао си све противнике његове."},
	{43, "43 Завратио си оштрице мача његовог, и ниси га укрепио у боју;"},
	{44, "44 Узео си му светлост, и престо његов оборио си на земљу;"},
	{45, "45 Скратио си дане младости његове и обукао га у срамоту."},
	{46, "46 Докле ћеш се, Господе, једнако одвраћати, докле ће као огањ пламтети гнев Твој?"},
	{47, "47 Опомени се какав је век мој, како си ни на шта створио све синове Адамове?"},
	{48, "48 Који је човек живео и није смрти видео, и избавио душу своју из руку паклених?"},
	{49, "49 Где су пређашње милости Твоје, Господе? Клео си се Давиду истином својом."},
	{50, "50 Опомени се, Господе, прекора слугу својих, који носим у недрима својим од свих силних народа,"},
	{51, "51 Којим коре непријатељи Твоји, Господе, којим коре траг помазаника Твог."},
	{52, "52 Благословен Господ увек! Амин, амин."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view90() {
struct sr90 poems[] = {
	{1, "1 Господе! Ти си нам уточиште од колења до колења."},
	{2, "2 Пре него се горе родише и сазда се земља и васиљена, и од века довека, Ти си Бог."},
	{3, "3 Ти враћаш човека у трулеж, и говориш: Вратите се синови људски!"},
	{4, "4 Јер је хиљада година пред очима Твојим као дан јучерашњи, кад мине, и као стража ноћна."},
	{5, "5 Ти их као поводњем односиш; они су као сан, као трава, која рано вене,"},
	{6, "6 Ујутру цвета и увене, увече се покоси и сасуши."},
	{7, "7 Јер нас нестаје од гнева Твог, и од јарости Твоје у сметњи смо."},
	{8, "8 Ставио си безакоња наша преда се, и тајне наше на светлост лица свог."},
	{9, "9 Сви се дани наши прекраћују од срдње Твоје, године наше пролазе као глас."},
	{10, "10 Дана година наших свега има до седамдесет година, а у јачег до осамдесет година: и сам је цвет њихов мука и невоља; јер теку брзо, и ми одлећемо."},
	{11, "11 Ко зна силу гнева Твог и Твоју јарост, да би Те се као што треба бојао?"},
	{12, "12 Научи нас тако бројати дане наше, да бисмо стекли срце мудро."},
	{13, "13 Поврати се, Господе! Докле ћеш? Смилуј се на слуге своје."},
	{14, "14 Ујутру нас насити доброте своје, и радоваћемо се и веселити у све дане своје."},
	{15, "15 Обрадуј нас према данима, у које си нас мучио, и према годинама, у које смо гледали невољу."},
	{16, "16 Нека се покаже на слугама Твојим дело Твоје, и слава Твоја на синовима њиховим."},
	{17, "17 Нека буде добра воља Господа Бога нашег с нама, и дело руку наших доврши нам, и дело руку наших доврши."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view91() {
struct sr91 poems[] = {
	{1, "1 Који живи у заклону Вишњег, у сену Свемогућег почива."},
	{2, "2 Говори Господу: Ти си уточиште моје и бранич мој, Бог мој, у ког се уздам."},
	{3, "3 Он ће те избавити из замке птичареве, и од љутог помора;"},
	{4, "4 Перјем својим осениће те, и под крилима Његовим заклонићеш се; истина је Његова штит и ограда."},
	{5, "5 Нећеш се бојати страхоте ноћне, стреле, која лети дању,"},
	{6, "6 Помора, који иде по мраку, болести, која у подне мори."},
	{7, "7 Пашће поред тебе хиљада и десет хиљада с десне стране теби, а тебе се неће дотаћи."},
	{8, "8 Само ћеш гледати очима својим, и видећеш плату безбожницима."},
	{9, "9 Јер си Ти, Господе, поуздање моје. Вишњег си изабрао себи за уточиште."},
	{10, "10 Неће Те зло задесити, и ударац неће досегнути до колибе Твоје."},
	{11, "11 Јер анђелима својим заповеда за Тебе да Те чувају по свим путевима Твојим."},
	{12, "12 На руке ће Те узети да где не запнеш за камен ногом својом."},
	{13, "13 На лава и на аспиду наступаћеш и газићеш лавића и змаја."},
	{14, "14 'Кад ме љуби, избавићу Га; заклонићу Га, кад је познао име моје."},
	{15, "15 Зазваће ме, и услишићу Га; с Њим ћу бити у невољи, избавићу Га и прославићу Га."},
	{16, "16 Дугог живота наситићу Га, и показаћу му спасење своје.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view92() {
struct sr92 poems[] = {
	{1, "1 Лепо је хвалити Господа, и певати имену Твом, Вишњи,"},
	{2, "2 Јављати јутром милост Твоју, и истину Твоју ноћу,"},
	{3, "3 Уз десет жица и уз псалтир, и уз јасне гусле!"},
	{4, "4 Јер си ме развеселио, Господе, делима својим, с дела руку Твојих радујем се."},
	{5, "5 Како су велика дела Твоја, Господе! Веома су дубоке помисли Твоје."},
	{6, "6 Безумник не зна, и незналица не разуме то."},
	{7, "7 Кад безбожници ничу као трава и цветају сви који чине безакоње, то бива зато да би се истребили довека."},
	{8, "8 А Ти си, Господе, висок увек."},
	{9, "9 Јер ево непријатељи Твоји, Господе, јер ево непријатељи Твоји гину, и расипају се сви који чине безакоње;"},
	{10, "10 А мој рог Ти узвишујеш као рог у једнорога, ја сам помазан новим уљем."},
	{11, "11 И око моје види непријатеље моје, и о безаконицима, који устају на мене, слушају уши моје."},
	{12, "12 Праведник се зелени као Финик, као кедар на Ливану узвишује се."},
	{13, "13 Који су засађени у дому Господњем, зелене се у дворовима Бога нашег;"},
	{14, "14 Родни су и у старости, једри и зелени,"},
	{15, "15 Јављајући да је праведан Господ, бранич мој, и да нема у Њему неправде."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view93() {
struct sr93 poems[] = {
	{1, "1 Господ царује. Обукао се у величанство, обукао се Господ у силу, и опасао се. Зато је васиљена тврда, и неће се померити."},
	{2, "2 Престо Твој стоји од искона; од века Ти си."},
	{3, "3 Подижу реке, Господе, подижу реке глас свој, подижу реке вале своје:"},
	{4, "4 Од хујања воде многе и силне, од вала морских силнији је на висини Господ."},
	{5, "5 Сведочанства су Твоја веома тврда; дому Твом припада светлост, Господе, на дуго време."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view94() {
struct sr94 poems[] = {
	{1, "1 Боже од освете, Господе, Боже од освете, покажи се!"},
	{2, "2 Подигни се, судијо земаљски, подај заслугу охолима."},
	{3, "3 Докле ће се безбожници, Господе, докле ће се безбожници хвалити?"},
	{4, "4 Руже и охоло говоре, величају се сви који чине безакоње."},
	{5, "5 Газе народ Твој, Господе, и достојање Твоје муче."},
	{6, "6 Удовицу и дошљака убијају, и сироте море."},
	{7, "7 И говоре: Неће видети Господ, и неће дознати Бог Јаковљев."},
	{8, "8 Оразумите се, прелуди људи! Будале! Кад ћете бити паметни?"},
	{9, "9 Који је створио ухо, зар не чује? И који је око начинио, зар не види?"},
	{10, "10 Зар неће обличити који народе уразумљује, који учи човека да зна?"},
	{11, "11 Господ зна мисли људима како су ништаве."},
	{12, "12 Благо човеку кога Ти, Господе, уразумљујеш, и законом својим учиш;"},
	{13, "13 Да би му дао мир у зле дане, док се ископа јама безбожнику."},
	{14, "14 Јер неће одбацити Господ народ свој, и достојање своје неће оставити."},
	{15, "15 Јер ће се суд вратити на правду, у њега ће наћи сви правог срца."},
	{16, "16 Ко ће устати за мене супрот злима? Ко ће стати за мене супрот онима који чине безакоње?"},
	{17, "17 Кад ми Господ не би био помоћник, брзо би се душа моја преселила онамо где се ћути."},
	{18, "18 Кад кажем: Дрхће ми нога, милост Твоја, Господе, прихвата ме."},
	{19, "19 Кад се умноже бриге у срцу мом, утехе Твоје разговарају душу моју."},
	{20, "20 Еда ли ће се близу Тебе стати престо крвнички, и онај који намишља насиље насупрот закону?"},
	{21, "21 Спремају се на душу праведникову, и крв праву окривљују."},
	{22, "22 Али је Господ моје пристаниште, и Бог је мој тврдо уточиште моје."},
	{23, "23 Он ће им вратити за безакоње њихово, за њихову злоћу истребиће их, истребиће их Господ, Бог наш."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view95() {
struct sr95 poems[] = {
	{1, "1 Ходите, запевајмо Господу, покликнимо Богу, граду спасења свог!"},
	{2, "2 Изађимо пред лице Његово с хвалом, у песмама покликнимо Му!"},
	{3, "3 Јер је Господ велик Бог и велик Цар над свим боговима."},
	{4, "4 У Његовој су руци дубине земаљске, и висине горске Његове су."},
	{5, "5 Његово је море и Он га је створио, и сухоту руке су Његове начиниле."},
	{6, "6 Ходите, поклонимо се, припаднимо, клекнимо пред Господом, Творцем својим."},
	{7, "7 Јер је Он Бог наш, и ми народ паше Његове и овце руке Његове. Сад кад бисте послушали глас Његов:"},
	{8, "8 'Немојте да вам одрвени срце ваше као у Мериви, као у дан кушања у пустињи,"},
	{9, "9 Где ме кушаше оци ваши, испиташе и видеше дело моје."},
	{10, "10 Четрдесет година срдих се на род онај, и рекох: Ови људи тумарају срцем, и не знају путеве моје;"},
	{11, "11 И зато се заклех у гневу свом да неће ући у мир мој.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view96() {
struct sr96 poems[] = {
	{1, "1 Певајте Господу песму нову, певај Господу, сва земљо!"},
	{2, "2 Певајте Господу, благосиљајте име Његово, јављајте од дана на дан спасење Његово."},
	{3, "3 Казујте по народима славу Његову, по свим племенима чудеса Његова."},
	{4, "4 Јер је велик Господ и ваља Га хвалити: страшнији је од свих богова."},
	{5, "5 Јер су сви богови у народа ништа; а Господ је небеса створио."},
	{6, "6 Слава је и величанство пред лицем Његовим, сила и красота у светињи Његовој."},
	{7, "7 Дајте, Господу, племена народна, дајте Господу славу и част."},
	{8, "8 Дајте Господу славу према имену Његовом. Носите даре и идите у дворе Његове."},
	{9, "9 Поклоните се Господу у светој красоти. Стрепи пред Њим, сва земљо!"},
	{10, "10 Реците народима: Господ царује; зато је васиљена тврда и неће се поместити; Он ће судити народима право."},
	{11, "11 Нек се веселе небеса, и земља се радује; нек пљеска море и шта је у њему;"},
	{12, "12 Нека скаче поље и све што је на њему; тада нек се радују сва дрвета шумска"},
	{13, "13 Пред лицем Господњим; јер иде, јер иде да суди земљи. Судиће васиљеној по правди, и народима по истини својој."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view97() {
struct sr97 poems[] = {
	{1, "1 Господ царује: нек се радује земља! Нек се веселе острва многа."},
	{2, "2 Облак је и мрак око Њега; благост и правда подножје престолу његовом."},
	{3, "3 Огањ пред Њим иде, и пали наоколо непријатеље Његове."},
	{4, "4 Муње Његове севају по васиљеној; види и стрепи земља."},
	{5, "5 Горе као восак топе се од лица Господњег, од лица Господа свој земљи."},
	{6, "6 Небеса казују правду Његову, и сви народи виде славу Његову."},
	{7, "7 Нек се стиде сви који се клањају киповима, који се хвале идолима својим. Поклоните Му се сви богови."},
	{8, "8 Чује и радује се Сион, и кћери се јудејске веселе ради судова Твојих, Господе!"},
	{9, "9 Јер си Ти, Господе, висок над свом земљом и надвишујеш све богове."},
	{10, "10 Који љубите Господа, мрзите на зло. Он чува душе светаца својих; из руку безбожничких отима их."},
	{11, "11 Светлост се просипа на праведника, и весеље на оне који су правог срца."},
	{12, "12 Радујте се праведни о Господу, и славите свето име Његово."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view98() {
struct sr98 poems[] = {
	{1, "1 Појте Господу песму нову, јер учини чудеса. Поможе Му десница Његова и света мишица Његова."},
	{2, "2 Јави Господ спасење своје, пред народима откри правду своју."},
	{3, "3 Опомену се милости своје и верности своје к дому Израиљевом. Видеше сви крајеви земаљски спасење Бога нашег."},
	{4, "4 Радуј се Господу, сва земљо; певајте, покликујте и попевајте!"},
	{5, "5 Ударајте Господу у гусле, у гусле и с гласом псаламским."},
	{6, "6 У трубе и рогове затрубите пред царем Господом."},
	{7, "7 Нека пљеска море и шта је у њему, васиљена и који у њој живе;"},
	{8, "8 Реке нека пљескају рукама; скупа горе нек се радују"},
	{9, "9 Пред лицем Господњим; јер иде да суди земљи; судиће васиљеној праведно, и народима верно."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view99() {
struct sr99 poems[] = {
	{1, "1 Господ царује: нека стрепе народи; седи на херувимима: нек се дрма земља!"},
	{2, "2 Господ је на Сиону велик, и висок над свима народима."},
	{3, "3 Нека славе велико и страшно име Твоје; да је свет!"},
	{4, "4 Нека славе силу цара који љуби правду. Ти си утврдио правду; суд и правду Ти си уредио у Јакову."},
	{5, "5 Узвишујте Господа Бога нашег, и клањајте се подножју Његовом; да је свет!"},
	{6, "6 Мојсије и Арон, свештеници Његови, и Самуило један од оних који призивају име Његово, призиваху Бога, и Он их услиши."},
	{7, "7 У ступу од облака говораше њима; они чуваше заповести Његове и уредбу коју им даде."},
	{8, "8 Господе, Боже наш, Ти си их услишио; Ти си им био Бог благ и плаћао за дела њихова."},
	{9, "9 Узвишујте Господа Бога нашег, и клањајте се на светој гори Његовој, јер је свет Господ Бог наш."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view100() {
struct sr100 poems[] = {
	{1, "1 Радуј се Господу, сва земљо!"},
	{2, "2 Служите Господу весело; идите пред лице Његово певајући!"},
	{3, "3 Познајте Господ да је Бог. Он нас је створио, и ми смо достојање Његово, народ Његов и овце паше Његове."},
	{4, "4 Улазите на врата Његова са славом, у дворе Његове с хвалом. Славите Га, и благосиљајте име Његово."},
	{5, "5 Јер је добар Господ; милост је Његова увек, и истина Његова од колена на колено."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view101() {
struct sr101 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view102() {
struct sr102 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view103() {
struct sr103 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view104() {
struct sr104 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view105() {
struct sr105 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view106() {
struct sr106 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view107() {
struct sr107 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view108() {
struct sr108 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view109() {
struct sr109 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view110() {
struct sr110 poems[] = {
	{1, "1 Рече Господ Господу мом: Седи мени с десне стране, док положим непријатеље Твоје за подножје ногама Твојим."},
	{2, "2 Скиптар силе даје ти Господ са Сиона: владај сред непријатеља својих."},
	{3, "3 У дан рата Твог народ је Твој готов у светој красоти. Као роса зори из утробе, таква је у Тебе младост Твоја."},
	{4, "4 Господ се заклео, и неће се покајати: ти си свештеник довека по реду Мелхиседековом."},
	{5, "5 Господ је теби с десне стране. Побиће у дан гнева свог цареве;"},
	{6, "6 Судиће народима, напуниће земљу трупова; сатрће главу на земљи широкој."},
	{7, "7 Из потока ће на путу пити, и зато ће подигнути главу."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view111() {
struct sr111 poems[] = {
	{1, "1 Хвалим Те, Господе, од свега срца на већу праведничком и на сабору."},
	{2, "2 Велика су дела Господња, драга свима који их љубе."},
	{3, "3 Дело је Његово слава и красота, и правда Његова траје довека."},
	{4, "4 Чудеса је своја учинио да се не забораве; добар је и милостив Господ."},
	{5, "5 Храну даје онима који Га се боје, памти увек завет свој."},
	{6, "6 Силу дела својих јавио је народу свом давши им наследство народа."},
	{7, "7 Дела су руку Његових истина и правда; верне су све заповести Његове;"},
	{8, "8 Тврде су за ва век века, основане на истини и правди."},
	{9, "9 Избављење посла народу свом; постави зававек завет свој. Име је Његово свето, и ваља Му се клањати."},
	{10, "10 Почетак је мудрости страх Господњи; добра су разума сви који их творе. Хвала Његова траје довека."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view112() {
struct sr112 poems[] = {
	{1, "1 Благо човеку који се боји Господа, коме су веома омилеле заповести Његове."},
	{2, "2 Силно ће бити на земљи семе његово, род праведнички биће благословен."},
	{3, "3 Обиље је и богатство у дому његовом, и правда његова траје довека."},
	{4, "4 У тами сјаје видело праведницима од доброг, милостивог и праведног."},
	{5, "5 Благо ономе који је милостив и даје у зајам! Он ће дати тврђу речима својим на суду."},
	{6, "6 Јер неће посрнути довека, праведник ће се спомињати увек."},
	{7, "7 Не боји се злог гласа; срце је његово стално, узда се у Господа."},
	{8, "8 Утврђено је срце његово, неће се побојати, и видеће како падају непријатељи његови."},
	{9, "9 Просипа, даје убогима; правда његова траје довека, рог се његов узвишује у слави."},
	{10, "10 Безбожник види, и једи се, шкргуће зубима својим, и сахне. Жеља ће безбожницима пропасти."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view113() {
struct sr113 poems[] = {
	{1, "1 Хвалите, слуге Господње, хвалите име Господње,"},
	{2, "2 Да буде име Господње благословено одсад и довека."},
	{3, "3 Од истока сунчаног до запада да се слави име Господње."},
	{4, "4 Узвишен је над свима народима Господ; сврх небеса је слава Његова."},
	{5, "5 Ко је као Господ, Бог наш, који седи на висини;"},
	{6, "6 Који се сагиба да види шта је на небесима и на земљи;"},
	{7, "7 Који из праха подиже убогога, и из кала узвишује ништега;"},
	{8, "8 И посађује га с кнезовима, с кнезовима у народу његовом;"},
	{9, "9 Од нероткиње насељава кућу, учинивши је радосном мајком синовима. Алилуја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view114() {
struct sr114 poems[] = {
	{1, "1 Кад изађе Израиљ из Мисира, дом Јаковљев из народа туђег,"},
	{2, "2 Јудеја постаде светиња Божија, Израиљ област Његова."},
	{3, "3 Море виде и побеже; Јордан се обрати натраг."},
	{4, "4 Горе скакаше као овнови, брдашца као јагањци."},
	{5, "5 Шта ти би, море, те побеже и теби, Јордане, те се обрати натраг?"},
	{6, "6 Горе, што скачете као овнови, и брдашца, као јагањци?"},
	{7, "7 Пред лицем Господњим дрхћи, земљо, пред лицем Бога Јаковљевог."},
	{8, "8 Који претвара камен у језеро водено, гранит у извор водени."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view115() {
struct sr115 poems[] = {
	{1, "1 Не нама, Господе, не нама, него имену свом дај славу, по милости својој, по истини својој."},
	{2, "2 Зашто да говоре народи: Где ли је Бог њихов?"},
	{3, "3 Бог је наш на небесима, твори све што хоће."},
	{4, "4 Идоли су њихови сребро и злато, дело руку човечијих."},
	{5, "5 Уста имају, а не говоре; очи имају, а не виде;"},
	{6, "6 Уши имају, а не чују; ноздрве имају, а не миришу;"},
	{7, "7 Руке имају, а не хватају; ноге имају, а не ходе, и не пуштају глас из грла свог."},
	{8, "8 Такви су и они који их граде, и сви који се уздају у њих."},
	{9, "9 Доме Израиљев, уздај се у Господа; Он им је помоћ и штит."},
	{10, "10 Доме Аронов, уздај се у Господа; Он им је помоћ и штит."},
	{11, "11 Који се бојите Господа, уздајте се у Господа; Он им је помоћ и штит."},
	{12, "12 Господ нас се опомиње, благосиља нас, благосиља дом Израиљев, благосиља дом Аронов;"},
	{13, "13 Благосиља оне који се боје Господа, мале и велике."},
	{14, "14 Да вам Господ умножи благослове, вама и синовима вашим!"},
	{15, "15 Господ да вас благослови, Творац неба и земље!"},
	{16, "16 Небо је небо Господње, а земљу је дао синовима човечијим."},
	{17, "17 Неће Те мртви хвалити, Господе, нити они који сиђу онамо где се ћути."},
	{18, "18 Него ћемо ми благосиљати Господа одсад и довека. Алилуја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view116() {
struct sr116 poems[] = {
	{1, "1 Мило ми је што Господ услиши молитвени глас мој;"},
	{2, "2 Што пригну к мени ухо своје; и зато ћу Га у све дане своје призивати."},
	{3, "3 Опколише ме болести смртне, и јади паклени задесише ме, наиђох на тугу и муку;"},
	{4, "4 Али призвах име Господње: Господе! Избави душу моју!"},
	{5, "5 Добар је Господ и праведан, и Бог је наш милостив;"},
	{6, "6 Чува просте Господ; бејах у невољи, и поможе ми."},
	{7, "7 Врати се душо моја, у мир свој! Јер је Господ добротвор твој!"},
	{8, "8 Ти си избавио душу моју од смрти, око моје од суза, ногу моју од спотицања."},
	{9, "9 Ходићу пред лицем Господњим по земљи живих."},
	{10, "10 Веровах кад говорих: У љутој сам невољи."},
	{11, "11 Рекох у сметњи својој: Сваки је човек лажа."},
	{12, "12 Шта ћу вратити Господу за сва добра што ми је учинио?"},
	{13, "13 Узећу чашу спасења, и призваћу име Господње."},
	{14, "14 Извршићу обећања своја Господу пред свим народом Његовим."},
	{15, "15 Скупа је пред Господом смрт светаца Његових."},
	{16, "16 О Господе! Ја сам слуга Твој, ја сам слуга Твој, син слушкиње Твоје; расковао си с мене окове моје."},
	{17, "17 Жртву за хвалу принећу Теби, и име Господње призваћу."},
	{18, "18 Извршићу обећања своја Господу пред свим народом Његовим,"},
	{19, "19 У двору дома Господњег, усред тебе, Јерусалиме. Алилуја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view117() {
struct sr117 poems[] = {
	{1, "1 Хвалите Господа сви народи, славите Га сва племена;"},
	{2, "2 Јер је велика милост Његова к нама, и истина Господња траје довека. Алилуја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view118() {
struct sr118 poems[] = {
	{1, "1 Хвалите Господа, јер је добар, јер је довека милост Његова."},
	{2, "2 Нека рече Израиљ да је довека милост Његова;"},
	{3, "3 Нека рече дом Аронов да је довека милост Његова;"},
	{4, "4 Нека кажу сви који се боје Господа да је довека милост Његова."},
	{5, "5 Из тескобе повиках ка Господу и услиши ме, изведе ме на пространо место Господ."},
	{6, "6 Господ је са мном, не бојим се; шта ће ми учинити човек?"},
	{7, "7 Господ ми је помоћник: слободно ћу гледати у непријатеље своје."},
	{8, "8 Боље је уздати се у Господа него ли се ослањати на човека;"},
	{9, "9 Боље је уздати се у Господа неголи се ослањати на кнезове."},
	{10, "10 Сви ме народи опколише; али их у име Господње разбих."},
	{11, "11 Оптекоше, опколише ме; али их у име Господње разбих."},
	{12, "12 Опколише ме као пчеле саће, и угасише се као огањ у трњу: у име их Господње разбих."},
	{13, "13 Отиснуо си ме да паднем, али ме Господ прихвати."},
	{14, "14 Господ је хвала моја и песма; Он ми поста Спаситељ."},
	{15, "15 Глас радости и спасења чује се у колибама праведничким: 'Десница Господња даје силу;"},
	{16, "16 Десница Господња узвишује, десница Господња даје силу.'"},
	{17, "17 Нећу умрети, него ћу жив бити, и казивати дела Господња."},
	{18, "18 Карајући покара ме Господ; али ме смрти не даде."},
	{19, "19 Отворите ми врата од правде, ући ћу на њих, славићу Господа."},
	{20, "20 'Ево врата Господња, на која улазе праведници!'"},
	{21, "21 Хвалим Те, што си ме услишио, и постао ми Спаситељ."},
	{22, "22 Камен који одбацише зидари, поста глава од угла."},
	{23, "23 То би од Господа и дивно је у нашим очима."},
	{24, "24 Ево дан, који створи Господ! Радујмо се и веселимо се у њ!"},
	{25, "25 О Господе, помози! О Господе, дај да буде у напредак!"},
	{26, "26 Благословен који иде у име Господње! Благосиљамо вас из дома Господњег."},
	{27, "27 Господ је Бог крепак, и Он нас обасја; жртву празничну, везану врпцама, водите к роговима жртвенику."},
	{28, "28 Ти си Бог мој, Тебе хвалим, Боже мој, Тебе узвишујем."},
	{29, "29 Хвалите Господа, јер је добар, јер је милост Његова довека."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view119() {
struct sr119 poems[] = {
	{1, "1 Благо онима којима је пут чист, који ходе у закону Господњем."},
	{2, "2 Благо онима који чувају откривења Његова, свим срцем траже Га;"},
	{3, "3 Који не чине безакоња, ходе путевима Његовим!"},
	{4, "4 Ти си дао заповести своје, да се чувају добро."},
	{5, "5 Кад би путеви моји били управљени да чувам наредбе Твоје!"},
	{6, "6 Онда се не бих постидео, пазећи на заповести Твоје;"},
	{7, "7 Хвалио бих Те с правим срцем, учећи се праведним законима Твојим."},
	{8, "8 Чуваћу наредбе Твоје, немој ме оставити сасвим."},
	{9, "9 Како ће младић очистити пут свој? Владајући се по Твојим речима."},
	{10, "10 Свим срцем својим тражим Тебе, не дај ми да зађем од заповести Твојих."},
	{11, "11 У срце своје затворио сам реч Твоју, да Ти не грешим."},
	{12, "12 Благословен си, Господе! Научи ме наредбама својим."},
	{13, "13 Устима својим јављам све судове уста Твојих."},
	{14, "14 На путу откривења Твојих радујем се као за велико богатство."},
	{15, "15 О заповестима Твојим размишљам, и пазим на путеве Твоје."},
	{16, "16 Наредбама Твојим тешим се, не заборављам речи Твоје."},
	{17, "17 Учини милост слузи свом, да бих живео и чувао реч Твоју."},
	{18, "18 Отвори очи моје, да бих видео чудеса закона Твог;"},
	{19, "19 Гост сам на земљи, немој сакрити од мене заповести своје."},
	{20, "20 Изнеможе душа моја желећи без престанка познати судове Твоје."},
	{21, "21 Ти си страшан проклетим охолицама, које застрањују од заповести Твојих."},
	{22, "22 Одврати од мене руг и срамоту, јер чувам откривења Твоја."},
	{23, "23 Седе кнезови и договарају се на мене; а слуга Твој размишља о наредбама Твојим."},
	{24, "24 Откривења су Твоја утеха моја, саветници моји."},
	{25, "25 Душа моја лежи у праху; оживи ме по речи својој."},
	{26, "26 Казујем путеве своје, и чујеш ме; научи ме наредбама својим."},
	{27, "27 Уразуми ме о путу заповести својих, и размишљаћу о чудесима Твојим."},
	{28, "28 Сузе пролива душа моја од туге, окрепи ме по речи својој."},
	{29, "29 Пут лажни уклони од мене и закон свој даруј ми."},
	{30, "30 Пут истини избрах, законе Твоје тражим."},
	{31, "31 Прионух за откривења Твоја, Господе; немој ме осрамотити."},
	{32, "32 Путем заповести Твојих трчим, јер си раширио срце моје."},
	{33, "33 Покажи ми, Господе, пут наредаба својих, да га се држим до краја."},
	{34, "34 Уразуми ме, и држаћу се закона Твог, и чувати га свим срцем."},
	{35, "35 Постави ме на стазу заповести својих, јер ми је она омилела."},
	{36, "36 Привиј срце моје к откривењима својим, а не к лакомству."},
	{37, "37 Одврати очи моје да не гледају ништавила, путем својим оживи ме."},
	{38, "38 Испуни слузи свом реч своју да Те се боји."},
	{39, "39 Уклони руг мој, ког се плашим; јер су судови Твоји благи."},
	{40, "40 Миле су ми заповести Твоје, правдом својом оживи ме."},
	{41, "41 Нека дође на ме милост Твоја, Господе, помоћ Твоја по речи Твојој."},
	{42, "42 И ја ћу одговорити ономе који ме ружи; јер се уздам у реч Твоју."},
	{43, "43 Немој узети никад од уста мојих речи истине, јер чекам судове Твоје."},
	{44, "44 И чуваћу закон Твој свагда, довека и без престанка."},
	{45, "45 Ходићу слободно, јер тражим заповести Твоје."},
	{46, "46 Говорићу о откривењима Твојим пред царевима, и нећу се стидети."},
	{47, "47 Тешићу се заповестима Твојим, које љубим."},
	{48, "48 Руке своје пружам к заповестима Твојим, које љубим, и размишљам о наредбама Твојим."},
	{49, "49 Опомени се речи своје к слузи свом, на коју си ми заповедио да се ослањам."},
	{50, "50 У невољи мојој теши ме што ме реч Твоја оживљава."},
	{51, "51 Охоли ми се ругају веома; али ја не одступам од закона Твог."},
	{52, "52 Памтим судове Твоје од искона, Господе, и тешим се."},
	{53, "53 Гнев ме обузима на безбожнике, који остављају закон Твој."},
	{54, "54 Наредбе су Твоје песма моја у путничком стану мом."},
	{55, "55 Ноћу помињем име Твоје, Господе, и чувам закон Твој."},
	{56, "56 То је моје, да чувам заповести Твоје."},
	{57, "57 Део мој Ти си, Господе; наумио сам чувати речи Твоје."},
	{58, "58 Молим Ти се из свега срца, смилуј се на ме по речи својој."},
	{59, "59 Разматрам путеве своје, и обраћам ноге своје к откривењима Твојим."},
	{60, "60 Хитим, и не затежем се чувати заповести Твоје."},
	{61, "61 Мреже безбожничке опколише ме, али закон Твој не заборављам."},
	{62, "62 У по ноћи устајем да Те славим за праведне судове Твоје."},
	{63, "63 У заједници сам са свима који се Тебе боје и који чувају заповести Твоје."},
	{64, "64 Доброте је Твоје, Господе, пуна сва земља; наредбама својим научи ме."},
	{65, "65 Учинио си добро слузи свом, Господе, по речи својој."},
	{66, "66 Доброј мисли и знању научи ме, јер заповестима Твојим верујем."},
	{67, "67 Пре страдања свог лутах, а сад чувам реч Твоју."},
	{68, "68 Ти си добар, и добро чиниш; научи ме наредбама својим."},
	{69, "69 Охоли плету на мене лаж, али се ја свим срцем држим заповести Твојих."},
	{70, "70 Задригло је срце њихово као сало, а ја се тешим законом Твојим."},
	{71, "71 Добро ми је што страдам, да се научим наредбама Твојим."},
	{72, "72 Милији ми је закон уста Твојих него хиљаде злата и сребра."},
	{73, "73 Руке Твоје створиле су ме и начиниле ме; уразуми ме, и научићу се заповестима Твојим."},
	{74, "74 Који се Тебе боје, видеће ме, и радоваће се што се уздам у Твоју реч."},
	{75, "75 Знам да су судови Твоји, Господе, праведни, и по правди ме караш."},
	{76, "76 Нека буде доброта Твоја утеха моја, као што си рекао слузи свом."},
	{77, "77 Нека дође к мени милосрђе Твоје, и оживим; јер је закон Твој утеха моја."},
	{78, "78 Нек се постиде охоли; јер ме без кривице оборише. Ја размишљам о заповестима Твојим."},
	{79, "79 Нек се обрате к мени који се Тебе боје, и који знају откривења Твоја."},
	{80, "80 Срце моје нека буде савршено у наредбама Твојим, да се не постидим."},
	{81, "81 Чезне душа моја за спасењем Твојим, реч Твоју чекам."},
	{82, "82 Чезну очи моје за речју Твојом; говорим: Кад ћеш ме утешити?"},
	{83, "83 Постадох као мех у диму, али Твојих наредаба не заборавих."},
	{84, "84 Колико ће бити дана слуге Твог? Кад ћеш судити онима који ме гоне?"},
	{85, "85 Охоли ископаше ми јаму насупрот закону Твом."},
	{86, "86 Све су заповести Твоје истина; без кривице ме гоне, помози ми."},
	{87, "87 Умало ме не убише на земљи, али ја не остављам заповести Твоје."},
	{88, "88 По милости својој оживи ме, и чуваћу откривења уста Твојих."},
	{89, "89 Довека је, Господе, реч Твоја утврђена на небесима,"},
	{90, "90 Од колена до колена истина Твоја; Ти си поставио земљу, и стоји."},
	{91, "91 По Твојој наредби све стоји сад; јер све служи Теби."},
	{92, "92 Да није закон Твој био утеха моја, погинуо бих у невољи својој."},
	{93, "93 Заповести Твоје нећу заборавити довека, јер ме њима оживљаваш."},
	{94, "94 Ја сам Твој, помози ми, јер тражим заповести Твоје."},
	{95, "95 Безбожници гледају да ме убију; а ја размишљам о Твојим откривењима."},
	{96, "96 Свему савршеном видех крај; али је заповест Твоја веома широка."},
	{97, "97 Како љубим закон твој! Сав дан мислим о њему."},
	{98, "98 Заповест Твоја чини ме мудријег од непријатеља мојих; јер је са мном увек."},
	{99, "99 Разумнији постах од свих учитеља својих; јер размишљам о Твојим откривењима."},
	{100, "100 Мудрији сам од стараца; јер заповести Твоје чувам."},
	{101, "11 Од сваког злог пута заустављам ноге своје, да бих чувао реч Твоју."},
	{102, "12 Од наредаба Твојих не одступам; јер си ме Ти научио."},
	{103, "13 Како су слатке језику мом речи Твоје, слађе од меда устима мојим!"},
	{104, "14 Од заповести Твојих постадох разуман; тога ради мрзим на сваки пут лажни."},
	{105, "15 Реч је Твоја жижак нози мојој, и видело стази мојој."},
	{106, "16 Заклех се да ћу чувати наредбе правде Твоје, и извршићу."},
	{107, "17 Поништен сам веома, Господе, оживи ме по речи својој."},
	{108, "18 Нека Ти буде угодна, Господе, добровољна жртва уста мојих, и судовима својим научи ме."},
	{109, "19 Душа је моја у руци мојој непрестано у невољи; али закон Твој не заборављам."},
	{110, "110 Безбожници су ми метнули замку; али од заповести Твојих не застраних."},
	{111, "111 Присвојих откривења Твоја зававек; јер су радост срцу мом."},
	{112, "112 Приволео сам срце своје да твори наредбе Твоје навек, до краја."},
	{113, "113 Који преступају закон, ја на њих мрзим, а закон Твој љубим."},
	{114, "114 Ти си заклон мој и штит мој; реч Твоју чекам."},
	{115, "115 Идите од мене, безаконици! И чуваћу заповести Бога свог."},
	{116, "116 Укрепи ме по речи својој и бићу жив, и немој ме осрамотити у надању мом."},
	{117, "117 Утврди ме, и спашћу се, и размишљаћу о наредбама Твојим без престанка."},
	{118, "118 Обараш све који одступају од наредаба Твојих; јер су помисли њихове лаж."},
	{119, "119 Као гар бацаш све безбожнике на земљи; тога ради омилеше ми откривења Твоја."},
	{120, "120 Дрхће од страха Твог тело моје, и судова Твојих бојим се."},
	{121, "121 Чиним суд и правду, не дај ме онима који ме гоне."},
	{122, "122 Одбрани слугу свог на добро Његово, да ми не чине силе охоли."},
	{123, "123 Очи моје чезну за спасењем Твојим и за речју правде Твоје."},
	{124, "124 Учини слузи свом по милости својој, и наредбама својим научи ме."},
	{125, "125 Ја сам слуга Твој; уразуми ме, и познаћу откривења Твоја."},
	{126, "126 Време је да Господ ради; оборише закон Твој."},
	{127, "127 Тога ради љубим заповести Твоје већма него злато и драго камење."},
	{128, "128 Тога ради заповести Твоје држим да су верне, на сваки пут лажни мрзим."},
	{129, "129 Дивна су откривења Твоја; зато их чува душа моја."},
	{130, "130 Речи Твоје кад се јаве, просветљују и уразумљују просте."},
	{131, "131 Отварам уста своја да одахнем, јер сам жедан заповести Твојих."},
	{132, "132 Погледај на ме и смилуј се на ме, као што радиш с онима који љубе име Твоје."},
	{133, "133 Утврди стопе моје у речи својој, и не дај никаквом безакоњу да овлада мном."},
	{134, "134 Избави ме од насиља људског, и чуваћу заповести Твоје."},
	{135, "135 Светлошћу лица свог обасјај слугу свог, и научи ме наредбама својим."},
	{136, "136 Очи моје лију потоке, зато што не чувају закон Твој."},
	{137, "137 Праведан си, Господе, и прави су судови Твоји."},
	{138, "138 Јавио си правду у откривењима својим, и истину целу."},
	{139, "139 Ревност моја једе ме, зато што моји непријатељи заборавише речи Твоје."},
	{140, "140 Реч је Твоја веома чиста, и слуга је Твој веома љуби."},
	{141, "141 Ја сам мален и поништен, али заповести Твоје не заборављам."},
	{142, "142 Правда је Твоја правда вечна, и закон Твој истина."},
	{143, "143 Туга и невоља нађе ме, заповести су Твоје утеха моја."},
	{144, "144 Вечна је правда у откривењима Твојим; уразуми ме, и бићу жив."},
	{145, "145 Вичем из свега срца: Услиши ме, Господе; сачуваћу наредбе Твоје."},
	{146, "146 Призивам Те, помози ми; држаћу се откривења Твојих."},
	{147, "147 Претечем свануће, и вичем; реч Твоју чекам."},
	{148, "148 Претечу очи моје јутарњу стражу, да бих размишљао о речи Твојој."},
	{149, "149 Чуј глас мој по милости својој, Господе; по суду свом оживи ме."},
	{150, "150 Прикучују се који љубе безакоње; удаљили су се од закона Твог."},
	{151, "151 Ти си близу, Господе, и све су заповести Твоје истина."},
	{152, "152 Одавна знам за откривења Твоја, да си их поставио зававек."},
	{153, "153 Погледај невољу моју, и избави ме, јер не заборављам закон Твој."},
	{154, "154 Прими се ствари моје, и одбрани ме; по речи својој оживи ме."},
	{155, "155 Далеко је од безбожника спасење, јер се не држе наредаба Твојих."},
	{156, "156 Милосрђе је Твоје, Господе, велико; по правом суду свом оживи ме."},
	{157, "157 Много је противника мојих и непријатеља мојих; али ја не одступам од откривења Твојих."},
	{158, "158 Видим одметнике, и мрско ми је; јер не чувају речи Твоје."},
	{159, "159 Гледај, како љубим заповести Твоје, Господе, по милости својој оживи ме."},
	{160, "160 Основа је речи Твоје истина, и вечан је сваки суд правде Твоје."},
	{161, "161 Кнезови ме гоне низашта, али се срце моје боји речи Твоје."},
	{162, "162 Радујем се речи Твојој као онај који задобије велик плен."},
	{163, "163 Мрзим на лаж и гадим се на њу, љубим закон Твој."},
	{164, "164 Седам пута на дан хвалим Те за судове правде Твоје."},
	{165, "165 Велик мир имају они који љубе закон Твој, и у њих нема спотицања."},
	{166, "166 Чекам спасење Твоје, Господе, и заповести Твоје извршујем."},
	{167, "167 Душа моја чува откривења Твоја, и ја их љубим веома."},
	{168, "168 Чувам заповести Твоје и откривења; јер су сви путеви моји пред Тобом."},
	{169, "169 Нека изађе тужњава моја преда Те, Господе! По речи својој уразуми ме."},
	{170, "170 Нека дође мољење моје преда Те! По речи својој избави ме."},
	{171, "171 Уста ће моја певати хвалу, кад ме научиш наредбама својим."},
	{172, "172 Језик ће мој казивати реч Твоју, јер су све заповести Твоје праведне."},
	{173, "173 Нека ми буде рука Твоја у помоћи; јер ми омилеше заповести Твоје;"},
	{174, "174 Жедан сам спасења Твог, Господе, и закон је Твој утеха моја."},
	{175, "175 Нека живи душа моја и Тебе хвали, и судови Твоји нека ми помогну."},
	{176, "176 Зађох као овца изгубљена: тражи слугу свог; јер заповести Твоје не заборавих."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view120() {
struct sr120 poems[] = {
	{1, "1 Ка Господу завиках у невољи својој, и услиши ме."},
	{2, "2 Господе! Избави душу моју од уста лажљивих и од језика лукавог."},
	{3, "3 Шта ће Ти дати и шта ће Ти принети језик лукави?"},
	{4, "4 Он је као оштре стреле у јакога, као угљевље смреково."},
	{5, "5 Тешко мени кад сам туђин код Месеха, живим код шатора кидарских."},
	{6, "6 Дуго је живела душа моја с онима који мрзе на мир."},
	{7, "7 Ја сам миран; али кад станем говорити у њих је рат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view121() {
struct sr121 poems[] = {
	{1, "1 Подижем очи своје ка горама; одакле ми долази помоћ?"},
	{2, "2 Помоћ је мени од Господа, који је створио небо и земљу."},
	{3, "3 Неће дати да попузне нога твоја; не дремље чувар твој."},
	{4, "4 Гле, не дремље и не спава чувар Израиљев."},
	{5, "5 Господ је чувар твој, Господ је сен твој, Он ти је с десне стране."},
	{6, "6 Дању те неће сунце убити ни месец ноћу."},
	{7, "7 Господ ће те сачувати од сваког зла, сачуваће душу твоју Господ."},
	{8, "8 Господ ће чувати улазак твој и излазак твој, одсад и довека."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view122() {
struct sr122 poems[] = {
	{1, "1 Обрадовах се кад ми рекоше: Хајдемо у дом Господњи!"},
	{2, "2 Ево, стоје ноге наше на вратима твојим, Јерусалиме!"},
	{3, "3 Јерусалим је изидан, као град сливен у једну зграду."},
	{4, "4 Онамо иду племена, племена Господња, по наредби Израиљевој да славе име Господње."},
	{5, "5 Онде стоје престоли судски, престоли дома Давидовог."},
	{6, "6 Иштите мира Јерусалиму; нека буде добро онима који љубе Тебе!"},
	{7, "7 Нека буде мир око зидова твојих, и честитост у дворима твојим!"},
	{8, "8 Ради браће своје, и пријатеља својих говорим: Мир ти!"},
	{9, "9 Ради дома Господа Бога нашег желим ти добро."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view123() {
struct sr123 poems[] = {
	{1, "1 К Теби подижем очи своје, који живиш на небесима!"},
	{2, "2 Као што су очи слугама упрте у руку господара њихових, као очи слушкињине у руку госпође њене, тако су очи наше у Господа Бога нашег, док се смилује на нас."},
	{3, "3 Смилуј се на нас, Господе, смилуј се на нас, јер смо се довољно наситили срамоте;"},
	{4, "4 Довољно се наситила душа наша руга од поноситих, и срамоте од охолих."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view124() {
struct sr124 poems[] = {
	{1, "1 Да није био Господ с нама, нека рече Израиљ,"},
	{2, "2 Да није био Господ с нама, кад људи усташе на нас,"},
	{3, "3 Живе би нас прождрли, кад се распали гнев њихов на нас;"},
	{4, "4 Потопила би нас вода, река би покрила душу нашу;"},
	{5, "5 Покрила би душу нашу силна вода."},
	{6, "6 Благословен Господ, који нас не даде зубима њиховим да нас растржу!"},
	{7, "7 Душа се наша избави као птица из замке ловачке; замка се раскиде, и ми се избависмо."},
	{8, "8 Помоћ је наша у имену Господњем, који је створио небо и земљу."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view125() {
struct sr125 poems[] = {
	{1, "1 Ко се узда у Господа, он је као гора Сион, не помеша се, остаје довека."},
	{2, "2 Око Јерусалима су горе, и Господ је око народа свог одсад и довека."},
	{3, "3 Јер неће остати скиптар безбожнички над делом праведничким, да не би праведници пружили руке своје на безакоње."},
	{4, "4 Учини, Господе, добро добрима и онима који су права срца."},
	{5, "5 А који сврћу на криве путе, отераће Господ с онима који чине безакоње. Мир Израиљу!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view126() {
struct sr126 poems[] = {
	{1, "1 Кад враћаше Господ робље сионско, бејасмо као у сну."},
	{2, "2 Тада уста наша беху пуна радости, и језик наш певања. Тада говораху по народима: Велико дело чини Господ на њима."},
	{3, "3 Велико дело чини Господ на нама; развеселисмо се."},
	{4, "4 Враћај, Господе, робље наше, као потоке на сасушену земљу."},
	{5, "5 Који су са сузама сејали, нека жању с певањем."},
	{6, "6 Иде и плаче који носи семе да сеје; поћи ће с песмом носећи снопове своје."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view127() {
struct sr127 poems[] = {
	{1, "1 Ако Господ неће градити дом, узалуд се муче који га граде; ако неће Господ чувати град, узалуд не спава стражар."},
	{2, "2 Узалуд раните, касно лежете, једете хлеб уморни; милом свом Он даје сан."},
	{3, "3 Ево наследства од Господа: деца, пород је дар од Њега."},
	{4, "4 Шта су стреле у руци јакоме, то су синови млади."},
	{5, "5 Благо човеку који је њима напунио тул свој! Неће се осрамотити кад се стану разговарати с непријатељима на вратима."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view128() {
struct sr128 poems[] = {
	{1, "1 Благо свакоме, који се боји Господа, који ходи путевима Његовим!"},
	{2, "2 Јер ће јести од трудова руку својих. Благо теби, и добро ти је."},
	{3, "3 Жена је твоја као родна лоза усред дома твог; синови твоји као гране маслинове око стола твог."},
	{4, "4 Гле, тако ће бити благословен човек који се боји Господа."},
	{5, "5 Благословиће те Господ са Сиона, и гледаћеш добро јерусалимско у све дане живота свог;"},
	{6, "6 Видећеш синове у синова својих. Мир Израиљу!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view129() {
struct sr129 poems[] = {
	{1, "1 Много ми досађиваше од младости моје нека рече Израиљ,"},
	{2, "2 Много ми досађиваше од младости моје, али ме не свладаше."},
	{3, "3 На леђима мојим ораше орачи, и водише дуге бразде своје."},
	{4, "4 Господ је праведан; исече конопце безбожничке."},
	{5, "5 Постидеће се, одбиће се сви који ненавиде Сион."},
	{6, "6 Биће као трава на крововима, која се сасушује пре него се почупа,"},
	{7, "7 Од које неће жетелац напунити руке своје, нити наручја своја везилац;"},
	{8, "8 И који пролазе неће рећи: 'Благослов Господњи на вама! Благосиљамо вас именом Господњим.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view130() {
struct sr130 poems[] = {
	{1, "1 Из дубине вичем к Теби, Господе!"},
	{2, "2 Господе! Чуј глас мој. Нека пазе уши Твоје на глас мољења мог."},
	{3, "3 Ако ћеш на безакоње гледати, Господе, Господе, ко ће остати?"},
	{4, "4 Али је у Тебе праштање, да би Те се бојали."},
	{5, "5 Чекам Господа; чека душа моја; уздам се у реч Његову."},
	{6, "6 Душа моја чека Господа већма него страже јутарње, које страже јутром."},
	{7, "7 Нека чека Израиљ Господа; јер је у Господа милост, и велик је у Њега откуп."},
	{8, "8 И Он ће откупити Израиља од свих безакоња Његових."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view131() {
struct sr131 poems[] = {
	{1, "1 Господе! Не надима се срце моје, нити се узносе очи моје; нити идем на велико, ни на оно што је више од мене."},
	{2, "2 Смеран сам и кротак душом својом, као дете крај матере; као дете душа је моја у мени."},
	{3, "3 Нек се узда Израиљ у Господа одсад и довека."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view132() {
struct sr132 poems[] = {
	{1, "1 Опомени се, Господе, Давида и све смерности његове,"},
	{2, "2 Како се кунуо Господу, и заветовао Богу Јаковљевом:"},
	{3, "3 'Нећу ући у шатор дома свог, нити ћу лећи на постељу одра свог;"},
	{4, "4 Нећу дати сна очима својим, ни веђама својим дрема;"},
	{5, "5 Док не нађем места Господу, стана Богу Јаковљевом.'"},
	{6, "6 Ево, чусмо да је у Јефремовој земљи, нађосмо Га на пољима киријат-јаримским."},
	{7, "7 Уђимо у стан Његов, поклонимо се подножју ногу Његових."},
	{8, "8 Стани, Господе, на почивалишту свом, Ти и ковчег силе Твоје."},
	{9, "9 Свештеници Твоји нек се обуку у правду, и свеци Твоји нек се радују."},
	{10, "10 Ради Давида, слуге свог, немој одвратити лица од помазаника свог."},
	{11, "11 Закле се Господ Давиду у истини, од које неће одступити; од порода твог посадићу на престолу твом."},
	{12, "12 Ако синови твоји ушчувају завет мој и откривења моја којима ћу их научити, онда ће и синови њихови довека седети на престолу свом."},
	{13, "13 Јер је изабрао Господ Сион, и омиле Му живети на њему."},
	{14, "14 Ово је почивалиште моје увек, овде ћу се населити; јер ми је омилело."},
	{15, "15 Храну ћу његову благословити, ниште његове наситићу хлеба."},
	{16, "16 Свештенике ћу његове обући у спасење, и свети ће се његови радовати."},
	{17, "17 Ту ћу учинити да узрасте рог Давиду, поставићу видело помазанику свом."},
	{18, "18 Непријатеље ћу његове обући у срамоту; а на њему ће цветати венац његов."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view133() {
struct sr133 poems[] = {
	{1, "1 Како је лепо и красно кад сва браћа живе заједно!"},
	{2, "2 Као добро уље на глави, које се стаче на браду, браду Аронову, које се стаче на скут од хаљине његове;"},
	{3, "3 Као роса на Ермону, која силази на горе сионске; јер је онде утврдио Господ благослов и живот довека."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view134() {
struct sr134 poems[] = {
	{1, "1 Сад благосиљајте Господа, све слуге Господње, које стојите у дому Господњем ноћу."},
	{2, "2 Подигните руке своје к светињи, и благосиљајте Господа."},
	{3, "3 Благословиће те са Сиона Господ, који је створио небо и земљу."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view135() {
struct sr135 poems[] = {
	{1, "1 Хвалите име Господње, хвалите, слуге Господње,"},
	{2, "2 Који стојите у дому Господњем; у дворима дома Бога нашег."},
	{3, "3 Хвалите Господа, јер је добар Господ; појте имену Његовом, јер је слатко."},
	{4, "4 Јер Јакова изабра себи Господ, Израиља за достојање своје."},
	{5, "5 Јер познах да је велик Господ, и Господ наш сврх свих богова."},
	{6, "6 Шта год хоће, све Господ чини, на небесима и на земљи, у морима и у свим безданима."},
	{7, "7 Изводи облаке од краја земље, муње чини усред дажда, изводи ветар из стаја његових."},
	{8, "8 Он поби првенце у Мисиру од човека до живинчета."},
	{9, "9 Показа знаке и чудеса усред тебе, Мисире, на Фараону и на свим слугама његовим."},
	{10, "10 Поби народе велике, и изгуби цареве јаке:"},
	{11, "11 Сиона, цара аморејског и Ога, цара васанског, и сва царства хананска;"},
	{12, "12 И даде земљу њихову у достојање, у достојање Израиљу, народу свом."},
	{13, "13 Господе! Име је Твоје вечно; Господе! Спомен је Твој од колена до колена."},
	{14, "14 Јер ће судити Господ народу свом, и на слуге своје смиловаће се."},
	{15, "15 Идоли су незнабожачки сребро и злато, дело руку човечијих;"},
	{16, "16 Уста имају, а не говоре; очи имају, а не виде;"},
	{17, "17 Уши имају, а не чују; нити има дихања у устима њиховим."},
	{18, "18 Какви су они онакви су и они који их граде, и сви који се уздају у њих."},
	{19, "19 Доме Израиљев, благосиљај Господа; доме Аронов, благосиљај Господа;"},
	{20, "20 Доме Левијев, благосиљај Господа; који се бојите Господа, благосиљајте Господа."},
	{21, "21 Благословен Господ на Сиону, који живи у Јерусалиму! Алилуја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view136() {
struct sr136 poems[] = {
	{1, "1 Славите Господа, јер је добар; јер је довека милост Његова;"},
	{2, "2 Славите Бога над боговима; јер је довека милост Његова."},
	{3, "3 Славите Господара над господарима; јер је довека милост Његова;"},
	{4, "4 Оног, који један твори чудеса велика; јер је довека милост Његова;"},
	{5, "5 Који је створио небеса премудро; јер је довека милост Његова;"},
	{6, "6 Утврдио земљу на води; јер је довека милост Његова;"},
	{7, "7 Створио велика видела; јер је довека милост Његова;"},
	{8, "8 Сунце, да управља даном; јер је довека милост Његова;"},
	{9, "9 Месец и звезде, да управљају ноћу; јер је довека милост Његова;"},
	{10, "10 Који поби Мисир у првенцима његовим; јер је довека милост Његова;"},
	{11, "11 Изведе из њега Израиља; јер је довека милост Његова;"},
	{12, "12 Руком крепком и мишицом подигнутом; јер је довека милост Његова;"},
	{13, "13 Који раздвоји Црвено Море; јер је довека милост Његова;"},
	{14, "14 И проведе Израиља кроз сред њега; јер је довека милост Његова;"},
	{15, "15 А Фараона и војску његову врже у море црвено; јер је довека милост Његова;"},
	{16, "16 Преведе народ свој преко пустиње; јер је довека милост Његова;"},
	{17, "17 Поби цареве велике; јер је довека милост Његова;"},
	{18, "18 И изгуби цареве знатне; јер је довека милост Његова;"},
	{19, "19 Сиона, цара аморејског; јер је довека милост Његова;"},
	{20, "20 И Ога, цара васанског; јер је довека милост Његова;"},
	{21, "21 И даде земљу њихову у достојање; јер је довека милост Његова;"},
	{22, "22 У достојање Израиљу, слузи свом; јер је довека милост Његова;"},
	{23, "23 Који нас се опомену у понижењу нашем; јер је довека милост Његова;"},
	{24, "24 И избави нас од непријатеља наших; јер је довека милост Његова;"},
	{25, "25 Који даје храну сваком телу; јер је довека милост Његова;"},
	{26, "26 Славите Бога небеског; јер је довека милост Његова."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view137() {
struct sr137 poems[] = {
	{1, "1 На водама вавилонским сеђасмо и плакасмо опомињући се Сиона."},
	{2, "2 О врбама сред њега вешасмо харфе своје."},
	{3, "3 Онде искаху који нас заробише да певамо, и који нас оборише да се веселимо: 'Певајте нам песму сионску.'"},
	{4, "4 Како ћемо певати песму Господњу у земљи туђој?"},
	{5, "5 Ако заборавим тебе, Јерусалиме, нека ме заборави десница моја."},
	{6, "6 Нека прионе језик мој за уста моја, ако тебе не успамтим, ако не уздржим Јерусалима сврх весеља свог."},
	{7, "7 Напомени, Господе, синовима Едомовим дан јерусалимски, кад говорише: Раскопајте, раскопајте га до темеља."},
	{8, "8 Кћери вавилонска, крвницо, благо ономе ко ти плати за дело које си нама учинила!"},
	{9, "9 Благо ономе који узме и разбије децу твоју о камен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view138() {
struct sr138 poems[] = {
	{1, "1 Славим Те, Господе, од свега срца свог, пред боговима певам Теби."},
	{2, "2 Поклањам се пред светом црквом Твојом, и славим име Твоје, за доброту Твоју и за истину Твоју; јер си по сваком имену свом подигао реч своју."},
	{3, "3 У дан, у који зазвах, Ти си ме услишио, дунуо слободу у душу моју."},
	{4, "4 Славиће Те, Господе, сви цареви земаљски, кад чују речи уста Твојих;"},
	{5, "5 И певаће путеве Господње, јер је велика слава Господња."},
	{6, "6 Јер је висок Господ, и види ниског, и високог издалека познаје."},
	{7, "7 Ако пођем у тузи, Ти ћеш ме оживети; на злоћу непријатеља мојих пружићеш руку своју и заклониће ме десница Твоја."},
	{8, "8 Господ ће свршити за мене. Господе! Милост је Твоја довека; дела руку својих не остављај."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view139() {
struct sr139 poems[] = {
	{1, "1 Господе! Ти ме кушаш и знаш."},
	{2, "2 Ти знаш кад седам и кад устанем; Ти знаш помисли моје издалека;"},
	{3, "3 Кад ходим и кад се одмарам, Ти си око мене, и све путеве моје видиш."},
	{4, "4 Још нема речи на језику мом, а Ти, Господе, гле, већ све знаш."},
	{5, "5 Састраг и спред Ти си ме заклонио, и ставио на ме руку своју."},
	{6, "6 Чудно је за ме знање Твоје, високо, не могу да га докучим."},
	{7, "7 Куда бих отишао од духа Твог, и од лица Твог куда бих побегао?"},
	{8, "8 Да изађем на небо, Ти си онде. Да сиђем у пакао, онде си."},
	{9, "9 Да се дигнем на крилима од зоре, и преселим се на крај мора:"},
	{10, "10 И онде ће ме рука Твоја водити, и држати ме десница Твоја."},
	{11, "11 Да кажем: Да ако ме мрак сакрије; али је и ноћ као видело око мене."},
	{12, "12 Ни мрак неће замрачити од Тебе, и ноћ је светла као дан: мрак је као видело."},
	{13, "13 Јер си Ти створио шта је у мени, саставио си ме у утроби матере моје."},
	{14, "14 Хвалим Те, што сам дивно саздан. Дивна су дела Твоја, и душа моја то зна добро."},
	{15, "15 Ниједна се кост моја није сакрила од Тебе, ако и јесам саздан тајно, откан у дубини земаљској."},
	{16, "16 Заметак мој видеше очи Твоје, у књизи је Твојој све то записано, и дани забележени, кад их још није било ниједног."},
	{17, "17 Како су ми недокучиве помисли Твоје, Боже! Како им је велик број!"},
	{18, "18 Да их бројим, више их је него песка. Кад се пробудим, још сам с Тобом."},
	{19, "19 Да хоћеш, Боже, убити безбожника! Крвопије, идите од мене."},
	{20, "20 Они говоре ружно на Тебе; узимају име Твоје узалуд непријатељи Твоји."},
	{21, "21 Зар да не мрзим на оне, који на Те мрзе, Господе, и да се не гадим на оне који устају на Тебе?"},
	{22, "22 Пуном мрзошћу мрзим на њих; непријатељи су ми."},
	{23, "23 Окушај ме, Боже, и познај срце моје, испитај ме, и познај помисли моје."},
	{24, "24 И види јесам ли на злом путу, и води ме на пут вечни."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view140() {
struct sr140 poems[] = {
	{1, "1 Избави ме, Господе, од човека злог, сачувај ме од насилника,"},
	{2, "2 Који помишљају зло у срцу и сваки дан подижу рат;"},
	{3, "3 Оштре језик свој као змија, јед је аспидин у устима њиховим."},
	{4, "4 Сачувај ме, Боже, од руку безбожничких, од насилника сахрани ме, који мисле да поткину ноге моје."},
	{5, "5 Охоли ми наместише замке и пругла, метнуше ми мрежу на пут, пређу разапеше ми."},
	{6, "6 Рекох Господу: Ти си Бог мој, услиши, Господе, глас мољења мог."},
	{7, "7 Господе, Господе, крепки Спаситељу мој, заклони главу моју у дан ратни!"},
	{8, "8 Не дај, Господе, безбожнику шта жели, не дај му да докучи шта је наумио, да се не узносе."},
	{9, "9 Отров оних што су око мене, погибао уста њихових нека се обрати на њих."},
	{10, "10 Нека падне на њих живо угљевље; нека их Он баци у огањ, у пропасти, да не устану."},
	{11, "11 Човек језичан неће се утврдити на земљи, неправедног ће злоћа увалити у погибао."},
	{12, "12 Знам да ће Господ показати правду невољноме и правицу убогима."},
	{13, "13 Да! Праведни ће славити име Твоје, прави ће остати пред лицем Твојим."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view141() {
struct sr141 poems[] = {
	{1, "1 Господе, вичем к Теби, похитај к мени, чуј глас мољења мог, кад вичем к Теби."},
	{2, "2 Нек изађе молитва моја као кад пред лице Твоје, дизање руку мојих као принос, вечерњи."},
	{3, "3 Постави, Господе, стражу код језика мог, чувај врата уста мојих."},
	{4, "4 Не дај срцу мом да застрани на зле помисли, да чини дела безбожна с људима који поступају неправедно; и да не окусим сладости њихове."},
	{5, "5 Нека ме бије праведник, то је милост; нека ме кара, то је уље за главу моју; глава моја неће одбацити, ако ће и више; него је молитва моја против злоће њихове."},
	{6, "6 Расуше се по каменим врлетима судије њихове, и чуше речи моје како су благе."},
	{7, "7 Као кад ко сече и теше, тако се разлетеше кости наше до чељусти паклених."},
	{8, "8 Али су к Теби, Господе, Господе, управљене очи моје, у Тебе се уздам, немој одбацити душу моју."},
	{9, "9 Сачувај ме од замке, коју ми метнуше, од лукавства оних, који чине безакоње."},
	{10, "10 Пашће у мреже своје безбожници, а ја ћу један проћи."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view142() {
struct sr142 poems[] = {
	{1, "1 Гласом својим ка Господу вичем, гласом својим Господу се молим."},
	{2, "2 Изливам пред Њим мољење своје, тугу своју пред Њим казујем,"},
	{3, "3 Кад изнемогне у мени дух мој. Ти знаш стазу моју. На путу, којим ходим, сакрише ми замку."},
	{4, "4 Погледам надесно, и видим да ме нико не зна; нестаде ми уточишта, нико не мари за душу моју."},
	{5, "5 Вичем к Теби, Господе; велим: Ти си уточиште моје, део мој на земљи живих."},
	{6, "6 Чуј тужњаву моју; јер се мучим веома. Избави ме од оних који ме гоне, јер су јачи од мене."},
	{7, "7 Изведи из тамнице душу моју, да славим име Твоје. Око мене ће се скупити праведници, кад ми учиниш добро."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view143() {
struct sr143 poems[] = {
	{1, "1 Господе, услиши молитву моју, прими мољење моје по истини својој, услиши ме по правди својој."},
	{2, "2 И не иди на суд са слугом својим, јер се неће оправдати пред Тобом нико жив."},
	{3, "3 Непријатељ гони душу моју, гази у прах живот мој, посађује ме у мрак, као давно помрле."},
	{4, "4 Трне у мени дух мој, нестаје у мени срца мог."},
	{5, "5 Помињем дане старе, пребрајам све послове Твоје, размишљам о делима руку Твојих."},
	{6, "6 Пружам к Теби руке своје; душа је моја као сува земља пред Тобом."},
	{7, "7 Похитај, услиши ме; Господе, нестаје духа мог, немој одвратити лице своје од мене; јер ћу бити као они који одлазе у гроб."},
	{8, "8 Рано ми јави милост своју, јер се у Тебе уздам. Покажи ми пут, којим да идем, јер к Теби подижем душу своју."},
	{9, "9 Избави ме од непријатеља мојих, Господе, к Теби притечем."},
	{10, "10 Научи ме Творити вољу Твоју, јер си Ти Бог мој; дух Твој благи нека ме води по стази правој."},
	{11, "11 Имена ради свог, Господе, оживи ме, по правди својој изведи из муке душу моју."},
	{12, "12 И по милости својој истреби непријатеље моје, и погуби све који муче душу моју, јер сам Твој слуга."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view144() {
struct sr144 poems[] = {
	{1, "1 Благословен Господ, град мој, који учи руке моје боју, прсте моје рату,"},
	{2, "2 Добротвор мој и ограда моја, уточиште моје и Избавитељ мој, Штит мој, Онај у кога се уздам, који ми покорава народ мој."},
	{3, "3 Господе! Шта је човек, те знаш за њ, и син смртнога, те га пазиш?"},
	{4, "4 Човек је као ништа; дани су његови као сен, који пролази."},
	{5, "5 Господе! Савиј небеса своја, и сиђи; дотакни се гора, и задимиће се."},
	{6, "6 Севни муњом, и разагнај их; пусти стреле своје, и распи их."},
	{7, "7 Пружи руку своју с висине, избави ме и извади ме из воде велике, из руку туђинаца,"},
	{8, "8 Којих уста говоре ништавне ствари, и којих је десница десница лажна."},
	{9, "9 Боже! Песму нову певаћу Ти, у псалтир од десет жица удараћу Теби,"},
	{10, "10 Који дајеш спасење царевима, и Давида слугу свог избављаш од љутог мача."},
	{11, "11 Избави ме и отми ме из руке туђинаца, којих уста говоре ништавне ствари, и којих је десница десница лажна."},
	{12, "12 Синови наши нека буду као биље, које весело одрасте у младости; кћери наше као ступови прекрасно израђени у двору;"},
	{13, "13 Житнице наше пуне, обилне сваким житом; овце наше нек се множе на хиљаде и на сто хиљада по становима нашим."},
	{14, "14 Волови наши нека буду товни; нека не буду нападања, ни бежања, ни тужњаве по улицама нашим."},
	{15, "15 Благо народу, у ког је све овако! Благо народу, у ког је Господ Бог!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view145() {
struct sr145 poems[] = {
	{1, "1 Узвишаваћу Те, Боже мој, царе мој, благосиљаћу име Твоје од века до века."},
	{2, "2 Сваки ћу Те дан благосиљати, и хвалићу име Твоје довека и без престанка."},
	{3, "3 Велик је Господ, и ваља Га славити, и величанство Његово не може се досегнути."},
	{4, "4 Од колена до колена хвалиће дела Твоја, и силу Твоју казивати."},
	{5, "5 О високој слави Твог величанства, и о дивним делима Твојим размишљам."},
	{6, "6 Приповедаће силу чудеса Твојих, и ја ћу величанство Твоје казивати."},
	{7, "7 Хвалиће велику доброту Твоју и правду Твоју певаће."},
	{8, "8 Податљив је и милосрдан Господ, дуго трпи и велике је милости."},
	{9, "9 Добар је Господ према свима, и жалостив на сва дела своја."},
	{10, "10 Нека Те славе, Господе, сва дела Твоја, и свеци Твоји нека Те благосиљају."},
	{11, "11 Нека казују славу царства Твог, и силу Твоју приповедају."},
	{12, "12 Да би јавили синовима људским силу Твоју, и високу славу царства Твог."},
	{13, "13 Царство је Твоје царство свих векова, и влада Твоја на сва колена."},
	{14, "14 Господ прихвата све који падају, и исправља све погнуте."},
	{15, "15 Очи су свих к Теби управљене, и Ти им дајеш храну на време;"},
	{16, "16 Отвараш руку своју, и ситиш свашта живо по жељи."},
	{17, "17 Праведан је Господ у свим путевима својим, и свет у свим делима својим."},
	{18, "18 Господ је близу свих који Га призивају, свих, који Га призивају у истини."},
	{19, "19 Жељу испуња онима који Га се боје, тужњаву њихову чује, и помаже им."},
	{20, "20 Чува Господ све који Га љубе, а безбожнике све ће истребити."},
	{21, "21 Хвалу Господу нека говоре уста моја, и нека благосиља свако тело свето име Његово увек и без престанка."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view146() {
struct sr146 poems[] = {
	{1, "1 Хвали, душо моја, Господа."},
	{2, "2 Хвалићу Господа за живота свог, певаћу Богу свом док ме је год."},
	{3, "3 Не уздајте се у кнезове, у сина човечијег, у ког нема помоћи."},
	{4, "4 Изиђе из њега дух, и врати се у земљу своју: тај дан пропадну све помисли његове."},
	{5, "5 Благо ономе, коме је помоћник Бог Јаковљев, коме је надање у Господу, Богу његовом,"},
	{6, "6 Који је створио небо и земљу, море и све што је у њима; који држи веру увек,"},
	{7, "7 Чини суд онима којима се чини криво; даје храну гладнима. Господ дреши свезане,"},
	{8, "8 Господ отвара очи слепцима, подиже оборене, Господ љуби праведнике."},
	{9, "9 Господ чува дошљаке, помаже сироти и удовици; а пут безбожнички превраћа."},
	{10, "10 Господ је цар довека, Бог твој, Сионе, од колена до колена. Алилуја."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view147() {
struct sr147 poems[] = {
	{1, "1 Хвалите Господа, јер је слатко певати Бога нашег, јер Благоме приликује хвала."},
	{2, "2 Господ зида Јерусалим, сабира расејане синове Израиљеве;"},
	{3, "3 Исцељује оне који су скрушеног срца, и лечи туге њихове;"},
	{4, "4 Избраја мноштво звезда, и све их зове именом."},
	{5, "5 Велик је Господ наш и велика је крепост Његова, и разуму Његовом нема мере."},
	{6, "6 Прихвата смерне Господ, а безбожне понижава до земље."},
	{7, "7 Редом певајте Господу хвалу, ударајте Богу нашем у гусле."},
	{8, "8 Он застире небо облацима, спрема земљи дажд, чини те расте на горама трава;"},
	{9, "9 Даје стоци пићу њену, и вранићима, који вичу к Њему."},
	{10, "10 Не мари за силу коњску, нити су Му мили краци човечији."},
	{11, "11 Мили су Господу они који Га се боје, који се уздају у милост Његову."},
	{12, "12 Слави, Јерусалиме, Господа; хвали Бога свог, Сионе!"},
	{13, "13 Јер Он утврђује преворнице врата твојих, благосиља синове твоје у теби."},
	{14, "14 Ограђује међе твоје миром, насићава те једре пшенице."},
	{15, "15 Шаље говор свој на земљу, брзо тече реч Његова."},
	{16, "16 Даје снег као вуну, сипа иње као пепео."},
	{17, "17 Баца град свој као залогаје, пред мразом Његовим ко ће остати?"},
	{18, "18 Пошаље реч своју, и све се раскрави; дуне духом својим, и потеку воде."},
	{19, "19 Он је јавио реч своју Јакову, наредбе и судове своје Израиљу."},
	{20, "20 Ово није учинио ни једном другом народу, и судова Његових они не знају. Алилуја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view148() {
struct sr148 poems[] = {
	{1, "1 Хвалите Господа на небесима, хвалите Га на висини."},
	{2, "2 Хвалите Га, сви анђели Његови, хвалите Га, све војске Његове!"},
	{3, "3 Хвалите Га, сунце и месече, хвалите Га, све звезде сјајне!"},
	{4, "4 Хвалите Га, небеса над небесима и водо над небесима!"},
	{5, "5 Нека хвале име Господње, јер Он заповеди и створише се."},
	{6, "6 Постави их засвагда и зававек, даде наредбу, која неће проћи."},
	{7, "7 Хвалите Господа на земљи, велике рибе и све бездане;"},
	{8, "8 Огањ и град, снег и магла, ветар силни, који извршује реч Његову."},
	{9, "9 Горе и сви хумови, родна дрвета и сви кедри,"},
	{10, "10 Звери и сва стока, бубине и птице крилате,"},
	{11, "11 Цареви земаљски и сви народи, кнезови и све судије земаљске,"},
	{12, "12 Момци и девојке, старци и деца"},
	{13, "13 Нека хвале име Господње; јер је само Његово име узвишено, слава Његова на земљи и на небу."},
	{14, "14 Он је узвисио рог народа свог, славу свих светаца својих, синова Израиљевих, народа који је близу Њега."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view149() {
struct sr149 poems[] = {
	{1, "1 Појте Господу песму нову; хвала да Му је на сабору светих."},
	{2, "2 Нека се весели Израиљ о Створитељу свом, синови сионски нек се радују о цару свом."},
	{3, "3 Нека хвале име Његово покликујући, у бубањ и гусле нека Му ударају."},
	{4, "4 Јер је мио Господу народ Његов, украшава смерне спасавајући их."},
	{5, "5 Нек се веселе свеци у слави, и нек се радују на постељама својим."},
	{6, "6 Слава је Божија у устима њиховим, и мач с обе стране оштар у руци њиховој,"},
	{7, "7 Да се освете народима, и покарају племена;"},
	{8, "8 Да свежу цареве њихове у ланце, и властелу њихову у окове гвоздене,"},
	{9, "9 И изврше на њима написани суд. Ова је част свима свецима Његовим. Алилуја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view150() {
struct sr150 poems[] = {
	{1, "1 Хвалите Бога у светињи Његовој, хвалите Га на тврђи славе Његове."},
	{2, "2 Хвалите Га према сили Његовој, хвалите Га према високом величанству Његовом."},
	{3, "3 Хвалите Га уз глас трубни, хвалите Га уз псалтир и гусле."},
	{4, "4 Хвалите Га с бубњем и весељем, хвалите Га уз жице и орган."},
	{5, "5 Хвалите Га уз јасне кимвале, хвалите Га уз кимвале громовне."},
	{6, "6 Све што дише нека хвали Господа! Алилуја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};