#include <map>
#include <string>
class Bible51
{
	struct hy1	{ int val; const char *msg; };
	struct hy2	{ int val; const char *msg; };
	struct hy3	{ int val; const char *msg; };
	struct hy4	{ int val; const char *msg; };
public:
static void view1() {
struct hy1 poems[] = {
	{1, "1 Պօղոսը՝ առաքեալը Յիսուս Քրիստոսի՝ Աստծու կամքով, եւ Տիմոթէոս եղբայրը՝ "},
	{2, "2 Կողոսիայում եղող սրբերին եւ հաւատացեալ եղբայրներին ի Քրիստոս։ "},
	{3, "3 Շնո՜րհ ձեզ եւ խաղաղութի՜ւն մեր Հայր Աստծուց եւ Տէր Յիսուս Քրիստոսից։ "},
	{4, "4 Գոհութիւն ենք յայտնում Աստծուն եւ մեր Տէր Յիսուս Քրիստոսի Հօրը՝ միշտ ձեզ համար աղօթք անելով, "},
	{5, "5 լսելով ձեր հաւատի մասին ի Տէր Քրիստոս Յիսուս եւ սիրոյ մասին, որ ունէք բոլոր սրբերի հանդէպ, "},
	{6, "6 այն յոյսի համար, որ պահուած է ձեզ երկնքում։ Այդ յոյսի մասին նախապէս լսել էք Աւետարանի ճշմարտութեան խօսքով, "},
	{7, "7 որ հասաւ մինչեւ ձեզ. եւ թէ ինչպէս այն աճում ու պտղաբերում է ամբողջ աշխարհում, ինչպէս եւ ձեր մէջ, այն օրից, երբ լսեցիք ու ճշմարտութեամբ ճանաչեցիք Աստծու շնորհը "},
	{8, "8 եւ ինչպէս ուսանեցիք մեր սիրելի ծառայակից Եպափրասից, որը Յիսուսի հաւատարիմ ծառան է ձեզ համար "},
	{9, "9 եւ որը պատմեց մեզ այն սէրը՝ որ Հոգին տուեց ձեզ։ "},
	{10, "10 Դրա համար մենք էլ՝ այն օրուանից, երբ լսեցինք այդ, չենք դադարում ձեզ համար աղօթելուց եւ Աստծուն աղաչանքներ մատուցելուց, որպէսզի լցուէք նրա կամքի գիտութեամբ՝ ունենալով կատարեալ իմաստութիւն եւ հոգեւոր իմացութիւն՝ "},
	{11, "11 ապրելու համար Տիրոջն արժանի եւ ամէն ինչում նրան հաճելի ձեւով, բոլոր բարի գործերում պտղաբեր լինելու եւ Աստծու գիտութեամբ աճելու համար՝ "},
	{12, "12 զօրացած նրա ամբողջ ուժով, նրա փառքի զօրութեամբ, կատարեալ համբերութեամբ եւ յարատեւութեամբ։ "},
	{13, "13 Գոհութիւն Հօրը, որ մեզ արժանացրեց մասնակից լինելու լուսաբնակ սրբերի վիճակին. "},
	{14, "14 նա փրկեց մեզ խաւարի իշխանութիւնից եւ մեզ փոխադրեց արքայութիւնն իր սիրելի Որդու, "},
	{15, "15 որով փրկութիւն ունենք նրա արեամբ եւ մեղքերի թողութիւն՝ նրա մարմնով։ "},
	{16, "16 Նա պատկերն է աներեւոյթ Աստծու, անդրանիկը բոլոր արարածների. "},
	{17, "17 որովհետեւ նրանով ստեղծուեց այն ամէնը, ինչ որ երկնքում է եւ ինչ որ՝ երկրի վրայ, ինչ որ երեւում է եւ ինչ որ չի երեւում. թէ՛ գահեր, թէ՛ տէրութիւններ, թէ՛ պետութիւններ, թէ՛ իշխանութիւններ, - ամէն ինչ նրանո՛վ եւ նրա՛ համար ստեղծուեց. "},
	{18, "18 եւ նա կար առաջ, քան ամէն ինչ. եւ ամէն ինչ նրանո՛վ է կանգնած հաստատ։ "},
	{19, "19 Եւ նա՛ է գլուխը մարմնի, որ եկեղեցին է. նա՛, որ սկիզբ է, անդրանիկը՝ մեռելների միջից, որպէսզի ինքը լինի ամէն ինչում նախապատիւը. "},
	{20, "20 որովհետեւ Աստուածութեան լրիւ ամբողջութիւնը նրա՛ մէջ հաճեց բնակուել "},
	{21, "21 եւ նրանո՛վ հաշտեցնել ամէն ինչ իր հետ՝ խաղաղութիւն անելով խաչի վրայ թափած իր արեամբ ե՛ւ երկրի վրայ, ե՛ւ երկնքում եղածների համար։ "},
	{22, "22 Եւ ձեզ, որ մի ժամանակ օտարացած եւ թշնամացած էիք Նրան ձեր մտածումներով եւ չար գործերով, այժմ, "},
	{23, "23 ահա՛ւասիկ, հաշտեցրեց ձեզ իր իսկ մարմնով եւ իր մահուամբ, որպէսզի ներկայացնի ձեզ Աստծու առաջ սուրբ, անբիծ եւ անարատ, "},
	{24, "24 եթէ ամուր ու անսասան մնաք հաւատի մէջ եւ անխախտ՝ յոյսի մէջ այն Աւետարանի, որ լսեցիք եւ որ քարոզուեց երկնքի տակ գտնուող բոլոր արարածներին, եւ որին ես՝ Պօղոսը, սպասաւոր եղայ։ "},
	{25, "25 Եւ այժմ ուրախ եմ ձեզ համար կրած իմ չարչարանքների համար եւ լրացնում եմ իմ մարմնի մէջ Քրիստոսի նեղութիւնների պակասը իր մարմնի համար, որ է եկեղեցին. "},
	{26, "26 դրան ես՝ Պօղոսը, սպասաւոր եղայ ըստ Աստծու տնտեսութեան, որ տրուեց ինձ՝ ձեր մէջ կատարելապէս քարոզելու Աստծու խօսքը, "},
	{27, "27 այն խորհուրդը, որ ծածկուած էր դարերից եւ սերունդներից, եւ որ այժմ յայտնուեց իր սրբերին. "},
	{28, "28 Աստուած ուզեց ցոյց տալ նրանց, թէ փառքի ինչ ճոխութիւն կայ այս խորհրդի մէջ հեթանոսների համար. եւ այդ խորհուրդը այս է. Քրիստոս՝ փառքի յոյսը, ձեր մէջ։ "},
	{29, "29 Այդ Քրիստոսն ենք քարոզում մենք, յորդորում ենք ամէն մարդու եւ ուսուցանում ամէն մարդու ամենայն հոգեւոր իմաստութեամբ, որպէսզի ամէն մարդու կատարեալ դարձնենք ի Քրիստոս Յիսուս, "},
	{30, "30 որի համար եւ աշխատում ու պայքարում եմ ըստ նրա այն ուժի, որ գործում է իմ մէջ զօրութեամբ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct hy2 poems[] = {
	{1, "1 Ուզում եմ, որ դուք գիտենաք, թէ ինչպիսի նեղութիւն եմ կրում ձեզ համար եւ լաւոդիկեցիների համար եւ բոլոր նրանց համար, որոնք իմ երեսը չեն տեսել անձնապէս, "},
	{2, "2 որպէսզի մխիթարուեն նրանց սրտերը, մէկտեղուեն սիրով եւ հասնեն կատարեալ իմաստութեան ճոխութեանը՝ ճանաչելու համար Աստծու խորհուրդը, որ յայտնուած է ի Քրիստոս Յիսուս, "},
	{3, "3 որի մէջ պահուած են գիտութեան եւ իմաստութեան բոլոր գանձերը։ "},
	{4, "4 Եւ այս բանն ասում եմ, որպէսզի ոչ ոք ձեզ չմոլորեցնի պատիր խօսքերով. "},
	{5, "5 որովհետեւ, թէպէտեւ հեռու եմ մարմնով, բայց հոգով ձեզ հետ եմ. ուրախանում եմ, երբ տեսնում եմ ձեր բարի վարքը եւ ձեր հաւատի ամրութիւնը ի Քրիստոս Յիսուս։ "},
	{6, "6 Արդ, ինչպէս որ ընդունեցիք Քրիստոս Յիսուսին՝ Տիրոջը, այնպէս էլ ընթացէ՛ք նրանով՝ "},
	{7, "7 արմատաւորուած եւ կառուցուած նրա վրայ, հաստատ մնալով հաւատի մէջ, ինչպէս որ ուսանեցիք, որպէսզի աճէք նրա մէջ գոհութեամբ։ "},
	{8, "8 Զգո՛յշ եղէք, չլինի թէ մէկը ձեզ գրաւի ճարտարամտութեամբ եւ սնոտի խաբեբայութեամբ. դրանք մարդկային աւանդութեան եւ բնութեան տարերային ուժերի վրայ են հիմնուած եւ ոչ Յիսուս Քրիստոսի ճշմարիտ վարդապետութեան վրայ. "},
	{9, "9 քանի որ նրա մէջ է բնակւում Աստուածութեան ամբողջ լիութիւնը մարմնապէս։ "},
	{10, "10 Դուք էլ էք լցուած նրանով, որ գլուխն է ամէն իշխանութեան եւ պետութեան. "},
	{11, "11 նրանով դուք անձեռագործ թլփատութեամբ թլփատուեցիք հաւատով՝ մերկանալով մեղանչական մարմնից Քրիստոսի թլփատութեամբ. "},
	{12, "12 թաղուելով նրա հետ մկրտութեան մէջ՝ դրանով իսկ նրա հետ յարութիւն առաք Աստծու զօրութեանը հաւատալով, որը նրան յարութիւն տուեց մեռելներից։ "},
	{13, "13 Եւ ձեզ, որ մի ժամանակ մեռել էիք մեղքերի եւ ձեր մարմնի անթլփատութեան մէջ, կենդանացրեց իր հետ։ "},
	{14, "14 Նա ներեց մեզ մեր բոլոր յանցանքները եւ ոչնչացրեց հրամաններով հաստատուած այն պարտամուրհակը, որ մեր դէմ էր, վերացրեց այն մէջտեղից եւ մեխեց խաչափայտին։ "},
	{15, "15 Իշխանութիւններին եւ պետութիւններին զինաթափ արեց, հրապարակաւ խայտառակեց՝ նրանց պարտութեան մատնելով Քրիստոսի միջոցով՝ նրա յարութեամբ։ "},
	{16, "16 Ուրեմն, թող ոչ ոք ձեզ չդատապարտի ուտելու կամ խմելու, տօնական օրերի, նորալուսնի կամ շաբաթի հարցում, "},
	{17, "17 որոնք գալիք բաների ստուերներն են. բուն մարմինը Քրիստոսն է։ "},
	{18, "18 Թող ձեզ չխաբի ոչ ոք, որին հաճելի է, խոնարհ ձեւանալով, հրեշտակներին պաշտամունք մատուցելով, դեռ չտեսած բաներին միջամուխ լինելով, անտեղի հպարտանալ մարմնական մտածումներով։ "},
	{19, "19 Այդպիսին չի կարող կապուած լինել գլխին՝ Քրիստոսին, որից ամբողջ մարմինը, յօդերով եւ յօդակապերով հաղորդակցուած եւ միակցուած, իր աճումն է ստանում այն աճումով, որ Աստծուց է։ "},
	{20, "20 Եթէ մեռաք Քրիստոսի հետ եւ այս աշխարհի տարերքի իշխանութիւնից դուրս եկաք, էլ ինչո՞ւ աշխարհում ապրող էակների նման հետեւում էք կանոններին՝ ասելով. "},
	{21, "21 Մի՛ մօտեցիր, մի՛ ճաշակիր, մի՛ դիպչիր, "},
	{22, "22 քանի որ այդ բոլորը, գործածուելով, ապականւում են՝ ըստ մարդկանց պատուիրանների եւ վարդապետութեան։ "},
	{23, "23 Նրանք կարող են իմաստուն ձեւանալ իրենց ինքնակամ կրօնով, խոնարհութեամբ եւ իրենց մարմնի խստակեցութեամբ. բայց այդ բոլորը մարմնական ցանկութիւնները զսպելու համար ոչ մէկ արժէք չեն ներկայացնում։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct hy3 poems[] = {
	{1, "1 Եթէ յարութիւն առաք Քրիստոսի հետ, ապա փնտռեցէ՛ք վերին բաները, այնտեղ, ուր Քրիստոս նստած է Աստծու աջ կողմը։ "},
	{2, "2 Վերի՛ն բաների մասին խորհեցէք եւ ո՛չ թէ այն, որ այստեղ՝ երկրի վրայ է, "},
	{3, "3 քանզի մեռած էք, եւ ձեր կեանքը պահուած է Քրիստոսի հետ՝ Աստծու մօտ։ "},
	{4, "4 Իսկ երբ Քրիստոս՝ ձեր կեանքը, յայտնուի, այն ժամանակ դուք էլ նրա հետ կը յայտնուէք փառքով։ "},
	{5, "5 Սպանեցէ՛ք ուրեմն ձեր երկրաւոր ցանկութիւնները. դէ՛ն գցեցէք պոռնկութիւն, պղծութիւն, յոռի կրքեր, չար ցանկութիւն եւ ագահութիւն, որ կռապաշտութիւն է։ "},
	{6, "6 Դրա համար է, որ անհնազանդ որդիների վրայ գալիս է Աստծու բարկութիւնը։ "},
	{7, "7 Դուք էլ էիք մի ժամանակ ընթանում այդ մեղքերով, երբ ապրում էիք դրանց մէջ։ "},
	{8, "8 Այժմ դուք եւս թօթափեցէ՛ք այդ բոլորը՝ բարկութիւն, զայրոյթ, չարութիւն, հայհոյութիւն եւ խեղկատակութիւն՝ ձեր բերաններից։ "},
	{9, "9 Մի՛ ստէք միմեանց. հանեցէ՛ք ձեր վրայից հին մարդուն իր գործերով "},
	{10, "10 եւ հագէ՛ք նորը, այն, որ նորոգուած է գիտութեամբ, ըստ իր Արարչի պատկերի. "},
	{11, "11 այլեւս չկայ հրեայ, ոչ էլ հեթանոս, թլփատութիւն եւ անթլփատութիւն, բարբարոս, սկիւթացի, ծառայ, ազատ, այլ՝ Քրիստոս, որ ամէն ինչ է ամէն բանի մէջ։ "},
	{12, "12 Որպէս Աստծու ընտրեալներ, սրբեր եւ սիրելիներ, հագէ՛ք, ուրեմն, գութ, ողորմութիւն, քաղցրութիւն, խոնարհութիւն, հեզութիւն, համբերատարութիւն՝ "},
	{13, "13 հանդուրժելով միմեանց, ներելով միմեանց, եթէ մէկը միւսի դէմ գանգատ ունի. ինչպէս Աստուած Քրիստոսով ներեց ձեզ, նոյն ձեւով արէ՛ք եւ դուք։ "},
	{14, "14 Եւ այս բոլորի վրայ հագէ՛ք սէրը, որ կապն է կատարելութեան։ "},
	{15, "15 Եւ ձեր սրտերում թող հաստատուի Քրիստոսի խաղաղութիւնը, որին եւ կոչուեցիք մէկ մարմնով. եւ գոհութի՛ւն մատուցեցէք։ "},
	{16, "16 Թող Քրիստոսի խօսքը բնակուի ձեր մէջ առատապէս, որ կատարեալ իմաստութեամբ ուսուցանէք եւ խրատէք միմեանց՝ սաղմոսներով, օրհներգութիւններով, հոգեւոր երգերով եւ երախտագիտութեամբ օրհնելով ձեր սրտերում Աստծուն։ "},
	{17, "17 Եւ ինչ որ անէք խօսքով եւ գործով, բոլորն արէ՛ք Տէր Յիսուսի անունով. գոհութի՛ւն մատուցեցէք նրանով Աստծուն եւ Հօրը։ "},
	{18, "18 Կանա՛յք, հնազա՛նդ եղէք ձեր մարդկանց, ինչպէս որ վայել է ի Տէր։ "},
	{19, "19 Մարդի՛կ, սիրեցէ՛ք ձեր կանանց եւ մի՛ դառնացրէք նրանց։ "},
	{20, "20 Որդինե՛ր, ամէն ինչում հնազա՛նդ եղէք ձեր ծնողներին, որովհետեւ հաճելին այդ է Տիրոջ առաջ։ "},
	{21, "21 Հայրե՛ր, մի՛ զայրացրէք ձեր որդիներին, որ չյուսալքուեն։ "},
	{22, "22 Ծառանե՛ր, ամէն ինչում հնազա՛նդ եղէք ձեր մարմնաւոր տէրերին, ոչ թէ մարդահաճոյ կերպով, ցուցադրական ծառայութեամբ, այլ սրտի անկեղծութեամբ՝ երկիւղ կրելով Տիրոջից։ "},
	{23, "23 Ինչ որ անէք, արէք սրտա՛նց, որպէս թէ Տիրոջ համար էք անում եւ ոչ թէ՝ մարդկանց համար։ "},
	{24, "24 Իմացէ՛ք, որ Տիրոջից պիտի ստանաք ձեր ժառանգութեան հատուցումը, քանզի Տէր Քրիստոսին էք ծառայում։ "},
	{25, "25 Իսկ անիրաւը պիտի պատժուի ըստ իր անիրաւութեան, քանի որ Աստծու առաջ աչառութիւն չկայ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct hy4 poems[] = {
	{1, "1 Տէրե՛ր, ծառաների հետ վարուեցէ՛ք ուղղամտութեամբ եւ արդարութեամբ. իմացէ՛ք, որ դուք էլ Տէր ունէք երկնքում։ "},
	{2, "2 Յաճա՛խ աղօթեցէք՝ աղօթքի մէջ արթուն մնալով գոհութեամբ։ "},
	{3, "3 Միաժամանակ աղօթեցէք եւ մե՛զ համար, որպէսզի Աստուած բացի մեր առաջ խօսքի դուռը՝ յայտնելու խորհուրդը Քրիստոսի, որի համար էլ կապանքների մէջ եմ, "},
	{4, "4 որպէսզի յայտնի դարձնեմ նրան՝ խօսելով այնպէս, ինչպէս որ պէտք է խօսեմ։ "},
	{5, "5 Իմաստութեա՛մբ վարուեցէք դրսեցիների հետ՝ օգտագործելով ժամանակը։ "},
	{6, "6 Եւ ձեր խօսքը թող լինի միշտ լի Տիրոջ շնորհով, որպէս թէ աղով համեմուած լինի, որպէսզի դուք իմանաք, թէ ինչպէ՛ս պէտք է պատասխան տաք իւրաքանչիւրին։ "},
	{7, "7 Իսկ ինչ վերաբերում է ինձ, այդ բոլորի մասին ձեզ կը պատմի Տիւքիկոսը՝ սիրելի եղբայրը եւ հաւատարիմ պաշտօնեան եւ իմ ծառայակիցը ի Տէր. "},
	{8, "8 նրան ձեզ մօտ ուղարկեցի այդ բանի համար, որպէսզի իմանաք մեր մասին, եւ նա մխիթարի ձեր սրտերը. "},
	{9, "9 նրան ուղարկեցի հաւատարիմ եւ սիրելի եղբօր՝ Օնեսիմոսի հետ միասին, որ ձեզնից է։ Նրանք ձեզ կը պատմեն ամէն բան, որ կատարւում է այստեղ։ "},
	{10, "10 Ձեզ ողջունում է Արիստարքոսը՝ իմ բանտակիցը, ինչպէս նաեւ Բառնաբասի եղբօրորդի Մարկոսը (որի մասին հրահանգ ունէք, որ, եթէ ձեզ մօտ գայ, ընդունէք նրան). "},
	{11, "11 ողջունում է նաեւ Յիսուսը՝ Յուստոս կոչուածը. սրանք թլփատուածներից են. սրա՛նք միայն գործակից եղան ինձ Աստծու արքայութեան համար եւ նոյնիսկ մխիթարութիւն եղան ինձ համար։ "},
	{12, "12 Ողջունում է ձեզ Եպափրասը՝ ձեզնից մէկը. Քրիստոս Յիսուսի այս ծառան միշտ տքնաջան աղօթում է ձեզ համար, որպէսզի մնաք կատարեալ եւ գործադրէք Աստծու կամքը ամէն բանի մէջ։ "},
	{13, "13 Վկայում եմ նրա մասին, որ շատ հոգածութիւն ունի ձեր եւ լաւոդիկեցիների համար եւ բոլոր նրանց համար, որ Երապոսլում են։ "},
	{14, "14 Ողջունում է ձեզ Ղուկասը՝ բժիշկը եւ սիրելին, ինչպէս նաեւ Դեմասը։ "},
	{15, "15 Ողջունեցէ՛ք այն եղբայրներին, որ գտնւում են Լաւոդիկիայում. եւ Նիմփային ու նրա տնական եկեղեցուն։ "},
	{16, "16 Եւ երբ այս թուղթն ընթերցուի ձեզ մօտ, այնպէս արէք, որ լաւոդիկեցիների եկեղեցում էլ ընթերցուի. եւ լաւոդիկեցիներին ուղարկուած թուղթն էլ դո՛ւք ընթերցեցէք։ "},
	{17, "17 Եւ ասացէ՛ք Արքիպպոսին. Զգո՛յշ եղիր այն սպասաւորութեան համար, որ ընդունեցիր Տիրոջով, որպէսզի այն կատարես։ "},
	{18, "18 Այս ողջոյնը իմ՝ Պօղոսիս ձեռքով է։ Իմ կապանքները պահեցէ՛ք ձեր մտքում։ Շնո՜րհ՝ ձեզ հետ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};