#include <map>
#include <string>
class Bible59
{
	struct hy1	{ int val; const char *msg; };
	struct hy2	{ int val; const char *msg; };
	struct hy3	{ int val; const char *msg; };
	struct hy4	{ int val; const char *msg; };
	struct hy5	{ int val; const char *msg; };
public:
static void view1() {
struct hy1 poems[] = {
	{1, "1 Յակոբոսը՝ Աստծու եւ Տէր Յիսուս Քրիստոսի ծառան, սփիւռքում եղող տասներկու ցեղերիդ՝ ողջո՜յն։ "},
	{2, "2 Եղբայրնե՛ր, ամենայն ուրախութեան արժանի՛ համարեցէք, երբ տեսակ-տեսակ փորձութիւնների մէջ ընկնէք. "},
	{3, "3 իմացէ՛ք, որ ձեր հաւատի փորձը համբերութիւն է առաջ բերում, "},
	{4, "4 իսկ համբերութիւնը թող դրսեւորուի լիութեամբ, որպէսզի անթերի եւ կատարեալ լինէք, ոչ մի բանով պակաս չլինէք։ "},
	{5, "5 Իսկ եթէ ձեզնից մէկը իմաստութեամբ թերի լինի, թող խնդրի Աստծուն, - որ բոլորին այն տալիս է առատապէս եւ չի յանդիմանում, - եւ նրան կը տրուի։ "},
	{6, "6 Միայն թէ նա հաւատո՛վ թող խնդրի եւ թող չերկմտի, որովհետեւ, ով երկմիտ է, նման է ծովի հողմակոծ եւ տարուբերուող ալիքներին։ "},
	{7, "7 Այդպիսի մարդը թող չակնկալի Աստծուց որեւէ բան ստանալ, "},
	{8, "8 քանի որ երկմիտ մարդը իր արած բոլոր քայլերում անհաստատ է։ "},
	{9, "9 Աղքատ եղբայրը թող պարծենայ, երբ Աստուած բարձրացնում է իրեն, "},
	{10, "10 իսկ հարուստը թող պարծենայ, երբ Աստուած խոնարհեցնում է իրեն, քանի որ հարստութիւնը պիտի անցնի ինչպէս խոտածաղիկը. "},
	{11, "11 որովհետեւ արեւը ծագեց՝ խորշակով հանդերձ եւ չորացրեց խոտը, նրա ծաղիկն ընկաւ, ու նրա վայելուչ տեսքը կորաւ. նոյնպէս եւ հարուստը պիտի թառամի՝ իր շահերով հանդերձ։ "},
	{12, "12 Երանելի է այն մարդը, որ համբերում է փորձութեան. որովհետեւ, եթէ փորձութեան մէջ հաստատ լինի, կը ստանայ կեանքի պսակը, որը Տէրը խոստացաւ իրեն սիրողներին։ "},
	{13, "13 Ոչ ոք, երբ փորձութեան մէջ լինի, թող չասի. Աստծուց եմ փորձւում, քանի որ Աստուած չարից չի փորձւում եւ ինքն էլ չի փորձում ոչ ոքի։ "},
	{14, "14 Իւրաքանչիւր ոք փորձւում է՝ հրապուրուելով եւ խաբուելով իր ցանկութիւններից։ "},
	{15, "15 Այնուհետեւ ցանկութիւնը, յղանալով, մեղք է ծնում, եւ մեղքը, հասունանալով, մահ է ծնում։ "},
	{16, "16 Իմ սիրելի՛ եղբայրներ, մի՛ խաբուէք, "},
	{17, "17 քանի որ ամէն բարի շնորհ եւ ամէն կատարեալ պարգեւ վերեւից է՝ իջած լոյսի Հօրից, որի մէջ չկայ փոփոխում կամ էլ փոփոխման ստուեր։ "},
	{18, "18 Նա իր կամքով ծնեց մեզ ճշմարտութեան խօսքով, որպէսզի մենք լինենք իր ստեղծածների պտուղը։ "},
	{19, "19 Իմ սիրելի՛ եղբայրներ, իմացէ՛ք այս բանը. թող ամէն մարդ արագ լինի լսելու մէջ, ծանր՝ խօսելու մէջ եւ ծանր՝ բարկանալու մէջ. "},
	{20, "20 որովհետեւ մարդու բարկութիւնը Աստծու արդարութիւնը չի կատարում։ "},
	{21, "21 Ահա թէ ինչու, դէ՛ն գցելով ամենայն աղտեղութիւն եւ չարիքի աւելցուկ, հեզութեա՛մբ ընդունեցէք ձեր մէջ սերմանուած խօսքը, որ կարող է փրկել ձեր հոգիները։ "},
	{22, "22 Խօսքը կատարողնե՛ր եղէք եւ ոչ թէ միայն այն լսողներ համարեցէք դուք ձեզ. "},
	{23, "23 քանի որ, եթէ մէկը միայն լսող լինի խօսքը եւ ոչ կատարող, նա նման է մի մարդու, որ ակնապիշ դիտում է հայելու մէջ իր բնական դէմքը։ "},
	{24, "24 Նայելով՝ տեսնում է ինքն իրեն, անցնում գնում է եւ անմիջապէս մոռանում, թէ ինչպիսին էր ինքը։ "},
	{25, "25 Իսկ ով աչքերը յառած նայում է ազատութեան կատարեալ օրէնքին եւ դրա մէջ էլ յարատեւում, նա լսում է, չի մոռանում, այլ այն կատարում է. այդպիսի մէկը իր արածի մէջ երանութիւն կը գտնի։ "},
	{26, "26 Եթէ մէկն ուզում է բարեպաշտ լինել եւ չի սանձահարում իր լեզուն, այլ զբաղեցնում է իր սիրտը, այդպիսի մէկի համար զուր է բարեպաշտութիւնը։ "},
	{27, "27 Սուրբ եւ անարատ բարեպաշտութիւնը Աստծու եւ Հօր առաջ այս է. այցելել որբերին եւ այրիներին իրենց նեղութեան մէջ, անարատ պահել իր անձը աշխարհից։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct hy2 poems[] = {
	{1, "1 Եղբայրնե՛ր իմ, աչառութեամբ մի՛ պահէք մեր Տէր Յիսուս Քրիստոսի՝ փառքի Տիրոջ հաւատը։ "},
	{2, "2 Եթէ ձեր ժողովատեղին մտնի մի մարդ, որ ունենայ ոսկի մատանի եւ շքեղ զգեստներ, եւ այնտեղ մտնի նաեւ մի աղքատ՝ կեղտոտ զգեստներով, "},
	{3, "3 եւ դուք նայէք նրան, ով շքեղ զգեստներ ունի եւ ասէք՝ Դու նստի՛ր այստեղ, պատուոյ տեղը, իսկ աղքատին, թէ՝ Ոտքի՛ կանգնիր դու այդտեղ, կամ թէ՝ Եկ նստի՛ր իմ պատուանդանի մօտ, "},
	{4, "4 այդ դէպքում դուք ձեր մէջ աչառութիւն արած չէ՞ք լինի եւ չար խորհուրդների դատաւորներ չէ՞ք լինի։ "},
	{5, "5 Լսեցէ՛ք ինձ, իմ սիրելի՛ եղբայրներ, չէ՞ որ Աստուած ընտրեց այս աշխարհի աղքատներին, որոնք հարուստ են հաւատով եւ ժառանգորդներ այն արքայութեան, որը նա խոստացաւ իրեն սիրողներին։ "},
	{6, "6 Իսկ դուք անարգում էք աղքատներին։ Հարուստները չե՞ն, որ հարստահարում են ձեզ. հէնց նրանք էլ ձեզ դատարան են քարշ տալիս։ "},
	{7, "7 Նրանք չե՞ն, որ հայհոյում են այն բարի անունը, որով կոչուած էք դուք։ "},
	{8, "8 Ապա եթէ կատարէք արքայական օրէնքը Սուրբ Գրքի համաձայն, թէ՝ Պիտի սիրես քո ընկերոջը, ինչպէս ինքդ քեզ, լաւ էք անում։ "},
	{9, "9 Իսկ եթէ աչառութիւն էք անում, մեղք էք գործում՝ դատապարտուելով օրէնքից որպէս օրինազանցներ։ "},
	{10, "10 Նա, ով պահում է ամբողջ օրէնքը եւ միայն մէկ բանով սայթաքում, պարտապան կը լինի ամբողջ օրէնքին. "},
	{11, "11 որովհետեւ նա, ով ասաց, թէ՝ Չպիտի սպանես, նաեւ ասաց, թէ՝ Եւ չպիտի շնանաս, քանզի, եթէ չսպանես, բայց շնանաս, յանցաւոր կը լինես օրէնքի առաջ։ "},
	{12, "12 Այնպէ՛ս խօսեցէք եւ այնպէ՛ս գործեցէք, որպէս թէ ազատութեան օրէնքով էք դատուելու, "},
	{13, "13 քանի որ անողորմ դատաստան է լինելու նրա հանդէպ, ով ողորմած չի եղել. քանզի ողորմածութիւնը բարձրագլուխ պարծենում է դատաստանի դիմաց։ "},
	{14, "14 Եղբայրնե՛ր իմ, օգուտն ի՞նչ է, եթէ մէկն ասի, թէ հաւատ ունի, սակայն հաւատն արտայայտող գործեր չունենայ։ Միթէ հաւատը նրան կը կարողանա՞յ փրկել։ "},
	{15, "15 Եթէ մի եղբայր կամ քոյր մերկ լինեն կամ օրուայ ուտելիքի կարօտ, "},
	{16, "16 եւ ձեզնից մէկը նրանց ասի՝ Գնացէ՛ք խաղաղութեամբ, տաքացէ՛ք եւ յագեցէ՛ք, եւ դուք նրանց չտաք մարմնին անհրաժեշտ բաները, ի՞նչ օգուտ է։ "},
	{17, "17 Նոյնպէս եւ հաւատը. եթէ նա գործեր չունի, առանձինն մեռած է։ "},
	{18, "18 Բայց թերեւս մէկն ասի. Դու հաւատ ունես, իսկ ես՝ գործեր. ցո՛յց տուր ինձ քո հաւատը առանց գործերի, եւ ես քեզ ցոյց կը տամ իմ հաւատը գործերով։ "},
	{19, "19 Դու հաւատում ես, որ մէկ է Աստուած. լաւ ես անում։ Դեւերն էլ են հաւատում եւ դողում։ "},
	{20, "20 Ո՛վ փուչ մարդ, ուզո՞ւմ ես իմանալ. հաւատը դատարկ բան է առանց գործերի։ "},
	{21, "21 Աբրահամը՝ մեր հայրը, չէ՞ որ գործերով արդարացաւ՝ սեղանի վրայ հանելով իր որդուն՝ Իսահակին, որպէս զոհ։ "},
	{22, "22 Տեսնո՞ւմ ես, որ հաւատը գործակից եղաւ նրա գործերին եւ գործերով էլ հաւատը կատարեալ դարձաւ։ "},
	{23, "23 Եւ կատարուեց Գրուածը, որն ասում է. Աբրահամը հաւատաց Աստծուն, եւ այդ նրան որպէս արդարութիւն համարուեց, եւ նա Աստծուն բարեկամ կոչուեց։ "},
	{24, "24 Տեսնո՞ւմ էք, որ գործերով է արդարանում մարդ եւ ոչ թէ միայն հաւատով։ "},
	{25, "25 Այդպէս էլ պոռնիկ Ռախաբը գործերով չարդարացա՞ւ, երբ ընդունեց լրտեսներին եւ արձակեց նրանց այլ ճանապարհով։ "},
	{26, "26 Ինչպէս որ մեռած է մարմինը առանց հոգու, այնպէս էլ մեռած է հաւատը առանց գործերի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct hy3 poems[] = {
	{1, "1 Եղբայրնե՛ր իմ, շատերդ ուսուցանողներ լինելու չձգտէք։ Իմացէ՛ք, որ մեծ դատաստան ենք ընդունելու, "},
	{2, "2 քանի որ բոլորս էլ շատ ենք մեղանչում։ Եթէ մէկը խօսքով չի մեղանչում, նա կատարեալ մարդ է՝ ընդունակ սանձահարելու իր ամբողջ մարմինը։ "},
	{3, "3 Տե՛ս, թէ ինչպէս սանձեր ենք դնում ձիերի բերանը, որ նրանք մեզ հնազանդուեն. եւ նրանց ամբողջ մարմինը կառավարում ենք։ "},
	{4, "4 Ահա՛ւասիկ եւ նաւերը. ի՜նչ հսկայ բաներ են, սաստիկ հողմերից քշւում են, բայց փոքր մի ղեկով ուղղւում են ո՛ր կողմը որ նաւավարի սիրտն ուզում է։ "},
	{5, "5 Այսպէս էլ լեզուն մի փոքր անդամ է, բայց մեծամեծ բաներ է բարբառում։ Ահա թէ մի փոքր կրակ ինչպիսի՜ անտառներ է հրդեհում։ "},
	{6, "6 Լեզուն էլ կրակ է, մի աշխարհ անիրաւութեան. մեր անդամների մէջ է հաստատուած լեզուն, որ ապականում է ամբողջ մարմինը եւ կրակով վառում մեր ամբողջ կեանքը, բորբոքուած գեհենի կրակով։ "},
	{7, "7 Գազանների, թռչունների եւ սողունների ամէն տեսակ եւ ինչ որ կայ ծովի մէջ, հնազանդուած է եւ հնազանդւում է մարդկային բնութեանը, "},
	{8, "8 բայց մարդկանց լեզուն՝ այդ չարը, անզսպելին եւ մահաբեր թոյնով լցուածը, ոչ ոք չի կարող հնազանդեցնել։ "},
	{9, "9 Նրանով օրհնում ենք Տիրոջը եւ Հօրը եւ նրանով անիծում ենք մարդկանց, որ ստեղծուեցին Աստծու նմանութեամբ։ "},
	{10, "10 Նոյն բերանից դուրս են գալիս օրհնութիւններ եւ անէծքներ։ Եղբայրնե՛ր իմ, պէտք չէ, որ այդ այդպէս լինի։ "},
	{11, "11 Միթէ մի աղբիւր նոյն ակից քաղցր եւ դառն ջուր կը բխեցնի՞։ "},
	{12, "12 Եղբայրնե՛ր իմ, միթէ կարելի՞ է, որ թզենին ձիթապտուղ տայ կամ որթատունկը՝ թուզ։ Նմանապէս աղուտ տեղից քաղցր ջուր չի կարելի ստանալ։ "},
	{13, "13 Ձեր մէջ ո՞վ է իմաստուն եւ խելացի. թող նա, բարի ընթացքով, ցոյց տայ իմաստութեամբ եւ հեզութեամբ կատարած իր գործերը։ "},
	{14, "14 Իսկ եթէ ձեր սրտերում դառն նախանձ եւ հակառակութիւն ունէք, մի՛ պարծեցէք, որ սուտ էք հանում ճշմարտութիւնը։ "},
	{15, "15 Այս իմաստութիւնը ի վերուստ չէ իջած, այլ՝ երկրաւոր է, մարմնաւոր եւ դիւային. "},
	{16, "16 որովհետեւ, ուր հակառակութիւն եւ նախանձ կայ, այնտեղ կայ անկարգութիւն եւ ամէն չար բան։ "},
	{17, "17 Իսկ վերին իմաստութիւնը նախ՝ սուրբ է եւ ապա՝ խաղաղարար, հեզ, բարեացակամ, լի ողորմածութեամբ եւ բարի գործերով, մաքուր խղճմտանքով, առանց կեղծաւորութեան։ "},
	{18, "18 Արդարութեան պտուղը խաղաղութեամբ է սերմանւում նրանց համար, ովքեր խաղաղութիւն են անում։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct hy4 poems[] = {
	{1, "1 Այդ որտեղի՞ց պատերազմներ եւ որտեղի՞ց կռիւներ ձեր մէջ. չէ՞ որ ձեր այն ցանկութիւններից, որոնք կռիւ են մղում ձեր անդամների մէջ։ "},
	{2, "2 Ցանկանում էք, բայց չունէք, ուստի եւ՝ սպանում էք, նախանձում եւ չէք կարողանում ձեռք բերել ձեր ուզածը. պայքարում էք, կռւում եւ ձեռք չէք բերում, որովհետեւ չէք խնդրում։ "},
	{3, "3 Խնդրում էք եւ չէք ստանում, որովհետեւ չարամտօրէն էք խնդրում, որպէսզի այն ծառայեցնէք ձեր ցանկութիւններին։ "},
	{4, "4 Շնացողնե՛ր, չգիտէ՞ք, որ սէրը այս աշխարհի հանդէպ՝ թշնամութիւն է Աստծու դէմ, քանի որ, ով ուզում է աշխարհը սիրել, Աստծուն իրեն թշնամի կ՚անի։ "},
	{5, "5 Կամ թէ՝ առ ոչինչ էք համարում, ինչ որ Գիրքն ասում է. "},
	{6, "6 Եւ այդ նրա համար, որ է՛լ աւելի շնորհ տայ. դրա համար ասում է. "},
	{7, "7 Հնազանդուեցէ՛ք ուրեմն Աստծուն եւ դիմադրեցէ՛ք Սատանային, ու նա կը փախչի ձեզանից։ "},
	{8, "8 Մօտեցէ՛ք Աստծուն, եւ նա կը մերձենայ ձեզ։ Մեղաւորնե՛ր, մաքրեցէ՛ք ձեր ձեռքերը. երկմիտնե՛ր, ուղղեցէ՛ք ձեր սրտերը. "},
	{9, "9 տառապեցէ՛ք, սգացէ՛ք եւ լացէ՛ք. ձեր ծիծաղը սուգի թող վերածուի, եւ ձեր ուրախութիւնը՝ տրտմութեան։ "},
	{10, "10 Խոնա՛րհ եղէք Տիրոջ առաջ, եւ նա ձեզ կը բարձրացնի։ "},
	{11, "11 Եղբայրնե՛ր, միմեանց մի՛ բամբասէ՛ք. ով բամբասում է իր եղբօրը կամ դատում է իր եղբօրը, չարախօսում է օրէնքի մասին եւ դատում է օրէնքը. իսկ եթէ օրէնքն ես դատում, օրէնքը պահող չես, այլ՝ դատաւոր։ "},
	{12, "12 Կայ մէ՛կ Օրէնսդիր եւ Դատաւոր, որ կարող է փրկել եւ կործանել. դու ո՞վ ես, որ դատում ես քո մերձաւորին։ "},
	{13, "13 Այժմ նրանց մասին, որ ասում են. Այսօր կամ վաղը կը գնանք այսինչ քաղաքը, մէկ տարի կը մնանք այնտեղ, կը վաճառենք եւ կը վաստակենք։ "},
	{14, "14 (Այսպէս էք ասում դուք, որ ոչինչ չգիտէք վաղուայ մասին. որովհետեւ ի՞նչ է ձեր կեանքը. յիրաւի մի մշուշ է այն, որ մի պահ երեւում է եւ ապա անհետանում)։ "},
	{15, "15 Մինչդեռ դուք ասելու էք. Եթէ Տէրը կամենայ, եւ ապրենք, կ՚անենք այս կամ այն բանը։ "},
	{16, "16 Բայց արդ, պարծենում էք ձեր ամբարտաւանութեամբ։ Այսպիսի ամէն պարծանք չար է։ "},
	{17, "17 Ով որ գիտէ, թէ ինչ է բարին, եւ չի անում, նրա համար այդ մեղք է։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct hy5 poems[] = {
	{1, "1 Ուրեմն այժմ, հարուստնե՛ր, լացէ՛ք եւ ողբացէ՛ք այն թշուառութիւնների համար, որ գալու են ձեր գլխին. "},
	{2, "2 որովհետեւ ձեր հարստութիւնը փտած է, ձեր զգեստները՝ ցեցի կեր, "},
	{3, "3 եւ ձեր արծաթն ու ոսկին՝ ժանգոտած. եւ նրանց ժանգը ձեր դէմ որպէս վկայութիւն պիտի լինի եւ պիտի ուտի ձեր մարմինը՝ ինչպէս կրակը. վերջին օրերի՛ համար գանձեր դիզեցէք։ "},
	{4, "4 Ահա՛ւասիկ, ձեր դաշտերը մշակած մշակների վարձը ձեզ մօտ պահեցիք. ձեր կողմից զրկուածն աղաղակում է, եւ հնձուորների բողոքը հասաւ Ամենակալ Տիրոջ ականջին։ "},
	{5, "5 Մեղկ կեանքով ապրեցիք երկրի վրայ եւ շուայտացաք ու ձեր սրտերը պարարտացրիք մորթուելու օրուայ համար։ "},
	{6, "6 Զրկեցիք, սպանեցիք արդարին, որը ձեզ չէր հակառակում։ "},
	{7, "7 Եղբայրնե՛ր իմ, համբերո՛ղ եղէք մինչեւ Տիրոջ գալուստը։ Մշակն ահա համբերութեամբ սպասում է երկրի պատուական պտղին, մինչեւ որ ստանայ առաջին եւ վերջին անձրեւը։ "},
	{8, "8 Համբերեցէ՛ք եւ դուք, ամրացրէ՛ք ձեր սրտերը, քանի որ Տիրոջ գալուստը մօտեցել է։ "},
	{9, "9 Մի՛ տրտմեցրէ՛ք միմեանց, եղբայրնե՛ր, որպէսզի չդատուէք։ Ահա՛ւասիկ դատաւորը դռանն է։ "},
	{10, "10 Եղբայրնե՛ր, չարչարանքների եւ համբերութեան որպէս օրինակ ունեցէք մարգարէներին, որոնք խօսեցին Տիրոջ անունով։ "},
	{11, "11 Ահա՛ երանի ենք տալիս համբերողներին։ Լսել էք Յոբի համբերութեան մասին եւ տեսել, ինչ որ Տէրը նրան արեց վերջում, քանի որ Տէրը բազմագութ է եւ ողորմած։ "},
	{12, "12 Ամէն բանից առաջ, եղբայրե՛ր իմ, մի՛ երդուէք ո՛չ երկնքով, ո՛չ երկրով, ո՛չ էլ այլ երդումով. այլ ձեր այոն թող լինի՝ այո, եւ ոչը՝ ոչ, որպէսզի կեղծաւորութեան պատճառով չընկնէք։ "},
	{13, "13 Ձեզնից մէկը վշտի՞ մէջ է ընկել, թող աղօթի. մէկը բերկրանքի՞ մէջ է, սաղմոս թող ասի. "},
	{14, "14 հիւա՞նդ է ձեզնից մէկը, թող կանչի եկեղեցու երէցներին, եւ նրանք նրա վրայ թող աղօթք անեն, թող իւղով օծեն նրան Տիրոջ անունով։ "},
	{15, "15 Եւ հաւատով եղած աղօթքը կը փրկի հիւանդին, ու Տէրը նրան ոտքի կը կանգնեցնի։ Եւ եթէ մեղք գործած լինի, այդ նրան պիտի ներուի։ "},
	{16, "16 Ձեր մեղքերը միմեանց խոստովանեցէ՛ք եւ միմեանց համար աղօ՛թք արէք, որպէսզի բժշկուէք. քանզի արդարի աղօթքը շատ ազդեցիկ է եւ օգնում է։ "},
	{17, "17 Եղիան մարդ էր մեզ նման՝ կրքերի ենթակայ. նա աղօթեց, ու երկրի վրայ երեք տարի ու վեց ամիս անձրեւ չտեղաց։ "},
	{18, "18 Ապա դարձեալ աղօթեց, եւ երկինքը անձրեւ տուեց, ու երկիրը բուսցրեց իր պտուղը։ "},
	{19, "19 Եղբայրնե՛ր իմ, եթէ ձեզնից մէկը շեղուի ճշմարտութեան ճանապարհից, իսկ մէկ ուրիշը նրան յետ բերի, "},
	{20, "20 թող իմանայ, որ, ով մեղաւորին իր մոլորութեան ճանապարհից յետ է բերում, կը փրկի նրա հոգին մահուանից եւ կը ծածկի մեղքերի մի ամբողջ բազմութիւն։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};