#include <map>
#include <string>
class Bible34
{
	struct hy1	{ int val; const char *msg; };
	struct hy2	{ int val; const char *msg; };
	struct hy3	{ int val; const char *msg; };
public:
static void view1() {
struct hy1 poems[] = {
	{1, "1 Պատգամ Նինուէին։ Նաւում Ելկեսացու տեսիլքի գիրքը։ "},
	{2, "2 Տէր Աստուած նախանձոտ է եւ վրէժխնդիր, Տէրը վրէժխնդիր է բարկութեամբ, Տէրը վրէժ է լուծում իր հակառակորդներից, եւ ինքն է վերացնում իր թշնամիներին։ "},
	{3, "3 Համբերատար է Տէրը, մեծ է նրա զօրութիւնը,Տէրը ամենեւին չի արդարացնում մեղապարտին։ Նրա ճանապարհը հողմապտոյտով է եւ կործանումով. քամին նրա ձին է, ամպերը՝ նրա ոտքերի փոշին։ "},
	{4, "4 Սաստում է ծովը, ցամաքեցնում այն, չորացնում բոլոր գետերը։ Չորացան Բասանն ու Կարմելոսը, Լիբանանի բոլոր ծաղիկները թառամեցին։ "},
	{5, "5 Լեռները դողացին նրանից, բլուրները սասանուեցին, խախտուեց երկիրը նրա առաջ, ինչպէս նաեւ նրա բոլոր բնակիչները։ "},
	{6, "6 Նրա բարկութեանն ո՞վ կը դիմանայ, ո՞վ կը կանգնի նրա զայրոյթի եւ սրտմտութեան դէմ։ Նրա զայրոյթը հալեցնում է իշխանութիւնները, ժայռերը խորտակւում են նրա առաջ։ "},
	{7, "7 Բարեհաճ է Տէրը նրանց նկատմամբ, ովքեր ապաւինում են նրան նեղ օրերին. Նա ճանաչում է իրենից երկիւղ կրողներին։ "},
	{8, "8 Հեղեղով վերջ կը տայ իր դէմ ըմբոստացածներին,եւ խաւարը կը հալածի նրա թշնամիներին։ "},
	{9, "9 Ի՞նչ էք խորհում Տիրոջ դէմ. ինքն է վերջ տալու եւ կրկին անգամ վրէժ չի լուծի նեղութեան մէջ։ "},
	{10, "10 Մինչեւ իրենց հիմքերը նրանք խոպան պիտի դառնան. բաղեղով պատուածի պէս պիտի սպառուեն եւ լինեն ինչպէս չորացած եղէգ։ "},
	{11, "11 Քեզնի՛ց պիտի դուրս գայ Տիրոջ դէմ չար խորհուրդը՝ հակառակութեամբ չարիք խորհելու միտքը։ "},
	{12, "12 Այսպէս ասաց Տէրը բազում ջրերի իշխանների մասին. Այսպէս պիտի բաժանուեն նրանք, եւ քո մասին այլեւս լուր չի լսուելու։ "},
	{13, "13 Հիմա պիտի խորտակեմ քո գլխին կախուած նրա գաւազանը եւ քո կապանքները պիտի խզեմ։ "},
	{14, "14 Տէրը կը հրամայի քեզ համար, եւ այլեւս չի հռչակուի քո անունը. Պիտի ջնջեմ քանդակուած եւ ձուլածոյ կուռքերը քո աստծու տնից եւ այն գերեզման պիտի դարձնեմ քեզ համար։ "},
	{15, "15 Ահա արագընթաց են աւետաբերի ոտքերը լեռների վրայ, որ խաղաղութիւն է աւետում։ Տօնի՛ր քո տօնը, Յուդայի՛ երկիր, կատարի՛ր քո ուխտը, քանի որ այլեւս քո միջով չի անցնելու անօրէնը քեզ հիւծելու համար։ Նա վախճանուեց, մաշուեց ու վերացաւ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct hy2 poems[] = {
	{1, "1 Ելաւ նա, ով փչում է քո դէմքին եւ քեզ փրկում նեղութիւնից. հսկի՛ր ճանապարհը, պնդացրո՛ւ մէջքդ, զօրացի՛ր մեծ ուժով. "},
	{2, "2 քանզի Տէրը վերադարձրեց Յակոբի հպարտութիւնը Իսրայէլի հպարտութեան նման, քանի որ բոլորովին թօթափեցին նրանց եւ նրա ճիւղերը ապականեցին։ "},
	{3, "3 Նրա զօրեղ մարդկանց զէնքը հզօր մարդիկ են, որոնք խաղում էին կրակի հետ. նրանց կառքերի սանձերը կը փայլեն պատերազմի նախօրեակին. հեծեալները իրար կ՚անցնեն ճանապարհներին եւ հրապարակներում կը խառնուեն իրար։ "},
	{4, "4 Նրանց տեսքը կրակէ լամպերի նման է, եւ նրանք փայլակի պէս այս ու այն կողմ են գնում։ "},
	{5, "5 Նրա մեծամեծները կը յիշեն եւ ցերեկը կը փախչեն, կը տկարանան իրենց ճանապարհներին, կը շտապեն դէպի պարիսպները եւ կը պատրաստեն իրենց առաջապահներին։ "},
	{6, "6 Քաղաքների դռները բացուեցին, արքունիքները կործանուեցին, եւ նրանց հարստութիւնը յայտնի դարձաւ։ "},
	{7, "7 Ինքը ելնում էր, նաժիշտները գալիս էին նրա առաջ եւ, ինչպէս աղաւնիներ, հառաչում էին իրենց սրտերում։ "},
	{8, "8 Նինուէի ջրերը նման էին աւազանի ջրերի. նրանք փախան քեզնից եւ տեղ չբռնեցին։ "},
	{9, "9 Չկար մէկը, որ հսկէր.յափշտակում էին արծաթը, յափշտակում էին ոսկին, եւ նրա զարդեղէնին չափ չկար։ Ծանրացան աւելի քան նրա բոլոր ցանկալի սպասքները։ "},
	{10, "10 Սրտի սոսկում, թօթափում եւ ձգտում, ծնկների թուլացում, ցաւ ամէն մէջքի վրայ, եւ բոլորի երեսները սեւացան պուտուկի նման։ "},
	{11, "11 Ո՞ւր են առիւծների որջերն ու նրանց կորիւնների որսերը, ո՞ւր գնաց մտաւ առիւծը. չկար մէկը, որ վախեցնէր առիւծի կորիւնին։ "},
	{12, "12 Առիւծը բաւական որս արեց իր կորիւնների համար, որս խեղդեց իր կորիւնների համար, իր բոյնը լցրեց որսով եւ իր որջը՝ յափշտակուած բաներով։ "},
	{13, "13 Ահա ես քո դէմ եմ, - ասում է Ամենակալ Տէրը, - ծխով կ՚այրեմ քո զօրքերը, սուրը կ՚ուտի քո առիւծներին, երկրից կը վերացնեմ քո որսը, եւ այլեւս չեն լսուի քո գործերը։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct hy3 poems[] = {
	{1, "1 Ո՛վ արեան քաղաք, բոլորովին սուտ, անիրաւութեամբ լի, ուր որսը պէտք է փնտռուի։ "},
	{2, "2 Հարուածների ձայն, անուի շարժման ձայն, կառքերի շաչիւն, հեծեալների դոփիւն, "},
	{3, "3 զէնքի փայլ, սուսերի շող, վիրաւորների թաւալգլոր անկում, հաշիւ չկար նրա ժողովուրդներին։ Նրանք պիտի տկարանան իրենց մարմնով բազում պոռնկութեան պատճառով։ "},
	{4, "4 Գեղապանծ պոռնիկ, կախարդների գլխաւոր, որ վաճառում էր ազգը իր պոռնկութեամբ եւ տոհմերը՝ իր կախարդանքներով։ "},
	{5, "5 Ահա ես քեզ դէմ եմ, - ասում է Ամենակալ Տէր Աստուածը, - պիտի բացեմ քո յետնամասը, քօղ պիտի գցեմ քո դէմքին, ազգերին ցոյց պիտի տամ քո ամօթը եւ թագաւորութիւններին՝ քո անարգանքը։ "},
	{6, "6 Քեզ վրայ պիտի նետեմ քո պղծութիւններն ու աղտեղութիւնները եւ խայտառակ պիտի անեմ քեզ։ "},
	{7, "7 Եւ այնպէս պիտի լինի, որ ով տեսնի քեզ, պիտի իջնի եւ ասի. Խե՛ղճ Նինուէ, ո՞վ կը լինի, որ հեծեծի քեզ համար, որտեղի՞ց մխիթարութիւն փնտռենք քեզ համար։ "},
	{8, "8 Բաժի՛ն պատրաստիր, քնա՛ր լարիր, ո՛վ Ամոնի նահանգ, որ բնակւում ես գետերի միջեւ՝ ջրերով շրջապատուած, որի սկիզբը ծովն է, եւ ջրերը՝ նրա պարիսպը։ "},
	{9, "9 Եթովպացիներն ու Եգիպտոսը նրա զօրութիւնն են,եւ նա երբեք փախուստի չէր մատնուի. լիբիացիները նրան օգնական դարձան։ "},
	{10, "10 Սակայն նա էլ սասանուելով գերի կը գնայ, քարին կը խփեն նրա զաւակներին նրա ճանապարհների սկզբում, նրա բոլոր թանկարժէք իրերի վրայ վիճակ կը գցեն եւ նրա բոլոր մեծամեծները ձեռնակապերով կը կապուեն։ "},
	{11, "11 Եւ դու կը հարբես, կը յիմարանաս, թշնամիներից քեզ համար ոտքի տեղ կը խնդրես։ "},
	{12, "12 Քո բոլոր ամրոցները նման են ծառի վրայ երեւացող թզի, որ եթէ շարժուի, կ՚ընկնի ուտողների բերանը։ "},
	{13, "13 Ահա քո ժողովուրդը կանանց նման կը լինի քո մէջ, քո թշնամիների համար անպայման կը բացուեն քո երկրի դռները, եւ կրակը կը լափի քո նիգերը։ "},
	{14, "14 Պաշարման համար ջո՛ւր լցրու եւ ամրացրո՛ւ քո ամրոցները. մտի՛ր ցեխի մէջ, կոխոտի՛ր, շաղախի՛ր այն յարդի հետ եւ պնդացրո՛ւ աւելի քան աղիւսը։ "},
	{15, "15 Այնտեղ կրակը կը լափի քեզ, սուրը կը սպանի քեզ, կ՚ուտի քեզ ինչպէս մորեխը եւ կը ծանրանայ ինչպէս ջորեակը։ "},
	{16, "16 Շատացրիր քո վաճառելիքը երկնքի աստղերի չափ, եկաւ ջորեակը, թռաւ, "},
	{17, "17 առաջ գնաց ինչպէս փոքրիկ մորեխը.եւ քո խառնամբոխը նման էր մորեխի, որ ցուրտ օրերին կպչում է ցանկապատին. ծագեց արեւը, գնաց եւ չիմացուեց նրա տեղը։ "},
	{18, "18 Վա՜յ նրանց. քո հովիւները ննջեցին, Ասորեստանի թագաւորը կոտորեց քո զօրքերը, քո ժողովուրդը չուեց լեռները, չկար մէկը, որ մնար։ "},
	{19, "19 Թարախակալուեցին քո վէրքերը, եւ քո անկումը բուժում չունի. բոլոր նրանք, ովքեր լսեցին քո գոյժը, ծափ կը զարնեն քեզ համար, քանի որ ո՞ւմ վրայ չեկաւ քո չարութիւնը մշտապէս։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};