#include <map>
#include <string>
class Bible19
{
	struct hy1	{ int val; const char *msg; };
	struct hy2	{ int val; const char *msg; };
	struct hy3	{ int val; const char *msg; };
	struct hy4	{ int val; const char *msg; };
	struct hy5	{ int val; const char *msg; };
	struct hy6	{ int val; const char *msg; };
	struct hy7	{ int val; const char *msg; };
	struct hy8	{ int val; const char *msg; };
	struct hy9	{ int val; const char *msg; };
	struct hy10	{ int val; const char *msg; };
	struct hy11	{ int val; const char *msg; };
	struct hy12	{ int val; const char *msg; };
	struct hy13	{ int val; const char *msg; };
	struct hy14	{ int val; const char *msg; };
	struct hy15	{ int val; const char *msg; };
	struct hy16	{ int val; const char *msg; };
	struct hy17	{ int val; const char *msg; };
	struct hy18	{ int val; const char *msg; };
	struct hy19	{ int val; const char *msg; };
	struct hy20	{ int val; const char *msg; };
	struct hy21	{ int val; const char *msg; };
	struct hy22	{ int val; const char *msg; };
	struct hy23	{ int val; const char *msg; };
	struct hy24	{ int val; const char *msg; };
	struct hy25	{ int val; const char *msg; };
	struct hy26	{ int val; const char *msg; };
	struct hy27	{ int val; const char *msg; };
	struct hy28	{ int val; const char *msg; };
	struct hy29	{ int val; const char *msg; };
	struct hy30	{ int val; const char *msg; };
	struct hy31	{ int val; const char *msg; };
	struct hy32	{ int val; const char *msg; };
	struct hy33	{ int val; const char *msg; };
	struct hy34	{ int val; const char *msg; };
	struct hy35	{ int val; const char *msg; };
	struct hy36	{ int val; const char *msg; };
	struct hy37	{ int val; const char *msg; };
	struct hy38	{ int val; const char *msg; };
	struct hy39	{ int val; const char *msg; };
	struct hy40	{ int val; const char *msg; };
	struct hy41	{ int val; const char *msg; };
	struct hy42	{ int val; const char *msg; };
	struct hy43	{ int val; const char *msg; };
	struct hy44	{ int val; const char *msg; };
	struct hy45	{ int val; const char *msg; };
	struct hy46	{ int val; const char *msg; };
	struct hy47	{ int val; const char *msg; };
	struct hy48	{ int val; const char *msg; };
	struct hy49	{ int val; const char *msg; };
	struct hy50	{ int val; const char *msg; };
	struct hy51	{ int val; const char *msg; };
	struct hy52	{ int val; const char *msg; };
	struct hy53	{ int val; const char *msg; };
	struct hy54	{ int val; const char *msg; };
	struct hy55	{ int val; const char *msg; };
	struct hy56	{ int val; const char *msg; };
	struct hy57	{ int val; const char *msg; };
	struct hy58	{ int val; const char *msg; };
	struct hy59	{ int val; const char *msg; };
	struct hy60	{ int val; const char *msg; };
	struct hy61	{ int val; const char *msg; };
	struct hy62	{ int val; const char *msg; };
	struct hy63	{ int val; const char *msg; };
	struct hy64	{ int val; const char *msg; };
	struct hy65	{ int val; const char *msg; };
	struct hy66	{ int val; const char *msg; };
	struct hy67	{ int val; const char *msg; };
	struct hy68	{ int val; const char *msg; };
	struct hy69	{ int val; const char *msg; };
	struct hy70	{ int val; const char *msg; };
	struct hy71	{ int val; const char *msg; };
	struct hy72	{ int val; const char *msg; };
	struct hy73	{ int val; const char *msg; };
	struct hy74	{ int val; const char *msg; };
	struct hy75	{ int val; const char *msg; };
	struct hy76	{ int val; const char *msg; };
	struct hy77	{ int val; const char *msg; };
	struct hy78	{ int val; const char *msg; };
	struct hy79	{ int val; const char *msg; };
	struct hy80	{ int val; const char *msg; };
	struct hy81	{ int val; const char *msg; };
	struct hy82	{ int val; const char *msg; };
	struct hy83	{ int val; const char *msg; };
	struct hy84	{ int val; const char *msg; };
	struct hy85	{ int val; const char *msg; };
	struct hy86	{ int val; const char *msg; };
	struct hy87	{ int val; const char *msg; };
	struct hy88	{ int val; const char *msg; };
	struct hy89	{ int val; const char *msg; };
	struct hy90	{ int val; const char *msg; };
	struct hy91	{ int val; const char *msg; };
	struct hy92	{ int val; const char *msg; };
	struct hy93	{ int val; const char *msg; };
	struct hy94	{ int val; const char *msg; };
	struct hy95	{ int val; const char *msg; };
	struct hy96	{ int val; const char *msg; };
	struct hy97	{ int val; const char *msg; };
	struct hy98	{ int val; const char *msg; };
	struct hy99	{ int val; const char *msg; };
	struct hy100	{ int val; const char *msg; };
	struct hy101	{ int val; const char *msg; };
	struct hy102	{ int val; const char *msg; };
	struct hy103	{ int val; const char *msg; };
	struct hy104	{ int val; const char *msg; };
	struct hy105	{ int val; const char *msg; };
	struct hy106	{ int val; const char *msg; };
	struct hy107	{ int val; const char *msg; };
	struct hy108	{ int val; const char *msg; };
	struct hy109	{ int val; const char *msg; };
	struct hy110	{ int val; const char *msg; };
	struct hy111	{ int val; const char *msg; };
	struct hy112	{ int val; const char *msg; };
	struct hy113	{ int val; const char *msg; };
	struct hy114	{ int val; const char *msg; };
	struct hy115	{ int val; const char *msg; };
	struct hy116	{ int val; const char *msg; };
	struct hy117	{ int val; const char *msg; };
	struct hy118	{ int val; const char *msg; };
	struct hy119	{ int val; const char *msg; };
	struct hy120	{ int val; const char *msg; };
	struct hy121	{ int val; const char *msg; };
	struct hy122	{ int val; const char *msg; };
	struct hy123	{ int val; const char *msg; };
	struct hy124	{ int val; const char *msg; };
	struct hy125	{ int val; const char *msg; };
	struct hy126	{ int val; const char *msg; };
	struct hy127	{ int val; const char *msg; };
	struct hy128	{ int val; const char *msg; };
	struct hy129	{ int val; const char *msg; };
	struct hy130	{ int val; const char *msg; };
	struct hy131	{ int val; const char *msg; };
	struct hy132	{ int val; const char *msg; };
	struct hy133	{ int val; const char *msg; };
	struct hy134	{ int val; const char *msg; };
	struct hy135	{ int val; const char *msg; };
	struct hy136	{ int val; const char *msg; };
	struct hy137	{ int val; const char *msg; };
	struct hy138	{ int val; const char *msg; };
	struct hy139	{ int val; const char *msg; };
	struct hy140	{ int val; const char *msg; };
	struct hy141	{ int val; const char *msg; };
	struct hy142	{ int val; const char *msg; };
	struct hy143	{ int val; const char *msg; };
	struct hy144	{ int val; const char *msg; };
	struct hy145	{ int val; const char *msg; };
	struct hy146	{ int val; const char *msg; };
	struct hy147	{ int val; const char *msg; };
	struct hy148	{ int val; const char *msg; };
	struct hy149	{ int val; const char *msg; };
	struct hy150	{ int val; const char *msg; };
public:
static void view1() {
struct hy1 poems[] = {
	{1, "1 Երանելի է այն մարդը, որն ամբարիշտների խորհրդով չի շարժւում, մեղաւորների ճանապարհին ոտք չի դնում եւ յանցագործների հետ համախոհ չի լինում, "},
	{2, "2 այլ հաճոյք է ստանում Տիրոջ օրէնքներից եւ գիշեր-ցերեկ խորհում է Նրա պատուիրանների մասին։ "},
	{3, "3 Նա նման է ջրերի հոսանքի վրայ տնկուած ծառի, որն իր պտուղը ժամանակին կը տայ, իսկ նրա տերեւը չի թափուի, ու ամէն բան, ինչ էլ որ անի, կը յաջողուի նրան։ "},
	{4, "4 Այսպէս չեն ամբարիշտները, այսպէս չեն, այլ նման են հողմափոշու, որ հոսում է երկրի երեսին։ "},
	{5, "5 Ուստի ամբարիշտները չեն դիմանայ դատաստանին, ոչ էլ մեղաւորները կը լինեն արդարների հաւաքի մէջ, "},
	{6, "6 քանզի Տէրը գիտէ արդարների ճանապարհները, իսկ ամբարիշտների ճանապարհները կորստեան են տանում։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct hy2 poems[] = {
	{1, "1 Ինչո՞ւ խռովութիւն արեցին հեթանոսները, եւ ժողովուրդները դատարկ բաներ խորհեցին։ "},
	{2, "2 Հաւաքուեցին երկրի թագաւորները, եւ միաւորուեցին իշխաններն ընդդէմ Տիրոջ ու նրա օծեալի՝ ասելով. "},
	{3, "3 Քանդենք նրանց կապանքները եւ թօթափենք նրանց լուծը մեզանից։ "},
	{4, "4 Երկնքում բնակուողը կը ծիծաղի նրանց վրայ, եւ Տէրը կ՚արհամարհի նրանց։ "},
	{5, "5 Այնժամ կը խօսի նրանց հետ իր բարկութեամբ, եւ իր զայրոյթով կը սարսափեցնի նրանց։ "},
	{6, "6 Ես թագաւոր կարգուեցի նրանից իր սուրբ լերան՝ Սիոնի վրայ, որ հռչակեմ Տիրոջ հրամանները։ "},
	{7, "7 Տէրն ասաց ինձ. Դու իմ որդին ես, ես այսօր ծնեցի քեզ։ "},
	{8, "8 Խնդրի՛ր ինձնից՝ եւ հեթանոսներին քեզ կը տամորպէս ժառանգութիւն, ու իշխանութիւն՝ երկրի բոլոր ծագերում։ "},
	{9, "9 Նրանց կը հովուես երկաթեայ գաւազանով եւ բրուտի անօթի պէս կը փշրես նրանց։ "},
	{10, "10 Արդ, թագաւորնե՛ր, ո՛ւշ դարձրէք սրան, եւ խրատուեցէ՛ք ամէնքդ, որ մարդկանց էք դատում։ "},
	{11, "11 Ծառայեցէ՛ք Տիրոջը երկիւղով եւ ցնծացէ՛ք նրա առջեւ դողալով։ "},
	{12, "12 Ընդունեցէ՛ք նրա խրատը, որ Տէրը չբարկանայ, որ դուք չկորչէք արդարութեան ճանապարհից, երբ նրա զայրոյթը բորբոքուած լինի։ "},
	{13, "13 Երանի բոլոր նրանց, ովքեր յոյսը դրել են Տիրոջ վրայ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct hy3 poems[] = {
	{1, "1 Սաղմոս Դաւթի, երբ նա փախել էր իր որդու՝ Աբիսողոմի երեսից "},
	{2, "2 Տէ՛ր, ինչո՞ւ բազմացան ինձ հալածողները, եւ շատերը ելան իմ դէմ։ "},
	{3, "3 Շատերն էին ասում իմ մասին՝ Սա փրկութիւն չունի իր Աստծուց։ "},
	{4, "4 Բայց դու, Տէ՛ր, իմ օգնականն ես, իմ փառքը եւ գլուխս բարձր պահողը։ "},
	{5, "5 Իմ ձայնով ես Տիրոջը դիմեցի, եւ նա լսեց ինձ իր սուրբ լերան վրայից։ "},
	{6, "6 Ես ննջեցի ու քուն մտայ. զարթնեցի, եւ Տէրն իմ ապաւէնն է։ "},
	{7, "7 Չեմ սոսկայ ես նրանց բիւրաւոր զօրքերից, որոնք ամէն կողմից պատել ու պաշարել էին ինձ։ "},
	{8, "8 Արի՛, Տէ՛ր, փրկի՛ր ինձ, Աստուած իմ, քանզի կործանեցիր բոլորին, ովքեր իզուր թշնամացել էին ինձ հետ. դու մեղաւորների ատամները կը փշրես։ "},
	{9, "9 Տիրոջից է փրկութիւնը, Քո օրհնութիւնը ժողովրդիդ վրայ թող լինի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct hy4 poems[] = {
	{1, "1 Դպրապետին. Դաւթի օրհնութեան սաղմոսերգութիւնը "},
	{2, "2 Երբ ձայն տուի, իմ արդարութեան համար լսեցիր ինձ, Աստուա՛ծ, նեղութեան մէջ ինձ անդորր տուիր. ողորմի՛ր ինձ եւ ակա՛նջ դիր իմ աղօթքին։ "},
	{3, "3 Մարդկա՛նց որդիներ, մինչեւ ե՞րբ պիտի խստասիրտ լինէք. ինչո՞ւ էք ունայնութիւն սիրում եւ ստութիւն փնտռում։ "},
	{4, "4 Իմացէ՛ք, որ Տէրը զարմանահրաշ գործեր արեց իր սրբի համար, եւ Տէրը կը լսի ինձ, երբ օգնութեան կանչեմ նրան։ "},
	{5, "5 Եթէ բարկանաք՝ մի՛ մեղանչէք, ձեր անկողնու մէջ ինչ էլ որ ասէք ձեր սրտում՝ զղջացէ՛ք։ "},
	{6, "6 Արդարութեան զոհե՛ր մատուցեցէք եւ Տիրոջ վրայ յո՛յս դրէք։ "},
	{7, "7 Շատերն ասացին՝ Ո՞վ ցոյց կը տայ մեզ Տիրոջ բարութիւնը։ Քո երեսի լոյսը ծագեց մեր վրայ, "},
	{8, "8 եւ ուրախութիւն տուիր մեր սրտերին, ցորենի, գինու, ձէթի բարիքով յագեցրիր նրանց։ "},
	{9, "9 Այսուհետեւ մենք խաղաղութեամբ կը ննջենք ու կ՚արթնանանք, "},
	{10, "10 քանզի դու միայն, Տէ՛ր, ապահովութեան մէջ բնակեցրիր մեզ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct hy5 poems[] = {
	{1, "1 Դպրապետին. ժառանգորդների մասին, սաղմոս "},
	{2, "2 Ակա՛նջ դիր իմ խօսքերին, Տէ՛ր, եւ ո՛ւշ դարձրու աղաղակիս, "},
	{3, "3 ընդունի՛ր ձայնն աղօթքներիս, Թագաւո՛ր իմ եւ Աստուա՛ծ իմ։ "},
	{4, "4 Աղաչում եմ քեզ, Տէ՛ր, որ առաւօտեան լսես ձայնն իմ. առաւօտեան պատրաստ կը լինեմ քո առջեւ կանգնելու։ "},
	{5, "5 Դու անօրէնութիւն կամեցող Աստուած չես, եւ քեզ մօտ չարամիտներ չեն բնակւում։ "},
	{6, "6 Թող յանցագործները չապրեն աչքիդ առջեւ։ "},
	{7, "7 Դու ատեցիր անօրէնութիւն գործողներին, կործանում ես բոլոր ստախօսներին, արիւնահեղ ու նենգ մարդուց գարշում ես, Տէ՛ր։ "},
	{8, "8 Իսկ ես քո ամէնառատ ողորմութեան շնորհիւ կը մտնեմ տունդ, եւ քե՛զ վայել ակնածանքով կ՚երկրպագեմ սուրբ տաճարիդ մէջ։ "},
	{9, "9 Տէ՛ր, արդարութեամբ քո առաջնորդի՛ր ինձ, իմ թշնամիների պատճառով ուղղի՛ր իմ առջեւ ճանապարհները քո, "},
	{10, "10 քանզի նրանց բերանում ճշմարտութիւն չկայ, եւ նրանց սրտերն ունայնացած են։ "},
	{11, "11 Գերեզմանի պէս բաց են կոկորդները նրանց, իսկ լեզուները՝ լի նենգութեամբ։ Դատի՛ր նրանց, Աստուա՛ծ, որ ետ կանգնեն իրենց մտքերից. իրենց անչափ ամբարշտութեան համար վանի՛ր նրանց, քանզի դառնացրին քեզ։ "},
	{12, "12 Թող ուրախանան բոլոր նրանք, որ յոյս են դնում քեզ վրայ, յաւիտեան թող ցնծան, եւ դու ապրես նրանց մէջ. թող պարծենան քեզնով քո անունը սիրողները, "},
	{13, "13 քանզի դու պիտի օրհնես արդարին. Տէ՛ր, քո սպառազինութեամբ պաշտպանեցիր մեզ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct hy6 poems[] = {
	{1, "1 Դպրապետին. ութերորդական եղանակով, Դաւթի օրհնութեան սաղմոս "},
	{2, "2 Տէ՛ր, զայրոյթով քո մի՛ յանդիմանիր ինձ, եւ քո բարկութեամբ ինձ մի՛ խրատիր։ "},
	{3, "3 Ողորմի՛ր ինձ, Տէ՛ր, քանզի հիւանդ եմ ես, բժշկի՛ր ինձ, քանզի ոսկորներս խախտուել են։ "},
	{4, "4 Անձն իմ յոյժ խռոված է, եւ դու, Տէ՛ր, մինչեւ ե՞րբ...։ "},
	{5, "5 Դարձի՛ր, Տէ՛ր, փրկի՛ր ինձ, ազատի՛ր ինձ, Տէ՛ր, քո ողորմութեամբ "},
	{6, "6 քանզի չկայ մէկը, որ մահուան մէջ յիշի քեզ, կամ դժոխքում գոհանայ քեզանից։ "},
	{7, "7 Ես յոգնեցի իմ հառաչանքներից, ամէն գիշեր հեծեծանքով լուացի մահիճն իմ եւ իմ արտասուքով անկողինս թրջեցի։ "},
	{8, "8 Սրտնեղութիւնից այլայլուեց աչքն իմ, ես հիւծուեցի բոլոր թշնամիներիս ձեռքից։ "},
	{9, "9 Հեռացէ՛ք ինձնից ամէնքդ, որ անօրէնութիւն էք գործում։ "},
	{10, "10 Տէրը լսեց իմ լացի ձայնը, Տէրն ականջ դրեց իմ աղօթքներին, Տէրն ընդունեց իմ խնդրանքները։ "},
	{11, "11 Բոլոր թշնամիներս թող ամաչեն ու խիստ խռովուեն, թող ետ դառնան եւ իսկոյն խիստ ամաչեն ու զարհուրեն։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct hy7 poems[] = {
	{1, "1 Սաղմոս Դաւթի, որ Տիրոջն ասաց Յեմինի որդի Քուսի խօսքերի առթիւ "},
	{2, "2 Տէ՛ր իմ Աստուած, քեզ վրայ դրեցի յոյսն իմ, փրկի՛ր ինձ եւ իմ բոլոր հալածիչներից ազատի՛ր ինձ։ "},
	{3, "3 Չլինի թէ առիւծի նման յօշոտեն ինձ, եւ չգտնուի մէկը, որ փրկի ինձ եւ պահպանի։ "},
	{4, "4 Տէ՛ր իմ Աստուած, եթէ արել եմ այս բանը, եթէ իմ ձեռքով անօրէնութիւն եմ գործել, "},
	{5, "5 եթէ երբեւէ իմ չարակամներին չարութեամբ եմ հատուցել, թող ես էլ իսպառ կորչեմ թշնամիներիս ձեռքով։ "},
	{6, "6 Թող ուրեմն թշնամին հալածի ինձ, թող վրայ հասնի եւ խորտակի կեանքն իմ՝ կոխոտելով ինձ, իսկ փառքս հողին թող հաւասարեցնի։ "},
	{7, "7 Ելի՛ր, Տէ՛ր, բարկութեամբ քո եւ բարձրացի՛ր իսպառ վերացնելու իմ թշնամիներին։ Արթնացի՛ր, Տէ՛ր իմ Աստուած, յանուն քո սահմանուած կարգի։ "},
	{8, "8 Ժողովուրդների բազմութիւնները շուրջդ կը հաւաքուեն, իսկ դու, Տէ՛ր, բազմի՛ր բարձունքում "},
	{9, "9 (Տէրն է դատում իր ժողովրդին)։ Դատի՛ր ինձ, Տէ՛ր, իմ մէջ եղած արդարութեան եւ անմեղութեան համեմատ։ "},
	{10, "10 Մեղաւորների վրայ չարիք կը գայ, իսկ արդարին յաջողութիւն կը տաս, սրտերի ու երիկամների քննիչ արդա՛ր Աստուած։ "},
	{11, "11 Յիրաւի, օգնողն Աստուած է, որ փրկում է նրանց, ովքեր շիտակ են սրտով։ "},
	{12, "12 Արդար, հզօր եւ համբերատար դատաւոր է Աստուած, որն իր զայրոյթը չի թափում հանապազ։ "},
	{13, "13 Սակայն եթէ չդառնաք դէպի Նա, սուրն իր սրած է եւ աղեղն իր՝ լարած։ "},
	{14, "14 Նա պատրաստել է մահուան գործիքները, իսկ նետերն իր հրանիւթով է սարքել։ "},
	{15, "15 Ահաւասիկ, ով որ անօրէնութիւն երկնեց, չարիք յղացաւ եւ անիրաւութիւն ծնեց, "},
	{16, "16 նա փոս փորեց, խորացրեց, հէնց ինքն էլ ընկաւ այն փոսը, որ նա պատրաստեց։ "},
	{17, "17 Նրա գլխին կը թափուեն իր չարագործութիւնները, նրա գագաթին կ՚իջնեն իր անօրէնութիւնները։ "},
	{18, "18 Գոհութիւն կը մատուցեմ Տիրոջն իր արդարութեան համար, սաղմոս կ՚երգեմ Բարձրեալ Տիրոջ համար։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct hy8 poems[] = {
	{1, "1 Այսուհետեւ՝ հնձանների մասին, սաղմոս Դաւթի "},
	{2, "2 Տէ՛ր, ո՛վ մեր Տէր, ի՜նչ հրաշալի է քո անունը ողջ աշխարհում։ Քո փառքը բարձրացաւ երկնքից վեր։ "},
	{3, "3 Մանկահասակ եւ ծծկեր երեխաների բերանից թող օրհնութիւն ելնի ընդդէմ քո թշնամիների, Տէ՛ր, որպէսզի ոսոխն ու հակառակորդը կործանուեն։ "},
	{4, "4 Տեսնեմ երկինքը՝ քո մատների գործը, լուսինն ու աստղերը, որոնք դու հաստատեցիր։ "},
	{5, "5 Մարդն ի՞նչ է, որ յիշում ես նրան, կամ մարդու որդին՝ որ այցի գաս նրան։ "},
	{6, "6 Քո հրեշտակներից փոքր-ինչ ցածր դրիր նրան եւ փառք ու պատուով պսակեցիր նրան։ "},
	{7, "7 Նրան կարգեցիր քո բոլոր ձեռակերտների վրայ։ "},
	{8, "8 Ամէն ինչ դրիր նրա ոտքերի ներքոյ՝ ոչխար, արջառ եւ ամէն ինչ, "},
	{9, "9 նաեւ վայրի երէ, երկնքի թռչուններ, ծովի ձկներ, որ շրջում են ծովերի հոսանքներում։ "},
	{10, "10 Տէ՛ր, ո՛վ մեր Տէր, ի՜նչ հրաշալի է քո անունը ողջ աշխարհում։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct hy9 poems[] = {
	{1, "1 Այսուհետեւ՝ որդու գաղտնիքների մասին, սաղմոս Դաւթի "},
	{2, "2 Իմ ամբողջ սրտով գոհութիւն կը մատուցեմ քեզ, Տէ՛ր, կը պատմեմ բոլոր հրաշագործութիւններդ։ "},
	{3, "3 Կ՚ուրախանամ ու կը ցնծամ քեզնով, սաղմոս կ՚երգեմ քո անուանը, ո՛վ Բարձրեալ։ "},
	{4, "4 Թշնամիներս ետ դառնալով՝ կը թուլանան ու կը կորչեն քո առաջից։ "},
	{5, "5 Դատաստանս եւ իրաւունքս դու տեսար, բազմեցիր աթոռին, ո՛վ դատաւոր արդար։ "},
	{6, "6 Սաստեցիր հեթանոսներին, եւ ամբարիշտն անհետացաւ. նրանց անունները ջնջեցիր յաւիտեանս յաւիտենից։ "},
	{7, "7 Եւ թշնամու զէնքը իսպառ վերացաւ. դու քաղաքներ աւերեցիր, եւ յիշատակը դրանց կորաւ աղաղակով։ "},
	{8, "8 Բայց Աստուած մնում է յաւիտեան, նա պատրաստեց իր աթոռը դատաստանի համար։ "},
	{9, "9 Ինքն է դատում աշխարհն այս արդարութեամբ, եւ իր ժողովրդին՝ ուղղամտութեամբ։ "},
	{10, "10 Տէրն եղաւ տնանկի ապաւէնը եւ նեղութեան ժամանակ օգնականը։ "},
	{11, "11 Քեզ վրայ թող յոյս դնեն բոլոր նրանք, ովքեր գիտեն անունը քո, քանզի դու չես լքի նրանց, ովքեր փնտռում են քեզ, Տէ՛ր։ "},
	{12, "12 Սաղմո՛ս երգեցէք Տիրոջը, որ բնակւում է Սիոնում. հեթանոսների մէջ պատմեցէ՛ք գործերը նրա։ "},
	{13, "13 Տնանկների արեան համար վրէժխնդիր լինելիս՝ Տէրը յիշեց եւ չմոռացաւ աղօթքը նրանց։ "},
	{14, "14 Ողորմի՛ր ինձ, Տէ՛ր, եւ տե՛ս իմ նուաստացումն իմ թշնամիներից։ "},
	{15, "15 Դու բարձրացրիր ինձ մահուան դռներից, որ պատմեմ քո բոլոր օրհներգութիւնները Սիոնի քաղաքի դռներին, եւ ցնծամ քո փրկագործութեամբ։ "},
	{16, "16 Հեթանոսներն ընկղմուեցին իրենց գործած ապականութեան մէջ, եւ իրենց լարած թակարդն իրենց իսկ ոտքերն է բռնելու։ "},
	{17, "17 Տէրն իրեն ճանաչեցրեց դատաստան անելով, եւ մեղաւորները կը պատժուեն ըստ իրենց ձեռքի գործերի։ "},
	{18, "18 Մեղաւորները կրկին դժոխք կ՚ընկնեն, նաեւ բոլոր հեթանոսները, որոնք մոռացան Աստծուն։ "},
	{19, "19 Տէրն ամենեւին չի մոռանայ աղքատին, եւ տնանկների համբերութիւնը երբեք չի սպառուի։ "},
	{20, "20 Ելի՛ր, Տէ՛ր, եւ թող մարդը չզօրանայ, թող հեթանոսները դատուեն քո առջեւ։ "},
	{21, "21 Նրանց վրայ օրէնսդի՛ր կարգիր, Տէ՛ր, եւ թող հեթանոսներն իմանան, թէ իրենք մարդիկ են։ "},
	{22, "22 Ինչո՞ւ, Տէ՛ր, հեռու մնացիր, անտարբեր եղար նեղութեան ժամանակ։ "},
	{23, "23 Ամբարշտի յոխորտալուց տոչորում է աղքատը. թող խափանուեն այն հնարքները, որ խորհեցին նրանք, "},
	{24, "24 քանզի գովաբանւում է մեղաւորն իր ցանկութիւնների համար, գովաբանւում է եւ նա, ով զրկում է։ "},
	{25, "25 Իսկ մեղաւորն ինչո՞ւ բազում դառնութեամբ զայրացրեց Աստծուն,թէ չի ստանայ հատուցում։ "},
	{26, "26 Չկայ Աստուած նրա աչքերի առջեւ, մշտապէս պիղծ են նրա ճանապարհները։ Իրաւունք ասուածը վերացել է նրա մտքից, նա կը տիրի իր բոլոր հակառակորդներին։ "},
	{27, "27 Նա ասում է իր սրտում, թէ չի սասանուի, դարէդար կ՚ապրի առանց փորձանքի։ "},
	{28, "28 Անէծքով, դառնութեամբ ու նենգութեամբ լի է բերանը նրա, իսկ լեզուի տակ ցաւ է ու տառապանք։ "},
	{29, "29 Մեծամեծների հետ դարան է մտնում, որ գաղտնաբար սպանի անմեղին։ "},
	{30, "30 Նրա աչքն աղքատի վրայ է, դարանակալում է թաքստոցում՝ ինչպէս առիւծն իր որջում, դարանակալում է յափշտակելու աղքատին, յափշտակելու աղքատին եւ ճանկելու նրան։ "},
	{31, "31 Նրան կը գցի իր որոգայթը, բայց տիրելով տնանկներին՝ նա կը խոնարհուի ու կ՚ընկնի։ "},
	{32, "32 Նա ասում է իր սրտում, թէ Աստուած մոռացել է, շրջել է երեսն իր՝ բնաւ չտեսնելու համար։ "},
	{33, "33 Ելի՛ր, Տէ՛ր իմ Աստուած, թող բարձրանայ քո ձեռքը, եւ մի՛ մոռացիր տնանկներին։ "},
	{34, "34 Իսկ ամբարիշտն ինչո՞ւ բարկացրեց Աստծուն՝ ասելով իր սրտում, թէ ինքը չի քննուի։ "},
	{35, "35 Տէ՛ր, տեսնում ես դու աղքատին՝ նայելով նրա ցաւին ու սրտմտութեանը՝ նրան քո ձեռքը վերցնելու համար։ Քեզ է ապաւինել աղքատը, եւ դու ես որբի օգնականը։ "},
	{36, "36 Թող խորտակուի մեղաւորի ու չարագործի բազուկը, թող փնտռուեն նրա մեղքերն ու այլեւս չգտնուեն։ "},
	{37, "37 Տէրը թագաւոր է յաւիտեանս յաւիտենից. թող կորչեն հեթանոսները նրա երկրից։ "},
	{38, "38 Տնանկների ցանկութիւնը լսեցիր, Տէ՛ր, քո ականջը ուշ դարձրեց նրանց սրտի պատրաստակամութեանը՝ "},
	{39, "39 տեսնելու որբի ու տնանկի դատաստանը, որպէսզի մարդը չշարունակի իր յոխորտանքը երկրի երեսին։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct hy10 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի "},
	{2, "2 Յոյսս դրի Տիրոջ վրայ. ինչո՞ւ էք ասում ինձ, որ ճնճղուկի պէս լեռները թռչեմ։ "},
	{3, "3 Չէ՞ որ մեղաւորներն ահա լարել են աղեղներն իրենց, պատրաստել են նետերը կապարճներում, որ մութն ընկնելիս ձգեն ուղղամիտների վրայ։ "},
	{4, "4 Ինչ դու շինեցիր՝ աւերեցին նրանք, իսկ արդարն ի՞նչ արեց։ "},
	{5, "5 Տէրն իր սուրբ տաճարում է, Տէրը երկնքում է՝ իր գահի վրայ։ Նրա աչքերը նայում են տնանկներին, իսկ արտեւանունքները զննում են մարդկանց որդիներին։ "},
	{6, "6 Տէրը քննում է արդարին եւ ամբարշտին. ով սիրում է մեղքը՝ ատում է անձն իր։ "},
	{7, "7 Մեղաւորների վրայ որոգայթ, հուր եւ ծծումբ կը տեղայ, փոթորկի շունչն է նրանց բաժակի բաժինը։ "},
	{8, "8 Արդար է Տէրը, արդարութիւն է սիրում, ճշմարտութեանն է նայում երեսը նրա։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct hy11 poems[] = {
	{1, "1 Այսուհետեւ՝ ութերորդականների մասին, սաղմոս Դաւթի "},
	{2, "2 Փրկի՛ր ինձ, Տէ՛ր, քանզի սուրբ չմնաց, նուազեց ճշմարտութիւնը մարդկանց որդիների մէջ։ "},
	{3, "3 Ստութեամբ խօսեց մարդը մարդու հետ, սրտերը հաղորդակցուեցին նենգ շրթունքներով։ "},
	{4, "4 Տէրը կ՚ոչնչացնի բոլոր նենգ շրթունքներն ու լեզուները մեծախօս, "},
	{5, "5 որոնք ասացին. Երկարեցնենք մեր լեզուները, մենք շրթունք ունենք, արդ՝ ո՞վ է մեր տէրը։ "},
	{6, "6 Աղքատի տառապանքին եւ տնանկի հեծութեան համար այժմ ես կ՚ելնեմ, - ասում է Տէրը, - կը բերեմ իմ փրկութիւնը եւ վստահ կը լինեմ նրանց վրայ։ "},
	{7, "7 Տիրոջ խօսքերը սուրբ խօսքեր են, ինչպէս ընտիր ու փորձուած արծաթ՝ եօթնապատիկ մաքրուած եւ զտուած հողից։ "},
	{8, "8 Դու, Տէ՛ր, պահպանեցիր մեզ եւ փրկեցիր այս ազգից մինչեւ յաւիտենութիւն։ "},
	{9, "9 Ամէն կողմ ամբարիշտներ են շրջում. քո բարձրութեան համեմատ դու մեծութի՛ւն տուր մարդկանց որդիներին։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct hy12 poems[] = {
	{1, "1 Մինչեւ ե՞րբ, Տէ՛ր, պիտի մոռանաս ինձ իսպառ, մինչեւ ե՞րբ պիտի շրջես երեսդ ինձնից։ "},
	{2, "2 Մինչեւ ե՞րբ խռովք ունենամ իմ հոգում եւ ամենօրեայ ցաւ՝ իմ սրտում։ "},
	{3, "3 Մինչեւ ե՞րբ թշնամին պիտի բռնանայ ինձ վրայ։ "},
	{4, "4 Նայի՛ր եւ լսի՛ր ինձ, Տէ՛ր իմ Աստուած, լո՛յս տուր, Տէ՛ր, իմ աչքերին, որ երբեք մահուան քուն չմտնեմ։ "},
	{5, "5 Թշնամիս թող չասի, թէ՝ յաղթեցի նրան, կամ հալածիչներս ցնծան, եթէ սասանուեմ։ "},
	{6, "6 Ես ողորմութեանդ վրայ յոյս դրի, Տէ՛ր, սիրտս հրճուեց քո փրկագործութեամբ. կ՚օրհներգեմ քեզ, Տէ՛ր, բարերա՛րդ իմ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct hy13 poems[] = {
	{1, "1 Անզգամն ասաց իր սրտում, թէ՝ չկայ Աստուած. ապականուեցին ու պղծուեցին իրենց անօրէնութեան մէջ, եւ չկայ մէկը, որ բարութիւն գործի։ "},
	{2, "2 Տէրն երկնքից նայեց բոլոր մարդկանց որդիներին՝ տեսնելու, թէ կա՞յ մի իմաստուն, որ Աստծուն փնտռի։ "},
	{3, "3 Բոլորը խոտորուեցին, միասին անպիտան դարձան. բարութիւն անող չկայ, ոչ իսկ մէկ հոգի։ "},
	{4, "4 Ինչպէ՞ս չեն գիտակցում բոլոր նրանք, ովքեր անօրէնութիւն են գործում, ովքեր խժռում են իմ ժողովրդին իբրեւ կերակուր ու հաց եւ Տիրոջը չեն դիմում։ "},
	{5, "5 Այնտե՛ղ են երկիւղից սարսում, ուր երկիւղ չկայ, քանզի Տէրը արդարների ազգի մէջ է։ "},
	{6, "6 Աղքատի մտածմունքը ամօթ համարեցին, Տէրն է յոյսը նրա։ "},
	{7, "7 Ո՞վ կը տայ Սիոնից փրկութիւնն Իսրայէլի։ Երբ Տէրն իր ժողովրդին վերադարձնի գերութիւնից, Յակոբը կը ցնծայ, եւ Իսրայէլն ուրախ կը լինի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct hy14 poems[] = {
	{1, "1 Տէր, ո՞վ պիտի ապրի քո վրանում, կամ ո՞վ պիտի բնակուի քո սուրբ լերան վրայ. "},
	{2, "2 նա, ով անբասիր է ընթանում, արդար գործ է կատարում, ճշմարտութիւն խօսում իր սրտում։ "},
	{3, "3 Ով չի նենգել իր լեզուով եւ ընկերոջը վատութիւն չի արել, "},
	{4, "4 Մերձաւորներից նախատինք նա չի ստանում, եւ չարագործն անարգուած է նրա աչքում։ Այդպիսին փառաբանում է նրանց, ովքեր երկիւղ ունեն Տիրոջից, երդւում է իր բարեկամին չի դրժում։ "},
	{5, "5 Իր արծաթը վաշխով չի տալիս, իրաւունքի դէմ կաշառք չի վերցնում։ Ով անում է այս, նա յաւիտեան չի սասանուի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct hy15 poems[] = {
	{1, "1 Սաղմոս Դաւթի, արձանագիր "},
	{2, "2 Պահպանի՛ր ինձ, Աստուա՛ծ, քանզի քեզ վրայ դրի յոյսն իմ։ Տիրոջն ասացի. Իմ Տէրն ես դու, ինձ արուած բարիքները քեզնից են։ "},
	{3, "3 Քո սրբերին, որոնք քո երկրում են, սքանչելագործութեամբ ցոյց տուիր իմ բոլոր ցանկութիւնները։ "},
	{4, "4 Շատացան նրանց հիւանդութիւնները, որ այսուհետեւ յաճախակի են դառնալու։ Չեմ մասնակցի նրանց արիւնալի հաւաքներին եւ նրանց անունը չեմ յիշատակի իմ շրթունքներով։ "},
	{5, "5 Տէ՜ր, իմ ժառանգութեան եւ իմ բաժակի բաժին, ժառանգութիւնս դու ես կրկին ինձ վերադարձնելու։ "},
	{6, "6 Ինձ վիճակ ընկաւ ընտրեալների մէջ լինելու, եւ իմ բաժին ժառանգութիւնն հաճելի եղաւ ինձ։ "},
	{7, "7 Պիտի օրհներգեմ Տիրոջը, որ իմաստուն դարձրեց ինձ, եւ գիշերն անգամ երիկամներս ինձ խրատում էին։ "},
	{8, "8 Սկզբից եւեթ Տիրոջը մշտապէս տեսնում էի իմ առջեւ. նա իմ աջ կողմում է, որպէսզի չսասանուեմ։ "},
	{9, "9 Դրա համար ուրախ եղաւ սիրտն իմ, եւ ցնծաց լեզուն իմ, իսկ մարմինն իմ կը հանգստանայ յոյսով. "},
	{10, "10 քանզի դժոխքում չես թողնի դու ինձ, եւ քո սրբին ապականութիւն տեսնել չես տայ։ "},
	{11, "11 Ինձ ցոյց տուիր կեանքի քո ճանապարհները, քո աջի քաղցրութիւնից ու վայելչութիւնից լիովին յագեցրիր ինձ երեսիդ ուրախութեամբ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct hy16 poems[] = {
	{1, "1 Աղօթք Դաւթի. Արդարութեանն ակա՛նջ դիր, Տէ՛ր, նայի՛ր իմ խնդրանքին եւ լսի՛ր աղօթքս, որ նենգ շրթներով չէ։ "},
	{2, "2 Դատաստանս քեզնից թող չլինի, եւ աչքերն իմ ճշմարտութիւնը թող տեսնեն։ "},
	{3, "3 Փորձեցիր սիրտն իմ եւ քննեցիր գիշերով, փորձեցիր ինձ, եւ իմ մէջ անիրաւութիւն չգտնուեց։ "},
	{4, "4 Բերանն իմ չի պատմի մարդկանց որդիների գործերը. քո շրթների խօսքերի շնորհիւ ես հաստատ կը մնամ դժուարին ճանապարհներին։ "},
	{5, "5 Հաստատո՛ւն պահիր շաւիղն իմ քո ճանապարհին, որ ընթացքս չխոտորուի։ "},
	{6, "6 Ես քե՛զ կանչեցի, Տէ՛ր, քանի որ լսեցիր ինձ, Աստուա՛ծ. դէպի ի՛նձ խոնարհեցրու ականջդ եւ լսի՛ր իմ խօսքերը։ "},
	{7, "7 Սքանչելի դարձրիր քո ողորմութիւնները, դու, որ աջիդ գտնուող հակառակորդներից փրկում ես նրանց,որոնք իրենց յոյսը դրել են քեզ վրայ։ "},
	{8, "8 Պահպանի՛ր ինձ աչքի բբի պէս, քո թեւերի հովանու տակ ծածկի՛ր ինձ "},
	{9, "9 ամբարիշտների երեսից, որոնք տառապեցրին ինձ։ Թշնամիներն ինձ պաշարեցին՝ "},
	{10, "10 խիստ պարարտացան եւ նրանց բերանն ամբարտաւանութիւն բարբառեց։ "},
	{11, "11 Վռնդեցին ինձ, եւ արդ դարձեալ շուրջս պատելով, մտադրուեցին ինձ գետին տապալել։ "},
	{12, "12 Ինձ թուացին իբրեւ առիւծ, որ պատրաստ է որսի վրայ նետուելու, իբրեւ կորիւն առիւծի՝ նստած դարանում։ "},
	{13, "13 Ելի՛ր, Տէ՛ր, հասի՛ր եւ արգելի՛ր նրանց, փրկի՛ր ինձ ամբարիշտների սրից ու թշնամու ձեռքից։ "},
	{14, "14 Տէ՛ր, վերացրո՛ւ նրանց աշխարհից, ցրի՛ր նրանց եւ խորտակի՛ր կեանքը նրանց։ Քո պահեստներից լցուեց որովայնը նրանց, յագեցան նրանք կերակուրներով եւ մնացածը թողեցին իրենց երեխաներին։ "},
	{15, "15 Իսկ ես արդարութեամբ կ՚երեւամ քո առաջ, կը յագենամ՝ տեսնելով փառքը քո։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct hy17 poems[] = {
	{1, "1 Այսուհետեւ՝ Տիրոջ ծառայ Դաւթի՝ քաջամարտիկի մասին, որն օրհնութեան այս խօսքերը Տիրոջն ուղղեց այն օրը, երբ Տէրը փրկեց նրան բոլոր թշնամիների ու Սաւուղի ձեռքից. եւ ասաց. "},
	{2, "2 Սիրում եմ քեզ, Տէ՛ր, զօրութի՛ւն իմ. ո՛վ Տէր, պահպանի՛չ իմ, ապաւէ՛ն իմ եւ փրկի՛չ։ "},
	{3, "3 Աստուած օգնականս է, ես յոյսս դրել եմ նրա վրայ. իմ ապաւէնն է, փրկութեանս եղջիւրը, ինձ ընդունողը։ "},
	{4, "4 Օրհնելով կը կանչեմ Տիրոջը, եւ իմ թշնամիներից կ՚ազատուեմ։ "},
	{5, "5 Մահուան տառապանքը շրջապատեց ինձ, եւ անօրէնութեան հեղեղն ինձ վրդովեց։ "},
	{6, "6 Դժոխքի ցաւերը պաշարեցին ինձ, եւ մահացու վտանգներն ինձ հասան։ "},
	{7, "7 Նեղութեանս մէջ ես Տիրոջը դիմեցի եւ իմ Աստծուն աղաղակեցի. Նա լսեց ինձ եւ իմ աղօթքի ձայնն իր սուրբ տաճարից, նրան ուղղուած աղաղակս նրա ականջին է հասնելու։ "},
	{8, "8 Ցնցուեց ու դողաց երկիրը, եւ լեռների հիմքերը սասանուեցին ու խախտուեցին, քանզի բարկացաւ նրանց վրայ Աստուած։ "},
	{9, "9 Նրա բարկութիւնից ծուխ բարձրացաւ, երեսից հուր բորբոքուեց, եւ կայծակներ ճարճատեցին նրանից։ "},
	{10, "10 Ցածրացրեց նա երկինքն ու իջաւ, եւ նրա ոտքերի տակ մառախուղ էր։ "},
	{11, "11 Ելաւ նա քերովբէների վրայ ու թռաւ, սլացաւ հողմի թեւերով։ "},
	{12, "12 Խաւարն իր համար ծածկոյթ դարձրեց, եւ շուրջբոլորն իր տունը եղաւ՝ օդի ամպերի թանձր ջրերով։ "},
	{13, "13 Նա փայլատակեց նրանց առջեւ, ամպերը կարկուտ եւ հրեղէն կայծակներ արձակեցին։ "},
	{14, "14 Որոտաց Տէրն երկնքից, եւ Բարձրեալն իր ձայնը լսել տուեց կարկտով ու հուր կայծակներով։ "},
	{15, "15 Ուղարկեց իր նետերն ու ցրեց դրանք, շատացրեց իր կայծակները եւ սփռեց դրանք։ "},
	{16, "16 Քո զայրոյթից, Տէ՛ր, եւ քո բարկութեան հողմի շառաչից երեւացին ջրերի ակունքները, եւ յայտնուեցին հիմքերն աշխարհի։ "},
	{17, "17 Վերից փութալով՝ Տէրը վերցրեց ինձ, վերցրեց ինձ ջրերի հեղեղից։ "},
	{18, "18 Տէրը կը փրկի ինձ իմ զօրեղ թշնամիներից ու ինձ ատողներից, որոնք աւելի հզօր են, քան ես։ "},
	{19, "19 Նրանք ինձ վրայ հասան չարչարանքներիս օրերին, բայց Տէրն ինձ զօրութիւն տուեց "},
	{20, "20 ու անդորրութիւն պարգեւեց։ Եւ Տէրը կը փրկի ինձ, քանզի նա ինձ հաւանեց։ "},
	{21, "21 Տէրն ինձ կը հատուցի ըստ իմ արդարութեան, ըստ իմ անբծութեան կը հատուցի ինձ։ "},
	{22, "22 Ես կը պահեմ Տիրոջ ճանապարհը եւ իմ Աստծու դէմ ամբարշտութիւն չեմ անի։ "},
	{23, "23 Նրա բոլոր օրէնքներն իմ առջեւ են, նա արդարութիւնն իր չհեռացրեց ինձնից։ "},
	{24, "24 Եւ ես անբասիր կը լինեմ նրա հանդէպ, կը զգուշանամ իմ անօրէնութիւնից։ "},
	{25, "25 Տէրն ինձ կը հատուցի ըստ իմ արդարութեան, ըստ իմ ձեռքերի մաքրութեան, որ նրա աչքի առջեւ է։ "},
	{26, "26 Սրբի հետ սուրբ կը լինես, Տէ՛ր, անարատ մարդու հետ՝ անարատ։ "},
	{27, "27 Ընտրեալների հետ ընտրեալ կը լինես եւ խոտորուածներին կը կործանես։ "},
	{28, "28 Դու փրկում ես հեզ ժողովուրդներին, իսկ ամբարտաւանների աչքերը խոնարհեցնում։ "},
	{29, "29 Դու լոյս ես տալիս իմ ճրագին, Տէ՛ր. Աստուա՛ծ իմ, լուսաւորի՛ր ինձ խաւարում։ "},
	{30, "30 Քեզնով կը փրկուեմ ես փորձութիւնից, Աստծուս շնորհիւ պարիսպներ կը յաղթահարեմ։ "},
	{31, "31 Աստուա՛ծ իմ, անթերի են քո ճանապարհները, ընտիր են խօսքերը Տիրոջ, նա ապաւէնն է բոլոր նրանց, ովքեր յոյսը դրել են նրա վրայ. "},
	{32, "32 քանզի Տիրոջից բացի ո՞վ է Աստուած, կամ ո՞վ է Աստուած մեր Աստծուց բացի։ "},
	{33, "33 Աստուա՛ծ, դու ինձ ուժ պարգեւեցիր եւ իմ ճանապարհն անբիծ դարձրիր։ "},
	{34, "34 Ինձ ոտքեր տուիր եղջերուի ոտքերի նման, եւ բարձր տեղերի վրայ կանգնեցրիր ինձ։ "},
	{35, "35 Ձեռքերս վարժեցրիր պատերազմի, իսկ բազուկն իմ դարձրիր ինչպէս հաստ աղեղ։ "},
	{36, "36 Տուիր ինձ նաեւ քո փրկարար պաշտպանութիւնը։ Աջդ զօրավիգ եղաւ ինձ, իսկ խրատդ միշտ կանգուն պահեց. քո խրատն իմաստուն կը դարձնի ինձ։ "},
	{37, "37 Ընդարձակեցիր ուղիս իմ ոտքերի տակ, եւ ընթացքն իմ չտկարացաւ։ "},
	{38, "38 Հալածելով թշնամիներիս՝ ես կը հասնեմ նրանց ու ետ չեմ դառնայ, մինչեւ չոչնչացնեմ նրանց։ "},
	{39, "39 Ես կ՚ընկճեմ նրանց, որ այլեւս չկարողանան կանգնել, եւ նրանք կ՚ընկնեն իմ ոտքերի տակ։ "},
	{40, "40 Դու ինձ պատերազմելու զօրութիւն տուիր, դէմս ելնողներին ոտքերիս տակ գցեցիր։ "},
	{41, "41 Թշնամիներիս դու հալածեցիր, իսկ ինձ ատողներին ոչնչացրիր։ "},
	{42, "42 Աղաղակեցին նրանք, բայց չկար մէկը, որ փրկէր նրանց, կանչեցին Տիրոջը, բայց նա չլսեց նրանց։ "},
	{43, "43 Ես կը փշրեմ, հողմափոշի կը դարձնեմ նրանց, փողոցների ցեխի պէս կը տրորեմ նրանց։ "},
	{44, "44 Տէրն ինձ կը փրկի ժողովրդի ըմբոստութիւնից եւ ինձ հեթանոսների գլուխ կը կարգի։ "},
	{45, "45 Իմ չճանաչած ժողովուրդն ինձ ծառայեց եւ համակ ականջ դարձած՝ լսեց ինձ։ "},
	{46, "46 Օտարների որդիներն ինձ ստեցին, օտարների որդիները մաշուեցին՝ խոտորուելով իրենց շաւղից։ "},
	{47, "47 Կենդանի է Տէրն ու օրհնեալ է Աստուած, եւ թող բարձր լինի Աստուածն իմ փրկութեան։ "},
	{48, "48 Աստուածն իմ, որ լուծում է վրէժն իմ եւ ժողովուրդներին ինձ է հնազանդեցնում, "},
	{49, "49 որ փրկում է ինձ իմ գազազած թշնամիներից. դու բարձր դասեցիր ինձ իմ հակառակորդներից, անիրաւ մարդուց ազատեցիր ինձ։ "},
	{50, "50 Դրա համար գոհութիւն պիտի մատուցեմ քեզ հեթանոսների մէջ եւ քո անուանը սաղմոս պիտի երգեմ։ "},
	{51, "51 Դու փրկութեամբ մեծարեցիր թագաւորիդ՝ ողորմելով քո օծեալ Դաւթին ու նրա սերնդին յաւիտեանս յաւիտենից։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct hy18 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի "},
	{2, "2 Երկինքը պատմում է Աստծու փառքը, եւ երկնքի հաստատութիւնը յայտնում է նրա ձեռքի գործերը։ "},
	{3, "3 Օրը օրուան միտք է հաղորդում, եւ գիշերը գիշերուան գիտութիւն է ցոյց տալիս։ "},
	{4, "4 Չկան բառեր, ոչ էլ խօսքեր,դրանց հնչիւնները լսելի չեն։ "},
	{5, "5 Ողջ երկիրն է բռնել ձայնը նրանց, եւ մինչեւ աշխարհի ծայրն են հասել խօսքերը նրանց։ "},
	{6, "6 Արեւի մէջ նա վրանն իր խփեց, իսկ ինքն ասես փեսայ լինի, որ ելնում է իր առագաստից. ցնծում է նա որպէս հսկայ՝ ընթանալով իր ճանապարհով։ "},
	{7, "7 Երկնքի ծայրերից է նրա ծագումը, իսկ դադարը՝ մինչեւ ծայրերը նրա, ու չկայ մէկը, որ թաքնուի նրա տապից։ "},
	{8, "8 Տիրոջ օրէնքն անբիծ է եւ վերափոխում է հոգիները. Տիրոջ վկայութիւնն ստոյգ է եւ իմաստուն է դարձնում տհասներին։ "},
	{9, "9 Տիրոջ արդարութիւնն ուղիղ է եւ զուարճացնում է սրտերը. Տիրոջ պատուիրանները լոյս են ու լոյս են տալիս աչքերին։ "},
	{10, "10 Տիրոջ երկիւղը սուրբ է եւ սուրբ է մնում յաւիտեան։ Տիրոջ դատաստանները ճշմարիտ են եւ ինքնին՝ արդար։ "},
	{11, "11 Ոսկուց ու շատ թանկագին քարերից ցանկալի են դրանք, նոյնպէս եւ քաղցր՝ մեղրից ու խորիսխից աւելի։ "},
	{12, "12 Եւ քանի որ քո ծառան պահպանում է դրանք, պահպանելու վարձը մեծ կը լինի։ "},
	{13, "13 Նրա յանցանքներն ո՞վ կարող է մտքում պահել. իմ գաղտնիքներից մաքրի՛ր ինձ, Տէ՜ր։ "},
	{14, "14 Օտարներից պահպանի՛ր քո ծառային, որ նրանք ինձ չտիրեն. այնժամ ես անբիծ կը լինեմ ու կը մաքրուեմ մեծ մեղքերից։ "},
	{15, "15 Թող քեզ հաճելի լինեն բերանիս խօսքերը, եւ սրտիս խորհուրդներն յարաժամ քո առջեւ լինեն, Տէ՜ր, օգնակա՛ն իմ եւ փրկի՛չ իմ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct hy19 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի "},
	{2, "2 Անձկութեան օրը կը լսի քեզ Տէրը, եւ օգնական կը լինի քեզ Յակոբի Աստծու անունը։ "},
	{3, "3 Տէրն իր սուրբ Սիոնից քեզ օգնութիւն կ՚ուղարկի եւ կ՚ընդունի քեզ։ "},
	{4, "4 Թող յիշի Տէրը քո բոլոր ընծաները եւ ողջակէզներդ ընդունելի թող համարի։ "},
	{5, "5 Տէրը քեզ կը տայ, ինչ որ ուզի քո սիրտը, եւ քո բոլոր մտադրութիւնները նա կը կատարի։ "},
	{6, "6 Մենք կը ցնծանք քո փրկութեամբ, Աստծու անունով մենք կը մեծարուենք։ Տէրը կը կատարի քո բոլոր խնդրանքները։ "},
	{7, "7 Այժմ հասկացանք, որ Տէրը փրկեց իր օծեալին։Նա կը լսի նրան իր սուրբ երկնքիցիր փրկարար աջի զօրութեամբ։ "},
	{8, "8 Ոմանց աչքը ռազմակառքերին է, ուրիշներինը՝ երիվարներին։ իսկ մենք մեր Աստծու անունն ենք կանչում։ "},
	{9, "9 Նրանք կործանուեցին ու ընկան, իսկ մենք ոտքի կանգնեցինք եւ ուղղուեցինք։ "},
	{10, "10 Տէ՜ր, պահպանի՛ր թագաւորին եւ լսի՛ր մեզ այն օրը, երբ ձայն տանք քեզ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct hy20 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի "},
	{2, "2 Տէ՜ր, զօրութեամբ քո պիտի ուրախանայ թագաւորը, եւ յոյժ ցնծայ քո փրկութեամբ։ "},
	{3, "3 Նրա սրտի ուզածը տուիր նրան եւ նրա շրթունքների ցանկութիւնը չմերժեցիր։ "},
	{4, "4 Քո քաղցր օրհնութեամբ այցելեցիր նրան եւ թանկագին քարերով ընդելուզուած պսակ դրիր նրա գլխին։ "},
	{5, "5 Կեանք խնդրեց քեզնից, եւ նրան տուիր երկար օրեր՝ յաւիտեանս յաւիտենից։ "},
	{6, "6 Մեծ է նրա փառքը քեզնից եղած փրկութեամբ,փառք ու պարծանք կը դնես նրա վրայ։ "},
	{7, "7 Օրհնութեան մէջ կը հաստատես նրան յաւիտեանս յաւիտենից, կ՚ուրախացնես նրան քո երեսի խնդութեամբ։ "},
	{8, "8 Թագաւորն իր յոյսը դրեց Տիրոջ վրայ, եւ Բարձրեալի ողորմութեամբ նա չի սասանուի։ "},
	{9, "9 Թող ձեռքդ անպակաս լինի քո թշնամիների վրայ, եւ աջդ հասնի բոլոր քեզ ատողներին։ "},
	{10, "10 Երբ դու երեւաս, նրանց հրաբորբոք հնոց կը դարձնես. Տէրն իր զայրոյթով կը խռովի նրանց, եւ հուրը նրանց կը լափի։ "},
	{11, "11 Երկրից կը կորչի պտուղը նրանց, իսկ մարդկանց որդիներից՝ սերունդը նրանց։ "},
	{12, "12 Չարամտութեամբ խոտորուեցին քեզնից, դաւեր նիւթեցին, բայց չեն կարող իրագործել դրանք։ "},
	{13, "13 Դու նրանց հալածական կ՚անես, եւ նրանց երեսը կ՚ուղղես քո հաւատարիմների կողմը։ "},
	{14, "14 Բա՛րձր եղիր, Տէ՜ր, քո զօրութեամբ. օրհնենք եւ սաղմոս երգենք քո զօրութեանը։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct hy21 poems[] = {
	{1, "1 Այսուհետեւ՝ առաւօտեան օգնութեան մասին.սաղմոս Դաւթի "},
	{2, "2 Աստուա՛ծ իմ, Աստուա՛ծ, նայի՛ր ինձ, ինչո՞ւ լքեցիր ինձ, յանցանքներիս պատճառով հեռու մնացիր իմ փրկութիւնից։ "},
	{3, "3 Աստուա՛ծ իմ, քեզ կանչեցի ցերեկով, բայց չլսեցիր ինձ, կանչեցի գիշերով՝ բայց չանսացիր ինձ։ "},
	{4, "4 Դու ապրում ես սրբերի մէջ եւ գովերգւում Իսրայէլում։ "},
	{5, "5 Քեզ վրայ յոյս դրին հայրերը մեր, յոյս դրին քեզ վրայ, եւ դու փրկեցիր նրանց։ "},
	{6, "6 Առ քեզ աղաղակեցին ու ապրեցին,քեզ վրայ յոյս դրին եւ ամօթով չմնացին։ "},
	{7, "7 Բայց ես որդ եմ եւ ոչ թէ մարդ, մարդկանց համար նախատինք եմ եւ անարգանք՝ ժողովուրդներին։ "},
	{8, "8 Բոլոր ինձ տեսնողներն արհամարհում էին ինձ, խօսում շրթունքներով եւ շարժում գլուխներն իրենց՝ ասելով. "},
	{9, "9 Յոյսը դրել է Տիրոջ վրայ, դէ թող փրկի ու ազատի նրան, եթէ սիրում է նրան։ "},
	{10, "10 Դո՛ւ հանեցիր ինձ արգանդից, իմ յոյսը դարձար մօրս կաթով սնուելու օրից։ "},
	{11, "11 Քե՛զ յանձնուեցի ես արգանդից, մօրս որովայնից սկսած՝ դու ես Աստուածն իմ։ "},
	{12, "12 Մի՛ հեռացիր ինձնից, քանզի մօտ են վտանգները, եւ չկայ մէկը, որ օգնի ինձ։ "},
	{13, "13 Բազում եզներ շրջապատեցին ինձ, եւ պարարտ ցուլերը պաշարեցին ինձ։ "},
	{14, "14 Մռնչացող ու յափշտակող առիւծների պէս ինձ վրայ բացին բերաններն իրենց։ "},
	{15, "15 Հոսեցի ես ինչպէս ջուր, խախտուեցին իմ բոլոր ոսկորները, եւ սիրտս հալած մոմ դարձաւ որովայնիս մէջ։ "},
	{16, "16 Զօրութիւնն իմ չորացաւ խեցու նման, լեզուս կպաւ քիմքիս, եւ ինձ իջեցրին մահուան հողի մէջ։ "},
	{17, "17 Չորս կողմս բազում շներ հաւաքուեցին, եւ չարագործների ամբոխն ինձ պաշարեց։ "},
	{18, "18 Ծակեցին ձեռքերն ու ոտքերն իմ, հաշուեցին բոլոր ոսկորներս, նրանք նայեցին ու տեսան ինձ։ "},
	{19, "19 Հագուստներս բաժանեցին իրար մէջ, եւ պատմուճանիս վրայ վիճակ գցեցին։ "},
	{20, "20 Դու, Տէ՛ր, օգնութիւնդ ինձնից հեռու մի՛ պահիր, այլ օգնի՛ր ինձ, Տէ՛ր։ "},
	{21, "21 Փրկի՛ր ինձ սրից, փրկի՛ր միամօրիկիս շների ձեռքից։ "},
	{22, "22 Ազատի՛ր ինձ առիւծի բերանից, եւ խեղճ անձն իմ՝ միեղջերուի եղջիւրից։ "},
	{23, "23 Անունդ պիտի հռչակեմ իմ եղբայրներին, ժողովատեղում պիտի օրհնեմ քեզ։ "},
	{24, "24 Աստուածավախնե՛ր, օրհնեցէ՛ք Տիրոջը, եւ թող Յակոբի բոլոր զաւակները փառաբանեն նրան։ "},
	{25, "25 Իսրայէլի ողջ սերունդը երկիւղ պիտի կրի Տիրոջից, քանզի Տէրը չարհամարհեց ու չանարգեց աղօթքն աղքատիսեւ երեսն ինձնից չշրջեց, այլ երբ ձայն տուի նրան՝ լսեց ինձ։ "},
	{26, "26 Քո մասին է գովքն իմ, մեծ հաւաքներում պիտի օրհնեմ քեզ։ Ուխտս պիտի կատարեմ նրա բոլոր երկիւղածների առջեւ։ "},
	{27, "27 Տնանկները պիտի ուտեն ու յագենան, Տիրոջը փնտռողները պիտի օրհնեն նրան։ Նրանց սրտերը կ՚ապրեն յաւիտեանս յաւիտենից։ "},
	{28, "28 Աշխարհի բոլոր ծայրերից մարդիկ կը վերյիշեն ու կը դառնան Տիրոջը։ Բոլոր ազգատոհմերը կ՚երկրպագեն նրան, "},
	{29, "29 քանզի Տիրոջն է արքայութիւնը, եւ նա է տիրում բոլոր հեթանոսների վրայ։ "},
	{30, "30 Լիացան եւ երկրպագեցին նրան երկրի բոլոր մեծամեծները, եւ ամէն ոք, որ գերեզման է իջնում, նրա առջեւ պիտի ընկնի։ "},
	{31, "31 Նրանով է ապրում անձն իմ, եւ իմ սերունդը պիտի ծառայի նրան։ "},
	{32, "32 Գալիք սերունդներին պիտի պատմեմ Տիրոջ մասին, Տիրոջ գործած արդարութիւնը պիտի աւանդուի այն ժողովրդին, որ ծնուելու է։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct hy22 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի "},
	{2, "2 Տէրն իմ հովիւն է, եւ ինձ ոչինչ չի պակասի։ "},
	{3, "3 Դալար վայրերում նա ինձ բնակեցրեց եւ հանդարտ ջրերի մօտ ինձ սնուցեց։ "},
	{4, "4 Նա կենդանացրեց ինձ, յանուն իր անուան առաջնորդեց ինձ արդարութեան ճանապարհներով։ "},
	{5, "5 Եթէ նոյնիսկ անցնեմ մահուան ստուերների միջով, չեմ վախենայ չարից, քանզի դու, Տէ՛ր, ինձ հետ ես։ Քո ցուպն ու գաւազանն ինձ կը մխիթարեն։ "},
	{6, "6 Իմ առջեւ սեղան պատրաստեցիր հալածիչներիս աչքերի դիմաց։ Գլուխս իւղով օծեցիր, եւ քո բաժակն ինձ արբեցրեց անխառն գինու պէս։ "},
	{7, "7 Ողորմութիւնը քո, Տէ՛ր, պիտի հետեւի ինձ կեանքիս բոլոր օրերին, երկար օրեր ես Տիրոջ տանը պիտի բնակուեմ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view23() {
struct hy23 poems[] = {
	{1, "1 Դաւթի կիրակնօրեայ սաղմոսը "},
	{2, "2 Տիրոջն է երկիրն իր ամբողջութեամբ, աշխարհն իր բոլոր բնակիչներով։ "},
	{3, "3 Նրա հիմքերն անձամբ գցեց ծովի վրայ, եւ գետերի վրայ հաստատեց նրան։ "},
	{4, "4 Ո՞վ կը բարձրանայ Տիրոջ լեռը, կամ ո՞վ կը կանգնի նրա սրբավայրում. "},
	{5, "5 նա, ով մաքուր ձեռքեր եւ անբիծ սիրտ ունի, ով յանձն չի առել ունայնութիւն ու նենգութեամբ չի երդուել իր ընկերոջը։ "},
	{6, "6 Նա՛ է, որ օրհնութիւն կը ստանայ Տիրոջից, եւ ողորմութիւն իր փրկարար Աստծուց։ "},
	{7, "7 Այս սերունդն է, որ փնտռում է Տիրոջը, որ ուզում է տեսնել համար երեսը Յակոբի Աստծու։ "},
	{8, "8 Վե՛ր քաշեցէք, իշխաննե՛ր, դռները ձեր, թող բացուեն յաւիտենական դռները, եւ փառքի արքան թող ներս մտնի։ Հանգիստ։ "},
	{9, "9 Ո՞վ է այս փառքի արքան, - կարողութեամբ հզօր Տէրն է նա, պատերազմում զօրեղ Տէրը։ "},
	{10, "10 Վե՛ր քաշեցէք, իշխաննե՛ր, դռները ձեր, թող բացուեն յաւիտենական դռները, եւ փառքի արքան թող ներս մտնի։ "},
	{11, "11 Ո՞վ է այս փառքի արքան, - զօրութիւնների Տէրը՝ նա ինքն է փառքի արքան։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view24() {
struct hy24 poems[] = {
	{1, "1 Այսուհետեւ՝ Սաղմոս Դաւթի "},
	{2, "2 Դէպի քեզ, Տէ՛ր, բարձրացրի հոգիս։ "},
	{3, "3 Աստուա՛ծ իմ, քեզ վրայ դրի յոյսն իմ, թող ամօթով չմնամ, եւ թշնամիներս չծիծաղեն ինձ վրայ։ "},
	{4, "4 Բոլոր նրանք, ովքեր յոյսով սպասում են քեզ, ամօթով պիտի չմնան, այլ ամօթով պիտի մնան անօրէններն իրենց ունայնութեան մէջ։ Տէ՛ր, ցո՛յց տուր ինձ քո ճանապարհները եւ քո շաւիղները սովորեցրո՛ւ ինձ։ "},
	{5, "5 Ինձ առաջնորդի՛ր քո ճշմարտութեան մէջ եւ ուսուցանի՛ր ինձ, քանզի դու ես փրկիչ Աստուածն իմ, ու ես հանապազ քեզ եմ սպասում։ "},
	{6, "6 Յիշի՛ր, Տէ՛ր, քո գթութիւններն ու ողորմութիւնները, որոնք յաւիտենական են։ "},
	{7, "7 Իմ մանկութեան եւ տհասութեան մեղքերը մի՛ յիշիր, այլ յիշի՛ր ինձ, Տէ՛ր, քո ողորմութեամբ՝ ըստ քո բարութեան, "},
	{8, "8 քանզի դու քաղցր եւ ուղիղ ես, Տէ՛ր։ Դրա համար էլ մեղաւորներին դնում ես օրէնքի գիտութեան ճանապարհի վրայ։ "},
	{9, "9 Հեզերին առաջնորդում ես դատաստանի մէջ, հեզերին սովորեցնում քո ճանապարհները։ "},
	{10, "10 Տիրոջ բոլոր ուղիները ողորմութիւն ու ճշմարտութիւն են նրանց համար, ովքեր պահում են նրա ուխտն ու վկայութիւնը։ "},
	{11, "11 Յանուն քո անուան, Տէ՛ր, քաւութի՛ւն տուր իմ մեղքերին, քանզի շատացան դրանք։ "},
	{12, "12 Ո՞վ է այն մարդը, որ վախենում է Տիրոջ ից, Տէրը նրան սովորեցնելու է Իր ընտրած ուղին։ "},
	{13, "13 Նա բարութեան մէջ պիտի հանգչի, եւ նրա սերունդը երկիրը պիտի ժառանգի։ "},
	{14, "14 Տէրը զօրացուցիչն է իր երկիւղածների եւ իր ուխտը նրանց է սովորեցնում։ "},
	{15, "15 Աչքերն իմ մշտապէս Տիրոջն են ուղղուած, եւ նա՛ պիտի հանի ոտքերս թակարդից։ "},
	{16, "16 Նայի՛ր ինձ եւ ողորմի՛ր ինձ, քանզի միամօրիկ եմ ես եւ աղքատ։ "},
	{17, "17 Սրտիս նեղութիւնները խիստ շատացան, ազատի՛ր ինձ իմ վշտերից։ "},
	{18, "18 Տե՛ս իմ նուաստացումն ու տառապանքը եւ թողութի՛ւն արա իմ բոլոր մեղքերին։ "},
	{19, "19 Տե՛ս՝ թշնամիներս որքա՜ն բազմացան եւ անիրաւ ատելութեամբ ինձ ատեցին։ "},
	{20, "20 Պահպանի՛ր ինձ ու փրկի՛ր ինձ, եւ թող ամօթով չմնամ, որ յոյսս դրի քեզ վրայ։ "},
	{21, "21 Անբիծներն ու արդարներն ինձ կցորդ եղան, եւ ես սպասեցի քեզ։ "},
	{22, "22 Փրկի՛ր, Աստուա՛ծ, Իսրայէլն իր բոլոր նեղութիւններից։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view25() {
struct hy25 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս ԴաւթիԴա՛տ արա ինձ, Տէ՛ր, քանզի անբասիր ընթացայ, յոյսս դրի Տիրոջ վրայ, որ չլինեմ տկար։ "},
	{2, "2 Փորձի՛ր ինձ, Տէ՛ր, եւ քննի՛ր ինձ, փորձի՛ր երիկամներս ու սիրտս։ "},
	{3, "3 Ողորմութիւնդ, Տէ՛ր, աչքիս առջեւ է, եւ ճշմարտութիւնդ հաճելի է ինձ։ "},
	{4, "4 Ունայնամիտների աթոռին ես չեմ նստի եւ անօրէնների մօտ ես չեմ գնայ։ "},
	{5, "5 Չարագործների ամբոխը ես ատեցի եւ ամբարիշտների կողքին չեմ բազմի։ "},
	{6, "6 Սրբութեամբ կը լուամ ձեռքերն իմ եւ սեղանիդ շուրջը կը նստեմ, Տէ՛ր. "},
	{7, "7 թող լսեմ քո օրհնութեան ձայնը եւ պատմեմ քո բոլոր հրաշալիքները։ "},
	{8, "8 Տէ՛ր, սիրեցի քո տան վայելչութիւնը եւ քո փառքի բնակութեան վայրը։ "},
	{9, "9 Մի՛ կործանիր ինձ ամբարիշտների հետ եւ ոչ էլ կեանքս՝ արիւնահեղների հետ, "},
	{10, "10 որոնց ձեռքերն անօրէնութեան մէջ են, եւ աջը նրանց լի է կաշառքով։ "},
	{11, "11 Ես անբասիր ընթացայ, փրկի՛ր ինձ, Տէ՛ր, եւ ողորմի՛ր ինձ։ "},
	{12, "12 Ոտքն իմ ուղիղ ճանապարհների վրայ թող լինի, մեծ հաւաքներում քեզ պիտի օրհնեմ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view26() {
struct hy26 poems[] = {
	{1, "1 Տէրն իմ լոյսն է ու կեանքը, ո՞ւմից վախենամ. Տէրն իմ կեանքի ապաւէնն է, ո՞ւմից ես դողամ։ "},
	{2, "2 Երբ չարագործ նեղիչներս ու թշնամիներս մօտեցան ինձ՝ մարմինս ուտելու, նրանք թուլացան ու ընկան։ "},
	{3, "3 Եթէ իմ դէմ պատերազմ պատրաստուի, սիրտս չի սոսկայ. եթէ իմ դէմ ճակատամարտի ելնեն, միեւնոյն է, Տէ՛ր, յոյսս քեզ վրայ եմ դնելու։ "},
	{4, "4 Մի բան եմ խնդրել Տիրոջից, եւ նոյնն եմ աղաչում, որ կեանքիս բոլոր օրերին բնակուեմ Տիրոջ տանը, տեսնեմ Տիրոջ վայելչութիւնը եւ վերահսկեմ նրա տաճարում։ "},
	{5, "5 Չար օրերին նա ինձ թաքցրեց իր վրանում, պատսպարեց ինձ իր վրանի ծածկի տակ։ "},
	{6, "6 Ժայռից բարձր պահեցիր ինձ, այժմ էլ գլուխն իմ բարձրացրո՛ւ թշնամիներիս վրայ։ Շրջեմ եւ օրհնութեան պատարագ մատուցեմ Նրա վրանում, օրհներգեմ եւ սաղմոս երգեմ Տիրոջը։ "},
	{7, "7 Լսի՛ր ձայնն իմ, Տէ՛ր, քանզի քեզ կանչեցի, ողորմի՛ր ինձ եւ ակա՛նջ դիր, "},
	{8, "8 քանզի սիրտն իմ քեզ դիմեց, եւ հայեացքն իմ փնտռեց, փնտռեց քո երեսը, Տէ՛ր։ "},
	{9, "9 Մի՛ դարձրու երեսդ ինձնից եւ բարկութեամբ մի՛ շրջուիր քո ծառայից։ Իմ օգնականն եղիր, Տէ՛ր, եւ մի՛ անարգիր ինձ ու մի՛ լքիր, փրկիչ Աստուա՛ծ իմ։ "},
	{10, "10 Իմ հայրն ու մայրը լքեցին ինձ, բայց Տէրն ինձ ընդունեց։ "},
	{11, "11 Սովորեցրո՛ւ ինձ, Տէ՛ր, քո ճանապարհը եւ առաջնորդի՛ր ինձ քո ուղիղ շաւիղներով։ "},
	{12, "12 Իմ թշնամիների պատճառով ինձ նեղողների ձեռքը մի՛ մատնիր. Իմ դէմ մեղսագործ վկաներ ելան եւ չարախօսեցին ինձ իրենց անիրաւութեամբ։ "},
	{13, "13 Հաւատում եմ, որ կը տեսնեմ Տիրոջ բարութիւնը ողջերի երկրում։ "},
	{14, "14 Սպասի՛ր Տիրոջն ու քաջալերուի՛ր, սիրտդ թող ամրապնդուի, Տիրո՛ջն սպասիր։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view27() {
struct hy27 poems[] = {
	{1, "1 Քեզ կանչեցի, Տէ՛ր, անարձագանք մի՛ թողնիր ինձ, Աստուա՛ծ իմ. եթէ երբեւէ լուռ մնաս, կը նմանուեմ նրանց, ովքեր գերեզման են իջնում։ "},
	{2, "2 Լսի՛ր, Տէ՛ր, պաղատանքիս ձայնը, երբ ես աղաչեմ քեզ, երբ ձեռքերս դէպի սուրբ տաճարդ պարզեմ։ "},
	{3, "3 Ամբարիշտների շարքը մի՛ դասիր ինձ եւ մի՛ կործանիր ինձ նրանց հետ, որ անօրէնութիւն են գործում, որ հաշտութեան մասին են խօսում իրենց ընկերների հետ, բայց սրտներում չարութիւն կայ։ "},
	{4, "4 Վարձատրի՛ր նրանց, Տէ՛ր, ըստ իրենց արարքների, իրենց անօրէն վարքի համեմատ հատուցի՛ր նրանց, նրանց ձեռքերի գործին նայելով՝ տո՛ւր իրենց հատուցումն իրենց։ "},
	{5, "5 Նրանք ուշ չդարձրին Տիրոջ արածներին, ոչ էլ նայեցին նրա ձեռքի գործերին։ Դու կը կործանես նրանց, եւ այլեւս նրանք ոտքի չեն կանգնի։ "},
	{6, "6 Օրհնեալ է Տէրը, քանզի լսեց ձայնն իմ աղօթքի։ "},
	{7, "7 Տէրն իմ օգնականն է ու պաշտպանը. նրա վրայ դրեց իր յոյսը սիրտն իմ, եւ մարմինս գոհացաւ ու զուարճացաւ. ես յօժարակամ պիտի փառաբանեմ նրան։ "},
	{8, "8 Տէրը զօրութիւնն է իմ ժողվրդի, ապաւէնն իր օծեալի փրկութեան։ "},
	{9, "9 Փրկի՛ր քո ժողովրդին, եւ օրհնի՛ր քո ժառանգորդներին, հովուի՛ր ու յաւէտ բարձրացրո՛ւ նրանց։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view28() {
struct hy28 poems[] = {
	{1, "1 Աստծո՛ւ որդիներ, մատուցեցէ՛ք Տիրոջը, մատուցեցէ՛ք Տիրոջը խոյերի ձագեր։ "},
	{2, "2 Մատուցեցէ՛ք Տիրոջը փառք ու պատիւ, տուէ՛ք Տիրոջը փառքն իր անուան եւ երկրպագեցէ՛ք Տիրոջն իր սուրբ սրահում։ "},
	{3, "3 Տիրոջ ձայնը ջրերի վրայ է. փառքի Աստուածը որոտաց, Տէրն ինքն է անսպառ ջրերի վրայ։ "},
	{4, "4 Տիրոջ ձայնը ահարկու է, Տիրոջ ձայնը փառահեղ է։ "},
	{5, "5 Տիրոջ ձայնը փշրում է մայրիները, Տէրը կոտրատում է մայրիները Լիբանանի։ "},
	{6, "6 Տէրը կոտրատում է դրանք ինչպէս Լիբանանի մատաղ տունկերը, որոնք սիրասուն են միեղջերուի ձագերի պէս։ "},
	{7, "7 Տիրոջ ձայնը ճեղքում է կրակի բոցը։ "},
	{8, "8 Տիրոջ ձայնը ցնցում է անապատը, Տէրը դողացնում է Կադէսի անապատը։ "},
	{9, "9 Տիրոջ ձայնը ոտքի է կանգնեցնում եղնիկներին եւ մերկացնում անտառները։ Նրա տաճարում բոլորը թող գովեն փառքը նրա։ "},
	{10, "10 Տէրը զսպում եւ ցածրացնում է ջրհեղեղները, Տէրը յաւիտեան պիտի թագաւորի։ "},
	{11, "11 Տէրն իր ժողովրդին զօրութիւն պիտի տայ, իր ժողովրդին պիտի օրհնի խաղաղութիւն պարգեւելով։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view29() {
struct hy29 poems[] = {
	{1, "1 Պանծացնում եմ քեզ, Տէ՛ր, քանզի ընդունեցիր ինձ եւ չթողիր, որ թշնամիներս չարախնդան վրաս։ "},
	{2, "2 Տէր Աստուա՛ծ իմ, "},
	{3, "3 կանչեցի քեզ, եւ բուժեցիր ինձ։ "},
	{4, "4 Տէ՛ր, հոգիս դժոխքից հանեցիր եւ փոսն իջնողների միջից փրկեցիր ինձ։ "},
	{5, "5 Սաղմո՛ս երգեցէք Տիրոջը, ո՛վ նրա սրբեր, գոհութի՛ւն մատուցեցէք նրա սուրբ յիշատակին։ "},
	{6, "6 Նրա բարկութեան մէջ ցասում կայ, իսկ նրա կամեցողութեան մէջ՝ կեանք։ Երեկոյեան լացը կը դադարի, իսկ առաւօտեան ուրախութիւն կը լինի։ "},
	{7, "7 Իմ բարկութեան մէջ ես ասացի, թէ յաւէտ չեմ սասանուի։ "},
	{8, "8 Տէ՛ր, քո կամքով ուժ տուիր իմ վայելչութեանը, բայց երբ երեսդ դարձրիր ինձնից, ես խռովայոյզ եղայ։ "},
	{9, "9 Քե՛զ կանչեցի, Տէ՛ր, աղաչեցի իմ Աստծուն։ "},
	{10, "10 Ի՞նչ օգուտ ունես իմ արիւնից, եթէ ապականութեան գբի մէջ թաղուեմ։ Միթէ հողը գոհութի՞ւն կը մատուցի քեզ կամ կը պատմի՞ քո ճշմարտութիւնը։ "},
	{11, "11 Լսեց ինձ Տէրն ու ողորմեց, Տէրը եղաւ իմ օգնականը։ "},
	{12, "12 Սուգս դարձրեց ուրախութիւն, հանեց քուրձն իմ եւ խնդութիւն հագցրեց ինձ, "},
	{13, "13 փառքս սաղմոս պիտի երգի քեզ, որպէսզի այլեւս չզղջամ ես։ Տէ՛ր իմ Աստուած, յաւիտեան գոհութիւն պիտի մատուցեմ քեզ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view30() {
struct hy30 poems[] = {
	{1, "1 Այսուհետեւ՝ Դաւթի հերոսութեան գովքի սաղմոսը "},
	{2, "2 Յոյսս դրի քեզ վրայ, Տէ՛ր, թող յաւէտ ամօթով չմնամ. քո արդարութեամբ փրկի՛ր եւ ազատի՛ր ինձ։ "},
	{3, "3 Դէպի ի՛նձ խոնարհիր ականջը քո, փութա՛ ինձ պաշտպանելու։ Եղի՛ր իմ պահապանը, Աստուա՛ծ, եւ իմ փրկութեան ապաստարանը, քանզի իմ ուժն ու ապաւէնն ես դու։ "},
	{4, "4 Քո անուան համար ինձ առաջնորդ եղար եւ սնուցեցիր ինձ։ "},
	{5, "5 Ինձ կը հանես այն որոգայթից, որ լարեցին իմ դէմ։ "},
	{6, "6 Դու ես պաշտպանն իմ, Տէ՛ր, եւ քո ձեռքն եմ յանձնում իմ հոգին։ Տէ՛ր Աստուած, փրկեցիր ինձ քո ճշմարտութեամբ։ "},
	{7, "7 Ատեցիր նրանց, ովքեր երկիւղ են կրում սնոտիաբար։ "},
	{8, "8 Ես յոյսս դրի Տիրոջ վրայ, պիտի ցնծամ եւ ուրախանամ քո տուած փրկութեամբ։ Տեսար իմ նուաստացումն ու ինձ փրկեցիր վշտերից։ "},
	{9, "9 Ինձ չմատնեցիր նեղիչներիս ձեռքըեւ ոտքերս լայնարձակ վայրում հաստատեցիր։ "},
	{10, "10 Ողորմի՛ր ինձ, Տէ՛ր, քանզի ճնշուած եմ ես. սրտնեղութիւնից խռոված են իմ աչքը, հոգին ու որովայնը։ "},
	{11, "11 Կեանքս սպառուեց վիշտ ու ցաւերով, եւ տարիներս՝ հոգոց հանելով։ Թշուառութիւնից տկարացաւ ուժն իմ, եւ ոսկորներս մաշուեցին։ "},
	{12, "12 Իմ բոլոր թշնամիներից աւելի ես դրացիների՛ս համար նախատինք եղայ եւ ծանօթներիս համար՝ սոսկալի ահ ու սարսափ։ Բոլոր նրանք, ովքեր տեսնում էին ինձ, հեռու էին փախչում ինձնից։ "},
	{13, "13 Սրտերից մոռացուեցի ես ինչպէս մեռեալ եւ նմանուեցի անպէտք անօթի, "},
	{14, "14 քանզի բամբասանք լսեցի շատերից, որոնք իմ շուրջն էին։ Հաւաքուած իրար գլխի՝ նրանք ուզում էին առնել իմ հոգին։ "},
	{15, "15 Բայց ես, Տէ՛ր, յոյսս դրի քե՛զ վրայ՝ ասելով. Դո՛ւ ես Աստուածն իմ, "},
	{16, "16 եւ քո ձեռքում է իմ ժառանգութիւնը։ Փրկի՛ր ինձ թշնամիներիս ձեռքից եւ իմ հալածիչներից։ "},
	{17, "17 Ցո՛յց տուր երեսդ քո այս ծառային, պահպանի՛ր ինձ, Տէ՛ր, քո ողորմութեամբ։ "},
	{18, "18 Տէ՛ր, ամօթով թող չմնամ, որ քեզ դիմեցի. թող ամբարիշտնե՛րն ամաչեն ու դժոխք իջնեն։ "},
	{19, "19 Եւ թող պապանձուեն նենգ շրթունքները, որոնք ամբարտաւանութեամբ եւ արհամարհանքով չարախօսում են արդարի մասին։ "},
	{20, "20 Որքա՜ն շատ է քո ողորմութեան քաղցրութիւնը, Տէ՛ր, որ պահեցիր երկիւղածներիդ համար։ Դու այն շնորհեցիր նրանց, որոնք իրենց յոյսը դրել են քեզ վրայմարդկանց որդիների առջեւ։ "},
	{21, "21 Մարդկանց խռովութիւնից պաշտպանեցիր նրանց քո երեսի ծածկոյթով, լեզուների հակառակութիւնից թաքցրիր նրանց քո վրանում։ "},
	{22, "22 Օրհնեալ է Տէրը, քանզի ողորմութիւնն իր հրաշագործեց ամուր քաղաքում։ "},
	{23, "23 Շփոթութեան մէջ ես ասացի, թէ այլեւս հեռու մնացի աչքերիդ առջեւից։ Սակայն դու լսեցիր ձայնն իմ աղօթքի, երբ աղաղակեցի քեզ։ "},
	{24, "24 Սիրեցէ՛ք Տիրոջը, բոլոր սրբե՛րդ նրա, քանզի Տէրը ճշմարտութիւն է փնտռում եւ խստութեամբ հատուցում նրանց, ովքեր շատ են ամբարտաւանանում։ "},
	{25, "25 Քաջալերուեցէ՛ք ամէքդ, որ յոյս էք դրել Տիրոջ վրայ, եւ ձեր սրտերը թող զօրանան։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view31() {
struct hy31 poems[] = {
	{1, "1 Երանի նրան, ում մեղքերին թողութիւն տրուեց եւ ում բոլոր յանցանքները ծածկուեցին։ "},
	{2, "2 Երանի այն մարդուն, որին Տէրն այլեւս մեղաւոր չի համարում, եւ որի բերանում նենգութիւն չկայ։ "},
	{3, "3 Ես լռեցի, եւ իմ բոլոր ոսկորները մաշուեցին՝ ամէն օր գիշեր-ցերեկ Տիրոջը կանչելուց։ "},
	{4, "4 Քո ձեռքը ծանրացաւ ինձ վրայ. ես կրկին ընկայ թշուառութեան մէջ, քանզի փշերն ինձ ծակեցին։ "},
	{5, "5 Մեղքերս քեզ ցոյց կը տամ, եւ անօրէնութիւնս չեմ ծածկի քեզնից։ Ասացի, թէ կը խոստովանեմ մեղքերն իմ, եւ դու թողութիւն կը տաս իմ մեղքերի ամբողջ ամբարշտութեանը։Հանգիստ։ "},
	{6, "6 Դրա համար բոլոր սրբերն յարմար ժամին աղօթքի կը կանգնեն քո առջեւ, եւ սաստիկ ջրհեղեղների ժամանակ նրանց ոչինչ չի պատահի։ "},
	{7, "7 Դու ես իմ յենարանն այն նեղութեան մէջ, որը շուրջս պատեց։ Ո՜վ ցնծութիւն իմ, փրկի՛ր ինձ նրանցից, ովքեր պաշարեցին ինձ։ "},
	{8, "8 Քեզ կ՚իմաստնացնեմ ու խելամիտ կը դարձնեմ քո ընթացած ճանապարհին եւ աչքերս վրադ կը պահեմ, ասում է Տէրը։ "},
	{9, "9 Մի՛ եղէք ձիերի եւ ջորիների պէս, որոնք գիտակցութիւն չունեն. սանձով ու պախուրցով պէտք է նրանց կզակը ճմլել, որ քեզ չմօտենան։ "},
	{10, "10 Շատ են մեղաւորների տանջանքները, բայց ովքեր իրենց յոյսը դրել են Տիրոջ վրայ, Տիրոջ ողորմութիւնը կը պարուրի նրանց։ "},
	{11, "11 Ուրա՛խ եղէք եւ ցնծացէ՛ք Տիրոջով, ո՛վ արդարներ. պարծեցէ՛ք բոլորդ, որ ուղիղ էք սրտով։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view32() {
struct hy32 poems[] = {
	{1, "1 Ցնծացէ՛ք, արդարնե՛ր, Տիրոջով. արդարներին է վայել օրհնութիւնը։ "},
	{2, "2 Գոհութի՛ւն յայտնեցէք Տիրոջը օրհներգութեամբ, տասլարանի նուագարանով սաղմո՛ս երգեցէք նրան։ "},
	{3, "3 Օրհներգեցէ՛ք Տիրոջը նոր օրհներգով, քանզի հաճելի է այն։ Սաղմո՛ս երգեցէք նրան օրհնութեամբ։ "},
	{4, "4 Ճշմարիտ են Տիրոջ պատգամները, եւ յուսալի՝ նրա բոլոր գործերը։ "},
	{5, "5 Տէրը ողորմութիւն եւ իրաւունք է սիրում, Տիրոջ ողորմութեամբ է լցուած երկիրը։ "},
	{6, "6 Տիրոջ խօսքով ստեղծուեց երկինքը, եւ իր բերանի շնչով՝ նրա բոլոր զօրութիւնները։ "},
	{7, "7 Ինչպէս մի տիկի մէջ՝ հաւաքեց ծովի ջրերը եւ իր գանձը դրեց անդունդների յատակը։ "},
	{8, "8 Թող երկիւղ կրի Տիրոջից ողջ երկիրը, եւ նրանից թող դողան բոլոր բնակիչներն աշխարհի, "},
	{9, "9 քանզի Նա ասաց՝ եւ ստեղծուեցին, Նա հրամայեց՝ եւ հաստատուեցին։ "},
	{10, "10 Տէրը խափանում է հեթանոսների մտադրութիւնները, Տէրն անարգում է ժողովուրդների դիտաւորութիւնները, Տէրն արհամարհում է իշխանների խորհուրդները։ "},
	{11, "11 Տիրոջ մտածումը յաւիտեան կը մնայ, եւ նրա սրտի խորհուրդը՝ սերնդից սերունդ։ "},
	{12, "12 Երանի այն ազգին, որի օգնականը Տէր Աստուած է, երանի այն ժողովրդին, որին իր համար նա ժառանգութիւն ընտրեց։ "},
	{13, "13 Տէրը երկնքից նայեց բոլոր մարդկանց որդիներին։ "},
	{14, "14 Իր պատրաստած բնակատեղից դիտեց աշխարհի բոլոր բնակիչներին։ "},
	{15, "15 Նա, որ ստեղծել է նրանցից իւրաքանչիւրի սիրտը, հաշուի է առնում նրանց բոլոր գործերը։ "},
	{16, "16 Թագաւորն իր զօրքի բազմութեամբ չի փրկուի, եւ ոչ էլ հսկան՝ իր մեծ ուժով։ "},
	{17, "17 Ձին անօգուտ է փրկութեան համար, իր մեծ ուժով հանդերձ չի փրկի հեծեալին։ "},
	{18, "18 Տիրոջ աչքն իր երկիւղածների եւ իր ողորմութեանը յուսացողների վրայ է՝ "},
	{19, "19 մահից փրկելու նրանց անձըեւ սովի ժամանակ կերակրելու համար նրանց։ "},
	{20, "20 Մեր հոգիներն սպասում են Տիրոջը, քանզի նա մեր օգնականն է ու պաշտպանը։ "},
	{21, "21 Նրանով թող ուրախանան մեր սրտերը, եւ մենք նրա սուրբ անուան վրայ յոյս դնենք։ "},
	{22, "22 Թող ողորմութիւնդ, Տէ՛ր, լինի մեզ վրայ, ինչպէս որ մեր յոյսը դրինք քեզ վրայ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view33() {
struct hy33 poems[] = {
	{1, "1 Սաղմոս Դաւթի, երբ նա կերպարանափոխեց իր դէմքը Աբիմելէքի առջեւ, եւ սա բաց թողեց նրան, որ գնայ։ "},
	{2, "2 Ամէն ժամ Տիրոջն օրհներգեմ, նրա օրհնութիւնն ամէն ժամ բերանումս լինի։ "},
	{3, "3 Անձս Տիրոջով թող պարծենայ, հեզերը թող լսեն եւ ուրախանան։ "},
	{4, "4 Մեծարեցէ՛ք Տիրոջն ինձ հետ մէկտեղ, բարձրացնենք նրա անունը միասին։ "},
	{5, "5 Խնդրեցի Տիրոջն, ու նա լսեց ինձ եւ իմ բոլոր նեղութիւններից փրկեց ինձ։ "},
	{6, "6 Մօտեցէ՛ք Տիրոջն ու լո՛յս առէք, եւ թող ձեր երեսը չամաչի։ "},
	{7, "7 Աղքատն այս Տիրոջը դիմեց, եւ Տէրը նրան լսեց ու իր բոլոր նեղութիւններից փրկեց նրան։ "},
	{8, "8 Տիրոջ հրեշտակների բանակն իր երկիւղածների շուրջն է եւ պահպանում է նրանց։ "},
	{9, "9 Ճաշակեցէ՛ք եւ տեսէ՛ք, թէ որքան քաղցր է Տէրը. երանելի է այն մարդը, որ յոյսը դրել է նրա վրայ։ "},
	{10, "10 Վախեցէ՛ք Տիրոջից, բոլոր սրբե՛րդ նրա, քանզի նրանից վախեցողները ոչ մի պակասութիւն չեն ունենայ։ "},
	{11, "11 Մեծամեծներն աղքատացան ու սովի մատնուեցին, բայց ովքեր Տիրոջն են փնտռում, նրանցից ոչ մի բարիք չի պակասելու։ "},
	{12, "12 Եկէ՛ք, իմ որդինե՛ր, եւ լսեցէ՛ք ինձ.ես կը սովորեցնեմ ձեզ Տիրոջ երկիւղը։ "},
	{13, "13 Ո՞վ է մարդն այն, որ սիրում է կեանքը, եւ ուզում է իր օրերը բարութեան մէջ տեսնել։ "},
	{14, "14 Լեզուդ պահի՛ր չարութիւնից, եւ շրթներդ թող նենգութիւն չխօսեն։ "},
	{15, "15 Խուսափի՛ր չարից ու բարի՛ք գործիր, խաղաղութիւն փնտռիր եւ դրա՛ն հետեւիր։ "},
	{16, "16 Տիրոջ աչքերն ուղղուած են արդարներին, իսկ ականջները՝ նրանց աղօթքին։ "},
	{17, "17 Տիրոջ հայեացքը չարագործների վրայ է՝ նրանց յիշատակն աշխարհից ջնջելու համար։ "},
	{18, "18 Արդարները Տիրոջը աղօթեցին, եւ Տէրը լսեց նրանց ու փրկեց նրանց իրենց բոլոր նեղութիւններից։ "},
	{19, "19 Տէրը նրանց կողքին է, ովքեր սրտամաշ են եղել, եւ նա փրկում է հոգով խոնարհներին։ "},
	{20, "20 Արդարների նեղութիւնները շատ են, Տէրն ազատում է նրանց այդ բոլորից։ "},
	{21, "21 Պահպանում է նրանց բոլոր ոսկորները, եւ դրանցից ոչ մէկը չի փշրուելու։ "},
	{22, "22 Մեղաւորի մահը չարաչար է, իսկ արդարին ատողը կը զղջայ։ "},
	{23, "23 Տէրը փրկում է իր ծառաներին, եւ բոլոր նրանք, որ յոյս են դնում Նրա վրայ, չպիտի զղջան։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view34() {
struct hy34 poems[] = {
	{1, "1 Տէ՛ր, դատի՛ր նրանց, ովքեր դատում են ինձ, մարտնչի՛ր նրանց դէմ, ովքեր մարտնչում են իմ դէմ։ "},
	{2, "2 Ա՛ռ զէնքն ու զրահը քո եւ հասի՛ր ինձ օգնութեան։ "},
	{3, "3 Սուրդ հանի՛ր ընդդէմ իմ հալածիչների, վանի՛ր նրանց եւ ասա՛ ինձ, թէ՝ Քո փրկութիւնը ես եմ։ "},
	{4, "4 Թող խայտառակուեն ու ամօթով մնան ինձ հետապնդողները, թող ընկրկեն եւ ամօթահար լինեն ինձ չար կամեցողները։ "},
	{5, "5 Նրանք թող վերածուեն հողմից քշուող փոշու, եւ թող Տիրոջ հրեշտակը չարչարի նրանց։ "},
	{6, "6 Նրանց ճանապարհը թող խաւար լինի ու սայթաքուն, եւ Աստծու հրեշտակը թող հալածի նրանց։ "},
	{7, "7 Իզուր որոգայթ լարեցին իմ դէմ իրենց ապականութեամբ, եւ իզուր նախատեցին ինձ։ "},
	{8, "8 Նրանց վրայ կը հասնի մի որոգայթ, որի մասին չգիտեն նրանք. իրենց թաքցրած թակարդը կը բռնի ոտքը նրանց, եւ նրանք կ՚ընկնեն այդ որոգայթի մէջ։ "},
	{9, "9 Իսկ հոգիս կը ցնծայ Տիրոջով, ուրախ կը լինի նրա տուած փրկութեամբ։ "},
	{10, "10 Իմ բոլոր ոսկորները կ՚ասեն. Տէ՛ր, ո՞վ է քեզ նման։ Նա փրկեց աղքատին բռնակալի ձեռքից, եւ խեղճին ու տնանկին՝ իրենց յափշտակողներից։ "},
	{11, "11 Իմ դէմ բարձրացան վկաները չար, հարցաքննեցին ինձ մինչ ես անտեղեակ էի։ "},
	{12, "12 Բարու փոխարէն չար հատուցեցին ինձ, խորհուրդ արին ինձ անժառանգ թողնել մարդկանց մէջ։ "},
	{13, "13 Նրանց հալածանքի ժամանակ ես քուրձ էի հագնում, ծոմով խղճալի էի դարձնում ինձ, եւ իմ աղօթքներն ինձ վերադարձան։ "},
	{14, "14 Եղբօր ու ընկերոջ նման սիրալիր էի, սգաւորի ու վշտացեալի պէս՝ խոնարհ։ "},
	{15, "15 Հաւաքուեցին ու չարախնդացին ինձ վրայ. տանջանքներ կուտակուեցին իմ դէմ, եւ ես չիմացայ. նրանք ցրուեցին, բայց չզղջացին. "},
	{16, "16 Փորձեցին ինձ ու անարգեցին, ատամներն իրենց արհամարհանքով կրճտեցրին իմ դէմ։ "},
	{17, "17 Տէ՛ր, մինչեւ ե՞րբ պիտի տեսնես։ Հեռո՛ւ պահիր ինձ նրանց խորամանկութիւնից, եւ միամօրիկիս՝ առիւծներից։ "},
	{18, "18 Գոհութիւն պիտի մատուցեմ քեզ, Տէ՛ր, մեծ հաւաքներում եւ ժողովրդի բազմութեան մէջ պիտի օրհներգեմ քեզ։ "},
	{19, "19 Թշնամիներն իմ թող վրաս չխնդան, նրանք, որ ատում էին ինձ առանց պատճառի եւ իրար աչք էին անում ինձ համար։ "},
	{20, "20 Հետս խաղաղութիւնից էին խօսում, բայց իրենք զայրացած՝ նենգութիւն էին խորհում։ "},
	{21, "21 Բացին ինձ վրայ բերաններն իրենց եւ ասացին. Այո՛, այո՛, մեր աչքերը տեսան։ "},
	{22, "22 Տէ՛ր, ինքդ տեսար, մի՛ լռիր. Տէ՛ր, մի հեռացի՛ր ինձանից։ "},
	{23, "23 Զարթնի՛ր, Տէ՛ր, նայի՛ր իմ իրաւունքին ու արդարութեանը, Աստուա՛ծ իմ եւ Տէ՛ր իմ։ "},
	{24, "24 Իմ դատն արա՛, արդարացրո՛ւ ինձ ըստ քո արդարութեան, ո՛վ Տէր իմ Աստուած։ Թշնամիներն իմ թող չուրախանան ինձանով։ "},
	{25, "25 Եւ չասեն իրենց մտքում. Երնէ՜կ, երնէ՜կ մեզ, քանզի խորտակեցինք նրան։ "},
	{26, "26 Թող խայտառակուեն ու ամօթով մնան ինձ հասած չարիքի համար ուրախացողները. թող նախատինք ու անարգանք կրեն իմ դէմ մեծախօսողները։ "},
	{27, "27 Բոլոր նրանք, ովքեր իմ արդարութիւնն են կամենում եւ քո ծառային խաղաղութիւն ցանկանում, թող ուրախութեամբ ցնծան քեզնով եւ միշտ ասեն՝ Մեծ է Աստուած։ "},
	{28, "28 Լեզուս պիտի քո արդարութիւնը պատմի եւ հանապազ քեզ գովաբանի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view35() {
struct hy35 poems[] = {
	{1, "1 Այսուհետեւ՝ Տիրոջ ծառայ Դաւթի սաղմոսը "},
	{2, "2 Անօրէնն ասում է իր մտքում մեղանչելիս,թէ իր աչքերի առջեւ Աստծու վախ չկայ։ "},
	{3, "3 Նա խորամանկութիւն է գործում նրա իսկ հանդէպ,որ չտեսնի իր անօրէնութիւնն ու չատի այն։ "},
	{4, "4 Նրա բերանի խօսքերն անարդար ու նենգամիտ են, նա չկամեցաւ հասկանալ բարին։ "},
	{5, "5 Անօրէնութիւն խորհեց իր անկողնում, կանգնեց այն բոլոր ուղիների վրայ, որոնք բարի չեն, եւ չարից չձանձրացաւ։ "},
	{6, "6 Տէ՛ր, երկնքում է քո ողորմութիւնը, իսկ ճշմարտութիւնդ՝ մինչեւ ամպերը։ "},
	{7, "7 Արդարութիւնդ, Աստուա՛ծ, լեռների պէս է, իրաւունքդ՝ խոր անդունդի պէս. մարդ ու անասուն դու ես ապրեցնում, Տէ՛ր։ "},
	{8, "8 Որքա՜ն առատ է քո ողորմութիւնն, Աստուա՛ծ, մարդկանց որդիները թեւերիդ հովանուն պիտի ապաւինեն։ "},
	{9, "9 Նրանք պիտի յագենան քո տան լիութիւնից, եւ նրանց պիտի խմեցնես քո գրգանքի գետերից։ "},
	{10, "10 Տէ՛ր, քեզնից է կեանքի աղբիւրը, եւ երեսիդ լոյսով ենք լոյսը տեսնում։ "},
	{11, "11 Ողորմութիւնդ շնորհի՛ր քեզ ճանաչողներին, եւ արդարութիւնդ՝ սրտով ուղիղներին։ "},
	{12, "12 Թող ամբարտաւանների ոտքը մեզ չհասնի, եւ մեղաւորների ձեռքը չդողացնի մեզ։ "},
	{13, "13 Այնտեղ բոլոր անօրէնութիւն գործողները պիտի ընկնեն,մերժուեն ու չկարողանան այլեւս ոտքի կանգնել։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view36() {
struct hy36 poems[] = {
	{1, "1 Սաղմոս Դաւթի "},
	{2, "2 Մի՛ նախանձիր չարամիտներին եւ ոչ էլ նրանց, ովքեր անօրէնութիւն են գործում, "},
	{3, "3 քանզի նրանք խոտի պէս իսկոյն կը չորանան, դալար խոտի պէս արագ կ՚անցնեն։ "},
	{4, "4 Յոյսդ դի՛ր Տիրոջ վրայ ու բարութի՛ւն գործիր, բնակուի՛ր երկրում եւ արածի՛ր նրա ընդարձակութեան մէջ։ "},
	{5, "5 Պաղատի՛ր Տիրոջը, եւ նա քեզ կը տայ սրտիդ ուզածները։ "},
	{6, "6 Յայտնի՛ դարձրու քո ճանապարհները Տիրոջըեւ դի՛ր յոյսդ նրա վրայ։ "},
	{7, "7 Նա այնպէս կ՚անի, որ արդարութիւնդ երեւայ ինչպէս լոյս, եւ իրաւունքդ՝ ինչպէս ցերեկ։ "},
	{8, "8 Հնազա՛նդ եղիր Տիրոջն ու ծառայի՛ր նրան. մի՛ նախանձիր նրանց, որոնց ճանապարհը նշաւակելի է, ոչ էլ այն մարդուն, որ անօրէնութիւն է գործում։ "},
	{9, "9 Դադարի՛ր բարկանալուց, հանդարտուի՛ր սրտմտութիւնիցեւ մի՛ նախանձիր չարամիտներին։ "},
	{10, "10 Չարագործները շուտով կը վերանան, իսկ Տիրոջն սպասողները կը ժառանգեն երկիրը։ "},
	{11, "11 Եւս մի փոքր ժամանակ, եւ այլեւս ամբարիշտ չի մնայ, կը փնտռես նրա տեղն ու չես գտնի։ "},
	{12, "12 Իսկ ովքեր հեզ են, նրանք կը ժառանգեն երկիրը եւ կը զուարճանան մեծ խաղաղութեան մէջ։ "},
	{13, "13 Մեղաւորը հետապնդում է արդարին եւ իր ատամներն է կրճտացնում նրա վրայ։ "},
	{14, "14 Բայց Տէրը կը ծիծաղի նրա վրայ, քանզի նախապէս գիտէ, որ հասել է նրա օրը։ "},
	{15, "15 Մեղաւորները սուր քաշեցին եւ լարեցին իրենց աղեղները՝ աղքատին ու տնանկին հարուածելու, սրտով խոնարհներին սպանելու համար։ "},
	{16, "16 Նրանց սրերը կը մխուեն իրենց սրտերը, եւ նրանց աղեղները կը փշրուեն։ "},
	{17, "17 Արդարի քիչն աւելի լաւ է, քան մեղաւորների մեծ հարստութիւնը։ "},
	{18, "18 Ամբարիշտների բազուկները կը խորտակուեն, եւ Տէրն արդարներին հաստատ կը պահի։ "},
	{19, "19 Նա գիտէ անմեղների օրերը, նրանց ժառանգութիւնը յաւիտեան կը լինի։ "},
	{20, "20 Փորձանքի ժամանակ նրանք ամօթով չեն մնայ, իսկ սովի օրերին կը յագենան։ "},
	{21, "21 Արդ, մեղաւորները կորստեան կը մատնուեն, եւ Տիրոջ թշնամիներն իրենց փառքի ու վերելքի ժամին կը սպառուեն, ինչպէս ծուխն է սպառւում։ "},
	{22, "22 Մեղաւորը փոխ է առնում ու չի վճարում, իսկ արդարը ողորմում է ու տալիս։ "},
	{23, "23 Ովքեր օրհնում են Տիրոջը, կը ժառանգեն երկիրը, իսկ ովքեր անիծում են, կը ջնջուեն Տիրոջ ձեռքով։ "},
	{24, "24 Տէրն ուղղում է այն մարդու ընթացքը, ով շատ է սիրում իր ճանապարհը։ "},
	{25, "25 Եթէ անգամ նա սայթաքի, չի կործանուի, քանզի Տէրը բռնել է նրա ձեռքը։ "},
	{26, "26 Մանուկ էի ես եւ ծերացայ, բայց արդարին արհամարհուած չտեսայ կամ նրա զաւակին՝ հաց մուրալիս։ "},
	{27, "27 Ամէն օր նա ողորմում ու փոխ է տալիս, նրա սերունդը յաւիտեան օրհնեալ կը լինի։ "},
	{28, "28 Խուսափի՛ր չարից ու բարութի՛ւն արա եւ յաւիտեան կ՚ապրես երկրի վրայ։ "},
	{29, "29 Տէրը սիրում է իրաւունքը, եւ իր սրբերին երեսի վրայ չի թողնում, այլ յաւիտեան պահպանում է նրանց։ Անօրէնները կը քշուեն կը գնան միասին, եւ ամբարիշտների սերունդը կ՚ոչնչանայ։ "},
	{30, "30 Իսկ արդարները կը ժառանգեն երկիրը եւ յաւիտեանս յաւիտենից կը բնակուեն նրա մէջ։ "},
	{31, "31 Արդարի բերանն իմաստութիւն է բարբառում, իսկ լեզուն արդարութիւն է խօսում։ "},
	{32, "32 Նրա սրտում իր Աստծու օրէնքն է, ուստի նրա երթն անսայթաք կը լինի։ "},
	{33, "33 Մեղաւորը նայում է արդարին եւ ձգտում սպանել նրան։ "},
	{34, "34 Սակայն Տէրը նրա ձեռքում չի թողնի նրան եւ դատաստանի ժամանակ նրան չի դատապարտի։ "},
	{35, "35 Սպասի՛ր Տիրոջն ու պահի՛ր նրա ճանապարհները, նա քեզ կը բարձրացնի՝ երկիրը ժառանգելու, եւ դու կը տեսնես մեղաւորների կործանումը։ "},
	{36, "36 Տեսայ ամբարշտին մեծացած ու բարձրացած, ինչպէս Լիբանանի մայրիները։ "},
	{37, "37 Ես մօտով անցայ, եւ ահա նա չկար, փնտռեցի՝ ու նրա տեղը չերեւաց։ "},
	{38, "38 Անարա՛տ ապրիր եւ նայի՛ր արդարութեանը, քանզի խաղաղասէր մարդը ժառանգութիւն կ՚ունենայ։ "},
	{39, "39 Անօրէնները կը քշուեն կը գնան գլխովին, եւ ամբարիշտների սերունդը կորստեան կը մատնուի։ "},
	{40, "40 Արդարների փրկութիւնը Տիրոջից է, նեղութեան ժամանակ նա է նրանց օգնականը։ "},
	{41, "41 Տէրը կ՚օգնի ու կը փրկի նրանց, կ՚ազատի մեղաւորներից ու կը պահպանի նրանց,քանզի նրանք իրենց յոյսը դրել են Նրա վրայ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view37() {
struct hy37 poems[] = {
	{1, "1 Սաղմոս Դաւթի՝ շաբաթօրեայ յիշատակի առթիւ "},
	{2, "2 Տէ՛ր, քո զայրոյթով մի՛ յանդիմանիր ինձ եւ քո բարկութեամբ ինձ մի՛ խրատիր, "},
	{3, "3 քանզի քո նետերն ինձ հարուածեցին, եւ քո ձեռքն ինձ վրայ ծանրացաւ։ "},
	{4, "4 Մարմնիս համար բուժում չկայ քո բարկութեան դէմ, ոսկորներս հանգստութիւն չունեն իմ մեղքերի պատճառով։ "},
	{5, "5 Անօրէնութիւններս գլխիցս վեր բարձրացան, սաստիկ բեռան պէս ծանրացան վրաս։ "},
	{6, "6 Վէրքերն իմ նեխեցին ու փտեցին անզգամութեանս հետեւանքով։ "},
	{7, "7 Տառապեցի եւ խիստ նուաստացայ, գիշեր-ցերեկ շրջեցի վշտացած, "},
	{8, "8 քանզի հոգիս լցուեց տանջանքներով, եւ մարմնիս համար բուժում չկայ։ "},
	{9, "9 Չարչարուեցի եւ սաստիկ կորացայ, մռնչացի սրտիս հեծութիւնից։ "},
	{10, "10 Տէ՛ր, ամբողջ ցանկութիւնս առջեւդ է, եւ հառաչանքս չծածկուեց քեզնից։ "},
	{11, "11 Սիրտս պղտորուեց իմ մէջ, եւ ուժս լքեց ինձ, աչքերիս մէջ լոյսի նշոյլ իսկ չմնաց։ "},
	{12, "12 Բարեկամներս եւ ընկերներս մօտեցան ու կանգնեցին իմ առջեւ, եւ մերձաւորներս ինձնից հեռու մնացին։ "},
	{13, "13 Ինձ հետապնդողները բռնադատեցին ինձ, իմ դէմ չարիք նիւթողները անօրէնութիւն խօսեցին, եւ գիշեր-ցերեկ նենգութիւն մտածեցին։ "},
	{14, "14 Իսկ ես դարձայ ինչպէս խուլ, որ չի լսում, ինչպէս համր, որ բերանն իր չի բացում։ "},
	{15, "15 Ես դարձայ ինչպէս մարդ, որ չի լսում, եւ որի բերանում խօսք չկայ։ "},
	{16, "16 Ես յոյսս քեզ վրայ դրի, ո՛վ Տէր, ու դու կը լսես ինձ, Տէ՛ր իմ Աստուած։ "},
	{17, "17 Ասացի՝ Թող թշնամիներս չծիծաղեն վրաս. երբ ոտքս սայթաքեց, նրանք յոխորտացին իմ դէմ։ "},
	{18, "18 Ես պատրաստ եմ տանջանքների, եւ իմ ցաւերը միշտ առջեւս են։ "},
	{19, "19 Կը պատմեմ իմ անօրէնութիւնները եւ կը հոգամ իմ մեղքերի մասին։ "},
	{20, "20 Բայց թշնամիներն իմ ողջ են ու աւելի հզօր, քան ես, եւ բազմացել են նրանք, ովքեր յանիրաւի ատում են ինձ, "},
	{21, "21 ովքեր ինձ չարութեամբ հատուցեցին բարու փոխարէն եւ չարախօսեցին իմ մասին, քանզի ես արդարութեամբ էի ընթանում։ "},
	{22, "22 Մի՛ լքիր ինձ, Տէ՛ր իմ Աստուած, եւ մի՛ հեռացիր ինձնից։ "},
	{23, "23 Ո՛ւշ դարձրու, որ ինձ օգնես, ո՛վ իմ փրկիչ Տէր։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view38() {
struct hy38 poems[] = {
	{1, "1 Այսուհետեւ՝ օրհնութիւն Իդիթոմին "},
	{2, "2 Ասացի՝ Զգուշանամ իմ ճանապարհին, որ լեզուովս չմեղանչեմ։ Բերանիս պահպանակ դրի, երբ մեղաւորը հակառակուեց ինձ։ "},
	{3, "3 Խուլ եղայ եւ խոնարհ դարձայ, բարիքս լռութեան մատնեցի, եւ ցաւերս նորոգուեցին իմ մէջ։ "},
	{4, "4 Սիրտս կրակ կտրեց իմ ներսում, եւ մտքիս մէջ հուր բորբոքուեց։ "},
	{5, "5 Խօսեցի լեզուովս եւ ասացի. Տէր, ցո՛յց տուր ինձ, թէ ե՞րբ է իմ վախճանը, եւ որքան է կեանքիս օրերի թիւը, որպէսզի իմանամ, թէ ինչքան կորուստ եմ ունեցել։ "},
	{6, "6 Ահա սահման դրիր իմ օրերին, եւ կարողութիւնս ոչինչ է իմ աչքում, բոլորովին ոչնչութիւն է ամէն մարդ, որ մարմին ունի։ "},
	{7, "7 Արդարեւ, մարդ շրջում է ինչպէս մի ուրուական. բայց իզուր է նա տագնապում, գանձ կուտակում՝ չիմանալով, թէ ում համար։ "},
	{8, "8 Իսկ արդ, ո՞վ է իմ համբերութիւնը, եթէ ոչ դու, Տէ՛ր, կամ իմ ուժն ու կարողութիւնը քեզնից չէ՞ միթէ։ "},
	{9, "9 Բոլոր յանցանքներիցս փրկեցիր եւ անզգամների համար նախատինք դարձրիր ինձ։ "},
	{10, "10 Ես խուլ եղայ եւ չբացեցի բերանն իմ, քանզի դու էիր գործում։ "},
	{11, "11 Հեռացրո՛ւ ինձնից իմ տանջանքները, որովհետեւ քո ձեռքի զօրութիւնից հիւծուեցի ես։ "},
	{12, "12 Մեղքերի համար կշտամբելով՝ խրատեցիր դու մարդուն, սարդոստայնի պէս մաշեցիր նրան, բայց սուտ է ամէն մարդ։ Հանգիստ։ "},
	{13, "13 Տէ՛ր, լսի՛ր իմ աղօթքը, ակա՛նջ դիր խնդրանքներիս եւ արտասուքս լռութեան մի՛ մատնիր։ Պանդուխտ եմ ես քո առաջ, օտարական եւ անցորդ, ինչպէս իմ բոլոր նախնիները։ "},
	{14, "14 Թո՛յլ տուր ինձ, որ հանգստանամ, մինչեւ իմ գնալն այնտեղ, ուր այլեւս չեմ լինի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view39() {
struct hy39 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի "},
	{2, "2 Համբերութեամբ սպասեցի Տիրոջը, եւ նա նայեց ինձ ու լսեց իմ աղօթքը։ "},
	{3, "3 Նա ինձ հանեց տառապանքի փոսից, ցեխից ու տիղմից. ոտքերս ժայռի վրայ հաստատեց եւ ուղղեց իմ քայլերը։ "},
	{4, "4 Բերանս դրեց մի նոր օրհներգ՝ օրհներգը մեր Տէր Աստծու։Շատերը պիտի տեսնեն ու վախենան եւ իրենց յոյսը դնեն Տիրոջ վրայ։ "},
	{5, "5 Երանի այն մարդուն, որի յոյսը Տիրոջ անունն է, եւ որը ունայնութեանն ու սուտ մոլորութեանն ուշ չի դարձրել։ "},
	{6, "6 Բազում են քո սքանչելիքները, Տէ՛ր իմ Աստուած, քո խորհուրդներում ոչ ոք նման չէ քեզ։ Պատմեցի ու խօսեցի դրանց մասին, բայց դրանք անթիւ են։ "},
	{7, "7 Զոհերն ու ընծաները հաճելի չեղան քեզ, ինձ լսողութիւն տուիր եւ ողջակէզ ու մեղայագին չպահանջեցիր։ "},
	{8, "8 Այն ժամանակ ասացի, թէ՝ Ահա գալիս եմ ես, գրքի գլուխներում գրուած է իմ մասին։ "},
	{9, "9 Ուզեցի կամքդ կատարել, Աստուա՛ծ իմ, եւ օրէնքդ, որ իմ ներսում է։ "},
	{10, "10 Մեծ հաւաքներում ես քո արդարութիւնն աւետեցի, եւ արդ շրթունքներս չեմ կտրում քեզնից։ "},
	{11, "11 Տէ՛ր, դու գիտես, որ քո արդարութիւնը, քո ճշմարտութիւնն ու փրկութիւնը ծածուկ չեմ պահել իմ սրտում, պատմել եմ եւ մեծ հաւաքներից չեմ թաքցրել քո ողորմութիւնն ու ճշմարտութիւնը։ "},
	{12, "12 Իսկ դու, Տէ՛ր, գթութիւնդ հեռու մի՛ պահիր ինձնից, քո ողորմութիւնն ու ճշմարտութիւնը միշտ պահապան լինի ինձ։ "},
	{13, "13 Ինձ պաշարեցին չարիքներ, որոնք անթիւ էին. անօրէնութիւններս ինձ վրայ հասան, եւ ես չկարողացայ նկատել. գլխիս մազերից աւելի շատ եղան դրանք, եւ սիրտս ինձ լքեց։ "},
	{14, "14 Կամեցի՛ր փրկել ինձ, Տէ՛ր, նայի՛ր, որ օգնես ինձ, Տէ՛ր։ "},
	{15, "15 Թող խայտառակուեն ու ամօթահար լինեն նրանք, որ ուզում էին կործանել ինձ. թող ետ դառնան ու ամօթով մնան ինձ չար կամեցողները։ "},
	{16, "16 Թող շուտափոյթ անարգանք կրեն նրանք, որ չարախնդում էին իմ դէմ։ "},
	{17, "17 Թող քեզանով ցնծան ու ուրախանան բոլոր նրանք, որ փնտռում են քեզ, Տէ՛ր։ Քո տուած փրկութիւնը սիրողներն ամէն ժամ թող ասեն՝ Մեծ է Աստուած։ "},
	{18, "18 Ես աղքատ եմ եւ տնանկ, Աստուա՛ծ, հո՛գ տար իմ մասին. իմ օգնականն ու պաշտպանը դու ես. Աստուած իմ, մի՛ ուշացիր։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view40() {
struct hy40 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի "},
	{2, "2 Երանի նրան, ով մտածում է աղքատի ու տնանկի մասին. փորձանքի օրը Տէրը կը փրկի նրան։ "},
	{3, "3 Տէրը կը փրկի ու կը պահպանի նրան, երանելի կը դարձնի երկրի երեսին եւ չի մատնի նրան իր թշնամիների ձեռքը։ "},
	{4, "4 Տէրը նրան կ՚օգնի տառապանքի մահճում եւ նրա անկողինն ամբողջովին կը մաքրի իր հիւանդութիւնից։ "},
	{5, "5 Ես ասացի. Տէ՛ր, ողորմի՛ր ինձ եւ բուժի՛ր անձն իմ, ես մեղանչեցի քո դէմ։ "},
	{6, "6 Թշնամիներս չարութեամբ ասացին իմ մասին. Ե՞րբ պիտի մեռնի նա, եւ նրա անունը ջնջուի։ "},
	{7, "7 Ինձ այցելութեան եկողը դատարկ բաներ էր խօսում իր սրտում, անօրէնութիւն կուտակում իր մէջ, դուրս էր գալիս եւ նոյն բանն էր պատմում։ "},
	{8, "8 Բոլոր թշնամիներս քրթմնջեցին իմ մասին եւ չարիք նիւթեցին իմ դէմ։ "},
	{9, "9 Նրանք անօրէն խօսքեր բարդեցին ինձ վրայ. Ով ննջում է, մի՞թէ այլեւս յարութիւն չի՞ առնի։ "},
	{10, "10 Անգամ իմ բարեկամ մարդը, որին ես վստահում էի, եւ որն ուտում էր հացն իմ, յաճախակի իմ դէմ խաբէութիւն գործեց։ "},
	{11, "11 Բայց դու, Տէ՛ր, ողորմի՛ր եւ ոտքի՛ կանգնեցրու ինձ, որ հատուցեմ նրանց։ "},
	{12, "12 Եթէ թշնամիներս չչարախնդան վրաս, դրանից ես կ՚իմանամ, որ բարեհաճ ես իմ հանդէպ։ "},
	{13, "13 Դու իմ անմեղութեան համար ընդունեցիր ինձ եւ յաւիտեան հաստատեցիր քո առջեւ։ "},
	{14, "14 Օրհնեալ լինի Տէր Աստուածն Իսրայէլի յաւիտեանս յաւիտենից. ամէն, ամէն։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view41() {
struct hy41 poems[] = {
	{1, "1 Այսուհետեւ՝ Կորխի որդիների իմաստութիւնը "},
	{2, "2 Ինչպէս եղջերուն ջրի ակունքներին է փափագում, այնպէս էլ ես քեզ եմ փափագում, ո՛վ Աստուած. "},
	{3, "3 հոգիս ծարաւ է քեզ, Աստուած հզօր եւ կենդանի. ե՞րբ պիտի գամ ու երեւամ Աստծու առաջ։ "},
	{4, "4 Գիշեր-ցերեկ իմ արցունքներով սնուեցի, քանզի ամէն օր ինձ ասում էին. Քո Աստուածն ո՞ւր է։ "},
	{5, "5 Դա յիշելիս՝ հոգիս տառապում էր իմ ներսում, բայց քաջալերւում էի, որ պիտի մտնեմ Աստծու տան սքանչելի յարկի տակ,ցնծութեան ու օրհնութեան ձայնով եւ ձայնով բարեբանութեան։ "},
	{6, "6 Արդ, ինչո՞ւ ես տրտմում, հոգի՛ իմ, կամ ինչո՞ւ ես խռովեցնում ինձ. յոյսդ դի՛ր Աստծու վրայ, օրհներգի՛ր նրան,իմ անձը փրկողն Աստուած է։ "},
	{7, "7 Հոգին իմ խիստ խռովուեց, դրա համար քեզ յիշեցի Յորդանանի երկրից ու Հերմոնի փոքր սարից։ "},
	{8, "8 Անդունդից քեզ կանչեցին քո յորձանքների ձայնով։ Քո բոլոր կոհակներն ու ալիքներն անցան իմ վրայով։ "},
	{9, "9 Ցերեկը Տէրն իր ողորմութիւնը հաստատեց. գիշերը՝ նոր օրհներգութիւն. ես աղօթում եմ Աստծուն իմ կեանքի համար։ "},
	{10, "10 Աստծուն ասացի. Ինձ ընդունողը դու ես, ինչո՞ւ մերժեցիր ինձ, ինչո՞ւ տխուր լինեմ թշնամուս հալածանքի ժամանակ։ "},
	{11, "11 Երբ ոսկորներս փշրուեցին, թշնամիներն իմ նախատեցին ինձ՝ ամէն օր ասելով. Քո Աստուածն ո՞ւր է։ "},
	{12, "12 Արդ, ինչո՞ւ ես տրտմում, հոգի՛ իմ, կամ ինչո՞ւ ես ինձ խռովեցնում. յոյսդ դի՛ր Աստծու վրայ, օրհներգի՛ր նրան, իմ անձը փրկողն Աստուած է։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view42() {
struct hy42 poems[] = {
	{1, "1 Դատի՛ր ինձ, Աստուա՛ծ, եւ դատաստանիս ժամին արդարացրո՛ւ ինձ։ Անսուրբ ազգից, մեղսագործ ու նենգ մարդուց փրկի՛ր ինձ։ "},
	{2, "2 Դու ինձ ուժ տուողն ես, Աստուա՛ծ, ինչո՞ւ ինձ մոռացար, ինչո՞ւ տխուր լինեմ,երբ թշնամիս ինձ հալածի։ "},
	{3, "3 Առաքի՛ր, Տէ՛ր, քո լոյսն ու ճշմարտութիւնը, որ ինձ առաջնորդեն եւ հասցնեն քո սուրբ լեռն ու օթեւանը։ "},
	{4, "4 Ես կը մօտենամ Աստծու սեղանին, Աստծուն, որ երջանկացնում է իմ երիտասարդութիւնը։ Գոհութիւն կը մատուցեմ քեզ օրհներգերով, Աստուա՛ծ, Աստուա՛ծ իմ։ "},
	{5, "5 Արդ, ինչո՞ւ ես տրտմում, հոգի՛ իմ, կամ ինչո՞ւ ես ինձ խռովեցնում, յոյսդ դի՛ր Աստծու վրայ, օրհներգի՛ր նրան, նա իմ փրկիչ Աստուածն է։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view43() {
struct hy43 poems[] = {
	{1, "1 Այսուհետեւ՝ Կորխի որդիների իմաստութիւնը.սաղմոս Դաւթի "},
	{2, "2 Աստուա՛ծ, մեր ականջներով լսեցինք, մեր հայրերը մեզ պատմեցին այն գործը, որ կատարեցիր նրանց օրերում՝ հին օրերում։ "},
	{3, "3 Քո ձեռքն արմատախիլ արեց հեթանոսներին,եւ նրանց փոխարէն մե՛զ տնկեցիր, հաստատեցիր. չարչարեցիր ժողովուրդներին ու արտաքսեցիր նրանց։ "},
	{4, "4 Նրանք երկիրն իրենց սրով չժառանգեցին, ոչ էլ իրենց բազուկն էր, որ նրանց փրկեց, այլ՝ քո աջը, քո բազուկը եւ քո երեսի լոյսը, քանզի դու բարեհաճ եղար նրանց հանդէպ։ "},
	{5, "5 Դու ինքդ ես իմ թագաւորն ու իմ Աստուածը, որ Յակոբի փրկութեան հրամանն արձակեց։ "},
	{6, "6 Քեզնո՛վ պիտի կործանենք մեր թշնամիներին, եւ քո անուամբ արհամարհենք մեր դէմ ելնողներին։ "},
	{7, "7 Յոյսս չեմ դրել իմ աղեղի վրայ, եւ ոչ էլ սուրս պիտի փրկի ինձ։ "},
	{8, "8 Այլ դու փրկեցիր մեզ մեր թշնամիներից եւ մեզ ատողներին ամօթահար արեցիր։ "},
	{9, "9 Հանապազ Աստուծով պարծենանք եւ յաւիտեան գոհութիւն մատուցենք նրա անուանը։ "},
	{10, "10 Սակայն դու մերժեցիր ու խայտառակեցիր մեզ եւ մեր զօրքերի հետ մարտի չելար, ո՛վ Աստուած։ "},
	{11, "11 Մեզ յետ մղեցիր մեր թշնամիներից, եւ մեզ ատողները մեզ կողոպտեցին։ "},
	{12, "12 Մեզ ոչխարի պէս մորթելու յանձնեցիր եւ մեզ ցրեցիր հեթանոսների մէջ։ "},
	{13, "13 Քո ժողովրդին վաճառեցիր ոչինչ գնով, եւ մեր աղաղակը չափ չունեցաւ։ "},
	{14, "14 Մեր հարեւանների նախատինքին արժանացրիր մեզ եւ մեր շուրջը գտնուողների խայտառակ ծաղրուծանակին։ "},
	{15, "15 Մեզ խաղք դարձրիր հեթանոսների մէջ, եւ ժողովուրդները գլուխ թափ տուեցին։ "},
	{16, "16 Ամէն օր իմ նախատինքն առջեւս է, եւ երեսիս ամօթը պատել է ինձ՝ "},
	{17, "17 նախատողի ու չարախօսի ձայնից, թշնամու եւ հալածողի երեսից։ "},
	{18, "18 Այս ամէնը մեզ վրայ եկաւ, բայց մենք քեզ չմոռացանք,չդրժեցինք քո ուխտը, "},
	{19, "19 եւ մեր սրտերով յետ չդարձանք քեզանից. դու շեղեցիր մեր շաւիղը քո ճանապարհից։ "},
	{20, "20 Տաժանավայրում մեզ ծնկի բերիր, եւ մահուան ստուերները պատեցին մեզ։ "},
	{21, "21 Միթէ մոռացե՞լ ենք մեր Աստծու անունը կամ ձե՞ռք ենք մեկնել օտար աստուածների. "},
	{22, "22 չէ՞ որ Աստուած դա կ՚իմանայ, քանի որ նա քննում է գաղտնիքները մեր սրտի։ Մենք ամէն օր զոհւում ենք քեզ համար, կարծես մորթելու ոչխարներ լինենք։ "},
	{23, "23 Զարթնի՛ր, ինչո՞ւ ես ննջում, Տէ՛ր. ելիր եւ մի՛ մերժիր մեզ իսպառ։ "},
	{24, "24 Ինչո՞ւ ես երեսդ շրջում մեզանից, մոռանում մեր աղքատութիւնն ու նեղութիւնները։ "},
	{25, "25 Մեր անձերը մինչեւ գետին կորացան, եւ մեր մէջքը դիպաւ հողին։ "},
	{26, "26 Ելի՛ր, Տէ՛ր, օգնի՛ր եւ փրկի՛ր մեզ յանուն քո անուան։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view44() {
struct hy44 poems[] = {
	{1, "1 Այսուհետեւ՝ անցած ժամանակի մասին.Կորխի որդիների իմաստութիւնը. օրհնութեան սաղմոս սիրելիի մասին "},
	{2, "2 Սրտիցս քո բարի պատգամներն են բխում, եւ իմ գործերը պատմում եմ թագաւորին։ Լեզուս նման է արագ գրող դպրի գրչի։ "},
	{3, "3 Տեսքով գեղեցիկ ես բոլոր մարդկանց որդիներից, շրթունքներիցդ շնորհք է թափւում. դրա համար Աստուած օրհնեց քեզ յաւիտեան։ "},
	{4, "4 Մէջքիդ սո՛ւր կապիր, ո՛վ հզօր, քո վայելչութեամբ ու գեղեցկութեամբ։ "},
	{5, "5 Լարի՛ր աղեղդ, ուղղի՛ր եւ թագաւորի՛ր յանուն ճշմարտութեան, հեզութեան ու արդարութեան, եւ քո աջը թող սքանչելապէս առաջնորդի քեզ։ "},
	{6, "6 Քո նետերը սրուած են, ո՛վ հզօր, ընդդէմ թագաւորի թշնամիների. եւ ժողովուրդները պիտի ընկնեն ոտքերիդ տակ։ "},
	{7, "7 Քո գահը յաւիտեանս յաւիտենից է, Աստուա՛ծ. քո արքայական գաւազանն արդարութեան գաւազան է։ "},
	{8, "8 Սիրեցիր արդարութիւնն ու ատեցիր անօրէնութիւնը, դրա համար Աստուած՝ քո՛ Աստուածն օծեց քեզ ուրախութեան իւղով՝աւելի, քան քո ընկերներին։ "},
	{9, "9 Քո զգեստներից ու փղոսկրեայ պալատներից զմուռս, հալուէ եւ կինամոն է բուրում։ "},
	{10, "10 Արքայադուստրերն ուրախացնում ու պատւում են քեզ։ Թագուհին կանգնած է քո աջից՝ զարդարուած ու պաճուճուած ոսկեհուռ զգեստներով։ "},
	{11, "11 Դո՛ւստր, լսի՛ր ու տե՛ս, մօտեցրո՛ւ ականջը քո, մոռացի՛ր քո ժողովրդին եւ քո հօր տունը, քանզի թագաւորը ցանկացաւ քո գեղեցկութիւնը։ "},
	{12, "12 Նա ինքն է քո Տէրը, որին պիտի երկրպագես. նրան պիտի երկրպագի եւ դուստրը Տիւրոսի, "},
	{13, "13 եւ ժողովրդի մեծամեծները պիտի պաշտեն նրան ընծաներով։ "},
	{14, "14 Արքայադստեր ողջ փառքը իր մէջ է՝ ոսկեհուռ զգեստների զարդարանքի ու պաճուճանքի տակ։ "},
	{15, "15 Թագաւորի մօտ նրա հետ կոյսեր պիտի տարուեն, իր ընկերուհիները պիտի տարուեն նրա մօտ։ "},
	{16, "16 Ցնծութեամբ եւ ուրախութեամբ պիտի բերեն նրանց, եւ պիտի տարուեն թագաւորի պալատը։ "},
	{17, "17 Եւ քո հայրերի փոխարէն որդիներ պիտի լինեն քեզ, որոնց իշխան պիտի կարգես ողջ երկրի վրայ։ "},
	{18, "18 Քո անունը պիտի յիշուի սերնդից սերունդ. դրա համար ժողովուրդները քեզ պիտի գովեն յաւիտեան, եւ յաւիտեանս յաւիտենից։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view45() {
struct hy45 poems[] = {
	{1, "1 Այսուհետեւ՝ Կորխի որդիների գաղտնիքների մասին "},
	{2, "2 Աստուած ապաւէնն ու զօրութիւնն է մեր եւ մեր օգնականը մեզ հասած խիստ նեղութիւնների մէջ։ "},
	{3, "3 Ուստի մենք չենք վախենայ, երբ երկիրը ցնցուի, եւ լեռները ծովի խորքը տեղափոխուեն։ "},
	{4, "4 Դղրդացին ու ալեկոծուեցին ջրերը նրա, լեռները դողացին նրա սաստկութիւնից։ "},
	{5, "5 Գետերի յորձանքները զուարճացնում են Աստծու քաղաքը. եւ Բարձրեալը սրբացրել է իր օթեւանը։ "},
	{6, "6 Աստուած դրա մէջ է, եւ այն չի սասանուի. Աստուած կ՚օգնի դրան վաղորդայնից վաղորդայն։ "},
	{7, "7 Հեթանոսները խռովուեցին, ու թագաւորութիւնները հնազանդ եղան. Բարձրեալը ձայն տուեց, եւ երկիրը երերաց։ "},
	{8, "8 Մեզ հետ է Զօրութիւնների տէրը, Յակոբի Աստուածն ապաւէնն է մեր։ "},
	{9, "9 Եկէք տեսէ՛ք գործերն Աստծու, որ նշաններ ու զարմանահրաշ գործեր արեց երկրի վրայ։ "},
	{10, "10 Դադարեցրեց պատերազմը երկրի մի ծայրից մինչեւ միւսը, աղեղներ փշրեց, զէնքեր խորտակեց եւ վահանները մատնեց հրի։ "},
	{11, "11 Շտապեցէ՛ք ու իմացէ՛ք, որ ես Աստուածն եմ. ես պիտի բարձրացուեմ հեթանոսների մէջ, պիտի բարձրացուեմ երկրի երեսին։ "},
	{12, "12 Մեզ հետ է Զօրութիւնների Տէրը, Յակոբի Աստուածն ապաւէնն է մեր։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view46() {
struct hy46 poems[] = {
	{1, "1 Այսուհետեւ՝ Կորխի որդիների մասին.սաղմոս Դաւթի "},
	{2, "2 Բոլո՛ր հեթանոսներ, ծա՛փ զարկէք, ցնծութեան աղաղակով դիմեցէ՛ք Աստծուն։ "},
	{3, "3 Տէրը բարձրեալ եւ ահարկու է, մեծ թագաւոր է ամբողջ երկրի վրայ։ "},
	{4, "4 Ժողովուրդներին մեզ հնազանդեցրեց, եւ հեթանոսներին մեր ոտքերի տակ դրեց։ "},
	{5, "5 Ընտրեց մեզ համար որպէս ժառանգութիւն իրեն՝ Յակոբի վայելչութիւնը, որին նա սիրեց։ "},
	{6, "6 Աստուած բարձրացաւ օրհնութեամբ, եւ մեր Տէրը՝ շեփորի ձայնով։ "},
	{7, "7 Սաղմո՛ս երգեցէք մեր Աստծուն, սաղմո՛ս երգեցէք մեր թագաւորին, սաղմո՛ս երգեցէք։ "},
	{8, "8 Ամբողջ երկրի մեծ թագաւորն Աստուած է, սաղմո՛ս երգեցէք նրան իմաստութեամբ։ "},
	{9, "9 Աստուած թագաւորեց հեթանոսների վրայ, Աստուած բազմեց իր սրբութեան գահին։ "},
	{10, "10 Ժողովուրդների իշխանները հաւաքուեցին Աբրահամի Աստծու մօտ, քանզի Աստծու զօրութիւնները շատ բարձրացան երկրից։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view47() {
struct hy47 poems[] = {
	{1, "1 Կորխի որդիների երկուշաբթի օրուայ օրհնութեան սաղմոսը "},
	{2, "2 Մեծ է Տէրը եւ յոյժ օրհնեալ մեր Աստծու քաղաքում, իր սուրբ լերան վրայ։ "},
	{3, "3 Մեծ ցնծութեամբ ցնծում է ամբողջ երկիրն հաստատարմատ,ցնծում են Սիոնի լեռները, հիւսիսային կողմերը, մեծ թագաւորի քաղաքը։ "},
	{4, "4 Աստուած յայտնւում է իր տաճարում, երբ օգնական է դառնում նրանց։ "},
	{5, "5 Ահա երկրի թագաւորութիւնները հաւաքուեցին ու միասին եկան անցան։ "},
	{6, "6 Անձամբ տեսնելով այդ բանը՝ նրանք զարմացան, խռովուեցին ու սասանուեցին։ "},
	{7, "7 Այնտեղ դողը բռնեց նրանց եւ երկունքը, ինչպէս ծննդաբերութեան ժամանակ։ "},
	{8, "8 Սաստիկ հողմով նա պիտի փշրի նաւերը Թարսիսում։ "},
	{9, "9 Ինչ որ լսեցինք, այն էլ տեսանք Զօրութիւնների Տիրոջ քաղաքում՝ մեր Աստծու քաղաքում. Աստուած դրա հիմքերը գցեց յաւիտեան։ "},
	{10, "10 Ստացանք ողորմութիւնդ, Աստուա՛ծ, քո ժողովրդի մէջ։ "},
	{11, "11 Ինչպէս որ անունդ է, այնպէս էլ օրհնութիւնդ է ողջ տիեզերքում, եւ քո աջը լի է արդարութեամբ։ "},
	{12, "12 Տէ՛ր, քո արդարադատութեամբ թող ուրախանայ լեռը Սիոնի եւ ցնծան դուստրերը Յուդայի երկրի։ "},
	{13, "13 Պտտուեցէ՛ք Սիոնի շուրջը, շրջանն արէք նրա եւ պատեցէ՛ք նրա աշտարակները։ "},
	{14, "14 Թող ձեր սրտերը կապուեն նրա ամրութիւններին, զննեցէ՛ք նրա բերդերը, որ պատմել կարողանաք մէկ ուրիշ սերնդի։ "},
	{15, "15 Սա է Աստուածը, մեր Աստուածը յաւիտեանս յաւիտենից, եւ սա պիտի հովուի մեզ մինչեւ յաւիտենութիւն։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view48() {
struct hy48 poems[] = {
	{1, "1 Այսուհետեւ՝ Կորխի որդիների սաղմոսը "},
	{2, "2 Լսեցէ՛ք այս, համա՛յն ազգեր, ակա՛նջ դրէք բոլորդ, որ բնակւում էք աշխարհում, "},
	{3, "3 երկրածիննե՛ր եւ մարդկա՛նց որդիներ, ե՛ւ մեծամեծներ, ե՛ւ տնանկներ։ "},
	{4, "4 Բերանս իմաստութիւն պիտի խօսի, եւ սրտիս խորհուրդը՝ խոհեմութիւն։ "},
	{5, "5 Առակներին պիտի ականջ դնեմ եւ օրհներգով պիտի մեկնեմ առակները սկզբից։ "},
	{6, "6 Ինչո՞ւ արդեօք վախենամ չար օրերին, երբ կեանքիս անօրէնութիւններն ինձ պաշարեցին։ "},
	{7, "7 Իրենց կարողութեան վրայ յոյս դնողները պարծենում են իրենց մեծ հարստութեամբ։ "},
	{8, "8 Եղբայրն իր եղբօրը չի փրկի, ոչ էլ մարդը կը փրկի նրան. նա փրկանք չի տայ Աստծուն, "},
	{9, "9 ոչ էլ իր հոգու փրկանքը։ "},
	{10, "10 Յաւիտեա՛ն ջանք թափի՛ր, եւ դու կ՚ապրես անվերջ ու ապականութիւն չես տեսնի։ "},
	{11, "11 Երբ տեսնես, որ իմաստունները մեռնում են, նրանց հետ կը կորչեն նաեւ անզգամներն ու անմիտները՝ իրենց հարստութիւնը թողնելով օտարներին։ "},
	{12, "12 Նրանց գերեզմանը յաւիտեան իրենց տունը կը լինի, եւ սերնդից սերունդ՝ իրենց օթեւանը. նրանց հողերը կը կոչուեն իրենց անունով։ "},
	{13, "13 Մարդը պատիւ ունէր՝ եւ չհասկացաւ, հաւասարուեց անբան անասուններին ու նմանուեց նրանց։ "},
	{14, "14 Այս է ճանապարհը նրանց գայթակղութեան, որին յետոյ իրենց բերանով հաւանութիւն պիտի տան։ "},
	{15, "15 Ոչխարների պէս դժոխքի պիտի մատնուեն, ու մահը պիտի հովուի նրանց, եւ առաւօտեան արդարները պիտի նրանց տիրեն։ Նրանց օգնութիւնը կը սպառուի դժոխքում, եւ նրանք իրենց փառքը կը կորցնեն։ "},
	{16, "16 Սակայն երբ դժոխքն ինձ ընդունելու լինի, Աստուած կը փրկի իմ հոգին։ "},
	{17, "17 Մի՛ վախեցիր, երբ մարդ հարստանում է, եւ մեծանում է փառքը նրա տան, "},
	{18, "18 քանզի մեռնելիս հետը ոչինչ չի տանի, եւ նրա տան փառքն իր հետ չի թաղուի։ "},
	{19, "19 Նրա անձը կ՚օրհնուի իր կենդանութեան ժամանակ, եւ քեզ շնորհակալ կը լինի, երբ բարիք գործես նրան։ "},
	{20, "20 Նա կը միանայ իր նախնիների սերնդին, մինչեւ յաւիտենութիւն լոյսը չի տեսնի։ "},
	{21, "21 Մարդը պատիւ ունէր՝ եւ չհասկացաւ, հաւասարուեց անբան անասուններին ու նմանուեց նրանց։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view49() {
struct hy49 poems[] = {
	{1, "1 Աստուածների Աստուած Տէրը խօսեց, ձայն տուեց երկրին արեւելքից մինչեւ արեւմուտք։ "},
	{2, "2 Սիոնից է նրա մեծ վայելչութիւնն ու փրկութեան գեղեցկութիւնը։ "},
	{3, "3 Մեր Աստուածը պիտի գայ յայտնապէս, եւ մեր Աստուածը պիտի չլռի, նրա առջեւ հուր պիտի բորբոքուի, եւ նրա շուրջը՝ սաստիկ մրրիկ։ "},
	{4, "4 Նա վերեւից ձայն պիտի տայ երկնքին ու երկրին՝ իր ժողովրդին դատելու համար։ "},
	{5, "5 Մօտն է հաւաքելու իր սրբերին եւ նրանց, ովքեր ուխտի զոհ են մատուցում իր սեղանին։ "},
	{6, "6 Երկինքը պատմելու է նրա արդարութիւնը, քանզի Աստուած դատաւոր է։Հանգիստ։ "},
	{7, "7 Լսի՛ր, իմ ժողովո՛ւրդ, ու ես քեզ կ՚ասեմ, եւ Իսրայէ՛լ՝ քեզ կը վկայեմ, որ Աստուածը, ք՛ո Աստուածը ես եմ։ "},
	{8, "8 Քո զոհաբերութիւնների համար չէ, որ կշտամբում եմ քեզ, քանզի ողջակէզներդ միշտ առջեւս են։ "},
	{9, "9 Քո տնից հորթեր չեմ ընդունում, ոչ էլ քո հօտից՝ նոխազներ։ "},
	{10, "10 Իմն են անտառի բոլոր գազանները, լեռների երէները եւ բոլոր անասունները։ "},
	{11, "11 Գիտեմ ես երկնքի բոլոր թռչուններին, եւ դաշտի գեղեցկութիւնն իմն է։ "},
	{12, "12 Եթէ քաղց զգամ, քեզ բան չեմ ասի, քանզի իմն է աշխարհն իր ամբողջութեամբ։ "},
	{13, "13 Ես չեմ ուտում քո հորթերի միսը, եւ քո նոխազների արիւնը չեմ խմում։ "},
	{14, "14 Աստծուն օրհնութեան պատարագ մատուցի՛ր եւ Բարձրեալի առջեւ ուխտդ կատարի՛ր։ "},
	{15, "15 Քո նեղութեան օրը կանչի՛ր ինձ, ես կը փրկեմ քեզ, ու դու կը փառաբանես ինձ։Հանգիստ։ "},
	{16, "16 Սակայն մեղաւորին Աստուած ասում է. Իսկ դու ինչո՞ւ ես պատմում իմ արդարութիւնը, կամ բերանդ չես առնում իմ ուխտը։ "},
	{17, "17 Չէ որ դու ատեցիր իմ խրատը, մերժեցիր ու անտեսեցիր բերանիս բոլոր խօսքերը։ "},
	{18, "18 Երբ գողեր էիր տեսնում, նրանց հետ էիր ընթանում եւ ընկերակցում շնացողներին։ "},
	{19, "19 Բերանդ չարութիւն էր տարածում, եւ լեզուդ նենգութիւն էր նիւթում։ "},
	{20, "20 Նստած չարախօսում էիր եղբօրդ մասին եւ մօրդ որդու վրայ զրպարտութիւն բարդում։ "},
	{21, "21 Այս բոլորն արեցիր, ու ես լուռ մնացի. դու՝ անօրէնդ, կարծեցիր քո մտքում, թէ ես էլ կը նմանուեմ քեզ։ Արդ, պիտի յանդիմանեմ քեզ եւ այս ամէնը առջեւդ դնեմ։ "},
	{22, "22 Իմացէ՛ք բոլորդ, որ մոռացել էք Աստծուն. գուցէ երբեւէ յափշտակուէք տարուէք, եւ ձեզ փրկող չգտնուի։ "},
	{23, "23 Օրհնութեան պատարագն ինձ կը փառաւորի. եւ ճանապարհն այնտեղ է, ուր ես նրան ցոյց պիտի տամ Աստծու փրկութիւնը։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view50() {
struct hy50 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի. "},
	{2, "2 այն ժամանակ, երբ նրա մօտ եկաւ Նաթան մարգարէն, երբ ինքը մերձեցել էր Բերսաբէին "},
	{3, "3 Ողորմի՛ր ինձ, Աստուա՛ծ, քո մեծ ողորմութեամբ եւ քո գթառատութեամբ ջնջի՛ր իմ յանցանքները։ "},
	{4, "4 Առաւել եւս լուա՛ ինձ իմ անօրէնութիւնից եւ իմ մեղքերից մաքրի՛ր ինձ։ "},
	{5, "5 Իմ անօրէնութիւններն ես ինքս գիտեմ, եւ մեղքերն իմ միշտ առջեւս են։ "},
	{6, "6 Քո դէմ միայն մեղանչեցի, Տէ՛ր, եւ չարիք գործեցի քո առջեւ, որպէսզի արդար լինես քո խօսքերում, եւ յաղթող՝ քո դատաստանի մէջ։ "},
	{7, "7 Անօրէնութեամբ յղիացաւ եւ մեղքերի մէջ ծնեց ինձ մայրն իմ։ "},
	{8, "8 Դու, Տէ՛ր, ճշմարտութիւնը սիրեցիր եւ քո իմաստութեան անյայտն ու ծածուկն ինձ յայտնեցիր։ "},
	{9, "9 Ցօղի՛ր ինձ սպունգով՝ եւ ես կը մաքրուեմ, լուա՛՝ ու ձիւնից ճերմակ կը լինեմ։ "},
	{10, "10 Ինձ ցնծութիւն եւ ուրախութիւն լսել տո՛ւր, եւ թող տառապեալ ոսկորներս ցնծան։ "},
	{11, "11 Երեսդ շո՛ւռ տուր իմ մեղքերից եւ իմ բոլոր յանցանքները ջնջի՛ր ինձնից։ "},
	{12, "12 Իմ մէջ մաքուր սիրտ հաստատի՛ր, Աստուա՛ծ, եւ արդար հոգի նորոգի՛ր իմ որովայնում։ "},
	{13, "13 Մի՛ գցիր ինձ, Տէ՛ր, քո երեսից եւ սուրբ Հոգիդ մի՛ հանիր ինձնից։ "},
	{14, "14 Ինձ փրկութեան ցնծութի՛ւն տուր, եւ քո տիրական Հոգով հաստատի՛ր ինձ։ "},
	{15, "15 Անօրէններին կը սովորեցնեմ քո ճանապարհը, եւ ամբարիշտները քո կողմը կը դառնան։ "},
	{16, "16 Փրկի՛ր ինձ արիւնից, Աստուա՛ծ, իմ փրկութեա՛ն Աստուած. լեզուս թող ցնծայ քո արդարութեամբ։ "},
	{17, "17 Տէ՛ր, եթէ շրթներս բացես, բերանն իմ կ՚երգի օրհնութիւնը քո։ "},
	{18, "18 Եթէ ուզէիր՝ պատարագ կը մատուցէինք, բայց դու ողջակէզներ չես սիրում։ "},
	{19, "19 Խոնարհ հոգին է պատարագն Աստծու, մաքուր սիրտն ու խոնարհ հոգին Աստուած չի արհամարհում։ "},
	{20, "20 Քո բարեհաճութեամբ բարի՛ք գործիր Սիոնին, Տէ՛ր, եւ Երուսաղէմի պարիսպները թող կառուցուեն։ "},
	{21, "21 Այնժամ դու կը հաւանես արդարութեան պատարագները, եւ, իբրեւ ուխտի զոհեր, քո սեղանին հորթեր կը մատուցեն։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view51() {
struct hy51 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի, "},
	{2, "2 այն ժամանակ, երբ Դովեկ Եդոմայեցին եկաւ պատմեց Սաւուղին, թէ ահա Դաւիթն Աքիմելէքի տանն է։ "},
	{3, "3 Ինչո՞ւ է հզօրը պարծենում չարութեամբ ու անօրէնութեամբ։ "},
	{4, "4 Գիշեր-ցերեկ նա անիրաւութիւն նիւթեց իր լեզուով, սուր ածելու նման նենգութիւն գործեց։ "},
	{5, "5 Բարութիւնից աւելի չարութիւն սիրեց եւ արդար խօսքից աւելի՝ անօրէնութիւն։ "},
	{6, "6 Սիրեց նա ամէն տեսակ կործանարար խօսքեր եւ նենգ լեզուներ։ "},
	{7, "7 Դրա համար Աստուած կը կործանի նրան իսպառ, կը խլի ու կը հանի նրան իր օթեւանից, եւ նրա արմատները՝ ողջերի երկրից։ "},
	{8, "8 Արդարները կը տեսնեն ու կը վախենան եւ կը ծաղրեն նրան՝ ասելով. "},
	{9, "9 Սա է այն մարդը, որն Աստծու օգնութեանը չապաւինեց, այլ յոյսը դրեց իր մեծ հարստութեան վրայ եւ զօրացաւ իր ունայնութեամբ։ "},
	{10, "10 Իսկ ես Աստծու տան պտղաբեր ձիթենու նման եմ. յաւիտեան եւ յաւիտեանս յաւիտենից յոյսս դրի Աստծու ողորմութեան վրայ։ "},
	{11, "11 Քեզ յաւիտեան գոհութիւն պիտի մատուցեմ արածիդ համար եւ յոյսս պիտի դնեմ քո անուան վրայ, քանզի բարի ես սրբերիդ հանդէպ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view52() {
struct hy52 poems[] = {
	{1, "1 Անզգամն ասաց իր սրտում, թէ՝ Աստուած չկայ։ "},
	{2, "2 Ապականուեցին ու պղծուեցին իրենց անօրէնութեան մէջ, եւ չկայ մէկը, որ բարութիւն գործի։ "},
	{3, "3 Աստուած երկնքից նայեց բոլոր մարդկանց որդիներին՝ տեսնելու, թէ կա՞յ մի իմաստուն, որ Աստծուն է փնտռում։ "},
	{4, "4 Բոլորը միասին խոտորուեցին եւ անպէտք դարձան։ Բարութիւն անող չկայ, չկայ նոյնիսկ մէկ հոգի։ "},
	{5, "5 Ինչպէ՞ս չեն գիտակցում բոլոր նրանք, որ անօրէնութիւն են գործում, նրանք, որ խժռում են իմ ժողովրդին իբրեւ կերակրահաց եւ չեն դիմում Աստծուն։ "},
	{6, "6 Այնտեղ, ուր երկիւղ չկայ, երկիւղից սարսում են նրանք, քանզի Աստուած ցրելու է երեսպաշտների ոսկորները։ Նրանք պիտի խայտառակուեն ու ամօթահար լինեն, քանզի Աստուած անարգեց նրանց։ "},
	{7, "7 Ո՞վ կը տայ Սիոնից Իսրայէլի փրկութիւնը։ Երբ Տէրն իր ժողովրդին վերադարձնի գերութիւնից, Յակոբը կը ցնծայ, եւ Իսրայէլն ուրախ կը լինի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view53() {
struct hy53 poems[] = {
	{1, "1 Այսուհետեւ՝ Դաւթի իմաստութեան օրհնութիւնը, "},
	{2, "2 այն ժամանակ, երբ Զիփացիները եկան եւ ասացին Սաւուղին. Ահա Դաւիթը թաքուն նստած է մեզ մօտ։ "},
	{3, "3 Աստուա՛ծ, քո անուամբ փրկի՛ր ինձ եւ քո զօրութեամբ արդա՛ր հանիր ինձ։ "},
	{4, "4 Աստուա՛ծ, լսի՛ր իմ աղօթքները, ակա՛նջ դիր բերանիս խօսքերին։ "},
	{5, "5 Օտարներն ելան իմ դէմ, հզօրներն իմ կեանքն ուզեցինեւ քեզ իրենց աչքում Աստուած չհամարեցին։ "},
	{6, "6 Ահա Աստուած իմ օգնականն է, եւ Տէրը՝ իմ հոգու ապաւէնը։ "},
	{7, "7 Չարիքը շրջելով թշնամիներիս դէմ՝քո ճշմարտութեամբ կործանի՛ր նրանց։ "},
	{8, "8 Ես իմ բարի կամքով զոհ պիտի մատուցեմ քեզ, Տէ՛ր, եւ գոհանամ քո անուամբ, քանի որ այն բարի է։ "},
	{9, "9 Իմ ողջ նեղութիւնից փրկեցիր ինձ, եւ աչքս տեսաւ կորուստը թշնամիներիս։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view54() {
struct hy54 poems[] = {
	{1, "1 Այսուհետեւ՝ իմաստութեան օրհնութիւնը, սաղմոս Դաւթի "},
	{2, "2 Ակա՛նջ դիր, Աստուա՛ծ, իմ աղօթքին, եւ խնդրանքներս մի՛ անտեսիր։ "},
	{3, "3 Նայի՛ր ինձ ու լսի՛ր ինձ, քանզի անձկութեամբ տրտմեցի ու խռովուեցի։ "},
	{4, "4 Թշնամու ձայնից եւ մեղսագործի հալածանքից նրանք անիրաւութեամբ դէպի ինձ շրջուեցին, բարկութեամբ ոխ պահեցին իմ դէմ։ "},
	{5, "5 Սիրտս խռովուեց իմ մէջ, եւ մահուան երկիւղն ինձ համակեց։ "},
	{6, "6 Ահ ու դող ընկաւ վրաս, եւ խաւարը ծածկեց ինձ։ "},
	{7, "7 Ասացի. Մէկն ինձ աղաւնու թեւեր տար, որ թռչելով բարձրանայի "},
	{8, "8 եւ հեռանալով հանգիստ առնէի անապատում։ "},
	{9, "9 Յոյս ունէի, որ Աստուած ինձ կը փրկէր կարճամիտ զայրոյթից եւ փոթորկուող նեղսրտութիւնից։ "},
	{10, "10 Կորստեան մատնի՛ր, Տէ՛ր, եւ թող նրանք իրար լեզու չհասկանան, քանզի անիրաւութիւն եւ հակառակութիւն տեսայ քաղաքում։ "},
	{11, "11 Գիշեր-ցերեկ նրա պարիսպների շուրջը անօրէնութիւն է գործւում, իսկ դրա ներսում՝ չարիք ու մեղք։ "},
	{12, "12 Եւ վաշխառութիւնն ու նենգութիւնը չվերացան նրա հրապարակներից։ "},
	{13, "13 Եթէ թշնամին լինէր ինձ նախատողը, կը համբերէի, կամ իմ ատելին լինէր իմ դէմ մեծախօսողը, կը թաքնուէի նրանից։ "},
	{14, "14 Այլ դու, մա՛րդ, իմ հաւասարն ես, իմ առաջնորդն ու ծանօթը։ "},
	{15, "15 Չէ՞ որ դու էիր քաղցրացնում իմ ու քո կերակուրը, եւ միաբանութեամբ էինք գործում Աստծու տանը։ "},
	{16, "16 Մահը նրանց վրայ կը հասնի, եւ նրանք ողջ-ողջ դժոխք կ՚իջնեն, քանզի իրենց բնակարանում ու իրենց մէջ չարութիւն կայ։ "},
	{17, "17 Ես Աստծուն ձայն տուի, եւ Տէրն ինձ լսեց։ "},
	{18, "18 Երեկոյեան, առաւօտեան ու կէսօրին պատմեցի ու խօսեցի, եւ նա իմ ձայնը կը լսի։ "},
	{19, "19 նա ինձ խաղաղութեամբ կը փրկի ինձ մերձեցողներից, քանզի ուժով յարձակուեցին ինձ վրայ։ "},
	{20, "20 Կը լսի եւ կ՚ընկճի նրանց Աստուած, որ կար յաւիտենութիւնից առաջ, քանզի չեն փոխւում նրանք,եւ չեն վախենում Աստծուց։ "},
	{21, "21 Նա մեկնեց իր ձեռքը՝ պատժելու նրանց. նրանք պղծել էին Նրա օրէնքները։ "},
	{22, "22 Բաժանուեցին Նրա երեսի զայրոյթից, բայց Նա հասաւ նրանց սրտերին։ Ձէթից փափուկ էին նրանց խօսքերը, բայց իրենք կարծես նետեր լինէին։ "},
	{23, "23 Հոգսդ դի՛ր Տիրոջ վրայ, ու նա քեզ կը կերակրի եւ չի թողնի, որ արդարը յաւիտեան սասանուի։ "},
	{24, "24 Դու, Աստուա՛ծ, նրանց կ՚իջեցնես ապականութեան փոսը. արիւնահեղ ու նենգ մարդիկ իրենց կեանքի օրերի կէսին չեն հասնի. իսկ ես, Տէ՛ր, յոյսս դրի քեզ վրայ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view55() {
struct hy55 poems[] = {
	{1, "1 Այսուհետեւ՝ ժողովրդի մասին, որը հեռացել էր սրբերից. արձանագիր սաղմոս Դաւթի, երբ այլազգիները նրան բռնել էին Գէթում. "},
	{2, "2 Ողորմի՛ր ինձ, Աստուա՛ծ, քանզի մարդն ինձ կոխոտեց, ամենօրեայ պատերազմներն ինձ նեղեցին։ "},
	{3, "3 Թշնամիներս գիշեր-ցերեկ ինձ ոտնատակ արին, եւ շատերն իմ դէմ մարտնչեցին բարձունքից։ "},
	{4, "4 Օրը ցերեկով չեմ վախենայ, քանզի յոյսս դրել եմ Տիրոջ վրայ։ "},
	{5, "5 Աստծու խօսքով պիտի կատարեմ իմ գովաբանութիւնը. Աստծու վրայ դրի իմ յոյսը ու չեմ սոսկալու. մարդն ինձ ի՞նչ կարող է անել։ "},
	{6, "6 Ամէն օր խօսքերս անարգեցին, նրանց չար խորհուրդներն իմ դէմ եղան։ "},
	{7, "7 Նրանք պանդուխտ կը լինեն ու գաղտագողի կը շրջեն։Նրանք հետապնդում են ինձ, ինչպէս իմ մահը ցանկացող մարդիկ։ "},
	{8, "8 Որպէս ոչնչութիւն դու կը մերժես նրանց, քո բարկութեամբ հնազանդ կը դարձնես ժողովուրդներին։ "},
	{9, "9 Աստուա՛ծ, կեանքս քեզ կը պատմեմ, արցունքներս առջեւդ կը դնեմ, ինչպէս դու ինձ խոստացար։ "},
	{10, "10 Թշնամիներս ետ կը դառնան այն օրը, երբ օգնութեան կանչեմ քեզ. ահա իմացայ, որ դու իմ Աստուածն ես։ "},
	{11, "11 Աստծուն պիտի օրհնեմ իմ բերանով եւ բառերովս Տիրոջը պիտի գովեմ իմ խօսքերով։ Աստծու վրայ դրի իմ յոյսը եւ վախ չունեմ. մարդն ինձ ի՞նչ կարող է անել։ "},
	{12, "12 Ինձնից է ուխտն իմ, որ օրհնութեամբ քեզ պիտի մատուցեմ, Աստուա՛ծ։ "},
	{13, "13 Ինձ փրկեցիր մահուանից, աչքս՝ արտասուքից, եւ ոտքս՝ գայթակղութիւնից. ողջերի երկրում ես հաճելի կ՚երեւամ Տիրոջ առջեւ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view56() {
struct hy56 poems[] = {
	{1, "1 Այսուհետեւ՝ մի՛ ապականիր. արձանագիր Դաւթի, երբ նա Սաւուղի երեսից փախել թաքնուել էր քարայրում "},
	{2, "2 Ողորմի՛ր ինձ, Աստուա՛ծ, ողորմի՛ր ինձ, քանզի յոյսս դրի քեզ վրայ. քո թեւերի հովանուն պիտի ապաւինեմ, մինչեւ անօրէնութիւնն անցնի։ "},
	{3, "3 Աղաղակեցի բարձրեալ Աստծուն՝ իմ բարերար Աստծուն։ "},
	{4, "4 Նա օգնութիւն ուղարկեց երկնքից եւ փրկեց ինձ, նախատելի դարձրեց ինձ ոտնահարողներին։ Աստուած իր ողորմութիւնն ու ճշմարտութիւնն ուղարկեց։ "},
	{5, "5 Գազանների միջից ազատեց ինձ, քանզի ես խռովուած ննջում էի։ Մարդկանց որդիների ատամները զէնք եւ նետ են, իսկ նրանց լեզուները՝ ինչպէս սուր սուսեր։ "},
	{6, "6 Դու երկինք ես բարձրացել, Աստուա՛ծ, եւ ողջ աշխարհն է բռնել փառքը քո։ "},
	{7, "7 Որոգայթ պատրաստեցին ոտքերիս համար, ընկճեցին ինձ, առջեւս փոս փորեցին, բայց նրա մէջ իրե՛նք ընկան։ "},
	{8, "8 Պատրաստ է սիրտն իմ, Աստուա՛ծ, պատրաստ է սիրտն իմ՝ օրհնելու եւ սաղմոսերգելու քեզ իմ փառաբանութեամբ։ "},
	{9, "9 Արթնացի՛ր, փա՛ռք իմ, արթնացի՛ր սաղմոսներով եւ օրհներգութեամբ, եւ ես կ՚արթնանամ առաւօտեան։ "},
	{10, "10 Գոհութիւն կը մատուցեմ քեզ ժողովուրդների մէջ, Տէ՛ր, եւ ազգերի մէջ քեզ սաղմոս կ՚երգեմ։ "},
	{11, "11 Քո ողորմութեան մեծութիւնը հասաւ մինչեւ երկինք, եւ քո ճշմարտութիւնը՝ մինչեւ ամպերը։ "},
	{12, "12 Դու երկինք ես բարձրացել, Աստուա՛ծ, եւ ողջ աշխարհն է բռնել փառքը քո։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view57() {
struct hy57 poems[] = {
	{1, "1 Այսուհետեւ՝ մի՛ ապականիր. արձանագիր Դաւթի "},
	{2, "2 Եթէ դուք արդարութեամբ խօսէիք, ուղիղ կը լինէին ձեր դատաստանները, մարդկա՛նց որդիներ։ "},
	{3, "3 Չէ՞ որ այժմ իսկ ձեր սրտում անօրէնութիւն էք գործում երկրի երեսին, եւ ձեր ձեռքերն անիրաւութիւն են նիւթում։ "},
	{4, "4 Մեղաւորներն իրենց ծննդեան օրից իսկ խոտորուեցին, արգանդից մոլորուեցին եւ սուտ խօսեցին։ "},
	{5, "5 Նրանց կատաղութիւնը նման է օձի թոյնի,վիշապ օձի թոյնի, որ խցել է իր ականջները, "},
	{6, "6 որպէսզի ճարտար օձահմայի ձայնը չլսի եւ դեղ չառնի իմաստուն դեղատուից։ "},
	{7, "7 Աստուած պիտի փշրի նրանց ատամներն իրենց բերանում. Տէրը կոտրատեց ժանիքներն առիւծների։ "},
	{8, "8 Թող նրանք թափուող ջրի պէս անպիտան լինեն։Երբ նրանք իրենց աղեղները լարեն, "},
	{9, "9 թող հալուեն մոմի նման ու սպառուեն։ Հուր թափուեց, եւ նրանք արեւ չտեսան։ "},
	{10, "10 Դեռ իրենց փշերը չզգացած՝ Աստուած նրանց դժնիկի պէս ողջ-ողջ պիտի այրի բարկութեամբ։ "},
	{11, "11 Արդարը պիտի ուրախանայ՝ տեսնելով հատուցումը, եւ ձեռքերն իր պիտի լուայ մեղաւորի արեան մէջ։ "},
	{12, "12 Ու մարդ պիտի ասի, թէ իսկապէս արդարի համար վարձատրութիւն կայ, եւ կայ Աստուած, որ երկրի վրայ դատում է նրանց։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view58() {
struct hy58 poems[] = {
	{1, "1 Այսուհետեւ՝ մի՛ ապականիր. արձանագիր Դաւթի, երբ Սաւուղը զօրք ուղարկեց պաշարելու նրա տունը եւ սպանելու նրան. սաղմոս Դաւթի "},
	{2, "2 Աստուա՛ծ, թշնամիներիցս փրկի՛ր ինձ, ազատի՛ր նրանցից, ովքեր ելել են իմ դէմ։ "},
	{3, "3 Ինձ փրկի՛ր անօրէնութիւն գործողներից, արիւնահեղ մարդկանցից պահպանի՛ր ինձ։ "},
	{4, "4 Որսալ ուզեցին ինձ, եւ հզօր մարդիկ ինձ վրայ յարձակուեցին։ "},
	{5, "5 Ո՛չ մեղք ունեմ եւ ո՛չ յանցանք, առանց մեղքի ընթացայ ու արդար եղայ։ "},
	{6, "6 Ինձ ընդառաջ ե՛լ եւ տե՛ս դո՛ւ, Զօրութիւնների՛ Տէր, Աստուա՛ծ Իսրայէլի։ Նայի՛ր ու այցելի՛ր բոլոր հեթանոսներին եւ մի՛ ողորմիր բոլոր նրանց, ովքեր անօրէնութիւն են գործում։ "},
	{7, "7 Նրանք ետ կը դառնան երեկոյեան, քաղց կը զգան շների պէս եւ քաղաքի շուրջը կը պտտուեն։ "},
	{8, "8 Նրանք կը վայրահաչեն իրենց բերանով ու կը սրեն շրթերն իրենց։ "},
	{9, "9 Իսկ արդ, ո՞վ կը լսի դա. դու, Տէ՛ր, կը ծիծաղես նրանց վրայ եւ կ՚արհամարհես բոլոր հեթանոսներին։ "},
	{10, "10 Զօրութիւնս քեզնո՛վ կը պահեմ, քանզի Աստուած իմ օգնականն է։ "},
	{11, "11 Իմ Աստծու ողորմութիւնը կը հասնի ինձ, եւ իմ Աստուածն ինձ համար ի ցոյց կը հանի թշնամիներիս։ "},
	{12, "12 Մի՛ սպանիր նրանց, որ չմոռանան քո ժողովրդին։ Ցրի՛ր եւ ընկճի՛ր նրանց քո զօրութեամբ, քանզի դու իմ պաշտպանն ես, Տէ՛ր։ "},
	{13, "13 Իրենց բերանի մեղքերի եւ շրթունքների խօսքերի համար թող նրանք ընկղմուեն իրենց ամբարտաւանութեան մէջ եւ անէծքի ու ստութեան մատնուեն։ "},
	{14, "14 Բարկութեան ներգործութեամբ թող սպառուեն ու անհետանան։ Թող իմանան, որ Աստուած տիրում է Յակոբին ու երկրի բոլոր ծագերին։ "},
	{15, "15 Նրանք ետ կը դառնան երեկոյեան, քաղց կը զգան շների պէս եւ քաղաքի շուրջը կը պտտուեն։ "},
	{16, "16 Նրանք կը թափառեն ուտելու համար եւ, եթէ չկշտանան, կը տրտնջան։ "},
	{17, "17 Ես պիտի օրհնաբանեմ քեզ, Տէ՛ր,պիտի ցնծամ առաւօտեան քո ողորմութեամբ, "},
	{18, "18 քանզի դո՛ւ եղար իմ պաշտպանն ու ապաստանը եւ նեղութեանս օրերի օգնականը։ "},
	{19, "19 Քեզ սաղմոս պիտի երգեմ, իմ ապաւէ՛ն Աստուած, իմ ողորմութեա՛ն Աստուած։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view59() {
struct hy59 poems[] = {
	{1, "1 Այսուհետեւ անցած ժամանակների մասին ուսանելու համար. "},
	{2, "2 արձանագիր սաղմոս Դաւթի, երբ նա հրի մատնեց Միջագետքն ու Սոբողի Ասորեստանը, իսկ ետ դառնալիս Յովաբն Աղի ձորում կոտորեց տասներկու հազար մարդ։ "},
	{3, "3 Աստուա՛ծ, մեզ լքեցիր ու քարուքանդ արիր, բարկացար, բայց պիտի գթաս մեզ։ "},
	{4, "4 Ցնցեցիր երկիրն ու խռովութեան մատնեցիր այն, բուժի՛ր նրա ստացած հարուածները, քանզի նա սասանուեց։ "},
	{5, "5 Քո ժողովրդին խստութիւն ցոյց տուիր եւ մեզ թմրութեան գինի խմեցրիր։ "},
	{6, "6 Երկիւղածներիդ նշան դու տուիր, որ փրկութիւն գտնեն աղեղից։ "},
	{7, "7 Ինչպէս որ քո սիրելիները փրկուեցին, այնպէս էլ քո աջով պահպանի՛ր եւ լսի՛ր մեզ։ "},
	{8, "8 Աստուած խօսեց իր սրբարանից. Ես պիտի ցնծամ ու բարձրանալով՝ բաժանեմ Սիւքէմը եւ վրանների հովիտը չափեմ։ "},
	{9, "9 Իմն է Գաղաադն ու իմն է Մանասէն, Եփրեմն իմ գլխի սաղաւարտն է։ "},
	{10, "10 Յուդան թագաւորս է, Մովաբը՝ յոյսիս աւազանը։ Դէպի Եդոմէ պիտի ուղղեմ երթն իմ, քանզի այլազգիներն ինձ հնազանդուեցին։ "},
	{11, "11 Ո՞վ ինձ կը տանի բերդաքաղաք, կամ ո՞վ ինձ կ՚առաջնորդի մինչեւ Եդոմէ, "},
	{12, "12 եթէ ոչ դու, Աստուա՛ծ, որ լքեցիր մեզ եւ մեր զօրքերի հետ չելար, Աստուա՛ծ։ "},
	{13, "13 Նեղութեան մէջ օգնութիւն ցո՛յց տուր մեզ, քանզի ունայն է փրկութիւնը մարդու։ "},
	{14, "14 Աստուծով քաջութիւն կը գործենք, եւ նա կ՚արհամարհի մեզ նեղողներին։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view60() {
struct hy60 poems[] = {
	{1, "1 Այսուհետեւ՝ օրհնութեամբ սաղմոս Դաւթի "},
	{2, "2 Լսի՛ր, Աստուա՛ծ, աղօթքն իմ, եւ ո՛ւշ դարձրու, Տէ՛ր, աղօթքիս։ "},
	{3, "3 Երկրի ծայրերից ես քեզ կանչեցի, երբ սիրտս յոգնեց։ "},
	{4, "4 Ժայռից բարձր պահեցիր ինձ, առաջնորդեցիր ինձ ու եղար իմ յոյսը, եւ թշնամու դէմ հզօր աշտարակ դարձար ինձ համար։ "},
	{5, "5 Ես յաւիտեան պիտի բնակուեմ քո խորանում ու թեւերիդ հովանու տակ պատսպարուեմ։ "},
	{6, "6 Դու, Աստուա՛ծ, աղօթքս լսեցիր եւ ժառանգութիւն տուիր քո անունից ակնածողներին։ "},
	{7, "7 Թագաւորի կեանքի տարիներին օրեր աւելացրիր, օրեր սերնդէ սերունդ։ "},
	{8, "8 Նա կայ եւ յաւիտեան կը մնայ Աստծու առջեւ. նաեւ նրանք, որոնք ողորմութիւն ու ճշմարտութիւն կը խնդրեն նրանից։ "},
	{9, "9 Այսպէս սաղմոս պիտի երգեմ քեզ յաւիտեանս յաւիտենից եւ օրըստօրէ աղօթք պիտի մատուցեմ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view61() {
struct hy61 poems[] = {
	{1, "1 Այսուհետեւ՝ Իդիթոմի մասին սաղմոս Դաւթի "},
	{2, "2 Միայն Աստծո՛ւն հնազանդ եղիր, հոգի՛ իմ, քանզի նրանից է փրկութիւնս։ "},
	{3, "3 Նա է Աստուածն իմ ու փրկիչն իմ, ապաւէնն իմ, որ էլ չսասանուեմ։ "},
	{4, "4 Մինչեւ ե՞րբ ամէնքդ պիտի յարձակուէք մարդու վրայ՝ կործանելու նրան թեքուած պարսպի ու խախտուած ցանկապատի պէս։ "},
	{5, "5 Նրանք ինձ պատուից զրկելու մասին էին մտածում միայն՝ տոչորուելով նախանձից։ Իրենց բերանով օրհնում էին, բայց իրենց սրտով անիծում։ "},
	{6, "6 Սակայն իմ հոգին հնազանդ կը մնայ Աստծուն, քանզի նրանի՛ց է իմ համբերութիւնը։ "},
	{7, "7 Նա է Աստուածն իմ ու փրկիչն իմ, ապաւէնն իմ, որ չսասանուեմ։ "},
	{8, "8 Աստծուց է զօրութիւնն ու փառքն իմ, Աստուած է օգնականն իմ եւ Աստծու վրայ է յոյսն իմ։ "},
	{9, "9 Ձեր յոյսը դրէ՛ք նրա վրայ, ժողովուրդների ո՛ղջ բազմութիւններ, բացէ՛ք նրա առջեւ սրտերը ձեր, քանզի Աստուած օգնականն է մեր յաւիտեանս յաւիտենից։ "},
	{10, "10 Հանգիստ "},
	{11, "11 Սակայն ունայն են մարդկանց որդիները, սուտ են որդիները մարդկանց, իրենց կշռով անարդար ենեւ իրենք ամէնքն էլ ունայնութեան մէջ են։ "},
	{12, "12 Յոյս մի՛ դրէք անիրաւութեան վրայ, յափշտակութիւն մի՛ ցանկանաք, եթէ հարստութիւնն առուի պէս իսկ հոսի,թող ձեր սրտերը չցանկանան։ "},
	{13, "13 Մի անգամ խօսեց Աստուած, եւ երկու անգամ լսեցինք այս բանը։ "},
	{14, "14 Աստծունն է զօրութիւնը, եւ քոնն է, Տէ՛ր, ողորմութիւնը, դու ես հատուցում իւրաքանչիւրին ըստ իր գործերի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view62() {
struct hy62 poems[] = {
	{1, "1 Սաղմոս Դաւթի, մինչ նա գտնւում էր Հրէաստանի անապատում "},
	{2, "2 Աստուա՛ծ, Աստուա՛ծ իմ, ես առաւօտից քեզ եմ դիմում. հոգիս ծարաւ է քեզ, առաւել եւս մարմինն իմ, "},
	{3, "3 ինչպէս մի անապատ եւ անջուր երկիր, ուր ճամփայ չկայ։ Այդպէս էլ պիտի երեւամ քո սրբարանում՝ տեսնելու փառքդ եւ զօրութիւնդ, "},
	{4, "4 քանզի ինձ համար քո ողորմութիւնն աւելի լաւ է, քան կեանքս, եւ շրթունքներն իմ պիտի գովեն քեզ։ "},
	{5, "5 Այսպէս իմ կեանքում քեզ պիտի օրհնեմ եւ քո անունով ձեռքս բարձրացնեմ։ "},
	{6, "6 Ասես պարարտ ճարպով պիտի յագենայ իմ հոգին, եւ բերանս ցնծալից շրթունքներով քե՛զ պիտի օրհնի։ "},
	{7, "7 Երբ քեզ յիշում էի իմ անկողնում, առաւօտեան կանուխ խօսում էի քեզ հետ։ "},
	{8, "8 Քանի որ դո՛ւ եղար իմ օգնականը, քո թեւերի հովանու տակ ես պիտի ցնծամ։ "},
	{9, "9 Քեզ հետեւեց իմ հոգին, եւ աջդ ընդունեց ինձ։ "},
	{10, "10 Նրանք, որ ինձ իզուր հետապնդեցին, թող երկրի անդունդների խորքը մտնեն։ "},
	{11, "11 Թող սրի մատնուեն նրանք եւ աղուէսների բաժին դառնան։ "},
	{12, "12 Թագաւորը յոյսը դրեց Տիրոջ վրայ. թող պարծենան բոլոր նրանք, որ երդւում են նրանով. թող խցուեն բերանները նրանց, ովքեր անիրաւութիւն են խօսում։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view63() {
struct hy63 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի "},
	{2, "2 Աստուա՛ծ, երբ աղաչեմ քեզ, աղօթքս լսի՛ր, թշնամու սարսափից փրկի՛ր ինձ։ "},
	{3, "3 Թաքցրո՛ւ ինձ չարագործների ամբոխից եւ անօրէնութիւն գործողների բազմութիւնից։ "},
	{4, "4 Նրանք սուսերի պէս սրեցին իրենց լեզուները եւ իրենց աղեղները լարեցին դառն գործի համար, "},
	{5, "5 որպէսզի գաղտագողի նետահարեն սրտով շիտակներին, յանկարծակի նետահարեն նրանց առանց երկիւղի։ "},
	{6, "6 Նրանք զօրացան իրենց չարախօսութեամբ, մտածեցին իմ դէմ որոգայթ լարել եւ ասացին. Տէրը դա չի տեսնի։ "},
	{7, "7 Անօրէնութիւն փնտռեցին, յոգնեցին փնտռելուց ու քննելուց։ "},
	{8, "8 Թող մարդ մերձենայ իր սրտի խորութեամբ, եւ Աստուած թող բարձր լինի։ "},
	{9, "9 Մանուկների նետարձակումները խոցեցին նրանց, նրանց լեզուները տկարացան, եւ բոլոր նրանց տեսնողները պիտի խռովուեն։ "},
	{10, "10 Բոլոր մարդիկ վախեցան ու պատմեցին Աստծու գործերը եւ հասու եղան նրա արածներին։ "},
	{11, "11 Արդարը պիտի ուրախանայ Տիրոջով՝ յոյսը դնելով նրա վրայ. սրտով շիտակ բոլոր մարդիկ պիտի պարծենան նրանով։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view64() {
struct hy64 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի. Երեմիայի, Եզեկիէլի եւ ժողովրդի օրհնութիւնը, երբ ուզում էին վերադառնալ պանդխտութիւնից "},
	{2, "2 Աստուա՛ծ, քեզ վայել է օրհնութիւն Սիոնում, եւ քեզ աղօթք պիտի մատուցուի Երուսաղէմում։ "},
	{3, "3 Լսի՛ր աղօթքս, քանզի քեզ մօտ է գալու ամէն մարմին։ "},
	{4, "4 Անօրէնների խօսքերը ծանրացան մեզ վրայ, դո՛ւ պիտի քաւութիւն տաս մեր ամբարշտութիւններին։ "},
	{5, "5 Երանի նրանց, որոնց ընտրեցիր ու ընդունեցիր, որ բնակուեն քո գաւիթներում։ Մենք պիտի յագենանք քո տան բարիքներից, սուրբ է քո տաճարը։ "},
	{6, "6 Սքանչելի արդարութեամբ լսի՛ր մեզ, Աստուա՛ծ, փրկի՛չ մեր՝ յոյսը երկրի բոլոր ծագերի եւ հեռաւոր ծովաբնակների։ "},
	{7, "7 Նա, որ իր կարողութեամբ լեռներ է հաստատումեւ զօրութիւն է հագել։ "},
	{8, "8 Նա, որ ալեկոծում է ծովի ընդարձակութիւնըեւ ցածրացնում նրա ալիքների ձայնը։ "},
	{9, "9 Հեթանոսները պիտի խռովուեն, եւ երկրի բնակիչները պիտի սարսափեն քո նշաններից, այգաբացին ու երեկոյեան պիտի զուարճանան։ "},
	{10, "10 Նայեցիր երկրին, ջրով յագեցրիր այն եւ բազմացրիր նրա հարստութիւնը։ Աստծու գետը լցուեց ջրով. դու պատրաստեցիր նրա կերակուրը, քանզի այսպէս է պատրաստութիւնը. "},
	{11, "11 դու ոռոգեցիր նրա ակօսն ու բազմացրիր նրա արմտիքը, քո ցօղը զուարթ պիտի դարձնի նրա բոյսը։ "},
	{12, "12 Տարուայ պսակը պիտի օրհնուի քո քաղցրութեամբ, դաշտերդ պարարտութեամբ պիտի լցուեն։ "},
	{13, "13 Անապատի գեղեցկութիւնները պիտի փթթեն, բլուրները ցնծութեամբ պիտի զգեստաւորուեն։ "},
	{14, "14 Մաքիների խոյերը պիտի զուգուեն, հովիտներն առատ ցորեն պիտի բերեն, պիտի ցնծան ու օրհներգեն։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view65() {
struct hy65 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի. յարութեան մասին "},
	{2, "2 Աղաղակեցէ՛ք Աստծուն, բոլո՛ր երկրներ, սաղմո՛ս երգեցէք նրա անուանը եւ փա՛ռք տուէք նրա օրհնութեանը։ "},
	{3, "3 Ասացէ՛ք Աստծուն. Որքա՜ն ահեղ են քո գործերը. ի տես քո մեծ զօրութեանքո թշնամիները ստեցին քո դէմ։ "},
	{4, "4 Ողջ աշխարհը պիտի երկրպագի քեզ, սաղմոս պիտի երգի քեզ ու քո անուանը սաղմոս ձօնի։ "},
	{5, "5 Եկէ՛ք եւ տեսէ՛ք գործերն Աստծու, թէ որքան ահեղ են խորհուրդներով՝ քան գործերը մարդկանց բոլոր որդիների։ "},
	{6, "6 Նա էր, որ ծովը ցամաք դարձրեց, եւ մարդիկ ոտքով անցան գետի միջով։ "},
	{7, "7 Ահա պիտի ցնծանք նրանով, որ յաւէտ տիրում է իր զօրութեամբ։ Նրա աչքերը նայում են հեթանոսներին, որոնք դառնացրին իրեն. թող նրանք չպարծենան իրենց հոգում։ "},
	{8, "8 Օրհնեցէ՛ք, հեթանոսնե՛ր, մեր Աստծուն եւ լսելի՛ դարձրէք նրա օրհնութեան ձայնը։ "},
	{9, "9 Նա իմ հոգին դարձրեց կեանքին եւ թոյլ չտուեց, որ ոտքերս դողան։ "},
	{10, "10 Քննեցիր մեզ, Աստուա՛ծ, ու փորձեցիր, ինչպէս արծաթն է փորձւում։ "},
	{11, "11 Մեզ որոգայթի մէջ գցեցիր, նեղութիւն դրիր մեր թիկունքին, "},
	{12, "12 եւ մարդկանց անցկացրիր մեր գլխի վրայով։ Մենք անցանք հրի ու ջրի միջով, բայց դու մեզ անդորր տուիր։ "},
	{13, "13 Զոհաբերութիւններով պիտի մտնեմ տունը քո եւ քեզ պիտի հատուցեմ իմ ուխտերը, "},
	{14, "14 որ խոստացան քեզ իմ շրթունքները, եւ բերանն իմ խօսեց նեղութեան մէջ։ "},
	{15, "15 Պարարտ ողջակէզներ պիտի մատուցեմ քեզ՝ խոյերով ու խնկերով, քեզ պիտի մատուցեմ արջառներ ու նոխազներ։ "},
	{16, "16 Եկէ՛ք ու լսեցէ՛ք ինձ, Աստծու բոլո՛ր երկիւղածներ, որ ձեզ պատմեմ, թէ ինչ արեց նա իմ անձի համար։ "},
	{17, "17 Ես նրան դիմեցի իմ բերանով, եւ լեզուովս մեծարեցի նրան։ "},
	{18, "18 Եթէ սրտումս մեղք տեսնէի, Տէրն ինձ չէր ունկնդրի։ "},
	{19, "19 Դրա համար Աստուած լսեց ինձ եւ ուշ դարձրեց իմ խնդրանքի ձայնին։ "},
	{20, "20 Օրհնեալ է Աստուած, որ չվանեց աղօթքն իմ, ոչ էլ ողորմութիւնն իր՝ ինձնից։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view66() {
struct hy66 poems[] = {
	{1, "1 Այսուհետեւ՝ Դաւթի օրհնութեան սաղմոսը. "},
	{2, "2 Աստուա՛ծ, ողորմի՛ր մեզ եւ օրհնի՛ր, ցո՛յց տուր երեսդ եւ գթա՛ մեզ, "},
	{3, "3 որպէսզի երկրի վրայ ճանաչեն ճանապարհը քո, եւ բոլոր ազգերի մէջ՝ փրկութիւնը քո։ "},
	{4, "4 Ժողովուրդները քեզ գոհութիւն պիտի մատուցեն, Աստուա՛ծ,գոհութիւն պիտի մատուցեն քեզ բոլոր ժողովուրդները։ "},
	{5, "5 Պիտի ուրախանան ու ցնծան ազգերը, քանզի դու արդարութեամբ ես դատում ժողովուրդներին եւ երկրի ազգերին դու ես առաջնորդում։ "},
	{6, "6 Թող ժողովուրդները քեզ օրհնաբանեն, Աստուա՛ծ, թող գոհութիւն մատուցեն քեզ բոլոր ժողովուրդները։ "},
	{7, "7 Երկիրը տուեց իր պտուղը, եւ Աստուած, Աստուածը մեր, օրհնեց մեզ։ "},
	{8, "8 Մեր Աստուածը պիտի օրհնի մեզ, եւ երկրի բոլոր ծագերում պիտի սոսկան նրանից։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view67() {
struct hy67 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի "},
	{2, "2 Թող ելնի Աստուած, նրա բոլոր թշնամիները թող ցրուեն,ու նրան ատողները փախչեն իր առջեւից։ "},
	{3, "3 Ինչպէս ծուխն է ցնդում, այնպէս պիտի անհետանան նրանք.ինչպէս մոմն է հալւում կրակի դիմաց,այնպէս էլ մեղաւորները պիտի կորչեն Աստծու երեսից։ "},
	{4, "4 Արդարները թող ուրախ լինեն, թող ցնծան նրա առջեւ եւ զուարճանան իրենց ուրախութեամբ։ "},
	{5, "5 Օրհնեցէ՛ք Աստծուն, սաղմո՛ս երգեցէք նրա անուանը, ճանապա՛րհ տուէք նրան, ով նստում է արեւմուտքում. եւ Տէր է անունը նրա։ Թող մարդիկ ցնծան նրա առջեւ, եւ թող խռովուեն նրա երեսից, "},
	{6, "6 որ հայրն է որբերի ու դատաւորն այրիների՝ Աստուած իր սուրբ բնակարանում։ "},
	{7, "7 Աստուած բնակեցնում է միայնակներին տան մէջեւ իր քաջութեամբ ազատում գերեալներին ու դառնացած գերեզմանաբնակներին։ "},
	{8, "8 Աստուա՛ծ, երբ քայլեցիր քո ժողովրդի առջեւից, երբ անցար անապատով, "},
	{9, "9 ցնցուեց երկիրը, եւ երկինքը ցօղ թափեց Սինայում՝ Աստծու շնորհիւ, Իսրայէլի Աստծու առջեւ։ "},
	{10, "10 Ցանկալի անձրեւ պատրաստեցիր, Աստուա՛ծ, քո ժառանգութեան համար, որը թէեւ տկարացաւ, բայց դու ոտքի կանգնեցրիր նրան։ "},
	{11, "11 Եւ քո ժողովուրդը պիտի բնակուի նրա մէջ։Աստուա՛ծ, քո քաղցրութեամբ պատրաստութիւն տեսար աղքատի համար։ "},
	{12, "12 Տէրը պատգամ պիտի տայ նրանց, ովքեր մեծ զօրութեամբ աւետիս են տալիս։ "},
	{13, "13 Սիրելիիդ զօրքերի թագաւո՛ր, քո տան գեղեցկութիւնը մատնուեց աւարի։ "},
	{14, "14 Թէկուզեւ ննջէք կալուածքների մէջ, արծաթապատ թեւերով եւ ոսկեգոյն թիկնամէջով աղաւնի կը լինէք։ "},
	{15, "15 Երբ երկնաւորը թագաւորներին հաւաքի այնտեղ, նրանք ձեան պէս կը թափուեն Սաղմոնի լերան վրայ։ "},
	{16, "16 Աստծու լեռը պարարտ լեռ է, հաստատուն լեռ եւ պարարտ լեռ։ "},
	{17, "17 Ո՛վ հպարտ լեռներ, ի՞նչ էք նախանձում այն լերանը, որտեղ բարեհաճեց բնակուել Աստուած, եւ Տէրն իսկ բնակուելու է այնտեղ յաւիտեան։ "},
	{18, "18 Աստծու կառքերը բիւրապատիկ են՝ հազարաւոր կառավարներով, որոնց մէջ է Տէրն իր սուրբ Սինայից։ "},
	{19, "19 Նա ելաւ բարձունքներն ու գերեվարեց գերիներին. աւար առաւ, պարգեւներ բաշխեց ու տուեց մարդկանց որդիներին, որ թերահաւատներն անգամ բնակուեն այնտեղ։ "},
	{20, "20 Օրհնեալ է Տէր Աստուածը, օրհնեալ է Տէրն ամէն օր. Աստուած՝ փրկիչը մեր, պիտի առաջնորդի մեզ։ "},
	{21, "21 Աստուած մեր կենարար Աստուածն է, եւ Տիրոջ ձեռքում է ելքը մահուան։ "},
	{22, "22 Սակայն Աստուած պիտի փշրի մեր թշնամիների գլուխը եւ կարճամազ պիտի պահի նրանց, ովքեր ընթանում են իրենց անօրէնութեամբ։ "},
	{23, "23 Տէրն ասաց. Անդունդների խորքից ես պիտի վերադարձնեմ եւ ժանիքների միջից դուրս կորզեմ նրան։ "},
	{24, "24 Այնպէս որ ոտքդ արեան մէջ թրջուի, եւ քո շների լեզուները թրջուեն թշնամիներիդ արիւնից։ "},
	{25, "25 Երեւաց քո երթն, Աստուա՛ծ, Աստծու՝ մեր սուրբ թագաւորի երթը։ "},
	{26, "26 Իշխաններն առաջ անցան օրհնութիւն մատուցելու կոյսերի եւ գովերգուների մէջ։ "},
	{27, "27 Խմբովին օրհնեցէ՛ք Աստծուն,Տիրոջը՝ Իսրայէլի աղբիւրների կողմից։ "},
	{28, "28 Այնտեղ են Բենիամին զարմանահրաշ մանուկը, Յուդայի երկրի առաջնորդ իշխանները եւ Զաբուղոնի ու Նեփթաղիմի իշխանները։ "},
	{29, "29 Հրամայի՛ր, Աստուա՛ծ, քո զօրութեամբ,զօրացրո՛ւ այն, ինչ հաստատեցիր մեր մէջ։ "},
	{30, "30 Երուսաղէմի քո տաճարից թագաւորները թող ընծաներ մատուցեն։ "},
	{31, "31 Սաստի՛ր եղէգնուտի գազանին՝ ցուլերի ու երինջների երամակներով հանդերձ։ Թող արհամարհուեն նրանք, ովքեր ընտրուել են արծաթով։ Ցրի՛ր հեթանոսներին ու պատերազմ կամեցողներին։ "},
	{32, "32 Եգիպտոսից պատգամաւորներ պիտի գան, եւ հնդիկներն աւելի առաջ ձեռք պիտի մեկնեն Աստծուն։ "},
	{33, "33 Աշխարհի՛ թագաւորութիւններ, օրհնեցէ՛ք Աստծուն, եւ սաղմո՛ս երգեցէք Տիրոջը։ "},
	{34, "34 Ճանապա՛րհ բացէք նրա համար, ով նստում է երկինքների երկնքում, արեւելեան կողմում։ Ահա նա ձայն պիտի տայ, ձայնն իր զօրութեան։ "},
	{35, "35 Փա՛ռք տուէք Աստծուն. նրա մեծ վայելչութիւնն Իսրայէլի վրայ է, իսկ զօրութիւնը հասնում է մինչեւ երկնքի ամպերը։ "},
	{36, "36 Սքանչելի է Աստուած իր սրբերի մէջ. նա Աստուածն է Իսրայէլի, որ իր ժողովրդին հաստատ զօրութիւն պիտի տայ. օրհնեալ է Աստուած։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view68() {
struct hy68 poems[] = {
	{1, "1 Այսուհետեւ՝ անցած ժամանակների մասին սաղմոս Դաւթի "},
	{2, "2 Փրկի՛ր ինձ, Աստուա՛ծ, քանզի ջրերը հասան իմ անձին, ես ընկղմուեցի խոր անդնդի մէջ, որտեղ ինձ համար հանգիստ չկայ։ "},
	{3, "3 Մտայ ես խորքերը ծովի, եւ յորձանքներն ինձ ընկղմեցին։ "},
	{4, "4 Ես յոգնեցի աղաղակելուց, կոկորդն իմ կերկերաց, եւ աչքերս նուաղեցին քեզ վրայ յոյս դնելուց, Տէ՛ր իմ Աստուած։ "},
	{5, "5 Գլխիս մազերից շատ եղան նրանք, ովքեր յանիրաւի ատում էին ինձ, թշնամիներս եւ ինձ իզուր ատողները զօրացան ինձնից աւելի,իմ չյափշտակած բաների համար ես վճարեցի նրանց։ "},
	{6, "6 Աստուա՛ծ, դու իմացար անմտութիւնն իմ, եւ յանցանքներս չծածկուեցին քեզնից։ "},
	{7, "7 Թող իմ պատճառով չամաչեն քեզ սպասողները, Տէ՛ր, զօրութիւնների՛ Տէր. թող իմ պատճառով չամաչեն քեզ փնտռողները, Աստուա՛ծ Իսրայէլի։ "},
	{8, "8 Քեզ համար նախատինք հանդուրժեցի, եւ ամօթը ծածկեց երեսն իմ։ "},
	{9, "9 Եղբայրներիս համար ես օտար եղայ, եւ մօրս որդիների համար՝ հիւր։ "},
	{10, "10 Քո տան նախանձախնդրութիւնն ինձ կերաւ, եւ նախատողներիդ նախատինքն ընկաւ ինձ վրայ։ "},
	{11, "11 Ծոմապահութեամբ խոնարհեցրի ինձ, եւ դա ինձ համար նախատինք եղաւ։ "},
	{12, "12 Քուրձն ինձ հագուստ դարձրի, եւ նրանց համար ծաղրուծանակի առարկայ եղայ։ "},
	{13, "13 Ինձ չարախօսում էին դռանը նստողները, գինի խմողները ծաղրում էին ինձ։ Ընդունելի ժամին ես աղօթում էի քեզ, Տէ՛ր։ Լսի՛ր ինձ, Աստուա՛ծ, քո առատ ողորմութեամբ, քո փրկութեան ճշմարտութեամբ։ "},
	{14, "14 Ազատի՛ր ինձ ցեխից, որ չխրուեմ եւ փրկուեմ իմ ատելիներից ու խոր ջրերից։ "},
	{15, "15 Ջրերի յորձանքները թող չկլանեն ինձ, եւ անդունդներն ինձ թող չընկղմեն, ոչ էլ ջրհորն ինձ վրայ բերանն իր փակի։ "},
	{16, "16 Լսի՛ր ինձ, Տէ՛ր, քանզի քաղցր է ողորմութիւնը քո, նայի՛ր ինձ քո գթառատութեամբ։ "},
	{17, "17 Եւ մի՛ շրջիր երեսդ քո ծառայից, փութով լսի՛ր ինձ, քանզի նեղութեան մէջ եմ ես։ "},
	{18, "18 Հայեացքդ դարձրո՛ւ ինձ վրայ ու փրկի՛ր ինձ, եւ իմ թշնամիներից ինձ պահպանի՛ր։ "},
	{19, "19 Դու գիտես իմ կրած նախատինքն ու ամօթը եւ խայտառակութիւնն իմ։ "},
	{20, "20 Քո առջեւ են բոլոր ինձ նեղողները։ Սիրտս համբերեց նախատինքների եւ թշուառութեան։ Սպասում էի, թէ ո՞վ ինձ արդեօք պիտի վշտակցէր, բայց ոչ ոք չկար, եւ ինձ համար մխիթարիչ չգտնուեց։ "},
	{21, "21 Կերակրի տեղ ինձ լեղի տուին, եւ ծարաւելիս քացախ խմեցրին։ "},
	{22, "22 Թող նրանց սեղաններն իրենց առջեւ դառնան որոգայթ, պատիժ ու գայթակղութիւն։ "},
	{23, "23 Թող նրանց աչքերը խաւարեն, որպէսզի չտեսնեն, եւ նրանց թիկունքը միշտ ծռա՛ծ պահիր։ "},
	{24, "24 Նրանց վրայ թափի՛ր քո զայրոյթը, եւ քո բարկութեան սաստկութիւնը թող հարուածի նրանց։ "},
	{25, "25 Նրանց բնակավայրերը թող աւերակ դառնան, եւ նրանց յարկերի տակ ոչ ոք չապրի. "},
	{26, "26 քանզի ում որ դու հարուածեցիր՝ նրանք հալածեցին, եւ իմ վէրքերին ցաւեր աւելացրին։ "},
	{27, "27 Նրանց մեղքերին մեղքե՛ր գումարիր, որպէսզի մուտք չունենան քո արդարութեան մէջ։ "},
	{28, "28 Թող նրանք ջնջուեն կեանքի քո մատեանից, եւ քո արդարների շարքում չարձանագրուեն։ "},
	{29, "29 Աղքատ ու վշտացած եմ ես. թող քո պարգեւած փրկութիւնն, Աստուա՛ծ, ինձ բռնած պահի։ "},
	{30, "30 Օրհնութեամբ պիտի օրհնեմ անունն իմ Աստծու, եւ գովաբանութեամբ պիտի մեծարեմ նրան։ "},
	{31, "31 Դա հաճելի կը լինի Աստծուն՝ մատաղացու հորթից աւելի, որ եղջիւրներ ու կճղակներ ունի։ "},
	{32, "32 Աղքատները կը տեսնեն ու կ՚ուրախանան. փնտռեցէ՛ք Աստծուն, եւ ձեր հոգիները կը փրկուեն, "},
	{33, "33 քանզի Տէրը լսեց տնանկներին, եւ իր գերեալներին չարհամարհեց։ "},
	{34, "34 Թող նրան օրհնեն երկինքն ու երկիրըեւ ծովն իր մէջ վխտացող բոլոր կենդանի էակներով։ "},
	{35, "35 Աստուած կը փրկի Սիոնը, եւ Հրէաստանի քաղաքները կը ծաղկեն։Մարդիկ կը կառուցեն, կը բնակեցնեն ու կը ժառանգեն այն։ "},
	{36, "36 Քո ծառաների սերունդները կը հաստատուեն այնտեղ, եւ քո անունը սիրողները կը բնակուեն նրա մէջ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view69() {
struct hy69 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի ի յիշատակ այն բանի, որ Տէրը փրկեց նրան "},
	{2, "2 Աստուա՛ծ, ինձ օգնութեա՛ն հասիր. Տէ՛ր, փութա՛ ընկերակցել ինձ։ "},
	{3, "3 Թող խայտառակուեն ու ամօթահար լինեն ինձ հետապնդողները, թող ետ դառնան ու անարգուեն իմ մասին չար խորհողները։ "},
	{4, "4 Թող խայտառակուած ընկրկեն նրանք, ովքեր ինձ վա՜շ վա՜շ էին ասում։ "},
	{5, "5 Թող ցնծան եւ քեզնով ուրախանան բոլոր նրանք, ովքեր փնտռում են քեզ, Տէ՛ր։ Քո պարգեւած փրկութիւնը սիրողները թող միշտ ասեն. Մե՛ծ է Աստուած։ "},
	{6, "6 Ես աղքատ եւ տնանկ եմ, Աստուա՛ծ, օգնի՛ր ինձ. օգնականն ու փրկիչն իմ դո՛ւ ես. Տէ՛ր իմ, մի՛ ուշացիր։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view70() {
struct hy70 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի, Յոնադաբի որդիներից եւ առաջին գերութիւնից "},
	{2, "2 Տէ՛ր, յոյսս քեզ վրայ դրի, թող յաւէտ ամօթով չմնամ, քո արդարութեամբ ինձ փրկի՛ր ու պահպանի՛ր։ Ականջդ մօտեցրո՛ւ ինձ եւ ազատի՛ր ինձ։ "},
	{3, "3 Ինձ համար ապաւէն եւ ամուր վա՛յր եղիր, Աստուա՛ծ, որ ինձ փրկես, քանզի իմ հիմքն ու յենարանը դու ես։ "},
	{4, "4 Աստուա՛ծ իմ, փրկի՛ր ինձ մեղաւորի ձեռքից, անօրէնի եւ անիրաւի ձեռքից։ "},
	{5, "5 Դու ես իմ ակնկալութիւնը, Տէ՛ր. Տէ՛ր, դո՛ւ ես իմ յոյսը մանկութիւնիցս ի վեր։ "},
	{6, "6 Քե՛զ կռուան ունեցայ ես արգանդից, մօրս որովայնից դո՛ւ ես իմ ապաւէնը, եւ յարաժամ քեզնի՛ց է իմ օգնութիւնը։ "},
	{7, "7 Ես շատերի համար ծաղր դարձայ, բայց դու իմ օգնականն ու քաջալերողը եղար։ "},
	{8, "8 Բերանս թող գովաբանութեամբ լցուի, որ օրհնեմ փառքը քո եւ յաւիտեան՝ քո մեծ վայելչութիւնը։ "},
	{9, "9 Ծերութեան ժամանակ ինձ մի՛ վանիր, Տէ՛ր. երբ ուժս պակասի՝ դու ինձ մի՛ լքիր։ "},
	{10, "10 Թշնամիներս իմ մասին խօսեցինեւ ինձ պաշարողները միասին խորհուրդ արեցին ու ասացին. "},
	{11, "11 Աստուած լքել է նրան, հալածենք նրան ու հասնենք նրա վրայ, քանզի չկայ մէկը, որ նրան փրկի։ "},
	{12, "12 Աստուա՛ծ իմ, հեռու մի՛ մնա ինձնից, եւ ինձ օգնութեա՛ն հասիր, Աստուա՛ծ։ "},
	{13, "13 Թող ամաչեն ու կորստեան մատնուեն ինձ չարախօսողները, թող ամօթանք ու խայտառակութիւն կրեն իմ դէմ չար խորհողները։ "},
	{14, "14 Ես յարաժամ պիտի յուսամ եւ աւելի ու աւելի պիտի օրհնեմ քեզ։ "},
	{15, "15 Բերանս պիտի պատմի քո արդարութիւնն ու ամէն օր՝ քո գովքը, եւ ես մատեանում արձանագրուած դրանց թիւը չպիտի խարդախեմ։ "},
	{16, "16 Ես պիտի մտնեմ Տիրոջ զօրութեան տակեւ պիտի յիշեմ քո արդարութիւնը միայն, Տէ՛ր։ "},
	{17, "17 Աստուա՛ծ իմ, ինձ սովորեցրիր մանկութիւնից ի վեր, եւ այժմ էլ քո արդարութիւնը պիտի պատմեմ։ "},
	{18, "18 Մինչեւ իմ ալեւորութիւնն ու ծերութիւնը ինձ մի՛ լքիր, Աստուա՛ծ իմ, մինչեւ որ գալիք բոլոր սերունդներին պատմուի ուժը քո բազկի։ Քո զօրութիւնն ու արդարութիւնը հասնում են մինչեւ բարձունքները, "},
	{19, "19 Նոյնպէս եւ քո մեծամեծ գործերը, ո՛վ Աստուած. ո՞վ է քեզ նման։ "},
	{20, "20 Որքան էլ որ բազում նեղութիւն եւ չարչարանք ցոյց տուիր ինձ, դարձեալ մխիթարեցիր ինձ եւ հանեցիր երկրի խոր անդունդներից։ "},
	{21, "21 Բազմապատկեցիր քո զօրութիւնը, դարձեալ մխիթարեցիր ինձ եւ մի անգամ եւս հանեցիր երկրի խոր անդունդներից։ "},
	{22, "22 Եւ արդ, սաղմոսերգութեամբ գոհութիւն պիտի մատուցեմ քեզ, ճշմարի՛տդ Աստուած. պիտի օրհնութեամբ սաղմոս երգեմ քեզ, ո՛վ սուրբդ Իսրայէլի։ "},
	{23, "23 Երբ քեզ սաղմոս երգեմ, պիտի ցնծան շրթունքներն իմ, եւ իմ հոգին, որը դո՛ւ փրկեցիր։ "},
	{24, "24 Ու լեզուս ամէն օր քո արդարութունից պիտի խօսի։ Իր ժամանակին պիտի խայտառակուեն ու ամօթահար լինեն իմ մասին չար խորհողները։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view71() {
struct hy71 poems[] = {
	{1, "1 Սաղմոս Սողոմոնի համար. "},
	{2, "2 Աստուա՛ծ, դատաստանդ արքայի՛ն տուր, եւ արդարութիւնդ՝ թագաւորի որդո՛ւն, որ քո ժողովրդին արդարութեամբ դատի ու քո աղքատների իրաւունքը պահի։ "},
	{3, "3 Լեռները խաղաղութիւն կը բերեն ժողովրդին, եւ բլուրներն՝ արդարութիւն։ "},
	{4, "4 Թող արքան իրաւունք տայ ժողովրդի աղքատներին, պահպանի տնանկների որդիներին, եւ ընկճի ամբարտաւաններին։ "},
	{5, "5 Նա թող ապրի ու մնայ որքան որ արեւը լինի, լուսնից առաջ, սերնդից սերունդ։ "},
	{6, "6 Նա թող իջնի որպէս անձրեւ հնձած խոտի վրայեւ որպէս ցօղ՝ երկրի վրայ։ "},
	{7, "7 Նրա օրօք արդարութիւն եւ մեծ խաղաղութիւն թող տիրի, մինչեւ լուսնի վախճանը։ "},
	{8, "8 Նա թող իշխի ծովից մինչեւ ծով, եւ գետերից մինչեւ ծագերն աշխարհի։ "},
	{9, "9 Հնդիկները ծնկի թող գան նրա առջեւ, եւ նրա թշնամիները հող ուտեն։ "},
	{10, "10 Թարսիսի եւ կղզիների թագաւորները նուէրներ թող մատուցեն նրան, Արաբիայի եւ Սաբայի արքաներն ընծաներ թող բերեն նրան։ "},
	{11, "11 Աշխարհի բոլոր թագաւորները թող խոնարհուեն նրա առաջ,եւ բոլոր ազգերը թող ծառայեն նրան, "},
	{12, "12 քանզի հզօրի ձեռքից նա փրկեց աղքատին՝ աղքատին ու տնանկին, որոնք օգնական չունեն։ "},
	{13, "13 Նա կը խղճայ աղքատին ու տնանկին, եւ տնանկների հոգին կը փրկի։ "},
	{14, "14 Չար վաշխառուներից կ՚ազատի նրանց։Նրա անունը փառաւոր է նրանց առաջ։ "},
	{15, "15 Նա կ՚ապրի, եւ արաբների ոսկին նրան պիտի տրուի։Ամէն ժամ աղօթքի կը կանգնեն նրա առջեւ եւ գիշեր-ցերեկ կ՚օրհնեն նրան։ "},
	{16, "16 Ամբողջ երկրում եւ լեռների գագաթներին հաստատութիւն կը տիրի։Նրա բերքի առատութիւնը Լիբանանից աւելի բարձր կը լինի, Տիրոջ քաղաքում նա կը ծաղկի երկրի խոտի նման։ "},
	{17, "17 Տիրոջ անունը կ՚օրհնուի յաւիտեան, քանզի արեւից հին է անունը նրա։ Աշխարհի բոլոր ազգերը կ՚օրհնեն նրան, եւ բոլոր ժողովուրդները երանի կը տան նրան։ "},
	{18, "18 Օրհնեալ է Իսրայէլի Տէր Աստուածը, որ միայն ինքն է սքանչելիքներ գործում։ "},
	{19, "19 Եւ օրհնեալ է յաւիտեան սուրբ անունը նրա փառքի, թող նրա փառքով ողջ երկիրը լցուի. թող լինի, թող լինի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view72() {
struct hy72 poems[] = {
	{1, "1 Որքա՜ն բարի է Աստուած Իսրայէլի համարեւ սրտով շիտակների համար։ "},
	{2, "2 Բայց ոտքերս քիչ մնաց, որ սասանուէին, մի փոքր եւս՝ եւ քայլերս պիտի մոլորուէին։ "},
	{3, "3 Նախանձեցի ես անօրէններին՝ մեղաւորների խաղաղութիւնը տեսնելով։ "},
	{4, "4 Նրանք մահուան տագնապ չունեն։ Սովորական են տանջանքները նրանց։ "},
	{5, "5 Մարդկանց տքնութիւնը չեն կրում նրանք, եւ մարդկանց պէս չեն տանջւում։ "},
	{6, "6 Դրա համար ամբարտաւանութիւնը պատեց նրանց, եւ նրանք համակուեցին իրենց ամբարշտութեամբ ու անիրաւութեամբ։ "},
	{7, "7 Նրանց անիրաւութիւնները կարծես ճարպից են դուրս գալիս, քանզի նրանք իրենց սրտի խորհրդով են շարժւում։ "},
	{8, "8 Չարամտօրէն մտածեցին ու խօսեցինեւ մեծամտութեամբ ապիրատութիւն խորհեցին։ "},
	{9, "9 Բերաններն իրենց ուղղեցին երկնքին, եւ լեզուները երկրով մէկ քարշ տուին։ "},
	{10, "10 Դրա համար ժողովուրդն իմ պիտի վերադառնայ այստեղ, եւ իմ օրերը լեցուն պիտի անցնեն նրանց հետ։ "},
	{11, "11 Ասացին՝ Ինչպէ՞ս իմացաւ Աստուած, կամ՝ Կա՞յ արդեօք իմացութիւն Բարձրեալի մօտ։ "},
	{12, "12 Ահա մեղաւոր են, եւ սակայն բարգաւաճում են նրանք, կան եւ ունեն հարստութիւնն աշխարհի։ "},
	{13, "13 Ասացի՝ Իզուր ուրեմն արդար դարձրի սիրտն իմ, եւ ձեռքերս սրբութեամբ լուացի։ "},
	{14, "14 Գիշեր-ցերեկ ես խոշտանգուած էի, եւ առաւօտները կշտամբանք կրեցի։ "},
	{15, "15 Թէպէտ ես ասում էի, թէ՝ եթէ այսպէս պատմեմ, դիմացս պիտի գտնեմ քո որդիների սերնդին,որոնց ուխտ արեցի։ "},
	{16, "16 Բայց հասկացայ, որ սա եւս դժուար է ինձ համար, "},
	{17, "17 մինչեւ մտնեմ Աստծու սրբարանըեւ իմանամ նրանց վախճանը։ "},
	{18, "18 Բայց դու նրանց տարագիր կ՚անես իրենց նենգութեան համարեւ կը կործանես նրանց իրենց ամբարտաւանութեան մէջ։ "},
	{19, "19 Իսկ ինչպէ՞ս նրանք յանկարծակի աւերակ դարձան, կործանուեցին, սպառուեցին ու անհետացան իրենց անօրէնութեան համար "},
	{20, "20 եւ եղան ինչպէս քնից արթնացող մարդու երազ։ Տէ՛ր, դու, արթնանալով, պիտի անարգես նրանց երազի պատկերը. "},
	{21, "21 քանզի հուր բորբոքուեց իմ սրտում, եւ երիկամներս գունափոխուեցին։ "},
	{22, "22 Ես արհամարհուած եղայ ու չիմացայ այդ, քո առջեւ անասուն համարուեցի։ "},
	{23, "23 Բայց ես միշտ քեզ հետ եմ. դու բռնեցիր իմ աջ ձեռքից, "},
	{24, "24 քո խորհուրդներով ինձ առաջնորդեցիր եւ փառքով ընդունեցիր ինձ։ "},
	{25, "25 Արդարեւ, ինձ համար ի՞նչ կայ երկնքում, կամ քեզնից բացի ի՞նչ փնտռեմ երկրի վրայ։ "},
	{26, "26 Սիրտս ու մարմինս մաշուեցին, իմ սրտի՛ Աստուած, յաւիտեան ինձ բաժի՛ն ընկած Աստուած։ "},
	{27, "27 Ահաւասիկ իրենց անձը քեզնից հեռացնողները պիտի կորչեն, դու պիտի կործանես բոլոր նրանց, ովքեր ապստամբեցին քո դէմ։ "},
	{28, "28 Ինձ համար բարիք է մերձենալ Աստծուն, յոյսս դնել Տիրոջ վրայեւ աւետել քո ամբողջ օրհնութիւնը Սիոնի դստեր դռների առաջ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view73() {
struct hy73 poems[] = {
	{1, "1 Աստուա՛ծ, ինչո՞ւ մերժեցիր ընդմիշտ, եւ զայրոյթդ սաստկացաւ քո արօտի ոչխարների վրայ։ "},
	{2, "2 Յիշի՛ր քո ժողովրդին, որ սկզբից ստացար, եւ փրկեցիր քեզ վիճակուած ժառանգութիւնը՝ լեռն այս Սիոնի, որտեղ դու բնակուեցիր։ "},
	{3, "3 Նրանց ամբարտաւանութեան վրայ բարձրացրո՛ւ քո ձեռքն ընդմիշտ, քանզի թշնամին անիրաւութիւն գործեց քո սրբարանում։ "},
	{4, "4 Քեզ ատողները պարծեցան իրենց բարօրութեամբ, նշաններն իրենց իբրեւ զինանշան դրին մուտքին, "},
	{5, "5 բայց իրենք չհասկացան, որ վերից է ելքը։ "},
	{6, "6 Ինչպէս անտառի փայտահատներ, կացիններով ջարդեցին դռները նրա, տապարներով ու մուրճերով կործանեցին այն։ "},
	{7, "7 Հրի մատնեցին քո սրբարանը, եւ հողին հաւասարեցրին քո անուան խորանը։ "},
	{8, "8 Նրանց ազգակիցներն իրենց սրտում միասնաբար ասացին. Եկէք վերացնենք Աստծու բոլոր տօներն երկրի երեսից։ "},
	{9, "9 Նշաններ մենք չտեսանք, այլեւս մարգարէ չմնաց, եւ ոչ ոք մեզ չի ճանաչում։ "},
	{10, "10 Մինչեւ ե՞րբ, Աստուա՛ծ, թշնամին պիտի նախատի եւ հակառակորդն անարգի սուրբ անունդ։ "},
	{11, "11 Ինչո՞ւ ես ետ քաշում քո ձեռքը, եւ քո աջը ծոցիդ մէջ է ընդմիշտ։ "},
	{12, "12 Աստուա՛ծ, դու մեր թագաւորն ես յաւիտենութիւնից ի վեր, դու, որ փրկութիւն գործեցիր երկրի վրայ։ "},
	{13, "13 Դու քո զօրութեամբ ծովը հաստատեցիր, եւ վիշապների գլուխը խորտակեցիր ջրերում։ "},
	{14, "14 Դու վիշապի գլուխը փշրեցիր եւ որպէս կերակուր տուիր հնդիկների զօրքերին։ "},
	{15, "15 Դու աղբիւրներ ու վտակներ բխեցրիր, եւ անցամաքելի գետեր ցամաքեցրիր։ "},
	{16, "16 Քոնն է ցերեկը, եւ քոնն է գիշերը, լոյսն ու արեւը դո՛ւ հաստատեցիր։ "},
	{17, "17 Դո՛ւ հաստատեցիր երկրի բոլոր սահմանները, գարունն ու ամառը դո՛ւ ստեղծեցիր։ "},
	{18, "18 Յիշի՛ր այս. թշնամին նախատեց Տիրոջը, անզգամ ժողովուրդն անարգեց քո սուրբ անունը։ "},
	{19, "19 Քեզ խոստովանողին մի՛ մատնիր գազաններին, եւ քո տնանկներին մի՛ մոռացիր երբեք։ "},
	{20, "20 Նայի՛ր քո ուխտին, քանզի ապշահարների տները երկրի վրայ լցուեցին անիրաւութեամբ։ "},
	{21, "21 Թող խեղճն ամօթով ետ չդառնայ, եւ աղքատն ու տնանկը թող օրհնեն սուրբ անունդ։ "},
	{22, "22 Ելի՛ր, Աստուա՛ծ, եւ կատարի՛ր դատաստանդ, յիշի՛ր անզգամի ամենօրեայ նախատինքը։ "},
	{23, "23 Մի՛ մոռացիր պաշտօնեաներիդ ձայնը. քեզ ատողների ամբարտաւանութիւնն անընդհատ պիտի աճի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view74() {
struct hy74 poems[] = {
	{1, "1 Այսուհետեւ՝ մի՛ ապականիր. Ասափի օրհներգութեան սաղմոսը "},
	{2, "2 Գոհութիւն մատուցենք քեզ, Աստուա՛ծ, գոհութիւն մատուցենք եւ տանք քո անունը։ "},
	{3, "3 Ես պիտի պատմեմ քո բոլոր հրաշագործութիւնները. երբ ժամը հասնի՝ ճշմարիտ դատաստան պիտի տեսնեմ։ "},
	{4, "4 Մաշուեցին երկիրն ու նրա բոլոր բնակիչները, ես հաստատեցի նրա սիւները։ "},
	{5, "5 Անօրէններին ասացի, թէ՝ անօրէնութիւն մի՛ գործէք, մեղաւորներին, թէ՝ մի՛ ցցէք ձեր կոտոշները։ "},
	{6, "6 Ձեր կոտոշները վեր մի՛ տնկէք, եւ Աստծու մասին անիրաւաբար մի՛ խօսէք։ "},
	{7, "7 Մեծութիւնը գալիս է ո՛չ արեւելքից, ո՛չ արեւմուտքից, ո՛չ էլ լեռների անապատից, "},
	{8, "8 այլ Աստուած է դատաւոր, որ ցածրացնում է մէկին եւ միւսին՝ բարձրացնում։ "},
	{9, "9 Տիրոջ ձեռքի բաժակը լի է անապակ գինով, որ մատուցում է սրան ու նրան։ Սակայն նրա մրուրը չի պակասի, եւ երկրի բոլոր մեղաւորները կը խմեն այն։ "},
	{10, "10 Ես պիտի ցնծամ յաւիտեան, սաղմոս պիտի երգեմ Յակոբի Աստծուն։ "},
	{11, "11 Մեղաւորների բոլոր եղջիւրները դու պիտի փշրես, եւ արդարի եղջիւրը պիտի բարձրանայ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view75() {
struct hy75 poems[] = {
	{1, "1 Այսուհետեւ՝ Ասափի օրհնութեան սաղմոսը. երգ ասորեստանցիների մասին "},
	{2, "2 Աստուած յայտնի է Հրէաստանում, եւ Իսրայէլում մեծ է անունը նրա։ "},
	{3, "3 Նրա տեղը խաղաղութեան մէջ է, եւ նրա բնակութիւնը՝ Սիոնում։ "},
	{4, "4 Այնտեղ խորտակեց Տէրն աղեղի զօրութիւնը եւ զէնքը, սուրն ու ճակատամարտը։ "},
	{5, "5 Դու սքանչելի լուսատուն ես յաւերժական լեռների։ "},
	{6, "6 Բոլոր անմիտ սիրտ ունեցողները պիտի խռովուեն, պիտի ննջեն եւ ոչինչ պիտի չգտնեն.բոլոր մարդիկ, որոնց ձեռքում հարստութիւն կար, ննջեցին եւ ոչինչ չգտան։ "},
	{7, "7 Յակոբի Աստուած, քո սաստից քուն մտան նաեւ ձի հեծնողները։ "},
	{8, "8 Դու ահաւոր ես, եւ ո՞վ կարող է կանգնել քո առջեւ։ "},
	{9, "9 Երբ երեւացիր դու երկնքից՝ յայտնուեց քո բարկութիւնը։ "},
	{10, "10 Երկիրը սարսափեց ու դողաց, երբ Աստուած ելաւ դատաստան տեսնելու, փրկելու աշխարհի բոլոր հեզերին։ "},
	{11, "11 Մարդկանց խորհուրդները պիտի խոստովանեն քեզ, եւ իմաստութեամբ ծածկուածները պիտի օրհնեն քեզ։ "},
	{12, "12 Ո՛ւխտ դրէք եւ կատարեցէ՛ք այն մեր Տէր Աստծու համար, ամէնքդ՝ որ շուրջն էք նրա։ "},
	{13, "13 Ընծանե՛ր մատուցեցէք Ահաւորին, Նրան, որ քաղում է հոգիներն իշխանների. ահաւոր է Նա աշխարհի բոլոր թագաւորներից աւելի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view76() {
struct hy76 poems[] = {
	{1, "1 Այսուհետեւ՝ Իդիթոմի մասին. սաղմոս Ասափի "},
	{2, "2 Իմ ձայնով ես Տիրոջը դիմեցի, իմ ձայնով դիմեցի Աստծուն, եւ նա նայեց ինձ։ "},
	{3, "3 Նեղութեանս օրերին Աստծուն փնտռեցի՝ ձեռքերս գիշերով պարզած նրա առջեւ, եւ չխաբուեցի։ "},
	{4, "4 Հոգիս չէր ուզում մխիթարուել։ Յիշեցի Աստծուն եւ ուրախացայ,իսկ երբ հառաչում էի,նուաղում էր հոգիս իմ մէջ։Հանգիստ։ "},
	{5, "5 Աչքերն իմ բաց մնացին գիշերուայ պահին, խռովուեցի ու չխօսեցի։ "},
	{6, "6 Խորհեցի հին օրերի մասին, եւ վաղնջական տարիները յիշեցի։ "},
	{7, "7 Գիշերը սրտիս հետ խօսեցի, հառաչելիս տառապում էր հոգիս իմ մէջ։ "},
	{8, "8 Միթէ յաւէտ մերժելո՞ւ է Տէրն ինձ, եւ այլեւս չի՞ շարունակելու բարեհաճ լինել։ "},
	{9, "9 Կամ ընդմի՞շտ զրկելու է ինձ իր ողորմութիւնից, եւ դադարեցնելո՞ւ է խօսքն իր սերնդից սերունդ։ "},
	{10, "10 Կամ այլեւս մոռանալո՞ւ է Աստուած գթալ ինձ, եւ բարկութեամբ մերժելո՞ւ է գթութիւնն իր։Հանգիստ։ "},
	{11, "11 Ասացի. Այժմ հասկացայ. սա է նորացած աջը Բարձրեալի։ "},
	{12, "12 Յիշեցի գործերը Տիրոջ, սկզբից յիշեցի սքանչելագործութիւնները նրա։ "},
	{13, "13 Մտաբերեցի գործերը քո բոլոր, եւ քո ձեռակերտների մասին խորհեցի։ "},
	{14, "14 Աստուա՛ծ, քո ճանապարհները սրբութեան մէջ են. ո՞ր աստուածն է մեծ՝ մեր Աստծու նման։ "},
	{15, "15 Դու ես հրաշագործ Աստուածը. զօրութիւնդ ցոյց տուիր քո ժողովրդին։ "},
	{16, "16 Բազկովդ փրկեցիր քո ժողովրդին՝ Յակոբի եւ Յովսէփի որդիներին։Հանգիստ։ "},
	{17, "17 Քեզ տեսան ջրերն, Աստուա՛ծ, տեսան քեզ ջրերն ու սոսկացին, եւ անդունդները խռովուեցին յորդառատ ջրերի ձայնից։ "},
	{18, "18 Ամպերը ձայն տուին, ուստի եւ քո նետերը սլացան քո անուի որոտման ձայնից։ "},
	{19, "19 Երեւացին քո փայլակները տիեզերքի, եւ երկիրը խռովուեց ու դողաց։ "},
	{20, "20 Քո ճանապարհները ծովում են, շաւիղներդ՝ յորդառատ ջրերում, եւ քո հետքերը չեն երեւում։ "},
	{21, "21 Քո ժողովրդին ոչխարների պէս առաջնորդեցիր Մովսէսի եւ Ահարոնի ձեռքով։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view77() {
struct hy77 poems[] = {
	{1, "1 Ժողովուրդնե՛ր, ո՛ւշ դարձրէք իմ օրէնքներին, եւ մօտեցրէ՛ք ձեր ականջները բերանիս խօսքերին։ "},
	{2, "2 Առակով պիտի բացեմ բերանն իմ, սկզբից եւեթ առակներով պիտի խօսեմ, "},
	{3, "3 ինչպէս լսեցինք ու իմացանք դրանք, եւ ինչպէս մեր հայրերը պատմեցին մեզ։ "},
	{4, "4 Մենք ոչինչ չթաքցրինք նրանց որդիներից,միւս սերնդին պատմեցինք օրհնութիւնն ու զօրութիւնը Տիրոջեւ այն սքանչելագործութիւնները, որ նա արեց։ "},
	{5, "5 Յակոբի համար հաստատեց իր վկայութիւնը, եւ օրէնքներ դրեց Իսրայէլի վրայ, մէկ անգամ ընդմիշտ պատուիրելով մեր հայրերին, որ նրանք այդ բոլորը ցոյց տան իրենց որդիներին, որ սովորեցնեն միւս սերնդին։ "},
	{6, "6 Որդիները, որ ծնուելու են, պիտի ելնեն եւ պատմեն դա իրենց զաւակներին, "},
	{7, "7 որպէսզի իրենց յոյսը դնեն Աստծու վրայեւ չմոռանան Աստծու գործերը՝հետեւելով նրա պատուիրաններին, "},
	{8, "8 որ իրենց հայրերի պէս չար եւ դառնացող ազգ չլինեն, ազգ՝ որ չուղղեց սիրտն իր, եւ իր հոգին չհաստատեց Աստծու վրայ։ "},
	{9, "9 Եփրեմի որդիները ուժեղ աղեղնաւորներ էին,բայց պատերազմի օրը իրենց կապարճները ետ դարձրին.նրանք չմնացին Տիրոջ ուխտի մէջեւ չուզեցին ընթանալ ըստ նրա օրէնքների։ "},
	{10, "10 Մոռացան նրա երախտիքներն ու այն սքանչելագործութիւնները, "},
	{11, "11 որ գործեց նրանց հայրերի առջեւ, եգիպտացիների երկրում եւ Տայանի դաշտում։ "},
	{12, "12 Նա ճեղքեց ծովը եւ անցկացրեց նրանց, ջրերը պահեց ինչպէս տիկերի մէջ։ "},
	{13, "13 Ցերեկն ամպով առաջնորդեց նրանց, իսկ ողջ գիշեր՝ հրեղէն լոյսով։ "},
	{14, "14 Պատռեց ժայռն անապատում, եւ նրանց խմեցրեց ինչպէս մեծ անդնդից։ "},
	{15, "15 Ժայռից ջուր բխեցրեց, եւ ջրերն հոսեցրեց գետերի պէս։ "},
	{16, "16 Սակայն նրանք շարունակեցին մեղանչել, եւ աւելի եւս բարկացրին Բարձրեալին անապատում։ "},
	{17, "17 Փորձեցին Աստծուն իրենց սրտերում՝ կերակուր խնդրելով իրենց համար։ "},
	{18, "18 Տրտնջացին Աստծուց ու ասացին. Միթէ Աստուած կարո՞ղ է սեղան պատրաստել անապատում։ "},
	{19, "19 Ճիշտ է, որ նա հարուածեց ժայռին, եւ ջրեր հոսեցին ու վտակներ բխեցին դրանից։ Բայց կարո՞ղ է նաեւ հաց տալ մեզ կամ իր ժողովրդի համար սեղան պատրաստել։ "},
	{20, "20 Դրա համար էլ Տէրը լսեց այս ու յապաղեց. հուր բորբոքուեց Յակոբի սերնդի մէջ, եւ բարկութիւն իջաւ Իսրայէլի վրայ։ "},
	{21, "21 Նրանք Աստծուն չհաւատացին ու յոյս չդրին նրա փրկութեան վրայ։ "},
	{22, "22 Տէրը վերեւից հրաման տուեց ամպերինու բացեց դռները երկնքի։ "},
	{23, "23 Եւ մանանայ տեղացրեց նրանց վրայ որպէս կերակուր։ "},
	{24, "24 Երկնքի հացը տուեց նրանց, մարդիկ հրեշտակների հացը կերան. եւ նա լիուլի ուտելիք իջեցրեց նրանց համար։ "},
	{25, "25 Հանեց հարաւի հողմը, եւ իր զօրութեամբ բերեց հիւսիսի կողմը։ "},
	{26, "26 Նրանց վրայ հողի պէս միս տեղացրեց, եւ ծովի աւազի պէս՝ թեւաւոր թռչուններ։ "},
	{27, "27 Նա դրանք նետեց նրանց բանակատեղիի մէջ եւ նրանց վրանների շուրջը։ "},
	{28, "28 Կերան եւ լիապէս յագեցան, իրենց ցանկացածը տուեց նրանց։ "},
	{29, "29 Եւ նրանք իրենց ցանկութիւնից ոչնչով զուրկ չմնացին։ Մինչ դեռ կերակուրն իրենց բերանում էր, "},
	{30, "30 Աստծու բարկութիւնն իջաւ նրանց վրայ. նրանցից շատերին նա սպանեց եւ Իսրայէլի ընտրեալներին ոչնչացրեց։ "},
	{31, "31 Հակառակ այս բոլորի, նրանք նորից մեղանչեցին ու չհաւատացին նրա հրաշագործութիւններին։ "},
	{32, "32 Նրանց օրերն ունայնաբար սպառուեցին, եւ նրանց տարիներն արագ անցան։ "},
	{33, "33 Երբ Տէրն սպանում էր նրանց,նրանք փնտռում էին իրեն, դարձի էին գալիս եւ փութով դիմում էին Աստծուն։ "},
	{34, "34 Նրանք յիշեցին, որ Աստուած իրենց օգնականն էր, Բարձրեալն Աստուած փրկիչն էր իրենց։ "},
	{35, "35 Սիրեցին նրան իրենց բերաններով, բայց իրենց լեզուներով ստեցին նրան։ "},
	{36, "36 Նրանց սրտերը շիտակ չէին նրա հանդէպ, եւ նրանք չհաւատացին նրա ուխտին։ "},
	{37, "37 Բայց ինքը գթասիրտ էր, քաւութիւն էր տալիս նրանց մեղքերին ու չէր կործանում նրանց։ Յաճախ զսպում էր իր բարկութիւնը եւ չէր թափում իր ողջ զայրոյթը։ "},
	{38, "38 Յիշում էր, որ նրանք մարմին են՝ շունչ, որ, դուրս ելնելով, այլեւս ետ չի դառնում։ "},
	{39, "39 Քանի՜-քանի՜ անգամ դառնացրին նրան անապատում, բարկացրին Բարձրեալին անջրդի վայրում, "},
	{40, "40 վերադարձան փորձեցին Աստծուն, եւ Իսրայէլի սրբին զայրացրին։ "},
	{41, "41 Չյիշեցին նրա ձեռքը, ձեռք, որ մի օր փրկեց նրանց իրենց նեղողներից։ "},
	{42, "42 Չյիշեցին, թէ նա ինչպէս սքանչելիքներ ու զարմանահրաշ գործներ արեց եգիպտացիների երկրում եւ Տայանի դաշտում։ "},
	{43, "43 Նրանց գետերն ու անձրեւներն արիւն դարձրեց, որ չխմեն։ "},
	{44, "44 Նրանց վրայ շնաճանճեր ուղարկեց, որոնք յօշոտեցին նրանց, եւ գորտերով նրանց ապականեց։ "},
	{45, "45 Նրանց բերքը որդնոտութեան մատնեց, եւ նրանց վաստակը բաժին դարձրեց մարախի։ "},
	{46, "46 Նրանց այգիները կարկտահար արեց, եւ նրանց թզենիները ծածկեց եղեամով։ "},
	{47, "47 Նրանց անասուններին կարկտահար արեց, եւ նրանց ունեցուածքը հրոյ ճարակ դարձրեց։ "},
	{48, "48 Նրանց դէմ ուղղեց իր սաստիկ բարկութիւնը՝ բարկութիւնը, զայրոյթն ու նեղուածութիւնը, չար հրեշտակի ձեռքով տանջանքներ ուղարկեց նրանց վրայ։ "},
	{49, "49 Նրանց վրայ թափեց իր զայրալից բարկութիւնը, նրանց հոգին զերծ չպահեց մահուանից, եւ կոտորեց նրանց անասունները։ "},
	{50, "50 Նա հարուածեց Եգիպտոսի բոլոր անդրանիկ ծնունդներին՝ իրենց վաստակի առաջնեկներին Քամի վրանների տակ։Հանգիստ։ "},
	{51, "51 Իր ժողովրդին քշեց ոչխարների պէս, եւ ինչպէս հօտ նրանց հանեց անապատ։ "},
	{52, "52 Նրանց առաջնորդեց յոյսով՝ եւ նրանք չվախեցան, եւ ծովը ծածկեց նրանց թշնամիներին։ "},
	{53, "53 Նրանց բարձրացրեց իր սուրբ լեռը՝ լեռն այն, որ իր Աջն էր նուաճել։ "},
	{54, "54 Նրանց առջեւից վանեց հեթանոսներին, իր ժառանգութիւնից բաժին բաշխեց նրանցեւ Իսրայէլի ցեղերին բնակեցրեց նրանց վրաններում։ "},
	{55, "55 Նրանք փորձեցին, դառնացրին Բարձրեալ Աստծունու նրա վկայութիւնը չպահեցին։ "},
	{56, "56 Դարձեալ խոտորուեցին ինչպէս իրենց հայրերը, դարձեալ նմանուեցին ծուռ աղեղի։ "},
	{57, "57 Դարձեալ բարկացրին նրան իրենց բագիններով, եւ իրենց կուռքերով շարժեցին նախանձը նրա։ "},
	{58, "58 Լսեց Աստուած ու զայրացաւ նրանց վրայ, եւ խիստ անարգեց Իսրայէլը։ "},
	{59, "59 Մերժեց նա խորանը Սելովի, խորանն այն, որ հաստատել էր մարդկանց մէջ։ "},
	{60, "60 Նրանց զօրութիւնը գերութեան մատնեց, իսկ նրանց գեղեցկութիւնն՝ իրենց թշնամիների ձեռքը։ "},
	{61, "61 Իր ժողովրդին սրի մատնեցեւ անտեսեց իր իսկ ժառանգութիւնը։ "},
	{62, "62 Նրանց երիտասարդներին հուրը լափեց, եւ նրանց կոյսերի համար ոչ ոք չսգաց։ "},
	{63, "63 Նրանց քահանաները սրի քաշուեցին, եւ նրանց այրիներին ոչ ոք չվշտակցեց։ "},
	{64, "64 Տէրը կարծես քնից արթնացաւ, ինչպէս գինուց սթափուող հսկայ։ "},
	{65, "65 Նա թշնամիներին ետ շպրտեց՝ յաւիտենական նախատինք տալով նրանց։ "},
	{66, "66 Մերժեց նա խորանը Յովսէփի, եւ Եփրեմի ցեղին նա չընտրեց, "},
	{67, "67 այլ նա ընտրեց Յուդայի ցեղին, լեռը Սիոնի, որը եւ սիրեց։ "},
	{68, "68 Նրա սրբարանը շինեց միեղջերուի նմանութեամբ՝ յաւիտեան գետնի վրայ հաստատելով այն։ "},
	{69, "69 Ընտրեց Դաւթին՝ իր ծառային,եւ նրան դուրս քաշեց ոչխարների հօտից։ "},
	{70, "70 Նորածին գառների միջից վերցրեց նրան, որ հովուի իր ծառայ Յակոբի ցեղին եւ իր ժառանգութիւնը՝ Իսրայէլը։ "},
	{71, "71 Նա արածեցնում էր նրանց իր սրտի իմաստութեամբ, իր անմեղունակ ձեռքերով առաջնորդում էր նրանց։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view78() {
struct hy78 poems[] = {
	{1, "1 Աստուա՛ծ, հեթանոսները մտան քո ժառանգութեան մէջ, պղծեցին քո սուրբ տաճարը, Երուսաղէմը դարձրին ինչպէս մրգապահի հիւղակ։ "},
	{2, "2 Քո ծառաների դիակները որպէս կեր նետեցին երկնքի թռչուններին, եւ քո սրբերի մարմինները՝ երկրի գազաններին։ "},
	{3, "3 Նրանց արիւնը ջրի պէս Երուսաղէմի շուրջը թափեցին, եւ չկար մէկը, որ թաղէր նրանց։ "},
	{4, "4 Մենք դարձանք մեր դրացիների նախատինքը եւ մեր շուրջը եղողների ծաղրուծանակը։ "},
	{5, "5 Մինչեւ ե՞րբ, Տէ՛ր, պիտի բարկանաս դու անվերջ, եւ քո նախանձը պիտի բորբոքուի հրի պէս։ "},
	{6, "6 Բարկութիւնդ թափի՛ր այն ազգերի վրայ, որոնք քեզ չեն ճանաչում, այն թագաւորների վրայ, որոնք անունդ չեն ոգեկոչում։ "},
	{7, "7 Նրանք յօշոտեցին Յակոբի ցեղին, եւ նրա տեղն աւերեցին։ "},
	{8, "8 Մի՛ յիշիր հին մեղքերը մեր, թող ողորմութիւնդ շուտով հասնի մեզ, Տէ՛ր, քանզի սաստիկ աղքատացանք։ "},
	{9, "9 Օգնի՛ր մեզ, Աստուա՛ծ, փրկի՛չ մեր, քո անուան փառքի համար. Տէ՛ր, յանուն քո անուան փրկի՛ր մեզ ու թողութի՛ւն տուր մեր մեղքերին։ "},
	{10, "10 Թող հեթանոսների մէջ երբեք չասեն՝ Ո՞ւր է նրանց Աստուածը. այլ հեթանոսների մէջ, մեր աչքի առջեւ, թող յայտնուի քո ծառաների թափած արեան վրէժխնդրութիւնը։ "},
	{11, "11 Բանտարկեալների հեծեծանքը թող հասնի քեզ. դու քո բազկի զօրութեամբ փրկի՛ր սպանուածների որդիներին։ "},
	{12, "12 Մեր դրացիների նախատինքը, որով անարգեցին մեզ, եօթնապատիկ իրենց գիրկը վերադարձրու, Տէ՛ր։ "},
	{13, "13 Մենք՝ քո ժողովուրդն ու քո արօտի ոչխարները, յաւիտեան քեզ գոհութիւն պիտի մատուցենք, սերնդից սերունդ պիտի պատմենք քո օրհնութիւնը։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view79() {
struct hy79 poems[] = {
	{1, "1 Այսուհետեւ՝ անցած ժամանակների մասին Ասափի վկայութիւնը. սաղմոս եթովպացիների մասին "},
	{2, "2 Դու, որ հովւում ես Իսրայէլին՝ ո՛ւշ դարձրու, դու, որ առաջնորդում ես Յովսէփի ցեղին ինչպէս հօտ, դո՛ւ, որ քերովբէների վրայ ես նստում՝ յայտնուի՛ր "},
	{3, "3 Եփրեմի, Բենիամինի ու Մանասէի առջեւ, արթնացրո՛ւ քո զօրութիւնը եւ արի՛ մեզ փրկելու։ "},
	{4, "4 Զօրութիւնների՛ Աստուած, մեզ ե՛տ դարձրու,ցո՛յց տուր մեզ երեսը քո, որ ապրենք։ "},
	{5, "5 Զօրութիւնների Տէ՛ր Աստուած, մինչեւ ե՞րբ պիտի բարկանաս քո ծառաների աղօթքի վրայ։ "},
	{6, "6 Մեզ արտասուախառն հացով սնեցիր, եւ անչափ արտասուք խմեցրիր մեզ։ "},
	{7, "7 Մեզ դարձրիր նախատինքը մեր հարեւաններիեւ ծաղրուծանակը մեր թշնամիների։ "},
	{8, "8 Զօրութիւնների՛ Աստուած, մեզ ե՛տ դարձրու, ցո՛յց տուր մեզ երեսը քո, որ ապրենք։ "},
	{9, "9 Դու Եգիպտոսից Իսրայէլ-որթատունկը հանեցիր, վռնդեցիր հեթանոսներին եւ այդ որթատունկը տնկեցիր։ "},
	{10, "10 Առաջնորդեցիր նրան, հաստատուն դարձրիր նրա արմատները, եւ այն լցրեց երկիրը։ "},
	{11, "11 Նրա ստուերը ծածկեց լեռները, եւ նրա ճիւղը՝ Աստծու մայրիները։ "},
	{12, "12 Որթատունկ իր ճիւղերը ձգեց մինչեւ ծով, իսկ բողբոջները՝ մինչեւ Եփրատ գետը։ "},
	{13, "13 Ինչո՞ւ քանդեցիր ցանկապատը նրա, ճանապարհի անցորդները պոկոտում էին այն։ "},
	{14, "14 Ապականեց նրան խոզն անտառի, եւ վայրի երէն արածեց նրա մէջ։ "},
	{15, "15 Զօրութիւնների՛ Աստուած, դարձի՛ր, նայի՛ր երկնքից ու տե՛ս, այցելի՛ր այս որթատունկին, "},
	{16, "16 եւ խնա՛մք տար նրան, որին տնկեց Աջը քո, նաեւ մարդու որդուն, որին դու զօրացրիր քեզնով։ "},
	{17, "17 Այլապէս, հրով վառուած ու աւերուած, պիտի կորչեն քո խստութիւնից։ "},
	{18, "18 Քո ձեռքը թող լինի մարդու վրայ, քո աջը՝ այն մարդու որդու վրայ, որին դու զօրացրիր քեզնով։ "},
	{19, "19 Մենք այլեւս չենք հեռանայ քեզանից, դու պիտի փրկես մեզ, եւ մենք քո անունը պիտի ոգեկոչենք, Տէ՛ր։ "},
	{20, "20 Զօրութիւնների Տէ՛ր Աստուած, մեզ ե՛տ դարձրու, ցո՛յց տուր մեզ երեսը քո, որ ապրենք։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view80() {
struct hy80 poems[] = {
	{1, "1 Այսուհետեւ՝ հնձանների մասին. Ասափի հինգշաբթի օրուայ սաղմոսը "},
	{2, "2 Ցնծացէ՛ք Աստծու առջեւ, որ օգնականն է մեր, աղաղակեցէ՛ք Յակոբի Աստծուն։ "},
	{3, "3 Սաղմո՛ս ասացէք եւ օրհնութի՛ւն տուէք, նրան քաղցրաձայն սաղմո՛ս երգեցէք։ "},
	{4, "4 Փո՛ղ հնչեցրէք ամսագլխին՝ մեր նշանաւոր օրուայ տարեդարձին։ "},
	{5, "5 Դա հրաման է Իսրայէլի համար, եւ օրէնք՝ Յակոբի Աստծու համար։ "},
	{6, "6 Յովսէփի ուխտն է դա, որը կնքեց Նրա հետ, երբ նա դուրս էր գալիս եգիպտացիների երկրից։ Նա լսեց մի լեզու, որ չգիտէր. "},
	{7, "7 Նրանց թիկունքներն ազատի՛ր բեռներիցեւ նրանց ձեռքերը՝ այգու ու բահի ծառայութիւնից։ "},
	{8, "8 Նեղութեան մէջ ինձ ձայն տուիր՝ եւ փրկեցի քեզ. քեզ լսեցի մրրիկի ծածկոյթի տակ ու փորձեցի քեզ Հակառակութեան ջրերի վրայ։ "},
	{9, "9 Լսի՛ր, իմ ժողովո՛ւրդ, ու ես վկայ կը լինեմ քեզ, եւ Իսրայէ՛լ, եթէ ինձ լսում ես։ "},
	{10, "10 Ժամանակաւորապէս պաշտուող աստուածներ չես ունենայ ու չես երկրպագի օտար աստծու։ "},
	{11, "11 Ես եմ քո Տէր Աստուածը, որ հանեցի քեզ եգիպտացիների երկրից. բա՛ց բերանդ, եւ ես պիտի լցնեմ այն։ "},
	{12, "12 Իմ ժողովուրդը չունկնդրեց ձայնիս, եւ Իսրայէլն ինձ չնայեց։ "},
	{13, "13 Բարձիթողի մատնեցի նրան, որ գնան իրենց սրտի թելադրանքով, քանզի շարժուեցին իրենց կամքով։ "},
	{14, "14 Եթէ իմ ժողովուրդը լսէր ինձ, կամ Իսրայէլն ընթանար իմ ճանապարհով, "},
	{15, "15 ապա որպէս ոչնչութիւն կ՚ընկճէի նրա թշնամիներինեւ ձեռքս կ՚իջեցնէի նրան նեղողների վրայ։ "},
	{16, "16 Տիրոջ թշնամիները ստեցին նրան, ուստի նրանց ժամանակն աշխարհում կը սպառուի։ "},
	{17, "17 Նրանց կերակրեց ցորենի առատութեամբ, ժայռից հոսող մեղրով յագեցրեց նրանց։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view81() {
struct hy81 poems[] = {
	{1, "1 Աստուած կանգնեց աստուածների ժողովում, եւ նրանց մէջ դատապարտեց նրանց՝ ասելով. "},
	{2, "2 Մինչեւ ե՞րբ պիտի անիրաւութեամբ դատէք. եւ աչառութիւն անէք մեղաւորներին։ "},
	{3, "3 Տեսէ՛ք դատաստանը որբի եւ այրու, արդա՛ր դատեցէք աղքատին ու խեղճին։ "},
	{4, "4 Փրկեցէ՛ք աղքատին ու տնանկին, մեղաւորի ձեռքից փրկեցէ՛ք նրանց։ "},
	{5, "5 Չհասկացան, չըմբռնեցին, խարխափեցին խաւարի մէջ, եւ երկրի բոլոր հիմքերը ցնցուեցին։ "},
	{6, "6 Ես ասացի՝ Աստուածներ էք դուք, կամ բոլորդ էլ որդիներն էք Բարձրեալի։ "},
	{7, "7 Բայց ահա մեռնում էք դուք որպէս մարդեւ ընկնում էք ինչպէս մի իշխան։ "},
	{8, "8 Ելի՛ր, Աստուա՛ծ, ու դատի՛ր աշխարհը, քանզի դո՛ւ պիտի ժառանգես բոլոր հեթանոսներին։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view82() {
struct hy82 poems[] = {
	{1, "1 Ասափի օրհնութեան սաղմոսը "},
	{2, "2 Աստուա՛ծ, ո՞վ է քեզ նման. մի՛ լռիր ու կանգ մի՛ առ, Աստուա՛ծ։ "},
	{3, "3 Ահա թշնամիներդ աղաղակեցին, եւ ատելիներդ բարձրացրին իրենց գլուխները։ "},
	{4, "4 Քո ժողովրդի դէմ խորամանկութիւն մտածեցին, խորհուրդ արեցին քո սրբերի դէմ՝ ասելով. "},
	{5, "5 Եկէք ազգերի միջից վերացնենք նրանց, որ այլեւս Իսրայէլի անունը չյիշուի։ "},
	{6, "6 Միաբանած՝ խորհեցին համատեղ, դաշինք կնքեցին քո դէմ "},
	{7, "7 եդոմայեցիների բանակներն ու իսմայէլացիները, մովաբացիներն ու հագարացիները, "},
	{8, "8 Գեբաղի, Ամոնի, Ամաղէկի բնակիչներն ու բոլոր այլազգիները՝ Տիւրոսի բնակիչներով հանդերձ։ "},
	{9, "9 Նաեւ Ասուրի բանակն էր եկել նրանց հետ. սրանք բոլորը զօրավիգ էին Ղովտի որդիներին։ "},
	{10, "10 Նրանց արա այնպէս, ինչպէս արեցիր Մադիամին, Սիսարային ու Յաբինին՝ Կիսոնի հեղեղատներում։ "},
	{11, "11 Նրանք կոտորուեցին Դորի ակունքներումեւ եղան ինչպէս գետնի աղբ։ "},
	{12, "12 Նրանց իշխաններին արա՛ այնպէս, ինչպէս արեցիր Զէբէէին, Սաղմանային ու նրանց բոլոր իշխաններին, "},
	{13, "13 որոնք ասացին. Մեր ժառանգութիւնը դարձնենք Աստծու սրբարանը։ "},
	{14, "14 Աստուա՛ծ իմ, նրանց արա՛ ինչպէս անիւ, ինչպէս եղէգ՝ քամու հանդէպ, "},
	{15, "15 ինչպէս հուր, որ անտառն է այրում, ինչպէս բոց, որ լեռներն է խանձում։ "},
	{16, "16 Այսպէս հալածի՛ր նրանց քո մրրիկով, ու քո բարկութեամբ խռովեցրո՛ւ նրանց։ "},
	{17, "17 Նրանց երեսն անարգանքո՛վ պատիր, որ քո անունը փնտռեն, Տէ՛ր։ "},
	{18, "18 Թող ամաչեն ու խռովուեն յաւիտեանս յաւիտենից,եւ ամօթահար թող կորստեան մատնուեն։ "},
	{19, "19 Թող իմանան, որ քո անունը Տէր է, եւ դու միակ Բարձրեալն ես ամբողջ երկրի վրայ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view83() {
struct hy83 poems[] = {
	{1, "1 Այսուհետեւ՝ հնձանների մասին. սաղմոս Կորխի որդիներին "},
	{2, "2 Որքա՜ն հաճելի է քո յարկի տակ, զօրութիւնների՛ Տէր. իմ հոգին քո գաւիթն է ցանկանում ու փափագում։ "},
	{3, "3 Սիրտս ու մարմինս ցնծում են կենդանի Աստուծով. "},
	{4, "4 քանզի ճնճղուկը գտաւ տունն իր, տատրակն իր բոյնը, որտեղ ձագեր պիտի դնի.գտաւ քո սեղանը, զօրութիւնների՛ Տէր, թագաւո՛ր իմ եւ Աստուա՛ծ իմ։ "},
	{5, "5 Երանի բոլոր նրանց, ովքեր բնակւում են Տիրոջ տանը, նրանք յաւիտեանս յաւիտենից պիտի օրհնեն քեզ։ "},
	{6, "6 Երանի այն մարդուն, որի օգնութիւնը քեզնից է, եւ որը մտքում դրեց ելնել "},
	{7, "7 տրտմութեան հովտից այն վայրը, ուր ուխտ արեց։ Նա օրհնութիւն պիտի մատուցի օրէնսդրին։ "},
	{8, "8 Զօրութիւնից զօրութիւն պիտի ընթանայ, եւ Աստուած պիտի երեւայ Սիոնում։ "},
	{9, "9 Զօրութիւնների Տէ՛ր Աստուած, լսի՛ր իմ աղօթքը, ակա՛նջ դիր, Յակոբի՛ Աստուած։ "},
	{10, "10 Դու ապաւէն ես մեր. տե՛ս, Աստուա՛ծ, ու նայի՛ր քո օծեալի երեսին, "},
	{11, "11 քանզի ինձ համար քո գաւթում լինելու մէկ օրը հազար օր արժէ։ Ես նախընտրեցի ընկեցիկ լինել Աստծու տան մէջ, քան մեղաւորների յարկի տակ բնակուել։ "},
	{12, "12 Ողորմութիւն ու ճշմարտութիւն է սիրում Տէր Աստուածը մեր, որը շնորհք ու փառք պիտի տայ։ "},
	{13, "13 Տէրն իր ողորմութիւնը չի զլանայ նրանց, ովքեր անմեղութեամբ են ընթանում։ Զօրութիւնների՛ Տէր Աստուած, երանելի է այն մարդը, ով յոյսը քեզ վրայ է դրել։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view84() {
struct hy84 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Կորխի որդիներին "},
	{2, "2 Տէ՛ր, հաւանեցիր քո երկիրըու ե՛տ դարձրիր Յակոբին գերութիւնից։ "},
	{3, "3 Ներեցիր ժողովրդիդ անիրաւութիւնը, ջնջեցիր նրա բոլոր մեղքերը։ "},
	{4, "4 Զսպեցիր ողջ սրտնեղութիւնդ, ետ դարձար քո սաստիկ բարկութիւնից։ "},
	{5, "5 Դէպի մե՛զ դարձիր, Աստուա՛ծ, փրկի՛չ մեր, ու ե՛տ պահիր զայրոյթդ մեզնից։ "},
	{6, "6 Մեզ վրայ յաւիտեան մի՛ բարկացիր, Տէ՛ր, եւ բարկութիւնդ սերնդից սերունդ թող չձգուի։ "},
	{7, "7 Աստուա՛ծ, դու դարձեալ մեզ պիտի փրկես, եւ ժողովուրդդ պիտի ուրախանայ քեզնով։ "},
	{8, "8 Ցո՛յց տուր մեզ քո ողորմութիւնը, Տէ՛ր, եւ քո փրկութիւնը շնորհի՛ր մեզ։ "},
	{9, "9 Լսեցինք, թէ ինչ է խօսում Տէր Աստուածը մեր. խաղաղութեան մասին պիտի խօսի իր ժողովրդի, իր սրբերի եւ սրտով դէպի իրեն դարձողների հետ։ "},
	{10, "10 Արդարեւ, մօտ է նրա շնորհելիք փրկութիւնն իր երկիւղն ունեցողների համար, որպէսզի մեր երկրում նրա փառքը հաստատուի։ "},
	{11, "11 Ողորմութիւնն ու ճշմարտութիւնը պիտի հանդիպեն, արդարութիւնն ու խաղաղութիւնը պիտի համբուրուեն։ "},
	{12, "12 Ճշմարտութիւնը երկրից բուսաւ, արդարութիւնը երկնքից երեւաց։ "},
	{13, "13 Տէրը բարութիւն պիտի գործի, իսկ մեր երկիրն իր պտուղը պիտի տայ։ "},
	{14, "14 Արդարութիւնը նրա առջեւից պիտի գնայ, ճանապարհ տալով նրա ընթացքին։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view85() {
struct hy85 poems[] = {
	{1, "1 Մօտեցրո՛ւ, Տէ՛ր, ականջը քո եւ լսի՛ր ինձ, քանզի աղքատ ու տնանկ եմ ես։ "},
	{2, "2 Հոգիս իմ սո՛ւրբ պահիր, Տէ՛ր. փրկի՛ր, Աստուա՛ծ իմ, քո ծառային, որ յոյսը դրել է քեզ վրայ։ "},
	{3, "3 Որորմի՛ր ինձ, Տէ՛ր, քանզի գիշեր-ցերեկ քե՛զ կանչեցի։ "},
	{4, "4 Ուրախացրո՛ւ ծառայիդ հոգին, Տէ՛ր, քանզի հոգիս դէպի քեզ բարձրացրի. "},
	{5, "5 որովհետեւ դու, Տէ՛ր, բարի ու շիտակ ես, գթառատ ես նրանց հանդէպ, ովքեր կանչում են քեզ։ "},
	{6, "6 Ակա՛նջ դիր, Տէ՛ր, իմ աղօթքներինեւ ո՛ւշ դարձրու խնդրանքիս ձայնին։ "},
	{7, "7 Իմ նեղութեան օրը ես կանչեցի քեզ, եւ դու լսեցիր ինձ։ "},
	{8, "8 Աստուածների մէջ քեզ նմանը չկայ, Տէ՛ր, եւ ոչինչ չկայ, որ նմանուի քո գործերին։ "},
	{9, "9 Բոլոր ազգերը, որոնց ստեղծեցիր, պիտի գան երկրպագեն քո առջեւ, յաւիտեան փառք պիտի տան քո անուանը։ "},
	{10, "10 Մեծ ես դու, Տէ՛ր, եւ հրաշագործութիւններ ես անում, եւ միայն դո՛ւ ես Աստուած։ "},
	{11, "11 Առաջնորդի՛ր ինձ քո ճանապարհով, որ ընթանամ քո ճշմարտութեամբ, եւ սիրտս ուրախանայ՝ ակնածելով քո անունից։ "},
	{12, "12 Ամբողջ սրտովս գոհութիւն պիտի մատուցեմ քեզ, Տէ՛ր Աստուած իմ, յաւիտեան փառք պիտի տամ քո անուանը։ "},
	{13, "13 Մեծ եղաւ քո ողորմութիւնն իմ հանդէպ, հոգիս փրկեցիր խոր դժոխքից։ "},
	{14, "14 Աստուա՛ծ, անօրէններն յարձակուեցին ինձ վրայ, բռնակալների ամբոխներն հետապնդեցին ինձ, եւ քեզ իրենց առջեւ Աստուած չհամարեցին։ "},
	{15, "15 Բայց դու, Տէ՛ր Աստուած իմ, գթասիրտ ու ողորմած ես, համբերատար, ողորմաշատ ու ճշմարիտ։ "},
	{16, "16 Նայի՛ր ու ողորմի՛ր ինձ, զօրութի՛ւն տուր քո ծառային, պահպանի՛ր աղախնիդ որդուն։ "},
	{17, "17 Եւ ինձ բարութեան նշա՛ն ցոյց տուր. թող ատելիներն իմ տեսնեն ու ամօթահար լինեն, որ դու, Տէ՛ր, օգնեցիր ու մխիթարեցիր ինձ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view86() {
struct hy86 poems[] = {
	{1, "1 Կորխի որդիներին օրհնութեան սաղմոս "},
	{2, "2 Նրա հիմքերն իր սուրբ լերան վրայ են. Տէրը սիրում է Սիոնի դարպասներն աւելի, քան Յակոբի բոլոր վրանները։ "},
	{3, "3 Ահաւասիկ փառաւորեալը խօսեց քո մասին, քաղա՛քդ Աստծու։ "},
	{4, "4 Յիշեցի Ռահաբն ու Բաբելոնը, որոնք ճանաչում են ինձ. ահա եւ այլազգիներն ու Տիւրոսը, եւ Հնդկաստանի ժողովուրդները, որոնք գոյացան այնտեղ։ "},
	{5, "5 Սիոնը պիտի մայր կոչուի, որտեղ մարդը ծնուեց, եւ նրա հիմքերը Բարձրեալն անձամբ գցեց։ "},
	{6, "6 Տէրը գրքերում պիտի պատմի այն ժողովուրդների եւ իշխանների մասին, որոնք գոյացան այնտեղ։ "},
	{7, "7 Որքա՜ն պիտի ուրախանան քեզնով բոլոր նրանք, որոնց բնակութիւնը քեզնից է։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view87() {
struct hy87 poems[] = {
	{1, "1 Այսուհետեւ՝ Մալալէթի իմաստութեան մասին. իմաստութիւն, որով պատասխան տուեց Եման Եզրայելացին. "},
	{2, "2 Իմ փրկութեա՛ն Տէր Աստուած, գիշեր-ցերեկ քե՛զ կանչեցի։ "},
	{3, "3 Թող աղօթքս հասնի քե՛զ, Տէ՛ր, ականջդ թող մօտենայ խնդրանքիս, "},
	{4, "4 քանզի հոգիս չարչարանքով լցուեց, եւ կեանքս դժոխքին մերձեցաւ։ "},
	{5, "5 Ես համարուեցի նրանցից, ովքեր մահուան փոսն են իջնում, եղայ անօգնական մի մարդ, լքուած՝ մեռեալների մէջ, "},
	{6, "6 գերեզմանում պառկած սպանուածների պէս, որոնց դու չես յիշում, եւ որոնք մերժուած են քեզնից։ "},
	{7, "7 Ինձ խորախոր փոսի մէջ դրին, խաւարի եւ մահուան ստուերների մէջ։ "},
	{8, "8 Բարկութիւնդ ծանրացաւ ինձ վրայ, ողջ յորձանքներդ իմ դէմ ուղղեցիր։ "},
	{9, "9 Իմ ծանօթներին ինձնից հեռացրիր, եւ նրանք ինձ նշաւակ դարձրին. ես մատնուած էի դժբախտութեան ու դուրս չէի գալիս։ "},
	{10, "10 Աչքերս տկարացան թշուառութիւնից, գիշեր-ցերեկ առ Տէր աղաղակեցիեւ դէպի քեզ կարկառեցի ձեռքերն իմ։ "},
	{11, "11 Միթէ մեռելների՞ համար պիտի հրաշագործութիւններ անես, կամ բժիշկները պիտի կենդանացնե՞ն նրանց, եւ նրանք գոհութի՞ւն պիտի մատուցեն քեզ։ "},
	{12, "12 Մի՞թէ որեւէ մէկը երբեւէ պիտի պատմի քո ողորմութիւնը գերեզմանում, կամ քո ճշմարտութիւնը՝ կորստեան մէջ։ "},
	{13, "13 Քո հրաշալի գործերը միթէ խաւարի՞ մէջ պիտի ճանաչուեն, կամ քո արդարութիւնը՝ մոռացուած երկրում։ "},
	{14, "14 Ես, Տէ՛ր, առ քեզ աղաղակեցի, առաւօտեան իմ աղօթքը քեզ պիտի հասնի։ "},
	{15, "15 Ինչո՞ւ, Տէ՛ր, մերժում ես իմ հոգին, կամ շրջում երեսդ ինձնից։ "},
	{16, "16 Տնանկ եւ չարքաշ եմ ես մանկութիւնից ի վեր, բարձրութիւնից ընկայ ու շուարեցի։ "},
	{17, "17 Քո բարկութիւնը ծանրացաւ ինձ վրայ, քո արհաւիրքները խռովեցրին ինձ։ "},
	{18, "18 Ջրի պէս օրնիբուն շրջապատեցին ինձ,պաշարեցին ինձ բոլորը միասին։ "},
	{19, "19 Իմ թշուառութեան պատճառով բարեկամներիս ու ծանօթներիս հեռացրիր ինձնից։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view88() {
struct hy88 poems[] = {
	{1, "1 Եման Եզրայելացու իմաստութիւնը "},
	{2, "2 Քո ողորմութիւնները, Տէ՛ր, յաւիտեան պիտի օրհնեմ, սերնդից սերունդ պիտի պատմեմ իմ բերանով։ "},
	{3, "3 Ասացիր՝ Աշխարհս ողորմութեամբ պիտի շինուի. քո ճշմարտութիւնը երկնքում պիտի հաստատուի։ "},
	{4, "4 Ուխտ կնքեցի իմ ընտրեալների հետ, երդուեցի իմ Դաւիթ ծառային՝ "},
	{5, "5 որ իր սերունդը յաւիտեան պիտի հաստատեմեւ նրա աթոռը դարէդար պիտի կառուցեմ։ "},
	{6, "6 Երկինքը պիտի պատմի քո հրաշագործութիւնը, Տէ՛ր, եւ քո ճշմարտութիւնը՝ սրբերի ժողովում։ "},
	{7, "7 Ամպերի մէջ ո՞վ է քեզ հաւասար, կամ Աստծու որդիների մէջ ո՞վ է Տիրոջը նման։ "},
	{8, "8 Աստուած փառաւորուած է իր սրբերի խորհրդում, մեծ եւ ահաւոր է նա իր շուրջը եղողների համար։ "},
	{9, "9 Զօրութիւնների՛ Տէր Աստուած, ո՞վ է քեզ նման. հզօր ես դու, Տէ՛ր, եւ ճշմարտութիւնդ քո շուրջն է։ "},
	{10, "10 Դու տիրում ես ծովի զօրութիւններին, եւ նրա ալիքների խռովքը դու ես հանդարտեցնում։ "},
	{11, "11 Դու վիրաւորների պէս խոնարհեցրիր ամբարտաւաններինեւ բազկիդ ուժով ցրեցիր քո թշնամիներին։ "},
	{12, "12 Քոնն է երկինքը եւ քոնն է երկիրը, աշխարհն իր մէջ եղածով դո՛ւ հաստատեցիր։ "},
	{13, "13 Հիւսիսն ու Հարաւը դո՛ւ ստեղծեցիր, Թաբորն ու Հերմոնը քո անուամբ պիտի ցնծան։ "},
	{14, "14 Քոնն է բազուկը եւ քոնն է կարողութիւնը, թող զօրանայ քո աջը, եւ բարձր լինի քո ձեռքը։ "},
	{15, "15 Քո աթոռը հաստատուած է արդարութեան ու իրաւունքի վրայ, ողորմութիւնն ու ճշմարտութիւնը քո առաջից պիտի ընթանան։ "},
	{16, "16 Երանի այն ժողովրդին, որը գիտակցում է քո օրհնութիւնը, Տէ՛ր, նա քո երեսի լոյսով պիտի ընթանայ։ "},
	{17, "17 Նա քո անուամբ պիտի ցնծայ գիշեր-ցերեկ,ու քո արդարութեամբ բարձր պիտի լինի։ "},
	{18, "18 Դու ես պարծանքը մեր զօրութեան, եւ մեր եղջիւրը քո կամքով պիտի բարձրանայ։ "},
	{19, "19 Տիրոջից է Իսրայէլի սրբի՝ մեր թագաւորի օգնութիւնը։ "},
	{20, "20 Այնժամ դու տեսիլքի մէջ խօսեցիր որդիներիդ հետ՝ասելով. Օգնութի՛ւն ցոյց կը տամ հզօրին, եւ կը բարձրացնեմ ժողովրդիս ընտրեալին։ "},
	{21, "21 Գտայ իմ Դաւիթ ծառային, սուրբ իւղովս օծեցի նրան։ "},
	{22, "22 Ձեռքս կ՚ընդունի նրան, եւ բազուկս նրան կը զօրացնի։ "},
	{23, "23 Թշնամին չի վնասի նրան, եւ անօրէնութեան որդին նրան չի չարչարի։ "},
	{24, "24 Նրա թշնամիներին կը հարուածեմ նրա առաջ, եւ նրան ատողներին պարտութեան կը մատնեմ։ "},
	{25, "25 Իմ ճշմարտութիւնն ու ողորմութիւնը նրա հետ են, եւ նրա եղջիւրն իմ անուամբ բարձր կը լինի։ "},
	{26, "26 Նրա ձեռքը կը հաստատեմ ծովի վրայ,եւ նրա աջը՝ գետերի վրայ։ "},
	{27, "27 Նա ձայն կը տայ ինձ. Իմ հայրն ես դու, Աստուա՛ծ, հաճեցնողն իմ փրկութեան։ "},
	{28, "28 Ես իմ անդրանիկ որդին կը դարձնեմ նրան,եւ բարձր՝ քան երկրի բոլոր թագաւորները։ "},
	{29, "29 Յաւիտեան կը պահեմ նրա համար իմ ողորմութիւնը,եւ ուխտս նրա հանդէպ հաւատարիմ կը մնայ։ "},
	{30, "30 Նրա սերունդը կը հաստատեմ յաւիտեանս յաւիտենից,եւ նրա գահն՝ ինչպէս օրերը երկնքի։ "},
	{31, "31 Եթէ նրա որդիները լքեն իմ օրէնքըեւ իմ դատաստանով չկամենան ընթանալ, "},
	{32, "32 եթէ անարգեն իմ արդարութիւնըեւ իմ պատուիրանները չպահեն, "},
	{33, "33 գաւազանով կը հարուածեմ նրանց անօրէնութիւններին, եւ տանջանքներով՝ նրանց անիրաւութիւններին։ "},
	{34, "34 Բայց իմ ողորմութիւնից չեմ զրկի նրանց,եւ ճշմարտութեանս չեմ դաւաճանի։ "},
	{35, "35 Ոչ էլ իմ ուխտը կ՚անարգեմ,կամ կ՚արհամարհեմ այն, ինչ դուրս է գալիս իմ շրթունքներից։ "},
	{36, "36 Մէկ անգամ ընդմիշտ ես երդուեցի իմ սրբութեամբ, որ Դաւթին չեմ խաբի։ "},
	{37, "37 Նրա սերունդը յաւիտեան կը մնայ, եւ ինչպէս արեւ, "},
	{38, "38 ինչպէս լուսին, նրա աթոռն իմ առջեւ յաւերժ հաստատուած կը մնայ երկնքում, որպէս հաւատարիմ վկայ։ "},
	{39, "39 Բայց արդ, դու մերժեցիր, անարգեցիր ու գետին տապալեցիր քո օծեալին։ "},
	{40, "40 Հրաժարուեցիր քո ծառայի ուխտից, նրա սրբութիւնը հողին հաւասարեցրիր։ "},
	{41, "41 Քանդեցիր նրա բոլոր պարիսպները,եւ նրա բերդերը խարխլեցիր։ "},
	{42, "42 Ճանապարհի անցորդները կողոպտեցին նրան, եւ նա իր հարեւանների նախատինքը դարձաւ։ "},
	{43, "43 Բարձրացրիր նրան նեղողների աջը, ուրախացրիր նրա բոլոր թշնամիներին։ "},
	{44, "44 Նրա սրից ետ դարձրիր քո օգնութիւնը,եւ պատերազմի մէջ նրան չհովանաւորեցիր։ "},
	{45, "45 Անարգեցիր նրա սրբութիւնը,եւ նրա գահը գետին տապալեցիր։ "},
	{46, "46 Նրա կեանքի օրերը նուազեցրիր, եւ նրան ամօթով ծածկեցիր։ "},
	{47, "47 Մինչեւ ե՞րբ պիտի երեսդ շրջես իսպառ, եւ բարկութիւնդ պիտի բորբոքուի՞ հրի պէս։ "},
	{48, "48 Իսկ արդ, յիշի՛ր ու տե՛ս, թէ ո՛րն է իմ հանգիստը. միթէ իզո՞ւր ստեղծեցիր մարդկանց բոլոր որդիներին։ "},
	{49, "49 Ո՞վ է այն մարդը, որ պիտի ապրի ու մահ չտեսնի,կամ իր հոգին պիտի փրկի դժոխքից։ "},
	{50, "50 Ո՞ւր են քո նախկին ողորմութիւնները, Տէ՛ր, որոնք քո ճշմարտութեամբ խոստացար Դաւթին։ "},
	{51, "51 Յիշի՛ր ծառայիդ նախատինքները, որ ծոցումս կրեցի բազում ազգերից։ "},
	{52, "52 Տէ՛ր, քո թշնամիները նախատեցին նրան, նախատելով հատուցեցին քո օծեալին։ "},
	{53, "53 Օրհնեալ է Տէր Աստուածը յաւիտեանս յաւիտենից. թող լինի, թող լինի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view89() {
struct hy89 poems[] = {
	{1, "1 Տէ՛ր, սերնդից սերունդ մեր ապաւէնը եղար։ "},
	{2, "2 Դու կայիր, երբ դեռ չէին հաստատուել լեռները եւ չէին ստեղծուել երկիրն ու ողջ տիեզերքը, յաւիտենութիւնից մինչեւ յաւիտենութիւն։ "},
	{3, "3 Մարդուն մի՛ մատնիր տառապանքի, քանզի ասացիր. Մարդկա՛նց որդիներ, վերադարձէ՛ք ինձ։ "},
	{4, "4 Հազար տարին Տիրոջ աչքում երէկուայ օրուայ պէս է, որ անցաւ, կամ գիշերուայ մի պահի պէս։ "},
	{5, "5 Նրանց տարիները տառապալից պիտի լինեն. առաւօտեան խոտի պէս պիտի բուսնեն, "},
	{6, "6 առաւօտեան խոտի պէս պիտի դալարեն ու ծաղկեն. երեկոյեան պիտի թոռոմեն, չորանան ու ընկնեն։ "},
	{7, "7 Մենք մաշուեցինք քո բարկութիւնից,եւ քո զայրոյթից մենք խռովուեցինք։ "},
	{8, "8 Մեր մեղքերը առջեւդ դրիր, իսկ մեր կեանքը՝ երեսիդ լոյսի տակ։ "},
	{9, "9 Մեր օրերը բոլորովին նուազեցին, եւ մենք խռովուեցինք քո բարկութիւնից։ Մեր կեանքի ժամանակը դադար չունի սարդի նման։ "},
	{10, "10 Մեր կեանքի օրերի թիւն է եօթանասուն տարի, կամ առաւելագոյնը՝ ութսուն տարի, որոնց մեծ մասն անցնում է ցաւով ու հեծութեամբ։ Մեզ վրայ հեզութիւն իջաւ, եւ մենք խրատուեցինք։ "},
	{11, "11 Իսկ ո՞վ գիտէ քո բարկութեան ուժը, կամ քո պատճառած ահից ո՞վ կը չափի քո զայրոյթը։ "},
	{12, "12 Այսպէս, ինձ ցո՛յց տուր քո աջը,եւ սրտով խոնարհներին՝ քո իմաստութիւնը։ "},
	{13, "13 Դարձի՛ր, Տէ՛ր։ Մինչեւ ե՞րբ... Մխիթարի՛ր քո ծառաներին։ "},
	{14, "14 Առաւօտեան լիացանք քո ողորմութեամբ, ցնծացինք եւ ուրախ եղանք մեր կեանքի բոլոր օրերին։ "},
	{15, "15 Ուրախացանք այն օրերի փոխարէն, երբ հնազանդեցրիր մեզ, եւ այն տարիների, երբ չարչարանք տեսանք։ "},
	{16, "16 Նայի՛ր, Տէ՛ր, քո ծառաներին ու քո ձեռակերտներին, եւ առաջնորդի՛ր նրանց որդիներին։ "},
	{17, "17 Տէր Աստծու լոյսը թող մեզ վրայ իջնի. ուղղի՛ր մեր ձեռքի գործերը, Տէ՛ր, մեր ձեռքի գործերը յաջողեցրո՛ւ մեզ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view90() {
struct hy90 poems[] = {
	{1, "1 Ով ապրում է Բարձրեալի աջակցութեամբ, երկնքում կը հանգչի Աստծու հովանու տակ։ "},
	{2, "2 Տիրոջը կ՚ասի. Դու ես ինձ ընդունողը, ապաւէ՛ն իմ Աստուած, որի վրայ եմ դրել իմ յոյսը։ "},
	{3, "3 Նա ինձ կը փրկի որսորդի թակարդից ու խռովեցուցիչ խօսքերից։ "},
	{4, "4 Իր ծոցում կը պահի կը պաշտպանի քեզ, եւ դու ապահովութիւն կ՚ունենաս նրա թեւերի հովանու տակ։ "},
	{5, "5 Նրա ճշմարտութիւնը որպէս զէնք քո շուրջը կը լինի։ "},
	{6, "6 Դու չես վախենայ գիշերուայ զարհուրանքիցեւ ոչ էլ ցերեկուայ սլացող նետից, խաւարում շրջող բանից,եւ կէսօրին դեւի գայթակղութիւնից։ "},
	{7, "7 Քո կողքին հազարներ կ՚ընկնեն, եւ քո աջին՝ տասնեակ հազարներ, բայց քեզ ոչինչ չի մերձենայ։ "},
	{8, "8 Բաւական է, որ քո աչքով նայես, եւ դու կը տեսնես մեղաւորների ստացած հատուցումը։ "},
	{9, "9 Դու, Տէ՛ր, իմ յոյսն ես։ Բարձրեալին քեզ ապաւէն դարձրիր։ "},
	{10, "10 Չարիքը չի հասնի քեզ, եւ տանջանքները չեն մօտենայ քո տան յարկին։ "},
	{11, "11 Իր հրեշտակներին հրամայուած է քո մասին, որ պահպանեն քեզ քո բոլոր ճանապարհներին։ "},
	{12, "12 Իրենց բազուկների վրայ պիտի վերցնեն քեզ, որ երբեք ոտքդ քարի չխփես։ "},
	{13, "13 Դու կը քայլես իժերի ու քարբերի վրայով, ոտքով կը կոխոտես առիւծին ու վիշապին։ "},
	{14, "14 Քանի որ յոյսն ինձ վրայ դրեց,ես կը փրկեմ նրան, նրան հովանի կը լինեմ, քանզի անունս ճանաչեց։ "},
	{15, "15 Ինձ ձայն կը տայ՝ ու կը լսեմ նրան, եւ նրա հետ կը լինեմ նեղութեան մէջ. կը փրկեմ ու կը փառաւորեմ նրան։ "},
	{16, "16 Բազում օրերով նրան կը լիացնեմ ու ցոյց կը տամ նրան իմ փրկութիւնը։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view91() {
struct hy91 poems[] = {
	{1, "1 Շաբաթօրեայ օրհնութեան սաղմոսը "},
	{2, "2 Բարի է գոհաբանել Տիրոջը, սաղմոս երգել քո անուանը, ո՛վ Բարձրեալ։ "},
	{3, "3 Առաւօտեան պատմել քո ողորմութիւնը, եւ գիշերը՝ քո ճշմարտութիւնը, "},
	{4, "4 տասնալար սաղմոսարանով, օրհնութեան ձայնով գովաբանել։ "},
	{5, "5 Ուրախացրիր ինձ, Տէ՛ր, քո արարումներով, եւ պիտի ցնծամ ձեռքիդ գործերով։ "},
	{6, "6 Որքա՜ն մեծ են քո գործերը, Տէ՛ր, եւ չափազանց խոր են խորհուրդները քո։ "},
	{7, "7 Անզգամ մարդը չի ըմբռնի,եւ անմիտը չի հասկանայ այս։ "},
	{8, "8 Մեղաւորները՝ բուսնելով ինչպէս խոտ, եւ անօրէնութիւն գործողները՝ ծաղկելով, կը կործանուեն յաւիտեանս յաւիտենից։ "},
	{9, "9 Բայց դու, Տէ՛ր, Բարձրեալ ես յաւիտեան։ "},
	{10, "10 Ահա քո թշնամիները, Տէ՛ր, ահա քո թշնամիները կը կորչեն, կը ցրուեն բոլոր նրանք, ովքեր անօրէնութիւն են գործում։ "},
	{11, "11 Միեղջերուի պէս բարձր կը լինի եղջիւրն իմ, իսկ ծերութիւնն իմ՝ առատ օծանելիքով։ "},
	{12, "12 Աչքս դիպաւ թշնամիներիս, որոնք չարութեամբ յարձակուել են վրաս։ Ականջս կը լսի նրանց։ "},
	{13, "13 Արդարներն արմաւենու պէս կը ծաղկեն, Լիբանանի մայրիների պէս կը բազմանան։ "},
	{14, "14 Դրանք կը տնկուեն Տիրոջ տանը,ու կը ծաղկեն մեր Աստծու գաւիթներում։ "},
	{15, "15 Դրանք պտղաբեր կը լինեն նաեւ ծերութեան ժամանակ՝ գիրգ ու փափուկ, "},
	{16, "16 որպէսզի աւետեն, թէ ճշմարիտ է Տէրը, եւ նրա մէջ անիրաւութիւն չկայ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view92() {
struct hy92 poems[] = {
	{1, "1 Առաջին շաբաթուայ օրը, երբ հաստատուեց երկիրը. Դաւթի օրհներգը "},
	{2, "2 Տէրը թագաւորեց, վայելչութիւն հագաւ, զօրութիւն հագաւ Տէրն ու գօտեւորուեց, հաստատեց աշխարհը, որ չսասանուի։ "},
	{3, "3 Սկզբից է պատրաստուած գահը քո, եւ յաւերժ ես դու։ "},
	{4, "4 Բարձրացան գետերը, Տէ՛ր, գետերը բարձրացրին ձայնն իրենց. գետերը պիտի յորդեն իրենց հունից դուրս։ "},
	{5, "5 Առատ ջրի ձայնից ծովի ալիքներն սքանչելի դարձան. սքանչելի ես դու բարձունքներում, Տէ՛ր։ "},
	{6, "6 Մենք անչափ հաւատացինք քո վկայութիւններին. սրբութիւնը վայել է քո տանը, Տէ՛ր, երկար օրեր։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view93() {
struct hy93 poems[] = {
	{1, "1 Աստուած՝ վրէժխնդի՛ր Տէր, Աստուա՛ծ վրէժխնդիր, դու յայտնուեցիր։ "},
	{2, "2 Բա՛րձր եղիր, որ երկիրը դատես, հատուցո՛ւմ տուր ամբարտաւաններին։ "},
	{3, "3 Մինչեւ ե՞րբ մեղաւորները, Տէ՛ր, մինչեւ ե՞րբ մեղաւորները պիտի պարծենան, "},
	{4, "4 յոխորտալով անիրաւութիւն բարբառեն, բարբառեն բոլոր նրանք, ովքեր անօրէնութիւն են գործում։ "},
	{5, "5 Քո ժողովրդին, Տէ՛ր, ճնշեցին,եւ քո ժառանգութիւնը չարչարեցին։ "},
	{6, "6 Այրուն ու պանդխտին սպանեցին, որբերին կոտորեցին ու ասացին. "},
	{7, "7 Տէրը դա չի տեսնում, եւ Յակոբի Աստուածն ուշ չի դարձնում։ "},
	{8, "8 Ուշքի՛ եկէք, ժողովրդի անզգամնե՛ր ու անմիտնե՛ր, մինչեւ ե՞րբ պիտի չըմբռնէք։ "},
	{9, "9 Միթէ ականջ ստեղծողն՝ ինքը չի՞ լսի, կամ աչք ստեղծողն՝ ինքը չի՞ տեսնի։ "},
	{10, "10 Ազգերին խրատողն ու մարդուն գիտութիւն ուսուցանողը միթէ չի՞ յանդիմանի։ "},
	{11, "11 Տէրը գիտէ մարդկանց խորհուրդները, որոնք ունայն են։ "},
	{12, "12 Երանի այն մարդուն, որին խրատում ես դու, Տէ՛ր, եւ օրէնքներդ նրան սովորեցնում։ "},
	{13, "13 Դու նրան հանդարտեցնում ես չար օրերին, մինչեւ որ մեղաւորի համար խոր փոս փորուի։ "},
	{14, "14 Տէրը չի մերժի իր ժողովրդին, եւ իր ժառանգութիւնը չի անտեսի, "},
	{15, "15 մինչեւ որ դատաստանն արդար դառնայ, եւ բոլոր նրանք, որ սրտով ուղիղ են, ընդունեն այն։ "},
	{16, "16 Ո՞վ ինձ հետ պիտի ելնի չարամիտների դէմ, կամ ո՞վ ինձ հետ պիտի միաբանի ընդդէմ նրանց, ովքեր անօրէնութիւն են գործում։ "},
	{17, "17 Եթէ Տէրն ինձ չաջակցէր, մի փոքր եւս՝ եւ հոգիս կը բնակուէր դժոխքում։ "},
	{18, "18 Երբ ասում էի, թէ՝ ահա ոտքերս սասանուեցին, քո ողորմութիւնը, Տէ՛ր, օգնում էր ինձ։ "},
	{19, "19 Սրտիս ցաւերի բազմանալու ժամինքո մխիթարութիւնը հրճուեցնում էր իմ հոգին։ "},
	{20, "20 Թող չհաւասարուի քեզ աթոռն անօրէնութեան, որ վնաս է պատճառում օրէնքին։ "},
	{21, "21 Արդարի հոգին որսացին, եւ անմեղի արիւնն էին դատապարտում։ "},
	{22, "22 Տէրն եղաւ իմ ապաւէնը, իմ յոյսի օգնական Աստուածը։ "},
	{23, "23 Տէրը նրանց պիտի հատուցի իրենց անօրէնութեան համեմատ, իրենց չարութեան համեմատ պիտի կործանի նրանց Տէր Աստուածը մեր։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view94() {
struct hy94 poems[] = {
	{1, "1 Եկէ՛ք ցնծանք Տիրոջ առջեւ, աղաղակենք մեր փրկիչ Աստծուն։ "},
	{2, "2 Փութանք նրա մօտ խոստովանութեամբ, սաղմոսերգութիւններով աղաղակենք առ Աստուած։ "},
	{3, "3 Մեծ է Աստուած, Տէր, մեծ թագաւոր ողջ աշխարհում։ "},
	{4, "4 Նրա ձեռքում են բոլոր եզերքները երկրի, եւ նրանն են բարձունքները լեռների։ "},
	{5, "5 Նրանն է ծովը, եւ նա՛ արարեց այն, ու ցամաքը նրա ձեռքերն ստեղծեցին։ "},
	{6, "6 Եկէ՛ք երկրպագենք նրան, խոնարհուենք ու լաց լինենք մեր Արարչի՝ Տիրոջ առջեւ։ "},
	{7, "7 Տէր Աստուածն է նա մեր, մենք՝ նրա ձեռքի տակի ժողովուրդը եւ նրա արօտի ոչխարները։ "},
	{8, "8 Այսօր, երբ լսէք ձայնը նրա, մի՛ խստացրէք սրտերը ձեր դառնութեամբ, ինչպէս փորձութեան օրն անապատում, "},
	{9, "9 որտեղ ինձ փորձեցին ձեր հայրերը, քննեցին ինձ ու տեսան իմ գործերը։ "},
	{10, "10 Քառասուն տարի տքնեցի այդ ազգի համար եւ ասացի. Նրանք միշտ մոլորուած են սրտով, ու ճանապարհներս չճանաչեցին։ "},
	{11, "11 Ուստի երդուեցի զայրոյթիս պահին, որ նրանք չեն մտնի իմ հանգստի մէջ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view95() {
struct hy95 poems[] = {
	{1, "1 Օրհնեցէ՛ք Տիրոջը նոր օրհներգով, օրհնեցէ՛ք Տիրոջը, համայն աշխարհի մարդիկ։ "},
	{2, "2 Օրհնեցէ՛ք Տիրոջն ու օրհնեցէ՛ք անունը նրա, օրըստօրէ աւետեցէ՛ք փրկութիւնը նրա։ "},
	{3, "3 Հեթանոսների մէջ փառքը պատմեցէ՛ք նրա, եւ բոլոր ժողովուրդների մէջ՝ սքանչելագործութիւնները նրա։ "},
	{4, "4 Մեծ է Տէրն ու անչափ օրհնեալ, ահարկու է նա բոլոր կուռքերից աւելի։ "},
	{5, "5 Հեթանոսների բոլոր կուռքերը դեւեր են, իսկ Տէրն արարիչն է երկնքի։ "},
	{6, "6 Խոստովանութիւն եւ վայելչութիւն կայ նրա առջեւ, սրբութիւն եւ մեծափառութիւն՝ նրա սրբարանում։ "},
	{7, "7 Մատուցեցէ՛ք Տիրոջը, ազգատոհմե՛ր, մատուցեցէ՛ք Տիրոջը փառք ու պատիւ։ "},
	{8, "8 Մատուցեցէ՛ք Տիրոջը փառքն իր անուան, ընծանե՛ր վերցրէք ու մտէ՛ք սրահները նրա։ "},
	{9, "9 Երկրպագեցէ՛ք Տիրոջն իր սրբարանի գաւիթներում, քանզի ամբողջ երկիրը պիտի խռովուի նրա ներկայութիւնից։ "},
	{10, "10 Հեթանոսների մէջ ասացէ՛ք, թէ՝ Տէրը թագաւորեց, նա աշխարհն հաստատեց, որ չսասանուի, եւ նա իր ժողովրդին արդարութեամբ պիտի դատի։ "},
	{11, "11 Թող ուրախ լինի երկինքն ու ցնծայ երկիրը, թող զուարճանայ ծովն իր մէջ եղած բոլոր կենդանի էակներով։ "},
	{12, "12 Թող հրճուեն դաշտերը եւ նրանցում եղած ամէն ինչ, թող այնժամ ցնծան անտառի բոլոր ծառերը "},
	{13, "13 Տիրոջ առջեւ, որ գալիս է, գալիս է դատելու երկիրը։ Նա պիտի դատի տիեզերքն արդարութեամբ,եւ բոլոր ժողովուրդներին՝ իր ճշմարտութեամբ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view96() {
struct hy96 poems[] = {
	{1, "1 Տէրը թագաւորեց, թող երկիրը ցնծայ, թող ուրախ լինեն բազում կղզիները։ "},
	{2, "2 Ամպ եւ մէգ է շուրջը նրա, իրաւունքով ու արդարութեամբ է հաստատուած աթոռը նրա։ "},
	{3, "3 Նրա առջեւից հուր պիտի ընթանայ, այրելով իր շուրջն եղող թշնամիներին։ "},
	{4, "4 Նրա կայծակները երեւացին տիեզերքում, երկիրը տեսաւ դրանք ու սասանուեց։ "},
	{5, "5 Լեռները մոմի պէս պիտի հալուեն Տիրոջ ներկայութիւնից, ամբողջ երկիրը՝ Տիրոջ ներկայութիւնից։ "},
	{6, "6 Երկինքը պիտի պատմի արդարութիւնը նրա, բոլոր ժողովուրդները տեսան փառքը նրա։ "},
	{7, "7 Թող խայտառակուեն բոլոր նրանք, ովքեր երկրպագում են կուռքերին,եւ պարծենում իրենց արձաններով։ Նրա բոլոր հրեշտակները պիտի երկրպագեն իրեն, "},
	{8, "8 քանզի լսեց եւ ուրախ եղաւ Սիոնը. Յուդայի երկրի դուստրերը պիտի ցնծան քո դատաստանների համար, Տէ՛ր։ "},
	{9, "9 Դու Բարձրեալ ես ողջ երկրի վրայ, անչափ վեր եղար բոլոր կուռքերից։ "},
	{10, "10 Տիրո՛ջը սիրողներ, ատեցէ՛ք չարութիւնը. Տէրը պահպանում է իր սրբերի հոգիները, մեղաւորների ձեռքից փրկում է նրանց։ "},
	{11, "11 Արդարների համար լոյս ծագեց, եւ սրտով շիտակների համար ուրախութիւն եղաւ։ "},
	{12, "12 Ցնծացէ՛ք, արդարնե՛ր, Տիրոջով, գոհաբանեցէ՛ք յիշատակը նրա սրբութեան։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view97() {
struct hy97 poems[] = {
	{1, "1 Օրհնեցէ՛ք Տիրոջը նոր օրհներգով, քանզի սքանչելագործութիւններ արեց նա։ Իր Աջն ու իր սուրբ բազուկը փրկեցին նրան։ "},
	{2, "2 Տէրը ցոյց տուեց իրենից եկող փրկութիւնը, ազգերի առջեւ յայտնեց իր արդարութիւնը։ "},
	{3, "3 Իր ողորմութեամբ յիշեց Յակոբին, իր ճշմարտութեամբ՝ տունն Իսրայէլի. եւ երկրի բոլոր ծայրերը տեսան մեր Աստծու շնորհած փրկութիւնը։ "},
	{4, "4 Աղաղակի՛ր Տիրոջ առջեւ, ո՛ղջ երկիր. օրհնեցէ՛ք, ցնծացէ՛ք ու սաղմո՛ս երգեցէք։ "},
	{5, "5 Սաղմո՛ս երգեցէք մեր Աստծուն օրհնութեամբ, օրհնութեամբ ու սաղմոսերգութեամբ։ "},
	{6, "6 Կոփածոյ շեփորի օրհնութեան ձայնով, օրհնութեամբ, ցնծութեամբ ու եղջերափողի ձայնով աղաղակեցէ՛ք Տիրոջ՝ թագաւորի առջեւ։ "},
	{7, "7 Թող խռովուի ծովն իր մէջ եղած բոլոր կենդանի էակներով, տիեզերքն իր ամբողջ բնակիչներով։ "},
	{8, "8 Եւ գետերը թող ծափ տան միասին իրենց ձեռքերով, ու լեռները ցնծան Տիրոջ առջեւ, "},
	{9, "9 քանզի Տէրը եկել հասել է՝ երկիրը դատելու։ Նա պիտի դատի աշխարհն արդարութեամբ,եւ իր ժողովուրդներին՝ ճշմարտութեամբ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view98() {
struct hy98 poems[] = {
	{1, "1 Տէրը թագաւորեց, ժողովուրդները բարկացան։ Ո՛վ քերովբէների վրայ նստողդ, երկիրը սասանուեց։ "},
	{2, "2 Տէրը մեծ է Սիոնում ու բարձր, քան ժողովուրդները բոլոր։ "},
	{3, "3 Գոհութիւն մատուցենք քո մեծ անուանը, քանզի ահաւոր ու սուրբ է նա։ "},
	{4, "4 Իրաւունք սիրելը պատիւ է բերում թագաւորին. դո՛ւ հաստատեցիր իրաւունքն ու արդարութիւնը Յակոբի մէջ։ "},
	{5, "5 Մեծարեցէ՛ք մեր Տէր Աստծուն, երկրպագեցէ՛ք նրա ոտքերի պատուանդանին, քանզի Նա սուրբ է։ "},
	{6, "6 Մովսէսն ու Ահարոնը՝ երէցները նրա, Սամուէլը, որ նրա անունը կանչողների մէջ էր, ձայն էին տալիս Տիրոջն, ու նա լսում էր նրանց "},
	{7, "7 եւ ամպի սիւնով խօսում նրանց հետ։ Նրանք պահպանում էին վկայութիւնը նրաեւ հրամանները, որ տուեց իրենց։ "},
	{8, "8 Տէ՛ր Աստուած մեր, դու լսում էիր նրանց. Աստուա՛ծ, դու քաւիչ եւ վրէժխնդիր էիր լինում նրանց բոլոր գործերի համար։ "},
	{9, "9 Մեծարեցէ՛ք մեր Տէր Աստծուն, երկրպագեցէ՛ք նրա սուրբ լերանը, քանզի սուրբ է Տէր Աստուածը մեր։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view99() {
struct hy99 poems[] = {
	{1, "1 Դաւթի խոստովանութեան սաղմոսը "},
	{2, "2 Աղաղակեցէ՛ք Տիրոջ առջեւ, երկրի բոլո՛ր բնակիչներ, ծառայեցէ՛ք Տիրոջն ուրախութեամբ։ "},
	{3, "3 Նրա առջեւ ելէ՛ք ցնծութեամբ. իմացէ՛ք, որ Նա է Տէր Աստուածը մեր. նա ստեղծեց մեզ, եւ ոչ թէ մենք եղանք. նրա ժողովուրդն ենք մենք ու ոչխարները նրա արօտի։ "},
	{4, "4 Մտէ՛ք նրա դռներով խոստովանութեամբ, եւ մտէ՛ք նրա սրահները՝ օրհնութեամբ. գոհութի՛ւն մատուցեցէք Տիրոջն ու օրհնեցէ՛ք անունը նրա։ "},
	{5, "5 Քաղցր է Տէրը, նրա ողորմութիւնը յաւերժ է, նրա ճշմարտութիւնը՝ սերնդից սերունդ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view100() {
struct hy100 poems[] = {
	{1, "1 Ողորմութեանդ ու արդարութեանդ մէջ պիտի օրհնեմ քեզ, Տէ՛ր, սաղմոս պիտի երգեմ, "},
	{2, "2 եւ ի մտի պիտի ունենամ անբիծ ճանապարհով ընթանալ, մինչեւ որ նա գայ ինձ մօտ. քանզի ես իմ տան մէջ սրտիս անարատութեամբ էի ընթանում։ "},
	{3, "3 Աչքերիս առջեւ անիրաւ բան չդրի,եւ ուրացութիւն անողներին ատեցի։ "},
	{4, "4 Ծուռ սիրտ ունեցողն ինձ չմօտեցաւ. անզգամն ինձնից խոտորուեց, բայց ես հոգ չարեցի։ "},
	{5, "5 Ով ծածուկ խօսեց իր ընկերոջ դէմ, նրան բացէիբաց հալածեցի, ով ամբարտաւան էր աչքով եւ ագահ՝ սրտով,նրա հետ հաց իսկ չկերայ։ "},
	{6, "6 Աչքերս սեւեռուած էին երկրի հաւատացեալներին, որպէսզի նրանք ինձ հետ նստեն. ով գնում էր անբիծ ճանապարհով, նա՛ էր ինձ ծառայում։ "},
	{7, "7 Ամբարտաւանութիւն անողն իմ տան մէջ չէր բնակւում, անիրաւութիւն խօսողն աչքերիս առջեւ յաջողութիւն չունէր։ "},
	{8, "8 Առաւօտներն սպանում էի երկրի բոլոր մեղաւորներին, որ Տիրոջ քաղաքից վերացնեմ բոլոր նրանց, ովքեր անօրէնութիւն են գործում։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view101() {
struct hy101 poems[] = {
	{1, "1 Բորոտի աղօթքը, երբ նա իր անձկութեան մէջ Տիրոջ առաջ դրեց իր խնդրանքները "},
	{2, "2 Տէ՛ր, լսի՛ր իմ աղօթքը, աղաղակս թող հասնի քեզ։ "},
	{3, "3 Մի՛ շրջիր երեսդ ինձնից, նեղութեանս օրը ի՛նձ մօտեցրու ականջը քո. երբ ձայն տամ քեզ՝ իսկոյն լսի՛ր ինձ։ "},
	{4, "4 Ծխի պէս սպառուեցին օրերն իմ, եւ ոսկորներս չորացան ինչպէս խռիւ։ "},
	{5, "5 Սիրտս խոցուեց եւ ցամաքեց խոտի պէս, հեծութեանս ձայնից հաց ուտելս մոռացայ։ "},
	{6, "6 Ոսկորս մարմնիս կպաւ, եւ նմանուեցի անապատի հաւալուսնին։ "},
	{7, "7 Եղայ ինչպէս բու աւերակներում, տքնեցի ու դարձայ ինչպէս մենաւոր ճնճղուկ տանիքում։ "},
	{8, "8 Թշնամիներս ամէն օր նախատեցին ինձ, եւ ինձ գովողներն ինձնով երդուեցին։ "},
	{9, "9 Մոխիր կերայ հացի տեղ,եւ ըմպելիքս արտասուքով խառնեցի "},
	{10, "10 քո բարկութեան ու զայրոյթի պատճառով, քանզի դու ինձ բարձրացրիր եւ վայր գցեցիր։ "},
	{11, "11 Օրերս անցան ստուերի պէս, եւ ես ցամաքեցի ինչպէս խոտ։ "},
	{12, "12 Դու, Տէ՛ր, յաւերժ ես, եւ սերնդից սերունդ է յիշատակը քո։ "},
	{13, "13 Դու պիտի ելնես, որ գթաս Սիոնին.ժամանակն է գթալու նրան, հասել է ժամը։ "},
	{14, "14 Ծառաներդ նրա քարերը հաւանեցին,ու գթացին նրա հողին։ "},
	{15, "15 Հեթանոսները պիտի սոսկան քո անունից, եւ երկրի բոլոր թագաւորները՝ քո փառքից։ "},
	{16, "16 Տէրը պիտի Սիոնը վերաշինի, եւ իր փառքով երեւայ այնտեղ։ "},
	{17, "17 Ուշ դարձրեց նա խեղճերի աղօթքին,եւ չարհամարհեց խնդրանքը նրանց։ "},
	{18, "18 Սա պիտի գրուի այլ սերնդի համար, որպէս ժառանգութիւն ստացած նրա ժողովուրդը պիտի օրհնի Տիրոջը։ "},
	{19, "19 Նայեց նա իր սրբութեան բարձրութիւնից, Տէրն երկնքից երկիր նայեց՝ "},
	{20, "20 բանտարկեալների հառաչանքը լսելու եւ մահապարտների որդիներին ազատ արձակելու համար, "},
	{21, "21 որ Սիոնում պատմեն անունը Տիրոջ,եւ Երուսաղէմում՝ գովքը նրա, "},
	{22, "22 որ ժողովուրդներն իրար մօտ հաւաքուեն, եւ թագաւորները Տիրոջը ծառայեն։ "},
	{23, "23 Նա պատասխանեց նրան իր հզօրութեան ճանապարհին. Ասա՛ ինձ սակաւութիւնն իմ օրերի, "},
	{24, "24 եւ ինձ մի՛ վերցրու օրերիս կէսին, քանզի յաւերժ են տարիները քո։ "},
	{25, "25 Ի սկզբանէ, Տէ՛ր, երկրի հիմքերն հաստատեցիր, եւ երկինքն էլ գործն է քո ձեռքերի։ "},
	{26, "26 Կ՚անցնեն դրանք, բայց դու կաս եւ կը մնաս յաւիտեան. ամէն ինչ ձորձի պէս կը մաշուի, դու վերարկուի պէս կը փոխես դրանք, ու դրանք կը փոխուեն։ "},
	{27, "27 Բայց դու նոյնը կը մնաս, եւ քո տարիները չեն անցնի։ "},
	{28, "28 Քո ծառաների որդիները կը բնակուեն այնտեղ, եւ նրանց սերնդին յաւիտեան յաջողութիւնը կ՚ուղեկցի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view102() {
struct hy102 poems[] = {
	{1, "1 Օրհնի՛ր Տիրոջը, ո՛վ իմ անձ, եւ իմ բոլոր ոսկորները թող օրհնեն սուրբ անունը նրա։ "},
	{2, "2 Օրհնի՛ր Տիրոջը, ո՛վ իմ անձ,եւ մի՛ մոռացիր բոլոր պարգեւները նրա, "},
	{3, "3 ով քաւութիւն է տալիս քո մեղքերին, բժշկում ախտերը քո բոլոր։ "},
	{4, "4 Նա, որ քո կեանքը փրկում է ապականութիւնից, քեզ պսակում է ողորմութեամբ ու գթութեամբ, "},
	{5, "5 որ բարութեամբ յագեցնում է ցանկութիւնը քո, եւ քո երիտասարդութիւնը նորոգւում է արծուի պէս։ "},
	{6, "6 Ողորմութիւն ու արդարութիւն է շնորհում Տէրը բոլոր զրկեալներին։ "},
	{7, "7 Տէրն իր ուղիները ցոյց տուեց Մովսէսին,եւ իր կամքը՝ Իսրայէլի որդիներին։ "},
	{8, "8 Գթասիրտ, ողորմած է Տէրը, համբերատար ու ողորմաշատ։ "},
	{9, "9 Տէրն իսպառ չի բարկանումեւ յաւիտեան ոխ չի պահում։ "},
	{10, "10 Մեր մեղքերի համեմատ չվարուեց մեզ հետ, ոչ էլ մեր անօրէնութեան համեմատ հատուցեց մեզ։ "},
	{11, "11 Այլ որքան բարձր է երկինքը երկրից, այնքան զօրեղ է Տիրոջ ողորմութիւնն իրենից երկիւղ կրողների վրայ։ "},
	{12, "12 Որքան հեռու է արեւելքն արեւմուտքից, այնքան հեռացրեց նա մեր անօրէնութիւնները մեզնից։ "},
	{13, "13 Ինչպէս որ մի հայր գթում է իր որդիներին, այնպէս Տէրը պիտի գթայ իրենից երկիւղ կրողներին։ "},
	{14, "14 Նա գիտէ կազմուածքը մեր եւ յիշում է, որ հող ենք մենք։ "},
	{15, "15 Մարդու օրերը խոտի պէս են. նա ծաղկում է ինչպէս վայրի ծաղիկ։ "},
	{16, "16 Երբ փչի քամին, նա կ՚անհետանայ,եւ նրա տեղն իսկ չի երեւայ։ "},
	{17, "17 Բայց Տիրոջ ողորմութիւնը յաւիտեանս յաւիտենից իրենից երկիւղ կրողների վրայ է, եւ նրա արդարութիւնը՝ որդոց որդի նրանց հանդէպ, "},
	{18, "18 որոնք պահում են ուխտը նրա, յիշում նրա պատուիրաններն ու կատարում դրանք։ "},
	{19, "19 Տէրն երկնքում հաստատեց իր աթոռը, նրա թագաւորութիւնը տիրում է բոլորին։ "},
	{20, "20 Օրհնեցէ՛ք Տիրոջը, նրա բոլո՛ր հրեշտակներ, որ հզօր էք ուժով, կատարում էք խօսքը նրա, լսում ձայնը նրա պատգամների։ "},
	{21, "21 Օրհնեցէ՛ք Տիրոջը, նրա բոլո՛ր զօրքեր, սպասաւորնե՛ր եւ նրա կամքը կատարողնե՛ր։ "},
	{22, "22 Օրհնեցէ՛ք Տիրոջը, նրա բոլոր գործերը, ամենուրեք է տէրութիւնը նրա։Հոգի՛դ իմ, օրհնի՛ր Տիրոջը։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view103() {
struct hy103 poems[] = {
	{1, "1 Օրհնիր Տիրոջը, ո՛վ իմ անձ. Տէ՛ր իմ Աստուած, անչափ մեծ ես, գովաբանութեամբ ու մեծափառութեամբ զգեստաւորուեցիր։ "},
	{2, "2 Լոյսը կրեցիր ինչպէս վերարկու, երկինքը փռեցիր վրանի պէս, "},
	{3, "3 քո վերնայարկը հաստատեցիր ջրերի վրայ։ Երթեւեկում է Նա ամպերի մէջ եւ շրջում հողմերի թեւերին։ "},
	{4, "4 Նա քամիները հրեշտակներ դարձրեց իրեն, եւ կիզիչ հուրը՝ սպասաւորների։ "},
	{5, "5 Երկիրն հաստատեց իր հիմերի վրայ, որ յաւիտեան չսասանուի։ "},
	{6, "6 Խոր ծովերն ասես նրա զգեցած վերարկուն լինեն։ Ջրերը կանգնած են լեռների վրայ։ "},
	{7, "7 Նրանք պիտի փախչեն քո սաստից,եւ քո որոտի ձայնից պիտի սարսափեն։ "},
	{8, "8 Լեռները պիտի ելնեն ու դաշտերն իջնեն այնտեղ, ուր դու հաստատեցիր դրանք։ "},
	{9, "9 Սահման դրիր, որպէսզի չանցնեն եւ չողողեն երկիրը նորից։ "},
	{10, "10 Աղբիւրները դէպի ձորերն ուղղեցիր, եւ ջրերը լեռների միջով պիտի հոսեն՝ "},
	{11, "11 յագեցնելու ծարաւը բոլոր գազանների ու վայրի էշերի։ "},
	{12, "12 Այնտեղ երկնքի թռչունները բոյն պիտի դնեն եւ ժայռերի միջից ձայն պիտի տան։ "},
	{13, "13 Նա ջուր պիտի խմեցնի լեռներին իր շտեմարաններից, նրա գործերի պտուղներով պիտի երկիրը լցուի։ "},
	{14, "14 Մարդկանց կարիքների համար լեռներում խոտ աճեցրիր ու բանջար,եւ հողից հաց հանեցիր։ "},
	{15, "15 Գինին ուրախացնում է մարդուն,իւղը՝ զուարթացնում, եւ հացն ամրացնում է մարդու սիրտը։ "},
	{16, "16 Թող յագենան Տիրոջ ծառերն ու մայրիները Լիբանանի, որ դու տնկեցիր։ "},
	{17, "17 Այնտեղ երկնքի թռչունները ձագ կը հանեն, եւ արագիլի բոյնը նրանց ապաստան կը լինի։ "},
	{18, "18 Բարձր լեռներն եղջերուների համար են, իսկ ժայռերը ապաստան են նապաստակների համար։ "},
	{19, "19 Դու հաստատեցիր լուսինը ժամանակը չափելու համար, արեգակն իմացաւ պահն իր մայրամուտի։ "},
	{20, "20 Դու խաւարն ստեղծեցիր, ու գիշեր եղաւ, որի մէջ շրջում են բոլոր գազաններն անտառի։ "},
	{21, "21 Առիւծների կորիւնները մռնչում են ու յօշոտում՝Աստծուց իրենց ուտելիքը խնդրելով։ "},
	{22, "22 Արեւածագին նրանք հաւաքւում են եւ հանգչում իրենց որջերում։ "},
	{23, "23 Մարդ մինչեւ երեկոյ գնում է իր գործինու վաստակին իր ձեռքերի։ "},
	{24, "24 Որքա՜ն մեծ են գործերը քո, Տէ՛ր, ամէն ինչ իմաստութեամբ ստեղծեցիր դու, եւ աշխարհը լցուեց քո ստեղծածներով։ "},
	{25, "25 Ահա ծովը՝ մեծ եւ լայնատարած, որի մէջ վխտացող կենդանիներին թիւ չկայ.այնտեղ կան մեծամեծ ու փոքր գազաններ. "},
	{26, "26 այնտեղ նաեւ նաւերն են լողում։Այնտեղ է վիշապը, որ դու ստեղծեցիր, որ խաղ անի ծովի հետ։ "},
	{27, "27 Բոլորը քեզ են սպասում, որ նրանց ուտելիքը ժամանակին տաս։ "},
	{28, "28 Տալիս ես նրանց, ու նրանք կերակրւում են, բացում ես ձեռքդ եւ քո հաճութեամբ սնում բոլորին։ "},
	{29, "29 Երբ շրջում ես երեսդ նրանցից, խռովւում են նրանք, երբ նրանցից հանում ես նրանց շունչը, սպառւում եւ հող են դառնում։ "},
	{30, "30 Ուղարկում ես քո շունչը եւ վերստեղծում նրանց, ու նորոգում երեսն երկրի։ "},
	{31, "31 Թող Տիրոջ փառքը յաւիտեան լինի, եւ Տէրն ուրախանայ իր արարածներով։ "},
	{32, "32 Նա նայում է երկրին ու դող պատճառում նրան, մերձենում լեռներին՝ եւ նրանք ծուխ են արձակում։ "},
	{33, "33 Պիտի օրհնեմ Տիրոջն իմ կեանքում, սաղմոս պիտի երգեմ իմ Աստծուն՝ քանի դեռ կամ։ "},
	{34, "34 Օրհնութիւնն իմ քաղցր կը լինի նրան, եւ ես կ՚ուրախանամ Տիրոջով։ "},
	{35, "35 Թող մեղաւորները պակասեն աշխարհից, եւ ամբարիշտներ թող չգտնուեն նրա մէջ։Հոգի՛դ իմ, օրհնի՛ր Տիրոջը։ Ալէլուիա։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view104() {
struct hy104 poems[] = {
	{1, "1 Գոհութի՛ւն մատուցեցէք Տիրոջն ու նրա անո՛ւնը կանչեցէք, հեթանոսների մէջ պատմեցէ՛ք գործերը նրա։ "},
	{2, "2 Օրհնեցէ՛ք ու սաղմո՛ս երգեցէք նրան, պատմեցէ՛ք բոլոր հրաշագործութիւնները նրա։ "},
	{3, "3 Պարծեցէ՛ք նրա սուրբ անունով, թող ուրախ լինի սիրտը նրանց, ովքեր փնտռում են Տիրոջը։ "},
	{4, "4 Փնտռեցէ՛ք Տիրոջն ու հզօրացէ՛ք, փնտռեցէ՛ք նրա երեսն ամէն ժամ։ "},
	{5, "5 Յիշեցէ՛ք հրաշագործութիւնները նրա, սքանչելիքներն ու բերանի պատուիրանները նրա։ "},
	{6, "6 Աբրահամի՛ սերունդներ, դուք ծառաներն էք նրա, ընտրեալներն էք նրա, դուք՝ Յակոբի՛ որդիներ։ "},
	{7, "7 Նա ինքը Տէր Աստուածն է մեր, եւ ողջ աշխարհում են դատաստանները նրա։ "},
	{8, "8 Իր ուխտը նա յաւիտեան յիշեցեւ իր պատուիրած խօսքը՝ մինչեւ հազար տարի։ "},
	{9, "9 Ուխտ, որ Աբրահամի հետ կնքեց, եւ երդումն իր՝ Իսահակի հետ։ "},
	{10, "10 Յակոբի համար իր հրամանն հաստատեց,եւ Իսրայէլի համար՝ ուխտն իր յաւիտենական։ "},
	{11, "11 Ասաց. Ձեզ պիտի տամ երկիրը Քանանի՝ բաժինը ձեր ժառանգութեան։ "},
	{12, "12 Երբ սակաւ էին նրանք թուով, տկար էին եւ օտար այդ երկրում, "},
	{13, "13 դեգերում էին սերնդից սերունդ, մի թագաւորութիւնից դէպի մի այլ ժողովուրդ, "},
	{14, "14 նա թոյլ չտուեց մարդկանց, որ վնասեն նրանց, կշտամբեց թագաւորներին նրանց համար։ "},
	{15, "15 Մի՛ մօտեցէք, - ասաց, - իմ օծեալներին, եւ մարգարէներիս վնաս մի՛ հասցրէք։ "},
	{16, "16 Սովի մատնեց երկիրը նրանց, հացի ամբողջ զօրութիւնը կոտրեց։ "},
	{17, "17 Նրանց առաջից մարդ ուղարկեց՝ Յովսէփին, որ վաճառուեց որպէս ստրուկ։ "},
	{18, "18 Նրա ոտքերը ցաւեցրին շղթաների մէջ, եւ նրա մարմինը երկաթով պնդեցրին, "},
	{19, "19 մինչեւ որ նրա խօսքը կատարուեց,եւ Տիրոջ խօսքը փորձեց նրան։ "},
	{20, "20 Թագաւորը մարդ ուղարկեց ու կապանքներից արձակեց նրան, ժողովրդի իշխանը բաց թողեց նրան, "},
	{21, "21 իր տան վրայ նրան տէր կարգեցեւ իր ողջ ունեցուածքի տնօրինող, "},
	{22, "22 որպէսզի իր ուզածի պէս խրատի նրանց իշխաններին,եւ նրանց ծերերին իմաստուն դարձնի։ "},
	{23, "23 Իսրայէլը մտաւ Եգիպտոս, Յակոբը պանդխտութեան գնաց երկիրը Քամի։ "},
	{24, "24 Խիստ բազմացրեց Տէրն իր ժողովրդին,եւ նրան իր թշնամիներից զօրեղ դարձրեց։ "},
	{25, "25 Թշնամիների սիրտը շրջեց, որ ատեն իր ժողովրդին,եւ իր ծառաների դէմ նենգութիւն գործեն։ "},
	{26, "26 Տէրն ուղարկեց իր ծառայ Մովսէսին եւ իր ընտրեալ Ահարոնին՝ "},
	{27, "27 տալով նրանց իր նշանների ու սքանչելիքների խօսքը Քամի երկրում։ "},
	{28, "28 Խաւար ուղարկեց ու խաւարի մէջ թողեց նրանց, քանզի դառնացրին իր խօսքը։ "},
	{29, "29 Նրանց գետերն արիւն դարձրեց,եւ ոչնչացրեց բոլոր ձկները նրանց։ "},
	{30, "30 Նրանց երկիրն ու նրանց թագաւորների շտեմարանները լցրեց գորտերով։ "},
	{31, "31 Հրամայեց՝ եւ շնաճանճ ու մժեղ թափուեց նրանց երկրի բոլոր սահմաններում։ "},
	{32, "32 Նրանց անձրեւները կարկտի վերածեց, եւ նրանց երկրում հուր բորբոքուեց։ "},
	{33, "33 Հարուածեց այգիներն ու թզենիները նրանց, եւ փշրեց նրանց երկրի սահմաններում եղած ծառերը բոլոր։ "},
	{34, "34 Ասաց՝ եւ եկաւ մարախ ու խառնիճ, որոնց թիւ չկար։ "},
	{35, "35 Մարախը կերաւ նրանց երկրի ամբողջ խոտը, սպառեց նրանց դաշտի ամբողջ բերքը։ "},
	{36, "36 Տէրը հարուածեց եգիպտացիների բոլոր անդրանիկ ծնունդներին՝ իրենց ամբողջ վաստակի առաջնեկներին։ "},
	{37, "37 Նրանց հանեց Եգիպտոսից ոսկով ու արծաթով, եւ նրանց ցեղի մէջ հիւանդ չկար։ "},
	{38, "38 Եգիպտոսն ուրախացաւ, որ նրանք դուրս եկան, քանզի Տիրոջ ահն ընկել էր իրենց վրայ։ "},
	{39, "39 Ցերեկն ամպ սփռեց նրանց ստուերելու համար, եւ գիշերն հրով լուսաւորեց նրանց։ "},
	{40, "40 Նրանք խնդրեցին՝ ու լորամարգիներ իջան, եւ Տէրը երկնային հացով կշտացրեց նրանց։ "},
	{41, "41 Հարուածեց ժայռին՝ ու ջրեր բխեցին, եւ գետեր հոսեցին անապատով։ "},
	{42, "42 Յիշեց խօսքն իր սուրբ, որ տուել էր իր Աբրահամ ծառային։ "},
	{43, "43 Հանեց իր ժողովրդին ցնծութեամբ, եւ իր ընտրեալներին՝ ուրախութեամբ։ "},
	{44, "44 Նրանց տուեց գաւառներն հեթանոսների,եւ ժողովուրդների վաստակի ժառանգ դարձրեց նրանց, "},
	{45, "45 որ պահեն պատուիրաններն իր, ու հետեւեն իր օրէնքներին։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view105() {
struct hy105 poems[] = {
	{1, "1 Գոհութի՛ւն մատուցեցէք Տիրոջը, քանզի քաղցր է նա, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{2, "2 Ո՞վ պիտի պատմի զօրութիւնը Տիրոջ, լսելի դարձնի նրա ամբողջ օրհնութիւնը։ "},
	{3, "3 Երանի նրանց, ովքեր իրաւունքն են պահում եւ ամէն ժամ արդարութիւն գործում։ "},
	{4, "4 Յիշի՛ր մեզ, Տէ՛ր, ի հաճութիւն քո ժողովրդի, եւ այցելի՛ր մեզ քո շնորհելիք փրկութեամբ։ "},
	{5, "5 Տեսնենք բարութիւնը քո ընտրեալների, ուրախանանք քո ազգի ուրախութեամբ,ու պարծենանք քո ժառանգութեամբ։ "},
	{6, "6 Մենք մեր հայրերի հետ մեղանչեցինք, անօրէնութիւն եւ յանցանք գործեցինք։ "},
	{7, "7 Հայրերը մեր Եգիպտոսում չհասկացան քո հրաշագործութիւնները, չյիշեցին քո ողորմութեան առատութիւնը, քեզ բարկացրին Կարմիր ծովն անցնելիս։ "},
	{8, "8 Նա փրկեց նրանց իր անուան համար, որ ճանաչեն իր զօրութիւնը։ "},
	{9, "9 Սաստեց Կարմիր ծովին՝ եւ այն ցամաքեց, նրանց առաջնորդեց անդնդի միջով ինչպէս անապատով։ "},
	{10, "10 Նրանց ազատեց իրենց ատողներիցեւ նրանց փրկեց իրենց թշնամիների ձեռքից։ "},
	{11, "11 Ծովը ծածկեց նրանց հալածողներին, եւ սրանցից ոչ ոք չփրկուեց։ "},
	{12, "12 Հաւատացին նրա խօսքերին եւ օրհներգեցին նրան։ "},
	{13, "13 Բայց շուտով մոռացան գործերը նրա, եւ չանսացին նրա խորհուրդներին։ "},
	{14, "14 Անապատում ցանկութեամբ վառուեցին, ու փորձեցին Աստծուն անջրդի վայրում։ "},
	{15, "15 Իրենց խնդրածը նա տուեց նրանց, եւ լիութիւն ուղարկեց նրանց։ "},
	{16, "16 Բանակատեղիում բարկացրին Մովսէսին եւ Տիրոջ սրբին՝ Ահարոնին։ "},
	{17, "17 Գետինը բացուեց ու կլանեց Դադանին, ծածկեց բանակն Աբիրոնի։ "},
	{18, "18 Հուր բորբոքուեց նրանց հաւաքավայրերում, եւ բոցը լափեց մեղաւորներին։ "},
	{19, "19 Քորեբում մի հորթ շինեցին,եւ երկրպագեցին արձանին։ "},
	{20, "20 Իրենց Փառքը փոխարինեցին խոտակեր հորթի պատկերով։ "},
	{21, "21 Մոռացան իրենց կեանք տուած Աստծուն, որը մեծ գործեր կատարեց Եգիպտոսում, "},
	{22, "22 սքանչելագործութիւններ՝ Քամի երկրում,եւ ահաւոր բաներ՝ Կարմիր ծովի վրայ։ "},
	{23, "23 Ասաց, թէ պիտի ոչնչացնի նրանց, եթէ նրա ընտրեալ Մովսէսն առջեւը կանգնած չլինէր։ Նա դիմեց Տիրոջն ու վերացրեց բարկութիւնը նրա, որ նրանք չկոտորուեն։ "},
	{24, "24 Անարգեցին երկիրը ցանկալի,ու չհաւատացին Տիրոջ խօսքին։ "},
	{25, "25 Տրտնջացին իրենց բանակատեղիում,ու չլսեցին ձայնը Տիրոջ։ "},
	{26, "26 Տէրն իր ձեռքը բարձրացրեց նրանց վրայ, որ նրանց հարուածի անապատում, "},
	{27, "27 որ նրանց սերունդը ցրուի հեթանոսների մէջ, նրանց սերունդը ցրուի գաւառներում։ "},
	{28, "28 Նրանք Բելփեգորին յարեցին, զոհի միս կերան ու մեռելոտի։ "},
	{29, "29 Բարկացրին Տիրոջն իրենց գործերով, եւ նրանց վրայ կոտորած իջաւ։ "},
	{30, "30 Ապա Փենէէսն եկաւ մէջտեղ, քաւութիւն տուեց, ու մահը վերջ գտաւ։ "},
	{31, "31 Նա արդարացի համարուեց սերնդից սերունդ՝ մինչեւ յաւիտենութիւն։ "},
	{32, "32 Նրան բարկացրին Հակառակութեան ջրերի մօտ, եւ Մովսէսը տանջուեց նրանց պատճառով, "},
	{33, "33 քանզի դառնացրել էին նրա հոգին։ Նա հրամայեց իր շրթունքներով, "},
	{34, "34 եւ չկոտորուեցին այն ազգերը, որոնց մասին ասել էր Տէրը։ "},
	{35, "35 Խառնուեցին հեթանոսների մէջ,ու սովորեցին գործերը նրանց։ "},
	{36, "36 Ծառայեցին նրանց կուռքերին, որոնք իրենց գայթակղութիւնը դարձան։ "},
	{37, "37 Իրենց որդիներին ու դուստրերին զոհեցին դեւերին, "},
	{38, "38 եւ անմեղ արիւն թափեցին՝ արիւնն իրենց որդիների ու դուստրերի, որ զոհեցին Քանանի կուռքերին։ "},
	{39, "39 Երկիրը շաղախուեց նրանց արեամբ,ու պղծուեց նրանց գործերից, քանզի պոռնկացան իրենց ընթացքով։ "},
	{40, "40 Սրտնեղած բարկացաւ Տէրն իր ժողովրդի վրայ,եւ խիստ զզուեց իր ժառանգութիւնից։ "},
	{41, "41 Նրանց մատնեց հեթանոսների ձեռքը, եւ իրենց ատողները տիրեցին նրանց։ "},
	{42, "42 Իրենց թշնամիները նեղեցին նրանց, եւ նրանք խեղճացան նրանց ձեռքի տակ։ "},
	{43, "43 Տէրը շատ անգամ փրկեց նրանց, բայց նրանք դառնացրին նրան իրենց չար խորհուրդներով,եւ ընկղմուեցին իրենց անօրէնութեան մէջ։ "},
	{44, "44 Տէրը նայեց նրանց նեղութեանը՝ լսելով ձայնը նրանց աղօթքի։ "},
	{45, "45 Յիշեց ուխտն իր,եւ իր առատ ողորմածութեամբ զղջաց։ "},
	{46, "46 Նրանց գթութեան արժանացրեց իրենց բոլոր գերեվարողների դիմաց։ "},
	{47, "47 Փրկի՛ր մեզ, Տէ՛ր Աստուած մեր, եւ հաւաքի՛ր մեզ հեթանոսների միջից։ Մենք գոհութիւն պիտի մատուցենք քո սուրբ անուանը եւ պիտի պարծենանք քո օրհնութիւններով։ "},
	{48, "48 Օրհնեալ է Տէր Աստուածն Իսրայէլի յաւիտեանս յաւիտենից. ողջ ժողովուրդը թող ասի՝ Թող լինի, թող լինի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view106() {
struct hy106 poems[] = {
	{1, "1 Գոհութի՛ւն մատուցեցէք Տիրոջը, քանզի քաղցր է նա, քանզի յաւերժ է ողորմութիւնը նրա։ "},
	{2, "2 Այսպէս թող ասեն Տիրոջից փրկուածները, որոնց նա ազատեց թշնամու ձեռքից։ "},
	{3, "3 Բոլոր գաւառներից հաւաքեց նրանց՝ արեւելքից եւ արեւմուտքից, հիւսիսից եւ ծովի կողմից։ "},
	{4, "4 Մոլորուեցին նրանք անապատում, անջրդի ճանապարհին, եւ բնակուելու քաղաք չգտան։ "},
	{5, "5 Քաղց զգացին ու ծարաւեցին, եւ նրանց հոգիները նուաղեցին իրենց ներսում։ "},
	{6, "6 Աղաղակեցին Տիրոջն իրենց նեղութեան մէջ, եւ նա փրկեց նրանց իրենց վշտերից։ "},
	{7, "7 Առաջնորդեց նրանց ուղիղ ճանապարհով, որ գնան քաղաքն իրենց բնակութեան։ "},
	{8, "8 Թող մարդկանց որդիները գոհութիւն մատուցեն Տիրոջընրա ողորմութիւնների եւ հրաշագործութիւնների համար, "},
	{9, "9 քանզի նա յագեցրեց քաղցած հոգիները,եւ բարութեամբ լիացրեց կարօտեալ անձանց, "},
	{10, "10 որոնք նստած էին խաւարում ու մահուան ստուերների մէջ՝գամուած աղքատութեանն ինչպէս երկաթին, "},
	{11, "11 քանի որ դառնացրին խօսքն Աստծու, եւ անարգեցին խորհուրդները Բարձրեալի։ "},
	{12, "12 Ցաւից սեղմուեցին սրտերը նրանց, տկարացան նրանք ու օգնող չունեցան։ "},
	{13, "13 Աղաղակեցին Տիրոջն իրենց նեղութեան մէջ, եւ նա ազատեց նրանց իրենց վշտերից։ "},
	{14, "14 Նրանց փրկեց խաւարից ու մահուան ստուերներիցեւ փշրեց շղթաները նրանց։ "},
	{15, "15 Թող մարդկանց որդիները գոհութիւն մատուցեն Տիրոջը նրա ողորմութիւնների եւ հրաշագործութիւնների համար, "},
	{16, "16 քանզի նա փշրեց դռները պղնձեայ եւ երկաթեայ նիգերը խորտակեց։ "},
	{17, "17 Օգնեց նրանց, երբ իրենց անօրէնութեան ճանապարհին էին, քանզի սաստիկ խեղճացել էին իրենց մեղքերից։ "},
	{18, "18 Ամէն տեսակ կերակուրից գարշեց սիրտը նրանց, եւ նրանք մօտեցան մահուան դռներին։ "},
	{19, "19 Աղաղակեցին Տիրոջն իրենց նեղութեան մէջ, եւ նա ազատեց նրանց իրենց վշտերից։ "},
	{20, "20 Առաքեց իր խօսքն ու բուժեց նրանց,եւ փրկեց նրանց իրենց ապականութիւնից։ "},
	{21, "21 Թող մարդկանց որդիները գոհութիւն մատուցեն Տիրոջը նրա ողորմութիւնների եւ հրաշագործութիւնների համար։ "},
	{22, "22 Թող նրան օրհնութեան պատարագ մատուցեն,եւ ցնծութեամբ նրա գործերը պատմեն։ "},
	{23, "23 Ովքեր ծով էին իջնում նաւերով եւ մեծ ջրերում գործեր կատարում, "},
	{24, "24 նրանք տեսան Տիրոջ արարքները եւ նրա հրաշագործութիւններն անդնդի խորքերում։ "},
	{25, "25 Հրամայեց՝ եւ հողմ ու մրրիկ ելաւ, եւ բարձրացան ալիքները նրա։ "},
	{26, "26 Մարդիկ բարձրացան երկինք ու անդունդ իջան, եւ նրանց հոգիները մաշուեցին իրենց ներսում, "},
	{27, "27 խռովուեցին նրանք, երերացին հարբածի պէս, եւ նրանց ողջ իմաստութիւնը կուլ գնաց։ "},
	{28, "28 Աղաղակեցին Տիրոջն իրենց նեղութեան մէջ, եւ նա փրկեց նրանց իրենց վշտերից։ "},
	{29, "29 Մրրիկը վերածեց խաղաղ օդի, եւ ալիքները դադարեցին։ "},
	{30, "30 Նրանք ուրախացան, որ ալիքները հանդարտուեցին, եւ Նա նրանց իրենց ուզած նաւահանգիստն առաջնորդեց։ "},
	{31, "31 Թող մարդկանց որդիները գոհութիւն մատուցեն Տիրոջը նրա ողորմութիւնների եւ հրաշագործութիւնների համար։ "},
	{32, "32 Թող պանծացնեն նրան ժողովուրդների հաւաքներում,եւ ծերերի ատեաններում օրհնեն նրան, "},
	{33, "33 քանզի գետերը ցամաքի վերածեց,եւ ջրերի ընթացքը՝ ծարաւած հողի։ "},
	{34, "34 Պտղաբեր երկիրն աղուտ դարձրեց՝ նրա բնակիչների չարութեան դիմաց։ "},
	{35, "35 Անապատը վերածեց ջրառատ վայրի, եւ ծարաւած հողը՝ հոսող ջրերի։ "},
	{36, "36 Այնտեղ բնակեցրեց քաղցեալներին, որոնք իրենց համար բնակութեան քաղաք շինեցին։ "},
	{37, "37 Վարեցին արտերը, այգիներ տնկեցին,եւ բերք աճեցրին իրենց համար։ "},
	{38, "38 Տէրն օրհնեց նրանց՝ ու խիստ բազմացան, եւ նրանց անասունները չպակասեցին։ "},
	{39, "39 Նուազեցին նրանք եւ տանջուեցին չարիքների նեղութիւնից ու վշտերից։ "},
	{40, "40 Անարգանք թափուեց նրանց իշխանների վրայ, Տէրը մոլորեցրեց նրանց ճանապարհազուրկ անապատներում։ "},
	{41, "41 Տնանկներին օգնեց աղքատութեան մէջ, ոչխարների պէս առաջնորդեց նրանց, որ ազգ դառնան։ "},
	{42, "42 Թող արդարները տեսնեն եւ ուրախանան, եւ բոլոր անօրէնները փակեն բերաններն իրենց։ "},
	{43, "43 Ո՞վ է իմաստունն այն, որ պիտի պահպանի սա,եւ հասկանայ ողորմութիւնը Տիրոջ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view107() {
struct hy107 poems[] = {
	{1, "1 Դաւթի օրհնութեան սաղմոսը "},
	{2, "2 Պատրաստ է սիրտն իմ, Աստուա՛ծ, պատրաստ է սիրտն իմ՝ օրհնելու եւ սաղմոսերգելու քեզ իմ փառաբանութեամբ։ "},
	{3, "3 Արթնացի՛ր փառք իմ, արթնացի՛ր սաղմոսով եւ օրհնութեամբ, եւ ես կ՚արթնանամ առաւօտեան։ "},
	{4, "4 Գոհութիւն կը մատուցեմ քեզ ժողովուրդների մէջ, Տէ՛ր, եւ ազգերի մէջ սաղմոս կ՚երգեմ քեզ։ "},
	{5, "5 Մեծ է քո ողորմութիւնը եւ երկնքից բարձր,եւ քո ճշմարտութիւնը հասնում է ամպերին։ "},
	{6, "6 Դու երկինք ես բարձրացած, Աստուա՛ծ, եւ ողջ աշխարհն է բռնել փառքը քո։ "},
	{7, "7 Որպէսզի սիրելիներդ փրկուեն, պահպանի՛ր քո աջով եւ լսի՛ր մեզ։ "},
	{8, "8 Աստուած խօսեց իր սրբարանից.Ես պիտի բարձրանամ, բաժանեմ Սիւքէմը եւ վրանների հովիտը պիտի չափեմ։ "},
	{9, "9 Իմն է Գաղաադն ու իմն է Մանասէն, Եփրեմն իմ գլխի սաղաւարտն է։ "},
	{10, "10 Յուդան թագաւորս է, Մովաբը՝ աւազանը յոյսիս։ Դէպի Եդոմէ պիտի ուղղեմ երթն իմ. եւ այլազգիներն ինձ հնազանդուեցին։ "},
	{11, "11 Ո՞վ ինձ կը տանի բերդաքաղաք, կամ ո՞վ ինձ կ՚առաջնորդի մինչեւ Եդոմէ, "},
	{12, "12 եթէ ոչ դու, Աստուա՛ծ, որ լքեցիր մեզեւ մեր զօրքերի հետ դուրս չելար, Աստուա՛ծ։ "},
	{13, "13 Նեղութեան մէջ օգնութի՛ւն տուր մեզ, քանզի ունայն է փրկութիւնը մարդու։ "},
	{14, "14 Աստուծով զօրութիւն կը ստեղծենք, եւ նա ամօթահար կ՚անի մեր թշնամիներին։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view108() {
struct hy108 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի "},
	{2, "2 Ո՜վ իմ օրհնութեան Աստուած, մի՛ լռիր,քանզի մեղաւորի բերանը՝ բերանը նենգաւորի, բացուեց ինձ վրայ։ Խօսեցին իմ մասին նենգամիտ լեզուով "},
	{3, "3 եւ ատելութեան խօսքերով պաշարեցին ինձ՝ յանիրաւի մարտնչելով իմ դէմ։ "},
	{4, "4 Սիրուս փոխարէն մեղադրեցին ինձ,բայց ես աղօթքի կանգնեցի։ "},
	{5, "5 Հատուցեցին ինձ չար՝ բարու փոխարէն,եւ իմ սիրոյ դիմաց՝ ատելութիւն։ "},
	{6, "6 Նրա դէմ մի չարագործ հանի՛ր, եւ սատանան թող կանգնի նրա աջ կողմում։ "},
	{7, "7 Իր դատաստանից թող նա յանցապարտ դուրս գայ, եւ նրա աղօթքը մեղք թող համարուի։ "},
	{8, "8 Թող նուազեն օրերը նրա, եւ նրա պաշտօնը թող ուրիշն առնի։ "},
	{9, "9 Նրա որդիները թող որբ դառնան, իսկ նրա կինն՝ այրի։ "},
	{10, "10 Նրա որդիները թող թափառական շրջեն ու մուրացիկ լինեն, եւ թող նրանք հեռանան իրենց բնակավայրից։ "},
	{11, "11 Պարտատէրը թող խուզարկի ողջ ունեցուածքը նրա, օտարները թող յափշտակեն վաստակը նրա։ "},
	{12, "12 Թող ոչ ոք աջակից չլինի նրան, եւ նրա որբերին ոչ ոք չգթայ։ "},
	{13, "13 Թող նրա որդիները կոտորուեն, եւ նրա անունը թող ջնջուի սերնդի միջից։ "},
	{14, "14 Թող Տիրոջ առջեւ յիշուեն նրա հօր մեղքերը, եւ նրա մօր մեղքերը չսրբուեն։ "},
	{15, "15 Թող նրանք ամէն ժամ Տիրոջ առջեւ լինեն, եւ նրանց յիշատակը թող վերանայ երկրից, "},
	{16, "16 քանզի նա ողորմութիւն անելը չյիշեց, հալածեց աղքատ ու տնանկ մարդուն, որ կործանի նրան, ով խոնարհ է սրտով։ "},
	{17, "17 Նա, որ անէծք սիրեց, թող այն իրեն դիպչի, նա, որ չուզեց օրհնութիւն, թող այն հեռու լինի նրանից։ "},
	{18, "18 Անէծքը, որ նա հագաւ ինչպէս հանդերձ, թող ջրի պէս լցուի նրա փորը,եւ ձէթի պէս՝ նրա ոսկորների մէջ։ "},
	{19, "19 Թող նրա համար հագնելու զգեստ լինի այն,եւ մէջքին կապելու մշտական գօտի։ "},
	{20, "20 Այս է վարձը նրանց, ովքեր բամբասում էին ինձ Տիրոջ առջեւ, եւ ովքեր չարախօսում էին իմ մասին։ "},
	{21, "21 Բայց դու, Տէ՛ր, Տէ՛ր, ինձ հետ վարուի՛ր ինչպէս վայել է անուանդ, քանզի քաղցր է ողորմութիւնը քո։ "},
	{22, "22 Եւ փրկի՛ր ինձ, քանզի աղքատ ու տնանկ եմ ես, եւ սիրտս խռովուած է իմ ներսում։ "},
	{23, "23 Ստուերի պէս երկարելով սպառուեցի,եւ թափ տրուեցի ինչպէս մարախ։ "},
	{24, "24 Ծնկներս թուլացան ծոմապահութիւնից, եւ գունաթափուեց մարմինս իւղի պակասից։ "},
	{25, "25 Ես նրանց նախատինքը դարձայ, տեսան ինձ ու շարժեցին գլուխներն իրենց։ "},
	{26, "26 Օգնի՛ր ինձ, Տէ՛ր Աստուած իմ, եւ փրկի՛ր ինձ քո ողորմութեամբ։ "},
	{27, "27 Թող իմանան, որ քո ձեռքն այս է, եւ որ, Տէ՛ր, դո՛ւ արեցիր այս։ "},
	{28, "28 Թող նրանք անիծեն, բայց դու օրհնի՛ր. ինձ վրայ յարձակուողները թող ամօթահար լինեն, բայց քո ծառան թող ուրախանայ քեզնով։ "},
	{29, "29 Իմ մասին չարախօսողները թող ամօթ հագնենեւ իրենց ամօթը թիկնոցի պէս կրեն իրենց վրայ։ "},
	{30, "30 Իսկ ես մեծ գոհութիւն պիտի մատուցեմ Տիրոջն իմ բերանով, բազմութիւնների մէջ պիտի օրհնեմ քեզ, "},
	{31, "31 քանզի նա կանգնեց տնանկիս աջ կողմը, որ փրկի ինձ նրանցից, ովքեր հալածում են ինձ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view109() {
struct hy109 poems[] = {
	{1, "1 Տէրն իմ Տիրոջն ասաց. Նստի՛ր իմ աջ կողմում, մինչեւ որ քո թշնամիներին ոտքերիդ պատուանդան դարձնեմ։ "},
	{2, "2 Տէրը քեզ իշխանութեան գաւազան կ՚ուղարկի Սիոնից, եւ դու կ՚իշխես քո թշնամիների մէջ։ "},
	{3, "3 Քեզնով է սկսւում զօրացումն իմ օրերի,քո սրբերի վայելչութեամբ. քեզ արշալոյսից առաջ ծնեցի արգանդից։ "},
	{4, "4 Երդուեց Տէրը եւ չի զղջայ, որ դու յաւիտենական քահանայ ես ըստ Մելքիսեդեկի կարգի։ "},
	{5, "5 Եւ Տէրը, որ քո աջ կողմում է, բարկութեան օրը կը կործանի թագաւորներին։ "},
	{6, "6 Կը դատի հեթանոսներին ու կը բազմացնի իր հարուածները,եւ շատերի գլուխը կը ջախջախի երկրի վրայ։ "},
	{7, "7 Ճանապարհին նա կը խմեցնի հեղեղատի ջրերից,եւ դրա համար էլ գլուխները վեր կը պահի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view110() {
struct hy110 poems[] = {
	{1, "1 Ամբողջ սրտովս քեզ պիտի գոհութիւն մատուցեմ, Տէ՛ր, արդարների ժողովում, հաւաքոյթի մէջ։ "},
	{2, "2 Մեծ են գործերը Տիրոջ, եւ քննուած է նրա կամքը ամէն ինչում։ "},
	{3, "3 Փառաւոր եւ վայելուչ են նրա գործերը, նրա արդարութիւնը կը տեւի յաւիտեանս յաւիտենից։ "},
	{4, "4 Արդարներին նա յիշեցրեց իր հրաշագործութիւնները. ողորմած եւ գթասիրտ է Տէրը։ "},
	{5, "5 Կերակուր է տալիս իրենից երկիւղ կրողերին, յաւիտեան յիշում իր ուխտը։ "},
	{6, "6 Իր գործերի զօրութիւնը յայտնեց նա իր ժողովրդին՝նրանց տալով ժառանգութիւնը հեթանոսների։ "},
	{7, "7 Նրա ձեռքի գործերն արդար են ու իրաւացի, նրա բոլոր պատուիրանները՝ վստահելի։ "},
	{8, "8 Հաստատուած են դրանք յաւիտեանս յաւիտենից, ստեղծուած ճշմարտութեամբ եւ արդարութեամբ։ "},
	{9, "9 Տէրը փրկութիւն ուղարկեց իր ժողովրդին, յաւիտեանս պատգամեց իր ուխտը. սուրբ եւ ահեղ է նրա անունը։ "},
	{10, "10 Զգօնութեան սկիզբն երկիւղն է Տիրոջ հանդէպ, բարեմիտ են բոլոր նրանք, որ գործադրում են այն. նրա օրհնութիւնը կը մնայ յաւիտեանս յաւիտենից։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view111() {
struct hy111 poems[] = {
	{1, "1 Երանի այն մարդուն, որ վախենում է Տիրոջից,եւ խիստ կամեցող է նրա պատուիրանների։ "},
	{2, "2 Նրա սերունդը հզօր կը լինի երկրի վրայ, եւ ուղղամիտների ազգը կ՚օրհնուի։ "},
	{3, "3 Փառք եւ հարստութիւն կը լինի նրա տան մէջ, նրա արդարութիւնը կը մնայ յաւիտեանս յաւիտենից։ "},
	{4, "4 Արդարների համար լոյս ծագեց խաւարում.ողորմած, գթասիրտ եւ արդար է Տէրը։ "},
	{5, "5 Բարի մարդը ողորմած է եւ փոխ է տալիս, խօսքն իր կատարում արդարութեամբ, "},
	{6, "6 որպէսզի յաւէտ նա չսասանուի, յաւիտեան մնայ յիշատակն արդարի։ "},
	{7, "7 Չար լուրից նա չի վախենայ, նրա սիրտը պատրաստ է յոյս դնելու Աստծու վրայ։ "},
	{8, "8 Հաստատուն է սիրտը նրա եւ չի սոսկայ, մինչեւ իր թշնամիների վերջը չտեսնի։ "},
	{9, "9 Բաժանեց նա ու տուեց աղքատներին. նրա արդարութիւնը կը մնայ յաւիտեանս յաւիտենից, եւ նրա եղջիւրը բարձր կը լինի փառքով։ "},
	{10, "10 Մեղաւորը, տեսնելով, կը բարկանայ, կը կրճտեցնի ատամներն իր ու հալումաշ կը լինի, եւ մեղաւորների ցանկութիւնը կը կորչի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view112() {
struct hy112 poems[] = {
	{1, "1 Օրհնեցէ՛ք Տիրոջը, երիտասարդնե՛ր, օրհնեցէ՛ք անունը Տիրոջ։ "},
	{2, "2 Թող Տիրոջ անունն օրհնեալ լինիայսուհետեւ մինչեւ յաւիտեան։ "},
	{3, "3 Արեւելքից մինչեւ արեւմուտք օրհնեալ լինի անունը Տիրոջ։ "},
	{4, "4 Բարձր է Տէրը բոլոր ազգերից վեր, եւ երկնքում է փառքը նրա։ "},
	{5, "5 Ո՞վ է նման մեր Տէր Աստծուն, որ բնակւում է բարձունքներում։ "},
	{6, "6 Նա տեսնում է հեզերին երկնքում ու երկրի վրայ։ "},
	{7, "7 Բարձրացնում է աղքատներին գետնից,եւ տառապեալներին վեր քաշում աղբանոցից։ "},
	{8, "8 Նրանց որպէս իշխան նստեցնում է իր ժողովրդի իշխանների կողքին։ "},
	{9, "9 Ամուլ կնոջը բնակեցնում է ցնծալից տան մէջ՝ իբրեւ մայր, որ հրճւում է զաւակներով։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view113() {
struct hy113 poems[] = {
	{1, "1 Երբ իսրայէլացիներն ելան Եգիպտոսից, Յակոբի տունը՝ օտար ժողովրդի միջից, "},
	{2, "2 Հրէաստանն եղաւ սրբարանը նրա, եւ Իսրայէլը՝ իշխանութիւնը նրա։ "},
	{3, "3 Ծովը տեսաւ ու փախաւ, եւ Յորդանան գետը ետ դարձաւ։ "},
	{4, "4 Լեռները ցնծացին խոյերի պէս, եւ բլուրները՝ ինչպէս մաքիների գառներ։ "},
	{5, "5 Ի՞նչ եղաւ քեզ, ծո՛վ, ո՞ւմ տեսար ու փախար, կամ դո՛ւ, գե՛տ Յորդանանի, ինչո՞ւ ետ դարձար։ "},
	{6, "6 Լեռնե՛ր, ցնծացիք ինչպէս խոյեր, եւ բլուրներ՝ ինչպէս մաքիների գառներ։ "},
	{7, "7 Երկիրը սասանուեց Տիրոջ դիմաց՝ Յակոբի Աստծու դիմաց, նրա՛ դիմաց, "},
	{8, "8 ով ժայռը դարձրեց ջրի վտակ, եւ ապառաժն՝ աղբիւրի ակունք։ "},
	{9, "9 Ոչ թէ մեզ, Տէ՛ր, ոչ թէ մեզ, այլ քո անուա՛նը փառք տուր քո ողորմութան եւ ճշմարտութեան համար։ "},
	{10, "10 Թող երբեք հեթանոսների մէջ չասեն, թէ՝ Նրանց Աստուածն ո՞ւր է։ "},
	{11, "11 Մեր Աստուածը երկնքում է եւ երկրի վրայ.ինչ որ նա ուզեց՝ արեց։ "},
	{12, "12 Հեթանոսների կուռքերը ոսկի եւ արծաթ են, ձեռքի գործն են մարդկանց որդիների։ "},
	{13, "13 Բերան ունեն՝ բայց չեն խօսում, աչքեր ունեն՝ բայց չեն տեսնում։ "},
	{14, "14 Ականջներ ունեն՝ բայց չեն լսում, քիթ ունեն՝ բայց չեն հոտոտում։ "},
	{15, "15 Ձեռքեր ունեն՝ բայց չեն շօշափում, ոտքեր ունեն՝ բայց չեն քայլում, եւ նրանց կոկորդում ձայն չկայ։ "},
	{16, "16 Նրանց նման կը լինեն դրանք ստեղծողները եւ բոլոր նրանք, որ իրենց յոյսը դնում են դրանց վրայ։ "},
	{17, "17 Իսրայէլի տունը յոյսը դրեց Տիրոջ վրայ,որը նրա օգնականն ու ապաւէնն է։ "},
	{18, "18 Ահարոնի տունը յոյսը դրեց Տիրոջ վրայ, որը նրա օգնականն ու ընկերակիցն է։ "},
	{19, "19 Տիրոջից երկիւղ կրողները յոյսը դրին Տիրոջ վրայ,որը նրանց օգնականն ու փրկիչն է։ "},
	{20, "20 Յիշեց մեզ Տէրն ու օրհնեց մեզ, Տէրն օրհնեց տունն Իսրայէլի, Տէրն օրհնեց տունն Ահարոնի։ "},
	{21, "21 Տէրն օրհնեց իրենից երկիւղ կրողներին՝ փոքրերին ու մեծերին։ "},
	{22, "22 Տէրը պիտի լիացնի ձեզ՝ ձեզ եւ ձեր որդիներին։ "},
	{23, "23 Օրհնուած էք դուք Տիրոջից, որ երկինքն ու երկիրն ստեղծեց։ "},
	{24, "24 Երկինքների երկինքը Տիրոջն է, բայց երկիրը նա տուեց մարդկանց որդիներին։ "},
	{25, "25 Մեռելները չէ, որ պիտի օրհնեն քեզ, ոչ էլ բոլոր նրանք, ովքեր դժոխք են իջնում, "},
	{26, "26 այլ ողջերս Տիրոջը պիտի օրհնենք՝ այսուհետեւ մինչեւ յաւիտեան։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view114() {
struct hy114 poems[] = {
	{1, "1 Հաճելի է ինձ, որ Տէրը լսեց ձայնն իմ աղօթքի։ "},
	{2, "2 Ականջն իր մօտեցրեց ինձ, եւ ես իմ օրերում նրա՛ն դիմեցի։ "},
	{3, "3 Ինձ պատեց երկունքը մահուան, եւ դժոխքի վշտերն ինձ բռնեցին։ Նեղութիւն եւ անձկութիւն գտայ "},
	{4, "4 եւ Տիրոջ անունը կանչեցի՝ ասելով.Ո՜վ Տէր, փրկի՛ր ինձ։ "},
	{5, "5 Գթառատ եւ արդար է մեր Տէր Աստուածը։ "},
	{6, "6 Տէրը ողորմում եւ պահպանում է մանուկներին. ես խոնարհ եղայ, եւ Տէրն ինձ փրկեց։ "},
	{7, "7 Դարձի՛ր, հոգի՛դ իմ, դէպի հանգիստը քո, քանզի Տէրն օգնեց քեզ։ "},
	{8, "8 Նա ինձ փրկեց մահուանից, աչքերս՝ արտասուքից եւ ոտքերս՝ սայթաքումից։ "},
	{9, "9 Թող ողջերի երկրում հաճելի լինեմ Տիրոջ առջեւ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view115() {
struct hy115 poems[] = {
	{1, "1 Ինչ որ խօսեցի՝ հաւատացի դրան,եւ չափազանց խղճալի եղայ։ "},
	{2, "2 Զարմանքիս մէջ ասացի. Ամէն մարդ սուտ է։ "},
	{3, "3 Ի՞նչ հատուցում պիտի անեմ Տիրոջն այն ամենի համար, որ ինձ տուեց։ "},
	{4, "4 Փրկութեան բաժակը պիտի վերցնեմ,եւ Տիրոջ անունը կանչեմ։ "},
	{5, "5 Աղօթքս Տիրոջը պիտի մատուցեմ իր ամբողջ ժողովրդի առջեւ։ "},
	{6, "6 Տիրոջ աչքում յարգելի է մահն իր սրբերի։ "},
	{7, "7 Ո՛վ Տէր, ես քո ծառան եմ, քո ծառան եւ քո աղախնի որդին։ "},
	{8, "8 Դու քանդեցիր իմ կապերը, ես քեզ օրհնութեան պատարագ պիտի մատուցեմ,եւ Տիրոջ անունը կանչեմ։ "},
	{9, "9 Աղօթքս Տիրոջը պիտի նուիրեմ իր ամբողջ ժողովրդի առջեւ, "},
	{10, "10 Տիրոջ տան սրահներումեւ քո մէջ, Երուսաղէ՛մ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view116() {
struct hy116 poems[] = {
	{1, "1 Օրհնեցէ՛ք Տիրոջը, բոլո՛ր ազգեր, գովեցէ՛ք նրան, բոլո՛ր ժողովուրդներ։ "},
	{2, "2 Թող նրա ողորմութիւնը հաստատուի մեզ վրայ, Տիրոջ ճշմարտութիւնը յաւիտեա՛ն թող մնայ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view117() {
struct hy117 poems[] = {
	{1, "1 Գոհութի՛ւն մատուցեցէք Տիրոջը, քանզի բարի է նա, քանզի յաւերժ է ողորմութիւնը նրա։ "},
	{2, "2 Տունն Իսրայէլի թող ասի, որ բարի է նա, որ յաւերժ է ողորմութիւնը նրա։ "},
	{3, "3 Տունն Ահարոնի թող ասի, որ բարի է նա, որ յաւերժ է ողորմութիւնը նրա։ "},
	{4, "4 Տիրոջից երկիւղ կրողները թող ասեն, որ բարի է նա,որ յաւերժ է ողորմութիւնը նրա։ "},
	{5, "5 Նեղութեան ժամանակ ես Տիրոջը կանչեցի, նա լսեց ինձ եւ հանդարտութեան առաջնորդեց։ "},
	{6, "6 Տէրն օգնականն է իմ, եւ ես չեմ երկնչի. մարդն ինձ ի՞նչ կարող է անել։ "},
	{7, "7 Տէրն օգնականն է իմ, եւ ես կը տեսնեմ վախճանն իմ թշնամիների։ "},
	{8, "8 Լաւ է յոյսը դնել Տիրոջ վրայ, քան յոյսը դնել մարդկանց վրայ։ "},
	{9, "9 Լաւ է յոյսը դնել Տիրոջ վրայ, քան յոյսը դնել իշխանների վրայ։ "},
	{10, "10 Բոլոր ազգերը շրջապատեցին ինձ, բայց Տիրոջ անուամբ յաղթեցի նրանց։ "},
	{11, "11 Շուրջբոլորս բռնեցին, միահամուռ պաշարեցին ինձ, բայց Տիրոջ անուամբ վանեցի նրանց։ "},
	{12, "12 Մեղուների պէս շուրջս լցուեցին, վառուեցին բորբոքուեցին ինչպէս հրաճարակ փուշ, բայց Տիրոջ անուամբ վանեցի նրանց։ "},
	{13, "13 Երբ ինձ հրեցին, ես սասանուեցի եւ մօտ էի գլորուելու, բայց Տէրը բռնեց ինձ։ "},
	{14, "14 Իմ զօրութիւնն ու օգնութիւնն է Տէրը, նա իմ փրկութիւնը եղաւ։ "},
	{15, "15 Ցնծութեան եւ փրկութեան ձայն կայ արդարների սրահներում։ "},
	{16, "16 Տիրոջ աջը զօրութիւն գործեց, Տիրոջ աջը բարձրացրեց ինձ,եւ Տիրոջ աջը զօրութիւն գործեց։ "},
	{17, "17 Չպիտի մեռնեմ, այլ պիտի ապրեմեւ Տիրոջ գործերը պիտի պատմեմ։ "},
	{18, "18 Տէրն ինձ խրատելով պատժեց, բայց չմատնեց մահուան։ "},
	{19, "19 Բացէ՛ք արդարութեան դռներն իմ առաջ, որ մտնեմ ներս ու Տիրոջը գոհութիւն մատուցեմ։ "},
	{20, "20 Տիրոջ դուռն է սա, եւ արդարները այս դռնո՛վ պիտի մտնեն։ "},
	{21, "21 Գոհութիւն պիտի մատուցեմ քեզ, Տէ՛ր, քանզի լսեցիր ինձ,եւ ինձ համար փրկութիւն եղար։ "},
	{22, "22 Քարն այն, որ շինարարներն արհամարհեցին,ա՛յն դարձաւ անկիւնաքար։ "},
	{23, "23 Տիրոջից եղաւ այս բանը, եւ սքանչելի է մեր աչքերին։ "},
	{24, "24 Սա է օրն այն, որ Տէրն ստեղծեց.եկէ՛ք ցնծանք եւ ուրախանանք այսօր։ "},
	{25, "25 Ո՛վ Տէր, փրկի՛ր, ո՛վ Տէր, առաջնորդի՛ր։ "},
	{26, "26 Օրհնեալ ես դու, որ պիտի գաս Տիրոջ անունով, մենք օրհնեցինք քեզ Տիրոջ տնից։ "},
	{27, "27 Մե՛ր Տէր Աստուածը երեւաց մեզ, կատարեցէ՛ք տօնն ուրախութեան մատղաշ ճիւղերով՝մուտքից մինչեւ անկիւնները սեղանի։ "},
	{28, "28 Դու իմ Աստուածն ես, պիտի գոհութիւն մատուցեմ քեզ, դու իմ Աստուածն ես, պիտի մեծարեմ քեզ։ Գոհութիւն պիտի մատուցեմ քեզ, Տէ՛ր, քանզի լսեցիր ինձ,եւ ինձ համար փրկութիւն եղար։ "},
	{29, "29 Գոհութիւն մատուցենք Տիրոջը, քանզի բարի է նա, քանզի յաւերժ է նրա ողորմութիւնը նրա։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view118() {
struct hy118 poems[] = {
	{1, "1 Երանի նրանց, ովքեր անբիծ ուղի են բռնել,եւ ընթանում են Տիրոջ օրէնքով։ "},
	{2, "2 Երանի նրանց, ովքեր հետեւում են նրա պատուիրաններին, իրենց ամբողջ սրտով փնտռում են նրան։ "},
	{3, "3 Անօրէնութիւն գործողները չեն, որ պիտի ընթանան նրա ճանապարհներով։ "},
	{4, "4 Դու հրամայեցիր, որ քո պատուիրանները խստօրէն պահեմ։ "},
	{5, "5 Իմ ճանապարհները յաջող կը լինեն, եթէ քո պատուիրանները պահեմ։ "},
	{6, "6 Այն ժամանակ ես չէի ամաչում՝երբ զգոյշ էի քո պատուիրանների հանդէպ։ "},
	{7, "7 Ես գոհութիւն պիտի մատուցեմ քեզ, Տէ՛ր, ուղիղ սրտով, սովորելով քո արդար դատաստանները։ "},
	{8, "8 Պահեցի ես քո օրէնքները, իսպառ մի՛ լքիր ինձ։ "},
	{9, "9 Երիտասարդն ի՞նչ միջոցով ուղղի ճանապարհն իր,եթէ ոչ քո խօսքերը պահելով։ "},
	{10, "10 Իմ ամբողջ սրտով քեզ փնտռեցի, մի՛ զրկիր ինձ քո պատուիրաններից։ "},
	{11, "11 Քո խօսքերը սրտումս թաքցրի, որ չմեղանչեմ քո դէմ։ "},
	{12, "12 Օրհնեալ ես դու, Տէ՛ր, սովորեցրո՛ւ ինձ քո օրէնքները, "},
	{13, "13 որ շրթունքներով իմ պատմեմ բերանիդ բոլոր դատաստանները։ "},
	{14, "14 Քո պատուիրանների ճանապարհին եմ գտնում ես իմ ուրախութիւնը,աւելի քան ամէն տեսակ հարստութեան մէջ։ "},
	{15, "15 Քո պատուիրանների մասին խորհեցի, հետեւեցի քո ճանապարհներին։ "},
	{16, "16 Քո օրէնքները կատարեցի եւ չմոռացայ խօսքերը քո։ "},
	{17, "17 Հատուցի՛ր քո ծառային, որ ապրեմ ու պահեմ խօսքերը քո։ "},
	{18, "18 Բա՛ց իմ աչքերը, որ տեսնեմ քո օրէնքի հրաշալիքները։ "},
	{19, "19 Պանդուխտ եմ ես երկրի երեսին, պատուիրաններդ մի՛ թաքցրու ինձնից։ "},
	{20, "20 Ես փափագեցի ամէն ժամ ցանկանալ քո դատաստանները։ "},
	{21, "21 Դու սաստեցիր ամբարտաւաններին. անիծեալ են նրանք, ովքեր խոտորուեցին քո պատուիրաններից։ "},
	{22, "22 Հեռացրո՛ւ ինձնից նախատինքն ու արհամարհանքը, քանզի ես նախանձախնդիր եղայ քո վկայութիւններին։ "},
	{23, "23 Թէեւ իշխանները նստած չարախօսում էին իմ մասին, բայց քո ծառան խորհում էր քո օրէնքների մասին։ "},
	{24, "24 Քո վկայութիւններն իմ խօսքերն էին, եւ քո արդարութիւնն՝ իմ խորհուրդը։ "},
	{25, "25 Հոգիս մերձեցաւ հողին. Տէ՛ր, ըստ քո խոստման՝ փրկի՛ր ինձ։ "},
	{26, "26 Իմ ճանապարհների մասին պատմեցի քեզ, ու դու ինձ լսեցիր.դատաստաններդ սովորեցրո՛ւ ինձ։ "},
	{27, "27 Ինձ ճանաչե՛լ տուր քո արդարութիւնների ճանապարհը, որ խորհեմ քո հրաշագործութիւնների մասին։ "},
	{28, "28 Հոգիս անքուն մնաց ձանձրոյթից, ըստ քո խոստման՝ ամրապնդի՛ր ինձ։ "},
	{29, "29 Մեղքի ճանապարհները հեռացրո՛ւ ինձնից,եւ քո օրէնքով ողորմի՛ր ինձ։ "},
	{30, "30 Քո ճշմարտութեան ճանապարհն ընտրեցի,եւ քո օրէնքները ես չմոռացայ։ "},
	{31, "31 Մերձեցայ քո պատուիրաններին. Տէ՛ր, մի՛ ամաչեցրու ինձ։ "},
	{32, "32 Քո պատուիրանների ճանապարհով ընթացայ, քանզի անդորրութիւն տուիր իմ սրտին։ "},
	{33, "33 Տէ՛ր, իրաւունքիդ ճանապարհի օրէնսգէտն ի՛նձ դարձրու, որ ամէն ժամ հետեւեմ դրան։ "},
	{34, "34 Իմաստո՛ւն դարձրու ինձ, որ քննեմ քո օրէնքը եւ ամբողջ սրտովս պահպանեմ այն։ "},
	{35, "35 Առաջնորդի՛ր ինձ քո պատուիրանների շաւիղներով, քանզի հաճելի են դրանք ինձ։ "},
	{36, "36 Սիրտս հակի՛ր դէպի քո պատուիրանները, եւ ոչ թէ դէպի ագահութիւն։ "},
	{37, "37 Շրջի՛ր աչքերս, որ ունայնութիւն չտեսնեմ, ինձ պահպանի՛ր քո ճանապարհին։ "},
	{38, "38 Քո ծառայի համար հաստատի՛ր քո խօսքը,որ քո երկիւղի մէջ մնամ։ "},
	{39, "39 Ազատի՛ր ինձ նախատինքներից, որոնցից կասկածում էի, քանզի քաղցր են դատաստանները քո։ "},
	{40, "40 Ահա ցանկացայ քո պատուիրանները, քո արդարութեամբ պահպանի՛ր ինձ։ "},
	{41, "41 Ողորմութիւնդ ինձ վրայ թող գայ, Տէ՛ր, եւ փրկութիւնդ՝ ըստ քո խոստման։ "},
	{42, "42 Ես խօսքով պատասխան կը տամ ինձ նախատողներին, քանզի յոյսս դրի քո խօսքերի վրայ։ "},
	{43, "43 Ճշմարտութեան խօսքը բնաւ մի՛ հեռացրու իմ բերանից, քանզի յոյսս դրի քո դատաստանների վրայ։ "},
	{44, "44 Քո օրէնքը պահեցի ամէն ժամ, յաւիտեան եւ յաւիտեանս յաւիտենից։ "},
	{45, "45 Ես ընթացայ անդորրութեան մէջ, քանզի քո պատուիրանները փնտռեցի։ "},
	{46, "46 Թագաւորների առաջ խօսեցի քո պատուիրանների մասին ու չամաչեցի։ "},
	{47, "47 Խորհեցի քո պատուիրանների մասին, որոնք սիրեցի։ "},
	{48, "48 Ձեռքս պարզեցի դէպի պատուիրանները քո, որոնք սիրեցի, եւ խորհեցի քո արդարութեան մասին։ "},
	{49, "49 Յիշի՛ր քո ծառային տրուած խօսքը, որի վրայ էլ դրիր իմ յոյսը։ "},
	{50, "50 Դա է թշուառութեանս մէջ ինձ մխիթարողը, քանզի քո խօսքն ինձ պահպանեց։ "},
	{51, "51 Ամբարտաւանները շատ անիրաւութիւն գործեցին իմ դէմ, բայց ես քո օրէնքից չխոտորուեցի։ "},
	{52, "52 Քո յաւերժական օրէնքները յիշեցի, Տէ՛ր, ու մխիթարուեցի։ "},
	{53, "53 Տրտմութիւն իջաւ ինձ վրայ մեղաւորների ու քո օրէնքը լքողների երեսից։ "},
	{54, "54 Պատուիրաններդ գովասանքի արժանի են ինձ համար իմ պանդխտավայրում։ "},
	{55, "55 Գիշերն յիշեցի քո անունը, Տէ՛ր, եւ քո օրէնքը պահեցի։ "},
	{56, "56 Դա՛ եղաւ կեանքիս ուղին, քանզի քո արդարութիւնը փնտռեցի։ "},
	{57, "57 Բաժինս դո՛ւ ես, Տէ՛ր, ասացի որ օրէնքիդ պիտի հետեւեմ։ "},
	{58, "58 Ամբողջ սրտովս աղօթեցի քո դիմաց, ողորմի՛ր ինձ ըստ քո խոստման։ "},
	{59, "59 Իմ ճանապարհի մասին խորհեցի,եւ քայլերս դէպի քո պատուիրանները շրջեցի։ "},
	{60, "60 Պատրաստուեցի եւ չվախեցայ պահել քո պատուիրանները։ "},
	{61, "61 Մեղքի ցանցերը պատեցին ինձ, բայց քո օրէնքը ես չմոռացայ։ "},
	{62, "62 Կէսգիշերին ելնում էի գոհութիւն մատուցելու քեզ քո արդար դատաստանների համար։ "},
	{63, "63 Հաղորդակցւում էի քեզնից երկիւղ կրող բոլոր մարդկանց հետ, ովքեր պահում են պատուիրանները քո։ "},
	{64, "64 Երկիրը լցուել է Տիրոջ ողորմութեամբ, սովորեցրո՛ւ ինձ արդարադատութիւնը քո։ "},
	{65, "65 Քաղցրութեամբ վարուեցիր ծառայիդ հետ, Տէ՛ր, քո խօսքի համաձայն։ "},
	{66, "66 Քաղցրութիւն, խրատ եւ գիտութիւն սովորեցրո՛ւ ինձ, քանզի հաւատացի քո պատուիրաններին։ "},
	{67, "67 Քանի դեռ չէի խեղճացել՝ մեղանչում էի, դրա համար խստօրէն հետեւեցի քո խօսքերին։ "},
	{68, "68 Քաղցր ես դու, Տէ՛ր, եւ քո քաղցրութեամբ քո արդարադատութիւնը սովորեցրո՛ւ ինձ։ "},
	{69, "69 Ամբարտաւանների անիրաւութիւններն իմ դէմ շատացան, բայց ես ամբողջ սրտովս քո պատուիրանները քննեցի։ "},
	{70, "70 Կաթի պէս թանձրացաւ սիրտը նրանց, բայց ես քո օրէնքներով խօսեցի։ "},
	{71, "71 Լաւ է, որ դու խոնարհ դարձրիր ինձ, որպէսզի քո արդարադատութիւնը սովորեմ։ "},
	{72, "72 Քո բերանից ելած օրէնքն ինձ համար աւելին է, քան հազարներով արծաթ ու ոսկի։ "},
	{73, "73 Քո ձեռքերն արարեցին ու ստեղծեցին ինձ, ինձ իմաստո՛ւն դարձրու, որ սովորեմ պատուիրանները քո։ "},
	{74, "74 Քեզնից երկիւղ կրողները պիտի տեսնեն ինձ եւ ուրախանան, քանզի յոյսս դրի քո խօսքերի վրայ։ "},
	{75, "75 Հասկացայ, Տէ՛ր, որ քո դատաստանն արդար է, եւ իրաւացիօրէն խոնարհ դարձրիր ինձ։ "},
	{76, "76 Ողորմութիւնդ թող ինձ մխիթարութիւն լինի՝ ծառայիդ տրուած խօսքիդ համաձայն։ "},
	{77, "77 Գթութիւններդ թող ինձ վրայ գան, որպէսզի փրկուեմ, քանզի քո օրէնքներն են իմ խօսքերը։ "},
	{78, "78 Ամբարտաւանները պիտի ամաչեն, որ իզուր անիրաւութիւն գործեցին իմ դէմ, իսկ ես քո պատուիրանների մասին պիտի խորհեմ։ "},
	{79, "79 Թող ինձ խրատեն քեզնից երկիւղ կրողները եւ քո վկայութիւնները ճանաչողները։ "},
	{80, "80 Թող սիրտս անբիծ լինի քո արդարութեան մէջ, որպէսզի չամաչեմ։ "},
	{81, "81 Հոգիս կարօտեց քո փրկութեանը, քանզի յոյսս դրի քո խօսքի վրայ։ "},
	{82, "82 Աչքերս սպասեցին քո խօսքին, ասացի՝ Ե՞րբ պիտի մխիթարես ինձ։ "},
	{83, "83 Եղայ ես ինչպէս տիկը սառնամանիքում, քանի որ քո արդարադատութիւնը չմոռացայ։ "},
	{84, "84 Որքա՞ն են քո ծառայի օրերը, ե՞րբ պիտի տեսնես դատաստանն ինձ հալածողների։ "},
	{85, "85 Անօրէններն ինձ խորհուրդներ տուին, բայց ոչ քո օրէնքի համեմատ։ "},
	{86, "86 Քո բոլոր պատուիրանները ճշմարիտ են, իզուր ինձ հալածեցին, օգնի՛ր ինձ։ "},
	{87, "87 Մի փոքր եւս՝ եւ նրանք կորստեան կը մատնէին ինձ երկրի երեսին, բայց ես չլքեցի քո պատուիրանները։ "},
	{88, "88 Քո ողորմութեամբ կեանք տուր ինձ, եւ ես կը պահպանեմ քո բերանի վկայութիւնները։ "},
	{89, "89 Քո խօսքը, Տէ՛ր, յաւիտեան երկնքում է։ "},
	{90, "90 Սերնդից սերունդ մնում է քո ճշմարտութիւնը, դու հաստատեցիր երկիրը, որ կայ։ "},
	{91, "91 Քո հրամանին է սպասում ցերեկը, քանզի բոլորը քո ծառաներն են։ "},
	{92, "92 Եթէ քո օրէնքն իմ խօսքը չլինէր, վաղուց ես կործանուած կը լինէի իմ թշուառութեան մէջ։ "},
	{93, "93 Յաւիտեան չպիտի մոռանամ քո արդարութիւնները, քանզի դրանցո՛վ ինձ պահպանեցիր։ "},
	{94, "94 Քոնն եմ ես՝ փրկի՛ր ինձ, քանզի արդարադատութիւնդ փնտռեցի։ "},
	{95, "95 Մեղաւորները հետամտեցին, որ կործանեն ինձ, քանզի մտքումս քո վկայութիւնները դրի։ "},
	{96, "96 Ամէն կատարելութեան վախճանը տեսայ, քո պատուիրանները խիստ ընդարձակ էին ինձ համար։ "},
	{97, "97 Որքա՜ն սիրեցի օրէնքները քո, նրանք գիշեր-ցերեկ իմ խոհերն էին։ "},
	{98, "98 Թշնամիներիցս աւելի խելացի դարձրիր ինձ քո պատուիրաններով, քանզի նրանք իմն էին միշտ։ "},
	{99, "99 Բոլոր ուսուցիչներիցս աւելի իմաստուն եղայ, քանզի քո վկայութիւններն իմ խոհերն էին։ "},
	{100, "100 Ծերունիներից աւելի իմաստուն դարձայ, քանզի քո պատուիրանները քննեցի։ "},
	{101, "101 Ոտքերս ետ պահեցի չարիքի բոլոր ճանապարհներից, որպէսզի պահեմ քո խօսքերը։ "},
	{102, "102 Քո իրաւունքից չխոտորուեցի, քանզի դու ինձ օրէնսգէտ դարձրիր։ "},
	{103, "103 Որքա՜ն քաղցր են քո խօսքերն իմ քիմքին՝ աւելի քաղցր, քան մեղրն իմ բերանին։ "},
	{104, "104 Քո պատուիրաններով իմաստնանալով՝ ատեցի չարիքի բոլոր ճանապարհները, քանզի դու ինձ օրէնսգէտ դարձրիր։ "},
	{105, "105 Քո խօսքը ճրագ է իմ ոտքերի համար, եւ լուսաւորում է իմ շաւիղները։ "},
	{106, "106 Երդուեցի ու որոշեցի, որ պիտի պահեմ քո բոլոր արդար դատաստանները։ "},
	{107, "107 Սաստիկ թշուառ եղայ. Տէ՛ր, կեա՛նք տուր ինձ ըստ քո խոստման։ "},
	{108, "108 Բարեհաճի՛ր ընդունել ընծան իմ բերանի, Տէ՛ր, եւ քո իրաւունքն ինձ սովորեցրո՛ւ։ "},
	{109, "109 Հոգիս ամէն ժամ քո ձեռքում է, եւ ես քո օրէնքը չմոռացայ։ "},
	{110, "110 Մեղաւորները որոգայթ լարեցին իմ դէմ, ես քո պատուիրաններից չխոտորուեցի։ "},
	{111, "111 Յաւիտեան ժառանգեցի քո վկայութիւնները, քանզի նրանք իմ սրտի ցնծութիւնն են։ "},
	{112, "112 Սիրտս առյաւէտ խոնարհեցրի, որ հատուցման համար քո օրէնքները կատարեմ։ "},
	{113, "113 Ատեցի անօրէններին,եւ քո օրէնքը սիրեցի։ "},
	{114, "114 Օգնականն ու փրկիչն իմ դու ես, եւ ես յոյսս դրի քո խօսքի վրայ։ "},
	{115, "115 Հեռացէ՛ք ինձնից, չարագործնե՛ր, որ ես իմ Աստծու պատուիրանները քննեմ։ "},
	{116, "116 Օգնի՛ր ինձ ըստ քո խօսքի ու պահպանի՛ր ինձ, եւ իմ յոյսի մէջ ինձ մի՛ ամաչեցրու։ "},
	{117, "117 Օգնի՛ր ու փրկի՛իր ինձ, որ շարունակ քո դատաստանի մասին մտածեմ։ "},
	{118, "118 Անարգեցիր բոլոր նրանց, ովքեր ընդվզեցին քո արդարադատութեան դէմ, քանզի անիրաւ էին նրանց խորհուրդները։ "},
	{119, "119 Յանցաւոր համարեցի աշխարհի բոլոր մեղսագործներին, դրա համար սիրեցի պատուիրանները քո։ "},
	{120, "120 Մարմինն իմ գամի՛ր քո երկիւղին, քանզի սաստիկ վախեցայ քո դատաստաններից։ "},
	{121, "121 Դատաստան եւ արդարութիւն գործեցի, ինձ մի՛ մատնիր ինձ նեղողների ձեռքը։ "},
	{122, "122 Ծառայիդ բարութեա՛մբ ընդունիր, որ ամբարտաւանները չչարչարեն ինձ։ "},
	{123, "123 Աչքերն իմ սպասեցին քո շնորհելիք փրկութեանը, Տէ՛ր,եւ քո արդարութեան խօսքին։ "},
	{124, "124 Ծառայիդ հետ վարուի՛ր քո ողորմութեան համեմատ, քո արդարադատութիւնն ինձ սովորեցրո՛ւ։ "},
	{125, "125 Ես քո ծառան եմ, ինձ իմաստո՛ւն դարձրու, որ ճանաչեմ քո վկայութիւնները։ "},
	{126, "126 Ժամն է, որ Տէրը վեր կենայ,քանզի խափանեցին քո օրէնքը։ "},
	{127, "127 Յիրաւի, սիրեցի քո պատուիրաններըոսկուց ու տպազիոնից աւելի։ "},
	{128, "128 Քո բոլոր պատուիրաններն ինձ յաջողութիւն բերին, քանզի ատեցի ճանապարհը չարիքի։ "},
	{129, "129 Սքանչելի են քո վկայութիւնները, դրա համար հոգիս սիրեց դրանք։ "},
	{130, "130 Քո խօսքերի յայտնութիւնը լուսաւորում եւ իմաստնացնում է պարզամիտներին։ "},
	{131, "131 Բերանս բացեցի ու շունչ առայ, հոգիս փափագեց պատուիրանները քո։ "},
	{132, "132 Նայիր ի՛նձ եւ ողորմի՛ր ինձ քո անունը սիրողների իրաւունքի համեմատ։ "},
	{133, "133 Ճանապարհն իմ ուղղի՛ր քո խօսքի համաձայն, որ զանազան մեղքեր չտիրեն ինձ։ "},
	{134, "134 Փրկի՛ր ինձ մարդկանց զրպարտութիւնից, եւ ես քո պատուիրանները կը պահեմ։ "},
	{135, "135 Երեսդ ցո՛յց տուր քո ծառային,եւ քո արդարադատութիւնը սովորեցրո՛ւ ինձ։ "},
	{136, "136 Ջրերի վտակներ իջան իմ աչքերից, քանզի մարդիկ չհետեւեցին քո օրէնքներին։ "},
	{137, "137 Արդար ես դու, Տէ՛ր, եւ շիտակ են քո դատաստանները։ "},
	{138, "138 Դու պատուիրեցիր քո վկայութիւնները, որոնք արդարեւ շատ ճշմարիտ են։ "},
	{139, "139 Նախանձախնդրութիւնը քո հանդէպ մաշեց ինձ, քանզի թշնամիներն իմ մոռացան խօսքերը քո։ "},
	{140, "140 Խիստ ընտիր են խօսքերը քո, եւ քո ծառան սիրեց դրանք։ "},
	{141, "141 Մանուկ եմ ես եւ արհամարհուած, բայց քո արդարութիւնը չմոռացայ։ "},
	{142, "142 Քո արդարութիւնը յաւերժական արդարութիւն է, եւ քո օրէնքը՝ ճշմարիտ։ "},
	{143, "143 Նեղութիւնն ու վիշտն ինձ պատեցին, բայց քո պատուիրաններն իմ խօսքերն եղան։ "},
	{144, "144 Քո վկայութիւններն արդար են յաւիտեան, իմաստո՛ւն դարձրու եւ պահպանի՛ր ինձ։ "},
	{145, "145 Ամբողջ սրտովս քեզ ձայն տուի, լսի՛ր ինձ, Տէ՛ր, քանզի քո արդարութիւնը փնտռեցի։ "},
	{146, "146 Աղաղակեցի քո առջեւ՝ փրկի՛ր ինձ, եւ ես քո վկայութիւնները կը պահեմ։ "},
	{147, "147 Ես վաղ առաւօտեան արթնացայ ու աղաղակեցիեւ իմ յոյսը դրի քո խօսքերի վրայ։ "},
	{148, "148 Առաւօտից շուտ բացուեցին աչքերն իմ, որ քո խօսքերն արտասանեմ։ "},
	{149, "149 Լսի՛ր իմ ձայնը, Տէ՛ր, ըստ քո ողորմութեան. Տէ՛ր, քո դատաստանով փրկի՛ր ինձ։ "},
	{150, "150 Հալածիչներս անօրէնութիւնը մօտեցրին ինձ, քանզի նրանք հեռու եղան քո օրէնքից։ "},
	{151, "151 Մօտ ես դու, Տէ՛ր, եւ քո բոլոր պատուիրանները ճշմարիտ են։ "},
	{152, "152 Սկզբից եւեթ ճանաչեցի քո վկայութիւնները, որոնք դու յաւիտեա՛ն հաստատեցիր։ "},
	{153, "153 Տե՛ս իմ թշուառութիւնը եւ փրկի՛ր ինձ, քանզի քո օրէնքը ես չմոռացայ։ "},
	{154, "154 Տե՛ս իմ դատաստանը եւ ազատի՛ր ինձ,ու քո խօսքի համաձայն պահպանի՛ր ինձ։ "},
	{155, "155 Փրկութիւնը հեռու է մեղաւորներից, քանզի նրանք քո օրէնքները չպահեցին։ "},
	{156, "156 Քո գթութիւնները շատ են, Տէ՛ր, եւ քո դատաստանի համաձայն պահպանի՛ր ինձ։ "},
	{157, "157 Բազմաթիւ եղան իմ հալածիչներն ու ինձ նեղողները, բայց քո վկայութիւններից ես չխոտորուեցի։ "},
	{158, "158 Մաշւում էի նայելով անողորմներին, քանզի քո պատուիրանները չպահեցին նրանք։ "},
	{159, "159 Տե՛ս, թէ որքա՜ն սիրեցի քո պատուիրանները.Տէ՛ր, քո ողորմութեամբ կեա՛նք տուր ինձ։ "},
	{160, "160 Քո խօսքի սկիզբը ճշմարտութիւնն է, յաւերժ են քո բոլոր արդար դատաստանները։ "},
	{161, "161 Իշխաններն իզուր հալածեցին ինձ.սիրտս միայն քո խօսքերից սարսափեց։ "},
	{162, "162 Ես ցնծացի քո խօսքերով ինչպէս մէկը, որ մեծ աւար է գտնում։ "},
	{163, "163 Ատեցի ու արհամարհեցի մեղքը, եւ քո օրէնքը սիրեցի։ "},
	{164, "164 Օրուայ մէջ եօթն անգամ քեզ պիտի օրհնեմ քո արդար դատաստանի համար։ "},
	{165, "165 Քո օրէնքը սիրողները մեծ խաղաղութեան մէջ են, եւ նրանց համար չկայ գայթակղութիւն։ "},
	{166, "166 Սպասեցի քո փրկութեանը, Տէ՛ր, եւ քո պատուիրանները սիրեցի։ "},
	{167, "167 Հոգիս պահեց քո վկայութիւնները, եւ ես շատ սիրեցի դրանք։ "},
	{168, "168 Հետեւեցի քո պատուիրաններին եւ վկայութիւններին, քանզի իմ բոլոր ուղիներն առջեւդ են։ "},
	{169, "169 Իմ խնդրանքները թող մօտենան քեզ, Տէ՛ր, քո խօսքի համաձայն իմաստո՛ւն դարձրու ինձ։ "},
	{170, "170 Իմ աղօթքը թող հասնի քեզ, Տէ՛ր, եւ քո խօսքով փրկի՛ր ինձ։ "},
	{171, "171 Իմ շրթունքները քեզ օրհնութիւն կը բխեցնեն, երբ ինձ սովորեցնես քո արդարադատութիւնը։ "},
	{172, "172 Իմ լեզուն քո խօսքերը կ՚արտասանի, քանզի քո բոլոր պատուիրաններն արդար են։ "},
	{173, "173 Քո ձեռքն իմ պահապանը թող լինի, քանզի քո պատուիրաններն ընտրեցի։ "},
	{174, "174 Քո շնորհելիք փրկութիւնը ցանկացայ, Տէ՛ր, եւ քո օրէնքներն իմ խօսքերն եղան։ "},
	{175, "175 Թող ես ապրեմ,որ օրհնեմ քեզ, եւ քո արդարադատութիւնն ինձ թող օգնի։ "},
	{176, "176 Մոլորուեցի կորուսեալ ոչխարի պէս, փնտռի՛ր ծառայիդ, քանզի պատուիրաններդ չեմ մոռացել։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view119() {
struct hy119 poems[] = {
	{1, "1 Օրհներգութիւններ բարձունքի աստիճանների վրայ "},
	{2, "2 Նեղութեանս մէջ ես Տիրոջը ձայն տուի, եւ նա լսեց ինձ։ "},
	{3, "3 Տէ՛ր, փրկի՛ր ինձ նենգ շրթունքներից ու չար լեզուից։ "},
	{4, "4 Ի՞նչ պիտի տրուի քեզ, կամ ի՞նչ պիտի աւելանայ, նե՛նգ լեզու. - "},
	{5, "5 դրանք հսկայի նետեր են, որոնք կայծակներով մխւում են կաղնու մէջ։ "},
	{6, "6 Վա՜յ ինձ, քանզի երկար տեւեց պանդխտութիւնն իմ, ես բնակուեցի Կեդարի վրաններում։ "},
	{7, "7 Շատ ժամանակ հոգիս բնակուեց նրանց հետ, ովքեր ատում են խաղաղութիւնը։ "},
	{8, "8 Ես խաղաղասէր էի. երբ խօսում էի, նրանք մարտնչում էին իմ դէմ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view120() {
struct hy120 poems[] = {
	{1, "1 Օրհներգութիւններ Բարձունքի աստիճանների վրայ "},
	{2, "2 Աչքերս դէպի լեռները բարձրացրի, որտեղից ինձ օգնութիւն պիտի գայ։ "},
	{3, "3 Ինձ օգնութիւն պիտի գայ Տիրոջից, որ ստեղծեց երկինքն ու երկիրը։ "},
	{4, "4 Թող քո ոտքը չսասանուի, եւ քո Պահապանը թող չննջի, "},
	{5, "5 ինչպէս չի ննջում եւ քուն չի մտնում Պահապանն Իսրայէլի։ "},
	{6, "6 Տէրը քեզ կը պահպանի, Տէրը քեզ կ՚ընդունի իր աջ ձեռքով։ "},
	{7, "7 Ցերեկն արեգակը քեզ չի վնասի, ոչ էլ լուսինը՝ գիշեր ժամանակ։ "},
	{8, "8 Տէրը քեզ կը պահպանի ամէն չարիքից, Տէրը կը պահպանի քեզ։ "},
	{9, "9 Տէրը կը հսկի քո մուտքն ու ելքը՝ այսուհետեւ մինչեւ յաւիտեան։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view121() {
struct hy121 poems[] = {
	{1, "1 Օրհներգութիւններ Բարձունքի աստիճանների վրայ "},
	{2, "2 Ուրախանում էի, երբ ասում էին՝ Գնանք Տիրոջ տուն։ "},
	{3, "3 Մեր ոտքերը հասել կանգնել էին քո դռներին, ո՛վ Երուսաղէմ։ "},
	{4, "4 Երուսաղէմը բարեշէն է որպէս քաղաք, եւ նրա բնակիչներն իր շուրջն են։ "},
	{5, "5 Ցեղերն այնտեղ բարձրացան՝ ցեղերը Տիրոջ, որ Իսրայէլի վկայութեամբ գոհութիւն մատուցեն Տիրոջ անուանը։ "},
	{6, "6 Այնտեղ են դրուած դատաստանի աթոռները՝ աթոռներ դրուած Դաւթի տան մէջ։ "},
	{7, "7 Հարցրէ՛ք Երուսաղէմի խաղաղութեան ու շէնութեան մասին, դուք՝ բոլորդ, որ սիրում էք այն։ "},
	{8, "8 Քո ամրութիւններում թող խաղաղութիւն լինի, եւ քո բերդերի աշտարակներում՝ շէնութիւն։ "},
	{9, "9 Ի սէր իմ եղբայրների եւ ընկերների քեզ խաղաղութիւն մաղթեցի։ "},
	{10, "10 Եւ մեր Տէր Աստծու համար քեզ բարութիւն ցանկացանք։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view122() {
struct hy122 poems[] = {
	{1, "1 Օրհներգութիւններ Բարձունքի աստիճանների վրայ "},
	{2, "2 Աչքերս դէպի քեզ բարձրացրի, Տէ՛ր, դու, որ բնակւում ես երկնքում։ "},
	{3, "3 Ինչպէս ծառաների աչքերն իրենց տէրերի ձեռքին, ինչպէս աղախնի աչքերն իր տիրուհու ձեռքին, այնպէս էլ մեր աչքերն ուղղուած են քեզ, Տէ՛ր Աստուած մեր, մինչեւ որ գթաս մեզ։ "},
	{4, "4 Գթա՛ մեզ, Տէ՛ր, գթա՛ մեզ, քանզի բազում արհամարհանքներ կրեցինք։ "},
	{5, "5 Մեր հոգիներն անչափ լցուեցին մեզ անպատուողների նախատինքներով եւ ամբարտաւանների անարգանքով։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view123() {
struct hy123 poems[] = {
	{1, "1 Օրհներգութիւններ Բարձունքի աստիճանների վրայ "},
	{2, "2 Եթէ Տէրը մեզ հետ չլինէր, - թող ասի Իսրայէլը, - "},
	{3, "3 եթէ Տէրը մեզ հետ չլինէր, մարդիկ մեզ վրայ յարձակուելով՝ "},
	{4, "4 մեզ ողջ-ողջ կուլ կը տային, երբ նրանց զայրոյթը բորբոքուած էր մեզ վրայ։ "},
	{5, "5 Եւ ջրերն անգամ մեզ կ՚ընկղմէին, երբ մեր հոգիներն անցան հեղեղի միջով։ "},
	{6, "6 Մեր հոգիներն անցան անհանգիստ ջրերի միջով։ "},
	{7, "7 Օրհնեալ է Տէրը, որ մեզ նրանց ատամների որսը չդարձրեց։ "},
	{8, "8 Մեր հոգիները փրկուեցին ինչպէս ճնճղուկը որսորդի թակարդից։ Նրանց թակարդները փշրուեցին, եւ մենք ազատուեցինք։ "},
	{9, "9 Մեր օգնութիւնը Տիրոջ անունից է, նա, որ երկինքն ու երկիրն ստեղծեց։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view124() {
struct hy124 poems[] = {
	{1, "1 Օրհներգութիւններ Բարձունքի աստիճանների վրայ "},
	{2, "2 Ով յոյսը դրել է Տիրոջ վրայ, յաւիտեան չի սասանուի ինչպէս լեռը Սիոնի, որ գտնւում է Երուսաղէմում։ "},
	{3, "3 Ինչպէս որ նա շրջապատուած է լեռներով, այնպէս Տէրն իր ժողովրդի շուրջն է՝ այսուհետեւ մինչեւ յաւիտեան։ "},
	{4, "4 Տէրը չի թողնի, որ մեղաւորների գաւազանն որոշի արդարների վիճակը, եւ արդարներն իրենց ձեռքերը պիտի չերկարեն անօրէնութեան։ "},
	{5, "5 Տէրը բարիք է գործում բարիներին եւ նրանց, որ ուղիղ են սրտով։ "},
	{6, "6 Իսկ յափշտակութեամբ համակուածներին Տէրը կը կործանի նրանց հետ, ովքեր անօրէնութիւն են գործում։ Խաղաղութիւն Իսրայէլին։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view125() {
struct hy125 poems[] = {
	{1, "1 Օրհներգութիւններ Բարձունքի աստիճանների վրայ "},
	{2, "2 Երբ Տէրը Սիոնը վերադարձրեց գերութիւնից, մենք մխիթարուեցինք։ "},
	{3, "3 Այնժամ մեր բերանները խնդութեամբ լցուեցին եւ մեր լեզուները՝ ցնծութեամբ։ Այնժամ հեթանոսների մէջ ասացին. Տէրը մեծ բաներ գործեց սրանց համար։ "},
	{4, "4 Մեծ բաներ գործեց Տէրը մեզ համար, եւ մենք ցնծացինք։ "},
	{5, "5 Տէ՛ր, ե՛տ դարձրու մեզ գերութիւնից՝ հարաւի հեղեղների պէս։ "},
	{6, "6 Ովքեր ցանում էին արտասուքով, ցնծութեամբ պիտի հնձեն։ "},
	{7, "7 Ովքեր շալակած տանում էին սերմերն իրենց ու լաց լինում գնալիս, յետ պիտի գան ցնծալով եւ բարձած պիտի բերեն խրձերն իրենց։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view126() {
struct hy126 poems[] = {
	{1, "1 Օրհներգութիւններ Բարձունքի աստիճանների վրայ "},
	{2, "2 Եթէ Տէրը տունը չշինի, իզուր են չարչարւում այն շինողները, եթէ Տէրը քաղաքը չպահպանի, իզուր են հսկում պահապանները նրա։ "},
	{3, "3 Իզուր էք վաղ արթնանում. արդ, վե՛ր կացէք՝ քանի դեռ չէք ննջել։Դուք տառապանքի հացն էք ուտում, մինչ Նա քուն է տալիս իր սիրելիներին։ "},
	{4, "4 Տիրոջ ժառանգութիւնը նրա որդիներն են,որոնք նրա վարձն են, պտուղը նրա որովայնի։ "},
	{5, "5 Ինչպէս նետերը հզօրի ձեռքում, այնպէս են որդիներն անկեալների։ "},
	{6, "6 Երանի՜ նրան, ով իր ուզածի չափ կ՚առնի այդ նետերից. երբ դարպասի մօտ իր թշնամիների հետ խօսելու լինի,նա ամօթով չի մնայ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view127() {
struct hy127 poems[] = {
	{1, "1 Օրհներգութիւններ Բարձունքի աստիճանների վրայ "},
	{2, "2 Երանի՜ բոլոր նրանց, ովքեր վախենում են Տիրոջիցեւ ընթանում նրա ճանապարհներով։ "},
	{3, "3 Դու քո ձեռքի վաստակը պիտի ուտես. երանի՜ քեզ, դա լաւ պիտի լինի քեզ համար։ "},
	{4, "4 Կինդ պիտի լինի վայելուչ որթատունկի պէս քո տան անկիւնում, որդիներդ՝ նորատունկ ձիթենու պէս քո սեղանի շուրջը։ "},
	{5, "5 Ահա այսպէ՛ս պիտի օրհնուի ամէն մարդ, որ վախենում է Տիրոջից։ "},
	{6, "6 Քեզ պիտի օրհնի Տէրը Սիոնիցկեանքիդ բոլոր օրերին դու պիտի տեսնես բարութիւնը Երուսաղէմի։ "},
	{7, "7 Դու պիտի տեսնես քո որդիների որդիներին։ Խաղաղութի՜ւն Իսրայէլին։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view128() {
struct hy128 poems[] = {
	{1, "1 Օրհներգութիւններ Բարձունքի աստիճանների վրայ "},
	{2, "2 Մանկութիւնիցս ի վեր բազում անգամ մարտնչեցին իմ դէմ, - թող Իսրայէլն ասի այդ, - "},
	{3, "3 մանկութիւնիցս ի վեր բազում անգամ մարտնչեցին իմ դէմ, բայց չյաղթեցին ինձ։ "},
	{4, "4 Մեղաւորներն հարուածեցին իմ թիկունքին, երկար ժամանակ գործեցին անօրէնութիւնն իրենց։ "},
	{5, "5 Տէրն արդար է, մեղաւորների պարանոցը նա կը խորտակի։ "},
	{6, "6 Ամօթահար կը լինեն ու ետ կը դառնան բոլոր նրանք, ովքեր ատում են Սիոնը։ "},
	{7, "7 Նրանք կը լինեն տանիքի խոտի պէս, որ չորանում է դեռ չհնձած։ "},
	{8, "8 Դրանով հնձուորն իր բուռը չի լցնի, ոչ էլ խուրձ կապողն՝ իր գիրկը։ "},
	{9, "9 Նրանց կողքից անցնողները չեն ասի՝ Տիրոջ օրհնութիւնը ձեզ վրայ լինի, եւ օրհնեալ լինէք Տիրոջ անունով։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view129() {
struct hy129 poems[] = {
	{1, "1 Օրհներգութիւններ Բարձունքի աստիճանների վրայԽորութիւններից քեզ կանչեցի, Տէ՛ր։ "},
	{2, "2 Տէ՛ր, լսի՛ր իմ ձայնը, թող քո ականջները լսեն ձայնն իմ աղօթքի։ "},
	{3, "3 Եթէ անօրէնութիւններս քննես, Տէ՛ր,ո՞վ կարող է կանգնել քո առջեւ, Տէ՛ր, "},
	{4, "4 քանզի քեզնից է գալիս քաւութիւնը։ "},
	{5, "5 Քո անուան համար համբերեցի, Տէ՛ր, հոգիս սպասեց քո խօսքին։ "},
	{6, "6 Հոգիս յոյսը դրեց Տիրոջ վրայ։ Առաւօտեան պահից մինչեւ երեկոյ, առաւօտեան պահից Իսրայէլը յոյսը դրեց Տիրոջ վրայ։ "},
	{7, "7 Տիրոջից է ողորմութիւնը, ու նրանից են բոլոր փրկութիւնները։ "},
	{8, "8 Եւ նա պիտի փրկի Իսրայէլն իր բոլոր նեղութիւններից։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view130() {
struct hy130 poems[] = {
	{1, "1 Տէ՛ր, սիրտս չգոռոզացաւ, եւ աչքերս վերեւից չնայեցին. ես մեծամեծների հետ ոտք չդրի, ոչ էլ նրանց հետ, ովքեր բարձր են ինձնից. "},
	{2, "2 այլ խոնարհ եղայ մօր կրծքից կտրուած մանկան նման, որի փափագը նոյն բանին դառնալն է. իսկ եթէ հպարտացրի իմ հոգին, այդպէս թող լինի հատուցումն անձիս։ "},
	{3, "3 Իսրայէլը յոյսը դրեց Տիրոջ վրայ՝ այսուհետեւ մինչեւ յաւիտեան։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view131() {
struct hy131 poems[] = {
	{1, "1 Տէ՛ր, յիշի՛ր Դաւթին եւ նրա ամբողջ հեզութիւնը, "},
	{2, "2 թէ ինչպէս նա երդուեց Տիրոջը,եւ ուխտ արեց Յակոբի Աստծուն՝ ասելով. "},
	{3, "3 Չեմ մտնի իմ տան յարկից ներս, չեմ մտնի իմ անկողինը, "},
	{4, "4 իմ աչքերին քուն չեմ տայ, կամ նինջ՝ իմ թարթիչներին, եւ կամ հանգիստ՝ իմ մարմնին, "},
	{5, "5 մինչեւ Յակոբի Տէր Աստծու համար խորանի տեղ չգտնեմ։ "},
	{6, "6 Ահա, խորանի մասին լսեցինք Եփրաթայում,եւ այն գտանք մայրիների դաշտերում։ "},
	{7, "7 Մտնենք կացարանը նրա, երկրպագենք այն տեղին, ուր կանգնած են ոտքերը նրա։ "},
	{8, "8 Ելի՛ր քո հանգստավայրը, Տէ՛ր, դու եւ տապանակը քո սուրբ Կտակի։ "},
	{9, "9 Քո երէցները թող արդարութիւն հագնեն, եւ քո սրբերը խնդութեամբ ցնծան։ "},
	{10, "10 Յանուն քո սիրելի Դաւթի, մի՛ շրջիր երեսդ քո օծեալից։ "},
	{11, "11 Տէրը ճշմարտութեամբ երդուեց Դաւթին ու չստեց նրան. Քո որովայնի պտղից պիտի նստեցնեմ քո գահին։ "},
	{12, "12 Եթէ որդիներդ պահեն իմ օրէնքն ու իմ վկայութիւնները, որոնք նրանց պիտի սովորեցնեմ, ապա որդիները նրանց յաւիտեանս յաւիտենից կը նստեն քո գահին։ "},
	{13, "13 Տէրը սիրեց Սիոնըեւ նախընտրեց բնակուել այնտեղ։ "},
	{14, "14 Ասաց. Այս է հանգստավայրն իմ յաւիտեանս յաւիտենից, այստեղ պիտի բնակուեմ, քանզի հաւանեցի սա։ "},
	{15, "15 Սրա բերքը պիտի շարունակ օրհնեմ,եւ սրա աղքատներին կշտացնեմ հացով։ "},
	{16, "16 Սրա երէցներին փրկութիւն պիտի հագցնեմ, եւ սրա սրբերը խնդութեամբ պիտի ցնծան։ "},
	{17, "17 Այնտեղ պիտի Դաւթին եղջիւրներ ծլեցնեմ, իմ օծեալի համար ճրագ պատրաստեմ։ "},
	{18, "18 Նրա թշնամիներին ամօթ պիտի հագցնեմ, իսկ նրա վրայ պիտի ծաղկի սրբութիւնն իմ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view132() {
struct hy132 poems[] = {
	{1, "1 Որքա՜ն բարի, որքա՜ն վայելուչ է, որ եղբայրները բնակւում են միասին, "},
	{2, "2 ինչպէս ազնիւ իւղ, որ իջնում է Ահարոնի գլխին ու մօրուքին,եւ մօրուքից սահում դէպի նրա զգեստի քղանցքները, "},
	{3, "3 ինչպէս ցօղ, որ Հերմոնից ցօղւում է Սիոն լերան վրայ։ Այնտեղ պատրաստեց Տէրն օրհնութիւնն ու կեանքը յաւիտենական։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view133() {
struct hy133 poems[] = {
	{1, "1 Այստեղ օրհնեցէ՛ք Տիրոջը, Տիրոջ բոլո՛ր ծառաներ, որ գտնւում էք Տիրոջ տանը եւ մեր Աստծու գաւիթներում։ "},
	{2, "2 Գիշերը դէպի սրբութի՛ւն պարզեցէք ձեռքերը ձեր,եւ օրհնեցէ՛ք Տիրոջը։ "},
	{3, "3 Թող Տէրն օրհնի մեզ Սիոնից, Նա, որ երկինքն ու երկիրը ստեղծեց։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view134() {
struct hy134 poems[] = {
	{1, "1 Օրհնեցէ՛ք Տիրոջ անունը, օրհնեցէ՛ք Տիրոջը, Տիրո՛ջ ծառաներ, "},
	{2, "2 որ գտնւում էք Տիրոջ տանը, մեր Աստծու տան գաւիթներում։ "},
	{3, "3 Օրհնեցէ՛ք Տիրոջը, քանզի բարի է Տէրը. սաղմո՛ս երգեցէք նրա անուանը, քանզի քաղցր է նա։ "},
	{4, "4 Տէրն իր ընտրեալը դարձրեց Յակոբին, եւ Իսրայէլը՝ ժառանգութիւնն իր։ "},
	{5, "5 Ես հասկացայ, որ մեծ է Տէրը, եւ Տէրը մեծ է բոլոր կուռքերից։ "},
	{6, "6 Տէրն ինչ որ ցանկացաւ, կատարեց երկնքում ու երկրի վրայ, ծովում եւ բոլոր անդունդներում։ "},
	{7, "7 Ամպեր հանելով երկրի ծայրերից՝ իր կայծակներն անձրեւի վերածեց, եւ իր պահեստներից հողմեր դուրս բերեց։ "},
	{8, "8 Նա հարուածեց եգիպտացիների բոլոր անդրանիկ ծնունդներին,ինչպէս մարդկանց, այնպէս էլ անասուններին։ "},
	{9, "9 Իր նշաններն ու զարմանահրաշ գործերն ուղարկեց քեզ, ո՛վ Եգիպտոս, քո Փարաւոնին եւ նրա ամբողջ զօրքին։ "},
	{10, "10 Նա հարուածեց բազում ազգերի,եւ սպանեց հզօր թագաւորների. "},
	{11, "11 ամորհացիների թագաւոր Սեհոնին, Բասանի թագաւոր Օգինու բոլոր թագաւորութիւնները Քանանի։ "},
	{12, "12 Նրանց երկիրը որպէս ժառանգութիւն տուեց,որպէս ժառանգութիւն Իսրայէլի իր ժողովրդին։ "},
	{13, "13 Տէ՛ր, քո անունը յաւերժ է, Տէ՛ր, քո յիշատակը՝ սերնդից սերունդ։ "},
	{14, "14 Տէրը դատում է իր ժողովրդին,եւ մխիթարւում իր ծառաներով։ "},
	{15, "15 Հեթանոսների կուռքերը ոսկի ու արծաթ են, ձեռքի գործն են մարդկանց որդիների։ "},
	{16, "16 Բերան ունեն, բայց չեն խօսում, աչքեր ունեն, բայց չեն տեսնում։ "},
	{17, "17 Ականջներ ունեն, բայց չեն լսում, եւ նրանց բերանում շունչ չկայ։ "},
	{18, "18 Նրանց նման կը լինեն դրանք ստեղծողները եւ բոլոր նրանք, որ յոյսը դրել են նրանց վրայ։ "},
	{19, "19 Օրհնի՛ր Տիրոջը, տո՛ւն Իսրայէլի, օրհնի՛ր Տիրոջը, տո՛ւն Ահարոնի։ "},
	{20, "20 Օրհնի՛ր Տիրոջը, տո՛ւն Ղեւիի. Տիրոջից երկի՛ւղ կրողներ, օրհնեցէ՛ք Տիրոջը։ "},
	{21, "21 Օրհնութի՜ւն Տիրոջը Սիոնից, Նրան, որ բնակւում է Երուսաղէմում։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view135() {
struct hy135 poems[] = {
	{1, "1 Գոհութի՛ւն մատուցեցէք Տիրոջը, քանզի բարի է նա, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{2, "2 Գոհութի՛ւն մատուցեցէք աստուածների Աստծուն, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{3, "3 Գոհութի՛ւն մատուցեցէք տէրերի Տիրոջը, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{4, "4 Միայնակ նա մեծ հրաշագործութիւններ արեց, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{5, "5 Երկինքն ստեղծեց իր իմաստութեամբ, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{6, "6 Երկիրը հաստատեց ջրերի վրայ, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{7, "7 Միայնակ ստեղծեց լուսատուները մեծ, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{8, "8 Արեգակը կարգեց ցերեկուայ տիրակալ, քանզի յաւերժ է նրա ողորմութիւնը, "},
	{9, "9 լուսինն ու աստղերը՝ գիշերուայ տիրակալ, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{10, "10 Կործանեց եգիպտացիների երկիրն իր անդրանիկ ծնունդներով հանդերձ, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{11, "11 Իսրայէլացիներին հանեց Եգիպտոսից, քանզի յաւերժ է նրա ողորմութիւնը, "},
	{12, "12 արեց այդ՝ բարձր ձեռքով եւ իր հզօր բազկով, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{13, "13 Պատռեց մեծ ծովն ու բաժանեց երկու մասի, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{14, "14 Իսրայէլացիներին անցկացրեց ծովի միջով, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{15, "15 Փարաւոնին իր զօրքով ընկղմեց Կարմիր ծովում, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{16, "16 Իր ժողովրդին հանեց դէպի անապատ, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{17, "17 Հարուածեց մեծամեծ ազգերի, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{18, "18 Սպանեց հզօր թագաւորների, քանզի յաւերժ է նրա ողորմութիւնը. "},
	{19, "19 սպանեց ամորհացիների թագաւոր Սեհոնին, քանզի յաւերժ է նրա ողորմութիւնը, "},
	{20, "20 Բասանի թագաւոր Օգին, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{21, "21 Նրանց երկիրը որպէս ժառանգութիւն տուեց, քանզի յաւերժ է նրա ողորմութիւնը, "},
	{22, "22 տուեց որպէս ժառանգութիւն Իսրայէլին՝ իր ծառային, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{23, "23 Տէրը մեզ յիշեց մեր թշուառութեան մէջ, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{24, "24 Նա փրկեց մեզ մեր թշնամիների ձեռքից, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{25, "25 Նա կերակուր է տալիս բոլոր ապրող էակներին, քանզի յաւերժ է նրա ողորմութիւնը։ "},
	{26, "26 Գոհութի՛ւն մատուցեցէք երկնաւոր Աստծուն, քանզի յաւերժ է նրա ողորմութիւնը։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view136() {
struct hy136 poems[] = {
	{1, "1 Բաբելոնի գետերի մօտ՝ այնտեղ նստած լալիս էինք, երբ յիշում էինք Սիոնը։ "},
	{2, "2 Նրանց ուռիներից էինք կախել մեր կտակարանները։ "},
	{3, "3 Այնտեղ մեզ գերեվարողները օրհնութեան խօսք էին պահանջում մեզնից, մեզ տարագրողներն ստիպում էին՝ ասելով. Երգեցէ՛ք մեզ համար Սիոնի օրհներգերից։ "},
	{4, "4 Իսկ մենք ինչպէ՞ս երգենք Տիրոջ օրհներգերը օտար երկրում։ "},
	{5, "5 Եթէ մոռանամ քեզ, Երուսաղէ՛մ, թող իմ աջը մոռանայ ինձ։ "},
	{6, "6 Թող լեզուս քիմքիս կպչի, թէ քեզ չյիշեմ, եթէ իմ ուրախութեան սկզբում նախ քե՛զ, Երուսաղէ՛մ, չգովաբանեմ։ "},
	{7, "7 Յիշի՛ր, Տէ՛ր, թէ ինչ էին ասում եդոմացիները Երուսաղէմի օրերին. Քանդեցէ՛ք, քանդեցէ՛ք, հիմնայատա՛կ արէք։ "},
	{8, "8 Ո՛վ Բաբելոնի թշուառ դուստր, երանի՜ նրան, ով քեզ պիտի հատուցի այնպէս, ինչպէս դու մեզ հատուցեցի՛ր։ "},
	{9, "9 Երանի՜ նրան, ով կը բռնի քո մանուկներին ու կը խփի քարին։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view137() {
struct hy137 poems[] = {
	{1, "1 Գոհութիւն պիտի մատուցեմ քեզ, Տէ՛ր, իմ ամբողջ սրտով, հրեշտակների առջեւ սաղմոս պիտի երգեմ քեզ, քանզի լսեցիր խօսքը բերանիս։ "},
	{2, "2 Պիտի երկրպագեմ սուրբ տաճարիդեւ անուանդ գոհութիւն պիտի մատուցեմ քո ողորմութեան ու ճշմարտութեան համար, քանզի ամէն ինչում մեծ ցոյց տուիր սուրբ անունդ։ "},
	{3, "3 Որ օրը որ քեզ ձայն տամ,իսկոյն լսի՛ր ինձ, եւ բազմապատկի՛ր զօրութիւններն հոգուս մէջ։ "},
	{4, "4 Գոհութիւն պիտի մատուցեն քեզ աշխարհի բոլոր թագաւորները, քանզի լսեցին բերանիդ խօսքերը։ "},
	{5, "5 Նրանք պիտի փառաբանեն քո ճանապարհները, քանզի մեծ է փառքը Տիրոջ։ "},
	{6, "6 Բարձր է Տէրը, նա տեսնում է խոնարհներին, իսկ բարձրամիտներին հեռուից ճանաչում։ "},
	{7, "7 Երբ անցնեմ նեղութիւնների միջով, դու կը փրկես ինձ թշնամու զայրոյթից։ Ձեռքդ կը մեկնես, եւ քո աջը կը փրկի ինձ։ "},
	{8, "8 Տէրը կը հատուցի իմ փոխարէն. Տէ՛ր, քո ողորմութիւնը յաւերժ է, ձեռքիդ գործերը մի՛ անտեսիր։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view138() {
struct hy138 poems[] = {
	{1, "1 Տէ՛ր, ինձ փորձեցիր ու ճանաչեցիր ինձ։ "},
	{2, "2 Դու իմացար իմ նիստուկացը, հեռուից հասկացար իմ մտածումները։ "},
	{3, "3 Իմ շաւիղներն ու վիճակը դու քննեցիր,եւ բոլոր ճանապարհներս նախապէս տեսար։ "},
	{4, "4 Իմացար, որ լեզուիս տակ նենգութիւն չկայ։ "},
	{5, "5 Ահա դու, Տէ՛ր, իմացար իմ սկիզբն ու վերջը, դու ինձ ստեղծեցիր եւ ձեռքդ դրիր ինձ վրայ։ "},
	{6, "6 Զարմանալի է քո իմացութիւնն իմ մասին, այնքան զօրեղ, որ չեմ կարող հասու լինել դրան։ "},
	{7, "7 Ո՞ւր գնամ ես քո հոգուց, կամ քո դէմքից ո՞ւր փախչեմ։ "},
	{8, "8 Եթէ երկինք ելնեմ, այնտեղ ես դու, եթէ դժոխք իջնեմ, դրան էլ մօտ ես։ "},
	{9, "9 Եթէ առաւօտեան թեւեր առնեմ ու բնակուեմ ծովի եզերքին, "},
	{10, "10 այնտեղ էլ քո ձեռքն ինձ կ՚առաջնորդի, եւ աջդ ինձ կ՚ընդունի։ "},
	{11, "11 Ասացի՝ գուցէ խաւարն ինձ ծածկի, կամ գիշերը պատի ինձիմ վայելքի լոյսի փոխարէն։ "},
	{12, "12 Խաւարը քեզ համար խաւար չի լինի, եւ գիշերը լուսաւոր ցերեկ կը դառնայ, ու նրա մթութիւնն ինչպէս լոյս կ՚երեւայ։ "},
	{13, "13 Դո՛ւ ստեղծեցիր երիկամներն իմ,եւ մօրս որովայնից ինձ ընդունեցիր։ "},
	{14, "14 Գոհութիւն պիտի մատուցեմ քեզ, Տէ՛ր, քանզի ահեղ ու սքանչելի ես դու, սքանչելի են գործերը քո, որոնք ես շատ սիրեցի։ "},
	{15, "15 Չծածկուեց քեզնից իմ ոսկորը, որն ստեղծեցիր դու թաքուն,ոչ էլ ծածկուեց կարողութիւնն իմ երկրի խորքերում։ "},
	{16, "16 Իմ անկատարութիւնները տեսան քո աչքերը, եւ այդ բոլորը գրուեցին քո գրքում։ Ցերեկը դրանք մոլորուեցին, ու չկար մէկը, որ առաջնորդէր դրանք։ "},
	{17, "17 Ինձ համար խիստ պատուական եղան քո բարեկամներն, Աստուա՛ծ, եւ շատ զօրացան նրանց իշխանները։ "},
	{18, "18 Հաշուեցի նրանց, եւ աւազից շատ դուրս եկան. արթնացայ՝ եւ ահա քեզ հետ եմ։ "},
	{19, "19 Դու, Աստուա՛ծ, պիտի սպանես մեղաւորներին. արիւնարբո՛ւ մարդիկ, հեռացէ՛ք ինձնից։ "},
	{20, "20 Հակառակութեամբ ու նախանձով նրանք իզուր պիտի տիրեն քո քաղաքներին։ "},
	{21, "21 Քեզ ատողներին ատեցի, Տէ՛ր, եւ քո թշնամիների պատճառով մաշուեցի։ "},
	{22, "22 Կատարեալ ատելութեամբ ատեցի նրանց, եւ նրանք թշնամի դարձան ինձ։ "},
	{23, "23 Փորձի՛ր ինձ, Աստուա՛ծ,ու ճանաչի՛ր իմ սիրտը, քննի՛ր ինձ ու ճանաչի՛ր իմ շաւիղները, "},
	{24, "24 եւ տե՛ս, եթէ իմ ճանապարհին անօրէնութիւններ կան, առաջնորդի՛ր ինձ քո յաւիտենական ճանապարհներով։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view139() {
struct hy139 poems[] = {
	{1, "1 Այսուհետեւ՝ սաղմոս Դաւթի "},
	{2, "2 Ազատի՛ր ինձ, Տէ՛ր, չար մարդուց, անիրաւ մարդուց փրկի՛ր ինձ։ "},
	{3, "3 Իրենց սրտում նրանք անօրէնութիւն խորհեցին,եւ գիշեր-ցերեկ պատերազմի պատրաստուեցին։ "},
	{4, "4 Օձի պէս սրեցին լեզուներն իրենց, եւ նրանց շրթների տակ թոյն կայ իժի։ "},
	{5, "5 Պահպանի՛ր ինձ, Տէ՛ր, մեղաւորի ձեռքից, եւ չար մարդուց փրկի՛ր ինձ. նրանք խորհեցին խափանել ընթացքն իմ։ "},
	{6, "6 Ամբարտաւաններն իրենց որոգայթը թաքցրին ինձնից, թակարդի լարեր ձգեցին ոտքերիս առջեւ,եւ իմ շաւղի շուրջը գայթակղութիւններ դրին։ "},
	{7, "7 Ասացի. Դու իմ Տէր Աստուածն ես, ակա՛նջ դիր, Տէ՛ր, աղօթքիս ձայնին։ "},
	{8, "8 Տէ՛ր, Տէ՛ր, իմ փրկութեան զօրութի՛ւն, գլխիս հովանի՛ն պատերազմի մէջ։ "},
	{9, "9 Մի՛ մատնիր ինձ, Տէ՛ր, մեղաւորների կամքին, որոնք նենգամտեցին իմ դէմ։ Ինձ երեսի վրայ մի՛ թող, որ նրանք երբեք չբարձրանան, եւ նրանց մտադրութիւնները չկատարուեն։ "},
	{10, "10 Թող նրանց կատարածի վախճանն այս լինի. իրենց շրթունքների վաստակը թող ծածկի նրանց։ "},
	{11, "11 Դու նրանց վրայ կրակի կայծեր թափի՛ր ու կործանի՛ր նրանց, որ տառապանքներից չկարողանան փրկուել։ "},
	{12, "12 Չարալեզու մարդը յաջողութիւն չի ունենայ երկրի վրայ. մեղաւոր մարդուն իր չարագործութիւնները կորստեան կը մատնեն։ "},
	{13, "13 Գիտեմ, Տէ՛ր, որ դու աղքատին արդար դատաստան ես անում եւ տնանկի իրաւունքն ես պաշտպանում։ "},
	{14, "14 Արդարները գոհութիւն պիտի մատուցեն քո անուանը, ուղղամիտները պիտի բնակուեն քո դիմաց։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view140() {
struct hy140 poems[] = {
	{1, "1 Տէր, ձայն տուի քեզ, լսի՛ր ինձ եւ ո՛ւշ դարձրու աղօթքիս ձայնին, երբ քեզ եմ կանչում։ "},
	{2, "2 Տէ՛ր, թող աղօթքս քեզ ուղղուի որպէս խունկ, ձեռքերիս կարկառումն՝ իբրեւ երեկոյեան պատարագ։ "},
	{3, "3 Պահապա՛ն դիր, Տէ՛ր, իմ բերանին,եւ ամուր դուռ՝ իմ շրթներին, "},
	{4, "4 որ սիրտս չհակուի չարութեան խօսքին՝ մեղքի պատճառ դառնալով անօրէնութիւն գործող մարդկանց նման. ես նրանց հաճելի բաներին չեմ հաղորդակցուի։ "},
	{5, "5 Թող արդարը խրատի ինձ ողորմութեամբ ու յանդիմանի,բայց մեղաւորի իւղը թող գլուխս չօծի, աղօթքս պիտի հակադրեմ նրա կամքին։ "},
	{6, "6 Նրանց դատաւորները կուլ գնացին ժայռի մօտ,թող լսեն խօսքերն իմ, որ քաղցր են. "},
	{7, "7 Ինչպէս թանձր հողը, որ սփռուած է երկրի վրայ, այնպէս պիտի ցրուեն նրանց ոսկորները դժոխքի մօտերքում։ "},
	{8, "8 Տէ՛ր, Տէ՛ր, քեզ են ուղղուած աչքերն իմ, յոյսս դրի քեզ վրայ, մի՛ հանիր ինձնից իմ հոգին։ "},
	{9, "9 Պահպանի՛ր ինձ իմ դէմ լարուած թակարդից եւ անօրէնութիւն գործողների գայթակղութիւնից։ Թող մեղաւորները նրա ցանցերն ընկնեն, եւ միայն ես անցնեմ գնամ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view141() {
struct hy141 poems[] = {
	{1, "1 Դաւթի իմաստութիւնը. աղօթք, երբ նա քարայրում էր "},
	{2, "2 Իմ ձայնով ես Տիրոջը կանչեցի, իմ ձայնով Տիրոջն աղաչեցի։ "},
	{3, "3 Տիրոջ դիմաց պիտի սփռեմ աղօթքն իմեւ նրա առջեւ նեղութիւնս պիտի պատմեմ։ "},
	{4, "4 Երբ շունչս պակասեց իմ ներսում, դու, Տէ՛ր, իմացար շաւիղներն իմ. այն ճանապարհին, որով գնում էի, ծածուկ որոգայթ լարուեց իմ դէմ։ "},
	{5, "5 Նայում էի աջ ու տեսնում, որ ոչ ոք ինձ չի ճանաչում. փախչելն ինձ համար անհնար դարձաւ, եւ չկար մէկը, որ փնտռէր ինձ։ "},
	{6, "6 Քե՛զ կանչեցի, Տէ՛ր, ու ասացի. Դու ես իմ յոյսը եւ իմ բաժինը ողջերի երկրում։ "},
	{7, "7 Ո՛ւշ դարձրու, Տէ՛ր, իմ աղօթքին, քանզի ես թաղուած եմ թշուառութեան մէջ. ազատի՛ր ինձ իմ հալածիչներից, քանզի նրանք ինձանից հզօր եղան։ "},
	{8, "8 Տէ՛ր, բանտից հանի՛ր ինձ, որ գոհութիւն մատուցեմ քո անուանը։ Արդարները պիտի սպասեն, մինչեւ որ հատուցման արժանացնես ինձ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view142() {
struct hy142 poems[] = {
	{1, "1 Տէ՛ր, լսի՛ր աղօթքն իմ, քո ճշմարտութեամբ ակա՛նջ դիր իմ խնդրանքին, քո արդարութեամբ լսի՛ր ինձ։ "},
	{2, "2 Ծառայիդ հետ դատաստան մի՛ տես, քանզի ոչ մի կենդանի մարդ չի արդարանայ քո առջեւ։ "},
	{3, "3 Թշնամին հալածեց ինձ, կեանքս հողին հաւասարեցրեցեւ ինձ նստեցրեց խաւարի մէջ յաւիտեան մեռածի պէս։ "},
	{4, "4 Հոգիս տաղտկացաւ իմ ներսում, եւ սիրտս խռովուեց իմ մէջ։ "},
	{5, "5 Յիշեցի օրերն առաջուայ, մտաբերեցի բոլոր գործերը քո, ձեռքերիդ ստեղծածների մասին խորհեցի։ "},
	{6, "6 Դէպի քեզ կարկառեցի ձեռքերն իմ. հոգիս հողի պէս ծարաւի է քեզ։ "},
	{7, "7 Լսի՛ր ինձ փութով, Տէ՛ր, քանզի շունչս պակասեց իմ ներսում, մի՛ շրջիր երեսդ ինձնից, որ չնմանուեմ գերեզման իջնողներին։ "},
	{8, "8 Առաւօտեան քո ողորմութիւնն ինձ լսելի՛ դարձրու, քանզի, Տէ՛ր, յոյսս քեզ վրայ դրի. ցո՛յց տուր ինձ ճանապարհն այն, որով պիտի գնամ, քանզի դէպի քեզ, Տէ՛ր, բարձրացրի հոգիս։ "},
	{9, "9 Իմ թշնամիներից փրկի՛ր ինձ, Տէ՛ր, քանզի քեզ իմ ապաւէնը դարձրի։ "},
	{10, "10 Սովորեցրո՛ւ ինձ կատարել կամքը քո, քանզի դու ես Աստուածն իմ, քո բարի հոգին ինձ պիտի առաջնորդի դէպի արդար երկիր։ "},
	{11, "11 Յանուն քո անուան, կեա՛նք տուր ինձ, Տէ՛ր, քո արդարութեամբ նեղութիւնից հանի՛ր հոգին իմ։ "},
	{12, "12 Քո ողորմութեամբ կործանի՛ր իմ թշնամիներին, կորստեա՛ն մատնիր բոլոր ինձ նեղողներին, քանզի ես ծառան եմ քո։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view143() {
struct hy143 poems[] = {
	{1, "1 Օրհնեալ է Տէր Աստուածն իմ, որ ձեռքս վարժեցրեց պատերազմիեւ մատներս՝ ճակատամարտի։ "},
	{2, "2 Նա ողորմութիւնն ու ապաւէնն է իմ, օգնականը, փրկիչն ու պահպանիչն իմ։ Ես յոյսս դրել եմ նրա վրայ.նա է, որ ժողովուրդներին հնազանդեցնում է ինձ։ "},
	{3, "3 Տէ՛ր, մարդն ի՞նչ է, որ յայտնուեցիր նրան, կամ մարդու որդին՝ որ բանի տեղ ես դնում նրան։ "},
	{4, "4 Մարդը նման է ունայնութեան, եւ նրա օրերն անցնում են ստուերի պէս։ "},
	{5, "5 Տէ՛ր, ցածրացրո՛ւ երկինքն ու իջի՛ր, մօտեցի՛ր լեռներին՝ եւ թող ծխեն դրանք։ "},
	{6, "6 Արձակի՛ր կայծակները քո եւ խռովի՛ր նրանց,առաքի՛ր նետերը քո եւ ցրի՛ր նրանց։ "},
	{7, "7 Ձեռքդ մեկնի՛ր վերից ու փրկի՛ր ինձ յորդացող ջրերից եւ օտարների որդիների ձեռքից, "},
	{8, "8 որոնց բերաններն ունայնութիւն են խօսում, եւ որոնց աջը մեղսագործ աջ է։ "},
	{9, "9 Աստուա՛ծ, քե՛զ նոր օրհներգով պիտի օրհնեմ, տասնալար նուագարանով սաղմոս պիտի երգեմ քեզ։ "},
	{10, "10 Նա ազատութիւն պիտի տայ մեր թագաւորներին, եւ չար սրից պիտի փրկի իր Դաւիթ ծառային։ "},
	{11, "11 Փրկի՛ր եւ ազատի՛ր ինձ օտարների որդիների ձեռքից, որոնց բերաններն ունայնութիւն են խօսում, եւ որոնց աջը մեղսագործ աջ է։ "},
	{12, "12 Նրանց որդիները նոր տունկի պէս հաստատուած են իրենց մանկութիւնից, նրանց դուստրերը զարդարուած ու պճնուած են ինչպէս տաճար։ "},
	{13, "13 Նրանց շտեմարանները լիքն են եւ մէկից միւսն են հոսում, նրանց ոչխարները բազմածին են եւ բազմանում են իրենց ճամփի վրայ։ "},
	{14, "14 Նրանց արջառները պարարտ են, նրանց ցանկապատերը խրամատներ չունեն, եւ նրանց հրապարակներում աղմուկ չկայ։ "},
	{15, "15 Ես երանի եմ տալիս այն ժողովրդին, որն այս վիճակում է. նաեւ երանի՜ այն ժողովրդին, որի Տէրն Աստուած է։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view144() {
struct hy144 poems[] = {
	{1, "1 ալեփ. Պիտի փառաբանեմ քեզ, Աստուած իմ եւ Թագաւոր իմ, ու յաւիտեան եւ յաւիտեանս յաւիտենից քո անունն օրհնեմ։ "},
	{2, "2 բեթ. Գիշեր-ցերեկ քեզ օրհնութիւն պիտի մատուցեմ,ու յաւիտեանս յաւիտենից պիտի գովաբանեմ անունը քո։ "},
	{3, "3 գամէլ. Մեծ է Տէրն ու անչափ օրհնեալ, եւ նրա մեծութիւնը սահման չունի։ "},
	{4, "4 դալեթ. Սերնդից սերունդ պիտի գովեն գործերը քո,եւ պիտի պատմեն զօրութիւնները քո։ "},
	{5, "5 հէ. Քո սուրբ փառքի մեծ վայելչութեան մասին պիտի խօսեն,եւ քո հրաշագործութիւնները պիտի պատմեն։ "},
	{6, "6 վաւ. Քո ահաւոր զօրութիւնը պիտի նկարագրեն,եւ քո մեծութիւնը պատմեն։ "},
	{7, "7 զէ. Քո մեծ բարութեան յիշատակը պիտի աւետեն,եւ պիտի ցնծան քո արդարութեամբ։ "},
	{8, "8 խէթ. Գթասիրտ եւ ողորմած է Տէրը, համբերատար եւ ողորմաշատ։ "},
	{9, "9 թէթ. Տէրը քաղցր է բոլորի հանդէպ,եւ նրա գթութիւնը տարածւում է նրա բոլոր արարածների վրայ։ "},
	{10, "10 եօդ. Քո բոլոր գործերը, Տէ՛ր, քեզ գոհութիւն պիտի մատուցեն, եւ քո սրբերը պիտի օրհնեն քեզ։ "},
	{11, "11 քափ. Քո արքայական փառքի մասին պիտի խօսեն,եւ քո զօրութիւնները պիտի պատմեն, "},
	{12, "12 լամէք. որ մարդկանց որդիները ճանաչեն զօրութիւնները քո,եւ մեծ վայելչութիւնը արքայական քո փառքի։ "},
	{13, "13 մէմ. Քո արքայութիւնը ողջ յաւիտենութեան արքայութիւնն է,եւ քո տէրութիւնը՝ սերնդից սերունդ։ նուն. Հաւատարիմ է Տէրն իր բոլոր խօսքերում,եւ արդար է նա իր բոլոր գործերում։ "},
	{14, "14 սամքաթ. Տէրն ամուր է պահում բոլոր սայթաքողներին,եւ ոտքի կանգնեցնում բոլոր գլորուածներին։ "},
	{15, "15 էյ. Բոլորի աչքերը քեզ վրայ են յառած յուսով, եւ դու ես տալիս նրանց կերակուրը ժամանակին. տալիս ես դու նրանց, եւ սնւում են նրանք։ "},
	{16, "16 փէ. Բացում ես ձեռքը քո,եւ քո քաղցր կամքով յագեցնում ես բոլորին։ "},
	{17, "17 ծադէ. Արդար է Տէրն իր բոլոր ճանապարհներին,եւ սուրբ է նա իր բոլոր գործերում։ "},
	{18, "18 կոփ. Տէրը մօտ է բոլոր նրանց, ովքեր կանչում են իրեն, բոլոր նրանց, ովքեր կանչում են իրեն ճշմարտապէս։ "},
	{19, "19 րէշ. Իրենից ակնածողների կամքը կատարում է Տէրը, լսում է նրանց աղօթքն ու փրկում նրանց։ "},
	{20, "20 շին. Տէրը պահպանում է բոլոր նրանց, ովքեր սիրում են իրեն, եւ Տէրը կործանում է բոլոր մեղաւորներին։ "},
	{21, "21 թաւ. Բերանս Տիրոջ օրհնութիւնը պիտի խօսի. ամէն կենդանի էակ պիտի օրհնի սուրբ անունը նրա յաւիտեան եւ յաւիտեանս յաւիտենից։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view145() {
struct hy145 poems[] = {
	{1, "1 Ալէլուիա՝ Անգէոսի եւ Զաքարիայի "},
	{2, "2 Օրհնի՛ր Տիրոջը, հոգիդ իմ. պիտի օրհնեմ Տիրոջն իմ կեանքում, սաղմոս պիտի երգեմ իմ Աստծուն, քանի կամ։ "},
	{3, "3 Յոյս մի՛ դրէք իշխանների՝ մարդկանց որդիների վրայ, որովհետեւ նրանցից փրկութիւն չկայ։ "},
	{4, "4 Երբ դուրս գայ նրանց հոգին,նրանք կրկին հող կը դառնան, եւ նոյն օրը նրանց բոլոր մտածումները կ՚անհետանան։ "},
	{5, "5 Երանի՜ նրան, ում օգնականը Յակոբի Տէր Աստուածն է, եւ ում յոյսը Տէր Աստծու վրայ է, "},
	{6, "6 Նա, որ ստեղծեց երկինքն ու երկիրը, ծովն ու դրանց մէջ եղած ամէն ինչ, "},
	{7, "7 Նա, որ յաւիտեան պահպանում է ճշմարտութիւնը,եւ զրկեալներին արդարութիւն շնորհում. Տէրը հաց է տալիս քաղցածներինեւ արձակում բանտարկեալներին։ "},
	{8, "8 Տէրը բացում է կոյրերի աչքերը, Տէրը ոտքի է կանգնեցնում գլորուածներին։Սիրում է Տէրն արդարներին։ "},
	{9, "9 Տէրը պահպանում է պանդուխտներին, Տէրն ընդունում է որբերին ու այրիներին,եւ կործանում ճանապարհներն ամբարիշտների։ "},
	{10, "10 Յաւէտ պիտի թագաւորի Տէրը, քո Աստուածը, Սիո՛ն, սերնդից սերունդ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view146() {
struct hy146 poems[] = {
	{1, "1 Օրհնեցէ՛ք Տիրոջը, քանզի քաղցր են սաղմոսները. հաճելի է օրհնութիւնը մեր Աստծուն։ "},
	{2, "2 Տէրը կառուցում է Երուսաղէմը,եւ հաւաքում Իսրայէլի ցրուածներին։ "},
	{3, "3 Բժշկում է բեկեալ սրտերը,եւ կապում բոլոր վէրքերը նրանց։ "},
	{4, "4 Նա հաշւում է աստղերի բազմութիւնը,եւ կոչում բոլորն իրենց անուններով։ "},
	{5, "5 Մեծ է մեր Տէրը, եւ մեծ է նրա զօրութիւնը, նրա իմաստութիւնը սահման չունի։ "},
	{6, "6 Տէրն ընդունում է հեզերին,եւ մինչեւ գետին խոնարհեցնում ամբարտաւաններին։ "},
	{7, "7 Օրհնեցէ՛ք Տիրոջը գոհաբանութեամբ, սաղմո՛ս երգեցէք նրան օրհնութեամբ։ "},
	{8, "8 Երկինքը նա պատեց ամպերով, երկրի համար պատրաստեց անձրեւն իր, լեռներում խոտ աճեցրեցեւ բանջար՝ մարդկանց կարիքների համար։ "},
	{9, "9 Նա ուտելիք է տալիս անասուններին եւ ագռաւի ձագերին, որոնք դիմում են իրեն։ "},
	{10, "10 Տէրը ձիու զօրութիւն չէ, որ կամենում է,ոչ էլ հսկայի կազմուածքն է հաւանում, "},
	{11, "11 այլ Տէրն իրենից երկիւղ կրողներին է հաւանում եւ նրանց, որ իրենց յոյսը դրել են իր ողորմութեան վրայ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view147() {
struct hy147 poems[] = {
	{1, "1 Գովաբանի՛ր Տիրոջը, ո՛վ Երուսաղէմ, եւ օրհներգի՛ր քո Աստծուն, Սիո՛ն, "},
	{2, "2 քանզի նա դռներիդ նիգերն ամրացրեց,եւ որդիներիդ օրհնեց քո մէջ։ "},
	{3, "3 Քո սահմանները խաղաղութեան մէջ պահեց,եւ ցորենի առատութեամբ լիացրեց քեզ։ "},
	{4, "4 Նա երկիր է ուղարկում խօսքերն իր,եւ արագ սլանում են պատգամները նրա։ "},
	{5, "5 Նա ձիւն է տեղացնում ինչպէս բուրդ,եւ մառախուղը ցանում փոշու պէս։ "},
	{6, "6 Նա սառոյցներն արձակում է ինչպէս պատառներ.ո՞վ կարող է դիմանալ նրա ցրտին։ "},
	{7, "7 Ուղարկում է խօսքն իր ու հալեցնում դրանք.փչում են հողմերը, եւ հոսում ջրերը։ "},
	{8, "8 Իր խօսքը յայտնում է Յակոբին, իր օրէնքներն ու դատաստանները՝ Իսրայէլին։ "},
	{9, "9 Տէրն այսպէս չվարուեց բոլոր ազգերի հետ,եւ իր դատաստանները նրանց չյայտնեց։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view148() {
struct hy148 poems[] = {
	{1, "1 Օրհնեցէ՛ք Տիրոջը երկնքից, օրհնեցէ՛ք նրան բարձունքներից։ "},
	{2, "2 Օրհնեցէ՛ք նրան, նրա բոլո՛ր հրեշտակներ, օրհնեցէ՛ք նրան, նրա բոլո՛ր զօրութիւններ։ "},
	{3, "3 Օրհնեցէ՛ք նրան, արեգա՛կ եւ լուսի՛ն, օրհնեցէ՛ք նրան, բոլո՛ր աստղեր եւ լոյս։ "},
	{4, "4 Օրհնեցէ՛ք նրան, երկինքների՛ երկինքներ, եւ ջրե՛ր՝ որ վեր էք երկնքից։ "},
	{5, "5 Օրհնեցէ՛ք անունը Տիրոջ, քանզի նա ասաց՝ եւ դրանք ստեղծուեցին, նա հրամայեց՝ եւ դրանք հաստատուեցին։ "},
	{6, "6 Նա կարգեց դրանք յաւիտեանս յաւիտենից.կարգ սահմանեց, եւ այն չի խախտւում։ "},
	{7, "7 Օրհնեցէ՛ք Տիրոջը երկրի վրայից, վիշապնե՛ր եւ բոլո՛ր անդունդներ։ "},
	{8, "8 Հուր եւ կարկուտ, ձիւն եւ սառնամանիք, հողմ ու մրրիկ, դուք, որ նրա խօսքն էք կատարում, "},
	{9, "9 լեռնե՛ր եւ բոլո՛ր բլուրներ, պտղաբե՛ր ծառեր եւ բոլո՛ր մայրիներ, "},
	{10, "10 գազաննե՛ր եւ ամէն տեսակ անասուննե՛ր, սողուննե՛ր եւ ամէն տեսակ թեւաւոր թռչուննե՛ր, "},
	{11, "11 երկրի թագաւորնե՛ր՝ զօրքերով հանդերձ, իշխաննե՛ր եւ երկրի բոլո՛ր դատաւորներ, "},
	{12, "12 երիտասարդնե՛ր ու կոյսե՛ր, ծերե՛ր ու մանուկնե՛ր, օրհնեցէ՛ք անունը Տիրոջ։ "},
	{13, "13 Փառաւորուեց միայն նրա՛ անունը.երկնքում ու երկրի վրայ է վեհութիւնը նրա։ "},
	{14, "14 Տէրը բարձրացնում է եղջիւրն իր ժողովրդի. օրհնութի՜ւն նրա բոլոր սրբերին՝ որդիներին Իսրայէլի, այն ժողովրդին, որ մօտ է Տիրոջը։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view149() {
struct hy149 poems[] = {
	{1, "1 Օրհնեցէ՛ք Տիրոջը նոր օրհնութեամբ, սրբերի ժողովում է օրհնութիւնը նրա։ "},
	{2, "2 Իսրայէլն ուրախացաւ իր Արարչով, Սիոնի որդիները թող ցնծան իրենց Թագաւորով։ "},
	{3, "3 Թող գովեն նրա անունը օրհնութեամբ, նուագարանով ու օրհներգով սաղմոս ասեն նրան։ "},
	{4, "4 Տէրը սիրում է իր սուրբ ժողովրդին,եւ փառաւորում հեզերին փրկութեամբ։ "},
	{5, "5 Թող սրբերը պարծենան փառքով,եւ ցնծան իրենց հանգստի մէջ։ "},
	{6, "6 Թող նրանք փառաբանեն Աստծուն իրենց բերաններով. նրանց ձեռքերում երկսայրի սրեր կան, "},
	{7, "7 որ վրէժ լուծեն հեթանոսներից եւ պատժեն բոլոր ժողովուրդներին, "},
	{8, "8 որ նրանց թագաւորներին կապեն շղթաներով,եւ նրանց մեծամեծներին՝ երկաթեայ ձեռնակապերով, "},
	{9, "9 որ գրուած դատաստանն իրագործեն նրանց հանդէպ։Այս է փառքը նրա բոլոր սրբերի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view150() {
struct hy150 poems[] = {
	{1, "1 Օրհնեցէ՛ք Աստծուն իր սրբարանում, օրհնեցէ՛ք նրան իր զօրութեան երկնային հաստատութեան մէջ։ "},
	{2, "2 Օրհնեցէ՛ք նրան իր զօրութեան մէջ,օրհնեցէ՛ք նրան իր անչափ մեծութեան մէջ։ "},
	{3, "3 Գովաբանեցէ՛ք նրան օրհնութեան ձայնով, գովաբանեցէ՛ք նրան սաղմոսով եւ օրհներգութեամբ։ "},
	{4, "4 Օրհնեցէ՛ք նրան ցնծութեամբ, գովաբանեցէ՛ք նրան ուրախութեամբ։ "},
	{5, "5 Օրհնեցէ՛ք նրան քաղցր խօսքերով, օրհնեցէ՛ք նրան լսելի բառերով, օրհնեցէ՛ք նրան գոհութեան ձայնով։ "},
	{6, "6 Բոլո՛ր հոգիներ, օրհնեցէ՛ք Տիրոջը։ Հաշուից դուրս այս սաղմոսը Դաւթի ինքնագիրն է, երբ նա մարտնչելու ելաւ Գողիադի դէմ, Սաւուղի առջեւ. "},
	{7, "7 Փոքրն էի ես իմ եղբայրների մէջ.եւ կրտսերն՝ իմ հօր տանը. հօրս ոչխարներն էի արածեցնում։ "},
	{8, "8 Ձեռքերն իմ նուագարան ստեղծեցին, եւ մատներս օրհներգութեան գործիք պատրաստեցին։ "},
	{9, "9 Իսկ արդ, ո՞վ պիտի պատմի այս բանն իմ Տիրոջը. ամէն բանի Տէրն ինքը կը լսի այս ամէնը։ "},
	{10, "10 Նա ուղարկեց իր հրեշտակին, ինձ վերցրեց հօրս ոչխարների հօտից,եւ օծեց ինձ իր իւղի օծումով։ "},
	{11, "11 Գեղեցիկ ու մեծ էին եղբայրներն իմ, բայց Տէրը չհաւանեց նրանց։ "},
	{12, "12 Ես ելայ այլազգու դէմ,եւ նզովեցի կուռքերը նրա։ "},
	{13, "13 Առայ նրա սուրն իրենից, կտրեցի գլուխը նրա,եւ վերացրի նախատինքը Իսրայէլի որդիներից։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};