#include <map>
#include <string>
class Bible56
{
	struct hy1	{ int val; const char *msg; };
	struct hy2	{ int val; const char *msg; };
	struct hy3	{ int val; const char *msg; };
public:
static void view1() {
struct hy1 poems[] = {
	{1, "1 Պօղոսը՝ ծառայ Աստծու եւ առաքեալ Յիսուս Քրիստոսի, որ կոչուած է բերելու Աստծու ընտրեալներին հաւատի եւ ճշմարտութեան գիտութեանը, որ աստուածապաշտութեամբ է "},
	{2, "2 եւ յաւիտենական կեանքի յոյսով, որը խոստացաւ անսուտն Աստուած յաւիտենական ժամանակներից առաջ, "},
	{3, "3 բայց յայտնեց իր խօսքը իր ժամանակին՝ քարոզութեամբ, որին ես հաւատարիմ եղայ ըստ մեր Փրկիչ Աստծու հրամանի. "},
	{4, "4 Տիտոսին՝ հասարակաց հաւատի մէջ իմ սիրելի որդուն, շնո՜րհ եւ խաղաղութի՜ւն Հայր Աստծուց եւ մեր Փրկիչ Քրիստոս Յիսուսից։ "},
	{5, "5 Դրա համար իսկ քեզ թողեցի Կրետէում, որպէսզի, ինչ պակաս բան որ կայ, ուղղես եւ իւրաքանչիւր քաղաքում երէցներ կարգես, ինչպէս որ ես պատուիրեցի քեզ։ "},
	{6, "6 Կարգես մի այնպիսի մարդու, որ լինի անբասիր, մէ՛կ կնոջ մարդ, ունենայ հաւատացեալ որդիներ, որոնք անառակութեան մէջ ամբաստանուած կամ անհնազանդ չլինեն, "},
	{7, "7 քանի որ պէտք է, որ եպիսկոպոսն անբասիր լինի, որպէս Աստծու տնտես. ոչ յանդուգն, ոչ բարկացող, ոչ անարգող, ոչ կռուարար, ոչ շահասէր, "},
	{8, "8 այլ՝ հիւրասէր, բարեսէր, խոհեմ, արդար, սուրբ, ժուժկալ, "},
	{9, "9 ամուր կապուած վարդապետութեան հաւատի խօսքին, որպէսզի կարողանայ յորդորել ողջամիտ վարդապետութեամբ եւ կշտամբել հակառակորդներին. "},
	{10, "10 քանզի անհնազանդներ շատ կան, դատարկախօսներ, մոլորեցնողներ, մանաւանդ եթէ հրէութիւնից դարձածներից են. "},
	{11, "11 նրանց բերանը պէտք է փակել. նրանք կործանում են բոլոր ընտանիքները եւ շահամոլութեան համար ուսուցանում են այնպիսի բաներ, որ պէտք չէ ուսուցանել։ "},
	{12, "12 Նրանցից մէկը, իրենց իսկ մարգարէն, ասաց. Կրետացիները մշտապէս ստախօսներ են, չար գազաններ, դատարկապորտներ։ "},
	{13, "13 Եւ ստոյգ է այս վկայութիւնը. ուստի նրանց խստագոյնս կշտամբի՛ր, որպէսզի առողջ լինեն հաւատի մէջ "},
	{14, "14 եւ չնայեն հրէական առասպելներին եւ ճշմարտութիւնից շեղուած մարդկանց հրահանգներին։ "},
	{15, "15 Ամէն ինչ մաքուր է խղճմտանքով մաքուր եղողների համար, բայց պիղծերի եւ անհաւատների համար ոչ մի բան մաքուր չէ։ Եւ նրանց միտքն ու խղճմտանքը պղծուած են։ "},
	{16, "16 Խոստովանում են, որ գիտեն Աստծուն, բայց իրենց գործերով ուրանում են նրան. պիղծ են, անհնազանդ եւ ամէն բարի գործի համար՝ անպէտք։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct hy2 poems[] = {
	{1, "1 Բայց դու սովորեցրո՛ւ այն, ինչ որ վայել է ողջամիտ վարդապետութեանը. "},
	{2, "2 որ ծերերը լինեն զգաստ, պարկեշտ, խոհեմ, ողջամիտ՝ հաւատի, սիրոյ, համբերութեան, ժուժկալութեան մէջ։ "},
	{3, "3 Պառաւ կանայք նոյնպէս լինեն զգաստ եւ սրբերին վայել վարմունք ունենան. ոչ բանսարկու, ոչ գինեմոլ, այլ՝ բարեխրատ, "},
	{4, "4 որ խրատեն դեռատի կանանց՝ սիրելու իրենց մարդկանց, լինելու որդեսէր, "},
	{5, "5 խոհեմ, մաքրակենցաղ, տնարար, բարեգործ, հնազանդ իրենց մարդկանց, որպէսզի Աստծու խօսքը եւ վարդապետութիւնը չանարգուի։ "},
	{6, "6 Երիտասարդներին նոյնպէս յորդորի՛ր լինել խոհեմ, "},
	{7, "7 քո անձը բոլորին օրինակ դարձրո՛ւ բարի գործերի համար, ուսուցման մէջ պահի՛ր անեղծութիւն, սրբութիւն, պարկեշտութիւն, "},
	{8, "8 ողջամիտ խօսք՝ պարսաւանքի տեղի չտուող, որպէսզի, ով որ հակառակուի, ամօթով մնայ եւ մեր մասին ասելու որեւէ չար բան չունենայ։ "},
	{9, "9 Յորդորի՛ր ծառաներին, որ հնազանդ լինեն իրենց տէրերին եւ ամէն ինչում լինեն հաճելի նրանց. ոչ հակառակուող, "},
	{10, "10 ոչ շորթող, այլ ցոյց տան կատարեալ հաւատարմութիւն՝ բարութեամբ, որպէսզի մեր Փրկչի՝ Աստծու վարդապետութիւնը ամէն ինչում զարդարեն։ "},
	{11, "11 Քանզի Աստուած իր շնորհը յայտնեց որպէս փրկութեան միջոց բոլոր մարդկանց, "},
	{12, "12 շնորհ, որ խրատում է մեզ, որ մերժենք ամբարշտութիւնը եւ աշխարհիկ ցանկութիւնները, այս աշխարհում ապրենք զգաստութեամբ, աստուածապաշտութեամբ "},
	{13, "13 եւ ակնդէտ սպասենք երանելի յոյսին եւ փառքի յայտնութեանը մեծն Աստծու եւ մեր Փրկչի՝ Յիսուս Քրիստոսի, "},
	{14, "14 որ իր անձը տուեց մեզ համար, որպէսզի մեզ փրկի ամէն անօրէնութիւնից եւ մաքրի որպէս իրեն սեփական ժորովուրդ՝ նախանձախնդիր բարի գործերի։ "},
	{15, "15 Այս բաները խօսի՛ր, յորդորի՛ր եւ յանդիմանի՛ր ամենայն խստութեամբ, որպէսզի չլինի մէկը, որ քեզ արհամարհի։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct hy3 poems[] = {
	{1, "1 Յիշեցրո՛ւ նրանց, որ իշխանութիւններին եւ պետութիւններին հնազանդուեն եւ հպատակուեն, բոլոր բարի գործերի համար պատրաստ լինեն. "},
	{2, "2 ոչ ոքի չչարախօսեն, չլինեն կռուարար, այլ՝ հեզահամբոյր, բոլոր մարդկանց հանդէպ քաղցրութեամբ վերաբերուեն. "},
	{3, "3 որովհետեւ մի ժամանակ մենք էլ էինք անմիտ, անհնազանդ, մոլորուած, ծառայում էինք ցանկութիւնների եւ պէսպէս անառակութիւնների. չարութեամբ եւ նախանձով էինք ապրում, ատելի էինք եւ ատում էինք միմեանց։ "},
	{4, "4 Իսկ երբ մեր Փրկիչ Աստծու քաղցրութիւնը եւ մարդասիրութիւնը յայտնուեց, - "},
	{5, "5 ոչ այն արդարութեան գործերի համար, որ մենք արեցինք, այլ իր ողորմութեան համաձայն, - փրկեց մեզ վերստին ծննդեան աւազանի միջոցով եւ նորոգութեամբ Սուրբ Հոգու, "},
	{6, "6 որ Աստուած թափեց մեր վրայ առատութեամբ մեր Փրկչի՝ Յիսուս Քրիստոսի միջոցով, "},
	{7, "7 որպէսզի, նրա շնորհով արդարացուած, ժառանգներ լինենք յաւիտենական կեանքի յոյսով։ "},
	{8, "8 Ճիշտ է այս խօսքը, եւ ուզում եմ, որ դու հաստա՛տ մնաս սրանում, որպէսզի Աստծուն հաւատացողները ջանք թափեն բարի գործեր կատարելու, քանի որ ա՛յդ է բարի եւ օգտակար՝ մարդկանց համար։ "},
	{9, "9 Բայց հեռո՛ւ վանիր յիմար վէճերը, տոհմաբանութիւնները, հակաճառութիւններն ու օրէնքի շուրջ եղող կռիւները, որովհետեւ դրանք անօգուտ են եւ սնոտի։ "},
	{10, "10 Հեռացի՛ր հերձուածող մարդուց՝ մէկ կամ երկու անգամ նրան խրատելուց յետոյ. "},
	{11, "11 իմացի՛ր, որ շեղուած է այդպիսին եւ մեղանչում է՝ ինքն իսկ դատապարտելով իրեն։ "},
	{12, "12 Երբ քեզ մօտ ուղարկեմ Արտեմասին կամ Տիւքիկոսին, շտապի՛ր գալ ինձ մօտ Նիկոպոլիս, քանի որ մտադիր եմ այնտեղ ձմեռել։ "},
	{13, "13 Օրէնսգէտ Զենոնին եւ Ապողոսին շուտով ճանապարհի՛ր, այնպէս որ նրանք ոչ մի բանի պակասը չզգան։ "},
	{14, "14 Եւ մերոնք էլ թող սովորեն հետամուտ լինել բարի գործերի, կարեւոր պէտքերի մէջ, որպէսզի անպտուղ չլինեն։ "},
	{15, "15 Ողջունում են քեզ բոլոր նրանք, որ ինձ հետ են։ Ողջունի՛ր հաւատի մէջ մեզ սիրողներին։ Շնո՜րհ՝ ձեզ բոլորիդ։ "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};