#include <map>
#include <string>
class Bible19
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
	struct mk6	{ int val; const char *msg; };
	struct mk7	{ int val; const char *msg; };
	struct mk8	{ int val; const char *msg; };
	struct mk9	{ int val; const char *msg; };
	struct mk10	{ int val; const char *msg; };
	struct mk11	{ int val; const char *msg; };
	struct mk12	{ int val; const char *msg; };
	struct mk13	{ int val; const char *msg; };
	struct mk14	{ int val; const char *msg; };
	struct mk15	{ int val; const char *msg; };
	struct mk16	{ int val; const char *msg; };
	struct mk17	{ int val; const char *msg; };
	struct mk18	{ int val; const char *msg; };
	struct mk19	{ int val; const char *msg; };
	struct mk20	{ int val; const char *msg; };
	struct mk21	{ int val; const char *msg; };
	struct mk22	{ int val; const char *msg; };
	struct mk23	{ int val; const char *msg; };
	struct mk24	{ int val; const char *msg; };
	struct mk25	{ int val; const char *msg; };
	struct mk26	{ int val; const char *msg; };
	struct mk27	{ int val; const char *msg; };
	struct mk28	{ int val; const char *msg; };
	struct mk29	{ int val; const char *msg; };
	struct mk30	{ int val; const char *msg; };
	struct mk31	{ int val; const char *msg; };
	struct mk32	{ int val; const char *msg; };
	struct mk33	{ int val; const char *msg; };
	struct mk34	{ int val; const char *msg; };
	struct mk35	{ int val; const char *msg; };
	struct mk36	{ int val; const char *msg; };
	struct mk37	{ int val; const char *msg; };
	struct mk38	{ int val; const char *msg; };
	struct mk39	{ int val; const char *msg; };
	struct mk40	{ int val; const char *msg; };
	struct mk41	{ int val; const char *msg; };
	struct mk42	{ int val; const char *msg; };
	struct mk43	{ int val; const char *msg; };
	struct mk44	{ int val; const char *msg; };
	struct mk45	{ int val; const char *msg; };
	struct mk46	{ int val; const char *msg; };
	struct mk47	{ int val; const char *msg; };
	struct mk48	{ int val; const char *msg; };
	struct mk49	{ int val; const char *msg; };
	struct mk50	{ int val; const char *msg; };
	struct mk51	{ int val; const char *msg; };
	struct mk52	{ int val; const char *msg; };
	struct mk53	{ int val; const char *msg; };
	struct mk54	{ int val; const char *msg; };
	struct mk55	{ int val; const char *msg; };
	struct mk56	{ int val; const char *msg; };
	struct mk57	{ int val; const char *msg; };
	struct mk58	{ int val; const char *msg; };
	struct mk59	{ int val; const char *msg; };
	struct mk60	{ int val; const char *msg; };
	struct mk61	{ int val; const char *msg; };
	struct mk62	{ int val; const char *msg; };
	struct mk63	{ int val; const char *msg; };
	struct mk64	{ int val; const char *msg; };
	struct mk65	{ int val; const char *msg; };
	struct mk66	{ int val; const char *msg; };
	struct mk67	{ int val; const char *msg; };
	struct mk68	{ int val; const char *msg; };
	struct mk69	{ int val; const char *msg; };
	struct mk70	{ int val; const char *msg; };
	struct mk71	{ int val; const char *msg; };
	struct mk72	{ int val; const char *msg; };
	struct mk73	{ int val; const char *msg; };
	struct mk74	{ int val; const char *msg; };
	struct mk75	{ int val; const char *msg; };
	struct mk76	{ int val; const char *msg; };
	struct mk77	{ int val; const char *msg; };
	struct mk78	{ int val; const char *msg; };
	struct mk79	{ int val; const char *msg; };
	struct mk80	{ int val; const char *msg; };
	struct mk81	{ int val; const char *msg; };
	struct mk82	{ int val; const char *msg; };
	struct mk83	{ int val; const char *msg; };
	struct mk84	{ int val; const char *msg; };
	struct mk85	{ int val; const char *msg; };
	struct mk86	{ int val; const char *msg; };
	struct mk87	{ int val; const char *msg; };
	struct mk88	{ int val; const char *msg; };
	struct mk89	{ int val; const char *msg; };
	struct mk90	{ int val; const char *msg; };
	struct mk91	{ int val; const char *msg; };
	struct mk92	{ int val; const char *msg; };
	struct mk93	{ int val; const char *msg; };
	struct mk94	{ int val; const char *msg; };
	struct mk95	{ int val; const char *msg; };
	struct mk96	{ int val; const char *msg; };
	struct mk97	{ int val; const char *msg; };
	struct mk98	{ int val; const char *msg; };
	struct mk99	{ int val; const char *msg; };
	struct mk100	{ int val; const char *msg; };
	struct mk101	{ int val; const char *msg; };
	struct mk102	{ int val; const char *msg; };
	struct mk103	{ int val; const char *msg; };
	struct mk104	{ int val; const char *msg; };
	struct mk105	{ int val; const char *msg; };
	struct mk106	{ int val; const char *msg; };
	struct mk107	{ int val; const char *msg; };
	struct mk108	{ int val; const char *msg; };
	struct mk109	{ int val; const char *msg; };
	struct mk110	{ int val; const char *msg; };
	struct mk111	{ int val; const char *msg; };
	struct mk112	{ int val; const char *msg; };
	struct mk113	{ int val; const char *msg; };
	struct mk114	{ int val; const char *msg; };
	struct mk115	{ int val; const char *msg; };
	struct mk116	{ int val; const char *msg; };
	struct mk117	{ int val; const char *msg; };
	struct mk118	{ int val; const char *msg; };
	struct mk119	{ int val; const char *msg; };
	struct mk120	{ int val; const char *msg; };
	struct mk121	{ int val; const char *msg; };
	struct mk122	{ int val; const char *msg; };
	struct mk123	{ int val; const char *msg; };
	struct mk124	{ int val; const char *msg; };
	struct mk125	{ int val; const char *msg; };
	struct mk126	{ int val; const char *msg; };
	struct mk127	{ int val; const char *msg; };
	struct mk128	{ int val; const char *msg; };
	struct mk129	{ int val; const char *msg; };
	struct mk130	{ int val; const char *msg; };
	struct mk131	{ int val; const char *msg; };
	struct mk132	{ int val; const char *msg; };
	struct mk133	{ int val; const char *msg; };
	struct mk134	{ int val; const char *msg; };
	struct mk135	{ int val; const char *msg; };
	struct mk136	{ int val; const char *msg; };
	struct mk137	{ int val; const char *msg; };
	struct mk138	{ int val; const char *msg; };
	struct mk139	{ int val; const char *msg; };
	struct mk140	{ int val; const char *msg; };
	struct mk141	{ int val; const char *msg; };
	struct mk142	{ int val; const char *msg; };
	struct mk143	{ int val; const char *msg; };
	struct mk144	{ int val; const char *msg; };
	struct mk145	{ int val; const char *msg; };
	struct mk146	{ int val; const char *msg; };
	struct mk147	{ int val; const char *msg; };
	struct mk148	{ int val; const char *msg; };
	struct mk149	{ int val; const char *msg; };
	struct mk150	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Блажен е оној, што не оди на советот безбожнички, не застанува на пат на грешници и не седи во друштво на развратници,"},
	{2, "2 па му омилел законот на Господа и во законот Негов дење и ноке се поучува;"},
	{3, "3 тој е како дрво посадено крај воден извор, кое својот род го дава навреме, и чиј лист не вене; и во се што прави, напредува."},
	{4, "4 Но не се такви безбожниците; тие се како прав, што го растура ветар по земјата."},
	{5, "5 Затоа безбожниците нема да се одржат на судот, ниту грешниците - во соборот на преведниците."},
	{6, "6 Зашто Господ го знае патот на преведниците; патот, пак, безбожнички води во погибел."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Зошто се бунат народите, и племињата смислуваат лоши работи?"},
	{2, "2 Се креваат царевите земски, и кнезовите се собираат заедно против Господа и Неговиот Помазаник."},
	{3, "3 'Да ги раскинеме врските нивни и да го отфрлиме од себе јаремот нивни.'"},
	{4, "4 Оној, Кој живее на небесата, ке им се смее и Господ ке ги исмее."},
	{5, "5 Тогаш во гневот Свој ке им говори и со јароста Своја ке ги збуни:"},
	{6, "6 'Јас го помазав Царот Свој на Сион, на Мојата Света Гора.'"},
	{7, "7 Kе го кажам определението - Господ Ми рече: 'Ти си Син Мој, Јас денес Те родив.'"},
	{8, "8 И побарај од Мане, и ке Ти ги дадам народите во Твое наследство, и краиштата на замјата - во Твоја власт."},
	{9, "9 Ти ке ги пасеш со желзен жезал; ке ги разбиваш како грнчарски сад.'"},
	{10, "10 И сега цареви, вразумете се; поучете се, судии земни!"},
	{11, "11 Служете Му на Господа со страв и радувајте се со трепет."},
	{12, "12 Почитувајте го Синот, та да не се разгневи, и на патот свој да не погинете; зашто Неговиот гнев брзо ке се разгори. Блажени се сите, кои на Него се надеваат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Господи, колку многу се намножија непријателите мои! Мнозина се креваат против мене;"},
	{2, "2 мнозина велат за душата моја: нема спас за него во Бога."},
	{3, "3 Но Ти, Господи, си застапник мој, слава моја; Ти ја подигаш главата моја."},
	{4, "4 Со гласот свој викам кон Господ, и Он ме слуша од Својата Света Гора."},
	{5, "5 Легнувам, спијам и станувам, оти Господ ме чува."},
	{6, "6 Не се плашам од многу иљади лу е, што од сите страни навалиле на мене."},
	{7, "7 Стани Господи! Спаси ме, Боже мој! Зашто Ти ги поразуваш сите мои непријатели и им ги здробуваш забите на грешниците."},
	{8, "8 Од Господа е спасението. Твојот благослов нека биде на народот Твој."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Кога викам, чуј ме, Боже, правдо моја! Во маката моја дај ми простор. Помилуј ме и услиши ја молитвата моја."},
	{2, "2 Синовите човечки, до кога ке бидете со тврдо срце; до кога ке сакате суета и ке барате лага?"},
	{3, "3 Знајте дека Господ го запазил Својот светија; Господ слуша кога викам кон Него."},
	{4, "4 Не грешете, гневејки се; размислете во срцета свои и на постелите сви, и смирете се."},
	{5, "5 Принесете жртва за правда и надевајте се на Господа."},
	{6, "6 Мнозина велат: кој ке ни покаже што е добро? Покажи ни ја светлината на лицето Свое, Господи!"},
	{7, "7 А мене Ти си ми го исполнил срцето со радост поголема отколку кога ке се роди во изобилие пченица и вино."},
	{8, "8 Затоа мирно легнувам и спијам; оти Ти, Господи, си ми влил надеж да живеам без опсасност."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 Чуј ги, Господи, зборовите мои, разбери ги поплаките мои."},
	{2, "2 Чуј го гласот на моето молење, Цару мој и Боже Мој!"},
	{3, "3 Наутро чуј го гласот мој, наутро застанувам пред Тебе и во Тебе гледам."},
	{4, "4 Оти ти си Бог, Кој не сака беззаконија; за лошиот нема место при тебе:"},
	{5, "5 безбожниците нема да излезат пред очите Твои; Ти ги мразиш сите што вршат неправда."},
	{6, "6 Ти ке ги уништиш сите лажливци; од крвопиец и лукав Господ се гнаси."},
	{7, "7 А јас, пак, според Твојата голема милост, ке влезам во Твојот храм со страв пред Тебе."},
	{8, "8 Господи, упатувај ме во Твојата правда, поради непријателите мои патот Твој пред мене порамни го."},
	{9, "9 Зашто во устата нивна нема вистина; во срцето им е измама; грлото им е оторен гроб; на јазикот, пак, дволичност."},
	{10, "10 Казни ги, Боже, нека пропаднат тие и мислите нивни; поради многуте нечестни работи отфрли ги, бидејки Те огорчија Тебе."},
	{11, "11 Па нека се зарадуваат сите, кои се надеваат на Тебе: вечно да се радуваат оние што Ти ги закрилуваш; и да се радуваат со Тебе оние, што го сакаат името Твое."},
	{12, "12 Оти Ти, Господи, го благословуваш пераведникот и со оружјето на милоста Своја го закрилуваш."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct mk6 poems[] = {
	{1, "1 Господи, не ме карај во јароста Своја и не казнувај ме во гневот Свој."},
	{2, "2 Смилуј се на мене, Господи, оти сум немокен; исцели ме, Господи, бидејки коските мои се потресени;"},
	{3, "3 и душата моја е возбудена. А Ти, Господи до кога?"},
	{4, "4 Обрни се, Господи, избави ја душата моја, спаси ме поради милоста Своја,"},
	{5, "5 бидејки мртвите не Те спомнуваат Тебе; во пеколот кој ке Те слави Тебе?"},
	{6, "6 Се уморив воздивнувајки; секоја нок го навлажнувам леглото мое, со солзи свои ја натопувам постелата моја."},
	{7, "7 Од скрб ми се помрачи окото мое, остарев поради сите мои непријатели."},
	{8, "8 Отстапете од мене вие сите, кои вршите неправда, оти Господ го чу гласот на мојот плач."},
	{9, "9 Господ ја чу молбата моја, Господ ке ја прими молитвата моја."},
	{10, "10 Нека се посрамат и уплашат сите мои непријатели; да се повратат и веднаш да се засрамат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct mk7 poems[] = {
	{1, "1 Господи, Боже мој, на Тебе се надевам, спаси ме од сите што ме гонат, и избави ме;"},
	{2, "2 Да не би некогаш непријателот да посака да ми ја истргна душата; ке трга, а ке нема кој да спасува."},
	{3, "3 Господи, Боже мој, ако го направив тоа, ако има неправда во рацете мои;"},
	{4, "4 ако зло вратив на оние, кои поради правда ме напа аат, тогаш нека отпаднам од непријателите мои;"},
	{5, "5 нека ја гони непријателот душата моја, и нека ја стигне, и нека го згази животот мој на земјава, и телото мое во прав нека го претвори."},
	{6, "6 Стани, Господи, во гневот Свој; крени се против жестината на непријателите Твои; стани, Господи, Ти Кој заповедаш."},
	{7, "7 И многу народ ке се собере околу Тебе; и Ти издигни се над него високо."},
	{8, "8 Господ им суди на народите. Суди ми, Господи, според правдата моја и според чистотата моја."},
	{9, "9 Да престане злобата на грешниците, а праведникот исправи го, Ти, Боже, кој ги испитуваш срцата и утробите праведно."},
	{10, "10 Помош очекувам од Бога, Кој ги спасува оние што се со чисти срца."},
	{11, "11 Бог е праведен судија, и силен, и долготрпелив и не се гневи секој ден."},
	{12, "12 Но ако не се покаете, Он ке го очисти Своето оружје, ке го затегне својот лак и ке го насочи,"},
	{13, "13 и затега смртна стрела, а стрелите Свои ги вжарува."},
	{14, "14 И, ете, кај безбожникот се повеке неправда, па се зачна злоба, а тоа роди беззконие,"},
	{15, "15 па си копа и ископа јама, и падна во јамата, што ја направи,"},
	{16, "16 и злобата негова му падна на главата негова, а врз неа и неправдата негова слезе."},
	{17, "17 Го прославувам Господа поради правдата Негова и му пеам на Господа Севишниот."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct mk8 poems[] = {
	{1, "1 Господи, Господи наш, колку е чудесно името Твое по целата земја! Си ја издигнал славата Своја над небесата."},
	{2, "2 Од устата на младенците и доенчињата си ја создал похвалата Своја заради непријателите Твои, за да го срушиш непријателот и одмаздникот."},
	{3, "3 Кога ке ги погледам небесата, дела на прстите Твои, па месечината и sвездите, што си ги поставил Ти:"},
	{4, "4 Што е тоа човек, та се секаваш на него, или синот човечки, па го посетуваш?"},
	{5, "5 Си го направил малку помал од ангелите, но со слава и чест си го венчал,"},
	{6, "6 и си го поставил над делата од рацете Твои, и се си потчинил под нозете негови;"},
	{7, "7 овците и воловите сите, и sверовите полски;"},
	{8, "8 птиците небески и рибите морски, се што се движи по морските патишта."},
	{9, "9 Господи, Господи наш, колку е чудесно името Твое по целата земја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct mk9 poems[] = {
	{1, "1 Те прославувам Тебе, Господи, со сето срце свои, ги известувам сите чудеса Твои;"},
	{2, "2 се радувам и се веселам во Тебе, му пеам на името Твое, Севишни."},
	{3, "3 Кога се вратија непријателите мои, се сопнаа, изгубија сила и погинаа од лицето Твое."},
	{4, "4 Бидејки донесе пресуда за мене и ме одбрани; седна на престолот Свој, судија праведен."},
	{5, "5 Им запрети на народите и загина нечестивиот; името му го затре за сите векови."},
	{6, "6 Непријателот остана сосема без оружје; градовите Му ги разруши, и погина споменот за нив."},
	{7, "7 Но Господ секогаш живее; го подготвил престолот Свој за суд;"},
	{8, "8 Он ке и суди на вселената по правда, на лу ето ке им суди право."},
	{9, "9 И ке му биде Господ прибежиште на сиромавиот, помошник во право време во невоља."},
	{10, "10 Па нека се надеваат на Тебе оние кои го знаат името Твое, бидејки не ги оставаш оние што Те бараат."},
	{11, "11 Пејте Му на Господа Кој живее на Сион, кажувајте ги на народите делата Негови;"},
	{12, "12 бидејки Он се одмаздува за крв; ја помни; не ги заборава пискотите на неволниците."},
	{13, "13 Смулуј се, Господи на мене; погледај како страдам од непријателите мои, Ти, Кој ме избавуваш од вратата на смртта."},
	{14, "14 За да ги кажувам сите похвали за Тебе пред вратите на керката Сионска и да го прославувам спасението Твое."},
	{15, "15 Пропа аа народите во јама, што сами ја направија; во замка, која сами ја наместија, се фати ногата нивна."},
	{16, "16 Го познаа Господа, Кој суди; во делата на рацете Негови грешникот се заплетува."},
	{17, "17 Kе се вратат во пеколот сите грешници, и сите народи, кои Бога Го забораваат."},
	{18, "18 Зашто нема засекогаш да биде заборавен сиромавиот, и надежта на бедните нема никогаш да престане."},
	{19, "19 Стани, Господи, за да не се засили човекот, и народите да примаат суд пред Тебе."},
	{20, "20 Постави, Господи, законоположник над нив, за да разберат незнабожците дека се лу е."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct mk10 poems[] = {
	{1, "1 Зошто Господи се оддалечуваш и не сакаш на неволните во право време да им помогнеш?"},
	{2, "2 Кога нечесниот се разбесува, ги мачи бедните бездушно, и тие па аат во замките негови."},
	{3, "3 Бидејки грешникот се гордее со желбата на душата своја и одбива да биде благословен."},
	{4, "4 Грешникот го дразни Господа, за многуте негови гревови, вели, дека Он не истражува: нема Бог пред него."},
	{5, "5 Патиштата негови се секогаш криви, а судовите Твои се многу високи, за да мисли на нив, и така над непријателите се гордее."},
	{6, "6 И во срцето свое си вели: нема да минувам од род во род без зло."},
	{7, "7 Устата му е полна со клетви, измами и навреди; под јазикот негов тежина и пропаст."},
	{8, "8 Седи во заседа со богати, потајно убива невини, очите негови демнат бедни."},
	{9, "9 Седи скришум како лав во пештера, со намера да фати беден, и кога ке фати, го сплетува во својата мрежа."},
	{10, "10 Се смирува, прилегнува и тогаш бедниот па а совладан."},
	{11, "11 па вели во срцето свое: Бог заборавил, го свртел лицето свое за да не го види крајот."},
	{12, "12 Стани, Господи, Боже мој, нека се крене раката Тавоја, не ги заборавај за секогаш бедните Твои."},
	{13, "13 Зошто безбожникот Го разгневува Бога, зошто во срцето свое да вели - Бог не изпитува?"},
	{14, "14 Но ти гледаш, оти ги забележуваш маките и навредите на бедниот; бедниот Тебе Ти се предава, Тебе Ти се остава сиромавиот и сиракот; биди им помошник."},
	{15, "15 Сотри ја мишката на грешникот и на лукавиот; па да се бара и да не се најде безбожноста негова."},
	{16, "16 Господ е вечен цар, во сите времиња; ке ги снема народите од земјата Негова."},
	{17, "17 Господи, Ти ги слушаш желбите на бедните; закрепи ги срцата нивни, отвори го увото Свое!"},
	{18, "18 Дај правда на сиракот и на смирениот, па да престане човекот на земјата да задава страв."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct mk11 poems[] = {
	{1, "1 На Господа се надевам, зошто да и речете на душата моја: 'Одлетај во гората своја како птица?'"},
	{2, "2 Но ете грешниците, го затегнаа лакот, ја притегнаа стрелата своја на тетивата, па од мрак да стрелаат на чистите по срце."},
	{3, "3 Ти што си направил, тие го разрушија; што може праведникот да прави? Господ е во својот свет храм."},
	{4, "4 Господ е на престолот небесни; очите Негови гледаат на сиромавиот, ве ите Негови ги испитуваат синовите човечки."},
	{5, "5 Господ го испитува праведникот, а безбожникот, и оној што сака неправда, ја мрази душата своја."},
	{6, "6 На грешниците ке пушти дожд од разгорен јаглен, оган и сулфур, а силен ветар ке им биде дел во чашата нивна."},
	{7, "7 Зашто Господ е праведен, ја сака правдата: лицето Негово ке го гледаат праведниците."},
	{8, "1 Со песна ке го прославам милоста и судот, Господи."},
	{9, "2 Kе Ти пеам и ке размислувам за патот непорочен: кога ке ми пријдеш? Среде мојот дом одев со чисто срце."},
	{10, "3 Не ставив пред очите мои ништо незаконски; престапите ги мразам."},
	{11, "4 Развратно срце нема да се прилепи до мене; за лукавиот не сакав да знам."},
	{12, "5 Оној што тајно го клевети ближниот свој, го изгонувам; со оној, што е со горделиви очи и ненаситно срце, не јадев."},
	{13, "6 Очите ми се управени кон верниците на земјата, за да седат со мене; кој одеше по патот непорочен, тој ми служеше."},
	{14, "7 Не живееше во мојот дом оној, кој гордо постапува; кој говори лага, не можеше да остане пред очите мои."},
	{15, "8 Од рани зори ги убивав сите грешници на земјата, за да ги истребам од Господовиот град сите, што вршат беззаконие."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct mk12 poems[] = {
	{1, "1 Спаси ме, Господи, зашто не остана праведен, зашто се намалија верните ме у синовите човечки."},
	{2, "2 Суета му кажуваат секој на ближниот свој; од дволично срце устите зборуваат лага."},
	{3, "3 Нека ги истреби Господ сите соблазниви усти и јазик што се возвеличува;"},
	{4, "4 оние што зборуваат: 'Јазикот свој ке го величаме; устата ни е со нас; кој е господар над нас?'"},
	{5, "5 'Заради страдањата на сиромасите и офкањата на бедните ке се кренам сега - вели Господ - ке го спасам оној, кому сакаат да му напакостат.'"},
	{6, "6 Зборовите на Господа се зборови чисти, сребро во оган исчистено од земја, седумпати пречистено."},
	{7, "7 Ти, Господи, ке не одбраниш и ке не запазиш од овој род и довека."},
	{8, "8 Нечестивите одат наоколу; според возвишеноста Своја многу си им допуштил на синовите човечки."},
	{9, "1 Господи, услиши ја молитвата моја и повикот мој нека дојде до Тебе!"},
	{10, "2 Не одвракај го лицето Свое од мене, во денот на мојата жалост приклони го увото Твое кон мене; во деност, кога Те повикувам, услиши ме бргу,"},
	{11, "3 зашто дните ми исчезнуваат како дим, а коските мои се исушија како суварки;"},
	{12, "4 попарен сум како трева, срцето ми е исушено, така што заборавив и лебот свој да го јадам;"},
	{13, "5 од гласот на моите воздишки коските ми се залепија за телото мое."},
	{14, "6 Заприлегав на несит во пустиња; станав како був во урнатини;"},
	{15, "7 не спиев, седев како самотна птица на покрив."},
	{16, "8 Секој ден ме навредуваа непријателите мои, и фалејки се, ме проколнуваа."},
	{17, "9 Јадев пепел како леб и пијалокот свој со солзи го растворав."},
	{18, "10 Поради гневот и јароста од лицето Твое бев воздигнат и соборен."},
	{19, "11 Дните мои исчезнуваа како сенка и јас се исушив како сено."},
	{20, "12 А Ти, Господи, вечно пребиваш; и споменот за Тебе е од род во род."},
	{21, "13 Кога ке станеш, ке се смилуваш на Сион, зашто време е да се смилуваш на него - зашто дојде времето;"},
	{22, "14 бидејки на Твоите слуги им омилеа и камењата негови и за правот негов жалат."},
	{23, "15 Незнабожците ке се заплашат од името на Господа, а сите земни цареви - од Твојата слава."},
	{24, "16 Зашто Господ ке го изгради Сион и ке се појави во славата Своја;"},
	{25, "17 ке погледне милостиво на молитвите од беспомошните и нема да ги презре молибите нивни."},
	{26, "18 Нека се запише ова за следниот род, и идното поколение што ке Го слави Господа,"},
	{27, "19 зашто се јави од светата Своја височина, Господ од небесата погледна на земјата,"},
	{28, "20 за да ги чуе офкањата на окованите, да ги ослободи синовите од смртта,"},
	{29, "21 за да го разгласат името Господово на Сион и похвалата Негова во Ерусалим,"},
	{30, "22 кога ке се соберат народите и царствата заедно да му служат на Господа."},
	{31, "23 Он ми ја откажа заштитата Своја на патот мој, ме извести дека ги скратува дните мои."},
	{32, "24 Боже мој! Не земај ме на половината од деновите мои. Твоите години се од род во род."},
	{33, "25 Во почетокот Ти, Господи, ја основа земјата, небесата се дело на Твоите раце;"},
	{34, "26 тие ке пропаднат, а Ти ке пребиваш; сите тие - како облека ке оветвеат, и како наметка Ти ке ги свиткаш, и ке се изменат;"},
	{35, "27 но Ти си секогаш истиот, и Твоите години нема да завршат."},
	{36, "28 Синоивте на Твоите слуги ке се веселат и потомството нивно ке се зацврсти за навек."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct mk13 poems[] = {
	{1, "1 До кога, Господи, сосема ке ме забораваш, до кога ке го одвракаш лицето Свое од мене?"},
	{2, "2 До кога ке размислувам во душата своја, и ке жалам во срцето свое дење и ноке? До кога непријателот мој ке се издига над мене?"},
	{3, "3 Погледај, чуј ме, Господи, Боже мој! Просветли ги очите мои, за да не заспијат некако со сон смртен;"},
	{4, "4 да не рече непријателот мој: 'го надвив.' Гонителите мои ке се зарадуваат, ако почнам да премалувам."},
	{5, "5 Јас, пак, се надевав на Твојата милсот; срцето мое ке се зарадува заради спасението од Тебе; "},
	{6, "6 ке му пеам на Господа, Кој ми направи добрини и ке го воспевам името на Севишниот Господ."},
	{7, "1 Благословувај Го, душо моја, Господа, и целата моја внатрешност да го благословува Неговото свето име."},
	{8, "2 Благословувај Го, душо моја, Господа и не заборавај ги сите Негови добрини, на Оној,"},
	{9, "3 Кој ги очистува сите твои беззаконија, Кој ги исцелува сите твои болести;"},
	{10, "4 Кој го избавува од распа ање твојот живот, Кој те овенчува со милост и со добрини."},
	{11, "5 Кој ја исполнува со блага твојата желба, како на орел ке се обновува твојата младост."},
	{12, "6 Господ им дава милост и суд на сите онеправдани."},
	{13, "7 Он му ги покажа Своите патишта на Мојсеја, на Израилевите синови - барањата Свои."},
	{14, "8 Штедар и милостив е Господ, долготрпелив и многумилостив;"},
	{15, "9 Он не се гневи до крај, ниту вечно се лути."},
	{16, "10 Оне не ни направи ништо според нашите безааконија и не постапи според нашите гревови;"},
	{17, "11 зашто, колку е големо растојанието од небото до земјата, толку е голема милоста на Господа спрема оние што се бојат од Него;"},
	{18, "12 колку е далику исток од запад, толку ги оддалечил Он од нас нашите беззаконија;"},
	{19, "13 како таткото што ги милува синовите, така и Господ ги милува оние, кои се бојат од Него."},
	{20, "14 Зашто Он го знае нашиот состав, помни дека сме земја."},
	{21, "15 Дните на човекот се како трева; како полски цвет, така прецутува тој;"},
	{22, "16 ке дувне ли над него ветар, и веке го нема, и местото веке нема да се познава"},
	{23, "17 А милоста на Господа е од век до век спрема оние, кои се бојат од Него,"},
	{24, "18 и правдата Негова е од синовите на синовите, кои го чуваат заветот Негов и ги помнат заповедите Негови, за да ги исполнуваат."},
	{25, "19 Господ го поставил Својот престол на небото, и царството Негово владее над се."},
	{26, "20 Благословувајте Го Господа - сите ангели Негови крепки по сила, кои го извршуваат Неговиот збоар, слушајки го гласот од зборот Негов;"},
	{27, "21 благословувајте Го Господа - сите Негови војски, Негови служители, кои ја испонувате вољата Негова;"},
	{28, "22 благословувајте Го Господа сите Негови дела, по сите места на Неговото владеење. Благословувај Го, душо моја, Господа!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct mk14 poems[] = {
	{1, "1 Рече безумниот во срцето свое: 'Нема Бог.' Се развратија лу ето, извршија гнасни дела, нема кој да прави добро."},
	{2, "2 Господ погледна од небесата со внимание кон синовите човечки, за да види, има ли кој Го разбира и Го бара Бога."},
	{3, "3 Сите се застрашија, сите станаа лоши, нема кој да прави добро, нема дури ниеден."},
	{4, "4 Зар нема да се вразумат сите, што вршат беззаконие, кои така го јадат народот Мој, како што јадат леб, и кои не го призовуваат Господа."},
	{5, "5 Таму ке се уплашат тие од страв, каде што нема страв, зашто Господ е во родот на праведните."},
	{6, "6 Вие се подигрувате со сиромашниот, но Господ е негова надеж."},
	{7, "7 Кој ке му даде од Сион спасение на Израилот? Кога Господ ке ги врати заробените од Својот народ, тогаш нека се зарадува Јаков, и нека се развесели Израилот."},
	{8, "1 Благословувај Го, душо моја, Господа, Господи, Боже мој, ти си се возвеличил; во слава и велелепие си се облекол;"},
	{9, "2 Ти си се облекол во светлина како со облека, си го прострел небото како шатор;"},
	{10, "3 со вода си ги покрил Твоите дворови, облаците си ги направил за да одиш по нив, кога се движиш - ветрот Ти служи како криља."},
	{11, "4 Ветровите ги правиш Свои гласници, а слугите Свои огнен пламен."},
	{12, "5 Ти си ја поставил земјата на цврсти основи: таа нема да се разниша никогаш."},
	{13, "6 Си ја покрил со бездна како со облака, води ке стојат на горите."},
	{14, "7 Од Твојата закана тие бегаат, од гласот на Твојот гром се бојат;"},
	{15, "8 се издигаат горите, се спуштаат долините, на места што си им ги определил."},
	{16, "9 Си поставил граница преку која нема да преминат, ниту ке се вратат да ја покријат земјата."},
	{17, "10 Си управил извори во долините: ме у горите течат води,"},
	{18, "11 ги напојуваат сите полски sверови; дивите осли ја гаснат жедта своја."},
	{19, "12 При нив живеат птици небесни, ме у камењата пуштаат глас."},
	{20, "13 Ти ги напојуваш горите од своите височини, од плодовите на Твоите дела се наситува земјата."},
	{21, "14 Ти правиш да расте трева за добитокот и растение за потреба на лу ето, за да произведат леб од земјата"},
	{22, "15 и виното што го весели срцето на човекот, и елејот од кој блеска лицето негово, и лебот што го закрепнува срцето на човекот."},
	{23, "16 Се заситуваат дрвјата по полето, кедрите ливански, што си ги посадил;"},
	{24, "17 на нив птиците си прават гнезда, елките им се живеалишта на штрковите."},
	{25, "18 Високите гори - на срните; камењата - прибежиште на зајаците."},
	{26, "19 Он ја создал месечината да ги определува времињата, сонцето го знае својот запад."},
	{27, "20 Спушташ темнина, и настанува нок: тогаш излегуваат сите горски sверови;"},
	{28, "21 лавовите рикаат за плен и бараат од Бога храна за себе."},
	{29, "22 Изгрева сонцето, а тие се собираат и легнуваат во своите легла;"},
	{30, "23 чвекот излегува по своја работи и работи до вечерта."},
	{31, "24 Колку се многубројни делата Твои, Господи! Се си направил премудро; земјата е полна со Твои созданија."},
	{32, "25 А тоа море е големо и пространо; таму се движат безброј лазачи, мали и големи животни;"},
	{33, "26 таму пловат кораби, таму е чудовиштето што си го создал да игра во него."},
	{34, "27 Сите тие од Тебе чекаат да им дадеш храна навреме."},
	{35, "28 Им даваш - примаат, ја отвораш раката Своја - се наситуваат со блага;"},
	{36, "29 го одвратиш ли лицето Свое - се збунуваат, им го одземеш ли духот нивни - умираат и во земјата своја се вракаат."},
	{37, "30 Го пракаш ли духот Свој - се создаваат; Ти го обновуваш лицето на земјата."},
	{38, "31 Нека пребива славата на Господа вечно; нека се весели Господ за делата Свои!"},
	{39, "32 Погледнува ли кон земјата, и таа се тресе; се допре ли до горите, тие се димат."},
	{40, "33 Kе му пеам на Господа преку целиот мој живот, ке му пеам на мојот Бог се додека постојам."},
	{41, "34 Нека Му биде мила беседата моја! ке се веселам во Господа."},
	{42, "35 Нека ги снема грешниците од земјата, и беззаконици да нема веке! Благословувај Го, душо моја, Господа! Алилуја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct mk15 poems[] = {
	{1, "1 Господи, кој може да престојува во Твоето живеалиште? Кој може да се настани во Твојата Света Гора?"},
	{2, "2 Оној, што оди непорочно, што врши правда и во срцето свое говори вистина."},
	{3, "3 Кој не клевети со јазикот свој, не прави зло на ближниот свој и не го навредува ближниот свој;"},
	{4, "4 ништожен е пред него оној што е злобен; Господ ги слави оние, што се бојат од Него; кој кога се колне на својот ближен, не порекнува;"},
	{5, "5 кој не го дава среброто свое со лихва и не прима поткуп против невин. Кој така постапува, нема никогаш да се поколеба."},
	{6, "1 Славете Го Господа; призивајте го Неговото име; разгласувајте ги ме у народите делата Негови."},
	{7, "2 Славете Го и пејте Му; кажувајте ги сите Негови чудеса."},
	{8, "3 Фалете се со Неговото свето име: нека се весели срцето на оние, кои Го бараат Господа."},
	{9, "4 Барајте Го Господа и утврдувајте се, барајте го секогаш лицето Негово."},
	{10, "5 Спомнувајте ги чудесата Негови, што ги направи, чудесата Негови и судовите од устата Негова,"},
	{11, "6 вие, семе Авраамово, слуги Негови, синови Јаковови, избраници Негови."},
	{12, "7 Он е Господ, Бог наш; Неговите судови се по целата земја."},
	{13, "8 Он вечно го помни заветот Свој, зборот што го заповедал во иљада родови,"},
	{14, "9 што му го ветил на Авраама, и заклетвата своја на Исака;"},
	{15, "10 и му го поставил тоа како закон на Јакова и како вечен завет на Израилот,"},
	{16, "11 велејки: 'Тебе ке ти ја дадам Хананската земја во ваше наследство.'"},
	{17, "12 Тогаш тие беа уште малку на број, многу малку, и беа придојдени во неа,"},
	{18, "13 па преминуваа од народ во народ, од едно царство кон друг народ;"},
	{19, "14 никому не му дозволуваше Он да ги навредува и царевите за нив ги караше:"},
	{20, "15 'Не допирајте се до Моите помазани, на Моиоте пророци не правете им зло!'"},
	{21, "16 И пушти глад во таа земја и секој лебен клас го сотре."},
	{22, "17 Испрати пред нив човек: како роб беше продаден Јосиф."},
	{23, "18 Ги стегнаа во вериги нозете негови; железото ја измачувало душата негова,"},
	{24, "19 додека се исполни зборот Негов: зборот Господов го оправда."},
	{25, "20 Царот прати по него, го одврзаа, кнезот над народите и го ослободи."},
	{26, "21 Го постави за домакин над домот свој и управител над сиот имот свој,"},
	{27, "22 за да ги поучува кнезовите според својата воља и старешните негови да ги учи на мудрост."},
	{28, "23 Тогаш дојде Израилот во Египет, и Јаков се всели во Хамовата земја."},
	{29, "24 Го умножи Бог многу Својот народ и го направи посилен од непријателите негови."},
	{30, "25 Се преврти срцето нивно и тие го замразија народот Негов, и почнаа да им пакостат на слугите Негови."},
	{31, "26 Го испрати Мојсеја, слугата Свој, и Арона, кого го избра."},
	{32, "27 Ти ги покажаа ме у нив зборовите на Неговите знаци и на чудесата Негови во Хамовата земја."},
	{33, "28 Испрати темнина и се смрачи, и тие не се спротивставија на зборот Негов."},
	{34, "29 Ја претвори водата нивна во крв и ја уништи рибата нивна."},
	{35, "30 Се исполни земјата нивна со жаби, дури и собите на царот нивни."},
	{36, "31 Он рече: и нападнаа песји муви и мушички по сите нивни предели."},
	{37, "32 Наместо дожд, испрати врз нив град, оган што ја гореше земјата нивна,"},
	{38, "33 и ги уништи лозјата нивни и смоквите нивни, ги сотре сите дрвја во нивните предели."},
	{39, "34 Рече и нападнаа скакулци и гасеници безброј;"},
	{40, "35 и ја изедоа сета трева по земјата нивна, ги испојадоа сите плодови на нивите нивни."},
	{41, "36 И го порази секое првородено во земјата нивна, првините од сиот нивни труд."},
	{42, "37 Ги изведе Израилците со сребро и злато, и немаше болен во племињата нивни."},
	{43, "38 Се зарадува Египет поради нивното излегување, бидејки го беше обзел страв од нив."},
	{44, "39 Им простре облак како покрив и оган, за да им свети ноке."},
	{45, "40 Бараа, и Он им прати потполошки и со леб небесен ги наситуваше."},
	{46, "41 Расцепи камен и потекоа води, потекоа како река по безводната земја,"},
	{47, "42 зашто се сети на Својот свет збор кон Авраама, Својот слуга."},
	{48, "43 па го изведе Својот народ со радост, Своите избрани - со веселба,"},
	{49, "44 и им даде незнабожечки земји, и така наследија плодови од други народи,"},
	{50, "45 за да ги чуваат наредбите Негови и да ги исполнуваат законите Негови. Алилуја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct mk16 poems[] = {
	{1, "1 Пази ме Господи, зашто на Тебе се надевам."},
	{2, "2 Му реков на Господа: 'Ти се Господ мој: моите добра Тебе не ти се потребни."},
	{3, "3 На светиите, кои се на земјата Негова, им направи многу добрини и се што сакаат да имаат."},
	{4, "4 Се намножија немокта на оние, што одат кон крвави жртви; јас нема да ги принесувам нивните крвави приливи и со устата своја нема да ги спомнам нивните имиња."},
	{5, "5 Господ е дел на моето наследство и од чашата моја. Ти си Оној Кој го воспоставува наследството мое."},
	{6, "6 Ме ите ми паднаа на најубавото; зашто наследството ми е најубаво."},
	{7, "7 Kе го благословувам Господа, Кој ме вразумува; па дури и ноке ме учи мојот внатрешен глас."},
	{8, "8 Секогаш Го гледав пред себе Господа, зашто Он е од мојата десна страна, за да не се поколебам."},
	{9, "9 Заради тоа се возрадува срцето мое, и воскликна јазикот мој; па дури и телото мое ке почива во надеж,"},
	{10, "10 оти Ти нема да ми ја оставиш душата моја во пеколот, ниту, пак, светецот Твој да види распа ање."},
	{11, "11 Ти ми ги покажа патиштата на животот: со радост ме исполнува Твоето лице; вечно блажеснтво е во Твојата десница."},
	{12, "1 Славете Го Господа, зашто е благ, зашто Неговата милост е вечна."},
	{13, "2 Кој ке ја искаже силата на Господа, кој ке ја извести сета похвала Негова?"},
	{14, "3 Блажени се оние што го чуваат законот и вршат правда во секое време."},
	{15, "4 Сети се на нас, Господи, во благоволението Свое кон Твојот народ; посети не со Твоето спасение,"},
	{16, "5 за да ги видиме во добрини Твоите избраници, за да се развеселат со веселбата на Твојот народ, за да се пофалат заедно со Твоето наследство."},
	{17, "6 Згрешивме ние со татковците наши, правевме беззаконија, вршевме неправда."},
	{18, "7 Нашите татковци во Египет не ги разбраа Твоите чудеса, не ги помнеа многуте милост Твои и се побунија кога се приближија до Црвеното Море."},
	{19, "8 Но Он ги спаси заради името Свое, за да им ја покаже силата Своја."},
	{20, "9 Му се закани на Црвеното Море, и тоа се исуши; и ги преведе по бездните како по пустиња;"},
	{21, "10 и ги спаси од рацете на оние што ги намразија и ги избави од рацете на непријателите."},
	{22, "11 Водите ги покрија нивните непријатели; не остана ниеден од нив."},
	{23, "12 И тие поверуваа на зборовите Негови и Му испеаја похвала."},
	{24, "13 Но побрзаа, ги заборавија делата Негови, не го дочекаа Неговото решение;"},
	{25, "14 се занесоа од похотливоста во пустињата, па Го искушуваа Бога во безводната земја."},
	{26, "15 Он го исполни нивното барање, он прати пораз за душите нивни."},
	{27, "16 Му позавидоа на Мојсеја во логорот и на Арона, светецот Господов."},
	{28, "17 Се отвори земјата, го голтна Датан и ја покри дружината Авиронова."},
	{29, "18 И пламна оган врз нив, и пламенот ги изгори грешниците."},
	{30, "19 Направија теле на Хорив и му се поклонија на идолот."},
	{31, "20 Ја заменија својата слава со образ на теле, што јаде трева."},
	{32, "21 Го заборавија Бога, својот Спасител, Кој изврши големи дела во Египет,"},
	{33, "22 чудесни во Хамовата земја, страшни при Црвеното Море."},
	{34, "23 И рече дека ке ги истреби, но Мојсеј, Неговиот избраник, се застапи за нив во пукнатината, за да ја отстрани јароста Негова, та да не ги погуби."},
	{35, "24 Тие ја презреа саканата земја, не Му веруваа на зборот Негов;"},
	{36, "25 и роптаа во шаторите свои, не го слушаа гласот Господов."},
	{37, "26 Он крена рака против нив, за да ги погуби во пустињата,"},
	{38, "27 да го расее нивното семе ме у народите и да ги растури по земјите."},
	{39, "28 Тие се придружија кон Ваал - Фегор и јадеа жртви, принесувани на бездушните,"},
	{40, "29 Го дразнеа Бога со делата свои, и на нив падна погибел."},
	{41, "30 Но стана Финес и Го умилостиви и поморот престана."},
	{42, "31 И тоа му се прими за правда од род во род довека."},
	{43, "32 И Го разгневија Бога при водите на расправија, кај Мерива, и Мојсеј настрада заради нив,"},
	{44, "33 зашто тие го преогорчија духот негов, и тој згреши со устата своја."},
	{45, "34 Не ги истребија народите, за кои им беше рекол Господ,"},
	{46, "35 туку се смешаа со незнабожците и свикнаа на нивните дела;"},
	{47, "36 им служеа за нивните идоли, а тоа беше соблазна за нив,"},
	{48, "37 и ги жртвуваа синовите свои и керките свои на бесовите;"},
	{49, "38 и приливаа невина крв, крвта на синовите свои и на керките свои, што им ги жртвуваа на ханаските идоли, за земјата се извалка од таа крв;"},
	{50, "39 се осквернија со делата свои, блудствуваа со постапките свои."},
	{51, "40 Се разгоре гневот на Господа против Неговиот народ, и Му омрзна налседството Негово,"},
	{52, "41 па ги предаде во рацете на непријателите и завладеаја над нив оние што ги мразеа."},
	{53, "42 Непријателите нивни ги притеснуваа, и тие се смируваа под нивната рака."},
	{54, "43 Многупати ги избавуваше, но тие Го лутеа со упорноста своја, па беа понижувани поради своите беззаконија."},
	{55, "44 Но Он погледна на нивната жалост, кога ги слушаше нивните молби,"},
	{56, "45 си спомна на Својот завет со нив, се сожали поради големата милост Своја;"},
	{57, "46 па разбуди сострадание спрема нив кај оние што ги беа заробиле."},
	{58, "47 'Спаси не, Господи, Боже наш, и собери не од незнабожците, за да го славиме Твоето свето име, да се фалиме со Твојата слава!"},
	{59, "48 Нека е благословен Господ, Бог Израилев, отсекогаш досекогаш! И сите лу е нека велат: Амин! Амин! Алилуја."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct mk17 poems[] = {
	{1, "1 Услиши ја, Господи, правдата моја, чуј го гласот на молбата моја, прими ја молитвата моја што не излегува од лажлива уста."},
	{2, "2 Од Твоето лице нека излезе судот за мене; очите мои нека ја видат вистината."},
	{3, "3 Ти го искуша срцето мое, ме посети ноке; со оган ме провери и не нејде неправда во мене."},
	{4, "4 Човечки дела нека не зборува устата моја; поради зборовите на устата Твоја чекорев по патиштата тешки."},
	{5, "5 Утврди ги стапките мои на патиштата Твои, за да не ослабнат нозете мои."},
	{6, "6 Кон Тебе викам, зашто Ти ке ме чуеш, Боже; приклони го увото Свое кон мене, и чуј ги зборовите мои."},
	{7, "7 Покажи ја чудесната милост Твоја, Ти, кој ги избавуваш оние што се надеваат на Тебе - од оние што се противат на Твојата десница."},
	{8, "8 Пази ме како зеница на окото; засолни ме под сенката на Твоите крила,"},
	{9, "9 од лицето на нечестивите, кои ме напа аат - од непријателите на душата моја, што ме опкружуваат:"},
	{10, "10 тие срцето свое го затворија, наоколу со устата своја - гордо зборуваат."},
	{11, "11 Гонејки ме, сега ме опколуваат; тие ги управија очите свои, за да ме соборат на земја;"},
	{12, "12 тие се како лав, подготвен за лов и како лавче, кое стои во потајни места."},
	{13, "13 Стани, Господи, пресретни ги и обори ги; спаси ја душата моја со Својот меч од нечестивиот;"},
	{14, "14 од оние, Господи, кои ги има малку на земјата - раздели ги во нивниот живот, и од она што е сокриено Твое ке се наполни стомакот нивни; откако се наситија синовите нивни, од вишокот оставија и за децата свои."},
	{15, "15 А јас пред лицето Твое ке се покажам во правда, ке се наситам кога ке ми се покаже славата Твоја."},
	{16, "1 Славете Го Господа, зашто е добар, зашто е вечна милоста Негова!"},
	{17, "2 Така да велат избавените од Господа, оние што ги избавил од непријателска рака."},
	{18, "3 И ги собра од земјите, од исток и од запад, од север и од морето."},
	{19, "4 Тие скитаа по безводната пустиња и нигде пат ниту населен град не најдоа;"},
	{20, "5 трпеа глад и жед, душата им ослабна во нив,"},
	{21, "6 но во жалоста своја Го повикаа Господа, и Он ги избави од нивните невољи"},
	{22, "7 и го поведе по правиот пат, за да одат кон населен град."},
	{23, "8 Нека Го слават Господа за милоста Негова и за чудесата Негови што им ги направи на синовите човечки:"},
	{24, "9 зашто Он ја насити гладната душа, и душата гладна ја исполни со блага."},
	{25, "10 Тие седеа во темнина и смртна сенка, оковани со сиромаштија и железо;"},
	{26, "11 бидејки не се покорија на зборовите Божји и се притивеа на вољата на Севишниот."},
	{27, "12 Он го понизи нивното срце во мака, се сопнаа, и немаше кој да им помогне."},
	{28, "13 Тогаш во тагата своја повикаа кон Господа, и Он ги спаси од маките нивни;"},
	{29, "14 ги изведе од темнината и смртната сенка и ги раскина оковите нивни,"},
	{30, "15 Нека го слават Господа за милоста Негова и за Неговите чудесни дела кон синовите човечки,"},
	{31, "16 зашто Он ги здроби бакарните порти и ги скриши железните резиња."},
	{32, "17 Неразумните страдаа поради своите лоши патишта и поради неправдите свои!"},
	{33, "18 Од секоја храна им се одвракаше душата, и се приближија до вратата на смртта."},
	{34, "19 Но во тагата своја повикаа кон Господа, и Он ги спаси од невољите нивни;"},
	{35, "20 го испрати Своето слово, ги излекува и ги спаси од пропаст."},
	{36, "21 Нека Го прославуват Господа за милоста Негова спрема синовите човечки!"},
	{37, "22 Нека Му принесуваат похвална жртва и нека ги разгласуваат делата Негови со радост."},
	{38, "23 Оние што тргнуваат по море на кораби, што имаат работа по големите води -"},
	{39, "24 тие ги гледаат делата на Господа и чудесата Негови во длабочините."},
	{40, "25 Он рече - и настана бурен ветер и високо ги издигна морските бранови;"},
	{41, "26 се издигаа до небесата, слегуваа до бездната; нивната присебност се губи во невољата;"},
	{42, "27 тие се збунуваат, се нишаат како пијани, и сета нивна мудрост им исчезнува."},
	{43, "28 Тогаш во скрбта своја повикаа кон Господа, и Он ги изведе од маките нивни."},
	{44, "29 И и заповеда на бурата и таа се претвори во тивок ветрец и брановите молкнаа."},
	{45, "30 Тие се развеселија, зашто стивнаа, а Он ги упати кон нивното сакано пристаниште."},
	{46, "31 Нека Го прославуваат Господа за милоста Негова и за Неговите чудесни дела спрема синовите човечки!"},
	{47, "32 Нека Го возвеличуваат со собранието народно и нека Го слават во советите на старешините!"},
	{48, "33 Он создава реки во пустиња, и водни извори - на суви места,"},
	{49, "34 земја плодородна - во солница, поради злобата на оние што живеат во неа."},
	{50, "35 Он превори пустиња во езеро, а сува земја - во земја - со водни извори;"},
	{51, "36 таму насели гладни, а тие изградија град за живеење;"},
	{52, "37 засеаја ниви, насадија лози, и тие им даваат свои плодови."},
	{53, "38 Он ги благословуваше, и тие многу се размножуваа, и добитокот нивни Он не им го намалуваше."},
	{54, "39 Тие беа проредени и пострадаа од притисокот на злото и од невољата."},
	{55, "40 Он изли бесчестие над кнезовите и ги остави да скитаат по пустињата, каде што нема патишта."},
	{56, "41 Но бедниот го извлекува од сиромаштија, го умножува родот негов како овчо стадо."},
	{57, "42 Праведните го гледаат тоа и се радуваат, а секоја нечесност си ја затвора устата своја."},
	{58, "43 Кој е мудар и го пази ова, ке ја разбере милоста Господова."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct mk18 poems[] = {
	{1, "1 Kе Те возљубам, Господи, крепост моја!"},
	{2, "2 Господ е моја тврдина и прибежиште мое, мој избавител, Бог мој, помошник мој; и ке се надевам на Него; Он е мој заштитник, сила на спасението мое и заштитник мој."},
	{3, "3 Kе Го призовувам и ке Го прославувам Господа, и ке се спасам од непријателите свои."},
	{4, "4 Смртни маки ме обзедоа, и потоци од беззаконија ме вознемирија;"},
	{5, "5 пеколни болести ме опколија, смртини стапици ме стегнаа."},
	{6, "6 Во притеснение Го повикав Господа и кон мојот Бог извикав. И Он од Својот свет храм го чу гласот мој, и мојот вик стигна до неговиот слух."},
	{7, "7 Се затресе и се разниша земјата; затреперија и од темел се поместија горите, зашто Господ се разгневи;"},
	{8, "8 се крена дим од гневот Негов и од лицето Негово оган пламна; кој проголтува се; разгорени јагнења отскокаа од Него."},
	{9, "9 Ги приклони Он небесата и слезе, - а мрак падна под нозете Негови."},
	{10, "10 И седна на херувими, па полета и се понесе на ветерни криља."},
	{11, "11 Од мракот направи Свој заклон, и сенка околу Себе - темна вода во воздушните облаци."},
	{12, "12 Од молскање бегаа од Него облаците, градот и огнените јаглења."},
	{13, "13 И загрме Господ од небесата, и Севишниот го пушти својот глас: град и разгорени јаглења."},
	{14, "14 И ги пушти стрелите Свои и ги расприсна, ги умножи молњите - и ги растури."},
	{15, "15 И се појавија извори водни, и се открија основите на вселената од страшниот глас Твој, Господи, од здивот на гневот Твој."},
	{16, "16 Он посегна од висините, и ме прифати, па ме извлече од многуте води."},
	{17, "17 А ке ме избави од силните мои непријатели и од оние кои ме мразат, од оние што се посилни од мене."},
	{18, "18 Тие се против мене во денот на мојата несрека, но Господ беше потпора моја."},
	{19, "19 Ме изведе Он на пространо место и ме избави, зашто ме засака."},
	{20, "20 Ми воздаде Господ според мојата правда, и според чистотата на моите раце ме вознагради,"},
	{21, "21 зашто ги запазив патиштата на Господа и не се оддалечив од мојот Бог;"},
	{22, "22 оти сите заповеди Негови се пред мене, и наредбите Негови не ги отстранив од себе."},
	{23, "23 Kе бидам непорочен пред Него и ке се пазам од беззаконија."},
	{24, "24 И ке ми воздаде Господ според мојата правда, и по чистотата на рацете мои пред очите Негови."},
	{25, "25 Со светиите Ти постапуваш свето, со невин човек - си благ,"},
	{26, "26 со чистиот - чисто, а со лукавиот - според неговото лукавство,"},
	{27, "27 зашто Ти ги спасуваш угнетените и гордите ке ги понизиш."},
	{28, "28 Оти Ти го осветлуваш моето светило, Господи; мојот Бог ја осветлува темнината моја;"},
	{29, "29 Ти ке ме избавиш од искушенијата, и со мојот Бог, и sид ке прескочам."},
	{30, "30 Бог мој, непорочен е Неговиот пат, Господовите зборови со оган се пречистени; Он е заштитник на сите, кое се надеваат на Него."},
	{31, "31 Зашто, кое е Бог, освен Господа, и кој е Бог освен нашиот Бог?"},
	{32, "32 Бог е Оној Кој ме препашува со сила и ми поставува непорочен пат;"},
	{33, "33 ми ги прави нозете како на елен и ме поставува на височини;"},
	{34, "34 ми ги обучува рацете за борба, и мускулите мои ги прави да затегнуваат бакарен лак."},
	{35, "35 Ти ми даде заштита за моето спасение, Твојата десница ме прифати, и Твоето воспитување ме исправи до крај; и тоа ке ме научи."},
	{36, "36 Ти ги рашируваш чекорите мои под мене, и нозете мои не се заморуваат."},
	{37, "37 Kе ги гонам непријателите мои и ке ги стигнам, и не се вракам, додека не ги победам;"},
	{38, "38 ке ги притиснам, и тие не ке можат да опстанат, ке па аат под нозете мои,"},
	{39, "39 зашто Ти ме препаша со сила за борба и ги покри пред мене оние, што станаа против мене;"},
	{40, "40 Ти ги натера во бегство непријателите мои, и ги истреби сите они, што ме мразат;"},
	{41, "41 тие повикаа, но нема кој да ги спаси: и кон Господа, - но Он не ги чу"},
	{42, "42 ке ги иситнам како прав на ветар, ке ги газам како кал по патиштата."},
	{43, "43 Kе ме избавиш од народ бунтовен, ке ме поставиш за поглавар над народ, чии чу е не познавава, и тие сега ке ми служат;"},
	{44, "44 само по слух за мене ме слушаат ту инците и ми се покоруваат;"},
	{45, "45 ту инците бледнеат и треперат, излегувајки од своите градови."},
	{46, "46 Жив е Господ, и нека е благословен мојот Бог! И нека се превознесува Бог на моето спасение."},
	{47, "47 Бог, Кој одмаздува за мене, Кој ми ги покорува народите,"},
	{48, "48 Избавител од моите гневни непријатели! Kе ме возвисиш над оние, што стануваат против мене, и ке ме избавиш од човек неправеден."},
	{49, "49 Поради тоа Те исповедам пред народите, Господи, и ке го воспевувам името Твое;"},
	{50, "50 Ти Кој величествено го спасуваш царот Свој и му правиш милост на Твојот помазаник Давида и на потомството негово - довека."},
	{51, "1 Подготвено е срцето мое, Боже, подготвено е срцето мое; ке пеам и ке воспевам во славата своја."},
	{52, "2 Разбудете се, псалтиру и гусле! Kе станам рано."},
	{53, "3 Kе Те славам, Господи, ме у народите; ке Те воспевам ме у племињата,"},
	{54, "4 зашто повисока од небото е Твојата милост, и до облаците е Твојата вистина."},
	{55, "5 Издигни се над небесата Боже, и славата Твоја нека биде по целата земја,"},
	{56, "6 за да се избават Твоите возљубени; спаси ме со Твојата десница и услиши ме."},
	{57, "7 Бог рече во своето светилиште: 'Kе се вознесам и ке го разделам Сихем и ке ја измерам долината Сокхот;"},
	{58, "8 Мој е Галад, Мој е Манасија, Ефрем е застапник на главата Моја, Јуда е Мој цар;"},
	{59, "9 Моав Ми е чаша на Мојата надеж, врз Едом ке ја испружам обувката Своја, другоплемениците Ми се покорија."},
	{60, "10 Кој ке ме воведе во укрепениот град? Кој ке ме доведе до Едом?"},
	{61, "11 Зар не си Ти, Боже, Кој не отфрли и не излегуваш, Боже, со нашите војски?"},
	{62, "12 Дај ни помош да се избавиме од маката, зашто човечката заштита е суетна."},
	{63, "13 Во Бога ке имаме сила; Он ке ги скрши непријателите наши."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct mk19 poems[] = {
	{1, "1 Небесата ја објавуваат славата на Бога, а за делата на рацете Негови известува сводот небески."},
	{2, "2 Ден на денот објавува, и нок на нокта знаење открива."},
	{3, "3 Нема јазик, ниту, пак говор, во кон не се слуша нивниот глас."},
	{4, "4 Нивниот звук се разнесува по целата земја, а нивните зборови до краиштата на вселената. На сонце го поставил Своето живеалиште;"},
	{5, "5 и излегува како младоженец од брачното легло, се радува како исполин, минувајки по патот свој:"},
	{6, "6 од крајот на небесета е излезот негов, и патувањето негово до другиот крај; ништо не е сокриено од топлината негова."},
	{7, "7 Непорочен е законот на Бога - душите ги укрепува; верно е откровението на Господа - ги учи припростите,"},
	{8, "8 и Господовите повелби се праведни - го веселат срцето; Господовата заповед зрачи светлина; ги просветлува очите."},
	{9, "9 Стравот Господов е чист - пребива довека; судовите Господови се вистина - сите се праведни;"},
	{10, "10 поскапи се од злато и од скапоцени камења - послатки се од восочен мед."},
	{11, "11 Слугата Твој ги пази; а кој ги пази голема награда добива."},
	{12, "12 Кој може да ги согледа своите грешки? И од оние тајни очисти ме,"},
	{13, "13 и од ту ите запази го слугата Твој, за да не овладеат со мене. Тогаш јас ке бидам непорочен и ке бидам очистен од големите престапи."},
	{14, "14 Зборовите на устата моја и помислите на срцето мое нека бидат благоугодни пред Тебе, Господи, помошнику мој и избавителе мој!"},
	{15, "1 Боже, похвало моја, не премолчувај,"},
	{16, "2 зашто против мене се отворени грешни и лукави усти; зборуваат со лажлив јазик против мене;"},
	{17, "3 отсекаде ме опкружуваат со злобни зборови, и без причина се собираат против мене;"},
	{18, "4 место да ме сакаат, тие стануваат против мене, а јас се молев;"},
	{19, "5 ми вракаат зло за добро, омраза - за љубов."},
	{20, "6 Постави над него грешник, и аволот да застане десно од него."},
	{21, "7 Кога ке му се суди, нека биде осуден, и молитвата негова да се прими за грев;"},
	{22, "8 дните негови да бидат кратки, а неговото достоинство друг да го земе;"},
	{23, "9 децата негови да останат сираци, а жената му - вдовица;"},
	{24, "10 децата негови да скитаат и да стана просјаци, изгонети надвор од своите домови."},
	{25, "11 заемодавецот да му земе се што има, и ту инци да го разграбаат трудот негов;"},
	{26, "12 нека нема кој да го заштити, да нема и кој да се смили над сираците негови;"},
	{27, "13 потомството негово да загине, и да се избрише името негово во следниот род;"},
	{28, "14 да биде спомнато пред Господа безаконието на татковците негови, и гревот на мајка му да не се очисти;"},
	{29, "15 тие секогаш да бидат пред очите на Господа, и да се избрише споменот нивни на земјата."},
	{30, "16 Зашто не помислил да прави милостиња, туку ги гонеше бедните, сиромасите смирените по срце, за да ги уништи;"},
	{31, "17 засакал клетва, - па таа нека го постигне: не посакал благослов, - тој нека се оддалечи од него;"},
	{32, "18 нека се облече во клетва како во облека; и таа нека влезе во него како вода, и како елеј - во неговите коски;"},
	{33, "19 та да му биде како облека, во која се облекува, и како појас, со кој секогаш се опашува."},
	{34, "20 Таква нека биде отплатата од Господа на оние што ме мразат и на оние што лошо зборуваат против душата моја."},
	{35, "21 А мене, Господи, Господи, заштити ме заради Твоето име, зашто е блага милоста Твоја; избави ме,"},
	{36, "22 оти сум беден и сиромав, и срцето мое во мене е збунето."},
	{37, "23 Исчезнував како сенка што се оддалечува; ме гонат како скакулец."},
	{38, "24 Колената ми изнемоштија од пост, а телото мое поради недостиг од масло."},
	{39, "25 Им станав за потсмев; оние што ме гледаат, нишаат со главите свои."},
	{40, "26 Помогни ми, Господи, Боже мој, спаси ме поради Твојатао милост."},
	{41, "27 и да разберат дека е тоа Твојата рака и дека, Ти, Господи, си го направил тоа."},
	{42, "28 Тие проколнуваат, а Ти, пак, благослови; и оние што стануваат против мене нека бидат посрамени, а Твојот слуга да се зарадува."},
	{43, "29 Нека се облечат во бесчестие противниците мои и како со облека да се покријат со својот срам,"},
	{44, "30 и јас со устата моја многу ке го славам Господа и ме у мнозина ке Го прославувам,"},
	{45, "31 зашто застана од мојата десна страна. За да ја спаси мојата душа од оние што ме гонат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct mk20 poems[] = {
	{1, "1 Нека те услиши Господ во тежок ден, да те заштити името на Бога Јаковов."},
	{2, "2 Да ти испрати помош од Светилиштето и од Сион да те поткрепи."},
	{3, "3 Нека си спомни за секоја твоја жртва; и сепалениците твои да бидат примени."},
	{4, "4 Да ти го даде Господ и она што ти срце сака; и сите твои помисли да ги исполни."},
	{5, "5 Kе се зарадуваме на твоето спасение и во името на нашиот Бог ке се издигнеме. Да ги исполни Господ сите твои молби."},
	{6, "6 Сега знам дека Господ го спасува Својот помазаник, го слуша од светите Свои небеса; спасението е во силата на Неговата десница."},
	{7, "7 Едни - со коли, други - со коњи, а ние со името на Господа, нашиот Бог, се фалиме:"},
	{8, "8 тие се препнаа и паднаа, а ние се кренавме и стоиме прави."},
	{9, "9 Господи, спаси го царот и услиши не кога Ти се молиме!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct mk21 poems[] = {
	{1, "1 Господи, со Твојата сила ке се весели царот и за спасението од Тебе безмерно ке се радува."},
	{2, "2 Ти му даде, она што срцето негово посака, и молбата на устата негова не ја отфрли,"},
	{3, "3 зашто Ти го пресретна со добри благослови, му возложи на главата венец со скапоцени камења."},
	{4, "4 Тој побара од Тебе живот, а Ти му даде долголетие во веки веков."},
	{5, "5 Голема е славата негова поради спасението од Тебе; Ти го покри со чест и величие."},
	{6, "6 Kе положиш на него вечен благослов, развеселувајки го со радоста на лицето Твое,"},
	{7, "7 зашто царот се надева на Господа и во милоста на Севишниот не се сомнева."},
	{8, "8 Раката Твоја ке ги најде сите Твои непријатели, десницата Твоја ке ги најде сите што Те мразат."},
	{9, "9 Кога ке се разгневиш, ке ги направиш како огнена печка; гневот Господов ке ги погуби, и оган ке ги проголта."},
	{10, "10 Ти ке го уништиш плодот нивни од земјата, и семето нивно - ме у човечките синови,"},
	{11, "11 зашто смислија против Тебе зло, се договорија, но не можеа ништо да направат."},
	{12, "12 Ти ке ги поставиш како цел, а од Твоите лакови ке пуштиш стрели во лицето нивно."},
	{13, "13 Издигни се, Господи, со Твојата сила: ние ке ја воспеваме и ке ја прославуваме Твојата мок."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct mk22 poems[] = {
	{1, "1 Боже мој, Боже мој, почуј ме; зошто ме остави? Далеку се од спасението мое зборовите со кои па ам во грев."},
	{2, "2 Боже мој! Те призивам дење - и Ти не слушаш, и ноке - и нема мир за мене."},
	{3, "3 Но Ти живееш во Светилиштето Свое - опкружен со пофалби од Израилот."},
	{4, "4 На Тебе се надеваа татковците наши; се надеваа и Ти ги избави;"},
	{5, "5 кон Тебе викаа, и се спасуваа; на Тебе се надеваа, и не се посрамија."},
	{6, "6 Јас сум црв, а не човек, потсмев за лу ето и презир во народот."},
	{7, "7 Сите, што ме гладаа, ми се подбиваа; нишајки ги главите, велеа:"},
	{8, "8 'Тој се надеваше на Господа, нека го избави, нека го спаси, ако Му е угоден.'"},
	{9, "9 Но Ти ме подигна од утробата, стана надеж моја преку млекото мајчино."},
	{10, "10 Кон Тебе сум приврзан уште од зачнувањето мое; од утробата на мајката моја Ти си мој Бог."},
	{11, "11 Не отстапувај од мене, зашто невољата е близу, а нема кој да ми помогне."},
	{12, "12 Многу телиња ме обиколија, дебели јунци ме опкружија,"},
	{13, "13 ја отворија устата против мене како лав, кој го раскинува својот плен и рика."},
	{14, "14 Јас се разлеав како вода; сите мои коски се разглобија, срцето мое стана како восок, се топи во моите гради."},
	{15, "15 Силата моја се исуши како цреп, јазикот ми се залепи за непцата, во смртоносен страв ме фрли."},
	{16, "16 Кучињата многу ме опколија, цела чета од злочинци се врти околу мене; ми ги пробија рацете и нозете."},
	{17, "17 Се броеја сите коски мои, а тие гладаа и ме презираа;"},
	{18, "18 ги разделије ме у себе слиштата мои и за облеката моја фрлија жреб."},
	{19, "19 Но Ти, Господи, не оддалечувај се од мене! Сило моја! Побрзај ми на помош!"},
	{20, "20 Избави ја од меч душата моја, и од пците еднородната моја;"},
	{21, "21 Запази ме од устите лавовски и од роговите на еднорогите, спаси ја мојата смиреност."},
	{22, "22 Kе го објавувам името Твое на браката свои, сред собранието ке Те фалам."},
	{23, "23 Вие, што се плашите од Господа, восфалете Го. Целото семе Јаковово нека Го прославува; нека се бои од Него целото семе Израилево,"},
	{24, "24 зашто Он не ја презре ниту ја одби молитвата на страдалникот, не го сокри лицето Свое од мене, а ме послуша кога Те повикав."},
	{25, "25 За Тебе е похвалата моја, во великото собрание; ке ги исполнам ветувањата свои пред оние што се плашат од Него."},
	{26, "26 Kе јадат сиромасите и ке се најадат, ке го фалат Господа оние што Го бараат; ке живеат срцата нивни довека!"},
	{27, "27 Kе се сетат и ке се обрнат кон Господа сите земни краишта, и ке се поклонат пред Тебе сите племиња на народите,"},
	{28, "28 зашто царството е на Господа, и Он е владетел над народите."},
	{29, "29 Kе јадат и ке се поконат сите силници на земјата; пред него ке паднат сите што слегуваат во земјата. А душата моја ке живее за Него."},
	{30, "30 Потомството мое ке Му служи и ке се наречува Господово довека;"},
	{31, "31 тоа ке им ја соопштува на лу ето, што ке се родат, правдата Негова, зашто сето тоа Господ го создал."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view23() {
struct mk23 poems[] = {
	{1, "1 Господ е Пастир мој, ништо нема да ми недостасува,"},
	{2, "2 Он ме пасе на плодни пасишта и ме води на тихи води,"},
	{3, "3 ја поткрепува душата моја, ме води по патот на правдата заради името Свое."},
	{4, "4 Кога би тргнал и по долината на смртната сенка, нема да се исплашам од злото, зашто Ти си со мене; Твојот жезал и Твојата палка ме успокојуваат."},
	{5, "5 Си приготвил пред мене трпеза на очиглед на непријателите мои, си ја помазал главата моја со елеј; и чашата твоја ме напојува со блаженство."},
	{6, "6 И милоста Твоја така да ме придружува преку сите денови на мојот живот, и јас ке престојувам во домот Господов многу дни."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view24() {
struct mk24 poems[] = {
	{1, "1 Господова е земјата и она што ја исполнува вселената е се што живее во неа,"},
	{2, "2 зашто Он ја основа врз морињата, и на реки ја утврди."},
	{3, "3 Кој може да излезе на гората Господова и кој ке застне на Неговото свето место?"},
	{4, "4 Оној, чии раце се невини и чие срце е чисто, кој не се колнел во душата своја напразно и не го спомнувал лажливо името Господово пред ближниот свој, -"},
	{5, "5 тој ке добие благослов од Господа и милост од Бога, Својот Спасител."},
	{6, "6 Таков е родот на оние што Го бараат Господа, кои Го бараат Бога Јаковов!"},
	{7, "7 Подигнете ги, порти, горништата свои, подигнете се, вечни порти, и ке влезе Царот на славата!"},
	{8, "8 Кој е тој Цар на славата? - Крепкиот и силниот Господ, силниот во војна Господ."},
	{9, "9 Подигнете ги, порти, горништата свои, подигнете се, вечни порти, и ке влезе Царот на славата!"},
	{10, "10 Кој е Царот на славата? - Господ над војските - Он е Цар на славата!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view25() {
struct mk25 poems[] = {
	{1, "1 Ког Тебе, Господи, ја издигнувам душата своја."},
	{2, "2 Боже мој, на Тебе се надевам, да не се посрамам довека, да не ме исмејуваат непријателите мои,"},
	{3, "3 да не се засрамат оние што се надеваат на Тебе; да се посрамат оние, што вршат беззаконија без причина."},
	{4, "4 Покажи ми ги, Господи, патиштата Твои и научи ме да врвам по патеките Твои."},
	{5, "5 Упати ме кон Твојата вистина и научи ме, зашто Ти си Бог на моето спасение; на Тебе се надевам секој ден."},
	{6, "6 Спомни Си ги штедростите Твои, Господи, и милостите Твои, зашто се вечни."},
	{7, "7 Гревовите на младоста моја и незнаењето мое не ги споменувај; по милоста Своја сети се на мене, заради Твојата доброта, Господи!"},
	{8, "8 Благ и праведен е Господ, грешниците ги изведува на пат,"},
	{9, "9 ги упатува кротките кон правда и ги учи кротките на Своите патишта."},
	{10, "10 Сите патишта Господови се милост и вистина за оние, кои го пазат заветот Негов и откровението Негово."},
	{11, "11 Заради Твоето име, Господи, прости ми го гревот мој, зашто е голем."},
	{12, "12 Кој човек е тој што се плаши од Господа? Нему Он ке му покаже кој пат да избере."},
	{13, "13 Неговата душа ке почива во добро, неговото семе ке ја наследи земјата."},
	{14, "14 Близок им е Господ на оние што се плашат од Него; ним им го открива заветот Свој."},
	{15, "15 Очите мои секогаш се кон Господа, зашто Он ги вади од стапица нозете мои."},
	{16, "16 Погледни на мене и смилуј се на мене, зашто сум самотен и во мака."},
	{17, "17 Скрбите на срцето мое се умножија; извади ме од невољите мои."},
	{18, "18 Погледај ги страдањата и маките мои, па прости ми ги сите гревови мои."},
	{19, "19 Погледај ги моите непријатели, колку многу се намножија и колку многу ме мразат."},
	{20, "20 Запази ја душата моја и избави ме, за да не се посрамам, зашто на Тебе се надевам."},
	{21, "21 Непорочноста и правдаата нејка ме учат, зашто на Тебе се надевам, Господи."},
	{22, "22 Избави го, Боже, Израилот од сите невојли негови."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view26() {
struct mk26 poems[] = {
	{1, "1 Суди ме, Господи, бидејки одев непорочно и, надевајки се на Господа, нема да се поколебам."},
	{2, "2 Искушај ме, Господи, испитај ме; отвори ги утробата моја и моето срце."},
	{3, "3 Твојата милсот е пред очите мои, а јас одам во Твојата вистина,"},
	{4, "4 со лу е суетни не седев и со престапници на законот Твој нема да отидам;"},
	{5, "5 го намразив собиралиштето на злонамерните; со нечестивите нема да седнам;"},
	{6, "6 ке ги мијам рацете свои во невиноста и ке го заобиколувам жтвеникот Твој, Господи,"},
	{7, "7 за да ја разгласувам похвалата Твоја и да ги раскажувам сите Твои чудеса."},
	{8, "8 Господи, го засакав живелиштето на Твојот дом и местото каде што пребива и славата Твоја."},
	{9, "9 Не погубувај ја душата моја со грешници и животот мој со лу е крвници,"},
	{10, "10 во чии раце има беззаконие, чија десница е полна со поткупи."},
	{11, "11 Јас, пак, одам во својата непорочност, избави ме, Господи, и помилуј ме."},
	{12, "12 Ногата моја стои на прав пат, во собранијата ке Те благословувам, Господи."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view27() {
struct mk27 poems[] = {
	{1, "1 Господ е моја светлина и мое спасение: од кого да се бојам? Господ е крепост на мојот живот, од кого ке се плашам?"},
	{2, "2 Кога се приближија до мене злобни противници и непријатели, за да го изедат телото мое, ослабнаа, се сопнаа, и паднаа."},
	{3, "3 И полк да се крене против мене, нема да се исплаши срцето мое; дури и цела војска да се дигне против мене, и тогаш ке се надевам на Него;"},
	{4, "4 само за едно Го молам Господа, само тоа го сакам: да останам во домот Господов преку сите денови на животот мој, да ја гледам Господовата убавина и да го посетувам Неговиот свет храм,"},
	{5, "5 зашто во злочест ден Он би ме сокрил во Својата скинија, би ме сокрил под покривот на своето живеалиште; би ме искачил на карпа."},
	{6, "6 Тогаш главата моја ке се издигне над непријателите што ме опкужуваат; и јас ке принесам во скинијата Негова жртва поради радоста, па ке пеам и ке го фалам Господа."},
	{7, "7 Чуј го, Господи, гласот мој, бидејки кон Тебе викам помилуј ме и услиши ме."},
	{8, "8 Срцето мое ги повторува Твоите зборови: - Барај го лицето Мое; и јас го барам лицето Твое, Господи."},
	{9, "9 Не сокривај го од мене лицето Свое; не го одбивај во гневот слугата Твој. Биди мој помошник; не отфрлувај ме и не ме оставај, Боже, Спасителе мој!"},
	{10, "10 Зошто татко ми и мајка ми ме оставија, но Господ ме прими."},
	{11, "11 Научи ме, Господи, на Твојот пат и упати ме по патеката на правдата, поради непријателите мои;"},
	{12, "12 не ме предавај на своеволноста на непријателите, зашто востанаа против мене лажни сведоци и дишат злоба."},
	{13, "13 Но јас верувам, дека ке ја видам Господовата благост во земјата на живите."},
	{14, "14 Надевај се на Господа, биди мажествен; нека е цврсто срцето твое; надевај се на Господа."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view28() {
struct mk28 poems[] = {
	{1, "1 Кон Тебе, Господи, викам; не биди безгласен кон мене, та да не заприлегам при Твоето молчење на оној што слегува во гроб."},
	{2, "2 Чуј го гласот на молитвите мои, кога Ти се молам, кога кревам раце кон Твојот свет храм."},
	{3, "3 Не вбројувај ме ме у нечестивци и злосторници, кои со ближните свои говорат за мир, а во срцето имаат зло."},
	{4, "4 Подај им, Господи, според нивните дела, според нивните лоши постапки; според делата на нивните раце, подај им го она што го заслужиле."},
	{5, "5 Зашто не ги разбраа делата на Господа, ниту делата на рацете Негови; Он ке ги сосипе и нема да ги подигне."},
	{6, "6 Благословен Господ, зашто Он го чу гласот на молитвите мои."},
	{7, "7 Господ е крепост моја и штит мој; на Него се надеваше срцето мое и Он ми помогна; затоа се зарадува срцето мое и Јас ке го прославувам со сето мое срце."},
	{8, "8 Господ е крепост на Својот народ и заштитник за спасението на Својот помазаник."},
	{9, "9 Спаси го народот Свој и благослови го наследството Твое; паси ги и издигај ги довека!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view29() {
struct mk29 poems[] = {
	{1, "1 Принесете Му на Господа, синови Божји, принесете Му на Господа јаганца, принесете Му на Господа слава и чест,"},
	{2, "2 принесете Му слава на Господа и на името Негово, поклонете Му се на Господа во Неговиот свет двор."},
	{3, "3 Гласот Господов е над водите; Бог на славата загрми, Господ е над многу води."},
	{4, "4 Гласот Господов е во силата, гласот Господов е во велелепието."},
	{5, "5 Гласот Господов крши кедри; ке ги скрши Господ кедрите ливански,"},
	{6, "6 и направи како теле да потскокнува Ливан, а Сирион - како младо биволче."},
	{7, "7 Гласот Господов сече како огнен пламен."},
	{8, "8 Гласот Господов ја потресува пустињата; ке ја затресе Господ пустињата Кадес."},
	{9, "9 Гласот Господов ги ослободува бремените кошути и ги оголува горите; и во храмот Негов секој ја возвестува славата Негова."},
	{10, "10 Господ седи на престолот над потопот, и ке седи Господ како цар довека."},
	{11, "11 Господ ке му даде сила на Својот народ, Госод со мир ке го благослови народот Свој."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view30() {
struct mk30 poems[] = {
	{1, "1 Kе Те вознесувам, Господи, затоа што ме прифати и не допушти непријателите мои да се радуваат над мене."},
	{2, "2 Господи, Боже мој, повикам кон Тебе, и Ти ме исцели."},
	{3, "3 Господи, Ти ја изведе душата моја од пеколот и ме спаси од оние што слегуваат во гроб."},
	{4, "4 Пејте Му на Господа, праведници Негови, и исповедајте Го, секавајки се на Неговата светост,"},
	{5, "5 зашто гневот Му е во јароста Негова, а животот - во милоста Негова: навечер настанува плач, а изутрина голема радост."},
	{6, "6 И јас си реков во изобилието мое: 'Нема да се поколебам довека.'"},
	{7, "7 Господи, според вољата Твоја подај и на добрината моја сила; но Ти го сокри лицето Свое, и јас се збунив."},
	{8, "8 Тогаш кон Тебе, Господи, повикав и не мојот Бог, му се помолив:"},
	{9, "9 'Каква полза од крвта моја, кога ке слезам во гроб? Kе ја исповеда ли правот, ке ја објави ли тој вистината Твоја?'"},
	{10, "10 Му услиши Господ, и ме помилува, и Господ стана помошник мој."},
	{11, "11 Ти ја претвори тагата моја во радост, го симна од мене костретот и ме препаша со веселба,"},
	{12, "12 за да Те слави душата моја и да не замолкнам; Господи, Боже мој, вечно ке те славам!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view31() {
struct mk31 poems[] = {
	{1, "1 На Тебе, Господи, се надевам, за да не се посрамам довека; поради правдата Своја спаси ме и очисти ме."},
	{2, "2 Приклони го увото Твое кон мене, побрзај да ме избавиш. Биди ми Бог заштитник и прибежиште, за да се спасам."},
	{3, "3 Зашто Ти си крепост моја и прибежиште мое, заради името Твое поведи ме и управувај со мене."},
	{4, "4 Изведи ме од оваа стапица, која потајно ми ја поставија, зашто Ти си мој заштитник."},
	{5, "5 Во Твоите раце го предавам духот свој; Ти си ме спасувал, Господи, Боже на вистината."},
	{6, "6 Не ти се мили оние што пазат суетни работи, но јас се надевав на Господа."},
	{7, "7 Kе се радувам и ке се веселам поради Твојата милост, зашто Ти погледна на смиреноста моја и ја спаси од мака душата моја,"},
	{8, "8 и не ме предаде во рацете не непријателите мои; нозете мои ми ги постави на чистина."},
	{9, "9 Помилуј ме, Господи, зашто сум притеснет од скрб: се помрачија во јароста окото мое, душата моја и утробата моја."},
	{10, "10 Премале од жал животот мој, и годините мои - од воздишки; изнеможе силата моја, и страв во коските мои ме опфати."},
	{11, "11 Пред сите непријатели мои станав за прекор, дури и пред соседите мои, а и плашило за познатите мои; оние што ке ме видат на пат, бегаат од мене."},
	{12, "12 Заборавен како мртовец сум во срцата на лу ето; станав како скршен сад,"},
	{13, "13 биедејки чув дека мнозина околу мене погубно шетаат, и кога ке се соберат заедно, се договораат и душата моја да ми ја одземат."},
	{14, "14 Јас, пак, се надевам на Тебе, Господи, и си реков: Ти си мој Бог."},
	{15, "15 Дните мои се во Твоите раце; избави ме од рацете на непријателите мои и од гонителите мои."},
	{16, "16 Нека засветли лицето Твое над слугата Твој; спаси ме со Твојата милост."},
	{17, "17 Господи, не допушти да се посрамам, поради тоа што кон Тебе повикав; нечестивите нека се посрамат и нека замолкнат во пеколот."},
	{18, "18 Да онемеат лажливите усти, што говорат лошо против праведникот со гордост и презрение."},
	{19, "19 Колку е голема добрината Твоја, Господи, што си ја запазил за оние, кои се бојат од Тебе, и што си ја приготвил за оние, кои се надеваат на Тебе пред синовите човечки!"},
	{20, "20 Kе ги сокриеш под покривот на лицето Свое од човечките возбуди, ке ги заклониш од нападите на јазиците противнички."},
	{21, "21 Нека е благословен Господ, зашто ја пројави кон мене Својата чудесна милост во утврдениот град!"},
	{22, "22 Во малодушноста своја си реков: отфрлен сум од очите Твои; но Ти ги услиши гласот на молитвата моја, кога повикав кон Тебе."},
	{23, "23 Сакајте Го Господа, сите праведници Негови, зашто Господ бара вистина и им отплатува на оние, кои премногу гордо постапуваат."},
	{24, "24 Вие сите бидете силни и нека крепне срцето ваше што се надевате на Господа!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view32() {
struct mk32 poems[] = {
	{1, "1 Блажени се оние, чии беззаконија им се простени, и чии гревови се покриени!"},
	{2, "2 Блажен е оној човек, на кого Господ не му зема за грев, и во чија уста нема лукавство!"},
	{3, "3 Затоа што замолкнав, се исушија коските мои од секојдневното мое воздишување,"},
	{4, "4 бидејки и дење и ноке тежеше над мене раката Твоја, копнеев како на летен припек."},
	{5, "5 Но јас го познав гревот мој и не го сокрив беззаконието свое, па реков: 'Kе ги исповедам на Господа моите престапи,' и Ти ми го прости гревот мој."},
	{6, "6 Затоа секој праведник нека Ти се помоли навреме, и тогаш притисокот од многуте води нема да го достигне."},
	{7, "7 Ти си мое прибежиште од маката со која сум опкружен; радост моја голема, спаси ме од оние кои ме опколија."},
	{8, "8 'Kе те вразумам,' - вели Бог - 'ке ти го покажам патот, по кој да одиш; ке ги управувам очите Мои на тебе.'"},
	{9, "9 'Не бивајте како коњ или како маска, кои немаат разум, чија челуст со узда и оглавник се скротува за да ти се покоруваат.'"},
	{10, "10 Многу маки ке го снајдат грешникот, но оној кој се надева на Господа, него милост ке го опкружува."},
	{11, "11 Веселете се во Господа и радувајте се, праведници: радувајте се сите кое сте со чисти срца."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view33() {
struct mk33 poems[] = {
	{1, "1 Радувајте се, праведници, во Господа: на праведниците им прилега похвала."},
	{2, "2 Славете Го Господа со гусли, пејте Му на псалтир со десет жици,"},
	{3, "3 пејте Му нова песна; пејте Му силно и со восклик,"},
	{4, "4 зашто словото на Господа е право, и сите дела Негови се вистински."},
	{5, "5 Он сака милостиња и суд преведен; со милоста Господова е исполнета земјата."},
	{6, "6 Преку словото на Господа се зацврстија небесата, и преку Духот на устата Негова - сите сили нивни."},
	{7, "7 Он ги собира како во мев морските води; бездните ги става во сокровишта."},
	{8, "8 Нека се бои од Господа целата земја; нека треперат пред Него сите жители во вселената,"},
	{9, "9 зашто Он рече и тие настанаа; Он заповеда и се создадоа."},
	{10, "10 Господ ги руши помислите на незнабошците, ги спречува намерите нивни и ги сопира помислите на кнезовите."},
	{11, "11 А замислата Господова вечно постои; мислите на срцето Негово преминуваат од род во род."},
	{12, "12 Блажен е оној народ, на кој Господ му е Бог, и лу ето, кои Он ги избрал за наследството Свое."},
	{13, "13 Од небесата погледа Господ, ги виде сите синови човечки;"},
	{14, "14 од престолот, на кој седи, погледна на сите, кои живеат по земјата:"},
	{15, "15 Он, Кој на сите ним им ги создал срцата, ги знае сите дела нивни."},
	{16, "16 Не го спасува царот голема војска; голема сила ни исполинот нема да го спаси."},
	{17, "17 Несигурен е коњот за спасување, со глемата сила своја не може никогаш да се избави."},
	{18, "18 Но, ете, очите Господови се врз оние, кои се бојат од Него и кои се надеваат на милоста Негова,"},
	{19, "19 дека Он ке ја спаси душата нивна од смрт и во време на глад ке ги прехрани."},
	{20, "20 Душата наша се надева на Господа: зашто Он е наш помошник и наш заштитник,"},
	{21, "21 зашто во Него ке се весели срцето наше; оти на името Негово свето се надеваме."},
	{22, "22 Милоста Твоја нека биде над нас, Господи, онака како што Ти се надеваме."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view34() {
struct mk34 poems[] = {
	{1, "1 Kе го благословувам Господа во секое време; похвала за Него секогаш има во мојата уста."},
	{2, "2 Со Господа ке се фали душата моја! Нека го чујат тоа кротките и нека се зарадуваат."},
	{3, "3 Возвеличете Го Господа со мене, и заедно да го превознесуваме името Негово."},
	{4, "4 Го побарав Господа, и Он ме чу и од сите опасности мои ме избави."},
	{5, "5 Пристапете Му и ке се просветите, и лицата ваши нема да се посрамат."},
	{6, "6 Кога несрекниот вика, - Господ го услишува и го спасува од сите негови беди."},
	{7, "7 Ангел Господов застанува околу оние, кои се бојат од Него, и ги спасува."},
	{8, "8 Вкусете и ке видите, колку е благ Господ! Блажен е оној човек, кој на Него се надева!"},
	{9, "9 Бојте се од Господа, сите праведници Негови, зашто ништо нема да им недостига на оние кои се плашат од Него."},
	{10, "10 Осиромешеа и огладнеа богатите, а оние што Го побараа Господа, не ке бидат лишени од секакви добра."},
	{11, "11 Дојдете, чеда, послушајте ме: јас ке ве научам да се боите од Господа."},
	{12, "12 Сака ли човек да живее и да види добри денови,"},
	{13, "13 нека си го воздржува јазикот од зло и устата своја од лаги,"},
	{14, "14 нека се клони од зло и нека прави добро; да бара мир и да врви по него."},
	{15, "15 Очите на Господа се обрнати кон праведниците, и ушите Негови - кон молитвите нивни."},
	{16, "16 Но лицето на Господа и против оние што вршат зло; ке го истреби од земјата споменот за нив."},
	{17, "17 Повикаа праведниците, и Господ ги услиши и ги спаси од сите маки нивни."},
	{18, "18 Блиску е Господ до оние со скрушено срце, и смирените по дух ке ги спаси."},
	{19, "19 Бројни се маките на праведниците, но од сите нив Господ ке ги избави."},
	{20, "20 Господ ги чува сите коски нивни; ниедна од нив нема да се строши."},
	{21, "21 Зла смрт го снао а грешникот, а оние, што го мразат праведниот, ке загинат."},
	{22, "22 Господ ке ги спаси душите на слугите Свои, и никој од оние, кои се надеваат на Него, нема да погрешат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view35() {
struct mk35 poems[] = {
	{1, "1 Пресуди им, Господи, на оние кои ме навредуваат, и собори ги оние што се борат против мене;"},
	{2, "2 зами оружје и штит и дојди ми на помош;"},
	{3, "3 извади го мечот и пресретни ги гонителите мои; кажи и на душата моја: 'Јас сум спасение Твое!'"},
	{4, "4 Да се постидат и засрамат оние што ја бараат душата моја: нека се повратат и нека се посрамат, оние што ми мислат зло;"},
	{5, "5 нека бидат како прав пред ветрот, и Ангел Господов да ги прогонува,"},
	{6, "6 патот нивни нека биде темен и лизгав, и Ангел Господов да ги прогонува,"},
	{7, "7 бидејки без вина поставија тајна мрежа за моја пропаст, без вина ја навредија душата моја."},
	{8, "8 Нека дојде врз нив замка што не ја знаат и мрежата нивна, што ја поставија за мене, да ги улови самите нив; нека се сплеткаат во неа и нека загинат."},
	{9, "9 А мојата душа ке се радува во Господа, ке се весели поради спасението од Него."},
	{10, "10 Сите коски мои ке речат: 'Господи, кој е подобен на Тебе, Кој спасуваш слаб од силен, беден и сиромав од грабителите нивни?'"},
	{11, "11 Се кренаа против мене неправедни сведоци: и за она што не го знам ме сослушуваат;"},
	{12, "12 ми вракаат зло за добро, и душата моја останува осамена."},
	{13, "13 А кога ми додеваа, јас се облекував во кострет, ја истоштував душата моја со пост, и молитвата ми се вракаше во градите мои."},
	{14, "14 Постапував така, како тој да беше ближен мој, мој брат; одев тажен со наведната глава; како оној што е загрижен и нажален, така се смирував."},
	{15, "15 А тие се зарадуваа и се собраа против мене, ми задаваа рани, а да не знам зошто, ме кинеа и не престануваа;"},
	{16, "16 ме доведоа до искушение, ми се потсмеваа многу и со забите свои крцкаа против мене."},
	{17, "17 О, Господи, кога ке го погледаш тоа? Оттргни ја душата моја од нивните злодела, мојата осамена душа - од тие лавови."},
	{18, "18 Kе Те прославувам, Господи, на големо собрание, ме у многуброен народ ке Те восфалувам;"},
	{19, "19 не допушти да се зарадуваат над мене оние, кои ми се непријатели без причина, кои ме мразат без вина и намигнуваат со очите."},
	{20, "20 Зашто за мир ми зборуваа тие, а во лутината своја смислуваа измами."},
	{21, "21 Ги отворија устите свои против мене, велејки: 'Добро! Добро! Очите наши видоа.'"},
	{22, "22 Ти виде Госоди, немој да премолчиш; Господи, не отстапувај од мене!"},
	{23, "23 Стани, разбуди се поради мојата правда, о Боже мој и Господи мој!"},
	{24, "24 Пресуди ми според Твојата правда, Господи, Боже мој, та да не ликуваат оние над мене;"},
	{25, "25 за да не речат во срцето свои: 'Добро, добро за душата наша!' и да не кажат: 'го проголтавме.'"},
	{26, "26 Нека се постидат и засрамат сите, кои се радуваат на мојата несрека; да се облчат во срам и позор, оние што се гордеат над мене."},
	{27, "27 Нека се зарадуваат и нека се развеселат, оние што ја сакаат мојата правда, и непрестајно нека велат: да се возвеличи Господ, Кој му пожелува мир на Својот слуга!"},
	{28, "28 И јазикот мој ке зборува за правдата Твоја и за Твојата похвала секој ден."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view36() {
struct mk36 poems[] = {
	{1, "1 Беззаконикот зборува во себеси - дека греши, нема страв Божји пред очите негови,"},
	{2, "2 зашто тој се залажува себеси, место да го увиди своето беззааконие и да го намрази;"},
	{3, "3 зборовите на устата негова се неправда и лукавство; тој не сака да се вразуми, и да врши добро;"},
	{4, "4 на леглото свое си помислува беззконие, поа а на лош пат, од зло не се гнаси."},
	{5, "5 Господи, Твојата милост е на небесата, Твојата вистина - до облаците!"},
	{6, "6 Твојата праведност е како горите Божји, а судовите Твои како голема бездна! И лу е и добиток ке спасиш Ти, Господи!"},
	{7, "7 О колку обилно си ја пројавил Твојата милост, Боже! Синовите човечки ке се надеваат под Твојата закрила;"},
	{8, "8 тие ке се наситат од изобилието на Твојот дом, и од потокот на Твојата красота ке ги напојуваш;"},
	{9, "9 зашто во Тебе е изворот на животот: во Твојата светлина ке гледаме светлина."},
	{10, "10 Покажи ја милоста Своја кон оние кои Те познаваат, и правдата Своја кон оние со чисто срце;"},
	{11, "11 да не ме згази ногата горда, и раката на грешникот да не ме поколеба."},
	{12, "12 Таму паднаа они, што вршат беззаконие; соборени се и не можат веке да станат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view37() {
struct mk37 poems[] = {
	{1, "1 Не жести се поради злобниците и не завидувај им на оние што вршат беззаконие,"},
	{2, "2 зашто тие ке се исушат како трева, и како зелено растение набргу ке свенат."},
	{3, "3 Надевај се на Господа и прави добро; живеј на земјата и таа ке те храни изобилно."},
	{4, "4 Утешувај се со Господа, и Он ке ти даде срцето срцето твое што ке посака."},
	{5, "5 Откриј го патот свој пред Господа и на Него надевај се и Он ке изврши се;"},
	{6, "6 и ке ја изведе правдата твоја како светлина, и справедливоста твоја - како пладне."},
	{7, "7 Покори Му се на Господа и моли Го усрдно. Не жести се на оној, кој успева на патот свој, на човек кој врши беззаконие."},
	{8, "8 Престани да се гневиш и остави ја јароста, не жести се толку многу - самиот да не правиш зло,"},
	{9, "9 зашто оние, што вршат зло, ке бидат истребени, а оние, кои се надеваат на Господа, ке ја наследат земјата."},
	{10, "10 Уште малку, и грешникот ке го нема; ке го побараш местото негово и нема да го најдеш."},
	{11, "11 А кротките ке ја наследат земјата и ке се насладуваат во изобилен мир."},
	{12, "12 Грешникот ке демнее на праведниот и ке чкрта со забите против него,"},
	{13, "13 но Господ ке го измее, зашто однапред гледа, дека му се ближи крајот."},
	{14, "14 Грешниците ги вадат мачевите, го оптегнуваат лакот свој, за да го кутнат бедниот и сиромавиот, за да ги прободат оние, што се со чисто срце."},
	{15, "15 Но мечот нивни нека се забие во нивното срце, и лаковите нивни нека се скршат."},
	{16, "16 Малото богатство кај праведниот е многу подобро отколку големото богатство на грешниците."},
	{17, "17 Зашто мишките на грешниците ке спласнат, а на праведниците Господ им ги поткрепува."},
	{18, "18 Господ ги знае патиштата на непорочните; и нивното наследство ке биде вечно:"},
	{19, "19 во зло време нема да бидат посрамени и во деновите на глад ке бидат сити;"},
	{20, "20 зашто грешниците ке загинат, и непријателите Господови ке ги снема заедно со нивната слава и величие; ке исчезнат како дим."},
	{21, "21 Грешникот зема на заем и не може да врати, а праведникот е милостив и дава,"},
	{22, "22 зашто оние, кои Господа Го благословуваат, ке ја наследат земјата, а кои Го проколнуваат, ке бидат истребени."},
	{23, "23 Господ ги завцрстува стапките на човекот и мили Му се неговите патишта:"},
	{24, "24 кога треба да падне, нема да се разбие, зашто Господ ке го држи."},
	{25, "25 Бев млад, веке остарев, и не видов оставен праведник ниту потомците негови леб да просат;"},
	{26, "26 тој секој ден знае да се смилува и на заем да дава, и потомството негово ке биде благословено."},
	{27, "27 клони се од зло и прави добро, па ке живееш вечно;"},
	{28, "28 зашто Господ ја сака правдата и не ги остава преведниците Свои; нив вечно ке ги чува. А беззакониците ке бидат исфрлени и потомството на безбожниците ке биде истребено."},
	{29, "29 Праведниците ке ја наследат земјата и ке живеат на неа вечно."},
	{30, "30 Устата на праведникот кажува мудрост, а јазикот негов изговара правда."},
	{31, "31 Законот на неговиот Бог е во срцето негово; стапките негови нема да се сопнат;"},
	{32, "32 греникот го демне праведикот и бара да го убие;"},
	{33, "33 но Господ нема да го предаде во негови раце и нема да го осуди, кога ке биде суден."},
	{34, "34 Надевај се на Господа и пази ги Неговите патишта; Он ке те воздигне, за да ја наследиш земјата; и ке го гледаш истребувањето на грешниците."},
	{35, "35 Видов страшен безбожник, кој се превознесуваше и издигаше како кедрите ливански."},
	{36, "36 Поминав и, ете, го нема; го побарав, и не го најдов."},
	{37, "37 Чувај ја незлобивоста и пази ја правдата, зашто наследството на таков човек е мир;"},
	{38, "38 а безбожниците сите ке бидат истребени, нивното наследство ке се затре."},
	{39, "39 Спасението, пак, на праведниците доа а од Господа и Он е нивни заштитник во тешко време;"},
	{40, "40 и ке им помага Господ и ке ги избави; ке ги одбере од грениците и ке ги запази, зашто на него се надеваат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view38() {
struct mk38 poems[] = {
	{1, "1 Господи, во јароста Своја не карај ме и во гневот Свој не казнувај ме,"},
	{2, "2 зашто стрелите Твое се забија во мене, и Твојата рака тежи врз мене,"},
	{3, "3 За телото мое нема лек од Твојот гнев; во коските мои нема мир од гревовите мои;"},
	{4, "4 зашто беззаконијата мои ја навдвишија главата моја, како тешко бреме ме притиснаа."},
	{5, "5 Смрдат и гнијат раните мои поради безумието мое."},
	{6, "6 Настрадав и се стопив сосема, цел ден натажен одам;"},
	{7, "7 бидејки одвнатре горам од оган, нема лек за телото мое."},
	{8, "8 Озлобен сум и прекумерно понизен; рикав поради воздишките на срцето Мое."},
	{9, "9 Господи, пред Тебе се сите мои желби, и мојата воздишка не е сокриена од Тебе."},
	{10, "10 Срцето ми се возбуди, и ме напушти силата моја, и светлината на очите мои, - и неа ја нема во мене."},
	{11, "11 Моите пријатели и моите ближни се приближија и не се доближија; застанаа подалеку од мене,"},
	{12, "12 а оние што ја бараа душата моја, зборуваа лошо и без основа и секој ден кроеја сплетки;"},
	{13, "13 а јас, пак, како глув не слушав и сум како нем, кој не ја отвора устата своја;"},
	{14, "14 станав како човек, што не слуша и што во устата своја нема прекор,"},
	{15, "15 зашто на Тебе, Господи, се надевав; Ти ке ме услишиш, Господи, Боже мој."},
	{16, "16 Оти си реков: да не се погордеат над мене моите неприајтели; и кога ми се поколебаа нозете мои, тие изговорија лоши зборови над мене."},
	{17, "17 Готов сум да паднам, и јадот мој секогаш е пред мене."},
	{18, "18 Беззаконието свое го признавам и ке се смирувам поради гревот мој."},
	{19, "19 А непријателите мои живеат и се посилни стануваат од мене, и се намножија оние што неправедно ме мразат,"},
	{20, "20 па вракајки ми зло за добро, бидејки бев за правда, тие ме отфрлија како мртовец."},
	{21, "21 Не оставај ме, Господи, Боже мој, не отстапувај од мене;"},
	{22, "22 побрзај да ми помогнеш, Господи, Спасителе мој!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view39() {
struct mk39 poems[] = {
	{1, "1 Си реков: ке пазам на патиштата мои, за да не згрешам со јазикот свој; се погрижив устата моја да е претпазлива додека е грешникот пред мене."},
	{2, "2 Онемев и се смирив, и замолкнав дури и за доброто; и јадот мој се обнови."},
	{3, "3 Пламна срцето мое во мене и додека размислувам оган ке се разгори во мислите мои. Проговорив со јазикот свој:"},
	{4, "4 кажи ми го, Господи, мојот крај, и колкав е бројот на моите дни, за да знам колку сум ништожен."},
	{5, "5 Ете, Ти си ми дал дни колку една педа, и векот мој е како ништо пред Тебе. И навистина, се е суета, секој човек што живее."},
	{6, "6 Навистина, човек оди како сенка и залудно се возбудува; собира богатство, а не знае кому ке му го остави."},
	{7, "7 И сега што да очекувам? Зар надежта не е во Тебе, Господи?"},
	{8, "8 Спаси ме од сите беззаконија; си допуштил да бидам поруга на безумниот."},
	{9, "9 Занемев и не ја отворив устата, зашто Ти ме создаде."},
	{10, "10 Отстрани ги од мене ударите Твои, изнемоштувам од Твојата силна рака."},
	{11, "11 Преку казни заради беззаконија си го воспитал човекот и душата негова си ја расточила како пајажина. И залудно се возбудува секој човек."},
	{12, "12 Услиши ја, Господи, молитвата моја и почуј ја молбата моја; не биди безгласен како моите солзи, зашто сум ту во Тебе и придојден, како сите мои татковци."},
	{13, "13 Допушти ми да здивнам, пред да заминам и да ме нема веке."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view40() {
struct mk40 poems[] = {
	{1, "1 Долго време се надевав на Господа, и Он се наклони над мене и ја чу молитвата моја,"},
	{2, "2 и ме изведе од длабината на јадот и од длабока тиња, па ги постави нозете мои на камен и ги зацврсти стапалата мои;"},
	{3, "3 а во устата моја вложи нова песна - похвала на нашиот Бог. Мнозина ке видат, и страв ке ги опфати и ке се надеваат на Господа."},
	{4, "4 Блажен е оној човек, чија надеж е името на Господа и не се загледува во ништожни работи и лажни воодушевувања."},
	{5, "5 Многу чудесни дела си направил. Господи, Боже мој, и по многуте мисли Твои кој може да се спореди со Тебе! Почнав да ги објавувам и да зборувам со нив, но тие број немаат."},
	{6, "6 Жртви и приноси Ти не побара, но телото ни го подготви; сепаленица и жртва за грев Ти не побара."},
	{7, "7 Тогаш реков; еве, идам; во книгата за мене е напишано;"},
	{8, "8 одлучив да ја исполнам вољата Твоја, Боже мој; и Твојот закон е во срцето мое."},
	{9, "9 ја објавувам Твојата правда во големото собрание; не и бранев на устата моја; Ти го знаеш тоа, Господи."},
	{10, "10 Твојата правда не ја сокрив во срцето мое, ја објавив вистината Твоја и спасението Твое; и не је затаив Твојата милост и Твојата вистина од собранието."},
	{11, "11 Но, Господи, не отстранувај го милосрдието Твое од мене; Твојата милост и Твојата вистина ме пазеа постојано,"},
	{12, "12 зашто зла безбројни ме опкружија; ме притиснаа беззаконијата мои, и не можев дури ни да гледам, - тие се повеке од влакната на главата моја; а и срцето мое ме остави."},
	{13, "13 Благоволи, Господи, да ме избавиш; Господи, побрзај ми на помош."},
	{14, "14 Нека се засрамат и нека поцрвенат сите, кои бараат да ја погубат душата моја! Нека бидат вратени назад и нека бидат предадени на потсмев оние, кои ми сакаат зло."},
	{15, "15 Веднаш да си го понесат својот срам оние, кои сакајки да ми се наругаат велат: 'Добро, добро!'"},
	{16, "16 Нека се зарадуваат и нека се развеселат во Тебе сите, кои Те бараат, и оние што сакаат спасение од Тебе непрестајно нека зборуваат: велик е, велик - Господ!"},
	{17, "17 А јас сум сиромав и беден; Господ ке се грижи за мене. Ти си помошник мој и заштитник мој, Боже мој, не задоцнувај."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view41() {
struct mk41 poems[] = {
	{1, "1 Блажен е оној, што ги прегледува бедните и сиромасите! Во злочест ден Господ ке го избави."},
	{2, "2 Господ нека го запази и нека го заштити и ублажи животот негов на земјата; и да не го предаде во рацете на непријателот негов."},
	{3, "3 Господ нека му помогне кога лежи болен в постела. Ти ја изменуваш целата постела негова при болеста негова."},
	{4, "4 Реков: 'Господи, смилуј се на мене, излекувај ја душата моја, зашто згрешив пред Тебе.'"},
	{5, "5 Непријателите мои зборуваат лошо за мене: 'Кога ке умре, и кога ке загине името негово?'"},
	{6, "6 И ако некој дојде да ме види, говори лага; неговото срце собира неправда во себе, и тој, штом ке излезе надвор, расправа."},
	{7, "7 Сите мои непријатели шепотат ме у себе против мене, помислувајки ми зло:"},
	{8, "8 'За законопрестапен збор ме набедија; кој еднаш легне веке нема да стане.'"},
	{9, "9 Дури и човекот, кој беше во мир со мене и на кого се надевав, кој јадеше мој леб, ја крена ногата против мене."},
	{10, "10 А Ти, Господи, помилуј ме, исправи ме, та да им возвратам."},
	{11, "11 По тоа ке дознаам, дека сум ти мил, кога непријателот мој нема да се погордее над мене;"},
	{12, "12 а мене, пак, ме прифати цел поради мојата незлобивост и ме зацрсти пред Себе вечно."},
	{13, "13 Нека е благословен Господ, Бог Израилев, од века до век! Амин, амин!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view42() {
struct mk42 poems[] = {
	{1, "1 Како што кошутата жеднее по водни извори, така и душата моја, Боже, копнее по Тебе!"},
	{2, "2 Душата моја жедува за силниот и живиот Бог: кога ке дојдам и ке се јавам пред лицето Божјо?"},
	{3, "3 Солзите мои беа леб за мене и дење и ноке, кога секој ден ми зборуваа: каде е твојот Бог?"},
	{4, "4 Се сетив на тоа и ја излив душата своја, зашто ке поминам низ места каде што е чудесната скинија - до Божјиот дом - при гласно воскликнување и прославување, како на голем празник."},
	{5, "5 Зошто тагуваш, душо моја, и зошто толку ме вознемируваш? Надевај се на Бога, бидејки јас не Него се надевам, мојот Бог е мое спасение."},
	{6, "6 Се возбуди душата моја во мене, поради тоа ке си спомнувам на Тебе до земјата Јорданска, од Ермон и од гората мала."},
	{7, "7 Бездна повикува бездна со гласот на Твоите водопади; сите Твои води и Твои бранови навалија на мене."},
	{8, "8 Дење Господ ке ја покажува милоста Своја, а јас ноке ке Му пеам и ке Му се молам на Бога на мојот живот."},
	{9, "9 Kе му речам на Бога: Ти си мој застапник. Зошто ме заборави? Зошто одам нажален додека непријателот ме притискува?"},
	{10, "10 Трошејки ги коските мои, непријателите мои се подигруваат со мене, велејки ми секој ден: каде е твојот Бог?"},
	{11, "11 Зошто тагуваш, душо моја, и зошто ме вознемируваш? Надевај се на Бога, бидејки Него јас пак ке Го прославувам, мојот Бог е моето спасение."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view43() {
struct mk43 poems[] = {
	{1, "1 Пресуди ми, Боже, и расправи ја тужбата моја против народот кој не е свет. Избави ме од неправеден и лукав човек."},
	{2, "2 Бидејки Ти си крепост моја, Боже, зошто си ме отфрлил? И зошто одам така нажален додека непријателот ме мачи?"},
	{3, "3 Испрати ја Твојата светлина и Твојата вистина да ме водат и да ме доведат во Твојата света гора и во Твоето живеалиште."},
	{4, "4 И ке пристапам до Божјиот жртвеник, до Бога, Кој ја радува мојата младост. На цитра ке Те славам, Боже, Боже мој!"},
	{5, "5 Зошто тагуваш душо моја, и зошто ме вознемируваш! Наведај се на Бога, бидејки пак ке Го исповедам Него, Спасителот и мојот Бог."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view44() {
struct mk44 poems[] = {
	{1, "1 Боже, со ушите наши чувме, а татковците наши ни раскажуваа за делото што си го направил во нивните дни, во деновите древни."},
	{2, "2 Ти со Твојата рака си истребил народи, а нив си ги населил; си поразил лу е и си ги изгонил;"},
	{3, "3 бидејки тие не со меч ја придобија земјата, и нивните мишки не ги спасиле, туку Твојата десница и Твојата мишка и светлината на Твоето лице, зашто Ти беа по воља."},
	{4, "4 Боже, само Ти си цар мој и Бог мој, Кој му извојува победа на Јакова."},
	{5, "5 Со Тебе, како со рогови, ке ги избодеме нашите непријатели, и со Твоето име ке ги уништиме оние, што востануваат против нас;"},
	{6, "6 зашто јас нема да се надевам на мојот лак и мечот мој нема да ме спаси;"},
	{7, "7 туку Ти ке не спасиш од непријателите наши и ке ги посрамиш оние што не мразат."},
	{8, "8 Со Бога ке се фалиме секој ден и Твоето име вечно ке го прославуваме."},
	{9, "9 Но сега Ти не отфрли и не посрами, па не излегуваш, Боже, со нашите војски;"},
	{10, "10 не сврти во бегство пред непријателите наши, и оние, што не мразат, не ограбуваа."},
	{11, "11 Не предаде како овци да не изедат и не растури ме у незнабошците."},
	{12, "12 Ефтино го продаде народот Свој и со тоа не ја крена цената негова;"},
	{13, "13 не предаде за презир кај соседите наши, за потсмев и хулење на оние, кои живеат околу нас;ф"},
	{14, "14 не направи за приказ ме у незнабошците, и мнозина ја вртат главата."},
	{15, "15 Секој дена срамот мој е пред мене, и црвенило го покрива лицето мое,"},
	{16, "16 од гласот на оној што се потсмева и од клеветникот, од непријателите и одмаздниците."},
	{17, "17 Сето тоа не снајде нас, но ние не Те заборавивме, Тебе и не го нарушивме Заветот Твој."},
	{18, "18 И не отстапи срцето наше, и стапките наши не се отклонија од Твојот пат."},
	{19, "19 зашто не порази во местото, каде што бевме озлобени и не покри со смртна сенка."},
	{20, "20 Ако го бевме заборавиле името на нашиот Бог и да ги бевме протегнале рацете наши кон ту бог,"},
	{21, "21 зар Бог тогаш немаше да испита за тоа? Зашто Он ги знае тајните на срцата."},
	{22, "22 Заради Тебе умираме секој ден, не сметаат како овци определени за клање."},
	{23, "23 Рабуди се, зошто спиеш, Господи! Разбуди се, и не отфрлај не засекогаш!"},
	{24, "24 Зошто го одвракаш лицето Свое, ја забораваш бедата наша и невољата наша?"},
	{25, "25 Бидејки душата наша се понизи до прав, а утробата ни се прилепила на земјата,"},
	{26, "26 стани, Господи, и помогни ни, избави не поради името Твое."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view45() {
struct mk45 poems[] = {
	{1, "1 Од срцето мое се излива благ збор; му зборувам на Царот за делата мои; јазикот ми е како трска на брзописец."},
	{2, "2 Ти си најпрекрасниот ме у синовите човечки, благодат се излива од Твојата уста; затоа Бог Те благословил довека."},
	{3, "3 Препаши го на бедрото мечот Свој, о силнику: во Својата красота и убавина!"},
	{4, "4 И така украсен, поитај и царствувај заради вистината, кротоста и правдата, и Твојата десница ке покаже чудесни дела."},
	{5, "5 Изострени се Твоите стрели, о јунаку, народите ке паднат пред Тебе, - тие ке се забодат во срцата на царските непријатели."},
	{6, "6 Твојот престол, Боже, е вечен: жезлото на правдата е жезло на Твоето царство."},
	{7, "7 Ти ја засака правдата и го намрази беззаконието; затоа, Боже, Твојот Бог, Те помаза со елеј на радоста повеке од Твоите соучесници."},
	{8, "8 Сите Твои облеки мирисаат на смирна, алој и касија; кога излегуваш од дворците од тешка слонова коска, во што нао аш радост."},
	{9, "9 Царски керки се во Твојата почесна придружба; царицата стои покрај Тебе оддесно во облека украсена и со злато проткаена."},
	{10, "10 Чуј, керко, види, приклони го увото свое и заборави го твојот народ и домот на таткото твој."},
	{11, "11 Зашто Царот ја посака твојата убавина, оти Он е твој Господар и приклони Му се тогаш ти."},
	{12, "12 И керката тирска ке Му се поклони со подароци и најбогатите ме у народот ке те замолат."},
	{13, "13 Сета слава на царската керка е внатре: нејзината облека е везена со злато;"},
	{14, "14 во везена облека ке ја доведуваат кај Царот; по неа водат при Тебе девици, нејзини другарки, и ги приведуваат кон Тебе,"},
	{15, "15 ги доведуваат со веселба и радост, влегуваат во Царевиот дворец."},
	{16, "16 Место твоите татковци, овде ке бидат твоите синови; Ти ке ги поставиш за кнезови по целата земја."},
	{17, "17 Kе го спомнуваат името Твое од род во род; затоа народите ке Те слават од век до век."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view46() {
struct mk46 poems[] = {
	{1, "1 Бог ни е нам прибежиште и сила, помошник, на секој кој е во мака ке се најде."},
	{2, "2 Затоа нема да се уплашам, па макар и земјата да се разниша, и горите да се преместат во срцето морско."},
	{3, "3 Збучеа и се креваа водите нивни, се затесоа горите од жестината нивна."},
	{4, "4 Речните потоци го веселат Божјиот град, Севишниот го осветли живеалиштето Свое."},
	{5, "5 Бог е среде него; тоа нема да се разниша: Бог ке му помогне уште пред зори."},
	{6, "6 Се збунија народите; се потресоа царствата; Севишниот го пушти Својот глас, и земјата се затресе."},
	{7, "7 Господ на силите е со нас, Јакововиот Бог е наш застапник."},
	{8, "8 Дојдете и видете ги делата Божји - чудесата што ги направи Он на земјата."},
	{9, "9 Прекратувајки ги војните до крајот на земјата, ке го скрши лакот и ке го здроби оружјето, и штитовите големи со оган ке ги изгори."},
	{10, "10 Застанете и разберете дека Јас сум Бог; ке се издигам над народите и ке се превознесувам над земјата."},
	{11, "11 Господ на силите е со нас, Јакововиот Бог е наш застапник."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view47() {
struct mk47 poems[] = {
	{1, "1 Заплескајте со рацете, сите народи воскликнете кон Бога со радосен глас;"},
	{2, "2 зашто Севишниот Господ е страшен, Голем Цар е над целата земја."},
	{3, "3 Он ни покори под нозете лу е и народи;"},
	{4, "4 за Свое наследство ни ја избра красотата на Јакова, кого го возљуби."},
	{5, "5 Се издигна Бог при восклици, Господ се возвисува при трубен звук."},
	{6, "6 Пјете му на нашиот Бог, пејте; пејте му на нашиот Цар, пејте,"},
	{7, "7 зашто Бог е Цар над целата земја; пејте Му мудро!"},
	{8, "8 Бог се зацари над народите, Бог седи на светиот Свој престол;"},
	{9, "9 незнабожечките кнезови се состанаа со Авраамовиот Бог, зашто земните силници кои Му припа аат на Бога, силни се подигнаа."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view48() {
struct mk48 poems[] = {
	{1, "1 Голем е Господ и многу фален во градот на нашиот Бог, на Својата света гора."},
	{2, "2 Прекрасна возвишеност, радост на целата земја е гората Сион; на северната страна нејзина е градот на големиот Цар."},
	{3, "3 Бог, Кој е во Својот дворец, знаеме дека е заштитник."},
	{4, "4 Зашто, ете, се собраа царевите земни и сите дојдоа заедно,"},
	{5, "5 па, откако видоа, се восхитија, се збунија и се поколебаа:"},
	{6, "6 страв ги опфати таму, па се мачеа како жена родилка;"},
	{7, "7 и со силен ветар ги разби тарсиските кораби."},
	{8, "8 Како што чувме, така и видовме во градот на Господа на силите, во градот на нашиот Бог: Бог го основа за довека."},
	{9, "9 Ја примивме, Боже, милоста Твоја среде храмот Твој."},
	{10, "10 Според името Твое, Боже, е и Твојата похвала до краиштата на земјата: Твојата десница е полна со правда."},
	{11, "11 Нека се весели гората Сион, и да се радуваат јудејските керки заради Твоите судови, Господи."},
	{12, "12 Одете околу Сион и обиколете го, прикажувајте во кулите негови."},
	{13, "13 Положете ги срцата свои во неговата мок; разгледајте ги неговите дворци, за да му раскажете на идниот род."},
	{14, "14 Зашто овој Бог е наш Бог во сите векови: Он ке ни биде пастир вечен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view49() {
struct mk49 poems[] = {
	{1, "1 Чујте го ова сите народи; внимавајте вие сите што живеете по вселената,"},
	{2, "2 земнородни и синови човечки, како богатите така и сиромасите."},
	{3, "3 Устата моја ке кажува мудрост, и мислата на срцето мое - поука."},
	{4, "4 Kе го наклонам увото свое кон раскажувањето: со гусла ке ја отркијам гатанката моја."},
	{5, "5 Зошто да се плашам во тешки денови, кога беззаконието на моите патишта ке ме опколи?"},
	{6, "6 Вие, што се надевате на силите свои и се фалите со големото богатство свое, чујте:"},
	{7, "7 Братот не може да се искупи; а може ли човекот да се откупи? На Бога нема да му даде откуп за него,"},
	{8, "8 ниту цена за откуп на душата своја."},
	{9, "9 Некој и ке се намачи долго, ке живее до крајот и пак ке пропадне, кога ке види дека и мурдите умираат."},
	{10, "10 Неразумните и безумните загинуваат заедно, а го оставаат богатството на други."},
	{11, "11 Тие си мислат, дека горбовите нивни се вечни, живеалиштата од род во род, така што земјите нивни ги носат имињата нивни."},
	{12, "12 И човек со почест ова не го разбира; па заприлегува на животните, со кое се поистоветува."},
	{13, "13 Тој нивни пат е нивна соблазна, иако потоа со својата уста убаво ке зборуваат."},
	{14, "14 Тие се како овци затворени во пеколот, смртта им е пастир, и изутрина праведните ке господарат над нив; но силата нивна ке се истроши во пеколот од славата нивна."},
	{15, "15 Но Бог ке ја спаси душата моја од раката на пеколот, кога ке ме прими."},
	{16, "16 Не плаши се кога човек богатее, кога славата на домот негов расте;"},
	{17, "17 зашто, умирајки, ништо нема да земе, ниту, пак, славата негова ке појде по него;"},
	{18, "18 макар што при животот негов душата негова ја ублажуваат, а тебе те фалат кога си угодуваш;"},
	{19, "19 ке отиде дури во родот на своите татковци, нема никогаш да види светлина."},
	{20, "20 Човек, кој неразумно живее, сличен е на животните."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view50() {
struct mk50 poems[] = {
	{1, "1 Бог над боговите, Господ, говори и ја повикува земјата од сончевиот изгрев до запад."},
	{2, "2 Од Сион, кој е врв на убавината, ке се појави Бог;"},
	{3, "3 иде нашиот Бог, и ке прозбори; пред Него оган ке се разгори, околу Него бура."},
	{4, "4 Одозгора Он ке ги повика небото и земјата, за да му суди на Својот народ:"},
	{5, "5 Соберете ги при Него светиите Негови, кои се заветуваа како жртва за Него."},
	{6, "6 И небесата ке ја огласат Неговата правда, зашто Бог е судија."},
	{7, "7 Чуј, народе Мој, и Јас ке ти говорам, Израиле, ке сведочам против тебе: Јас сум Бог, Твој Бог."},
	{8, "8 нема да те прекорувам поради твоите жртви; твоите сепаленици секогаш се пред Мене;"},
	{9, "9 нема потреба да примам телци од твојот дом, ниту козли од стадата твои,"},
	{10, "10 зашто Мои се сите горски sверови и добитокот по горите и говедата."},
	{11, "11 Ги познавам сите птици небески, и убавината на полињата е пред Мене,"},
	{12, "12 ако огладнам, нема да ти кажам тебе, зашто Моја е вселената и се, што ја исполнува."},
	{13, "13 Зар Јас да јадам јунешко месо и да пијам крв јарешка?"},
	{14, "14 Принеси Му на Бога благодарствена жртва и на Севишниот молитвите свои упатувај Му ги;"},
	{15, "15 и повикај Ме во тежок ден; Јас ке те избавам, и ти ке Ме прославиш."},
	{16, "16 А за грешникот Бог рече: 'Зошто ги кажуваш Моите наредби и со уста го примаш Мојот завет?'"},
	{17, "17 А самиот ја мразиш поуката Моја и зад грб го фрлаш зборовите Мои?"},
	{18, "18 Кога ке видеше крадец, се зближуваше со него и со прељубници се дружеше;"},
	{19, "19 устата твоја е полна со злоба, и јазикот твој лукавство плете;"},
	{20, "20 седиш и го клеветиш братот свој, и против синот на својата мајка се соблазнуваш."},
	{21, "21 Ти го изврши тоа, а јас молчев; ти си помисли дека Јас сум, каков што си ти. Kе те изобличам и ке ти ги изнесам пред лицето твое гревовите твои."},
	{22, "22 Разберете го ова вие, кои го заборавате Бога, за да не ве грабне, па тогаш ке нема избавител."},
	{23, "23 Кој принесува жртва благодарствена, тој Ме прославува, и кој го следи Мојот пат, нему ке му го соопштам Божјото спасение."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view51() {
struct mk51 poems[] = {
	{1, "1 Помилуј ме, Боже, поради големата Твоја милост, и заради големата Твоја добрина избриши ги беззаконијата мои."},
	{2, "2 Многупати ме изми од моето беззаконие и очисти ме од мојот грев,"},
	{3, "3 зашто беззаконието мое го знам и мојот грев е секогаш пред мене."},
	{4, "4 Пред Тебе Единствениот згрешив и пред Тебе зло извршив, за да бидеш праведен кога ке пресудуваш и да победиш кога ке судиш."},
	{5, "5 Ете, во беззаконие сум зачнат и во грев ме роди мајката моја."},
	{6, "6 Но, Ти ја засака вистината во срцето, и внатре во мене ми ја објави непознатата и тајната премудрост Твоја."},
	{7, "7 Пороси ме со исоп, и ке бидам чист; измиј ме и ке бидам побел од снег."},
	{8, "8 Дај ми да чујам радост и веселба, и ке се зарадуваат коските мои ослабнати."},
	{9, "9 Сврти го лицето Свое од гревовите мои и избриши ги сите мои беззаконија."},
	{10, "10 Создај чисто срце во мене, Боже, и дух вистински обнови во мене."},
	{11, "11 Не отфрлај ме од лицето Свое и Светиот Дух Твој не одземај Го од мене."},
	{12, "12 Врати ми ја радоста, спасувајк ме и со Својот мокен Дух зацврсти ме."},
	{13, "13 Беззакониците ке ги научам да одат по Твоите патишта, и безбожниците кон Тебе ке се обрнуваат."},
	{14, "14 Избави ме од крвта, Боже, на моето спасение, и јазикот мој ке се зарадува на Твојата правда."},
	{15, "15 Господи, отвори ја устата моја, и устата моја ке ја објави похвалата Твоја;"},
	{16, "16 оти, да сакаше жртва, јас ке Ти ја принесев; но сепалениците не ги сакаш."},
	{17, "17 Жртвата пред Бога е смирен дух; срце понизно и смирено Ти, боже, не отфрлуваш."},
	{18, "18 Господи, направи му добро на Сион, според благоволението Свое, воздигни ги sидовите ерусалимски."},
	{19, "19 Тогаш ке Ти бидат угодни жртвите на правдата, вознесувањата и жртвите сепаленици; тогаш на Твојот олтар ке принесуваат телци."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view52() {
struct mk52 poems[] = {
	{1, "1 Зошто, се фалиш, силнику, со злоба? Беззаконија вршиш по цел ден."},
	{2, "2 Јазикот твој погубни работи измислува; како наострен брич ти е - и веке си смислил измама."},
	{3, "3 Ти повеке ја засака злобата отколку доброто, неправдата, отколку да говориш правда;"},
	{4, "4 ти, лукав јазику, засака секакви погубни зборови."},
	{5, "5 Поради тоа Бог, до крај ке те уништи, ке те истргне и ке те пресели од живеалиштето твое, и коренот твој - од земјата на живите."},
	{6, "6 Kе видат праведните, ке се уплашат и ке му се подсмеваат, па ке речат:"},
	{7, "7 ете човек, кој не ја полагаше силата своја во надеж на Бога, а се надеваше на големото богатство свое, и кој се осили во лесномисленоста своја."},
	{8, "8 А јас, пак, сум во Божјиот дом како плодна маслина и се надевам на милоста Божја во сите векови."},
	{9, "9 Вечно ке Те славам за она што го направи, и ке се надевам на името Твое, зашто тоа е благо пред светиите Твои."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view53() {
struct mk53 poems[] = {
	{1, "1 Рече безумникот во срцето свое: 'нема Бог.' Станаа развратни лу ето и гнасни во беззаконијата; нема кој да прави добро."},
	{2, "2 Бог со внимание погледна од небесата кон синовите човечки, за да види, има ли некој што е разумен или да Го бара Бога."},
	{3, "3 Сите тргнаа по лош пат, станаа еднакво расипани; нема кој да прави добро, нема ниеден."},
	{4, "4 Зар нема да се вразумат оние, што вршат беззаконие. Оние што го јадат народот Мој, како што го јадат лебот, но Бога не Го повикуваат."},
	{5, "5 Kе се уплашат тие од страв, и таму каде што страв нема, зашто Господ ке им ги растури коските на оние, што си угодуваат еден на друг. И тие ке се посрамат, зашто Бог ке ги понизи."},
	{6, "6 Кој ке му даде спасение на Израилот од Сион? Кога Бог ке ги врати заробените од народот Свој, тогаш ке се зарадува Јаков и ке се развесели Израилот."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view54() {
struct mk54 poems[] = {
	{1, "1 Боже, со името Твое спаси ме и со силата Твоја суди ми."},
	{2, "2 Боже, услиши ја молитвата моја, чуј ги зборовите од устата моја;"},
	{3, "3 зашто ту инци се кренаа против мене, и силници го бараат животот мој; тие не мислат на Бога."},
	{4, "4 Ете, Бог ми помогна; Господ е заштитник на животот мој."},
	{5, "5 На непријателите мои Он ке им врати за злото; ке ги истреби со вистината Своја."},
	{6, "6 Со сесрдност Ти принесувам жртва, го прославувам името Твое, Господи, зашто е благо,"},
	{7, "7 оти Ти ме избавуваш од секаква мака и окото мое презриво ги гледа непријателите мои."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view55() {
struct mk55 poems[] = {
	{1, "1 Прими ја Боже, молитвата моја и не презирај го моето молење;"},
	{2, "2 погледај ме и услиши ме. Нажален сум во тагата моја"},
	{3, "3 и збунет сум од гласот на напријателите, од притисокот на грешниците, зашто вршат врз мене беззаконие и со гнев непријателствуваат против мене."},
	{4, "4 Срцето мое затрепери во мене, и смртен страв ме спопадна;"},
	{5, "5 страв и трепет ме сполетаа, и темнина ме покри."},
	{6, "6 И јас реков: 'Кој ке ми даде криља гулабови, па да одлетам и се успокојам.'"},
	{7, "7 Далеку би отишол и би се сместил во пустињата;"},
	{8, "8 се надевав на Оној Кој ме спасува од малодушноста и од бурата."},
	{9, "9 Потопи ги, Господи, и раздели ги нивните јазици, зашто видов насилство и расправии во градот."},
	{10, "10 Дење и ноке обиколуваат покрај sидовите негови; и во него беззаконие, мака и неправда има;"},
	{11, "11 а не оскудеваше ни измама и лукавство по улиците негови."},
	{12, "12 Да ме беше навредил непријателот мој, тоа би го поднел, и завидливецот мој да се беше покажал силен, јас ке се сокриев;"},
	{13, "13 но тоа беше ти, човеку, кој си како јас, водач мој и пријател мој,"},
	{14, "14 со кого сме јале леб заедно и сме оделе заедно во Божји дом!"},
	{15, "15 Смртта дојде на нив; да слезат живи во пеколот, зашто лукавство има среде нив, во живеалиштата нивни."},
	{16, "16 Јас, пак, Бога ке го повикам, и Господ ке ме услиши."},
	{17, "17 Навечер и наутро, и напладне ке молам и ке викам, и Он ке го чуе гласот мој,"},
	{18, "18 ке ја избави во мир душата моја од оние, кои ми се приближуваат, зашто многу ги има што беа против мене,"},
	{19, "19 Бог ке ме чуе и ке ги понизи; Оној, Кој вечно живее, зашто во нив нема промена; тие не се плашат од Бога."},
	{20, "20 Ги креваат рацете свои против оние, со кои живееја во мир, го нарушија Неговиот завет."},
	{21, "21 Се растурија од гневот на лицето Негово, а во срцето им е непријателство; зборовите им станаа како елеј, но тие се стрели."},
	{22, "22 Пренеси ја на Господа маката своја, и Он ке те поткрепи. Не дозволувај праведниот човек да пострада."},
	{23, "23 Ти, Боже, ке ги фрлиш во погибелна јама; крвниците и лукавите лу е да не поживеат ни половина од деновите свои. Јас, пак, Господи, на Тебе се надевам!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view56() {
struct mk56 poems[] = {
	{1, "1 Смилуј се Боже, на мене, зашто човек сака да ме голтне; напа ајки секој ден, ме притиска."},
	{2, "2 Моите непријатели по цел ден ме газат, зашто мнозина се оние, кои ме напа аат со гордост."},
	{3, "3 Кога страв ке ме спопадне дење, на Тебе се надевам."},
	{4, "4 Во Бога ке ги фалам зборовите свои; на Бога се надевам. Нема да се плашам; што може да ми направи човек?"},
	{5, "5 Секој ден ги извртуваат зборовите мои; сите нивни мисли упатени против мене се зло."},
	{6, "6 Се собираат и се кријат, ги набљудуваат петите мои, упорно работат против мојот живот."},
	{7, "7 Нема за што да ги спасуваш, Боже, Со гнев Боже, собери ги народите."},
	{8, "8 Боже, Ти го знаеш животот мој, солзите мои Си ги ставил пред себе - како во заветот Твој."},
	{9, "9 Непријателите мои ке се вратат назад, секогаш кога Те призовувам; по тоа знам дека Ти си Бог мој."},
	{10, "10 Со Бога се фалам за Неговото слово. Со Господа се фалам за зборот Негов."},
	{11, "11 На Бога се надевам, не се плашам; што може да ми направи човекот?"},
	{12, "12 Во мене се, Боже, благодарствените молитви мои кон Тебе, кои ке Ти ги упатам."},
	{13, "13 Зашто Ти ја избави душата моја од смрт, а и нозете мои од сопнување, за да благоугодам пред Бога во светлината на живите."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view57() {
struct mk57 poems[] = {
	{1, "1 Смилуј се, Боже, на мене. Смилуј се, зашто на Тебе се надева душата моја, и во сенката на криљата Твои ке ја положам надежта моја додека не минат беззаконијата."},
	{2, "2 Kе повикам кон Бога Севишниот, кон Бога, Кој ми прави добро."},
	{3, "3 Он ке прати од небото и ке ме спаси; ке ги посрами оние, кои ме презираат. Kе ја испрати Бог Својата милост и Својата вистина."},
	{4, "4 И нека ја избеви душата моја од лавови; лежам смутен ме у синовите човечки; та нивни заби се копја и стрели, а јазикот им е остар меч."},
	{5, "5 Возвиси се на небесата, Боже, и по целата земја нека биде Твојата слава!"},
	{6, "6 Тие подготвија стапица за нозете мои; и се обидоа да ја измамат душата моја: ископаа пред мене јама, но сами паднаа во неа."},
	{7, "7 Подготвено е срцето мое, Боже, спремно е срцето мое, ке пеам и ке свирам."},
	{8, "8 Разбуди се, славо моја, разбуди се псалтиру и гусле! Јас ке станам рано."},
	{9, "9 Kе Те славам, Господи, ме у народите, ке Те воспеам ме у племињата,"},
	{10, "10 зашто Твојата милост се возвеличи до небесата, и дури до облаците - Твојата вистина."},
	{11, "11 Вознеси се, Боже на небесата и по целата земја нека биде Твојата слава!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view58() {
struct mk58 poems[] = {
	{1, "1 Дали навистина кажувате правда? Судите ли праведно, вие, човечки синови?"},
	{2, "2 Во срцето све кроите беззаконие на земјата, вашите раце плетат неправда на земјата."},
	{3, "3 Се оту ија грешниците од мајчиното крило, се заблудеа од утробата мајчина, говорејки лага."},
	{4, "4 Јароста им е како змијски отров, како отровот на глувата аспида, која ги затнува ушите свои,"},
	{5, "5 и не го слуша гласот на бајачот, вражачот вешт во вражањето."},
	{6, "6 Бог неке им ги скриши нивните заби во устите нивни; разби ги, Господи, челустите лавовски!"},
	{7, "7 Нека се разлијат како вода што истечува; ке го растегнеш својот лак, додека не малаксаат."},
	{8, "8 Како восок што се топи да се растопат, оган нека падне над нив, та сонце да не видат никогаш."},
	{9, "9 Пред котлите ваши да осетат топлина од запаленото трње."},
	{10, "10 Kе се зарадува праведникот, кога ке ја види одмаздата на безбожниците; ке ги измие рацете свои во крвта на грешникот."},
	{11, "11 И ке рече човекот: навистина има плод за праведникот! Навистина има Бог, Кој суди на земјата!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view59() {
struct mk59 poems[] = {
	{1, "1 Спаси ме од непријателите мои, Боже мој, заштити ме од оние што стануваат против мене!"},
	{2, "2 Избави ме од оние, што вршат беззаконија; спаси ме и од крвниците;"},
	{3, "3 зашто, ете, тие ја демнат душата моја; ме напа аат силните беа престап мој и без грев мој, Господи."},
	{4, "4 Без моја вина навалија на мене; стани, излези ми во пресрет и погледај."},
	{5, "5 Ти, Господи, Боже на силите, Боже Израилев, разбуди се и посети ги сите овие народи и не поштедувај ниеден од оние што вршат беззаконие."},
	{6, "6 Навечер тие се вракаат, вијат како кучиња и одат околу градот."},
	{7, "7 И, ете, хулат со јазикот свој; во устата имаат меч, 'зашто, - си велат тие, - кој ке чуе?'"},
	{8, "8 Но Ти, Господи, ке ги исмееш; Ти ке ги посрамиш сите народи."},
	{9, "9 Силата моја во Тебе ја чувам, зашто си Ти, Боже, мој застапник."},
	{10, "10 Мојот Бог, Кој ме милува, иде пред мене; Бог мој, Кој ми ги покажува моите непријатели."},
	{11, "11 Не убивај ги, за да не го заборават мојот народ; растури ги со силата Своја и победи ги, Господи, заштитниче мој."},
	{12, "12 За гревот на устата нивна; за зборот во устата нивна нека се фатат во гордоста своја, бидејки само клетви и лаги кажуваат."},
	{13, "13 Во крајниот гнев, и нема веке да ги има; за да увидат, дека Бог управува над Јакова и до краиштата на земјата."},
	{14, "14 Навракаат секоја вечер, гладуваат како кучиња, и одат околу градот;"},
	{15, "15 Тие се радуваат кога бараат храна, а кога нема да се заситат, ги поминуваат ноките ‘ржејки."},
	{16, "16 Јас, пак, со песна ке ја славам Твојата сила и од рани зори ке се зарадувам со Твојата милост, бидејки Ти ми беше застапник мој и прибежиште во денот на мојата несрека."},
	{17, "17 Помошник мој си Ти, Тебе Ти пеам, зашто Ти си застапник мој, Боже мој, милост моја."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view60() {
struct mk60 poems[] = {
	{1, "1 Боже, Ти не отфрли и не растури, се разгневи, но сепак се смилува на нас."},
	{2, "2 Ја потресе земјата и ја залула; стегни ги пукнатините нејзини, зашто таа се ниша."},
	{3, "3 Ти му покажа на Твојот народ жестокот и не напои со заносно вино."},
	{4, "4 На оние, што се бојат од Тебе, им даде знак за да побегнат од убојник лак."},
	{5, "5 За да се избават Твоите возљубени, спаси ме со Твојата десница и услиши ме."},
	{6, "6 Рече Бог во Своето Светилиште: 'Kе се зарадувам, ке го разделам Сихем и ке ја премерам долината на Сокхот заради поделба."},
	{7, "7 Мој е Галад, и Мој е Манасија, и Ефрем е крепост на главата Моја, и Јуда е цар Мој."},
	{8, "8 Со Моав се мие Мојата надеж, на Идумеја ке и го подадам обувките Свои, а над Филистејците ке славам победа.'"},
	{9, "9 Кој ке ме воведе во урепениот град? Кој ке ме доведе до Идумеја?"},
	{10, "10 Зар не Ти, Боже, Кој не отфрли? И нема веке да излегуваш, Боже, со нашите војски?"},
	{11, "11 Помогни ни во маката, зашто од човекот нема спасение."},
	{12, "12 Со Бога ке бидеме силни, Он ке ги уништи нашите мачители."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view61() {
struct mk61 poems[] = {
	{1, "1 Услиши го, Боже, моето молење, прими ја молитвата моја."},
	{2, "2 Кон Тебе повикав од крајот на земјата, кога срцето ми папса. Kе ме издигнеш на карма и мир ке ми дадеш."},
	{3, "3 Ме упати, зашто Ти беше моја надеж, крепосен заклон од непријателот."},
	{4, "4 Kе се населам вечно во Твоето живеалиште и ке се засолнам под покривот на Твојата закрила."},
	{5, "5 зашто Ти, Боже, ги чу моите молитви и им даде населедство на оние, кои се бојат од Твоето име."},
	{6, "6 Додај му уште денови кон деновите царски и продолжи му ги годините од род во род,"},
	{7, "7 за да биде твој вечно пред Бога; милост и вистина сака тој."},
	{8, "8 И така, со песна ке го воспевам Твоето име и ке ги извршувам своите завети од ден во ден."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view62() {
struct mk62 poems[] = {
	{1, "1 Па, зар во Бога не се успокојува душата моја? Та од Него е моето спасение."},
	{2, "2 Зашто Он е Бог мој, и мој Спасител. Застапник мој: нема повеке да се поколебам."},
	{3, "3 До кога ке притискаат врз човекот? Го уривате сите вие како наклонет sид и накривена ограда."},
	{4, "4 намисливте да го отфрлите моето достоинство со лага; со устата своја благословувате, а со срцето свое колнете."},
	{5, "5 А ти, душо моја, само по Бога оди, зашто на Него трпеливо се надевам."},
	{6, "6 Он е Бог мој и Спасител мој: застапник мој и нема веке да се колебам."},
	{7, "7 Во Бога е моето спасение и мојата слава; Он е Бог Кој ми помага и надежта моја е во Бога."},
	{8, "8 Надевајте се на Него сите лу е, отворете го срцето ваше пред Него: Бог е нашиот помошник."},
	{9, "9 Синовите човечки се само суета; синовите човечки се лажливци; кога би ги ставиле на мерило, тие сите заедно би биле полесни од здив."},
	{10, "10 Не се надевајте на неправда и не посакувајте отимање; кога богатството расте, не го приврзувајте срцето кон него."},
	{11, "11 Еднаш Бог рече, а двапати јас го чув тоа, дека силата е во Бога,"},
	{12, "12 дека во Тебе, Господи, е силата Божја и дека во Тебе има милост, зашто Ти ке му дадеш на секого според делата негови."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view63() {
struct mk63 poems[] = {
	{1, "1 Боже, Боже мој, кон Тебе поранувам; за Тебе зажедне душата моја. Колку пати за Тебе копнее телото мое на замјата пуста, неплодна и безводна?"},
	{2, "2 И така се појавив во Светилиштето Твое, за да ја видам Твојата сила и Твојата слава."},
	{3, "3 Зашто милоста Твоја е подобра од животот, устата моја ке Те фали."},
	{4, "4 Така ке Те благословувам во животот мој, и во Твое име ке ги кревам рацете мои."},
	{5, "5 Како со маст и елеј се наситува душата моја, и со радосен глас ке те фали устата моја."},
	{6, "6 Кога ке се сетам за Тебе во постелата моја, во утринските часови за Тебе размислувам,"},
	{7, "7 зашто Ти си ми помошник и во сенката на Твојата закрила ке воскликнувам."},
	{8, "8 Кон Тебе се приближи душата моја, твојата десница ме поддржува."},
	{9, "9 А оние кои залудно го побараа мојот живот, ке слезат во пеколот!"},
	{10, "10 Kе бидат поразени со силата на мечот; ке станат плен на лисиците."},
	{11, "11 А царот ке се зарадува во Бога, и секој ке се фали, кој во Него се колне, бидејки ке им се затне устата на оние што говорат неправда."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view64() {
struct mk64 poems[] = {
	{1, "1 Чуј го, Боже, гласот мој, кога Ти се молам; зачувај ми го животот мој од непријателот што ме застрашува."},
	{2, "2 Ти ме заштити од лукавите, од многуте злочинци."},
	{3, "3 Кои ги наострија јазаците свои како меч, го затегнаа лакот свој - па исфрлаат ранливи зборови,"},
	{4, "4 за да стрелаат скришно на непорочниот; тие стрелаат ненадејно врз него и нема да се уплашат."},
	{5, "5 Тие цврсто се договорија за зло; се договорија како да ја прикријат замката, па си рекоа: кој ке го види?"},
	{6, "6 Па бараа неправда, вршеа испитување, но испитувањ3 дури до внатрешнината на човекот, но длабоко е срцето."},
	{7, "7 Но Бог ке се прослави: нивните стрели не полетаа."},
	{8, "8 И јазиците нивни папсаа на нив. А сите кои ги видоа, се зачудија."},
	{9, "9 И секој човек се уплаши. Се објавија делата Божји и ги разбраа созданијата негови."},
	{10, "10 А праведникот ке се развесели во Господа и ке се надева на Него; и ке бидат пофалени сите кои се праведни по срце."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view65() {
struct mk65 poems[] = {
	{1, "1 Тебе, Боже, Ти припа а похвалата на Сион, и Тебе ке Ти се исполни заветот во Ерусалим."},
	{2, "2 Услиши ја молитвата моја; кон Тебе ке прибегне секој човек."},
	{3, "3 Од зборовите на беззакониците, кои надвладуваат над нас и од нашите гревови, очисти не."},
	{4, "4 Блажен е оној, кого Ти си го избрал и примил; он ке живее во Твоите дворови; ке се исполни со добрини од Твојот дом; а Твојот дом е свет, и чудесен е во праведноста."},
	{5, "5 Чуј не, Боже, Спасителе наш, надеж на сите земни краишта и на оние што се далку преку морето."},
	{6, "6 Ти, Кој горите си ги поставил со силата Своја и со мок си се препашал,"},
	{7, "7 Ти Кој ја раздвижуваш морската длабочина и шумот што го прават брановите. Kе поштукнат народите."},
	{8, "8 И ке се уплашат сите оние што живеат во краиштата од чудесата Твои: ке создадеш радост каде што утрото се ра а и вечерта зао а."},
	{9, "9 Ти ја посетуваш земјата, ја напојуваш, ја збогатуваш: потокот Божји е полн со вода; си им приготвил храна, бидејки тука си ја устроил."},
	{10, "10 Ги напојуваш браздите нејзини, и ги умножуваш житата нејзини и со дождовни капки ја благословуваш да ра а плодови;"},
	{11, "11 ја овенчуваш годината со Твојата добрина и полињата Твои полни се со згоен добиток."},
	{12, "12 Се појавуваат пасишта по пустињите и ритчињата се исполнуваат со радост;"},
	{13, "13 Трлата се умножуваат со стада, а долините се китат со плодови: воскликнуваат и пеат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view66() {
struct mk66 poems[] = {
	{1, "1 Воскликни Му на Бога, земјо цела!"},
	{2, "2 Воспејте го името Негово, воздајте Му слава и похвала!"},
	{3, "3 Кажете Му на Бога: колку се страшни делата Твои! Поради големината на силата Твоја, ке Ти се покоруваат непријателите Твои."},
	{4, "4 Целата земја нека Ти се покорува и да Ти пее, да Му пее на Твоето име, Севишни."},
	{5, "5 Дојдете и видете ги делата Божји, колку е страшен во одлуките Свои за синовите човечки."},
	{6, "6 Он го претвори морето во суво; преку река минува со ногата; таму се зарадувавме поради Него."},
	{7, "7 Со Својата мок Он владее вечно; Неговите очи гледаат на народите, за да не се кренат бунтовниците."},
	{8, "8 Благословувајте Го, народи, нашиот Бог и искажете Му похвала гласно."},
	{9, "9 Он и даде живот на душата моја и не дозволи да потклекнат нозете мои;"},
	{10, "10 Ти не испита, Боже, со оган не очисти, како што среброто со оган се пречистува."},
	{11, "11 Ти не воведе при мака, нанесе маки на нашите племиња."},
	{12, "12 Допушти лу ето да ни се качат на глава. Минавме низ оган и вода, но не изведе да здивнеме."},
	{13, "13 Kе влезам во Твојот дом со сепаленица, ке Ти ги исполнам моите завети,"},
	{14, "14 што ги изговорија усните мои и ги искажа устата моја кога бев во невоља."},
	{15, "15 Мрсни сепаленици ке Ти принесам Тебе, со кадило од овни, ке Ти принесам Тебе и волови и кози."},
	{16, "16 Дојдете и чујте вие сите кои се боите од Бога и ке ви раскажам се што направи Он за душата моја."},
	{17, "17 Повикав кон Него со устата моја и Го возвеличив со јазикот свој."},
	{18, "18 Да мислев беззаконие во срцето мое, Господ немаше да ме услиши."},
	{19, "19 Затоа ме услиши Господ, го чу гласот на молењето мое."},
	{20, "20 Нека е благословен Бог, Кој не ја отфрли молитвата моја и не ме остави без милоста Своја!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view67() {
struct mk67 poems[] = {
	{1, "1 Боже, биди милостив кон нас и благослови не; осветли не со лицето Свое, и помилуј не,"},
	{2, "2 за да го познаат на земјата патот Твој, и ме у сите народи спасението од Тебе."},
	{3, "3 Да Те прославуваат народите, Боже, сите народи да Те прославуваат."},
	{4, "4 Племињата нека се развеселат и да се радуваат, зашто праведно ке им судиш на народите, и племиња ке упатиш на земјата."},
	{5, "5 Народите нека Те прославуваат, Боже, сите народи нека Те слават!"},
	{6, "6 Земјата го даде својот плод; благослови не, Боже, Боже наш!"},
	{7, "7 Да не благослови Бог и сите земни краишта нека се бојат од Него."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view68() {
struct mk68 poems[] = {
	{1, "1 Нека се крене Бог, и да се распрснат непријателите Негови; да бегаат од лицето Негово оние, што Го мразат."},
	{2, "2 Како што домот исчезнува, така да исчезнат; како што восокот се топи од оган, така да загинат грешниците од лицето Божјо."},
	{3, "3 А праведниците да се развеселат, да се зарадуваат пред Бога и ке Го прославуваат во радоста."},
	{4, "4 Пејте Му на Бога, пејте Му на Неговото име; направете Му пат на Оној, Кој се движи по небото; името Му е Господ, и радувајте се пред Него. Kе се смутат од Неговото лице,"},
	{5, "5 Татко на сираците и судија на вдовиците; Он е Бог во Своето свето место."},
	{6, "6 Бог им дава домови на осамените, ги ослободува од окови затворениците, а непокорните остануваат да живеат во пеколна пустиња."},
	{7, "7 Боже, кога Ти излегуваше пред Твојот народ, кога одеше по пустињата,"},
	{8, "8 земјата се тресеше и небесата даваа дожд од лицето Божјо, и Синај - од лицето на Бога, на Бога Израилев."},
	{9, "9 Изобилен дожд изли Ти, Боже, врз Твоето наследство, и кога тоа изнемоштуваше од труд, Ти го поткрепуваше."},
	{10, "10 Стадата Твои живеат на неа; во Својата добрина, Боже, Ти си ја спремил за сиромасите."},
	{11, "11 Гопсод ке им даде збор на гласниците со голема сила."},
	{12, "12 Царот на војските е омилен и во убавината на Својот дом дели плен."},
	{13, "13 Ако заспиете во пределите ваши, ке станете како гулаби со сребрени криља, со перја - од чисто злато."},
	{14, "14 Кога небесниот Цар ги разбиваше царевите, снег па аше на Селмон."},
	{15, "15 Гората Божја е гора богата, гора цврста, богата;"},
	{16, "16 зошто вие, гори високи, завидливо ја гледате гората, на која Бог благоволи да ждивее?"},
	{17, "17 Божјите коли се безброј - на иљада иљади; ме у нив е Господ на Синај, во Светилиштето."},
	{18, "18 Ти се возвиси високо, плени плен, прими дарови за лу ето, така и од непокорните да можат да живеат таму."},
	{19, "19 Нека е благословен Бог од ден во ден, ке го помогне нашето спасение."},
	{20, "20 Нашиот Бог е Бог Кој спасува; во власта на Господа е вратата на смртта."},
	{21, "21 Но Бог ке им ги скриши главите на непријателите Свои и косестото теме на оние што остануваат во своите гревови."},
	{22, "22 Господ рече: од Васан ке ги вратам, ке ги извлечам од морските длабочини,"},
	{23, "23 за да ти се натопи ногата твоја во крвта на непријателите и јазикот на твоите кучиња."},
	{24, "24 Го видов Твоето величествено доа ање, Боже, доа ањето на мојот Бог и Цар во Светилиштето:"},
	{25, "25 напред одеа кнезовите, близу до пеачите, а во средината - девици со тимпани:"},
	{26, "26 'Во собранијата благословувајте го Бога, Господа, вие, што сте од семето Израилево!'"},
	{27, "27 Таму беше Венијамин, најмладиот; кнезовите Јудини - нивни владетели, кнезовите Завулонови, кнезовите Нефталимови."},
	{28, "28 Заповедај, Боже, со силата Твоја, зацврсти го, Боже, тоа што ни го направи нам!"},
	{29, "29 Од Твојот храм во Ерусалим; царевите ке Ти принесуваат жртви."},
	{30, "30 Скроти ги sверовите во мочуриштата, воловите со телињата на народите, да не бидат исклучени од искушувањето со сребро; растури ги народите кои сакаат војна."},
	{31, "31 Kе дојдат молитвеници од Египет; Етиопија порано ке ја подаде раката кон Бога."},
	{32, "32 Цареви земни, појте Му на Бога, воспојте Му на Бога, на Господа,"},
	{33, "33 Кој се возвисил на небо, на небесата на Исток. И, ете, Он на гласот Свој ке му даде сила."},
	{34, "34 Подајте Му слава на Бога! Над Израилот е Неговото велелепие, а силата Негова на облаците."},
	{35, "35 Чудесетн си Ти, Боже, во светоста Своја; Бог Израилев - Он ке му даде сила и крепост на Својот народ. Нека е благословен Бог!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view69() {
struct mk69 poems[] = {
	{1, "1 Спаси ме, Боже, зашто водите стигнаа до душата моја."},
	{2, "2 Потонав во длабока тиња, каде што нема дно; влегов во морска длабочина и бура ме потопи."},
	{3, "3 Изнемоштев од викање; засипна грлото мое; попуштија очите мои, надевајки се на мојот Бог."},
	{4, "4 Оние, што ме мразат без вина, се намножија повеке од косата на главата моја: непријателите мои, кои ме гонат неправедно, се засилија; она што не сум го зел, тогаш го давав."},
	{5, "5 Боже, Ти го знаеш моето безумие, и гревовите мои не се сокриени од Тебе."},
	{6, "6 Да не се посрамат поради мене сите они, што се надеваат на Тебе, Господи, Боже на силите. Да не се посрамат поради мене оние, кои Те бераат, Боже Израилев,"},
	{7, "7 зашто заради Тебе поднесувам исмејување, и срам го обзеде лицето мое."},
	{8, "8 Ту станав за браката свои и чуден за синовите на мајка ми моја."},
	{9, "9 Бидејки ревноста за Твојот дом ме јаде, и подбивите на оние, што Те хулат, па аат врз мене;"},
	{10, "10 и постам со душата своја, но и тоа ми го земаат за зло"},
	{11, "11 место облека облекувам врека; и со тоа им станав за приказ;"},
	{12, "12 против мене зборуваат оние што седат пред портите и пијаниците пеат за мене."},
	{13, "13 Јас, пак, молитвата моја ја упатувам кон Тебе, Господи; благопријатно е времето, Боже, со големата Своја милост услиши ме заради вистината на спасението од Тебе;"},
	{14, "14 изведи ме од калта, за да не потонам; да се избавам од оние, кои ме мразат, а и од длабоките води;"},
	{15, "15 за да не ме потопи водниот вртеж, и длабината да не ме проголта, да не ја затвори над мене бездната својата уста."},
	{16, "16 Услиши, ме, Господи, зашто блага е Твојата милост; поради големата Твоја милосрдност погледај ме;"},
	{17, "17 не одвракај го лицето Свое од чедото Твое, зашто сум нажален; услиши ме брзо;"},
	{18, "18 наклони се кон душата моја и избави ја; поради моите непријатели спаси ме."},
	{19, "19 зашто Ти го знаеш мојот подбив, мојот срам и моето засрамување: пред тебе се сите што ме оскрбуваат."},
	{20, "20 Подбив и срам дочека мојата душа, очекувајки некого во сострадание, но го немаше, и да ме утеши некој; но не го најдов."},
	{21, "21 И ми дадоа жолчка да каснам и кога зажеднев - со оцет ме напоија."},
	{22, "22 Трпезата нивна нека им биде примка, гоштевањето - стапица;"},
	{23, "23 да ми се помрачат очите, та да не гледам, и бедрата нивни ослаби ги засекогаш;"},
	{24, "24 излиј го врз нив гневот Свој, и јароста на Твојот гнев нека ги обземе;"},
	{25, "25 домовите да им ги запустиш, и во шаторите нивни да не остане никој жив;"},
	{26, "26 зашто оној кого Ти го порази, тие го гонат, и со тоа ги умножија болките од раните мои."},
	{27, "27 Притури беззаконие врз беззаконието нивно, за да не влезат во Твојата правда."},
	{28, "28 Нека бидат избришани од книгата на живите и да не бидат запишани ме у праведните."},
	{29, "29 Јас, пак, сум беден и страдам; нека дојде од тебе, Боже, спасението за мене!"},
	{30, "30 Kе го славам името на мојот Бог со песна, ке го возвеличувам во славословија,"},
	{31, "31 и тоа ке Му биде поугодно на Господа, отколку теле или јунец со рогови и со копита."},
	{32, "32 Нека го видат тоа оние што страдаат и нека се зарадуваат. Побарајте Го Бога за да ви оживи душата ваша,"},
	{33, "33 зашто Господ ги услишува сиромасите и не ги презира затворениците Свои."},
	{34, "34 Нека Го пофалат небесата и земјата, морето и се што живее во него;"},
	{35, "35 зашто Бог ке го спаси Сион, ке се изградат градови во Јудеја, и таму ке ги наследат;"},
	{36, "36 и потомството на слугите Твои ке се весели во него."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view70() {
struct mk70 poems[] = {
	{1, "1 Боже, дојди ми на помош, побрзај, Господи, да ми помогнеш."},
	{2, "2 Нека поцрвенеат и нека се засрамат оние, што ја бараат душата моја! Нека се уплашат, нека се уплашат и засрамат оние, кои ми пожелуваат зло."},
	{3, "3 Нека отстапат и нека се посрамат оние што ми викаат: 'така! така!'"},
	{4, "4 Нека се зарадуваат и развеселат со Тебе сите, кои Те бараат, и кои Те сакаат Тебе, Боже, и кои сакаат спасение од Тебе, и нека велат: 'Да се возвеличува Господ!'"},
	{5, "5 Јас, пак, сум беден и сиромав; поможи ми Боже, Ти си, Господи, помошник мој и избавител мој, не се забавај!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view71() {
struct mk71 poems[] = {
	{1, "1 На Тебе Господи, се надевам, да не останам посрамен вечно."},
	{2, "2 Избави ме поради праведноста Своја и очисти ме; приклони го увото Свое кон мене и спаси ме."},
	{3, "3 Биди ми Бог заштитник, изведи ме на место сигурно - зашто Ти си моја крепост и мое прибежиште."},
	{4, "4 Боже мој, избави ме од рацете на грешникот, од рацете на престапникот и насилникот,"},
	{5, "5 зашто Ти си моја надеж, Господи, моја сигурност од младоста моја."},
	{6, "6 За Тебе цврсто се држам од ра ањето мое; Ти си мој покровител од мајчината ми утроба; за Тебе вечно ке пеам."},
	{7, "7 За многумина бев како некое чудо, но Ти си мојот силен помошник."},
	{8, "8 Нека се исполни устата моја со похвала, па со песна да ја величам славата Твоја; и цел ден да пеам за Твоето велелепие."},
	{9, "9 Не отфрлај ме на старост, кога ке почне силата моја да исчезнува, не напуштај ме,"},
	{10, "10 зашто непријателите мои зборуваат против мене; и оние, кои ја демнат душата моја, се договараат ме у себе,"},
	{11, "11 велејки: 'Го остави Бог; гонете го и фатете го, зашто нема кој да го избави'."},
	{12, "12 Боже мој, не се оддалечувај од мене; Боже мој, побрзај ми на помош!"},
	{13, "13 Да се посрамат и да исчезнат оние што ја клеветат душата моја; да поцрвенат и се засрамат оние, што ми сакаат зло."},
	{14, "14 Јас, пак, секогаш ке се надевам на Тебе и ке Те восхвалувам се повеке."},
	{15, "15 Устата моја ке ја разгласува Твојата правда, и секој ден спасението од Тебе, зашто не им го знам бројот."},
	{16, "16 Kе влезам во силата Господова; Господи, ке ја спомнувам Твојата правда - само Твојата."},
	{17, "17 Боже, Ти ме поучуваше од младоста моја, и јас се досега ги објавував чудесата Твои."},
	{18, "18 И во староста, па и кога ке престареам, Боже, не напуштај ме, за да ја објавувам мишката Твоја, силата Твоја и правдата Твоја на сегашниот род и на идниот,"},
	{19, "19 силата Твоја и правдата Твоја, Боже, дури до вишното небо, и за делата Твои со кои си ме возвеличил, Боже, кој е сличен на Тебе??"},
	{20, "20 Колку големи и тешки маки ми прати, но Ти пак ме оживуваше, кога Ти се обракав, и пак ме изведуваше од земните длабини."},
	{21, "21 Зголемувајки ги Своите добрини и свртувајки се кон мене, ме утешуваше и, пак ме изведуваше од земните бездни."},
	{22, "22 И јас ке ја славам ме у лу ето на харфа Твојата вистина, Боже мој; ке Те воспевам на гусла, Светецу Израилев!"},
	{23, "23 Kе се радува устата моја, кога ке Ти пеам, и душата моја, која си ја избавил."},
	{24, "24 И јазикот мој секогаш ке зборува за Твојата правда, кога ке поцрвенеат и ке се засрамат оние, кои ми пожелуваа зло."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view72() {
struct mk72 poems[] = {
	{1, "1 Боже, дај му го на царот Својот суд, а на царевиот син - Својата правда,"},
	{2, "2 за да им суди праведно на Твоите лу е и на сиромасита Твои по правда."},
	{3, "3 Горите нека им донесат мир на лу ето, и ритчињата - праведност,"},
	{4, "4 Он ке им суди на бедните ме у лу ето, и ке ги спаси синовите на сиромасите, а клеветникот ке го понизи."},
	{5, "5 И ке живеат, додека постои сонцето и месечината - од род во род."},
	{6, "6 И ке слезе како дожд на ливада, како капки што наросуваат земја."},
	{7, "7 Во Негово време ке зацари правда, и ке има изобилен мир се додека не се одземе месечината."},
	{8, "8 И ке владее од море до море и од реката до краиштата на земјата."},
	{9, "9 Пред Него ке паднат ничкум Етиопјаните, и непријателите Негови ке ја лижат прашината;"},
	{10, "10 царевите на Тарсис и островјаните дарови ке му принесуваат; и царевите на Арабија и од Саба дарови ке му донесуваат."},
	{11, "11 И ке Му се поклонуваат сите цареви; ке Му служат сите народи;"},
	{12, "12 зашто Он ке избави беден од силник и сиримав, кој нема помошник."},
	{13, "13 Kе го поштеди бедниот и сиромавиот и ке го спаси животот на сиромасите;"},
	{14, "14 од лихви и неправди ке ги избави душите нивни, и чесно ке биде името нивно пред Него;"},
	{15, "15 и Он ке поживее, па ке му даваат арабиско злато; и ке Му се молат непрестајно, секој ден ке Го благословуваат;"},
	{16, "16 Kе има тврдина на земја, по врвовите на горите; плодот Негов ке се издига над Ливан, а во градовите лу ето ке се размножуваат како тревата по земјата,"},
	{17, "17 Неговото име нека биде благословувано вечно: уште пред сонцето Неговото име постои; и во Него ке бидат благословени сите земни премиња, а и сите народи ке Го ублажуваат."},
	{18, "18 Нека е благословен Господ Бог, Бог Израилев, Кој само Он прави чудеса;"},
	{19, "19 и нека е благословено Неговото славно име довека, и со славата Негова нека се исполни целата земја! Амин и амин!"},
	{20, "20 Завршија молитвите на Давида, Јесеевиот син."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view73() {
struct mk73 poems[] = {
	{1, "1 Колку е добар Бог кон Израилот, кон оние што се со чисто срце!"},
	{2, "2 А нозете мои за малку не потклекнаа, за малку чекорите мои ке станеа несигурни, -"},
	{3, "3 зашто им позавидев на беззакониците, гледајки како мирно живеат грешниците,"},
	{4, "4 оти не страдаат се до самата смрт, и цврстина им е во бичот."},
	{5, "5 во човечките работи не учествуваат и невољите на другите лу е нив не ги засегаат."},
	{6, "6 Затоа гордоста владее со нив; се облекле во неправда и нечестие;"},
	{7, "7 неправдата им излегува како од сало, и му угодуваат на срцето;"},
	{8, "8 се подбиваат и лукаво зборуваат, за неправдата гордо говорат;"},
	{9, "9 ја креваат устата кон небото, а јазикот нивни ја обиколува земјата."},
	{10, "10 Затоа народот Мој ке се врати ваму, и своите денови ке ги најде исполнети."},
	{11, "11 И рекоа: 'Како дозна Бог, и има ли знаење во Севишниот?'"},
	{12, "12 Ете, такви се грешниците и успеваат вечно да го држат богатството."},
	{13, "13 И си реков: зар залудо го држев срцето свое во праведност и во невиност ги измив рацете свои."},
	{14, "14 и се изложував на напријатности секој ден и на срам секое утро?"},
	{15, "15 Но ако речев: ке расудувам и јас така, - тогаш ке го изневерев родот на Твоите синови."},
	{16, "16 И сакав тоа да го разберам, но тоа беше тешко за мене"},
	{17, "17 се додека не влезам во Божјото светилиште и не го разбрав нивниот крај."},
	{18, "18 И така, заради подмолноста нивна дозволи да ги снајде зло, и ги понизи кога се возгордееја."},
	{19, "19 Како запустеа, како нејнадејно изчезнаа и загинаа поради своето беззаконие!"},
	{20, "20 Како сон кога човек се разбудува, така во градот Твој, Господи, образот нивни уништи го."},
	{21, "21 Зашто срцето мое се разгоре и утробата моја се измени."},
	{22, "22 А јас поразен и не разбрав, како добиче бев пред Тебе."},
	{23, "23 Но Јас сум секогаш со Тебе: Ти ми ја придржуваш десницата моја,"},
	{24, "24 ме упати со советот Свој и ме прими во Твојата слава."},
	{25, "25 Кого Го имам јас на небото освен Тебе? А кога сум со Тебе на земјата ништо не барам."},
	{26, "26 Изнемоште срцето мое и телото мое; Боже на срцето мое и наследството мое, Боже, довека."},
	{27, "27 Зашто, ете, оние, што се оддалечуваат од Тебе, пропа аат; Ти го истребуваш секого, кој отстапува од Тебе."},
	{28, "28 А мене ми е добро да сум со Бога, на Господа ја полагам надежта моја, за да ги вознесувам сите похвали Твои кај портите на керката Сионова."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view74() {
struct mk74 poems[] = {
	{1, "1 Зошто Боже, не отфрли засекогаш? Зошто гневот Твој се разгоре на овците од Твоето пасиште?"},
	{2, "2 Сети се на Твојот народ, кого уште од порано го придоби, ги избави со жезалот како наследсто Твое, тоа е гората Сионска, на која си се населил."},
	{3, "3 Крени ги рацете Свои против нивната крајна гордост, против сите зла што непријателот ги направи во светилиштето Твое."},
	{4, "4 И се пофалија Твоите непријатели среде празникот Твој; поставија свои бојни знаци како знамиња, но не ги познаа."},
	{5, "5 зашто горе при влезот многу ги имаше,"},
	{6, "6 па како во густа горичка со секира ја исекоа нејзината врата, со секира и дрвен чекан одеднаш ја скршија;"},
	{7, "7 го запалија со оган Твоето Светилиште, го осквернија на земјата местото, на кое името Твое престојува."},
	{8, "8 Регоа во срцата свои оние што беа сродни на нив: 'Ајде да отстапиме од сите Божји празници на земјата!"},
	{9, "9 Знаците свои не ги гледаме, нема повеке ни пророк, и за нас нема веке да се знае.'"},
	{10, "10 До кога, Боже, ке се гордее над нас непријателот? Вечно ли противникот ке го дразни името Твое?"},
	{11, "11 Зошто ја одвракаш раката Своја и десницата Своја во пазувите Свои ја држиш?"},
	{12, "12 Но Бог е Царот наш уште од пред вековите, Он приготвил спасение среде земјата!"},
	{13, "13 Боже, со силата Своја Ти си ги утврдил морињата, и ги сотре главите на водните страшила."},
	{14, "14 Ти и ја здроби главата на змијата и им ја даде како храна на народот етиопски."},
	{15, "15 Ти ги отвори изворите и потоците, ти ги исуши реките итамски."},
	{16, "16 Твоје е денот и Твоја е нокта: Ти си ги постави светилата и сонцето;"},
	{17, "17 Ти ги создаде сите предели на земјата, летото и пролетта Ти ги определи."},
	{18, "18 Сети се сепак на ова; непријателот го навреди Господа; лу е безумни го раздразнија Твоето име."},
	{19, "19 Не прадавај ја на sверовите душата на оние кои се надеваат на Тебе; не заборавај ги засекогаш душите не сиромасите Твое."},
	{20, "20 Погледај на Својот завет, зашто сите мрачни домови по земјата се исполнија со беззаконици;"},
	{21, "21 Да не се врати посрамен потиснатиот; сиромавиот и бедниот ке го прославуваат Твоето име."},
	{22, "22 Стани Боже, по правдата Своја пресуди; сети се како секој ден Те хули безумникот."},
	{23, "23 Не заборавај го гласот на оние кои Ти се молат; гордоста на оние што Те мразат постојано се крева против Тебе."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view75() {
struct mk75 poems[] = {
	{1, "1 Kе Те фалиме Тебе, Боже, ке Те фалиме, и ке го призиваме името Твое."},
	{2, "2 Kе ги разгласувам Твоите чудеса кога ке дојде време; ке судам по правда."},
	{3, "3 Kе се заниша земјата и сите, што живеат на неа. Но Јас ги зацарив столбовите нејзини."},
	{4, "4 Им реков на оние, што вршат беззаконија: не отстапувајте од законот, и на грешниците: не дигајте рог,"},
	{5, "5 не кревајте го високо вашиот рог, не говорете против Бога неправда,"},
	{6, "6 зашто издигањето не доа а ни од исток, ни од запад, ниту, пак, од пустите гори;"},
	{7, "7 но Бог е судија: едни унижува, а други возвисува."},
	{8, "8 Зашто чашата е во раката на Господа, со вино немешано, добро, и Он налева од неа по ред, но талогот нема да се источи; од него ке пијат сите грешници на земјата."},
	{9, "9 Јас, пак, вечно се радувам, ке Му пеам на Јакововиот Бог,"},
	{10, "10 ке го скршам рогот на сите грешници, а рогот на преведниците ке се возвиси."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view76() {
struct mk76 poems[] = {
	{1, "1 Познат е Бог во Јудеја; големо е Неговото име во Израилот."},
	{2, "2 Во светото е Неговото место, а Неговото живеалиште - на Сион."},
	{3, "3 Таму Он ја порази силата на стрелите, штитот и мечот и војната."},
	{4, "4 Светлината Твоја е чудесна од вечните гори."},
	{5, "5 Се збркаа сите неразумни по срце; заспаа богатите лу е и ништо не најдоа во рацете од богатствата свои."},
	{6, "6 Од Твојата закана, Боже Јаковов, задремаа коњаниците."},
	{7, "7 Ти си страшен, и кој ке Ти се противстави Тебе? Оттаму е Твојот гнев."},
	{8, "8 Од небесата се чу глас дека ке судиш; земјата се уплаши и се смири."},
	{9, "9 Кога Бог стана да суди, за да ги спаси сите кротки по земјата,"},
	{10, "10 бидејки мислите свои лу ето ке Ти ги исповедаат: а и остатокот од нив ке Те прославува."},
	{11, "11 Заветувајте се на Господа, вашиот Бог, и исполнувајте ги заветите; сите, што сте околу Него, принесувајте дарови,"},
	{12, "12 Страшниот, Кој ги скротува духовите и кнезовите, пострашен е од земните цареви."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view77() {
struct mk77 poems[] = {
	{1, "1 Со гласот свој повикав кон Господа, со гласот свој кон Бога, и Он ме услиши."},
	{2, "2 Во денот на тагата моја Го побарав Бога ноке, со издигнати кон Него раце и не се уморив; но душата моја не можеше да се утеши."},
	{3, "3 Го спомна Бога и се развеселив, размислував и духот мој стана малодушен."},
	{4, "4 Будни се очите мои, се возбудив и не можев да говорам."},
	{5, "5 Размислував за првите дни, и се сетив за годините прастари, па се поучив;"},
	{6, "6 Размислував ноке со срцето свои, а духот мој ме испитуваше;"},
	{7, "7 зар Господ засекогаш те отфрли и не сака ли повеке да биде благонаклон, или"},
	{8, "8 засекогаш престанала Неговата милост, и Неговото слово се пресекло од род во род?"},
	{9, "9 Зар Господ заборавил на штедроста Своја? Зар во гневот Свој ке го затвори Своето милосрдие?"},
	{10, "10 Па си реков: 'Сега знам - десницата на Севишниот се изменила.'"},
	{11, "11 Се сетив за делата на Господа; се сетив за Твоите први чудеса;"},
	{12, "12 и ке се поучам во сите Твои дела и ке зборувам за постапките Твои."},
	{13, "13 Боже, Твојот пат е свет. Кој Бог е толку голем, како нашиот Бог!"},
	{14, "14 Ти си Бог, Кој прави чудеса; Ти ја покажа силата Своја ме у народите;"},
	{15, "15 Ти со мишката Своја го избави Твојот народ, синовите на Јакова и на Јосифа."},
	{16, "16 Те видоа, Боже, водите, Те видоа водите и се разбрануваа, и бездните затрепереа."},
	{17, "17 Голем шум од води се слушаше, загрме од облаците, зашто стрелите Твои пролетуваа."},
	{18, "18 Гласот на Твојот гром се разнесуваше по небото; светкавици ја осветлуваа вселената; земјата трепереше и се тресеше."},
	{19, "19 Твојот пат води кон морето, но Твоите патеки во многуте води и Твоите траги не ке се познаваат."},
	{20, "20 Ти ги водеше како овци лу ето Твои преку раката на Мојсеја и Арона."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view78() {
struct mk78 poems[] = {
	{1, "1 Внимавајте лу е Мои на законот Мој, нека чуе увото ваше што зборува устата Моја."},
	{2, "2 Ја отворам устата своја за парабола и ке зборувам за непознатите работи од старо време."},
	{3, "3 Се чувме и дознавме и што ни раскажуваа татковците наши,"},
	{4, "4 не остана сокриено од нивните деца, зашто на идниот род му се раскажуваше славата на Господа и силата Негова, и чудесата Негови што Он ги изврши."},
	{5, "5 Он подигна сведоштво во Јакова и положи закон во Израилот, и им заповеда на татковците наши сето тоа да им го објават на децата свои,"},
	{6, "6 за да знае идниот род, децата, што ке се родат, та и тие во свое време да им раскажуваат на своите деца,"},
	{7, "7 да ги полагаат надежите свои на Бога, да не ги забораваат делата Божји, да ги чуваат Неговите заповеди"},
	{8, "8 и да не бидат како татковците нивни - род упорен и бунтовен, непостојан по срце и не му остана верен на Бога со духот свој."},
	{9, "9 Синовите Ефремови, вооружени, стрелајки со лакови, отстапија во денот на битката:"},
	{10, "10 тие не го запазија заветот на Бога и не сакаа да одат по Неговиот закон."},
	{11, "11 Ги заборавија Неговите добрини и чудеса, што им ги беше покажал,"},
	{12, "12 чудесата што пред очите на нивните татковци ги направи во Египетската земја, во полето Танеос;"},
	{13, "13 го раздвои морето и ги преведе преку него, и ги постави водите како мев;"},
	{14, "14 дење ги водеше со облак, а по цела нок - со огнена свтлина;"},
	{15, "15 разби карпа во пустињата и ги напои како од голема бездна."},
	{16, "16 Од карпата изведе вода, и води потекоа како реки."},
	{17, "17 Но ти е продолжуваа и понатаму да грешат пред Него и да Ги огорчуваат Севишниот во пустињата:"},
	{18, "18 го искушуваат Бога со срцето свое, барајки храна за своите души,"},
	{19, "19 па го нападнаа Бога, велејки 'Може ли Бог да приготви трпеза во пустиња?'"},
	{20, "20 Ете, Он удри во карпата - и бликнаа води, потекоа потоци. Може ли Он да му даде и леб, може ли да му приготви трпеза на Својот народ?"},
	{21, "21 Поради ова што го чу, Господ ги презре и пламна во гнев, и оган се разгоре против Јакова и гнев се крена против Израилот,"},
	{22, "22 затоа што не поверуваа во Бога и не се надеваат на спасението од Него."},
	{23, "23 Он им заповеда на облаците одозгора и се отворија вратите на небесата,"},
	{24, "24 па ги одожди со мана за храна, и им даде леб небесен."},
	{25, "25 Леб ангелски јадеше човекот: Он им испрати храна до наситување."},
	{26, "26 Го раздвижи од небото јужниот ветар и со силата Своја го дотера југозападниот ветар,"},
	{27, "27 па ги одожди со месо како со прав и со птици пернати како со песок морски:"},
	{28, "28 ги нафрла среде нивниот табор, околу нивните живеалишта,"},
	{29, "29 и тие јадеа и се заситија: и тоа што го сакаа, им го даде."},
	{30, "30 Но уште не беше милана нивната желба, и храната уште им беше во устата нивна,"},
	{31, "31 а гневот Божји дојде врз нив, ги уби нивните најсилни и Израилевите момчиња ги погуби."},
	{32, "32 При сето тоа тие продолжуваа да грешат и не поверуваа во чудесата Негови."},
	{33, "33 И така им минеа дните нивни во суета и годините нивни во смутови."},
	{34, "34 Кога ги убиваше, тогаш Го бараа, се обрнуваа и прибегнуваа кон Бога,"},
	{35, "35 и се секаваа дека Бог е нивни помошник и дека Севишниот Бог е нивни избавител:"},
	{36, "36 и со устата своја Го мамеа, а со јазикот свој лажеа пред Него;"},
	{37, "37 но срцето нивно не Му беше наполно верно, и тие не беа цврсти во заветот Негов."},
	{38, "38 Но Он, Милостивиот, им го простуваше гревот и не ги истребуваше, многупати ја отстрануваше јароста Своја и не го разгоруваше сиот Свој гнев:"},
	{39, "39 но Он знаеше дека се тие тело и здив што оди и не се врака."},
	{40, "40 Колкупати Го беа загорчувале во пустињата и Го беа разгневувале во безводната земја!"},
	{41, "41 И отстапуваа и одново Го искушуваа Бога и Го раздразнуваа Светецот Израилев;"},
	{42, "42 не се секаваа на Неговата рака, ни на денот кога Он ги избави од оној, што ги оскрбуваше;"},
	{43, "43 кога ги покажа во Египет Своте знаци и во полето Тенеос - Своите чудеса;"},
	{44, "44 и ги претвори реките нивни и потоците нивни во крв, за да не можат да пијат;"},
	{45, "45 испрати на нив бубачки да ги боцкаат и жаби да ги погубуваат;"},
	{46, "46 житото нивно го предаде на гасеници и трудот нивни на скакулци;"},
	{47, "47 лозјата им ги исчука со град и смоквите нивни - со слана."},
	{48, "48 и добитокот нивни го уништи со град, а имотот нивни - со оган;"},
	{49, "49 го испрати врз нив гневот на јароста Своја, јарост, и гнев, и маки - одред зли ангели;"},
	{50, "50 го отвори патот на Својот гнев, не ги поштеди од смрт ни душите нивни и добитокот нивни го предаде на помор;"},
	{51, "51 уништи се што беше првородено во Египет, привините од нивниот труд во Храмовите населби."},
	{52, "52 Тогаш го поведе Својот народ како овци, и ги водеше како стадо преку пустињата:"},
	{53, "53 ги водеше сигурно, и тие не се уплашија; непријателите нивни ги покри морето -"},
	{54, "54 и Ги воведе во светата Своја гора, онаа, која десницата Негова ја беше придобила;"},
	{55, "55 и ги изгони од пред лицето нивно народите, а земјата им ја раздели со жреб во нивно наследство, и ги насели Израилевите колена во полињата нивни."},
	{56, "56 Но Ти го искушуваа и Го огорчуваа Бога Севишниот и не ги пазеа наредбите Негови."},
	{57, "57 Отстапија и се оттргнаа како татковците нивни, се претворија во искривен лак."},
	{58, "58 Го разгневуваа на ридовите свои и со своите идоли Го раздразнуваа."},
	{59, "59 Бог го чу тоа, ги презре и многу го понизи Израилот;"},
	{60, "60 ја отфрли скинијата во Силом, во која се всели Он ме у лу ето;"},
	{61, "61 и ја предаде во ропство нивната крепост и убавината нивна во рацете на непријателот;"},
	{62, "62 па го предаде Својот народ на меч и го презре Своето наследство."},
	{63, "63 Момчињата нивни оган ги голташе, и за девиците нивни немаше брачни песни;"},
	{64, "64 свештениците нивни па аа од меч, и вдовиците нивни не беа оплакувани."},
	{65, "65 Тогаш се разбуди Господ како од сон, како јунак од вино совладан,"},
	{66, "66 и го порази непријателите Свои од зад грб и ги предаде на вечен срам."},
	{67, "67 И го отфрли Јосифовиот шатор и не го избра коленото Ефермово,"},
	{68, "68 туку го избра коленото Јудино, гората Сион, која ја возљуби."},
	{69, "69 И изгради светилиште Свое како небото и како земјата го утврди за секогаш,"},
	{70, "70 и го избра Давида својот слуга, го зеде од овчите стада,"},
	{71, "71 и од овците што се јагнат го доведе за да го пасе народот Негов, Јакова, и Израилот, наследството Негово."},
	{72, "72 И Он ги пасеше со чисто срце и ги водеше со Својата мудра рака."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view79() {
struct mk79 poems[] = {
	{1, "1 Боже, незнабожците дојдоа во Твоето наследство, го осквернија светиот Твој храм, Ерусалим го претворија во урантини."},
	{2, "2 Мртвите тела на Твоите слуги им ги дадоа како храна на птиците небесни, а телата на Твоите светии - на земните sверови;"},
	{3, "3 ја пролија нивната крв како вода околу Ерусалим, и немаше кој да ги погребе."},
	{4, "4 Станавме за потсмев на соседите наши, срам и подбив за оние што се околу нас;"},
	{5, "5 До кога, Господи, ке се разгневуваш постојано, до кога ке гори лутината Твоја како оган?"},
	{6, "6 Излеј го гневот Свој врз народите, што не Те познаваат, и врз царствата, кои не го признаваат името Твое,"},
	{7, "7 зашто тие го испојадоа Јакова и местото негово го опустошија."},
	{8, "8 Не спомнувај ги нашите поранешни беззаконија, туку побрзај да не престретнеш со Својата милосрдност, зашто многу сме осиромашени."},
	{9, "9 Помогни ни, Боже, Спасителе наш, поради славата на името Твое, избави не и очисти не од гревовите наши заради името Твое!"},
	{10, "10 Зашто незнабожците да велат: 'Каде е нивниот Бог?' Барем пред очите наши да ја видиме одмаздата над незнабожците за пролеаната крв на Твоите слуги."},
	{11, "11 Да дојде пред Тебе офкањето на окованите; со силата на Твојата мишка зачувај ги синовите осудени на смрт."},
	{12, "12 Седумкратно врати ги во пазувите на нашите соседи хулењата, со кои Те хулеа Тебе, Господи."},
	{13, "13 А ние, пак, народот Твој и овци од Твоето пасиште, вечно ке Те славиме и од род во род ке разгласуваме за Тебе похвала."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view80() {
struct mk80 poems[] = {
	{1, "1 Пастиру Израилев, послушај! Ти, Кој го водиш Јосифа како стадо, Кој седиш на херувимите, јави се!"},
	{2, "2 Пред Ефрема, Венијамина и Манасија издигни ја силата Своја и дојди да не спасиш."},
	{3, "3 Боже, поврати не; нека светне лицето Твое, и ние ке се спасиме!"},
	{4, "4 Господи, Боже на силите, до кога ке бидеш гневен на молитвата од слугите Твои?"},
	{5, "5 Kе не храниш ли со солзлив леб, и напојуваш со солзи изобилно?"},
	{6, "6 Не направи приказ за кавги ме у нашите соседи, и нашите непријатели ни се смеат."},
	{7, "7 Господи, Боже на силите, поврати не! Нека светне лицето Твое, и ние ке се спасиме!"},
	{8, "8 Ти ја пренесе од Египет лозата, ги изгони народите и ја посади;"},
	{9, "9 исчисти за неа место, и ги зацврсти корењата нејзини, и таа ја исполни земјата."},
	{10, "10 Горите се покрија од сенката нејзина, и гранките и се како кедрови Божји;"},
	{11, "11 таа пушти гранки до морето и младици до реката."},
	{12, "12 Зошто ја сруши нејзината ограда, па да ја берат сите, што минуваат по патот?"},
	{13, "13 Горскиот вепар ја подгризува, и полската sверка ја јаде."},
	{14, "14 Боже на силите! Сврти се, погледај од небесата и види го и посети го ова лозје;"},
	{15, "15 и утврди го она што го посади десницата Твоја; погледај и на синот човечки, што си го зацврстил за Себе."},
	{16, "16 Тоа е со оган обгорено и раскопано; од страв пред Твоето лице нека пропаднат."},
	{17, "17 Твојата десница нека биде раката Твоја над човекот, и на синот човечки, кого си го зацврстила за Себе."},
	{18, "18 А ние нема да отстапиме од Тебе; оживи не, и ние ке го призиваме Твоето име."},
	{19, "19 Господи, Боже на силите, поврати не; нека свети лицето Твое, и ние ке се спасиме!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view81() {
struct mk81 poems[] = {
	{1, "1 Радувајте се во Бога, нашиот помошник, воскликнете кон Бога Јаковов;"},
	{2, "2 запејте песна, удрете во тимпан, во милозвучно гусле со псалтир;"},
	{3, "3 затрубете со труба во новомесечје, во определено време, во денот на вашиот празник,"},
	{4, "4 зашто тоа е закон за Израилот, наредба од Бога Јаковов."},
	{5, "5 Он го установи тоа како сведоштво за Јосифа, кога тој излезе од Египетската земја, каде што чу јазик, што не го знаеше:"},
	{6, "6 'Јас го симнав товарот од рамениците негови, и му ги ослободив рацете негови од кошницата."},
	{7, "7 Во маката своја ти Ме повика, и Јас те избавив; при гром те чув, кај водите на Мерива те испитав."},
	{8, "8 Чуј, народе Мој, и Јас ке ти посведичам, ако Ме послушаш, Израиле!"},
	{9, "9 Да немаш друг бог и да не му се клањаш на друг земен бог."},
	{10, "10 Јас сум Господ, Бог твој, Кој те изведе од Египетската земја; отвори ја устата своја, и Јас ке ја исполнам."},
	{11, "11 Но мојот народ не го послуша гласот Мој, и Израилот не Ми се поклони;"},
	{12, "12 затоа Јас ги оставив на нивните упорни срца; нека одат по мислите свои."},
	{13, "13 О, да беше Ме послушал Мојот народ и Израилот да одеше по Моите патишта,"},
	{14, "14 веднаш ке ги смирев нивните непријатели и ке ја свртев раката Своја против оние што го оскрбуваа.'"},
	{15, "15 Оние, што го мразат Господа, сакаа да Му се приближат, и нивното дружење би продолжило за секогаш;"},
	{16, "16 ке ги хранев со најдобра пченица и ке ги наситував со мед од камен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view82() {
struct mk82 poems[] = {
	{1, "1 Бог застана во собранието на 'боговите'; ме у 'боговите' изрече суд:"},
	{2, "2 До кога ке судите неправедно и спрема грешниците ке покажувате пристрастност?"},
	{3, "3 Пазете на сирак и беден, праведен и сиромав;"},
	{4, "4 ослободувајте го сиромавиот и бедниот од рацете на грешниците."},
	{5, "5 Не знаат, не разбират, во темнина одат; сите земни основи ке се разнишаат,"},
	{6, "6 Јас реков: вие сте богови, вие сте сите синови на Севишниот;"},
	{7, "7 но вие ке умрете како лу е, и ке па ате како секој кнез.'"},
	{8, "8 Стани, боже, суди и на земјата, зашто Твои се по наследство сите народи."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view83() {
struct mk83 poems[] = {
	{1, "1 Боже, кој може да се спореди со Тебе? Не премолчувај, и не смирувај се Боже,"},
	{2, "2 зашто ете Твоите непријатели вреват, а оние, што Те мразат, кренаа глава;"},
	{3, "3 против Твојот народ зло наумија и се советуваат против светите Твои;"},
	{4, "4 рекоа: 'Да отидеме и да го истребиме ме у народите, па да не се спомнува повеке името Израил.'"},
	{5, "5 Се договорија еднодушно, склучија против Тебе сојуз;"},
	{6, "6 населбите Едомови и Исмаилски, Моав и Агарјани;"},
	{7, "7 Гавал, Амон, Амалик и другоплемениците се оние што живеат во Тир,"},
	{8, "8 бидејки и Асур се придружи кон нив, па станаа помош за синовите Лотови."},
	{9, "9 Направи ми го истото, како што им направи на Мадијамците, како и на Сисарите, како и на Јавин кај потокот Кисон,"},
	{10, "10 кои беа истребени во Аендор и станаа убре за земјата."},
	{11, "11 Постапи со нив, со нивните кнезови, како со Орив и Зива и со сите нивни кнезови, како со Зевеј и Саламан,"},
	{12, "12 бидејки велат: 'Да го присвоиме за себе светилиштето Божјо!'"},
	{13, "13 Боже мој, заповедај да станат како виор и како плева пред ветар;"},
	{14, "14 како оган што изгорува дубрави, и како пламен што запалува гори."},
	{15, "15 Така и Ти подгони ги лицата нивни со бесчестие, па да го побараат името Твое, Господи!"},
	{16, "16 исполни ги лицата нивни со бесчестие, па да го побараат името Твое, Господи!"},
	{17, "17 Да се засрамат и да се збунат засекогаш, да се посрамат и да загинат,"},
	{18, "18 и да познаат, дека името Ти е Господ, и дека Ти си единствен Севишен над целата земја."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view84() {
struct mk84 poems[] = {
	{1, "1 Колку се мили Твоите живеалишта, Господи на силите!"},
	{2, "2 Копнее душата моја сакајки да е во Господовите дворови; срето мое и телото мое со радост се стремат кон живиот Бог."},
	{3, "3 И птичката си нао а живеалиште, и ластовичката гнездо, каде што ке ги положи пиоњата свои, а јас при олтарите Твои, Господи на силите, Цару мој и Боже мој!"},
	{4, "4 Блажени се оние, кои живеат во домот Твој тие постојано Те фалат."},
	{5, "5 Балажен е оној човек, кој заштита бара кај Тебе и во чие срце се патиштата Твои."},
	{6, "6 Преминувајки ја долината на плачот, тие нао аат извори во неа, и дожд ја покрива со благослови;"},
	{7, "7 минуваат од сила во сила, се јавуваат пред Бога, на Сион."},
	{8, "8 Господи, Боже на силите, услиши ја молитвата моја, послушај, Боже Јаковов!"},
	{9, "9 Боже, заштитнику наш, погледај и види го лицето на твојот помазаник!"},
	{10, "10 Зашто еден ден во Твоите дворови е подобар отколку - иљада дни надвор. Повеке сакам да бидат на прагот пред Божјиот дон, отколку да живеам во населбите на грешниците."},
	{11, "11 Бидејки Господ Бог сака милост и вистина, дава благодат и слава; Господ не ги лишува од блага оние, што одат непорочно."},
	{12, "12 Господ на силите, блажен е оној човек, кој се надева на Тебе!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view85() {
struct mk85 poems[] = {
	{1, "1 Господи, Ти омиле земјата Твоја, го врати од пленство Јакова."},
	{2, "2 Ти им ги прости беззаконијата на Твоите лу е, ги покри сите нивни гревови,"},
	{3, "3 го смири сиот Свој гнев, ја ублажи јароста на гневот Свој."},
	{4, "4 Поврати не, Боже, спасение наше, и одврати ја Твојата јарост од нас."},
	{5, "5 Зар вечно ке се гневиш на нас, или ке го протегнеш гневот Свој од род во род?"},
	{6, "6 Нема ли, Боже, да се повратиш, и пак да не оживееш, и лу ето Твои да се зарадуваат во Тебе?"},
	{7, "7 Покажи ни ја, Господи, Твојата милост, и подари ни спасение."},
	{8, "8 Kе чујам што ке ми рече Господ Бог, зашто Он ке зборува за мир на Својот народ и на Своите светии, и на оние што со срцето свое Му се обракаат Нему."},
	{9, "9 Да, спасението од Него е блиску до оние, кои се бојат од Него, за да ја насели славата своја во нашата земја."},
	{10, "10 Милоста и вистината ке се сретнат, правдата и мирот ке се целиваат."},
	{11, "11 Вистината ке изникне од земјата, а правдата ке се појави од небото;"},
	{12, "12 Зашто Господ ке даде добро, и нашата земја ке го даде својот плод;"},
	{13, "13 правдата ке оди пред Него и на патот ке ги става стапките свои."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view86() {
struct mk86 poems[] = {
	{1, "1 Приклони го, Господи, увото свое и услиши ја молитвата моја, зашто сум беден и сиромав."},
	{2, "2 Зачувај ја душата моја, зашто сум смирен; спаси го слугата Твој, Боже мој, кој се надева на Тебе."},
	{3, "3 Помилуј ме, Господи, зашто кон Тебе викам секој ден."},
	{4, "4 Развесели ја душата на Твојот слуга, оти кон Тебе, Господи, ја вознесувам душата своја;"},
	{5, "5 зашто Ти, Господи, си добар, кроток и многумилостив кон сите, кои Те признаваат."},
	{6, "6 Чуј ја, Господи, мојата молитва и послушај го гласот на молбата моја."},
	{7, "7 Во денот на мојата мака повикав кон Тебе, и Ти ме чу."},
	{8, "8 Ме у боговите нема таков каков што си Ти, Господи, и нема дела како Твоите."},
	{9, "9 Сите народи што си ги создал Ти, ке дојдат и ке се поклонат пред Тебе, Господи, и ке го прославуваат името Твое,"},
	{10, "10 зашто Ти си велик и правиш чудеса, - Ти си Бог единствен!"},
	{11, "11 Упати ме, Господи, кон Твојот пат, и јас ке одам во Твојата вистина; и нека се радува срцето мое, плашејки се од името Твое."},
	{12, "12 Kе Те славам, Господи, Боже мој, од се срце и вечно ке го прославувам името Твое,"},
	{13, "13 зашто Твојата милост кон мене е голема: Ти ја спаси душата моја од длабините на пеколот."},
	{14, "14 Боже, законопрестапниците станаа против мене, и многуте насилници ја бараат душата моја: тие Те немаат Тебе пред себе."},
	{15, "15 Но Ти, Боже, Кој си штедар и милостив, долготрпелив, многумилостив и вистинит,"},
	{16, "16 погледни на мене и помилуј ме; дај му ја Твојата сила на слугата свој и спаси го синот на слугинката Твоја;"},
	{17, "17 покажи со мене чудо за добро, па да видат оние, што ме мразат, и да се засрамат, зашто Ти, Господи, ми помогна и ме утеши."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view87() {
struct mk87 poems[] = {
	{1, "1 Основите Негови се горите свети."},
	{2, "2 Господ ги сака портите Сионски повеке од сите населби на Јакова."},
	{3, "3 Граде Божји, преславно се зборува за тебе."},
	{4, "4 'Kе им спомнам на оние кои ме знаат, за Раав и Вавилон; ете, другоплемениците, и Тир, и лу ето од Етиопија, и тие се родија таму беа.'"},
	{5, "5 А за мајката Сион ке речат: тој и тој човек се роди во него, и Самиот Севишни го зацврсти."},
	{6, "6 Кога ке се пребројуваат народите и кнезовите, Господ ке напише: сите досега таму се родија."},
	{7, "7 Оние што пеат се радуваат; пеат и велат - сите наши извори во Тебе се."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view88() {
struct mk88 poems[] = {
	{1, "1 Господи, Боже на моето спасение, дење Те призивам и ноке сум пред Тебе:"},
	{2, "2 за да дојде пред Тебе молитвата моја, приклони го увото Свое кон молбата моја, Господи,"},
	{3, "3 зашто душата моја е полна со јад и животот се приближи до адот."},
	{4, "4 Се изедначив со оние, што слегуваат во гроб; станав како човек без помош - слободен ме у мртвите;"},
	{5, "5 како фрлени и ранети што лежат во гроб, за кои Ти веке не се секаваш; тие се оттурнани од Твојата рака."},
	{6, "6 Ме положија во подземен ров, во мрак и во смртна сенка."},
	{7, "7 Ја истури врз мене Твојата јарост, и со сите Свои бранови ме поразуваш."},
	{8, "8 Ти ги оддалечи од мене моите познати, ме направи одвратен за нив; затворен сум и не можам да излезам."},
	{9, "9 Очите мои ослабеа од сиромаштија: цел ден викам кон Тебе, Господи, ги протегам рацете кон Тебе."},
	{10, "10 Зар на мртовци ке правиш чуда? Зар сенките ке се кренат и ке Те слават?"},
	{11, "11 Зар во гроб некој ке кажува за твојата милост и за Твојата вистина - местото на распа ањето?"},
	{12, "12 Зар во темнината ке ги познаат Твоите чудеса, и во земјата на заборавот - твојата правда?"},
	{13, "13 Но јас повикав кон Тебе, Господи, и наутро молитвата моја Те испреварува."},
	{14, "14 Зошто, Господи, ја оттурнуваш душата моја и го одвракаш лицето Свое од мене?"},
	{15, "15 Јас сум несрекен и од младини се мачам; се возгордеав, се смирив и изнемоштен сум."},
	{16, "16 Над мене се надви Твојата јарост, Твоите заплашувања наполно ме скршија."},
	{17, "17 Секој ден ме опкружуваат како вода: сите заедно ме опседнуваат."},
	{18, "18 Ти го оддалечи од мене ближниот и пријателот; моите познати не се гледаат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view89() {
struct mk89 poems[] = {
	{1, "1 Милоста, Твоја, Господи, вечно ке ја воспевам, од род во род ке ја разгласувам со устата своја Твојата вистина."},
	{2, "2 Зашто рече: милоста е за вечност установена, а на небото Ти ја утврди Твојата вистина."},
	{3, "3 'Јас поставив завет со Моите избраници, му се заколнав на Мојот слуга Давида:"},
	{4, "4 за вечност ке го одржувам твоето потомство, од род во род и ке го утврдувам твојот престол.'"},
	{5, "5 И небото ке ги прославува. Господи, Твоите чудесни дела и Твојата вистина во собранијата на светиите."},
	{6, "6 Зашто, кој на облаците ке се споредува со Господа и кој од синовите Божји ке се изедначи со Господа?"},
	{7, "7 Во соборот на светиите Бога Го прославуваат; велик е и страшен за сите што Го окружуваат."},
	{8, "8 Господи, Боже на силите, кој е еднаков со Тебе. Силен Си Ти, Господи, и вистината Твоја е околу Тебе."},
	{9, "9 Ти управуваш со силата морска и силните бранови негови, Ти ги скротуваш."},
	{10, "10 Ти го поразуваш гордиот како ранет, со Твојата крепка рака ги распрснуваш непријателите Свои."},
	{11, "11 Твои се небесата и твоја е земјата; вселената и она, што ја исполнува, Ти си ја основал."},
	{12, "12 Север и југ Ти си ги создал; Тавор и Ермон за Твоето име се радуваат."},
	{13, "13 Силна е Твојата мишка, црвста е раката Твоја, високо е издигната десницата Твоја!"},
	{14, "14 Правдата и судот се основа на Твојот престол; милоста и вистината одат пред Твоето лице."},
	{15, "15 Блажени се лу ето, што го познаваат трубниот глас. Тие одат во светлината на Твоето лице, Господи;"},
	{16, "16 за Твоето име се радуваат цел ден и со Твојата правда се возвишуваат,"},
	{17, "17 зашто Ти си похвала на силите нивни и со Твоето благоволение се издига нашито рог,"},
	{18, "18 бидејки нашата заштита доа а од Господа и од светецот Израилев, нашиот Цар."},
	{19, "19 Некогаш Ти си им зборувал на Твоите синови во видение и си рекол: 'Јас му дадов помош на силниот, го издигнав избраникот ме у Мојот народ."},
	{20, "20 Го најдов Мојот слуга Давида; со својот свет елеј го помазав."},
	{21, "21 Раката Моја ке го застапува, и мишката моја ке го закрепнува."},
	{22, "22 Непријателот не ке може ништо да му направи,и синот на беззаконието нема да го измачува."},
	{23, "23 Kе ги уништам пред него непријателите негови и ке ги победам оние, што го мразат."},
	{24, "24 И Мојата вистина и Мојата милост се со него, и преку Моето име ке се возвишува неговиот рог."},
	{25, "25 И ке ја положам над морето раката негова, и над реките - десницата негова."},
	{26, "26 Тој ке ме призива: Ти си мој Отец, мој Бог и крепост на моето спасение."},
	{27, "27 И Јас ке го направам првороден син, повисоко од земните цареви,"},
	{28, "28 засекогаш ке му ја зачувам Мојата милост и Мојот завет со него да биде верен."},
	{29, "29 И ке го продолжам за секогаш неговото потомство и неговиот престол, - колку деновите на небото."},
	{30, "30 Ако синовите негови го остават Мојот закон и не одат по Моите заповеди;"},
	{31, "31 ако ги нарушат Моите наредби и не ги запазуваат Моите повелби,"},
	{32, "32 тогаш ке ги посетам со жезалот поради нивното беззаконие, и со рани - заради неправдите нивни;"},
	{33, "33 но милоста Своја нема да ја одземам од него и вистината нема да ја превртам."},
	{34, "34 Нема да го нарушам Мојот завет и нема да го изменам она, што излегло од устата Моја."},
	{35, "35 Еднаш се заколнав во светоста Своја: ке ги излажам ли Давида?"},
	{36, "36 Неговото потомство вечно ке пребива, неговиот престол ке биде како сонце пред Мене,"},
	{37, "37 засекогаш ке стои како месечината; и верен сведок е на небото.'"},
	{38, "38 Но Ти го отфрли и го презре, негодуваше на Твојот помазаник;"},
	{39, "39 го разруши заветот со Твојот слуга, го оскверни светилиштето негово на земјата;"},
	{40, "40 ги разруши сите негови огради, ги претвори во урнатини неговите крепости."},
	{41, "41 Го ограбуваат сите што поминуваат по патот; тој стана за потсмев на своите соседи."},
	{42, "42 Ти ја возвиши десницата на неговите противници, ги зарадува сите непријатели негови;"},
	{43, "43 Ти му откажа помош на мечот негов и во борбата не го поткрепи;"},
	{44, "44 ја одзеде од него чистотата и го урна на земја престолот негов;"},
	{45, "45 ги скрати деновите на времето негово и го покри со срам."},
	{46, "46 До кога, Господи, ке се одрвака непрестајно? Го кога ке гори гневот Твој како оган."},
	{47, "47 Спомни си, колкав е векот мој: за каква суета си ги создал сите синови човечки."},
	{48, "48 Кој од лу ето ке живее, а смрт да не види, и да ја спаси душата од пеколот?"},
	{49, "49 Каде се Твоите поранешни милости, Господи, за кои му се заколна на Давида во Твојата вистина."},
	{50, "50 Сети се, Господи, на подбивите од слугите Твои што ги носам во пазувите свои од многуте народи;"},
	{51, "51 на подбивите од Твоите непријатели, Господи, со кои ја валкаат трагата на Твојот помазаник."},
	{52, "52 Нека е благословен Господ во сите векови! Амин, Амин!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view90() {
struct mk90 poems[] = {
	{1, "1 Господи, Ти си ни прибежиште од род во род."},
	{2, "2 Дури уште пред да се појават горите, и пред создавањето на земјата и на вселената, отсекогаш и за секогаш Ти постоиш."},
	{3, "3 Не вракај го човекот во прав, бидејки си рекол: 'обратете се синови човечки!'"},
	{4, "4 Зашто пред Твоите очи иљада години се како вчерашен ден, што поминал, и колку една стража преку нокта."},
	{5, "5 Годините нивни минуваат; тие се како трева - изутрина;"},
	{6, "6 наутро ке процути и ке помине, а навечер па а и се исушува."},
	{7, "7 Така и ние исчезнуваме од Твојот гнев, и од Твојата јарост сме во забуна."},
	{8, "8 Ти си ги поставил пред Себе нашите беззаконија, векот наш е во светлината на лицето Твое."},
	{9, "9 Сите наши дни се скратуваат и од Твојот гнев исчезнуваат, па веке не нема; нашите години се трудеа како пајак."},
	{10, "10 Дните на нашиот живот се седумдесет години, а ако сме крепки и до осумдесет години; и повеке време од нив се во труд и болести, бидејки брзо минуваат и ние летаме со нив."},
	{11, "11 Која ја знае силата на Твојот гнев, па во стравот пред Твојата јарост да се плаши?"},
	{12, "12 Научи не така со десницата Твоја, па да се здобиеме со мудро срце."},
	{13, "13 Сврти се, Господи, до кога вака? Смилувај се на Твоите слуги."},
	{14, "14 Се исполнивме изутрина со Твојата милост, Господи, и се зарадувавме и се развеселивме во сите наши дни,"},
	{15, "15 се развеселивме за оние дни, кога не понизуваше, за годините, во кои видовме зло."},
	{16, "16 па призри на слугите Твои и на делата Твои, и научи ги синовите нивни."},
	{17, "17 И славата на нашиот Господ Бог нека биде со нас, и во делата на рацете наши помагај ни."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view91() {
struct mk91 poems[] = {
	{1, "1 Кој живее пок закрилата на Севишниот, тој престојува во домот на небескиот Бог."},
	{2, "2 И ке Му рече на Господа: Ти си мој застапник, Ти си мое пребивалиште, Бог мој, и на Тебе ке се надевам!"},
	{3, "3 Зашто Он ке те избави од стапицата на ловецот, и од збор кој збунува."},
	{4, "4 Со плеките Свои ке те осени и под криљата Негови ке бидеш во сигурност: како што ке те окружува Неговата вистина."},
	{5, "5 Нема да се уплашиш од нокен страв, ни од стрела што лета дење,"},
	{6, "6 од суштества што одат во темнина, од зараза и од бес што опустошува напладне."},
	{7, "7 Покрај тебе ке паднат иљада, и десет иљади десно од тебе; но до тебе нема да се приближат;"},
	{8, "8 само ке гледаш со очите свои и ке ја гледаш отплатата на грешниците."},
	{9, "9 Зашто, ти, си Господи, надеж моја, Севишниот го избра за Свое прибежиште;"},
	{10, "10 зло нема да Ти се случи, и невојла нема да Ти се приближи до телото Твое;"},
	{11, "11 затоа што ке им заповеда на ангелите Свои за Тебе, да Те чуваат на сите патишта Твои."},
	{12, "12 Kе Те понесат на раце, да не ја сопнеш од камен ногата Своја;"},
	{13, "13 на отровница и на змија ке нагазуваш, лав и змеј ке убиваш."},
	{14, "14 'Бидејки се надеваше на Мене, и ке го избавам, и ке го заштитам, зашто го позна името Мое."},
	{15, "15 Kе повика кон Мене, и ке го чујам; со него сум во невоља; ке го избавам и ке го прославам,"},
	{16, "16 ке му дадам многу денови и ке му го јавам спасението од Мене.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view92() {
struct mk92 poems[] = {
	{1, "1 Добро е да се слави Господ и да Му се пее на името Твое, Севишни,"},
	{2, "2 да се возвестува наутро милоста Твоја, и секоја нок - Твојата вистина,"},
	{3, "3 на десетострунен псалтир, со песна на гусле."},
	{4, "4 Зашто Ти ме развесели, Господи, со Твоите созданија, и од делата на Твоите раце е зарадував."},
	{5, "5 Колку се големи делата Твои, Господи! многу се длабоки Твоите помисли!"},
	{6, "6 Безумниот човек не ке може да ги узнае, и неразумниот нема да го разбере тоа."},
	{7, "7 Кога грешниците никнуваат како трева, и кренат глава оние што вршат беззаконие, тоа е за да бидат истребени засекогаш, -"},
	{8, "8 Ти си, Господи, Севишни секогаш!"},
	{9, "9 Зашто, еве, непријателите Твои, Господи, ке пропаднат и ке се растураат сите што вршат беззаконие;"},
	{10, "10 а мојот рог Ти го вознесуваш како рог на еднорогот, и староста моја со елеј се помазува,"},
	{11, "11 и окото мое ги погледа непријателите мои, и увото мое ке чуе за побунетите против мене беззаконици."},
	{12, "12 Преведникот процути како палма, ке се издигне како кедар ливански."},
	{13, "13 Засадените во домот Господов, ке процутат во дворовите на нашиот Бог;"},
	{14, "14 тие и во староста ке бидат плодни, помазани и ке живеат угодно,"},
	{15, "15 за да возвестуваат дека е праведен Господ, нашиот Бог, и дека нема неправда од Него."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view93() {
struct mk93 poems[] = {
	{1, "1 Господ се зацари; се облече во велелепие, Господ се препаша со сила, затоа што вселената ја зацврсти и нема да се разниша."},
	{2, "2 Твојот престол е утврден од почетокот на времето; Ти постоиш отсекогаш."},
	{3, "3 Ги издигнаа реките, Господи, ги издигнаа реките гласовите свои."},
	{4, "4 Но од бучесњето на многуте води, чудесни се морските бранови, чудесен е Господ во висините Свои."},
	{5, "5 Сведоштвата Твои се многу уверливи. На твојот дом, Господи, му припа а светост за долго време."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view94() {
struct mk94 poems[] = {
	{1, "1 Бог Господ е одмаздник Боже на одмаздата покажи се!"},
	{2, "2 Стани, Судијо на земјава, дај им отплата на гордите."},
	{3, "3 До кога грешниците, Господи, до кога грешниците ке се фалат,"},
	{4, "4 мрморат и кажуваат неправда, до кога ке зборуваат така сите што вршат безааконие?"},
	{5, "5 Го газат Твојот народ, Господи, и го озлобуваат Твоето наследство;"},
	{6, "6 вдовица и сирак убија, и придојден убија."},
	{7, "7 па рекоа: Господ нема да види, ни Бог Јаковов нема да дознае."},
	{8, "8 Вразумете се, вие што сте безумни! И дали вие, лу е, некогаш ке се опаметите?"},
	{9, "9 Оној, Кој го насадил увото, нема ли да чуе, и Оној што го поставил окото, нема ли да види?"},
	{10, "10 Оној, Кој ги вразумува народите, и Кој го учи човекот на знење, зар нема да казни?"},
	{11, "11 Господ ги знае човечките мисли, знае дека се тие суетни."},
	{12, "12 Блажен е оној човек, кого го казнуваш Ти, Господи, и го поучуваш на Твојот закон,"},
	{13, "13 за да му дадеш мир во лошите денови, додека за грешникот не се ископа гроб!"},
	{14, "14 Зашто Господ нема да го отфрли Својот народ и нема да го остави Своето наследство."},
	{15, "15 додека правдата не се обрне во суд и по него не се држат сите прави по срце."},
	{16, "16 Кој ке се крене за мене против лукавите или кој ке стои покрај мене против оние што вршат беззаконие?"},
	{17, "17 Да не ми беше помогнал Господ, душата моја брзо ке се преселеше во адот."},
	{18, "18 Кога ке речев: ногата ми се поколеба, - Твојата милост, Господи, ме помагаше."},
	{19, "19 Кога се намножуваа тешкотиите и во срцето мое, Твоите утехи ја развеселуваа душата моја."},
	{20, "20 Па зар до Тебе ке се приближи престолот безбожнички, оној што работи спротивно на законот Твој."},
	{21, "21 Ја ловат душата на преведникот и осудуват невина крв."},
	{22, "22 Но Господ е мое прибежиште и Бог мој - сигурност во надежта моја."},
	{23, "23 Он ке го сврти врз нив нивното беззаконие, и според злобата нивна ке ги погуби Господ Бог."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view95() {
struct mk95 poems[] = {
	{1, "1 Дојдете да се возрадуваме во Господа и да воскликнеме кон Бога, Спасителот наш;"},
	{2, "2 да побрзаме пред лицето Негово со славословие, и со псалми да Му воскликнеме,"},
	{3, "3 зашто Бог е велик Господ и Цар голем по целата земја."},
	{4, "4 Зашто во Неговите раце се сите краишта на земјата, а горските височини се исто така Негови."},
	{5, "5 Бидејки Негово е морето, и Он го создаде, а рацете Негови го создадоа и сувото."},
	{6, "6 Дојдете, да Му се поклониме и да паднеме ничкум, да заплачеме пред лицето на Господа, нашиот Творец;"},
	{7, "7 зашто Он е Бог наш, а ние сме народ од Неговото пасиште и овци од Неговите раце. О, денес да бевте го послушале Неговиот глас!"},
	{8, "8 'Не ожесточувајте ги срцата ваши, како во Мерива, во деновите на искушението во пустињата,"},
	{9, "9 каде што Ме искушуваа вашите татковци, Ме испитуваа и ги видоа делата Мои."},
	{10, "10 Четириесет години негодуваа против тој народ и реков: овие лу е се заблудуваат во срцето свое и не ги познаа патиштата Мои,"},
	{11, "11 па затоа се заколнав во гневот Свој, дека тие нема да влезат во Мојот мир.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view96() {
struct mk96 poems[] = {
	{1, "1 Запејте Му на Господа песна нова, запеј Му на Господа, цела земјо!"},
	{2, "2 Пејте Му на Господа, благословувајте го името Негово, благовестите го од ден на ден спасението од Него;"},
	{3, "3 разгласувајте ја ме у народите славата Негова, и на сите народи - чудесата Негови;"},
	{4, "4 зашто велик е Господ и достоен за пофалба, страшен е Оне над сите богови."},
	{5, "5 Бидејки сите богови на незнабожците се бесови, а Господ го создаде небото."},
	{6, "6 Слава и величие се пред лицето Негово, светост и великолепие - во светилиштето Негово."},
	{7, "7 Воздајте Му на Господа, племиња народни, воздајте Му слава и чест;"},
	{8, "8 воздајте Му на Господа слава на името Негово, земете жртви и влезете во неговите дворови;"},
	{9, "9 поклонете Му се на Господа во светите дворови Негови. Да затрепери пред лицетео Негово целата земја!"},
	{10, "10 Кажете им на народите: Господ се зацари! затоа цврста е вселената, нема да се разниша."},
	{11, "11 Нека се развесели небото и да се возрадува земјата, нека се раздвижи морето и она што го исполнува;"},
	{12, "12 нека се радуваат полињата и се што е на нив, да ликуваат сите дрвја по дубравите,"},
	{13, "13 пред лицето на Господа, зашто иде, зашто Он иде да и суди на земјата. Он ке и суди на вселената по правда, и на народите - според Својата вистина."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view97() {
struct mk97 poems[] = {
	{1, "1 Господ се зацари: нека се радува земјата; нека се веселат многубројните острови."},
	{2, "2 Облак и мрак е околу Него; правда и судот се основа на Неговиот престол."},
	{3, "3 Пред Него оган врви и ги гори непријателите Негови наоколу."},
	{4, "4 Неговите молњи ја осветлуваат вселената; земјата гледа и трепери."},
	{5, "5 Горите се топат како восок од лицето на Господа, од лицето на Господа, по целата земја."},
	{6, "6 Небесата ја разгласуваат Неговата правда, и сите народи ја видоа Неговата слава."},
	{7, "7 Нека се засрамат сите, кои се клањаат на кипови, кои се фалат со своите идоли. Поклонете Му се сите ангели Негови."},
	{8, "8 Чу Сион и се зарадува, се веселат керките Јудини заради Твоите пресуди, Господи,"},
	{9, "9 зашто Ти си Господи, Севишни на целата земја, повисок си од сите богови."},
	{10, "10 Вие, кои Го сакате Господа, мразете го злото! Ја чува Господ душата на своите светии; од раката на грешниците ке ги избави."},
	{11, "11 Светлина засветли над предникот, а на правите по срце - радост."},
	{12, "12 Радувајте се, праведни, во Господа и славете го споменот на светоста Негова."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view98() {
struct mk98 poems[] = {
	{1, "1 Запејте Му на Господа нова песна, зашто создаде чудесни работи, Неговата десница, Му помогна и Неговата света мишка."},
	{2, "2 Господ го објави Своето спасение, пред очите на народите ја откри Својата правда."},
	{3, "3 Се присети Он за својата милост кон Јакова и на вистината Своја кон домот Израилев; сите краишта земи го видоа спасението од Нашиот Бог."},
	{4, "4 Воскликни Му на Господа, цела земјо; запеј, радуј се и пеј;"},
	{5, "5 пејте Му на Господа со гусли, со гусли и со глас псаломски;"},
	{6, "6 во труби ковани и во труби од рог затрубете пред Царот - пред Господа."},
	{7, "7 Нека шуми морето и се она што го исполнува: вселената и сите што живеат во неа;"},
	{8, "8 да заплескаат со раце реките и заедно со горите да се зарадуваат пред лицето на Господа!"},
	{9, "9 зашто Он доа а да и суди на земјата. Он ке и суди на вселената по правда и народите - правично."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view99() {
struct mk99 poems[] = {
	{1, "1 Господ се зацари: нека треперат народите! Он седи на херувими: нека се затресе земјата!"},
	{2, "2 Велик е Господ на Сион и возвишен е Он над сите народи."},
	{3, "3 Нека го слават името Твое велико: зашто тоа е страшно и свето."},
	{4, "4 И геста на Царот, сака праведен суд; Ти утврди правда; суд и правда Ти изврши кај Јакова."},
	{5, "5 Превознесувајте Го Господа, нашиот Бог, поклонувајте Му се во подножјето на нозете Негови, зашто тоа е свето!"},
	{6, "6 Мојсеј и Арон беа ме у свештениците свои, а Самуил ме у оние, кои го призовуаа името Негово. Ти го призовуваа Господа и Он ги слушаше."},
	{7, "7 Во облаков столб Он им говореше, зашто тие ги пазеа Неговите заповеди и наредби, што им ги даваше."},
	{8, "8 Господи, Боже наш, Ти ги слушаше. Боже, Ти беше милостив спрема нив и ги казнуваше сите нивни лоши постапки."},
	{9, "9 Возвишувајте Го Господа, нашиот Бог, и поклонувајте се пред Неговата света гора, зашто свет е Господа, нашиот Бог."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view100() {
struct mk100 poems[] = {
	{1, "1 Воскликни Му на Господа, цела земјо!"},
	{2, "2 Служете Му на Господа со радост; излегувајте пред Него со восклик!"},
	{3, "3 Знајте дека е Господ, дека е Он Бог наш, дека Он не создаде нас, а не ние самите; Негови сме - Негов народ и овци од Неговото пасиште."},
	{4, "4 Влегувајте низ Неговите порти со славословие, во Неговите дворови со песна; славете Го, фалете го името Негово,"},
	{5, "5 зашто благ е Господ: Неговата милост е вечна и Неговата вистина е од род во род."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view101() {
struct mk101 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view102() {
struct mk102 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view103() {
struct mk103 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view104() {
struct mk104 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view105() {
struct mk105 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view106() {
struct mk106 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view107() {
struct mk107 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view108() {
struct mk108 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view109() {
struct mk109 poems[] = {
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view110() {
struct mk110 poems[] = {
	{1, "1 Му рече Господ на мојот Господ: 'Седи од Мојата десна страна, додека ги ставам непријателите Твои во подножјето на нозете Твои."},
	{2, "2 Жезалот на Твојата сила ке ти го прати Господ од Сион: владеј ме у непријателите Свои."},
	{3, "3 Со Тебе започнува Твојата сила; во светлината на светиите Твои; Те родив уште пред да постои sвездата Деница."},
	{4, "4 Се заколна Господ и нема да се покае: Ти си вечен свештеник по чинот Мелхиседеков."},
	{5, "5 Господ Кој е од Твојата десна страна, во денот на гневот Свој, Он ке ги порази царевите;"},
	{6, "6 ке изврши суд над народите, ке ја исполни земјата со трупови, ке ги скрши главите на многумина на земјата."},
	{7, "7 Од потокот на патот ке пие, и затоа високо ке ја крене главата."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view111() {
struct mk111 poems[] = {
	{1, "1 Kе Те славам, Господи, од се срце во советот на праведните и во собранието."},
	{2, "2 Големи се делата на Господа, кои се создадени по Неговата воља."},
	{3, "3 Неговото дело е слава и великолепие, а правдата Негова вечно ке постои."},
	{4, "4 Незаборавни ги направи чудесата Свои, милостив и штедар е Господ."},
	{5, "5 Им дава храна на оние, кои се бојат од Него; вечно го помни заветот Свој."},
	{6, "6 Силата на делата свои му ја покажа на Својот народ, за да му ги даде незнабожците во наследство."},
	{7, "7 Делата на рацете Негови се вистина и суд; и верни се сите заповеди Негови,"},
	{8, "8 утврдени засекогаш, засновани врз вистина и правда."},
	{9, "9 Он му испрати избавување на Својот народ; засекогаш го установи Својот завет. Свето е и страшно името Негово."},
	{10, "10 Почеток на мудроста е стравот од Господа; здрав разум имаат сите, кои според неа постапуваат. Похвалата Негова пребива вечно."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view112() {
struct mk112 poems[] = {
	{1, "1 Блажен е оној човек, кој се бои од Господа и кому му се мили Неговите заповеди."},
	{2, "2 Неговото потомство ке биде силно на земјата; родот на праведните ке биде благословен."},
	{3, "3 Слава и богатство ке има во неговиот дом; и правдата негова ке преуспева вечно."},
	{4, "4 На праведните во темнина им изгрева светлина од Добриот и Милостивиот."},
	{5, "5 Добриот човек е дарежлив и на заем дава; во судот тој уверливо ке ги потврди зборовите свои;"},
	{6, "6 и никогаш нема да се разниша; праведниот останува во вечен спомен."},
	{7, "7 Од лоши гласови нема да се уплаши; срцето му е спремно, зашто се надева во Господа."},
	{8, "8 Срцето му е цврсто: тој нема да се уплаши, кога - годе ке погледне во напријателите свои."},
	{9, "9 Тој растура, дава на сиромаси; правдата негова останува вечно; неговиот рог ке се возвиши во слава."},
	{10, "10 Грешниот, кога ке го види тоа, ке се јадосува, ке крцка со забите свои и ке се топи. Желбата на грешникот пропа а."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view113() {
struct mk113 poems[] = {
	{1, "1 Фалете Го, слуги Господови, фалете го името на Господа."},
	{2, "2 Нека е благословено името Господово отсекогаш и засекогаш."},
	{3, "3 Од исток до запад нека се прославува името на Господа."},
	{4, "4 Возвишен е над сите народи Господ; Неговата слава е над небесата."},
	{5, "5 Кој е како Господ, нашиот Бог, Кој живее во висините,"},
	{6, "6 и Кој со смиреност гледа на небото и на земјата;"},
	{7, "7 Кој од прав го издига сиромавиот и од калта го вади бедниот,"},
	{8, "8 за да го постави со кнезовите, со кнезовите на народот негов."},
	{9, "9 Кој неплодната ја вселува в куки како мајка, што се радува ме у многуте деца."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view114() {
struct mk114 poems[] = {
	{1, "1 Кога Израилот излезе од Египет, домот Јаковов - од ту народ,"},
	{2, "2 Јудеја стана Божјо светилиште, Израилот област Негова."},
	{3, "3 Морето виде и избега; Јордан се врати назад."},
	{4, "4 Горите се разиграа како овни, и ритчињата - како јаганца."},
	{5, "5 Што ти стана тебе море, па бегаш, и тебе, Јордане, па назад се вракаш?"},
	{6, "6 Зашто се разигравте, гори, како овни, и вие, ритчиња, како јаганца?"},
	{7, "7 Трепери земјата пред лицето на Господа, пред лицето на Бога Јаковов,"},
	{8, "8 Кој камен претвора во водно езеро и карпа - во воден извор."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view115() {
struct mk115 poems[] = {
	{1, "1 Не нам, Господи, не нам, туку на Своето име дај му слава, заради Твојата милост, заради Твојата вистина,"},
	{2, "2 да не речат незнабожците: 'Па каде е нивниот Бог?'"},
	{3, "3 Нашиот Бог е горе на небото; на небесата и на земјата врши се, што сака."},
	{4, "4 А идолите на незнабожците се сребро и злато, дело на човечки раце:"},
	{5, "5 уста имаат а не зборуваат, очи имаат но не гледаат;"},
	{6, "6 имаат уши, но не слушаат; имаат ноздри, но не мирисаат;"},
	{7, "7 раце имаат, но не пипаат; нозе имаат, но не одат; тие не пуштаат глас од грлото свое."},
	{8, "8 Слични на нив нека бидат оние што ги прават, такви и оние што се надеваат на нив."},
	{9, "9 Доме Израилев, надевај се на Господа; Он е наш помошник и заштитник."},
	{10, "10 Доме Аронов, надевај се на Господа; Он е наш помошник и заштитник."},
	{11, "11 Оние кои се бојат од Господа, се надеваат на Господа; он е нивни помошник и заштитник."},
	{12, "12 Господ се секава на нас и не благословил, го благословил домот Израилев, го благословил домот Аронов,"},
	{13, "13 ги благословил оние, кои се бојат од Господа, мали и големи."},
	{14, "14 Нека ви придаде Господ вам повеке, вам и на вашите деца."},
	{15, "15 Благословени да сте од Господа, Кој го создаде небото и земјата."},
	{16, "16 Небото е Господово небо, а земјата Он им ја даде на синовите човечки."},
	{17, "17 Не мртвите ке Те слават, Господи, ниту оние, што слегуваат во ад,"},
	{18, "18 туку ние живите ке го благословуваме Господа отсега и засекогаш."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view116() {
struct mk116 poems[] = {
	{1, "1 Се радувам, дека Господ ке го услиши гласот на моето молење,"},
	{2, "2 зашто го приклони кон мене Своето уво, и затоа ке Го призивам преку сите мои дни."},
	{3, "3 Смртни болки ме обзедоа, пеколни маки ме стигнаа; се најдов во невоља и мака."},
	{4, "4 Тогаш го повикав името Господово: О, Господи, избави ја душата моја!"},
	{5, "5 Милостив е Господ и праведен, и милосрден е нашиот Бог."},
	{6, "6 Господ ги пази слабите: бев во мака и Он ми помогна."},
	{7, "7 Врати се, душо моја, во својот мир, зашто Господ добро ти прави,"},
	{8, "8 бидејки душата моај ја истргна од смрт, очите мои - од солзи, и нозете мои - од сопнување."},
	{9, "9 Kе одам со благодарност пред лицето на Господа во земјата на живите."},
	{10, "10 Поверував и затоа реков: во голема мака сум."},
	{11, "11 Во мојата необмисленост си реков: секој човек е лажливец."},
	{12, "12 Што да му дадам на Господа за сите негови добрини што ми ги направи мене?"},
	{13, "13 Kе земам чаша на спасение и името на Господа ке го призовам."},
	{14, "14 Заветите ке Му ги упатам на Господа пред целиот Негов народ."},
	{15, "15 Скапа е во очите на Господа смртта на неговите светии."},
	{16, "16 О, Господи, јас сум слуга Твој, јас сум слуга Твој и син на Твојата слугинка. Ти ги скрши моите окови."},
	{17, "17 Тебе ке ти принесам благодарствена жртва;"},
	{18, "18 ке ги исполнам заветите мои на Господа пред сиот Негов народ."},
	{19, "19 Во предворјето на домот Господов, посреде тебе, Ерусалиме!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view117() {
struct mk117 poems[] = {
	{1, "1 Фалете Го Господа, сите народи, прославувајте Го, сите лу е,"},
	{2, "2 зашто се зацврсти Неговата голема милост на нас, и вистината Господова пребива вечно."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view118() {
struct mk118 poems[] = {
	{1, "1 Славете го Господа, зашто Он е добар, зашто милоста Негова е вечна."},
	{2, "2 Нека каже сега домот Израилев дека е Он добар, дека милоста Негова е вечна."},
	{3, "3 Нека рече сега домот Аронов: дека е Он добар, дека милоста Негова е вечна."},
	{4, "4 Нека кажат сега сите, кои се бојат од Господа: дека е Он добар, дека милоста Негова е вечна."},
	{5, "5 Кога бев на мака, Го призвав Господа и ме услиши и на ширина ме изведе."},
	{6, "6 Господ е мој помошник, нема да се уплашам: што може да направи човек?"},
	{7, "7 Господ ми е помошник: и јас слободно ке гледам на непријателите мои."},
	{8, "8 Подобро е да се надевам на Господа, отколку да се надевам на човек."},
	{9, "9 Подобро е да се надевама на Господа, отколку да се надеваме на кнезовите."},
	{10, "10 Сите народи ме опколија, но со името Господово јас ги разбив;"},
	{11, "11 ме опседнаа, ме обиколија, но со името Господово јас ги победив."},
	{12, "12 Ме опкружија како пчели околу сотка, па се запалија како оган во трње: со името Господово јас им се противставив."},
	{13, "13 Ме турнаа силно, за да паднам, но Господ ме прифати."},
	{14, "14 Господ е крепост моја и песна; Он стана мое спасение."},
	{15, "15 Глас на радост и на спасение се слуша во домовите на праведните; десницата на Господа дава сила!"},
	{16, "16 Десницата Господова ме возвишува, десницата Господова дава сила."},
	{17, "17 Нема да умрам, но ке живеам и ке ги разгласувам делата Господови."},
	{18, "18 Господ строго ме казни, но на смрт не ме предаде."},
	{19, "19 Отворете ми ја вратата на правдата: ке влезам во неа, ке го прославувам Господа."},
	{20, "20 Ете, тоа е вратата Господова, праведните влегуваат низ неа;"},
	{21, "21 ке Те славам, зашто ме услиши и стана спасение мое."},
	{22, "22 Каменот, што го отфрлија sидарите, стана глава на аголот."},
	{23, "23 тоа е од Господа, и е прекрасно во очите наши."},
	{24, "24 Овој ден е што го создаде Господ за да се зарадуваме и да се развеселиме во него."},
	{25, "25 О, Господи, спаси! О, Господ, побрзај!"},
	{26, "26 Нека е благословен оној, кој оди во името на Господа! Ве благословуваме од домот Господов."},
	{27, "27 Бог е Господ и ни се јави; образувајте празнична придружба до роговите на жртвеникот."},
	{28, "28 Бог мој си Ти и Тебе ке те славам; Бог мој си Ти и Тебе ке те превознесувам. Kе те прославувам, зашто Ти ме услиши и стана мое спасение."},
	{29, "29 Славете го Господа, зашто Он е добар, зашто милоста му е вечна."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view119() {
struct mk119 poems[] = {
	{1, "1 Блажени се непорочните во патот нивни, зашто одат според законот Господов."},
	{2, "2 Блажени се оние кои ги пазат сведоштвата Негови и од се срце Го бараат."},
	{3, "3 Оние кои не вршат беззаконие, тие одат по Неговите патишта."},
	{4, "4 Ти заповеда да се пазат Твоите заповеди."},
	{5, "5 О, да се беа управиле моите патишта за да ги чувам Тавоите заповеди!"},
	{6, "6 Тогаш немаше да се засрамам, гледајки ги сите Твоие заповеди."},
	{7, "7 Kе Те славам Господи со чисто срце, кога ке ги научам Твоите праведни судови."},
	{8, "8 Kе ги пазам Твоите заповеди; не оставај ме сосема."},
	{9, "9 Како младичот ке го запази во чистота патот свој? - Ако ги пази зборовите Твои."},
	{10, "10 Со сето срце мое Те побарав, не отстранувај ме од Твоите заповеди."},
	{11, "11 Ги сокрив во срцето свое заповедите Твои, за да не грешам пред Тебе."},
	{12, "12 Благословен си Ти, Господи! Научи ме на Твоите наредби."},
	{13, "13 Со устата своја ги разгласив сите судови од устата Твоја."},
	{14, "14 По патот на Твоите сведоштва се насладувам како во секое богатство."},
	{15, "15 Kе размислам за Твоите заповеди и ке го разберам патот Твој."},
	{16, "16 Од наредбите Твои ке се поучувам, нема да ги заборавам Твоите зброви."},
	{17, "17 Покажи милост кон Твојот слуга, и ке живеам и ке ги пазам Твоите зборови."},
	{18, "18 Отвори ги очите мои, и ке ги разберам чудесата од Твојот закон."},
	{19, "19 Придојден сум на земјава, не сокривај ги од мене Твоите заповеди."},
	{20, "20 И копнее душата моја во секое време да ги сака Твоите судови."},
	{21, "21 Им се закани на горделивите; проклети да се оние, кои се отконуваат од Твоите заповеди."},
	{22, "22 Отстрани го од мене прекорот и презирот, зашто ги засакав Твоите сведоштва."},
	{23, "23 Кнезовите седат и ме клеветаат, и Твојот слуга размислува за Твоите наредби."},
	{24, "24 Сведоштвата, пак, Твои се поука моја, а наредбите Твои - советници."},
	{25, "25 Душата моја лежи во прав: оживи ме според зборот Твој."},
	{26, "26 Патиштата мои ги кажав, и Ти ме чу; научи ме на Твоите наредби."},
	{27, "27 Вразуми ме да го разберам патот на Твоите наредби и јас ке размилувам за Твоите чудеса."},
	{28, "28 Душата моја засолзи од тага, зацврсти ме со зборовите Твои."},
	{29, "29 Отстрани го од мене патот на неправдата и помилуј ме со законот Твој."},
	{30, "30 Го избрав патот на вистината, и не ги заборавив Твоите судови."},
	{31, "31 Се приврзав за сведоштвата Твои, Господи: не ме посрамувај."},
	{32, "32 Kе побрзам по патот на Твоите заповеди, кога ке го рашириш срцето мое."},
	{33, "33 Покажи ми го, Господи, патот на Твоите наредби и ке се придржувам за нив до крај."},
	{34, "34 Вразуми ме, и ке се држам за законот Твој и ке го пазам со сето срце свое."},
	{35, "35 Постави ме на патеката на Твоите заповеди, зашто многу ја засакав."},
	{36, "36 Приклони го срцето мое кон Твоите сведоштва, а не кон лакомства."},
	{37, "37 Сврти ги очите мои за да не гледам суета: оживи ме на Својот пат."},
	{38, "38 Во слугата Свој внеси збор Свој за да се бои од Тебе."},
	{39, "39 Отстрани го од мене прекорот, од кој се плашам, зашто Твоите судови се благи."},
	{40, "40 Ете, ги засакав Твоите заповеди: Оживи ме според Својата правда."},
	{41, "41 И нека милоста Твоја, Господи, пријде на мене, и спасение од Тебе според зборовите Твои, -"},
	{42, "42 и јас ке им одговорам на оние што ме навредуваат, зашто се надевам на зборовите Твои."},
	{43, "43 Не одземај го сосема од устата моја словото на вистината, зашто јас се надевам на Твоите судови."},
	{44, "44 И ке го чувам Твојот закон засекогаш и во веки веков."},
	{45, "45 Kе одам слободно, зашто ги барам Твоите заповеди."},
	{46, "46 И ке зборувам за сведоштвата Твои пред царевите, и нема да се посрамам;"},
	{47, "47 и ке се поучувам на Твоите заповеди, кои многу ги засакав;"},
	{48, "48 ке ги протегнам рацете свои кон Твоите заповеди, кои ги возљубив, и ке размислувам за Твоите наредби."},
	{49, "49 Внуши слово кон Твојот слуга, со кое си му дал надеж."},
	{50, "50 Таа ме утешува во невољата моја, оти Твоето слово ме оживува."},
	{51, "51 Горделивите го престапија законот многу, но јас не се остртранив од Твоите закони."},
	{52, "52 Се сетив за Твоите вечни судови, Господи, и се утешував."},
	{53, "53 Тага ме обзема од грешниците што го напуштаат Твојот закон."},
	{54, "54 Наредбите Твои ми беа песна кога патувам во некое место."},
	{55, "55 Ноке го споменувам името Твое, Господи, и го пазам законот Твој."},
	{56, "56 Он стана мој, зашто ги пазам Твоите заповеди."},
	{57, "57 Дел мој си Ти, Господи, - си реков - ке го пазам законот Твој."},
	{58, "58 Му се помолив на лицето Твое од се срце: помилуј ме, според словото Твое."},
	{59, "59 Размислувам за Твоите патишта и ги свртувам нозете мои кон Твоите сведоштва."},
	{60, "60 Се подготвив и не се збунив да ги запазам Твоите заповеди."},
	{61, "61 Замки од грешници ме опкружија, но јас не го заборавив Твојот закон."},
	{62, "62 На полнок станував да те величам поради Твоите праведни судови."},
	{63, "63 Јас сум ме у оние, што се бојат од Тебе и кои ги пазат Твоте наредби."},
	{64, "64 Со Твојата милост, Господи, земјата е полна; научи ме на Твоите наредби."},
	{65, "65 Добрини си му направил, Господи, на Твојот слуга според Твоето слово."},
	{66, "66 Научи ме на добро и на разумно, зашто верувам на Твоите наредби."},
	{67, "67 Пред моето страдање јас прегрешив; а сега го пазам Твојот збор."},
	{68, "68 Ти си добар, Господи, и поради добрината Твоја научи ме на Твоите наредби."},
	{69, "69 Се зголеми неправдата од гордите врз мене, но јас од се срце ке ги пазам Твоите заповеди."},
	{70, "70 Се засири срцето мое како млеко; но јас се утешувам со Твојот закон."},
	{71, "71 Добро ми е што ме смири, за да се научам на Твоите наредби."},
	{72, "72 Законот на Твојата уста за мене е подобар отколку иљадници злато и сребро."},
	{73, "73 Твоите раце ме создадоа и изградија: вразуми ме, и ке се научам на Твоите заповеди."},
	{74, "74 Оние, кои се бојат од Тебе, кога ке ме видат ке се зарадуваат, затоа што се надевав на Твоите зборови."},
	{75, "75 Знам, Господи, дека Твоите судиви се праведни, и според справедливоста Твоја Ти ме казни."},
	{76, "76 Па нека ми биде милоста Твоја утеха, според Твоето слово кон Твојот слуга."},
	{77, "77 Нека пријде на мене Твојата штедрост, и јас ке живеам, зашто законот Твој е утеха моја."},
	{78, "78 Нека се посрамат горделивите, зашто неправедно и без вина ме обвинуваат."},
	{79, "79 Нека се обрнат кон мене, они што се плашат од Тебе и кои ги знаат Твоите сведоштва."},
	{80, "80 Нека биде срцето мое непорочно во Твоите наредби, та да не се посрамам."},
	{81, "81 Копнее душата моја за Твоето спасение; јас се надевав на Твоите зборови."},
	{82, "82 Очите мои попуштија од желба за Твоето слово велејки: кога ке ме утешиш?"},
	{83, "83 Зашто станав како мев на мраз, но Твоите наредби не ги заборавив."},
	{84, "84 Колку се дните на Твојот слуга? Кога ке извршиш суд над моите гонители?"},
	{85, "85 Законопрестапниците се подигруваат со мене спротивно на Твојот закон."},
	{86, "86 Сите Твои заповеди се вистина. Неправедно ме гонат: помогни ми!"},
	{87, "87 За малку ке ме убиеја на земјата, но јас не ги оставив Твоите заповеди."},
	{88, "88 Споерд Твојата милост оживи ме, и јас ке ги пазам сведоштвата од Твојата уста."},
	{89, "89 Твоето слово, Господи, е засекогаш утврдено на небото;"},
	{90, "90 Твојата вистина е од род во род. Ти си ја поставил земјата, и таа стои."},
	{91, "91 Според Твоја воља постои денот. Се што постои, Тебе ти служи."},
	{92, "92 Да не беше Твојот закон утеха за мене, јас ке загинев во невољата своја."},
	{93, "93 Никогаш нема да ги заборавам Твоите наредби, зашто преку нив ме оживуваш."},
	{94, "94 Твој сум јас, спаси ме, зашто ги барав Твоите наредби."},
	{95, "95 Грешниците настојуваа да ме убијат, но јас ги разбрав сведоштвата Твои."},
	{96, "96 Го видов крајот на секое совршенство, но Твоите заповеди се безгранични."},
	{97, "97 Колку го засакав, Господи, Твојот закон; секој ден се поучувам од него."},
	{98, "98 Со својата заповед Ти ме направи помудар од непријателите мои, зашто таа е секогаш со мене."},
	{99, "99 Станав поразумен од сите учители мои, зашто сведоштвата Твои се моја поука."},
	{100, "100 Поумен станав од старците, зашто ги сакам Твоите заповеди."},
	{101, "11 Ги задржувам нозете свои од секаков лош пат, за да го пазам словото Твое."},
	{102, "12 Од твоите судови нема да се откажам, зашто Ти ме учиш."},
	{103, "13 Колку се слатки за глото мое зборовите Твои, послатки се од мед во устата моја."},
	{104, "14 Преку твоите заповеди станав разумен; затоа го замразив секој пат на неправда."},
	{105, "15 Твоето слово е светилник на нозете мои и светлина за патеката моја."},
	{106, "16 Се заколнав и реков да ги пазам Твоите праведни судови, и ке ги исполнувам."},
	{107, "17 Многу сум нажален, оживи ме, Господи, поради Твоето слово."},
	{108, "18 Затоа, благослови, Господи, да примиш доброволна жртва од мојата уста, и научи ме на Твоите судови."},
	{109, "19 Душата ми е постјано во Твојата рака, но Твојот закон не го заборавив."},
	{110, "110 Грешниците ми поставија замка, но јас не се отстранив од Твоите заповеди."},
	{111, "111 Твоите сведоштва ги примив како вечно наследство, зашто тие се голема радост за срцето мое."},
	{112, "112 Го натерав срцето свое да ги извршува наредбите Твои како вечно оправдание."},
	{113, "113 Престапниците на законот ги замразив, но Твојот закон го сакам."},
	{114, "114 Ти си мој помошник и мој заштитник: на Твојата слава се надевам."},
	{115, "115 Иставете се од мене беззаконици, за да ги испитам заповедите на мојот Бог."},
	{116, "116 Застапи се според Твоето слово, и јас ке живеам; не посрамувај ме во надежта моја;"},
	{117, "117 помогни ми, и ке се спасам: и во Твоите наредби постојано ке се учам."},
	{118, "118 Ти ги презираш оние, кои отстапуваат од Твоите наредби, зашто нивните мисли се неправедни."},
	{119, "119 Сите грешници земни ги сметам како престапници, затоа засекогаш ги засакав Твоите сведоштва."},
	{120, "120 Од страв пред Тебе трепери телото мое, и од Твоите судови се плашам."},
	{121, "121 Јас вршев суд и правда; не предавај ме на оние што ми чинат неправда."},
	{122, "122 Прими го Твојот слуга за негово добро, та да не ме клеветат горделивите."},
	{123, "123 Очите ми копнеат, очекујки го спасението од Тебе, и словото на Твојата правда."},
	{124, "124 Постапи со Твојот слуга според милоста Своја и научи ме на Твоите наредби."},
	{125, "125 Слуга Твој сум јас: вразуми ме и ке ги познаам сведоштвата Твои."},
	{126, "126 Време е, Господи, да се дејствува: Твојот закон го разурнаа."},
	{127, "127 Затоа ги засакав заповедите Твои и од топаз и од злато повеке."},
	{128, "128 Затоа се управував според сите Твои заповеди и патот на неправдата го замразив."},
	{129, "129 Прекрасни се Твоите сведоштва: затоа душата моја ги испитуваше."},
	{130, "130 Објавувањето на Твоите зборови ги просветува и вразумува младите."},
	{131, "131 Ја отворив устата моја и воздивнав, зашто жеден сум за Твоите заповеди."},
	{132, "132 Погледај кон мене и помилуј ме, како што се постапува со оние, кои го сакаат Твоето име."},
	{133, "133 Утврди ги стапките мои според Твоето слово и не допушти со мене да овладее никакво беззаконие."},
	{134, "134 Избави ме од човечко клеветење и ке ги пазам Твоите заповеди,"},
	{135, "135 озари го Твојот слуга со светлината на лицето Твое, и научи ме на Твоите заповеди."},
	{136, "136 Од очите мои потоци извори солзи, зашто не го запазив Твојот закон."},
	{137, "137 Праведен си Ти, Господи, и праведни се Твоите пресуди."},
	{138, "138 Твоите сведоштва, што си ги дал, се засновани на правда и вечна вистина."},
	{139, "139 Ревноста моја ме јаде, зашто непријателите мои ги заборавија Твоите слова."},
	{140, "140 Твоето слово е многу чисто, и Твојот слуга го сака."},
	{141, "141 Мал сум и презрен, но Твоите наредби не ги заборавив."},
	{142, "142 Твојата правда е вечна правда, и Твојот закон е вистина."},
	{143, "143 Скрб и мака ме обзедоа; Твоите заповеди се моја поука."},
	{144, "144 Правдата на Твоите сведоштва е вечна; вразуми ме, и ке живеам."},
	{145, "145 Те призивам со сето срце мое, услиши ме, Господи, - и ке ги пазам наредбите Твои."},
	{146, "146 Тебе Те повикувам: спаси ме, па ке ги пазам Твоите слова."},
	{147, "147 Ја испреварувам зората и викам: на Твоето слово се надевам."},
	{148, "148 Очите мои се отворија пред утринската стража, за да се поучам на Твоите слова."},
	{149, "149 Чуј го мојот глас, според милоста Своја, Господи; според Твојот суд оживи ме."},
	{150, "150 Се приближија оние, што сакаат беззаконие; од законот Твој тие се оддалечија."},
	{151, "151 Близок си Ти, Господи, и сите Твои заповеди се вистина."},
	{152, "152 Одамна знам за твоите сведоштва, кои си ги утврдил засекогаш."},
	{153, "153 Погледај на мојата потиштеност и избави ме, зашто не го заборавив Твојот закон."},
	{154, "154 Пресуди според мојата правда и заштити ме; заради словото Твое оживи ме."},
	{155, "155 Далеку е спасението од грешниците, зашто тие не ги побараа Твоите наредби."},
	{156, "156 Голема е Твојата милост, Господи, според Твојот суд оживи ме."},
	{157, "157 Многумина ме гонеа и мачеа, но од Твоите сведоштва јас не отстапив."},
	{158, "158 Видов неразумни и тешко ми беше, зашто словата Твои не ги запазија."},
	{159, "159 Гледаш како ги засакав заповедите Твои, оживи ме, Господи, поради Твојата милост."},
	{160, "160 Вистината е основа на Твоите слова; и вечен е секој суд на Твојата праведност."},
	{161, "161 Кнезовите ме гонеа без вина, но срцето мое се уплаши само од Твоите зборови."},
	{162, "162 Се радувам на Твоето слово, како оној кој нашол големо благо."},
	{163, "163 Ја замразив неправдата и се гнасам од неа; а Твојот закон го засакав."},
	{164, "164 Седумпати на ден Те прославувам за судовите на Твојата правда."},
	{165, "165 Голем е мирот кај оние, кои го сакаат Твојот закон, и за нив нема соблазна."},
	{166, "166 Го чекав спасението од Тебе, Господи, и Твоите заповеди ги засакав."},
	{167, "167 Душата моја ги пази Твоите сведоштва, и јас многу ги засакав."},
	{168, "168 Ги пазам Твоите заповеди и Твоите сведоштва, зашто сите мои патишта се пред Тебе, Господи."},
	{169, "169 нека се приближи пред Тебе молбата моја, Господи; вразуми ме според Твоите зборови."},
	{170, "170 Нека барањето мое дојде пред Тебе; избави ме според Твоето слово."},
	{171, "171 Од устата моја нека се произнесе похвала, кога ке ме научиш на Твоите наредби."},
	{172, "172 Јазикот мој нека ги разгласи Твоите зборови, зашто сите Твои заповеди се праведни."},
	{173, "173 Нека ми биде Твојата рака на спасение, зашто Твоите заповеди ги избрав."},
	{174, "174 Копнеев, Господи, за спасение од Тебе и Твојот закон е мојата поука."},
	{175, "175 Kе живее душата моја и ке Те слави; и Твоите судови нека ми помогнат."},
	{176, "176 Се заблудив како загубена овца: побарај го Твојот слуга, зашто не ги заборавив Твоите заповеди."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view120() {
struct mk120 poems[] = {
	{1, "1 Кон Господа повикав во маката своја, и Он ме услиши."},
	{2, "2 Господи, избави ја душата моја од неправедна уста и од јазик лукав."},
	{3, "3 Што ке Ти даде Тебе и што ке Ти придаде лукавиот јазик?"},
	{4, "4 Изострени стрели на силник, разгорени со пустински јаглен."},
	{5, "5 Тешко мене, бидејки привремениот престој ми се продолжи, се вселив во шаторите кидарски."},
	{6, "6 Долго живееше душата моја со оние што го мразат мирот."},
	{7, "7 Јас бев мирољубив: но кога им зборував, тие војуваа против мене без причина."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view121() {
struct mk121 poems[] = {
	{1, "1 Ги кренав очите кон горите; од каде помош ке ми пристигне?"},
	{2, "2 Мојата помош е од Господа, Кој ги создаде небото и земјата."},
	{3, "3 Он нема да дозволи да се помести ногата твоја; нема да задреме Оној, Кој те пази;"},
	{4, "4 не дреме и не спие Оној, Кој го пази Израилот."},
	{5, "5 Господ е Твој чувар; Господ е твоја закрила од кај твојата десна рака."},
	{6, "6 Сонцето дење нема да те гори, ниту месечината ноке ке ти штети."},
	{7, "7 Гопсод ке те запази од секакво зло и ке ја чува душата твоја."},
	{8, "8 Господ ке го пази излегувањето твое и влегувањето твое отсега и довека."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view122() {
struct mk122 poems[] = {
	{1, "1 Се зарадував кога ми рекоа: 'Kе одиме во домот Господов.'"},
	{2, "2 Ете, нозете наши стоеја во твоите дворови, Ерусалиме, -"},
	{3, "3 Ерусалим, кој е изграден како град, излиен во една целина,"},
	{4, "4 Таму се искачуваа племињата, Господовите племиња, сведоштвото Израилево, за да се исповеда името Господово."},
	{5, "5 Зашто таму се поставија престолите судиски, престолите на домот Давидов."},
	{6, "6 Барајте мир за Ерусалим и нека им биде добдро на оние, кои те сакаат!"},
	{7, "7 Нека има мир околу sидовите твои и изобилие во кулите твои."},
	{8, "8 Поради браката мои и блиските мои зборував за мир во тебе!"},
	{9, "9 Заради домот на Господа, нашиот Бог, ти пожелувам добро."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view123() {
struct mk123 poems[] = {
	{1, "1 Ги кревам очите мои кон Тебе, Кој живееш на небесата."},
	{2, "2 Ете, како што се очите на слугите свртени кон рацете на господарите нивни, како очите на слугинката - кон раката на господарката нејзина, така и нашите очи гледаат кон Господа, нашиот Бог, се додека не се смилува."},
	{3, "3 Смилуј се на нас, Господи, смилуј се, зашто многу сме понизени со презир;"},
	{4, "4 зашто се преполни душата наша од навреди на силните и од понижување на горделивите."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view124() {
struct mk124 poems[] = {
	{1, "1 Да не беше Господ со нас, - нека каже Израилот, -"},
	{2, "2 да не беше Господ со нас, кога лу ето се кренаа против нас, -"},
	{3, "3 живи ке не проголтаа, кога пламна нивната јарост против нас;"},
	{4, "4 вода ке не потопеше, поток ке го однесеше животот наш;"},
	{5, "5 бурна вода ке ја однесеше нашата душа."},
	{6, "6 Нека е благословен Господ, Кој не не прададе во плен на нивните заби."},
	{7, "7 Душата наша се избави како птица од примка на ловци: примката се скина, а ние се избавивме."},
	{8, "8 Помошта наша е во името на Господа, Кој го создаде небото и земјата."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view125() {
struct mk125 poems[] = {
	{1, "1 Кои се надеваат во Господа, тие се како гората Сион; кој живее во Ерусалим, нема да се поколеба, ке живее вечно."},
	{2, "2 Околу Ерусалим има гори, а Господ е околу својот народ отсега и засекогаш."},
	{3, "3 Зашто Господ нема да го остави жезлото на грешниците врз земјата на праведните, за да не ги посегаат праведниците рацете свои кон беззаконие."},
	{4, "4 Гопсоди, направи им добро на добрите и на оние со чисто срце."},
	{5, "5 А оние што свртуваат кон крив пат, нив Господ ке ги одведе со оние што вршат беззаконие. Мир на Израилот!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view126() {
struct mk126 poems[] = {
	{1, "1 Кога Господ ги врати сионските заробеници, ние бевме како утешени;"},
	{2, "2 тогаш устата ни се исполни со радост, и јазикот наш - со весела песна; тогаш ме у незнабожците се говореше: 'Големи дела изврши Господ над нив!'"},
	{3, "3 Гоеми дела изврши Господ на нас: ние се развеселивме."},
	{4, "4 Врати ги, Господи над нас: ние се развеселивме."},
	{5, "5 Оние што сеат со солзи, ке жнеат со голема радост."},
	{6, "6 Одеа и плачеа оние што носеа свое семе; но со радост ке се вратат, носејки ги своите снопја."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view127() {
struct mk127 poems[] = {
	{1, "1 Ако Господ не ја изsида куката, залудо ке се трудат градителите нејзини; ако Господ не го запази градот, залудо ке бдее стражата."},
	{2, "2 Залудно вие станувате радо, доцна легнувате вие што го јадете лебот уморни; на оние кои Он ги сака ним им дава сон."},
	{3, "3 Ете, наследството Господово се синовите, дар од Него е породот."},
	{4, "4 Оне што се стрелите во раката на силниот, тоа се младите синови."},
	{5, "5 Блажен е оној човек, кому му е исполнет тегарчикот со нив! Тие нема да се засрамат, кога ке зборуваат со непријателите свои пред портите."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view128() {
struct mk128 poems[] = {
	{1, "1 Блажени се оние, кои се бојат од Господа, кои одат по Неговите патишта!"},
	{2, "2 Ти ке јадеш од плодовите на рацете свои: блазе тебе и добро ке живееш."},
	{3, "3 Жената во домот твој ке биде како лоза плодовита, синовите твои - како новонасадени малини околу трпезата твоја."},
	{4, "4 Ете, така ке биде благословен оној човек кој се бои од Господа."},
	{5, "5 Господ ке ги благослови од Сион; и ти ке ги гледаш добрата ерусалимски во сите дни на твојот живот;"},
	{6, "6 и ке ги видиш синовите на синовите твои. Мир нека е на Израилот!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view129() {
struct mk129 poems[] = {
	{1, "1 Многумина се бореа против мене уште од младоста моја - нека каже Израилот."},
	{2, "2 многупати војуваа против мене од младоста моја, но не ме совладаа."},
	{3, "3 На плешките мои грешниците дејствуваа, продолжувајки со своето беззаконие."},
	{4, "4 Но Господ праведен ги расече јажињата на грешниците."},
	{5, "5 Нека се засрамат и нека свртат назад сите, кои го мразат Сион!"},
	{6, "6 Нека бидат како тревата на покрив, која се исушува пред да биде истргната."},
	{7, "7 со која жетварот нема да ја исполни раката своја, ни прегратката своја оној што ја врзува во снопови."},
	{8, "8 А минувачите не рекоа: 'Благословение Господово на вас; ве благословуваме во името на Господа!'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view130() {
struct mk130 poems[] = {
	{1, "1 Од дното на душата повикав кон Тебе, Господи."},
	{2, "2 Господи, чуј го гласот мој. Ушите Твои нека го чујат гласот на молењето мое, -"},
	{3, "3 Господи, ако гледаш на беззаконијата, - тогаш кој ке се одржи, Господи?"},
	{4, "4 Но во Тебе има простување."},
	{5, "5 Заради името Твое, Господи, чекав долго на Тебе, чекаше душата моја на Твојот збор;"},
	{6, "6 душата моја се надеваше на Господа: Од утрената стража па до нокната, од утрената стража нека се надева Израилот на Господа."},
	{7, "7 Зашто милоста е во Господа и голем е откупот во Него."},
	{8, "8 И Он ке го избави Израилот од сите негови беззаконија."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view131() {
struct mk131 poems[] = {
	{1, "1 Господи, срцето мое не се вознесуваше, ниту очите мои се креваа високо; не копнеев по големи работи ниту по она што е над моите сили."},
	{2, "2 Но се смирував во мислите свои и ја воздигав душата моја како дете кон мајката своја; така возврати и на душата моја."},
	{3, "3 Нека се надева Израилот на Господа отсега и довека."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view132() {
struct mk132 poems[] = {
	{1, "1 Сети се, Господи, на Давида и на сета негова смиреност,"},
	{2, "2 како што се заколна пред Господа, и Му вети на Јакововиот Бог:"},
	{3, "3 'Нема да влезам под шаторот на домот свој, и нема да легнам на леглото мое;"},
	{4, "4 нема да им дадам сон на очите мои, ни дремка на ве ите мои, ниту одмор на слепоочниците мои,"},
	{5, "5 додека не најдам место за Господа, дом за Јакововиот Бог.'"},
	{6, "6 Ете, ние чувме дека е во Ефрат, го најдовме во дубравите;"},
	{7, "7 да влеземе во неговиот дом, да се поклониме пред местата каде што стојат нозете негови."},
	{8, "8 Стани, Господи, дојди во местото каде што е Твојата почивка, Ти и светиот ковчег Твој."},
	{9, "9 Твоите свештеници нека се облечат во правда; Твоите светии нека се зарадуваат."},
	{10, "10 Поради Давида, Твојот слуга, не одвракај го лицето Свое од Твојот помазаник."},
	{11, "11 Му се заколна Господ на Давида во вистината, и од неа нема да се откаже: 'Од плодот на твојата утроба ке поставам на престолот твој."},
	{12, "12 Ако твоите синови го пазат Мојот завет и моите сведоштва, на кои ке ги научам, тогаш и синовите нивни ке седат на твојот престол.'"},
	{13, "13 Затоа Господ го избра Сион, Му омиле да живее во него."},
	{14, "14 'Тоа е моето одмориште засекогаш: тука ке се населам, бидејки многу го засакав."},
	{15, "15 Kе го благословувам и преблагословувам трудот негов сиромасите негови со леб ке ги наситувам;"},
	{16, "16 свештениците негови ке ги облечам во спасение, и светиите негови радосно ке воскликнуваат."},
	{17, "17 Таму ке кренам рог за Давида, му подготвив светилник на Мојот помазаник."},
	{18, "18 Непријателите негови ке ги облечам во срам, а на него ке процути светоста Моја.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view133() {
struct mk133 poems[] = {
	{1, "1 Колку е убави и колку е мило кога браката живеат заедно!"},
	{2, "2 Тоа е како миро врз главата што се лее по брадата, брадата Аронова, што се лее по полите од одеждата негова;"},
	{3, "3 како роса ермонска, која па а на горите Сионски, зашто Господ дал благослов и живот вечен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view134() {
struct mk134 poems[] = {
	{1, "1 Благословувајте Го сега Господа, сите слуги Господови, што стоите ноке во домот Господов, во дворовите од домот на нашиот Бог."},
	{2, "2 Кренете ги рацете ваши ноке кон светилиштето и благословувајте Го Господа!"},
	{3, "3 Нека те благослови Господ од Сион, Создателот на небото и земјата."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view135() {
struct mk135 poems[] = {
	{1, "1 Фалете го името Господово, фалете го, слуги Господови,"},
	{2, "2 вие кои стоите во домот Господов, во дворовите од домот на нашиот Бог."},
	{3, "3 Фалете Го Господа, зашто Господ е добар; пејте му на името Негово, зашто тое е мило;"},
	{4, "4 зашто Господ го избра Јакова, Израилот, за свое наследство."},
	{5, "5 Бидејки познав, дека Господ е велик, и дека нашиот Господ е над сите богови:"},
	{6, "6 се што посака Господ, создаде на небото и на земјата, во морињата и во сите бездни."},
	{7, "7 доведувајки облаци од краиштата на земјата, молњи при дожд создаде, Он, Кој ги изведува ветровите од скровиштата нивни,"},
	{8, "8 Оној, Кој ги порази провородените во Египет од човек до добиток,"},
	{9, "9 покажа знаци и чудеса среде тебе, Египте, на Фараонот и врз сите слуги негови,"},
	{10, "10 порази многу народи и истреби силни цареви:"},
	{11, "11 Сион, царот аморејски, и Ог, царот васански, и сите цареви ханански;"},
	{12, "12 и му ја даде нивната земја во наследство на Својот народ, Израилот."},
	{13, "13 Господи, името Твое е вечно; Господи, споменот за Тебе е од род во род."},
	{14, "14 Зашто Господ ке му суди на Својот народ и ке биде милостив над слугите Свои."},
	{15, "15 Идолите на незнабожците се сребро и злато, дело на раце човечки;"},
	{16, "16 имаат уста, но не говорат; имаат очи, но не гледаат;"},
	{17, "17 имаат уши, но не слушаат, ниту, пак, во устата нивна има здив."},
	{18, "18 Слични на нив нека бидат и оние, кои ги прават, и секој кој на нив се надева."},
	{19, "19 Доме Израилев, благословувај Го Господа. Доме Аронов, благословувај Го Господа!"},
	{20, "20 Доме Левиев, благословувај Го Господа! И вие, кои се боите од Господа, благословувајте Го Господа!"},
	{21, "21 Нека е благословен Господ од Сион, Кој живее во Ерусалим!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view136() {
struct mk136 poems[] = {
	{1, "1 Славете Го Господа, зашто е добар, зашто е вечна милоста Негова."},
	{2, "2 Славете Го Бога на боговите, зашто е вечна милоста Негова."},
	{3, "3 Славете Го Господа над господарите, зашто е вечна милоста Негова,"},
	{4, "4 Единиот Кој прави големи чудеса, зашто е вечна милоста Негова;"},
	{5, "5 Кој премудро го создаде небото, зашто е вечна милоста Негова;"},
	{6, "6 Кој ја утврди земјата врз водите, зашто е вечна милоста Негова;"},
	{7, "7 Единиот Кој ги создаде големите светила, зашто е вечна милоста негова;"},
	{8, "8 сонцето - да управува со денот, зашто е вечна милоста Негова;"},
	{9, "9 месечината и sвездите - да управуваат со нокта, зашто е вечна милоста Негова."},
	{10, "10 Кој го порази Египет и провородените негови, зашто е вечна милоста Негова;"},
	{11, "11 Кој го изведе Израилот од средината нивна, зашто е вечна милоста Негова;"},
	{12, "12 со цврста рака и подигната мишка, зашто е вечна милоста Негова;"},
	{13, "13 Кој го раздвои Црвеното Море, зашто е вечна милоста Негова;"},
	{14, "14 и го преведе Израилот среде него, зашто е вечна милоста Негова;"},
	{15, "15 а Фараонот и војската негова ги фрли во Црвеното Море, зашто е вечна милоста Негова."},
	{16, "16 Кој го преведе својот народ преку пустињата, зашто е вечна милоста Негова; Кој пушти вода од шилчеста крапа, зашто е вечна милоста Негова;"},
	{17, "17 Кој ги порази големите цареви, зашто е вечна милоста Негова;"},
	{18, "18 и ги погуби силните цаерви, зашто е вечна милоста Негова;"},
	{19, "19 Сион, царот аморејски, зашто е вечна милоста Негова;"},
	{20, "20 и Ог, царот васански, зашто е вечна милоста Негова;"},
	{21, "21 и му ја даде земјата во наследство, зашто е вечна милоста Негова."},
	{22, "22 во наследство на Својот слуга, Израилот, зашто е вечна милоста Негова;"},
	{23, "23 Кој се секава на нас во нашата смиреност, зашто е вечна милоста Негова;"},
	{24, "24 и не избавува од непријателите наши, зашто е вечна милоста Негова;"},
	{25, "25 и Кој дава храна на секое тело, зашто е вечна милоста Негова."},
	{26, "26 Славете Го небесниот Бог, зашто е вечна милоста Негова. Хвалете Го Господарот на господарите, зашто е вечна милоста Негова."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view137() {
struct mk137 poems[] = {
	{1, "1 Крај реките вавилонски - таму седевме и плачевме, кога ке се сетевме на Сион;"},
	{2, "2 на врбите, среде Вавилон, ги закачивме нашите харфи."},
	{3, "3 Зашто таму, оние што не заробија и кои не одведоа, побараа од нас радосна песна, велејки ни: 'Пејте ни од песните сионски!'"},
	{4, "4 Како да зепееме Господова песна на ту а земја?"},
	{5, "5 Ако Те заборавам тебе, Ерусалиме, - нека ме заборави мојата десница,"},
	{6, "6 нека се залепи јазикот мој за непцето мое, ако не те помнам, ако не го поставам Ерусалим над секоја моја радост."},
	{7, "7 Сети се, Господи, на синовите Едомови, во денот на Ерусалим, кога тие говореа: 'Разрушете, разрушете го до темелите негови!'"},
	{8, "8 Kерко вавилонска, опустошителко, блажен е оној, што ке ти врати за делото што ни го направи!"},
	{9, "9 Блажен е ониј што ке ги заграби и ке ги разбие од камен децата твои."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view138() {
struct mk138 poems[] = {
	{1, "1 Kе Те славам Тебе, Господи, со сето срце свои и ке Ти пеам пред ангелите Твои, затоа што ги услиша сите зборови на устата моја."},
	{2, "2 Се поклонувам пред светиот Твој храм и го славам името Твое за милоста Твоја и за вистината Твоја, зашто го возвеличи името Свое свето над се."},
	{3, "3 Во оној ден кога ке Те призивам, услиши ме брзо, внеси бодрост во душата моја."},
	{4, "4 Kе Те прославуваат, Господи, сите земни цареви, штом ке ги чујат зборовите од Твојата уста,"},
	{5, "5 и ке воспеваат за патиштата Господови, зашто е голема славата Господова."},
	{6, "6 Зашто возвишен е Господ: и смирениот го гледа, а горделивиот оддалеку го познава."},
	{7, "7 Кога ке се најдам во тага - Ти живот ми даваш, ја пружаш раката врз јароста на моите непријатели и Твојата десница ме спасува."},
	{8, "8 Господ ке направи што е добро за мене! Твојата милост, Господи, е вечна; делата на рацете Свои не презирај ги!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view139() {
struct mk139 poems[] = {
	{1, "1 Господи, Ти си ме испитал и ме знаеш."},
	{2, "2 Ти знаеш кога седнувам и кога станувам; Ти оддалку ги разбираш мислите мои."},
	{3, "3 Патеката моја и јажето мое - Ти си ги испитал; сите патишта мои си ги предвидел."},
	{4, "4 Уште зборови не ми дошле до јазикот мој, Ти, Господи, веке ги знаеш:"},
	{5, "5 Се што ми било и се што ке биде. Зашто Ти си ме создал и си ја положил раката Своја врз мене."},
	{6, "6 Се восхитувам на Твоето знаење, - тое е превисоко, не можам да му пријдам!"},
	{7, "7 каде да одам од Твојот дух, и од лицето Твое каде да побегнам?"},
	{8, "8 Ако излезам на небото - Ти си таму; ке слезам ли во пеколот, Ти си и тука."},
	{9, "9 Ако ги земам криљата рано в зори и се преселам на крајот од морето, -"},
	{10, "10 и таму ке ме води Твојата рака, Твојата десница ке ме држи."},
	{11, "11 Па си реков: можеби темнина ке ме покрие, но и нокта е како светлина околу мене;"},
	{12, "12 но и темнината нема да биде темнина за Тебе; и нокта за Тебе е светла како ден и темнината како светлина."},
	{13, "13 Зашто Ти си ја создал мојата внатрешниот и ме прифати од мајчината ми утроба."},
	{14, "14 Те прославувам затоа што сум чудесно создаден. Прекрасни се Твоите дела; душата моја тоа добро го сознава."},
	{15, "15 Ниедна моја коска не се сокри од Тебе, што си ја создал тајно, и природата моја во длабините на земјата."},
	{16, "16 Твоите очи го видоа зародишот мој и во Книгата Твоја се е запишано за мене, дури и деновите мои се забележани кога уште не постоеше ниеден."},
	{17, "17 Твоите пријатели во голема се чест, Боже, и нивните владенија добро се зацврстени."},
	{18, "18 Kе ги пребројам - но тие се побројни и од песокта; се разбудив и се уште сум со Тебе."},
	{19, "19 Кога би сакал да ги убиеш, Боже, грешниците; иставете се од мене, крвопијци!"},
	{20, "20 Ревниви се во помислите свои, суетно се креваат Твоите непријатели."},
	{21, "21 Зар не ги замразив оние. Господи, кои Тебе те мразат, и зар не се изедов поради непријателите Твои?"},
	{22, "22 Со полна омраза ги замразив; тие ми станаа непријатели."},
	{23, "23 Испитај ме, Боже, и познај го срцето мое; испитај ме и запознај ги патеките мои;"},
	{24, "24 и види дали сум на пат на беззаконија, и упати ме на вечен пат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view140() {
struct mk140 poems[] = {
	{1, "1 Спаси ме, Господи, од лукав човек и избави ме од неправеден човек;"},
	{2, "2 тие смислија зло врз срцето свое, секој ден се подготвуваат за борба;"},
	{3, "3 ги изострија јазиците свои како змија; под устите им е аспидин отров."},
	{4, "4 Запази, ме, Господи, од рацете на грешник. Избави ме од лу е неправедни, кои смислија да ми подметнат нога."},
	{5, "5 Горделивите тајно поставија стапица, и распнаа примки од јажиња за мене; на патот ми поставија соблазна."},
	{6, "6 Јас Му реков на Господа: Ти си Бог мој: услиши го, Господи, гласот на моето молење."},
	{7, "7 Господи, Господи, сило на моето спасение! Ти, Кој во денот на битката ја засолни главата моја,"},
	{8, "8 не предавај ме, Господи, на грешникот против мојата желба; не давај да постигнат, што намислија за да не се возгордеат."},
	{9, "9 Главата своја да не ја подигнат оние што ме опколија, нека падне врз нив злобата на нивната сопствена уста."},
	{10, "10 Нека паднат врз нив жарени јаглења; да бидат фрлиени во оган, па од маките да не станат."},
	{11, "11 Човек иноверец нема да се одрже на земјава; злото ке го одвлече неправедниот човек во погибел."},
	{12, "12 Разбрав дека Господ ке покаже правда за угнетените и милост за сиромасите."},
	{13, "13 Да, праведниците ке ги исповедаат името Твое, и непорочните ке се населат пред лицето Твое."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view141() {
struct mk141 poems[] = {
	{1, "1 Господи, кон Тебе повикав: услиши ме, чуј го гласот на молењето мое, кога повикувам кон Тебе!"},
	{2, "2 Нека се исправи пред Тебе молитвата моја како темјан, а воздигањето на рацете мои - како жртва вечерна."},
	{3, "3 Постави, Господи, стража пред устата моја и врата на усните мои;"},
	{4, "4 не давај да застрани срцето мое кон зборовите лукави, да врши грешни дела заедно со лу ето, кои вршат беззаконија; јас нема да се здружам со нивните избраници."},
	{5, "5 Преведникот нека ме казнува - тоа е милост; нека ме изобличува, не не давај елеј на грешник да ја помаже главата моја; зашто и молитвата моја се противи на нивната злоба."},
	{6, "6 Судиите нивни, кога ке се распрснат по стрмни камења, ке се чујат зборовите мои, зашто се пријатни."},
	{7, "7 Како кога грутка земја ке падне се растура, така се растурија коските наши во пеколот."},
	{8, "8 Но кон Тебе, Господи, Господи, се управени очите мои; на Тебе се надевам, не одземај ја душата моја!"},
	{9, "9 Запази ме од стапиците што ми ги поставија, и од соблазната на оние што вршат беззаконија."},
	{10, "10 Грешиците нека паднат во своите мрежи, само јас ке поминам."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view142() {
struct mk142 poems[] = {
	{1, "1 Со гласот свој повикав кон Господа, со гласот свој Му се помолив на Господа."},
	{2, "2 Kе го излијам пред Него молењето мое: маката моја пред Него ке ја кажам."},
	{3, "3 Кога изнемоштуваше духот мој, Ти ја знаеше мојата патека, на патот, по кој одев, тие скришно примки ми поставија."},
	{4, "4 Се обsирав надесно и гледав, а таму никој кој ме познаваше: немаше каде да избегам; никој не се грижеше за душата моја."},
	{5, "5 Повикав кон тебе, Господи, и реков: 'Ти си мојата надеж и мој дел во земјата на живите."},
	{6, "6 Прими ја молитвата моја, зашто се понизив многу; избави ме од моите гонители, оти тие се посилни од мене."},
	{7, "7 Изведи ја од темнина душата моја, за да го прославувам името Твое. Мене ке ме чекаат праведните, додека не ме повратиш.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view143() {
struct mk143 poems[] = {
	{1, "1 Господи, услиши ја молитвата моја, чуј го молењето мое поради Твојата вистина; услиши ме поради Твојата правда"},
	{2, "2 и не стапувај во суд со Твојот слуга, зашто пред Тебе нема да се оправда ниту еден од живите."},
	{3, "3 Непријателот ја прогонува душата моја, го понизил животот мој дури до земјата, ме остави во темнина како оние кои се одамна умрени;"},
	{4, "4 опадна духот мој во мене, се вознемири во мене срцето мое."},
	{5, "5 Се сетив на дамнешните дни и размислував за сите Твои дела, расудував за делата на Твоите раце."},
	{6, "6 Ги протегнав кон Тебе рацете мои, душата моја е жедна за Тебе како сува земја."},
	{7, "7 Улиши ме, поскоро, Господи: духот мој малакса; не одвракај го лицето Свое од мене, за да не заприлегам на оние, што слегуваат во гроб."},
	{8, "8 Соопшти ми ја утрената милост Твоја, зашто на Тебе се надевам, Господи. Покажи ми го, Господи, патот по кој да одам, зашто кон Тебе ја вознесувам душата своја."},
	{9, "9 Избави ме, Господи, од моите непријатели, зашто при Тебе прибегнав."},
	{10, "10 Научи ме да ја исполнувам вољата Твоја, зашто Ти си мојот Бог. Твојот благ дух нека ме води по прав пат."},
	{11, "11 Заради Твоето име, Господи, ке ме оживиш; поради Твојата правда - ке ја избавиш од невоља душата моја."},
	{12, "12 Според милоста Твоја истреби ги непријателите мои и погуби ги сите, кои ја измачуваат душата моја, зашто јас сум слуга Твој."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view144() {
struct mk144 poems[] = {
	{1, "1 Нека е благословен Господ, Бог мој, Кој ги учи рацете мои за борба и прстите мои за војна."},
	{2, "2 Он е милост моја и прибежиште мое, мој застапник и избавител мој - и јас на Него се надевам. Он ми го потчинува мојот народ мене."},
	{3, "3 Господи, што е човекот, па внимаваш на него, или син човечки - та да се секаваш на него."},
	{4, "4 Човекот е како здив; дните негови одминуваат како сенка."},
	{5, "5 Господи, приклони ги небесата Свои и слези; допри се до горите, и тие ке се здимат;"},
	{6, "6 болсни со молњи и ке ги растераш, пушти ги стрелите Свои и ке ги збуниш;"},
	{7, "7 подај ја раката Твоја од височини, изведи ме и избави ме од многуте води, од рацете на ту ински синови,"},
	{8, "8 чии усти кажуваат суета и чија десница е десница на неправдата."},
	{9, "9 Боже, нова песна ке Ти испеам, ке Ти свирам на харфа со десет жици."},
	{10, "10 Ти им даруваш спасение на царевите, Ти го избави Твојот слуга Давида од остар меч."},
	{11, "11 Избави ме и отми ме од рацете на ту инските синови, чии усти лага говореа и чија десница е десница на неправдата."},
	{12, "12 синовите наши се како нови насади во младоста своја, нашите керки се накитени и украсени како столбови во храмот."},
	{13, "13 Полни се житниците наши, во изобилите со секаква храна; се плодат овците наши по пасиштата свои."},
	{14, "14 И воловите ни се угоени, па нема па ање не оградите, ни премин, ниту офкање по улиците наши."},
	{15, "15 Блажен е оној народ, велат лу ето, кој го има тоа! Блажен е оној народ, на кого Господ му е Бог!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view145() {
struct mk145 poems[] = {
	{1, "1 Kе Те превеознесувам, Боже мој, Цару мој, и ке го благословувам името Твое сега, секогаш и во сите векови."},
	{2, "2 Секој ден ке Те благословувам и ке го фалам името Твое сега, секогаш и во сите векови."},
	{3, "3 Велик е Господ и достоен за голема похвала и величието Негово нема крај."},
	{4, "4 Од род во род ке се фалат делата Твои и за силата Твоја ке се прикажува."},
	{5, "5 За велелепната слава на Твојата светост ке зборуваат и за Твоите чудеса ке известуваат."},
	{6, "6 Kе говорат и за силата на Твоите страшни дела, и ке прикажуваат и за Твоето величие."},
	{7, "7 Kе ги помнат многуте добрини Твои, и ке се радуваат на Твојата правда."},
	{8, "8 Штедар и милостив е Господ, долготрпелив и многумилостив."},
	{9, "9 Добар е Господ спрема сите, и Неговите штедрости се во сите Негови дела."},
	{10, "10 Нека Те прославуваат, Господи, сите Твои дела, и нека Те благословуваат светиите Твои,"},
	{11, "11 и нека ја проповедаат славата на Твоето царство, а да прикажуваат и за силата Твоја."},
	{12, "12 За да им се кажува на синовите човечки, за Твојата сила и за велелепната слава на Твоето царство."},
	{13, "13 Твоето царство е царство на сите векови, а владеењето Твое над сите поколенија; верен е Господ во сите Свои зборови и свет во сите Свои дела."},
	{14, "14 Господ ги придржува сите што па аат и ги подига наведнатите."},
	{15, "15 Очите на сите се управени кон Тебе, и Ти им ја даваш нивната храна навреме;"},
	{16, "16 Ти ја отвори ракта Твоја и исполнуваш се што е живо со сите негови потреби."},
	{17, "17 Праведен е Господ во сите Свои патишта и свет во сите Свои дела."},
	{18, "18 Близу е Господ до сите, кои Го признаваат, до сите, кои вистински Го призиваат."},
	{19, "19 Он им ја исполнува желбата на оние, кои се бојат од Него, ги услишува молитвите нивни, и ги спасува."},
	{20, "20 Господ ги пази сите кои Го сакаат, а сите грешници ке ги истреби."},
	{21, "21 Устата моја ке искаже похвала на Господа; секое тело нека го благословува името свето, сега, секогаш и во сите векови."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view146() {
struct mk146 poems[] = {
	{1, "1 Фали Го, душо моја, Господа!"},
	{2, "2 Kе Го фалам Господа додека сум жив; ке Му пеам на мојот Бог додека постојам."},
	{3, "3 Не надевајте се на кнезовите и на синовите човечки, во нив нема спасение."},
	{4, "4 Излегува духот негов, и тој се врака во земјата своја: во тој ден исчезнуваат сите негови помисли."},
	{5, "5 Блажен е ониј, кому му е помошник Јакововиот Бог и чија надеж е во Господа, неговиот Бог,"},
	{6, "6 Кој го создаде небото и земјата, морето и се што е во нив, Кој вечно ја пази вистината,"},
	{7, "7 Кој врши суд на навредени, им дава леб на гладни; Господ крши окови на затворени."},
	{8, "8 Господ им ги отвора очите на слепите, Господ ги исправа подгрбавените, Господ ги сака праведните."},
	{9, "9 Господ ги пази придојдените, ги поддржува сираците и вдовиците, а патот на грешниците го разурнува."},
	{10, "10 Господ ке царува вечно; твојот Бог, Сионе, е од род в род."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view147() {
struct mk147 poems[] = {
	{1, "1 Хвалете Го Господа, зашто е добро да Му се пее на нашиот Бог, зашто на Добриот Му прилега похвала."},
	{2, "2 Господ го гради Ерусалим и ке ги собере расеаните синови на Израилот."},
	{3, "3 Он ги изцелува скрушените по срце и ги преврзува раните нивни."},
	{4, "4 Го определува бројот на sвездите и не сите им дава име."},
	{5, "5 Велик е Господ наш и голема е силата Негова, а мудроста Негова - неизмерлива е."},
	{6, "6 Господ ги прифака смирените, а грешниците ги понижува до земја."},
	{7, "7 Пејте Му секогаш славословија на Господа: на гусле пејте Му на Нашиот Бог,"},
	{8, "8 Кој го покрива небото со облаци, подготвува дожд за земјата, прави да расте трева по горите и растенијата за полза на човекот,"},
	{9, "9 на добитокот му ја дава храната негова и на малите врани кога гракаат."},
	{10, "10 На коњската сила не гледа Он, ниту Му е мила брзината на човечките нозе."},
	{11, "11 Господ ги почитува оние, кои се бојат од Него и кои се надеваат на Неговата милост."},
	{12, "12 Пофали Го, Ерусалиме, Господа; пофали Го, Сионе, твојот Бог."},
	{13, "13 Он ги зацврсти резињата на вратите твои, ги благословува твоите синови во Тебе;"},
	{14, "14 го утврдува мирот во Твоите предели, со јадра пченица те заситува;"},
	{15, "15 го испрака на земјата Својот благослов; Неговиот збор брзо оди;"},
	{16, "16 дава снег како волна; сипува магла како пепел;"},
	{17, "17 фрла град Свој како залаци; пред Неговиот мраз кој може да устои?"},
	{18, "18 Kе го испрати благословот, и се се растопува; ке дувне со ветрот Свој, и води потекуваат."},
	{19, "19 Он му го кажа благословот Свој на Јакова, Своите наредби и Своите судови на - Израилот."},
	{20, "20 на никот друг народ Он не му го направил тоа, и Своите судови ним не им ги јавил."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view148() {
struct mk148 poems[] = {
	{1, "1 Фалете Го Господа на небесата, фалете Го, на висините."},
	{2, "2 Фалете Го, сите ангели Негови, фалете Го, сите војски Негови."},
	{3, "3 Фалете Го, сонце и месечино, фалете Го сите sвезди и светила."},
	{4, "4 Фалете Го, небеса на небесата и води над небесата."},
	{5, "5 Нека го фалат името на Господа, зашто Он ече и тие се јавија, заповеда - и се создадоа;"},
	{6, "6 ги постави за секогаш и за вечни времиња; даде наредби кои нема да се нарушат."},
	{7, "7 Фалете Го Господа од земјата, вие, сите али и бездни;"},
	{8, "8 огнот и градот, снегот и мразот, и ти, бурен ветру, кој го исполнуваш словото Негово;"},
	{9, "9 гори и сите возвишенија, плодородни дрвја и сите кедри,"},
	{10, "10 sверови и сиот добиток, влекачи и птици крилати,"},
	{11, "11 цареви земни и сите народи, кнезови и сите земни судии,"},
	{12, "12 момчиња и девојки, старци со децата -"},
	{13, "13 сите нека го фалат името на Господа; зашто е само Неговото име возвишено; Него Го фалат на небото и на земјата."},
	{14, "14 Он ке ја подигне силата на Својот народ; Он ги прославува сите Свои светии, синовите Израилеви, на народот, кој Му е близок."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view149() {
struct mk149 poems[] = {
	{1, "1 Запејте Му на Господа нова песна; похвала за Него да се чуе во храмот на светиите."},
	{2, "2 Нека се весели Израилот на Својот Создател; а синовите на Сион, нека се радуваат на својот Цар."},
	{3, "3 Нека го фалат името Негово во оро, со тимпани и со гусли нека Го слават,"},
	{4, "4 зашто Господ го сака Својот народ и ке ги возвиши кротките, спасувајки ги."},
	{5, "5 Kе се развеселат светиите во слава, ке се зарадуваат врз леглата свои."},
	{6, "6 Славословија за Бога ке има во устите нивни и двоостер меч - во рацете нивни,"},
	{7, "7 за да извршат одмазда над народите, за казна над племињата,"},
	{8, "8 да ги врзат во верига царевите нивни и нивните властелини - со железни окови на рацете;"},
	{9, "9 да го извршат над нив напишаниот суд. Тоа ке биде славата за сите Негови светии."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view150() {
struct mk150 poems[] = {
	{1, "1 Фалете Го Бог во Неговата светиња, фалете Го во цврстината на силата Негова;"},
	{2, "2 Фалете Го поради Неговите сили, фалете Го поради многуте величија Негови."},
	{3, "3 Фалете Го со трубен збук, фалете Го со псалтир и гусли;"},
	{4, "4 Фалете Го со тимпани и во оро, фалете го на струни и со свирка;"},
	{5, "5 фалете Го со милозвучни кимвали, фалете Го со кимвали громогласни!"},
	{6, "6 Се што дише - нека Го фали Господа! Алилуја."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};