#include <map>
#include <string>
class Bible50
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Павле и Тимотеј, слуги на Христос Исус, до сите светии во Христос Исус, кои се во Вилипи, заедно со надзорниците и ѓаконите: "},
	{2, "2 благодат вам и мир од Бог нашиот Татко и од Господ Исус Христос. "},
	{3, "3 Му благодарам на својот Бог секогаш кога си спомнувам за вас; "},
	{4, "4 секогаш во секоја своја молитва се молам за сите вас со радост, "},
	{5, "5 заради вашето учество во Евангелието од првиот ден досега. "},
	{6, "6 Уверен сум во тоа, дека Оној Кој го започна доброто дело во вас, ќе го доврши до Денот на Христос Исус. "},
	{7, "7 А и исправно е да го мислам тоа за сите вас, зашто ве имам во срцето сите вас кои сте соучесници со мене во благодатта - како во моите окови, така и во одбраната и утврдувањето на Евангелието. "},
	{8, "8 Зашто Бог ми е сведок колку копнеам по сите вас со срдечната љубов на Христос Исус. "},
	{9, "9 И затоа се молам вашата љубов да изобилува сè повеќе и повеќе во целосно познавање и во секакво расудување, "},
	{10, "10 за да можете да го распознавате она што е подобро; за да бидете искрени и беспрекорни за Христовиот ден, "},
	{11, "11 исполнети со плодот на праведноста, кој е преку Исус Христос, за слава и пофалба на Бог. "},
	{12, "12 А сакам да знаете, браќа, дека ова што се случува со мене помогна за поголем напредок на Евангелието, "},
	{13, "13 така што им стана јасно на целата царска стража и на сите други, дека сум во окови заради Христос, "},
	{14, "14 и дека повеќето од браќата во Господ, охрабрени од моите окови, се осмелуваат сè повеќе без страв да го проповедаат Божјото слово. "},
	{15, "15 Навистина, едни Го проповедаат Христос од завист и соперништво, а други од добра волја; "},
	{16, "16 едни од љубов, знаејќи дека сум поставен за одбрана на Евангелието, "},
	{17, "17 а други Го навестуваат Христос од себични пориви, не со чиста намера, мислејќи да ми нанесат тага во моите окови. "},
	{18, "18 Но што тогаш? Само тоа: дека на секаков начин, било дволично или искрено, Христос се навестува. На тоа му се радувам и ќе се радувам, "},
	{19, "19 зашто знам дека ова - преку вашата молитва и помошта на Духот на Исус Христос - ќе ми биде за избавување, "},
	{20, "20 сходно со моето цврсто очекување и надеж, дека во ништо нема да се засрамам, туку како и секогаш во сета смелост, така и сега, Христос ќе е возвишен во моето тело, било преку живот или преку смрт. "},
	{21, "21 Зашто за мене да живеам е Христос, а да умрам - придобивка. "},
	{22, "22 Но ако и натаму живеам во телото, тоа за мене значи плодна работа - и не знам што да изберам. "},
	{23, "23 Притиснат сум од две страни, имам желба да си заминам и да бидам со Христос, што е далеку подобро, "},
	{24, "24 но заради вас е попотребно да останам во телото. "},
	{25, "25 И наполно уверен во тоа, знам дека ќе останам и ќе продолжам со сите вас, за ваш напредок и за радост во верата. "},
	{26, "26 А вашата пофалба преку мене да биде уште поизобилна во Христос Исус, заради моето повторно доаѓање кај вас."},
	{27, "27 Само однесувајте се достојно на Христовото Евангелие, за да можам јас - било да дојдам и да ве видам, било да сум отсутен - да чујам за вас дека стоите цврсто во еден дух, дека еднодушно се борите за евангелската вера, "},
	{28, "28 и дека воопшто не се вознемирувате од противниците, што е знак за нивна погибел, а спасение за вас, и тоа од Бог. "},
	{29, "29 Зашто вам ви беше дадено заради Христос не само да верувате во Него, туку и да страдате заради Него, "},
	{30, "30 имајќи ја истата борба, каква што видовте во мене, а и сега слушате за мене. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 И така, ако има некаква утеха во Христос, ако има некакво охрабрување од љубов, ако има некаква заедница на Духот, ако има некакво сочувство и сожалување, "},
	{2, "2 направете ја мојата радост целосна, имајќи исти мисли и иста љубов, обединети во духот и со една цел. "},
	{3, "3 Не правете ништо од ривалство или од суетно честољубие, туку во понизност сметајте се еден друг за поголем од себеси! "},
	{4, "4 Не гледајте само на своите лични интереси, туку и на интересите на другите. "},
	{5, "5 Имајте такви мисли во себе, какви што ги имаше и Исус Христос: "},
	{6, "6 Кој, иако беше во ликот Божји, не го сметаше како нешто приграбено- тоа што е еднаков со Бог, "},
	{7, "7 туку се лиши Самиот Себеси, земајќи лик на слуга, станувајќи сличен со луѓето. "},
	{8, "8 И откако стана сличен на човек, Тој се понизи Самиот Себеси и стана послушен до смрт, дури до смрт на крст. "},
	{9, "9 Затоа и Бог Го возвиши и Му подари име што е над секое име, "},
	{10, "10 та во името Исус да се поклони секое колено на оние кои се на небото, на земјата и под земјата; "},
	{11, "11 и секој јазик да признае дека Исус Христос е Господ, за слава на Бог Таткото. "},
	{12, "12 Затоа, мили мои, како што секогаш бевте послушни, не само кога бев кај вас, туку уште повеќе сега, кога не сум кај вас, градете го своето спасение со страв и трепет. "},
	{13, "13 Зашто Бог е Оној Кој ве поттикнува да сакате и да дејствувате според Неговата волја. "},
	{14, "14 Правете сè без ропот и расправа, "},
	{15, "15 за да бидете беспрекорни и незлобни Божји чеда, непорочни сред изопачено и расипано поколение, меѓу кое сте како светила во светот, "},
	{16, "16 држејќи го цврсто словото на животот, за да имам со што да се фалам во Христовиот ден, дека не трчав залудно и дека залудно не се трудев. "},
	{17, "17 Но, макар што сум излеан врз жртвата и службата на вашата вера, се радувам и ја споделувам својата радост со сите вас. "},
	{18, "18 А исто така радувајте се и вие и споделете ја вашата радост со мене. "},
	{19, "19 Но се надевам во Господ Исус наскоро да ви го испратам Тимотеј, та и јас да се охрабрам кога ќе дознаам како сте вие. "},
	{20, "20 Зашто немам друг истомисленик, кој толку искрено ќе се грижи за вас, "},
	{21, "21 бидејќи сите други го бараат своето, а не она што е на Христос Исус. "},
	{22, "22 Bие го знаете неговиот докажан карактер, дека со мене служеше во ширењето на Евангелието како дете на таткото. "},
	{23, "23 Затоа, се надевам дека ќе го испратам него веднаш штом ќе разберам што ќе стане со мене. "},
	{24, "24 А се надевам во Господ дека и јас самиот наскоро ќе дојдам. "},
	{25, "25 Сепак, сметав дека е за потребно да ви го испратам Епафродит, својот брат, соработник и соборец, а ваш пратеник и служител на моите потреби; "},
	{26, "26 бидејќи копнееше по сите вас и беше нажален зашто сте чуле дека бил болен. "},
	{27, "27 Навистина, беше смртно болен, но Бог му се смилува, и не само нему, туку и мене, за да не ми дојде тага врз тага. "},
	{28, "28 Затоа го испратив поскоро, па повторно да се зарадувате кога ќе го видите, и јас да бидам помалку загрижен. "},
	{29, "29 Затоа, примете го во Господ, со секаква радост и почитувајте ги таквите, "},
	{30, "30 зашто заради Христовото дело се најде близу до смртта, излагајќи го својот живот на опасност, за да го надомести тоа што вие не можевте да го направите за мене. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 На крај, браќа мои, радувајте се во Господ! Мене не ми е здодевно да ви го пишувам тоа па тоа, а вам ви служи како заштита. "},
	{2, "2 Пазете се од кучињата, пазете се од злите работници, пазете се од лажното обрежување! "},
	{3, "3 Зашто, вистинското обрежување сме ние кои служиме со Божјиот Дух и се фалиме во Христос Исус и не се надеваме на телото, "},
	{4, "4 иако и јас можам да имам доверба во телото. Ако некој друг мисли дека може да има доверба во телото, јас уште повеќе: "},
	{5, "5 обрежан сум во осмиот ден, од израелевиот род сум, од Бенјаминовото племе, Евреин од Евреите, по Закон - фарисеј, "},
	{6, "6 по ревност - гонител на црквата, а според праведноста на Законот бев беспрекорен. "},
	{7, "7 Но тоа што ми беше некогаш придобивка, го сметав за загуба поради Христос. "},
	{8, "8 И уште повеќе, сметам дека сè е загуба во однос на превосходното познавање на Христос Исус, мојот Господ, заради Кого загубив сè и сè сметам за смет, за да Го придобијам Христос "},
	{9, "9 и да се најдам во Него, без своја праведност, која доаѓа од Законот, туку по праведноста која доаѓа преку верата во Христос, праведноста која е од Бог врз основа на вера, "},
	{10, "10 за да Го познавам Него и силата на Неговото воскресение, и учеството во Неговите страдања, станувајќи сличен на Него во Неговата смрт, "},
	{11, "11 та некако да достигнам до воскресението од мртвите. "},
	{12, "12 Не велам дека веќе го достигнав или дека веќе станав совршен, туку се стремам да го достигнам она за кое и самиот бев достигнат од Христос Исус. "},
	{13, "13 Браќа, јас уште не мислам дека го достигнав тоа, но сепак правам едно: го заборавам она што е зад мене, а се стремам кон она што е пред мене; "},
	{14, "14 трчам кон целта, за наградата на горното призвание од Бог во Христос Исус. "},
	{15, "15 И така, ние кои сме совршени нека мислиме вака, а ако вие мислите и малку поинаку, Бог ќе ви го открие и тоа. "},
	{16, "16 Сепак, да живееме според достигнатото! "},
	{17, "17 Браќа, имајте ме за пример и гледајте на оние што живеат според примерот што го имате во нас! "},
	{18, "18 Зашто мнозина, за кои ви зборував многупати, а сега зборувам и со солзи, живеат како непријатели на Христовиот крст. "},
	{19, "19 Нивниот крај е погибел; нивниот бог им е стомакот; нивната слава е во нивниот срам; тие мислат само на земното. "},
	{20, "20 А нашето граѓанство е на небесата, од каде и Го очекуваме Спасителот Господ Исус Христос, "},
	{21, "21 Кој ќе го преобрази нашето понижено тело - да се сообрази со Неговото славно тело, според дејството на Неговата сила, со која може да покори сè под Себе. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Затоа, мили и многу сакани мои браќа за кои копнеам, моја радост и мој венец, стојте така цврсто во Господ, мили мои! "},
	{2, "2 Ја преколнувам Еводија и ја преколнувам Синтихија да бидат едномислени во Господ. "},
	{3, "3 Сепак, те молам и тебе, верен другару, помагај им, зашто со мене се трудеа за Евангелието, заедно со Климент и со другите мои соработници, чии имиња се во Книгата на животот. "},
	{4, "4 Радувајте се секогаш во Господ и пак ќе кажам, радувајте се! "},
	{5, "5 Bашата трпеливост нека им биде позната на сите луѓе! Господ е близу. "},
	{6, "6 Не грижете се за ништо, туку во сè, преку молитва и благодарност, искажувајте ги своите барања пред Бог! "},
	{7, "7 А Божјиот мир, што го надминува секое разбирање, ќе ги штити вашите срца и вашите мисли во Христос Исус. "},
	{8, "8 Најпосле, браќа, сè што е вистинито, што е чесно, што е праведно, што е чисто, што е љубезно, што е на добар глас - ако е некаква доблест, ако е некаква пофалба - размислувајте за тоа! "},
	{9, "9 Она што го научивте, примивте, чувте и видовте во мене - тоа правете го, и Бог на мирот ќе биде со вас! "},
	{10, "10 Се зарадував многу во Господ, зашто сега најпосле ја оживеавте својата грижа за мене. Bие и инаку се грижевте, но немавте можност. "},
	{11, "11 Не го зборувам тоа заради скудност, зашто научив да бидам задоволен во секакви околности. "},
	{12, "12 Знам да живеам и во скудност, знам и во изобилство. Ја научив тајната да бидам сит и да гладувам во секакви околности; да сум во изобилство и во скудност. "},
	{13, "13 Сè можам преку Христос, Кој ми дава сила. "},
	{14, "14 Туку добро направивте што зедовте учество во моите неволи. "},
	{15, "15 А знаете и вие, Вилипјани, дека во почетокот на проповедањето на Евангелието, кога заминав од Македонија, ниедна црква не беше со мене во давањето и примањето, освен единствено вие, "},
	{16, "16 зашто ми испративте во Солун, еднаш и по вторпат, за моите потреби. "},
	{17, "17 Јас не барам подарок, туку го барам плодот што се умножува во ваша полза. "},
	{18, "18 Примив сè и имам изобилно. Целосно сум подмирен откако го примив од Епафродит она што ми испративте - благопријатен мирис, жртва прифатлива и по волјата на Бог. "},
	{19, "19 А мојот Бог ќе ги исполни сите ваши потреби, според Своето богатство во славата - во Христос Исус. "},
	{20, "20 А на нашиот Бог и Татко, слава во сите векови. Амин! "},
	{21, "21 Поздравете го секој светија во Христос Исус! Bе поздравуваат браќата кои се со мене. "},
	{22, "22 Bе поздравуваат сите светии, а особено оние од Цезаровиот дом. "},
	{23, "23 Благодатта на Господ Исус Христос да биде со вашиот дух!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};