#include <map>
#include <string>
class Bible57
{
	struct mk1	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Павле, затвореник за Христос Исус и братот Тимотеј, до нашиот мил брат и соработник Вилемон, "},
	{2, "2 до нашата сестра Апфија, до нашиот соборец Архип и до црквата во твојот дом. "},
	{3, "3 Благодат вам и мир од Бог, нашиот Татко, и од Господ Исус Христос. "},
	{4, "4 Му благодарам на мојот Бог, секогаш спомнувајќи те во моите молитви, "},
	{5, "5 бидејќи слушам за твојата љубов и за верата што ја имаш спрема Господ Исус и спрема сите светии; "},
	{6, "6 твоето учество во верата нека биде делотворно преку познавањето на секое добро што е во тебе преку Христос. "},
	{7, "7 Зашто имав голема радост и утеха во твојата љубов, бидејќи ти ги освежи срцата на светиите. "},
	{8, "8 Затоа, иако имам голема смелост во Христос да ти заповедам да го правиш она што е исправно, "},
	{9, "9 заради љубовта повеќе сакам да те молам, јас, ваков каков што сум, Павле, старец, а сега и затвореник за Христос Исус; "},
	{10, "10 те молам за моето чедо Онисим, кого го родив во окови, "},
	{11, "11 кој некогаш ти беше некорисен, а сега ни е мошне корисен и тебе и мене. "},
	{12, "12 Ти го праќам назад, него, срцето мое. "},
	{13, "13 Сакав да го задржам кај себе, за да ми служи место тебе во оковите поради Евангелието, "},
	{14, "14 но не сакав ништо да сторам без твоја согласност, за да не биде твојата добрина од принуда, туку доброволно. "},
	{15, "15 Можеби затоа беше одделен од тебе за малку време, за да го примиш назад засекогаш, "},
	{16, "16 но не веќе како роб, туку повеќе од роб - како мил брат, особено за мене, а уште повеќе за тебе, и во телото и во Господа. "},
	{17, "17 И така, ако мене ме сметаш за близок, прими го како мене! "},
	{18, "18 А ако ти направил некаква штета или ти должи нешто, стави го тоа на моја сметка. "},
	{19, "19 Јас, Павле, кој го пишувам ова своерачно, ќе платам; а да не ти спомнувам дека тоа што си, ми го должиш мене. "},
	{20, "20 Да, брате, дозволи да видам некаква полза од тебе во Господ; закрепни ми го срцето во Христос. "},
	{21, "21 Ти го пишувам ова, имајќи доверба во твојата послушност, зашто знам дека ќе направиш и повеќе отколку што ти барам. "},
	{22, "22 А едновремено со тоа приготви ми и сместување, зашто се надевам дека, преку вашите молитви, ќе ви бидам даруван. "},
	{23, "23 Те поздравуваат: Епафрас, кој е со мене затвореник за Христос Исус, како и моите соработници Марко, Аристарх, Дима и Лука. "},
	{24, "24 Благодатта на Господ Исус Христос нека биде со твојот дух. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};