#include <map>
#include <string>
class Bible36
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Словото Господово упатено до Софонија, синот на Хусија, син Годолиев, син Амориев, син Езекиин, во деновите на Јосија, син Амонов, цар јудејски."},
	{2, "2 Се ке истребам од земјата - вели Господ;"},
	{3, "3 ке ги збришам лу ето и добитокот, ке ги истребам птиците небески и рибите морски и соблазните заедно со безбожниците; ке ги истребам лу ето од лицето на земјата, вели Господ."},
	{4, "4 И ке ја протегнам раката Своја врз Јудеја и врз сите жители на Ерусалим; ке ги истребам од тоа место остатоците на Ваала, името на жреците со свештениците,"},
	{5, "5 и оние, кои на покривите се поклонуваат на небесната војска, и од поклониците оние што се колнат во Господа и се колнат во својот цар,"},
	{6, "6 како и оние, што отстапија од Господа, не Го бараат Господа ниту прашуваат за Него."},
	{7, "7 Замолкни пред лицето на Господа Бога, зашто близу е денот Господен. Веке го приготви Господ жртвеното клање, определи и кого да повика."},
	{8, "8 Во денот на жртвата Господова Јас ке ги посетам кнезовите, синовите на царот и сите, што се облекуваат во облеки на другоплеменици;"},
	{9, "9 ке ги посетам во оној ден сите, кои го прескокнуваат прагот, што го исполнуваат домот на својот Господ со насилство и измама."},
	{10, "10 И во тој ден, вели Господ, ке има вик при Рибните порти и ридање при другите порти, а и големо уривање на ридови."},
	{11, "11 Плачете жители од долниот дел на градот, оти ке исчезнат сите трговци; истребени ке бидат сите што носат сребро."},
	{12, "12 А во тоа време Јас ке го разгледам Ерусалим со светило и ке ги казнам оние, кои седат на своите стражарски места и велат во срцето свое: 'Господ не прави ни добро ни лошо';"},
	{13, "13 пак ке станат богатствата нивни пљачка и куките нивни ке се запустат, и нема да живеат во нив; и ке насадат лоза, но вино нема да пијат од неа."},
	{14, "14 Близу е денот велик на Господа, близу е - и многу брза: веке и се слуша гласот на денот Господен. Со горчина ке завика тогаш дури и најхрабриот."},
	{15, "15 Тој ден е ден на гневот, ден на жалост и на тескоба, ден за запустување и уривање, ден на темнина и на мрак, ден облачен и маглив,"},
	{16, "16 ден на труба и на боен повик против утврдените градови и високите кули."},
	{17, "17 И Јас ке ги притеснам лу ето, и тие ке одат како слепи, оти згрешија против Господа, и растурена ке биде крвта нивна како прав, и телата нивни како смет."},
	{18, "18 Ни среброто нивно, ниту златото нивно не ке може да ги спаси во денот на гневот Господен, а од огнот на ревноста Негова ке биде уништена таа земја, и тоа ке биде ненадеен крај на сите жители нејзини."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Приберете се, приберете се внимателно, народи необуздани,"},
	{2, "2 додека уште не е дојден судот - денот ке мине како трици, додека уште не е дојден врз вас пламнатиот гнев Господен, додека не настапил денот на јароста Господова."},
	{3, "3 Побарајте го Господа, сите смирени на земјата, вие што ги извршувате законите Негови; побарајте ја правдата, побарајте го смирението; можеби ке се сокриете во денот на гневот Господен."},
	{4, "4 Оти Газа ке биде напуштена и Аскалон ке запусти, Азот ке биде изгонет среде ден, а Екрон ке се искорени."},
	{5, "5 Тешко им на жителите од приморскиот крај, на народот од Крит! Словото Господово е врз вас, Хананејци, земјо Филистејска! Јас ке те истребам, и во тебе нема да има жители, -"},
	{6, "6 па ке стане приморскиот крај овчарска кошара и ограда за добиток."},
	{7, "7 И тој крај ке му се падне на остатокот од домот Јудин, и ке пасат таму и во куките на Аскалон вечерта ке ја поминуваат, зашто Господ, нивниот Бог, ке ги посети и ке им го поврати пленот одземен од нив."},
	{8, "8 Го чув хулењето од Моава и навредите од синовите Амонови, како се подигруваат со Мојот народ и како се шират во пределите негови,"},
	{9, "9 Но жив сум Јас, вели Господ Саваот, Бог Израилев: Моав ке биде како Содом, и синовите на Амона ке бидат како Гомор, замја на коприви, соларник, пустиња за навек; остатокот од Мојот народ ке ги плени, и оние што ке останат од Мојот народ, ке ги наследи."},
	{10, "10 Тоа ке им биде за гордоста нивна, оти се подигруваа и се ширеа над народот на Господа Саваот."},
	{11, "11 Страшен ке биде за нив Господ: Он ке ги истреби сите земни богови, и Нему ке Му се поклонат - сите од своите места, сите острови на народите."},
	{12, "12 И вие, Етиопјани, ке бидете поразени од Мојот меч."},
	{13, "13 Господ ке ја протегне раката своја на север, ке го уништи Асур, а Ниневија ке ја претвори во урнатина, во место суво како пустиња,"},
	{14, "14 и стада ке лежат по неа и секаков вид животни: пеликан и еж ке нокеваат во резбите и украсите; гласот нивни ке се разнесува низ прозорците, уривањето ке се покаже на столбовите од вратите, зашто на нив нема да има облоги од кедар."},
	{15, "15 Ете, што ке стане прочуениот град, кој живееше безгрижно и во срцето свое си вели: 'Јас сум и нема друг освен мене.' Како ке стане урнатина, легло за sверови! И секој што ке помине покрај него, ке потсвирне и ке мавне со раката."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Тешко на непокорен, осквернет и насилнички град!"},
	{2, "2 Не слуша глас, не прифака поука, не се надева на Господа, не се приближува до Својот Бог."},
	{3, "3 Кнезовите негови се како лавови што рикаат, судиите негови - вечерни волци, кои до утрината не оставаат ниту една коска."},
	{4, "4 Пророците негови се лу е лесномислени, неверни; свештениците негови ја осквернуваат светињата, ги газат законите."},
	{5, "5 Господ е праведен среде него, не врши неправда, секое утро го произнесува Својот суд на видело, но беззаконикот не знае за срам."},
	{6, "6 Јас ги истребив народите - разрушени им се тврдините; ги опустив улиците нивни, така што никој не оди по нив; разорени се градовите нивни: нема ниту еден човек, нема жител."},
	{7, "7 Јас реков: 'Бој се само од Мене, прими поука!' и нема да го постигне зло живеалиштето негово, какво што му бев определил; а тие грижливо се трудеа да ги расипат сите свои дела."},
	{8, "8 И така, чекајте Ме, вели Господ, до оној ден, кога ке се кренам на опустошување; зашто Јас одлучив да ги соберам народите, да ги свикам царствата, за да го излијам врз нив Моето негодување, сета јарост на Мојот гнев; зашто од огнот на јароста Моја ке биде уништена целата земја."},
	{9, "9 Тогаш Јас пак ке им дадам на чистите народи уста да го призовуваат името на Господа и да Му служат еднодушно."},
	{10, "10 Од краиштата отаде реката на Етиопија поклониците Мои - Моите растурени деца - ке Ми принесат дарови."},
	{11, "11 Во тој ден ти нема да се срамуваш за твоите неразумни постапки, со кои грешеше против Мене, оти тогаш Јас ке ги отстранам од твојата средина оние, кои залудо се фалеа со твојата слава, и нема повеке да се гордеат на Мојата света гора."},
	{12, "12 Но ке оставам среде тебе народ смирен и прост, и тие ке се надеваат на името Господово."},
	{13, "13 Остатоците од Израилот нема да вршат неправда, нема да зборуваат лага, и во устата нивна нема да се најде јазик сплеткарски, зашто сами ке си пасат и ке лежат, и никој нема да ги вознемирува."},
	{14, "14 Радувај се, керко Сионова, ликувај, Израиле, весели се и радувај се од се срце, керко ерусалимска:"},
	{15, "15 Господ ја одмени пресудата над тебе, го изгони непријателот твој. Господ, Царот Израилев, е посреде тебе: нема повеке да видиш зло."},
	{16, "16 Во оној ден ке му речат на Ерусалим: 'не бој се' и на Сион 'да не заслабнат рацете твои.'"},
	{17, "17 Господ, твојот Бог, е посреде тебе. Он е силен да те спаси; ке се развесели за тебе со радост, ке биде милостив според љубовта Своја, ке се гордее за тебе со песни.'"},
	{18, "18 Оние што тагуваат за празнични торжества, Јас ке ги соберам; а тие се твои, врз нив лежи тежок укор."},
	{19, "19 Ете, Јас ке ги притеснам сите твои мачители во она време, ке го спасам она што е хромо, ке ги соберам расеаните и ке им дадам чест и слава по целата земја, каде што беа под срам."},
	{20, "20 Во она време ке ве доведам, во она време ке ве соберам вас, зашто ке ве направам прочуени и почитувани ме у сите народи на земјата, кога ке го вратам вашиот плен пред очите ваши, вели Господ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};