#include <map>
#include <string>
class Bible55
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Павле, апостол на Христос Исус по Божја волја, според ветениот живот во Христос Исус, "},
	{2, "2 до Тимотеј, моето мило чедо: благодат, милост и мир од Бог Таткото и Христос Исус, нашиот Господ. "},
	{3, "3 Му благодарам на Бог Кому со чиста совест Му служам уште од моите прародители, спомнувајќи те постојано, ноќе и дење, во своите молитви; "},
	{4, "4 а кога ќе си спомнам за твоите солзи, копнеам да те видам, да се исполнам со радост; "},
	{5, "5 зашто си спомнувам за нелицемерната вера што е во тебе, која отпрвин се наоѓаше во твојата баба Лоида и во мајка ти Евникија, а уверен сум дека е и во тебе. "},
	{6, "6 Затоа ти напомнувам да го разгоруваш Божјиот дар, кој е во тебе преку моето ракополагање. "},
	{7, "7 Зашто Бог не ни даде дух на страшливост, туку дух на сила, љубов и воздржливост. "},
	{8, "8 Затоа, не срами се од сведоштвото за нашиот Господ и од мене, затвореникот за Него, туку страдај и ти со мене за Евангелието, според силата на Бог, "},
	{9, "9 Кој нè спаси и нè повика со свето призвание, не според нашите дела, туку по сопствената цел и благодат, која ни беше дадена во Христос Исус уште пред вечни времиња, "},
	{10, "10 а која сега се откри преку јавувањето на нашиот Спасител Христос Исус, Кој ја укина смртта и на виделина донесе живот и бесмртност преку Евангелието, "},
	{11, "11 за кое јас сум поставен како гласник, апостол и учител. "},
	{12, "12 Заради тоа и го поднесувам сето ова, но не се срамам, зашто знам во Кого сум поверувал и уверен сум дека Тој може да го запази она што Му го доверив, сè до оној Ден. "},
	{13, "13 Држи се за примерот на здравото слово што го имаш чуено од мене во верата и љубовта која е во Христос Исус! "},
	{14, "14 Запази го доброто што ти е доверено преку Светиот Дух Кој живее во нас. "},
	{15, "15 Ти го знаеш тоа, дека во Азија сите се одвратија од мене, меѓу кои се и Вигел и Ермоген. "},
	{16, "16 Господ да му даде милост на домот на Онисофор, зашто повеќепати ме освежи и не се засрами од моите окови, "},
	{17, "17 туку, кога дојде во Рим, грижливо ме побара и ме најде. "},
	{18, "18 (да му даде Господ да најде милост пред Господа во оној Ден!) А ти, многу добро знаеш каква служба вршеше тој во Ефес. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Затоа, ти чедо мое, зајакнувај во благодатта, која е во Христос Исус! "},
	{2, "2 И она што го имаш слушнато од мене пред многу сведоци, довери им го на доверливи луѓе, кои исто така ќе бидат способни да поучуваат и други! "},
	{3, "3 Поднесувај ги со мене страдањата, како добар воин на Христос Исус! "},
	{4, "4 Никој, кој е во воена служба, не се плетка во работите од секојдневието, за да му угоди на оној кој го повикал да биде војник. "},
	{5, "5 Исто така, ако некој се натпреварува, не добива венец ако не се натпреварува според правилата. "},
	{6, "6 Земјоделецот кој се труди треба прв да вкуси од плодовите. "},
	{7, "7 Разбери што зборувам, а Господ ќе ти даде разбирање за сè. "},
	{8, "8 Помни Го Исус Христос, Кој воскресна од мртвите, Кој е од Давидовото потомство, според моето Евангелие, "},
	{9, "9 за кое страдам сè до окови, како некаков злосторник. Но Божјото слово не е оковано. "},
	{10, "10 Заради тоа поднесувам сè заради избраните, та и тие да го добијат спасението во Христос Исус, а заедно со него и вечна слава. "},
	{11, "11 Bеродостојно е кажаното: 'Ако умревме со Него, со Него и ќе живееме; "},
	{12, "12 ако издржиме, со Него и ќе царуваме; ако се откажеме од Него, и Тој ќе се откаже од нас; "},
	{13, "13 ако сме неверни, Тој останува верен! Зашто Сам Себе не може да се откаже.' "},
	{14, "14 Напомнувај им ги овие работи и наложи им сериозно пред Бог, да не се препираат околу зборови, што е неполезно и што води кон пропаст на слушателите. "},
	{15, "15 Труди се да се покажеш себеси проверен пред Бога како работник, кој не треба да се срами, кој правилно го образложува словото на вистината! "},
	{16, "16 А одбегнувај непристојни и празни разговори, зашто тоа води кон поголема безбожност, "},
	{17, "17 а нивните зборови ќе се шират како рак-рана. Меѓу таквите се Именеј и Вилет, "},
	{18, "18 кои скршнаа од вистината, тврдејќи дека воскресението веќе настапило и со тоа ја рушат верата на некои. "},
	{19, "19 Сепак, цврсто стои Божјата основа, која го има овој печат: 'Господ ги познава Своите' и 'Секој што Го изговара Господовото име нека отстапи од неправдата!' "},
	{20, "20 А во голем дом има не само златни и сребрени садови, туку и дрвени и земјени. Едните се за почесна, а другите за срамна намена. "},
	{21, "21 Па така, ако некој се исчисти од овие работи, ќе биде сад за почесна намена, осветен, полезен на господарот и подготвен за секое добро дело. "},
	{22, "22 Бегај од страстите на младоста! Стреми се кон праведност, вера, љубов и мир со оние кои Го повикуваат Господа од чисто срце. "},
	{23, "23 Отфрли ги безумните и неразумните распрашувања, знаејќи дека раѓаат расправии! "},
	{24, "24 А Господовиот слуга не смее да се расправа, туку треба да биде благ спрема сите, способен да поучува и да е трпелив; "},
	{25, "25 да ги воспитува со кроткост оние кои се противат, за да им даде Бог покајание, кое води кон целосно познавање на вистината, "},
	{26, "26 за да си дојдат на себеси и да избегаат од стапицата на ѓаволот кој ги има заробено за да ја вршат неговата волја. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 И знај го ова: во последните денови ќе настапат тешки времиња, "},
	{2, "2 зашто луѓето ќе бидат себични, среброљупци, фаленичари, горделиви, пцујачи; непокорни на родителите, неблагодарни, несвети; "},
	{3, "3 без љубов, непомирливи, злобни клеветници, невоздржани, свирепи, непријатели на доброто, "},
	{4, "4 предавници, безобѕирни, надуени, повеќе сластољубиви отколку богољубиви, "},
	{5, "5 кои имаат изглед на побожност, а се откажале од нејзината сила; а таквите одбегнувај ги! "},
	{6, "6 Зашто меѓу нив има такви кои се вовлекуваат во домовите и ги мамат неразумните жени обременети со гревови, кои се водени од различни страсти, "},
	{7, "7 кои постојано учат, а никогаш да дојдат до познавањето на вистината. "},
	{8, "8 И како што Јаниј и Јамвриј му се спротивија на Мојсеј, така и овие и се противат на вистината, луѓе со изопачен ум, отфрлени во однос на верата. "},
	{9, "9 Но нема да напредуваат веќе, зашто нивното безумие ќе се открие пред сите, како што се откри и на оние двајца. "},
	{10, "10 А ти внимателно го следеше моето учење, поведението, замислата, верата, долготрпението, љубовта, истрајноста, "},
	{11, "11 прогонствата, страдањата што ми се случија во Антиох, во Иконија и во Листра. Какви прогонства претрпев, а Господ ме избави од сите! "},
	{12, "12 А и сите кои ќе живеат побожно во Христос Исус, ќе бидат прогонувани, "},
	{13, "13 додека злите луѓе и измамниците ќе напредуваат во злото, мамејќи и бидувајќи мамени. "},
	{14, "14 А ти остани во она што си го научил и во што си убеден, зашто знаеш од кого си го научил и "},
	{15, "15 зашто уште од детството ги познаваш Светите Писма, кои можат да ти ја дадат мудроста која води кон спасение преку верата во Христос Исус. "},
	{16, "16 Целото Писмо е од Бог вдахновено и е полезно за поучување, за прекорување, за поправање и за воспитување во праведност, "},
	{17, "17 за да биде Божјиот човек совршен и подготвен за секое добро дело. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Те заколнувам пред Бог и Христос Исус, Кој ќе им суди на живите и на мртвите со Неговото јавување и Неговото царство: "},
	{2, "2 проповедај го словото, настојувај во време и во невреме, укорувај, предупредувај, охрабрувај со сета трпеливост и со поука. "},
	{3, "3 Зашто ќе дојде време кога не ќе го трпат здравото учење, туку според своите похоти ќе си насоберат учители какви што сакаат, па тие да им ги скокоткаат ушите, "},
	{4, "4 и ќе ги одвратат ушите од вистината, а ќе се свртат кон приказни. "},
	{5, "5 А ти биди трезвен во сè, истрпи зло, врши ја работата на евангелист и исполнувај ја својата служба докрај. "},
	{6, "6 Зашто јас веќе се излеав и времето на моето заминување настапи. "},
	{7, "7 Извојував добра борба, го завршив патот, ја запазив верата. "},
	{8, "8 А сега натаму ми е подготвен венецот на праведноста, што ќе ми го даде во оној Ден Господ, Праведниот Судија, и не само мене, туку и на сите кои го засакаа Неговото јавување. "},
	{9, "9 Погрижи се набргу да дојдеш кај мене, "},
	{10, "10 зашто Димас ме остави, бидејќи го засака сегашниов свет и отиде во Солун. Крискент отиде во Галатија, а Тит во Далмација. "},
	{11, "11 Само Лука е со мене. Земи го Марко и доведи го со себе, зашто ми е полезен за службата. "},
	{12, "12 Тихик го пратив во Ефес. "},
	{13, "13 Кога ќе дојдеш, донеси ми ја наметката што ја оставив во Троја кај Карп и свитоците, особено пергаментните! "},
	{14, "14 Бакарџијата Александар ми направи голема пакост; Господ ќе му плати според неговите дела. "},
	{15, "15 И ти пази се од него, зашто им се противеше многу на нашите зборови. "},
	{16, "16 При мојата прва одбрана никој не беше со мене, туку сите ме оставија; нека не им се припише за зло! "},
	{17, "17 Но Господ беше со мене и ми даде сила, за преку мене да се изврши навестувањето, и за да го чујат сите народи; а јас бев избавен од лавовска уста. "},
	{18, "18 Господ ќе ме избави од секое зло дело и сигурно ќе ме воведе во Своето небесно царство, на кое слава Му за вечни векови. Амин! "},
	{19, "19 Поздрави ги Прискила и Акила и домот на Онисифор! "},
	{20, "20 Ераст остана во Коринт, а Трофим го оставив болен на Малта. "},
	{21, "21 Погрижи се да дојдеш пред зимата! Те поздравуваат Еубул, Пуден, Лин, Клаудија и сите браќа. "},
	{22, "22 Господ да биде со твојот дух! Благодатта да биде со вас."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};