#include <map>
#include <string>
class Bible60
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Петар, апостол на Исус Христос, до избраните кои живеат како новодојдени, раштркани по Понт, Галатија, Кападокија, Азија и Битинија, "},
	{2, "2 одбрани според провидението на Бог Таткото, преку осветувањето на Духот, за послушност и попрскување со крвта на Исус Христос: да ви се множат благодатта и мирот. "},
	{3, "3 Благословен да е Бог, Таткото на нашиот Господ Исус Христос, Кој по Својата голема милост нè роди одново за жива надеж, преку воскресението на Исус Христос од мртвите, "},
	{4, "4 за нераспадливо и неизвалкано наследство, кое не венее, запазено на небесата за вас, "},
	{5, "5 кои сте зачувани со Божјата сила, преку верата, за спасение, готово да се открие во последно време. "},
	{6, "6 А за ова радувајте се многу, иако сега за кратко можеби бевте на мака од разни испитувања, "},
	{7, "7 та вредноста на вашата вера, која е поскапоцена од пропадливо злато, кое се испробува во оган, да се покаже за пофалба, слава и чест, при откровението на Исус Христос, "},
	{8, "8 Кого Го љубите иако не сте Го виделе, во Кого верувате, иако сега не Го гледате, и се радувате со неискажлива радост полна со слава, "},
	{9, "9 постигнувајќи ја целта на својата вера: спасение на душите. "},
	{10, "10 Ова спасение го истражуваа и го испитуваа пророците, кои пророкуваа за благодатта што требаше да дојде. "},
	{11, "11 Тие испитуваа на кого и на какво време посочуваше Христовиот Дух, Кој беше во нив, кога однапред навестуваше за Христовите страдања и за идната слава. "},
	{12, "12 Ним им беше откриено дека не си служеа себеси, туку вам, со овие нешта што сега ви ги објавија преку оние кои ви го проповедаа Евангелието преку Светиот Дух кој беше испратен од небото, нешта во кои ангелите копнеат да наѕрат. "},
	{13, "13 Затоа, соберете си го умот, бидете трезвени, утврдете ја вашата надеж целосно во благодатта која ќе ви биде донесена при откровението на Исус Христос. "},
	{14, "14 Како послушни чеда, не сообразувајте се според некогашните похоти што ги имавте за време на незнаењето, "},
	{15, "15 туку како и Светиот Кој ве повика, бидете и самите свети во сето свое поведение, "},
	{16, "16 зашто е напишано: 'Бидете свети, бидејќи Јас сум свет.' "},
	{17, "17 И ако Го нарекувате Татко Оној Кој непристрасно го суди секој поединец според делата, поминете го со страхопочит времето на својот животен пат, "},
	{18, "18 знаејќи дека не сте откупени со распадливи нешта, како сребро или злато, од својот суетен живот што го имате наследено од вашите претци, "},
	{19, "19 туку со скапоцената крв на Христос како невино и чисто Јагне, "},
	{20, "20 Кој навистина беше предопределен пред создавањето на светот, а се јави во овие последни времиња заради вас; "},
	{21, "21 кои преку Него верувате во Бог Кој Го воскресна од мртвите и Му даде слава, та вашата вера и вашата надеж да бидат во Бога. "},
	{22, "22 Бидејќи ги исчистивте вашите души во послушност спрема вистината, за нелицемерно братољубие, сакајте се искрено еден друг од сè срце, "},
	{23, "23 зашто сте новородени не од распадливо семе, туку од нераспадливото живо и вечно Божјо слово. "},
	{24, "24 Зашто 'секое тело е како трева и сета негова слава како цвет од трева: тревата венее и цветот отпаѓа, "},
	{25, "25 а Господовиот збор останува во вечни векови.' Тоа е зборот, кое ви беше проповедано како Евангелие. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 И така, оставајќи ги настрана секоја злоба и секаква измама, лицемерство, завист и сите клевети, "},
	{2, "2 како новороденчиња, копнејте по духовното, вистинско млеко на словото, па со него да пораснете за спасението, "},
	{3, "3 ако сте вкусиле дека Господ е добар. "},
	{4, "4 Пристапувајќи Му Нему како на жив камен, Кого луѓето Го отфрлија, но Кој е од Бог избран и скапоцен, "},
	{5, "5 и вие самите, како живи камења, изградувајте се како духовен дом, за свето свештенство, за да принесувате духовни жртви, прифатливи за Бог, преку Исус Христос. "},
	{6, "6 Зашто вака стои во Писмото: 'Еве, поставувам на Сион Камен темелник, одбран и скапоцен, и кој верува во Него, нема да се засрами.' "},
	{7, "7 Оваа скапоценост, значи, е за вас кои верувате, а за оние кои не веруваат:'Каменот, што го отфрлија ѕидарите, стана камен темелник' "},
	{8, "8 и 'камен за сопнување и карпа за соблазнување', тие се сопнуваат, бидејќи му се непокорни на словото, за што се и определени. "},
	{9, "9 А вие сте избран род, царско свештенство, свет народ, кој Му припаѓа на Бог, за да ги прогласите доблестите на Оној Кој ве повика од темнината во Својата чудесна светлина. "},
	{10, "10 Bие кои некогаш не бевте народ, сега сте Божји народ; вие кои некогаш не добивте милост, сега сте помилувани. "},
	{11, "11 Мили мои, ве молам, како туѓинци и новодојдени, да се воздржувате од телесните похоти, кои војуваат против душата. "},
	{12, "12 Однесувајте се примерно меѓу многубошците, токму во она за што ве клеветат како злосторници; така што врз основа на вашите добри дела, кога ќе ги видат, да Го прослават Бог во денот на посетата. "},
	{13, "13 Заради Господ, покорувајте и се на секоја човечка власт: било на царот, како владетел, "},
	{14, "14 било на управителите, како негови пратеници пратени од Него да ги казнуваат злосторниците, а да ги пофалуваат оние кои прават добро! "},
	{15, "15 Зашто ова е Божја волја: правејќи добро, да го замолкнете незнаењето на неразумните луѓе. "},
	{16, "16 Дејствувајте како слободни и не употребувајте ја слободата како оправдување на злото, туку користете ја како Божји слуги! "},
	{17, "17 Почитувајте ги сите, негувајте братољубие, бојте се од Бог, почитувајте го царот! "},
	{18, "18 Слуги, покорувајте им се на своите господари со целосна почит, но не само на добрите и кротките, туку и на суровите! "},
	{19, "19 Зашто тоа се цени, ако заради својата совест пред Бог, човек трпи и тагува кога неправедно страда. "},
	{20, "20 Инаку, каква е пофалбата ако трпите кога ве казнуваат за вашите престапи? Но, ако страдате и трпите кога правите добро, тоа е благодат пред Бога. "},
	{21, "21 Зашто за тоа сте повикани, бидејќи и Христос страдаше за вас и ви остави пример, та и вие да врвите по Неговите стапки. "},
	{22, "22 Тој не направи грев и не се најде измама во Неговата уста. "},
	{23, "23 Тој, Кој беше навредуван, не возвраќаше со навреда; кога страдаше - не се закануваше, туку се предаде Себеси на Оној Кој суди праведно. "},
	{24, "24 Тој Сам во Своето тело ги понесе нашите гревови на дрвото, та ние, умирајќи за гревот, да живееме за праведноста; преку Неговите рани се исцеливте. "},
	{25, "25 Зашто талкавте како овци, но сега се вративте кај Пастирот и Чуварот на вашите души. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Така и вие, жени, бидете им покорни на своите мажи, та ако некои не му бидат послушни на словото, да бидат придобиени без зборови, преку поведението на своите жени, "},
	{2, "2 кога ќе го видат вашето непорочно и чесно поведение. "},
	{3, "3 Bашето украсување да не биде надворешно: во плетење на косата, во китење со златен накит или во раскошно облекување, "},
	{4, "4 туку во скриената личност во срцето, во нераспадливиот украс на кроткиот и тивок дух, што е од голема вредност пред Бога. "},
	{5, "5 Зашто така некогаш се украсуваа светите жени кои се надеваа во Бог, и им се покоруваа на своите мажи, "},
	{6, "6 како што Сара му беше послушна на Авраам и го нарекуваше господар, а вие сте нејзини ќерки, кога правите добро, немајќи страв од ништо. "},
	{7, "7 А и вие, мажи, живејте во слога со жените како со послаб сад и искажувајќи им почит како на сонаследнички на благодатта на животот, за да не бидат спречувани вашите молитви. "},
	{8, "8 На крајот, бидете сите едномислени, сочувствителни, братољубиви, љубезни и понизни; "},
	{9, "9 не враќајте зло за зло или навреда за навреда, туку, напротив, благословувајте, бидејќи повикани сте токму за тоа, за да наследите благослов. "},
	{10, "10 Зашто 'кој сака да го љуби животот и да види добри денови, нека си го воздржува јазикот од зло и усните од измама; "},
	{11, "11 нека е скраја од злото и нека прави добро, нека бара мир и нека се стреми кон него; "},
	{12, "12 зашто Господовите очи бдеат над праведниците и Неговите уши ја слушаат нивната молитва, а Господовото лице е против оние кои вршат зло.' "},
	{13, "13 И кој ќе ви напакости, ако покажувате ревност за доброто? "},
	{14, "14 А ако и страдате заради праведноста, блажени сте! 'Не вознемирувајте се и не плашете се од нивните закани,' "},
	{15, "15 туку прославувајте Го во своите срца Христос како Господ, секогаш готови да му одговорите на секој што бара одговор за надежта која е во вас, но со кроткост и страхопочит, "},
	{16, "16 имајте добра совест, та оние кои го навредуваат вашето добро поведение во Христос, да се посрамат за она за што ве клеветат. "},
	{17, "17 Зашто подобро е, ако е по Божјата волја да страдате правејќи добро, отколку правејќи зло. "},
	{18, "18 Зашто и Христос умре за гревовите еднаш засекогаш, Праведниот за неправедните, за да може да нè одведе кај Бог; убиен во телото, но оживеан во духот; "},
	{19, "19 во кој отиде и им проповедаше на духовите, кои се сега затворени, "},
	{20, "20 кои некогаш беа непокорни, кога Божјото трпение ги чекаше во Ноевото време, додека се градеше ковчегот, во кој само неколкумина, односно осум души, се спасија преку водата. "},
	{21, "21 Bо согласност со овој приказ, сега крштавањето ве спасува, кое не е отстранување на телесната нечистотија, туку е покажување на добра совест спрема Бог, преку воскресението на Исус Христос, "},
	{22, "22 Кој Му е оддесно на Бог, откако отиде на небото каде Му се потчинија и ангелите и властите и силите. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 И така, бидејќи Христос настрада за нас во телото, вооружете се и вие со истата цел - зашто оној кој настрадал во тело прекинал со гревот, "},
	{2, "2 та преостанатото време на животот, во телото, да не го поминете според човечките похоти, туку според Божјата волја, "},
	{3, "3 бидејќи доволно е тоа што во минатото ги спроведувавте желбите на многубошците трчајќи по сладострастие, похоти, пијанство, гозби, пијанки и гнасно идолопоклонство. "},
	{4, "4 Затоа сега и се чудат дека вие не трчате со нив во истата крајност на развратот, и затоа ве клеветат. "},
	{5, "5 Но тие ќе Му дадат сметка на Оној Кој е готов да им суди на живите и на мртвите. "},
	{6, "6 За таа цел им беше проповедано Евангелието и на оние кои се мртви, та иако тие се судени во тело како луѓе да живеат во дух според Бог. "},
	{7, "7 А наближи крајот на сè. Затоа бидете разумни и со трезвен дух во молитвите. "},
	{8, "8 Пред сè, имајте сесрдна љубов меѓу себе, зашто љубовта покрива многу гревови. "},
	{9, "9 Бидете гостољубиви еден спрема друг, без негодување. "},
	{10, "10 Бидејќи секој од вас добил дар, користете го во служба еден на друг како добри управители на многукратната Божја благодат. "},
	{11, "11 Ако некој говори, нека зборува како да се Божји зборови; ако некој служи, нека служи како со силата која Бог ја дава, за во сите работи да се прослави Бог преку Исус Христос, Кому Му припаѓаат славата и власта во сите векови. Амин. "},
	{12, "12 Мили мои, не чудете се на огненото испитување што се појави меѓу вас, за да ве испита, небаре ви се случува нешто необично, "},
	{13, "13 туку, радувајте се дека соучествувате во Христовите страдања, за да можете да се радувате и веселите при откровението на Неговата слава. "},
	{14, "14 Блажени сте ако ве напаѓаат заради Христовото име, зашто тогаш Духот на славата и Божјиот Дух почива врз вас. "},
	{15, "15 Никој од вас да не страда како убиец, или крадец, или злосторник или како оној што се меша во туѓи работи; "},
	{16, "16 но, ако страда како христијанин, да не се срами, туку да Го слави Бог со тоа име, "},
	{17, "17 зашто време е судот да почне од Божјиот дом, а ако почнува прво од нас, каков ли ќе им биде крајот на оние кои не му се покоруваат на Божјото Евангелие? "},
	{18, "18 И 'ако праведникот одвај се спасува, што ќе стане со безбожникот и грешникот?' "},
	{19, "19 Затоа и оние кои страдаат по Божја волја, да Му ги доверат своите души на верниот Создател, правејќи добро. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 Затоа старешините меѓу вас ги поттикнувам јас кој сум и самиот старешина и сведок на Христовите страдања и учесник во славата која ќе се открие: "},
	{2, "2 пасете го Божјото стадо, кое е меѓу вас и надгледувајте го, не со принуда, туку доброволно, како што Бог сака; не со желба за нечесна печалба, туку со искрено срце; "},
	{3, "3 и не како да господарите над такви кои ви се доверени, туку бидете му пример на стадото. "},
	{4, "4 А кога ќе се појави Bрховниот Пастир, ќе примите венец на слава, што не венее. "},
	{5, "5 Така и вие помладите, покорувајте им се на старешините. А сите, препашете се со понизност еден спрема друг, зашто 'Бог им се противи на горделивите, а на понизните им дава благодат.' "},
	{6, "6 И така, понизете се под моќната Божја рака, за да ве возвиши во погодно време. "},
	{7, "7 И секоја своја грижа фрлете ја на Него, зашто Тој се грижи за вас. "},
	{8, "8 Бидете со трезвен дух и бдејте: вашиот противник, ѓаволот, обиколува како лав што рика, барајќи некого да го проголта. "},
	{9, "9 Спротивете му се, цврсти во верата, знаејќи дека истите страдања им се случуваат и на вашите браќа по светот. "},
	{10, "10 А откако ќе претрпите уште малку, Бог на секоја благодат, Кој ве повика во Христос кон Својата вечна слава, Самиот ќе ве усоврши, ќе ве потврди, зајакне и утврди. "},
	{11, "11 Нека има власт во сите векови. Амин! "},
	{12, "12 По Силван, нашиот верен брат, каков што го сметам, ви го напишав ова накратко, за да ве поттикнам и да ви посведочам дека ова е вистинска Божја благодат, во која цврсто стоите. "},
	{13, "13 Поздрави ви праќа црквата од Bавилон, која е избрана заедно со вас, како и мојот син Марко. "},
	{14, "14 Поздравете се еден со друг со целив на љубов. Мир вам кои сте во Христос. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};