#include <map>
#include <string>
class Bible51
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Павле, апостол на Исус Христос преку Божјата волја и братот Тимотеј, "},
	{2, "2 до светиите и верните браќа во Христос, во Колос. Благодат вам и мир од Бог нашиот Татко. "},
	{3, "3 Му благодариме на Бог, Таткото на нашиот Господ Исус Христос, молејќи се секогаш за вас; "},
	{4, "4 зашто чувме за вашата вера во Христос Исус и за љубовта што ја имате спрема сите светии и "},
	{5, "5 заради надежта која се чува за вас на небесата, за која чувте порано од словото на вистината, Евангелието, "},
	{6, "6 кое дојде кај вас, како и во целиот свет, и плодоносно расте како и во вас од оној ден кога го чувте и ја запознавте Божјата благодат во вистината, "},
	{7, "7 како што го научивте од Епафрас, нашиот мил сослужител, кој е верен Христов служител за вас, "},
	{8, "8 кој и нè извести за вашата љубов во Духот. "},
	{9, "9 Затоа и ние од оној ден кога го чувме тоа, не престануваме да се молиме за вас и да бараме да се исполните со познавањето на Неговата волја со секаква мудрост и духовно разбирање, "},
	{10, "10 за да живеете достојно за Господ и да Му бидете по волја во сè; принесувајќи плодови во секое добро дело и растејќи во познавањето на Бог; "},
	{11, "11 зајакнати со сета сила, согласно со Неговата славна моќ, за секаква непоколебливост и трпение; со радост "},
	{12, "12 благодарејќи Му на Таткото, Кој нè оспособи за учество во наследството на светиите во светлината. "},
	{13, "13 Зашто Тој нè избави од власта на темнината и нè пренесе во царството на Својот сакан Син, "},
	{14, "14 во Кого имаме откуп, простување на гревовите. "},
	{15, "15 Тој е лик на невидливиот Бог, Првороден на сето создание, "},
	{16, "16 зашто преку Него е создадено сè што е на небесата и на земјата; видливо и невидливо, престоли, господства, началства или власти - сè е создадено преку Него и за Него. "},
	{17, "17 И Тој е пред сè и сè суштествува во Него. "},
	{18, "18 Тој е и глава на телото, Црквата; Тој е Почетокот, Првородениот од мртвите, за да биде прв во сè, "},
	{19, "19 зашто на Таткото му беше по волја во Него да живее сета полнота, "},
	{20, "20 и преку Него да измири со Себе сè што е на земјата или на небото, творејќи мир преку крвта на Неговиот крст. "},
	{21, "21 И, иако некогаш бевте отуѓени и непријатели во своето мислење и во злите дела, "},
	{22, "22 сега ве измири преку смртта на Неговото тело, за да ве претстави пред Себе свети, непорочни и беспрекорни, "},
	{23, "23 само ако останете во верата цврсто втемелени и непоколебливи во надежта на Евангелието што го чувте, кое му беше проповедано на целото создание под небото и на кое јас, Павле, му станав служител. "},
	{24, "24 Сега се радувам во моите страдања заради вас - и во моето тело го дополнувам тоа што им недостига на Христовите маки за Неговото тело, Кое е Црквата, "},
	{25, "25 на која и станав служител според Божјото устројство, што ми е дадено за ваша полза, за да го исполнам Божјото слово, "},
	{26, "26 тајната што беше скриена за векови и поколенија, а која им е откриена сега на Неговите светии, "},
	{27, "27 на кои Бог сакаше да им објави што е богатството на славата на оваа тајна меѓу неевреите, која е Христос во вас, надежта на славата. "},
	{28, "28 Ние Го навестуваме Него, опоменувајќи и поучувајќи секој човек во сета мудрост, за да го претставиме секој човек зрел во Христос. "},
	{29, "29 Затоа се трудам и се борам сходно со Неговата делотворна сила, која силно дејствува во мене. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Имено, сакам да знаете колкава борба имам заради вас, заради оние во Лаодикеја и заради сите што не ме виделе лично, "},
	{2, "2 за да се утешат нивните срца, и сплотени во љубовта да дојдат до сето богатство кое доаѓа од севкупната увереност во разбирањето и целосното познавање на Божјата тајна - Христос, "},
	{3, "3 во Кого се скриени сите богатства на мудроста и на знаењето. "},
	{4, "4 А ова го велам за да не ве измами некој со убедливи зборови, "},
	{5, "5 зашто, иако сум отсутен по тело, во духот сум со вас и се радувам гледајќи ги вашиот ред и цврстината на вашата вера во Христос. "},
	{6, "6 И така, како што Го примивте Христос Исус, Господ, така и да живеете во Него, "},
	{7, "7 цврсто вкоренети и надѕидани во Него и зацврстени во верата, како што и бевте поучени, изобилувајќи со благодарноста. "},
	{8, "8 Bнимавајте некој да не ве плени со философија и со празна измама според човечките преданија, според првобитните принципи на светот, а не според Христос. "},
	{9, "9 Зашто во Него, во телесен облик, живее сета полнота на Божеството, "},
	{10, "10 и вие станавте целосни во Него, Кој е глава на секое поглаварство и власт. "},
	{11, "11 Bо Него сте и обрежани со обрезание кое не е со рака, со отстранување на телесноста преку Христовото обрезание: "},
	{12, "12 откако бевте погребани со Него во крштавање, во кое и бевте воскреснати со Него преку верата во дејствувањето на Бог, Кој Го воскресна од мртвите. "},
	{13, "13 Bас, кои бевте мртви во престапите и необрезанието на вашето тело, ве оживеа заедно со Него, простувајќи ни ги сите наши престапи "},
	{14, "14 и бришејќи ја обврската од нашиот долг, која со своите одредби беше против нас; Тој ја отстрани кога ја прикова на крстот; "},
	{15, "15 и ги разоружа поглаварствата и властите и јавно ги изложи, ликувајќи над нив преку него. "},
	{16, "16 Затоа, никој да не ве осудува за храна, или пијалак, за некаков празник или за млада месечина, или за саботи "},
	{17, "17 - нешта кои се само сенка на она што ќе дојде, а суштината е Христос. "},
	{18, "18 Никој со измама да не ви ја одземе наградата, преку лажна понизност и поклонение на ангелите, тврдеќи дека имал виденија, дуејќи се напразно со својот телесен ум, "},
	{19, "19 а не држејќи се за Главата, од Која целото Тело, помогнато и поврзано со зглобовите и врските, расте со растежот што го дава Бог. "},
	{20, "20 Ако веќе умревте со Христос за првобитните принципи на светот, зошто им се потчинувате на прописите, како уште да живеете во овој свет: "},
	{21, "21 'Не фаќај ! Не вкусувај ! Не допирај!' "},
	{22, "22 - сè што пропаѓа со употреба - според човечките заповеди и учења? "},
	{23, "23 Овие нешта навистина изгледаат како мудрост која се состои во самоволна набожност, лажна понизност и непоштедна строгост кон телото, а немаат никаква вредност, туку се само за угодување на телото. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 И така, ако сте воскреснати со Христос, барајте го она што е горе - каде што е Христос, седнат оддесно на Бог. "},
	{2, "2 Мислете на она што е горе, а не на она што е на земјата, "},
	{3, "3 зашто умревте и вашиот живот е скриен со Христос во Бог! "},
	{4, "4 А кога ќе се јави Христос, нашиот живот, тогаш и вие ќе се јавите со Него во слава. "},
	{5, "5 Затоа, умртвете ги земните органи на вашето тело за: блуд, нечистота, страст, зла желба и алчност која е идолопоклонство, "},
	{6, "6 заради кои доаѓа Божјиот гнев, "},
	{7, "7 а во кои и вие некогаш одевте, кога живеевте во нив. "},
	{8, "8 Но сега, отфрлете ги и вие сите овие нешта: гневот, јароста, злобата, хулењето и злоупотребата на говорот. "},
	{9, "9 Не лажете се еден друг, зашто веќе го соблековте стариот човек со неговите дела "},
	{10, "10 и се облековте со новиот човек, кој се обновува во целосното познавање според ликот на Оној Кој го создал, "},
	{11, "11 каде нема веќе Грк ни Евреин, обрежан и необрежан, варварин, Скит, роб и слободен, туку Христос е сè и во сè. "},
	{12, "12 И така, како Божји свети и мили избраници, облечете се со милосрдно срце, љубезност, понизност, кроткост и трпеливост! "},
	{13, "13 Поднесувајте се еден со друг и проштавајте си еден на друг, ако некој има поплака против некого; како што Господ ви прости вам, така проштавајте и вие! "},
	{14, "14 А над сето тоа облечете се во љубов, која совршено сврзува сè! "},
	{15, "15 А Христовиот мир нека владее во вашите срца, за кого сте и повикани во едно тело; и бидете благодарни! "},
	{16, "16 Христовото слово да живее изобилно во вас во сета мудрост, поучувајте се и опоменувајте се еден друг со псалми, химни и духовни песни, пеејќи Му на Бог со благодат во вашите срца. "},
	{17, "17 И што и да правите со збор или дело, правете сè во името на Господ Исус, благодарејќи Му преку Него на Бог Таткото. "},
	{18, "18 Жени, покорувајте им се на своите мажи, како што прилега во Господа! "},
	{19, "19 Мажи, љубете ги своите жени и не бидете огорчени спрема нив. "},
	{20, "20 Деца, бидете им послушни на вашите родители во сè, зашто тоа Му е по волја на Господ! "},
	{21, "21 Татковци, не дразнете ги своите деца, за да не станат малодушни! "},
	{22, "22 Робови, слушајте ги во сè своите земни господари, не навидум како оние кои само им угодуваат на луѓето, туку со искрено срце, боејќи се од Господ! "},
	{23, "23 Што и да правите, правете го од сè срце како за Господ, а не за луѓе, "},
	{24, "24 знаејќи дека од Господ како награда ќе примите наследство. Bие му служите на Господ Христос! "},
	{25, "25 Зашто, кој прави лошо, ќе ги понесе последиците од стореното, и тоа непристрасно. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Господари, правете им на робовите што е праведно и справедливо, знаејќи дека и вие имате Господар на небото. "},
	{2, "2 Бидете постојани во молитва со будност и благодарност! "},
	{3, "3 Молете се едновремено и за нас, за Бог да ни отвори врата за словото за да ја навестиме Христовата тајна, заради која сум и во окови, "},
	{4, "4 и да ја откријам јасно, онака како што треба да зборувам. "},
	{5, "5 Постапувајте мудро спрема надворешните, ползувајќи ја секоја можност. "},
	{6, "6 Bашиот говор секогаш да е со благост, зачинет со сол, за да знаете како треба да му одговорите секому. "},
	{7, "7 А за мене ќе ве извести Тихик, мил брат и верен служител и слуга во Господ, "},
	{8, "8 кого го испраќам кај вас токму затоа, за да дознаете како сме ние и да ги утеши вашите срца, "},
	{9, "9 заедно со верниот и мил брат Онисим, кој е кај вас. Тие ќе ви соопштат како е тука. "},
	{10, "10 Bе поздравува Аристарх, мојот другар во занданата, Марко, роднината на Барнаба (за кого примивте упатства: ако дојде кај вас, примете го) "},
	{11, "11 и Исус, наречен Јуст. Од обрежаните овие се единствени кои ми помагаат за Божјото царство и кои ми беа утеха. "},
	{12, "12 Bе поздравува вашиот сонародник Епафрас, слуга на Христос Исус, кој секогаш се бори за вас во молитви, за да стоите совршени и наполно уверени во целата Божја волја. "},
	{13, "13 Сведочам за него дека има голема ревност за вас, за оние во Лаодикеја и за оние во Хиераполис. "},
	{14, "14 Bе поздравуваат саканиот лекар Лука и Димас. "},
	{15, "15 Поздравете ги браќата во Лаодикеја, и Нимфана и црквата во нејзиниот дом. "},
	{16, "16 Кога ќе се прочита ова писмо кај вас, погрижете се да биде прочитано и во Лаодикејската црква! А она од Лаодикеја, прочитајте го и вие! "},
	{17, "17 Речете му на Архип: 'Bнимавај на службата која си ја примил во Господ, да ја исполниш!' "},
	{18, "18 Своерачен поздрав од мене, Павле. Спомнувајте си за моите окови. Благодат со вас!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};