#include <map>
#include <string>
class Bible52
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Павле и Силван и Тимотеј до црквата на Солунците, во Бог, Таткото и Господ Исус Христос, благодат вам и мир. "},
	{2, "2 Секогаш кога ве спомнуваме во нашите молитви, Му благодариме на Бог за сите вас, "},
	{3, "3 зашто постојано ги спомнуваме делата на вашата вера, трудот на вашата љубов и вашата трпелива надеж во нашиот Господ Исус Христос, пред Бог нашиот Татко. "},
	{4, "4 Знаејќи, браќа од Бог сакани, дека вие сте избрани; "},
	{5, "5 зашто нашето проповедање на Евангелието меѓу вас не беше само со слово, туку и во сила, и во Светиот Дух, и во полна увереност; како што знаете какви бевме меѓу вас заради вас. "},
	{6, "6 И вие нè имавте за пример нас и Господ, примајќи го словото сред голема невола, со радоста на Светиот Дух, "},
	{7, "7 така што им станавте пример на сите верници во Македонија и Ахаја. "},
	{8, "8 Зашто, од вас Господовото слово се разгласи не само во Македонија и Ахаја, туку за вашата вера во Бог се расчу насекаде, така што нема потреба ние да зборуваме нешто. "},
	{9, "9 Имено, самите зборуваат за нас, како нè примивте и како се обративте од идолите кон Бог, за да Му служите на живиот и вистинит Бог "},
	{10, "10 и да Го очекувате Неговиот Син Исус од небесата, Кого Го воскресна од мртвите и Кој нè избавува од гневот што доаѓа. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Зашто самите знаете, браќа, дека нашето доаѓање кај вас не беше залудно. "},
	{2, "2 Напротив, иако порано пострадавме и бевме хулени во Вилипи, како што веќе знаете, бевме смели во нашиот Бог, да ви го говориме Божјото Евангелие сред големо противење. "},
	{3, "3 Зашто нашето поттикнување не е од заблуда ни од нечистотија, ниту со измама, "},
	{4, "4 туку како што Бог нè испита и ни го довери Евангелието, така зборуваме, не угодувајќи им на луѓето, туку на Бог, Кој ги испитува нашите срца. "},
	{5, "5 Зашто, како што знаете, никогаш не настапивме со ласкави зборови, ниту со притаена алчност - Бог е сведок за тоа, "},
	{6, "6 ниту, пак, баравме слава од луѓето, ниту од вас, ниту од другите, иако можевме да се наметнеме како Христови апостоли. "},
	{7, "7 Напротив, бевме благи меѓу вас, како доилка, која нежно се грижи за своите деца, "},
	{8, "8 па така, полни со љубов спрема вас сакавме да ви го предадеме не само Божјото Евангелие, туку и своите души, зашто ни станавте многу мили. "},
	{9, "9 Bпрочем, браќа, вие ги помните нашиот труд и мака, како работевме ноќе и дење за да не обремениме некој од вас, додека го проповедавме Божјото Евангелие. "},
	{10, "10 Bие сте сведоци, а и Бог, дека свето, праведно и беспрекорно се однесувавме спрема вас, верните. "},
	{11, "11 Како што знаете, ние секого од вас поединечно, како татко своите деца, го бодревме и охрабрувавме, и ви сведочевме "},
	{12, "12 да живеете достојно за Бог, Кој ве повикува во Своето Царство и слава. "},
	{13, "13 Затоа и ние постојано Му благодариме на Бог, зашто кога го примивте од нас Божјото слово, го примивте не како човечко слово, туку како Божјо слово (што всушност и е) кое и дејствува во вас кои верувате. "},
	{14, "14 Зашто, вие браќа, ги зедовте за пример Божјите цркви во Христос Исус, кои се во Јудеја, бидејќи и вие го претрпевте истото од своите сонародници, како и тие од Евреите, "},
	{15, "15 кои Го убија Господ Исус и пророците, а нас нè истераа. Тие не Му угодуваат на Бог, и непријатели им се на сите луѓе, "},
	{16, "16 и ни забрануваат да им зборуваме на неевреите, за да не се спасат, со што секогаш ја дополнуваат мерата на своите гревови. Но најпосле гневот ги стигна нив! "},
	{17, "17 А ние, браќа, кога за кратко останавме без вас, настојувавме уште повеќе - лично, а не во духот - со голем копнеж, да го видиме вашето лице, "},
	{18, "18 зашто сакавме да дојдеме кај вас - барем јас, Павле, повеќе од еднаш но сатаната нè спречи. "},
	{19, "19 Зашто, кој е нашата надеж, радост или венец за пофалба? Та не сте ли вие пред нашиот Господ Исус при Неговото доаѓање? "},
	{20, "20 Зашто вие сте нашата слава и нашата радост. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Затоа кога не можевме веќе да го издржиме тоа, сметавме дека би било добро да останеме сами во Атина, "},
	{2, "2 а Тимотеј, нашиот брат и Божји соработник во Евангелието на Христос, го испративме за да ве зацврсти и охрабри во вашата вера, "},
	{3, "3 за да не се поколеба никој поради овие маки; зашто сами знаете дека за тоа сме определени, "},
	{4, "4 зашто кога бевме кај вас, однапред ви зборувавме дека ќе трпиме маки, и како што знаете, така и се случи. "},
	{5, "5 Затоа, јас, не можејќи веќе да издржам, пратив да дознаам за вашата вера, да не би ве искушал искушувачот и да не биде залуден нашиот труд. "},
	{6, "6 А сега, откако дојде Тимотеј од кај вас и ни донесе добра вест за вашата вера и љубов, и дека имате секогаш добар спомен за нас и дека копнеете да нè видите, како и ние вас, "},
	{7, "7 тогаш, браќа, и покрај сета наша мака и невола се утешивме за вас преку вашата вера; "},
	{8, "8 зашто сега навистина живееме, кога вие стоите цврсто во Господ. "},
	{9, "9 Зашто, каква благодарност можеме да Му оддадеме на Бог за вас, за сета радост со која се зарадувавме поради вас пред нашиот Бог? "},
	{10, "10 Ноќе и дење најсесрдно се молиме да го видиме вашето лице и да го дополниме тоа што и недостига на вашата вера. "},
	{11, "11 А Самиот Бог, нашиот Татко, и Исус Христос, нашиот Господ, да го насочи нашиот пат кон вас! "},
	{12, "12 А Господ да направи вие да растете и да изобилувате во љубов еден спрема друг и спрема сите луѓе, како што и ние ја имаме спрема вас, "},
	{13, "13 за да ги утврди вашите срца да бидат непорочни во светост пред нашиот Бог и Татко, при доаѓањето на нашиот Господ Исус со сите Свои светии. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Најпосле, браќа, бараме и ве молиме во Господ Исус, така како што примивте од нас упатства како треба да живеете и да Му угодувате на Бог (како што и одите), уште повеќе да изобилувате во тоа. "},
	{2, "2 Имено, знаете какви упатства ви дадовме во името на Господ Исус. "},
	{3, "3 Зашто Божјата волја е вашето осветување: да се воздржувате од блудство, "},
	{4, "4 секој од вас да знае да го држи својот сад во светост и чест, "},
	{5, "5 не во похотна страст, како останатите народи кои не Го познаваат Бога; "},
	{6, "6 никој да не го измамува и да не го оштетува својот брат во тоа, зашто Господ е одмаздник за таквите работи, како што ви рековме и сериозно ве предупредивме. "},
	{7, "7 Имено, Бог не нè повика кон нечистотија, туку кон осветување. "},
	{8, "8 Затоа, кој го отфрла тоа, не отфрла човек, туку Бога, Кој ви Го дава и Својот Свет Дух. "},
	{9, "9 А за братољубието нема потреба да ви пишувам, зашто самиот Бог ве научи да се љубите еден со друг, "},
	{10, "10 а вие го правите тоа спрема сите браќа во цела Македонија. Но, ве молиме пак, браќа, да го правите тоа уште повеќе "},
	{11, "11 и сесрдно да настојувате да живеете мирен живот, да си ги гледате своите работи и да работите со своите раце, така како што ви заповедавме, "},
	{12, "12 за да се однесувате така како што прилега кон надворешните и да немате никаква нужда. "},
	{13, "13 Не сакаме, браќа, да останете во незнаење за починатите, за да не жалите како другите кои немаат надеж. "},
	{14, "14 Зашто ако веруваме дека Исус умре и воскресна, така и оние кои се упокоиле во Исус, Бог ќе ги земе со Него. "},
	{15, "15 Зашто ова ви го кажуваме преку Господовото слово, дека ние кои живееме и остануваме до доаѓањето на Господ, нема да отидеме пред оние кои се упокоиле; "},
	{16, "16 зашто Самиот Господ ќе слезе од небото, на заповед, со глас на архангел и со Божја труба, и мртвите во Христос ќе воскреснат први. "},
	{17, "17 Потоа ние живите кои останавме, ќе бидеме грабнати заедно со нив на облаците, за да Го сретнеме Господ во воздухот; и така засекогаш ќе бидеме со Господ. "},
	{18, "18 Затоа, утешувајте се еден друг со овие зборови. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 А за времињата и периодите, браќа, нема потреба да ви се пишува; "},
	{2, "2 зашто самите вие добро знаете дека Господовиот Ден ќе дојде како крадец во ноќ. "},
	{3, "3 Кога ќе велат: 'мир и безбедност', тогаш ненадејно ќе падне погибел врз нив, како породилни маки врз бремена жена, и не ќе можат да избегаат. "},
	{4, "4 Но вие, браќа, не сте во темнина, та Денот да ве затече како крадец, "},
	{5, "5 зашто вие сите сте синови на светлината и синови на денот и не и припаѓаме на ноќта, ниту на темнината. "},
	{6, "6 И така, да не спиеме како другите, туку да бдееме и да бидеме трезвени. "},
	{7, "7 Зашто оние кои спијат, спијат ноќе и оние кои се опиваат, ноќе се опиваат. "},
	{8, "8 А ние кои му припаѓаме на денот, да бидеме трезвени, облечени во оклопот на верата и љубовта, а како шлем, надежта на спасението, "},
	{9, "9 зашто Бог не нè определил за гнев, туку да придобиеме спасение преку нашиот Господ Исус Христос, "},
	{10, "10 Кој умре за нас за да живееме заедно со Него, било да сме будни или да спиеме. "},
	{11, "11 Затоа утешувајте се меѓусебно и надградувајте се еден друг, токму така како што и правите! "},
	{12, "12 Bе молиме, браќа, да им давате признание на оние кои вредно работат меѓу вас, кои се одговорни за вас во Господ и на оние кои ве поучуваат. "},
	{13, "13 Ценете ги над сè со љубов, заради нивното дело. Живејте во мир еден со друг. "},
	{14, "14 Bе молам уште, браќа, поучувајте ги неуредните, охрабрувајте ги малодушните, помагајте им на немоќните и бидете трпеливи со сите луѓе. "},
	{15, "15 Гледајте никој никому да не враќа зло за зло, туку секогаш барајте го доброто меѓу вас и за сите луѓе! "},
	{16, "16 Радувајте се секогаш, "},
	{17, "17 молете се постојано и "},
	{18, "18 благодарете за сè, зашто тоа е Божја волја за вас во Христос Исус! "},
	{19, "19 Не гаснете го Духот, не презирајте ги пророштвата, "},
	{20, "20 туку испитувајте сè, а држете се за доброто. "},
	{21, "21 Bоздржувајте се од секој вид на зло! "},
	{22, "22 А Самиот Бог на мирот да ве освети наполно!"},
	{23, "23 И вашиот дух, душата и телото да бидат запазени целосни и беспрекорни при доаѓањето на нашиот Господ Исус Христос! "},
	{24, "24 Bерен е Оној Кој ве повикува, Кој и ќе го стори тоа. "},
	{25, "25 Браќа, молете се за нас! "},
	{26, "26 Поздравете ги сите браќа со свет целив! "},
	{27, "27 Bе заколнувам во Господ, ова послание да им го прочитате на сите браќа. "},
	{28, "28 Благодатта на нашиот Господ Исус Христос да биде со вас! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};