#include <map>
#include <string>
class Bible34
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Пророштвото за Ниневија; книга за видението на Наума од Елкос."},
	{2, "2 Господ е Бог ревнив и одмаздник е Господ и страшен во Својот гнев: Господ им се одмаздува на непријателите Свои; не ги поштедува ни противниците Свои."},
	{3, "3 Господ е долготрпелив и голема е силата Негова, така што не остава никого без казна; патот Господов е во виор и бура, а облаците се прав од под нозете Негови."},
	{4, "4 Kе му се закани ли на морето, и тоа пресушува, и сите реки пресушуваат: овенува Васан и Кармил, и свенува цветот на Ливан."},
	{5, "5 Горите се тресат пред Него, и ридовите се топат, земјата потреперува пред лицето Негово, и вселената и се што живее во неа."},
	{6, "6 Кој може да устои против Него? И кој може да го издржи пламенот од гневот Негов? Гневот Негов се излива како оган; карпи се распа аат пред Него."},
	{7, "7 Добар е Господ; Он е прибежиште во жалосен ден. Он ги познава оние, што се надеваат на Него."},
	{8, "8 Но со силна поплава, што се потопува, ке ја уништи Ниневија до темели и мрак ке ги обземе непријателите Негови."},
	{9, "9 Што сте намислиле против Господа? Он ке стави крај на се, и неволите веке нема да се повторат,"},
	{10, "10 зашто, иако сплетени како трње и како од вино пијани, тие ке бидат наполно проголтани, како сува слама."},
	{11, "11 Од тебе произлезе оној, што смисли зло против Господа, и кој подготви нечесен заговор."},
	{12, "12 Вака вели Господ: 'Макар што се безопасни и многубројни, тие ке бидат исклани и ке исчезнат; а тебе, иако те измачував, нема веке да те измачувам."},
	{13, "13 И сега ке го скршам јаремот негов, кој лежи врз тебе, и ке ги раскинам оковите твои."},
	{14, "14 А за тебе, Асире, Гсопод определи: нема да продолжи родот твој; од домот на твојот бог ке ги истребам идолите резани и лиени; во него ке ти направам гроб кога ке бидеш презрен."},
	{15, "15 Ете, по горите се стапките на благовесникот, кој најавува мир: празнувај ги, Јудејо, твоите празници, извршувај ги заветите свои, зашто преку тебе нема веке да минува нечестивиот; тој е наполно уништен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Се крева против тебе уништувач: пази ги тврдините, чувај го патот, зацврсти ги бедрата, собирај сили."},
	{2, "2 Зашто Господ ке го воспостави величието на Јакова, како величието на Израилот, оти пакосници ги запустија и лозјата им ги сотреа."},
	{3, "3 Штитот на неговите јунаци е црвен: војниците негови носат црвени облеки; колите бојни ке фрлаат оган во денот на борбата и гора од копја ке се лулее."},
	{4, "4 Колите ке траскаат по улиците и ке се судираат една со друга, ке изгледаат како запалени факели, и ке светкаат како молњи."},
	{5, "5 Тој ке ги повикува јунаците свои, но тие ке бидат бавни во одот, ке побрзаат кон sидовите на градот, но опсадата е веке подготвена."},
	{6, "6 Вратите од реките ке се отворат и дворот ке се урне."},
	{7, "7 Решено е: таа ке биде оголена и во плен одведена, а слугинките нејзини ке стенкаат како гулаби, удирајки се в гради."},
	{8, "8 Ниневија, откако беше основана, беше како водобран полн со вода, а тие бегаат. 'Стојте, стојте!'. Но никој не се свртува да погледа."},
	{9, "9 Грабајте сребро, грабајте злато; нема крај на натарупаните скапоцени работи."},
	{10, "10 Ограбена, опустошена и разурната е таа - срцето се топи, колената треперат; сите чувствуваат болки во бедрата, а лицата им се потемнети."},
	{11, "11 Каде е лавот што грабаше за да им носи на лавчињата и им даваше на лавиците, полнејки ги со плен пештерите свои и леглата свои со грабеж?"},
	{12, "12 Каде е сега леглото на лавовите и пасиштата на лавчињата, каде што одеа лав, лавица и лавче, и никој не ги плашеше?"},
	{13, "13 Ете, Јас сум против тебе, вели Господ Саваот, и ке ги претворам во дим твоите бојни коли, и меч ке ги исече лавчињата твои, и ке го истребам од земјата грабежот твој; повеке нема да се чуе гласот на твоите пратеници."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Тешко му на крвничкиот град! Тој е полн со измама и убиства; грабењето не престанува во него."},
	{2, "2 Се слуша плускање на бичеви и трескот од тркала како и од потскокнување на бојни коли."},
	{3, "3 Коњаниците потскокнуваат, болскаат мечеви и светкаат копја. Многу убиени и купишта трупови! На труповите им нема крај; и се сопнуваат од нив."},
	{4, "4 Тоа сето е за многуте блудствувања на убавата на изглед развратница, вешта во магии, која со блудот свој продава народи, а со магиите - племиња."},
	{5, "5 Ете, Јас сум против тебе, вели Господ Саваот, ке ја кренам полата од твојата облека врз твоето лице и ке им ја покажам на народите твојата голотија, и на царствата - срамотиите твои."},
	{6, "6 Kе нафрлам врз тебе нечистотии, ке те направам презрена, и ке те направам за приказ."},
	{7, "7 И секој, штом ке те види, ке побегне од тебе и ке рече: 'Разурната е Ниневија! Кој ке сака да ја пожали? Каде да најдам утешител за тебе?'"},
	{8, "8 Зар не си подобра од Но - Амона, кој лежи ме у реки, опколен со вода, чиј окоп е морето, и тоа му служеше како sид."},
	{9, "9 Етиопија и Египет со безбројно множество лу е ти служеа како поткрепа; а тие ти идеа на помош со Коптите и Ливијците."},
	{10, "10 Но и тој е раселен, отиде во ропство; дури и децата му се здробени - по сите градски крстосници; а за првенците му фрлија жреб, и сите големци се во вериги оковани."},
	{11, "11 И ти така ке се опиеш и ке криеш; и ке бараш заклон од непријателите свои."},
	{12, "12 Сите твои градови се како смокви со зрели плодови: ако ги затресеш, ке паднат право во устата на оној што сака да ги јаде."},
	{13, "13 Ете, и народот твој во тебе се како жени: на непријателите твои ширум ке им се отворат портите на земјата, и оган ке ги проголта твоите резиња."},
	{14, "14 Зафати си вода за опсадата; зацврсти ги тврдините; влези во кал, гази глина, направи ја печката за печење тули."},
	{15, "15 Таму оган ке те проголта, меч ке те исече, ке те изеде како гасеница, макар и да сте се намножиле како гасеници, па и да сте се намножиле како скакулци."},
	{16, "16 Трговците при тебе се повеке од sвездите на небото; но тие како скакулците ке се распрскаат и ке одлетаат."},
	{17, "17 И кнезовите твои се како скакулци, а војводите - како рој мушички, кои во студено време се гнездат во пукнатини, а кога ке изгрее сонцето се разлетуваат, и нема да го распознаеш местото каде биле."},
	{18, "18 Спијат твоите пастири, царе асирски, почиваат твоите големци; твојот народ се распрснал по горите, и нема кој да ги прибере."},
	{19, "19 Нема лек за твојата рана, лута е раната твоја. Сите, што ке чујат за тебе, ке ракоплескаат, зашто врз кого ли не си ја протегнал твојата постојана злоба."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};