#include <map>
#include <string>
class Bible8
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Во она време, кога управуваа судиите, настана глад во земјата. И еден човек од Витлеем Јудејски отиде да живее во Моавските полиња, заедно со жена си и двајцата синови свои."},
	{2, "2 Името на тој човек му беше Елимелех, името на жена му - Ноемина, а двајцата синови негови се викаа Малон и Хелеон: тие беа од Еуфрат, од Витлеем Јудејски. И дојдоа во Моавските полиња и останаа таму."},
	{3, "3 Елимелех, мажот на Ноемина, умре, и таа остана со двајцата синови свои."},
	{4, "4 Тие си зедоа за жени Моавки, - на едната името и беше Орфа, а на другата - Рут; и живееја таму околу десет години."},
	{5, "5 Но подоцна и обајцата синови нејзини, Малон и Хелеон, умреа, и остана таа жена без двајцата синови свои и без мажот свој."},
	{6, "6 Тогаш таа се крена со снаите свои и се врати од Моавските полиња, бидејки беше чула во Моавските полиња дека Бог го посетил Својот народ и му дал леб."},
	{7, "7 И таа тргна од она место, каде што живееше, и двете снаи нејзини со неа. Кога одеа по патот, вракајки се во Јудејската земја,"},
	{8, "8 Ноемин им рече на двете свои снаи: 'Одете и вратете се секоја во татковата си кука; Господ нека ви направи милост, според тоа како постапувавте со покојните и со мене!"},
	{9, "9 Нека ви даде Господ да најдете прибежиште секоја во куката на својот маж!' И ги бакна. Но тие повикаа, и заплакаа, па"},
	{10, "10 и рекоа: 'Не, ние ке се вратиме со тебе при твојот народ.'"},
	{11, "11 А Ноемин рече: 'Вратете се, керки мои; зошто ке доа ате со мене? Зар уште имам во утробата своја синови, кои би ви станале мажи?"},
	{12, "12 Вратете се, керки мои, одете си, бидејки сум веке стара и не можам да се омажам; па и да речев: ‘уште имам надеж‘, и дури оваа нок да се омажам и подоцна да родам синови,"},
	{13, "13 ке можете ли да чекате, додека да пораснат? Можете ли да се одржите да не се омажите? Не, керки мои, многу ми е жал за вас, зашто раката Господова ме порази.'"},
	{14, "14 Тие повикаа и пак заплакаа. И Орфа се прости со свекрвата своја и се врати при родот свој, а Рут остана со неа."},
	{15, "15 Ноемина и рече на Рут: 'Ете, јатрвата ти се врати при родот свој и при боговите свои; врати се и ти по јатрвата своја.'"},
	{16, "16 Но Рут одговори: 'Не ме принудувај да те оставам и да се одделам од тебе; но каде што ке одиш ти, таму ке дојдам и јас, и каде ке живееш ти, таму ке живем и јас; твојот народ ке биде мој народ, и твојот Бог - мој Бог;"},
	{17, "17 и каде што ке умреш ти, таму и јас ке умрам и ке бидам погребана; 'Господ нека ми го направи тоа и нешто повеше нека додаде; само смртта ке ме раздели од тебе.'"},
	{18, "18 Ноемина, откако виде дека таа цврсто е решена да отиде со неа, престана да и зборува."},
	{19, "19 И одеа тие двете, додека стигнаа до Витлеем, целиот град се раздвижи поради нив, и рекоа: ‘Ова ли е Ноемина?‘"},
	{20, "20 Таа им рече: 'Не ме викајте Ноемина, викајте ме Мара, зашто Седржителот ми испрати голема Горчевина."},
	{21, "21 Јас излегов одовде заможна, а Господ ме врати со празни раце: зошто да ме викате Ноемин, кога Господ ме принуди да страдам, и Седржителот ми испрати несрека?'"},
	{22, "22 И Ноемина се врати, а заедно со неа и снаата нејзина, Моавката Рут, кој дојде од Моавските полиња; тие пристигнаа во Витлеем, кога беше почнала јачменовата жетва."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Ноемин имаше роднина по мажот, човек многу виден, од племето на Елимелех, по име Воз."},
	{2, "2 И Моавката Рут и рече на Ноемина: 'Kе тргнам по нивјата и ке собирам класје по оној во чии очи ке најдам наклоност (љубов).' Таа и одговори: 'Оди керко.'"},
	{3, "3 Таа отиде и почна да бере на една нива класје по жетварите. И се покажа дека таа нива му припа а на Воз, којшто беше од племето Елимелехово."},
	{4, "4 И ете, Воз дојде од Витлеем и им рече на жетварите: 'Господ со вас.' Тие му одговорија: 'Нека те благослови Господ!'"},
	{5, "5 И Воз го запраша слугата свој, надгледувачот на жетварите: 'Чија е онаа млада жена?'"},
	{6, "6 Слугата, надзорникот над жетварите, одговори и рече: 'Таа млада жена е Моавка, дошла со Ноемина од Моавските полиња;"},
	{7, "7 таа ни рече: ‘Оставете ме да берам и да собирам ме у снопјата по жетварите‘; дојде и остана тука од утрината до сега; таа малку останува дома.'"},
	{8, "8 И Воз и рече на Рут: 'Слушај, керко моја, не оди да собираш на друга нива и не си оди оттука, туку остани со моите слугинки;"},
	{9, "9 гледај на која нива тие жнеат, и оди со нив; ете јас им заповедав на слугите свои да не ти пречат; кога ке ожедниш, оди кај садовите и пиј, од каде што црпат слугите мои.'"},
	{10, "10 Таа падна ничкум, се поклони до земја и му рече: 'Со што се здобив пред очите твои со милост, па ме примаш, иако сум ту инка?'"},
	{11, "11 Воз и одговори и и рече: 'Ми рекоа за се што си направила за свекрвата своја по смртта на мажот твој, дека си оставила татко, мајка и татковина и си дошла ме у народ кој не си го познавала до вчера и завчера;"},
	{12, "12 Господ нека ти возврати за твоето дело, и да добиеш полна награда од Господа, Бог Израилев, при Кого си дошла, за да се успокоиш под Неговите криља!'"},
	{13, "13 Таа одговори: 'Можеби ке најдам милост пред очите твои, господару мој! Ти ме утеши и и зборуваше од срцето на робинката своја, макар и да не вредам ни колку една слугинка твоја.'"},
	{14, "14 И и рече Воз: 'Кога ке приближи времето за јадење, дојди тука и јади леб и топи го залакот свој во оцет.' И таа седна при жетварите. Тој и даде леб; таа јадеше, се најаде, и уште и остана."},
	{15, "15 И стана да собира класје. Воз им заповеда на слугите и рече: 'Нека собира и ме у снопјата, и не ја навредувајте;"},
	{16, "16 дури и од снопјата потфрлувајте и оставајте; нека собира и немојте да ја прекорувате.'"},
	{17, "17 Така собираше таа на нивата до вечерта и го исчука собраното и тоа даде близу една ефа јачман."},
	{18, "18 Откако го зеде тоа, отиде во градот, и свекрва и виде, колку беше собрала таа. И го извади Рут од пазувите свои и и го даде она, што и беше останало, откако се беше најала."},
	{19, "19 И и рече свекрвата: 'Каде береше денес и каде работеше? Да биде благословен оној, што те примил!' Рут и кажа на свекрвата своја, кај кого работела, и рече: 'Човекот, кај кого денес работев, се вика Воз.'"},
	{20, "20 И и рече Ноемин на снаата своја: 'Нека е благословен од Господа, поради тоа што не ги лиши од милоста своја ниту живите, ниту умрените!' И и рече Ноемин: 'Тој човек ни е близок; тој е наш роднина.'"},
	{21, "21 Моавката Рут и кажа на свекрвата своја: 'Тој дури ми рече - остани при слугинките мои, додека да ја завршат жетвата моја.'"},
	{22, "22 И и рече Номин на снаата Рут: 'Добро е, керко, тоа што си одела со слугинките негови, и нема да те оскрбуваа на друга нива.'"},
	{23, "23 Така се приклучи таа кон Возовите слугинки и береше класје, додека заврши јачменовата жетва и пченичната жетва, и живееше при свекрвата своја."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 И и рече Ноемина, свекрвата нејзина: 'Kерко, нели бива да живееш подобро!"},
	{2, "2 Ете, Воз, со чии слугинки беше ти, е наш роднина, оваа нок тој го вее јачменот на гумното;"},
	{3, "3 затоа изми се, намачкај се, промени се и оди на гумното, но не му се покажувај, додека заврши со јадењето и пиењето;"},
	{4, "4 а кога ке легна да спие, дознај го местото, каде ке легне; тогаш оди, откри го откај нозете негови и легни; тој ке ти каже што да правиш.'"},
	{5, "5 Рут и рече: 'Kе направам се што ми кажа.'"},
	{6, "6 И отиде на гумното и направи се онака, како што и порача свекрвата нејзина."},
	{7, "7 Воз се најаде и се напи, и го развесели срцето свое, и отиде, па легна да спие до стогот. И таа отиде полека, го откри од кај незоте негови и легна."},
	{8, "8 На полнок тој се тргна, се обsрна, а тоа при нозете негови лежи жена."},
	{9, "9 И и рече Воз: 'Која си ти?' Таа одговори: 'Јас сум Рут, твоја робинка, рашири го крилото свое над својата робинка, зашто си ми роднина.'"},
	{10, "10 Воз и рече: 'Благословена да си од Господа, керко! Таа своја поледна милост ти ја изврши подобро од првата, кога не отиде да бараш момци, бедни или богати;"},
	{11, "11 затоа не плаши се, керко! Јас ке направам за тебе се, што кажа ти; оти при секоја порта кај мојот народ знаат, дека ти се чесна жена;"},
	{12, "12 иако е точно, дека сум ти роднина, но има друг роднина, поблизок од мене;"},
	{13, "13 нокевај таа нок; а утре, ако тој те земе, добро, нека те земе, ако, пак, не те земе, јас ке те земам; жив е Господ! Спи до утре!'"},
	{14, "14 И преспа таа при нозете негови до утрината и стана, пред да можат да се распознаа еден со друг, зашто Воз рече да не се знае дека доа ала жена на гумното."},
	{15, "15 И и рече: 'Дај ја наметката што е на тебе, подржи ја.' Таа ја држеше, и тој и измери шест мери јачмен, ја натовари и си отиде во градот."},
	{16, "16 А Рут дојде кај свекрва и. Таа ја запраша: 'Што направи, керко?' Таа и раскажа се, што беше направил оној човек за неа."},
	{17, "17 Таа рече: 'Тој ми ги даде овие шест мери јачмен и ми рече: 'Не оди со празни раце при свекрвата своја!'"},
	{18, "18 Таа и рече: 'Почекај, керко, додека да дознаеше, како ке се сврши работата; зашто тој човек нема да се успокои, додека не ја сврши денас таа работа.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Воз излезе пред градските порти и таму седна. И ете, минува оној роднина, за кого говореше Воз. И му рече: 'Наврати и седни тука!' Тој наврати и седна."},
	{2, "2 Воз повика десетина од граските старешини и рече: 'Седнете тука!' И тие седнаа."},
	{3, "3 И Воз му рече на роднината: 'Ноемин, која што се врати од моавските полиња, го продава делот од нивата, која му припа а на братот наш Елимелех;"},
	{4, "4 јас решив да ти јавам и да ти кажам: 'Купи го пред седнативе тука и пред старешините на мојот народ ако сакаш да го откупиш, откупи го; ако, пак, не решиш да го откупиш, кажи ми, за да знам, зашто, освен тебе, нема кој да го откупи, а по тебе сум јас.' Тој одговори: 'Јас ке го откупам.'"},
	{5, "5 Воз рече: 'Штом ја откупуваш нивата од Ноемин, треба да купиш и од Моавката Рут, жена на умрениот, и неа треба да ја земеш, за да го востановиш името на умрениот во наследството негово.'"},
	{6, "6 А оној роднина одговори: 'Јас не можам да ја откупам, за да не си го растурам моето наследство; земја ја ти, зашто јас не можам да ја земам.'"},
	{7, "7 Порано кај Израилот, кога се откупуваше и разменуваше нешто, заради потврдување постоеше обичај: едниот ја собуваше обувката своја и му ја даваше на другиот, кој го примаше правото на родство, и тоа служеше како сведоштво кај Израилот."},
	{8, "8 И оној роднина му рече на Воз: 'Откупи го ти!' И ја собу обувката своја, и му ја даде."},
	{9, "9 И Воз им кажа на старешините и на целиот народ: 'Вие сте сега сведоци, дека јас го купувам од Ноемин сето Елимелехово и сето Хелеоново и Малоново наследство;"},
	{10, "10 исто така ја земам за жена и Моавката Рут, Малоновата жена, за да го востановам името на умрениот во делот негов, та да не исчезне името на умрениот ме у браката негови и племето негово; вие сте ми денес сведоци за тоа.'"},
	{11, "11 И сиот народ, што беше при градските порти, и старешините рекоа: 'Ние сме сведоци. Нека даде Господ, жената, која влегува во куката твоја, да биде како Рахил и Лија, кои и обете го издигнаа домот Израилев; збогатувај се во Еуфрат, и нека се слави името твое во Витлеем;"},
	{12, "12 и домот твој да биде како домот на Фареса, кого Тамар му го роди на Јуда од семето, кое Господ ке ти го даде од таа млада жена.'"},
	{13, "13 И Воз ја зеде Рут, и таа му стана жена. И тој влезе при неа, и Господ и даде, та зачна и роди син."},
	{14, "14 И и велеа жените на Ноемин: 'Нека е благословен Господ, зашто не те остави денес без наследник! И нека биде славно името негово во Израилот."},
	{15, "15 Тој ке ти биде утеха и прехрана во старите денови твои, зашто е рожба на снаата твоја, која те сака и кој ти вреди повеке од седум синови.'"},
	{16, "16 И Ноемин го зеде детето и го носеше во прегратките свои и му беше негувателка."},
	{17, "17 Сосетките му дадоа име, велејки: 'На Ноемин и се роди син', и го нарекоа Овид. Тој е татко на Јесеја, таткото Давидов."},
	{18, "18 И еве го родот Фаресов: Фарес го роди Есрома;"},
	{19, "19 Есром го роди Арама; Арам го роди Аминадава;"},
	{20, "20 Аминадав го роди Наасона; Наасон го роди Салмона;"},
	{21, "21 Салмон го роди Воза; Воз го роди Овида;"},
	{22, "22 Овид го роди Јесеја; Јесеј го роди Давида."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};