#include <map>
#include <string>
class Bible56
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Павле, Божји слуга и апостол на Исус Христос, според верата на оние кои се избрани од Бог и познавањето на вистината која е според побожноста, "},
	{2, "2 со надеж за вечен живот што пред вечни времиња го вети Бог, Кој не може да лаже, "},
	{3, "3 а во свое време го објави Своето Слово преку навестувањето, што ми е доверено мене според заповедта на Бог, нашиот Спасител - до Тит, моето вистинско чедо по заедничката вера: "},
	{4, "4 благодат, милост и мир од Бог Таткото и Господ Исус Христос, нашиот Спасител. "},
	{5, "5 Затоа те оставив на Крит, за да го средиш недовршеното и за да поставиш старешини по сите градови, како што ти наложив: "},
	{6, "6 ако некој е непорочен, маж на една жена, ако има деца кои веруваат, кои не се обвинети заради разузданост или непокорност; "},
	{7, "7 зашто надзорникот како Божји управител треба да биде непорочен, не самоволен, не гневлив, не пијаница, не тепач, не алчен за нечиста добивка, "},
	{8, "8 туку гостољубив, љубител на доброто, разумен, праведен, свет, воздржлив, "},
	{9, "9 кој се држи цврсто за веродостојното слово, кое е сходно со учењето, за да може и да поттикнува во здравото учење и да ги изобличува оние кои се противат. "},
	{10, "10 Имено, има многу непокорни луѓе, празноречиви и измамници, особено од обрежаните, "},
	{11, "11 на кои треба да им се затвори устата, зашто тие заради нечиста печалба растураат цели семејства, поучувајќи го она што не треба. "},
	{12, "12 Еден од нив, нивни сопствен пророк, рече: 'Криќаните секогаш се лажливци, зли ѕверови и мрзливи лапачи!' "},
	{13, "13 Ова сведоштво е вистинито. Затоа искарај ги строго, за да бидат здрави во верата, "},
	{14, "14 за да не им обрнуваат внимание на еврејските сказни и заповедите на луѓето кои ја изопачуваат вистината. "},
	{15, "15 За чистите сè е чисто; а за оние кои се осквернети и кои не веруваат, ништо не е чисто, туку осквернети им се и разумот и совеста. "},
	{16, "16 Исповедаат дека Го познаваат Бог, но Го одрекуваат со делата, и се одвратни, непослушни и неподобни за какво да било добро дело. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 А ти говори за она што се совпаѓа со здравата наука. "},
	{2, "2 Постарите мажи да бидат трезвени, сериозни, разумни, здрави во верата, во љубовта и во трпението. "},
	{3, "3 Исто така, постарите жени да се однесуваат достојно, да не клеветат и да не се оддаваат на многу вино, туку да бидат учителки за доброто, "},
	{4, "4 за да ги учат младите жени да ги љубат своите мажи и своите деца, "},
	{5, "5 да бидат разумни, чисти, вредни домаќинки, љубезни и покорни на своите мажи, за да не се хули Божјото слово. "},
	{6, "6 Исто така, опоменувај ги и младите да бидат разумни. "},
	{7, "7 Bо сè покажи се како пример за добри дела, во чистота на учењето, сериозност, "},
	{8, "8 со здрав и беспрекорен говор, за да се засрами секој противник, немајќи што да каже лошо за нас. "},
	{9, "9 Робовите нека им се покоруваат во сè на своите господари, да настојуваат да им угодуваат, да не им противречат "},
	{10, "10 и да не поткрадуваат, туку да ја покажат својата добра вера, та да го украсуваат во секој поглед учењето на Бог нашиот Спасител. "},
	{11, "11 Зашто се јави Божјата благодат, која носи спасение за сите луѓе, "},
	{12, "12 која нè поучува да се откажеме од безбожноста и од световни похоти; да живееме разумно, праведно и побожно во сегашниов век, "},
	{13, "13 очекувајќи ја блажената надеж и јавувањето на славата на нашиот велик Бог и Спасител, Исус Христос, "},
	{14, "14 Кој се даде Себеси за нас, за да нè избави од секакво беззаконие и да си исчисти за Себе сопствен народ, ревносен за добри дела. "},
	{15, "15 Зборувај го ова, и опоменувај, и укорувај со целосна власт. Никој да не те презира! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Напомнувај им да им се покоруваат на управителите и властите, да бидат покорни и подготвени за секое добро дело; "},
	{2, "2 никого да не хулат, да бидат благородни, да не се препираат, покажувајќи секаква кроткост кон сите луѓе. "},
	{3, "3 Зашто и ние бевме некогаш неразумни, непокорни, измамени, робови на разни страсти и задоволства, минувајќи го животот во злоба и завист, исполнети со омраза и мразејќи се еден со друг. "},
	{4, "4 Но кога се појави добрината на Бог, нашиот Спасител, и Неговата љубов за целото човештво, "},
	{5, "5 нè спаси не врз основа на праведните дела што сме ги направиле ние, туку по Својата милост, преку капењето на новораѓањето и обновувањето преку Светиот Дух, "},
	{6, "6 Кого богато Го излеа на нас преку Исус Христос, нашиот Спасител, "},
	{7, "7 та оправдани преку Неговата благодат, да станеме наследници според надежта на вечниот живот. "},
	{8, "8 Ова е веродостојно слово, и сакам ова да го говориш со увереност, та оние што поверувале во Бог да се стремат да вршат добри дела. Тоа е добро и полезно за луѓето. "},
	{9, "9 А избегнувај ги глупавите распрашувања, родословијата, расправиите и препирките во однос на Законот, зашто се неполезни и безвредни. "},
	{10, "10 Избегнувај човек еретик, по првото и второто предупредување, "},
	{11, "11 знаејќи дека таквиот човек се изопачил и дека греши, и се осудил самиот себеси. "},
	{12, "12 Кога ќе го пратам кај тебе Артема или Тихик, настојувај да дојдеш кај мене во Никопол, зашто решив зимата да ја поминам таму! "},
	{13, "13 Грижливо снабди ги за пат законикот Зена и Аполос, за да имаат сè што им треба! "},
	{14, "14 И нашите нека се учат да се зафаќаат со добри дела, за да ги задоволат неопходните потреби, за да не бидат бесплодни. "},
	{15, "15 Те поздравуваат сите што се со мене. Поздрави ги оние кои нè љубат во верата. Благодат со сите вас!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};