#include <map>
#include <string>
class Bible38
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
	struct mk6	{ int val; const char *msg; };
	struct mk7	{ int val; const char *msg; };
	struct mk8	{ int val; const char *msg; };
	struct mk9	{ int val; const char *msg; };
	struct mk10	{ int val; const char *msg; };
	struct mk11	{ int val; const char *msg; };
	struct mk12	{ int val; const char *msg; };
	struct mk13	{ int val; const char *msg; };
	struct mk14	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 На осмиот ден, во втората година на Дарија, би слово Господово до пророкот Захарија, синот Варахиев, син Адов, велејки:"},
	{2, "2 'Се разгневи Господ на татковците ваши со голем гнев;"},
	{3, "3 затоа кажи им - 'вака вели Господ Саваот - 'обрнете се кон Мене,' - вели Господ Саваот - 'и јас ке се обрнам кон вас."},
	{4, "4 Не бидете како што беа татковците ваши, кон кои викаа поранешните пророци, велејки им - 'вака вели Господ Саваот - , одвратете се од лошите работи свои!' Но тие не послушаа, ниту внимаваа на Мене', вели Господ."},
	{5, "5 Каде се татковците ваши, па и пророците можат ли да живеат вечно?"},
	{6, "6 Но зборовите Мои и наредбите Мои, што им ги заповедав на слугите Мои, пророците, зар не ги постигнаа татковците ваши? И тие се обракаа и велеа: како што беше определил Господ Саваот да постапи со нас според патиштата наши, и според делата наши, така и постапи.'"},
	{7, "7 На дваесет и четвртиот ден од единаесеттиот месец - а тоа е месецот Шеват - во втората година на Дарија, би слово Господово до пророкот Захариј, синот Варахиев, син Адов:"},
	{8, "8 Во текот на ноката видов - ете, еден маж на црвен коњ стои ме у мирти, што беа во долот, а зад него црвени, сиви и бели коњи,"},
	{9, "9 па му реков - кои се овие, господине мој? А ангелот, кој зборуваше со мене, ми рече: ‘јас ке ти покажам кои се тие."},
	{10, "10 И одговори мажот што стоеше ме у миртите, и рече - ‘тоа се оние кои Господ ги испратил да ја обиколуваат земјата.‘"},
	{11, "11 Тогаш тие му одговорија на ангелот Господен, кој стоеше ме у миртите, па му рекоа - ‘ете, ја обиколивме целата населена земја и таа е спокојна.‘"},
	{12, "12 Им одговори ангелот Господен и им рече: 'Господи Седржителу, до кога нема да се смилуваш над Ерусалим и над градовите Јудини, на кои се гневиш, еве, веке седумдесет години?'"},
	{13, "13 Тогаш во одговори на ангелот Господен, изрече Господ слова добри, слова утешни."},
	{14, "14 И им рече ангелот, кој зборуваше со мене: - извести и кажи - вака вели Господ Саваот - ‘ревнувам за Ерусалим и за Сион многу;"},
	{15, "15 и негодувам со големо негодување против народите што живеат во спокој, оти Јас малку се разгневив, тие го засилаја злото.'"},
	{16, "16 Затоа вака вели Господ: ‘Јас се обрнувам кон Ерусалим со милосрдност; во него ке се изгради Мојот дом, вели Господ Саваот, и земномерно јаже ке се протегне низ Ерусалим."},
	{17, "17 Извести го уште и за ова, и кажи - вака вели Господ Саваот: ‘Моите градови одново ке се исполнат со богатства, и Господ ке го утеши Сион и пак ке го избере Ерусалим."},
	{18, "18 Ги подигнав очите, а тоа, ете, четири рога."},
	{19, "19 И му реков на Ангелот, кој зборуваше со мене: што е ова? А тој ми одговори: ‘тоа се роговите што ги распрснаа Јуда, Израилот и Ерусалим."},
	{20, "20 Потоа Господ ми покажа четири дрводелци."},
	{21, "21 Пак реков: што ке прават овие? А тој ми рече: оние рогови се што го распрснаа Јуда, така што никој од нив не може да си ја подигне главата; и, ете, тие дојдоа да ги уплашат, да им ги скршат роговите на народите, кои подигнаат рог против земјата на Јуда за да ја распрснат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 И пак ги подигнав очите и видов: и, ете, еден маж, кој во раката имаше мерно јаже."},
	{2, "2 Го прашав каде ке одиш? Тој ми рече: одам да го измерам Ерусалим, за да видам колкава му е ширината и колкава му е должината."},
	{3, "3 Тогаш ангелот, што зборуваше со мене, излезе, а друг ангел му дојде во пресрет,"},
	{4, "4 и тој му рече на оној: Побрзај и кажи му на оној млад човек - Ерусалим ке се насели по селата поради многуте лу е и добиток во него."},
	{5, "5 И Јас ке му бидам огнен sид, околу него, вели Господ, и ке се прославам во него."},
	{6, "6 Еј, еј! Бегајте од северната земја, вели Господ, зашто Јас ке ве соберам од четирите ветра небески, вели Господ."},
	{7, "7 Спасувај се Сионе, ти што живееш при керката Вавилонова."},
	{8, "8 Зашто така вели Господ Седржителот, Кој ме прати за слава при народите, што ве плачкосуваа: зашто кој ке се допре до вас, ке се допре до зеницата на окото Мое."},
	{9, "9 И, ете, Јас ке ја кренам раката Своја против нив, и тие ке станат плен на слугите свои.' Тогаш ке познаете дека Господ Саваот ме пратил."},
	{10, "10 'Ликувај и весели се, керко Сионова, зашто ете, Јас ке дојдам и ке се населам во тебе', вели Господ."},
	{11, "11 И ке се приберат многу народи при Господа во оној ден и ке станат Негов народ. И Он ке се насели ме у тебе, и тогаш ке разбереш дека Господ Саваот ме пратил при тебе."},
	{12, "12 Тогаш Господ ке го земе во владение Јуда, Својот дел на светата земја, и пак ке го избере Ерусалим."},
	{13, "13 Нека молчи секоја плот пред лицето на Господа, зашто Он стана во облаците од Своето свето живеалиште."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Потоа ми го покажа тој Исуса, Големиот архиереј, Кој стоеше пред ангелот Господен, и сатаната, кој стоеше од Неговата десна страна, за да Му се противставува."},
	{2, "2 И му рече Господ на сатаната: 'Господ да те укори, Господ да ти забрани, Оној Кој го избра Ерусалим. Зар не е Он гламја истргната од оган?'"},
	{3, "3 А Исус беше облечен во извалкана облека и стоеше пред ангелот,"},
	{4, "4 кој им одговараше и на оние што стоеја пред него, и им рече: 'Соблечете ја од него извалканата облека; и нему лично: ете, ја отфрлив од тебе вината твоја и те облекувам во торжествена облека.'"},
	{5, "5 Потоа рече: 'Ставете Му на главата чист кидар и - Му ставија на главата чист кидар и го облекоа во торжествена облека. А ангелот Господен стоеше."},
	{6, "6 И ангелот Господен, сведочејки, му рече на Исуса:"},
	{7, "7 вака вели Господ Саваот: 'Ако одиш по патиштата Мои и ако бидеш Моја стража, ке му судиш на Мојот дом и ке ги вардиш дворовите Мои. И Јас ке ти дозволам да одиш ме у тие лу е што стојат овде."},
	{8, "8 Но, послушај, Исусе, голем архиереју, ти и браката твои, што се пред твоето лице, оти тие лу е се познати. Еве, Јас ке го доведам Својот слуга - Зачетникот."},
	{9, "9 Оти, ете, тој е каменот што го поставуавам пред Исуса, на тој единствен камен има седум очи; ете, Јас ке го изделкам на него ликот негов, вели Господ Саваот, и ке го простам гревот на оваа земја во еден ден.'"},
	{10, "10 Во тој ден, вели Господ Саваот, ке се поканувате еден со друг под лозата и под смоквата."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 И се врати оној ангел, кој зборуваше со мене, и ме разбуди, како што се разбудува човек од сон."},
	{2, "2 Па ми рече: што гледаш? Одговорив: еве, гледам свекник цел од злато и чашка за елеј врз него, а и седум кандилца на него и по седум чашенца за кандилцата, при врвот."},
	{3, "3 И две маслинки на него - една десно од чашката, а друга лево од неа."},
	{4, "4 Одговорив и му рекова на анеглот, кој говореше со мене - што претставува ова, господине?"},
	{5, "5 И ангелот, што зборуваше со мене, одговори и ми рече: ‘зар не знаеш што е тоа? Му реков ‘не знам, господине мој."},
	{6, "6 Тогаш одговори и ми рече: ‘тоа е словото Господово кон Зоровавела, што кажува - не со војска не со сила, а со Мојот Дух, вели Господ Саваот."},
	{7, "7 Која си ти, планино голема, пред Зоровавела: Та ти си рамнина и он ке го изнесе каменот темелник во восклик: 'благодат, благодат врз него!'"},
	{8, "8 И би слово Господово до мене:"},
	{9, "9 рацете на Зоровавела ги поставија основите на овој дом: неговите раце и ке го завршат, и ти тогаш ке рабереш дека Господ Саваот ме прати при вас."},
	{10, "10 Оти, кој може да го омаловажи тој ден, кога радосно ке ја гледаат sидарската висулка во рацете на Зоровавела оние седум, а тоа се очите на Господа, што со поглед ја опфакаат целата земја?"},
	{11, "11 Потоа одговорив и му реков: што значат оние две маслинки од десната и од левата страна на свекникот?"},
	{12, "12 И пак почнав да му зборувам и му реков - што треба да означуваат оние две маслинени гранчиња, што се нао аат ме у двете златни цевчиња, кои од себе долеваат масло?"},
	{13, "13 А тој ми рече: ‘зар не ти е познато што е тоа? Му одговорив: ‘не знам, господине мој."},
	{14, "14 Тогаш тој ми рече: ‘па тоа се двајцата помазаници со елеј, кои стојат пред Господа над целата земја."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 Потоа пак ги подигнав очите и видов: а тоа лета свиток."},
	{2, "2 И ме праша тој: ‘што гледаш? Му одговорив: ‘гледам свиток како лета; должината му е дваесет лакти, а ширината десет лакти."},
	{3, "3 Тогаш ми рече: 'Тоа е проклетството што ке се излие врз целата земја; и секој што краде, ке се истреби, како што е напишано на едната страна; и секој што се колне лажно, ке се истреби - како што е напишано на другата страна."},
	{4, "4 Јас го пуштив - вели Господ - и тој ке влезе во домот на крадецот и во домот на оној, што се колне лажно во името Мое, и ке остане во домот негов, и ке ги истреби него, и дрвјата негови и камењата негови'."},
	{5, "5 Тогаш влезе ангелот, што зборуваше со мене, и ми рече - подигни ги очите пак и погледај - што е она што излегува?"},
	{6, "6 А кога прашав: ‘што е тоа? он ми одговори: она што излегува е ефа мерна, па додаде, тоа е образот нивни по целата земја."},
	{7, "7 И, ете, одеднаш се издигна порче олово, а таму една жена седеше врз ефата."},
	{8, "8 Ми рече тој: таа жена е беззаконието, па ја фрли среде ефата, а при отворот и го фрли парчето олово."},
	{9, "9 И одново ги подигнав очите и видов: одеднаш се појавија две жени, и ветар имаше ме у криљата нивни; а криљата им беа како криља на штрк; и ја кренаа тие ефата и ја понесоа угоре ме у земјата и небото."},
	{10, "10 Го прашав ангелот, што зборуваше со мене: каде ја носат таа ефа?"},
	{11, "11 А тој ми одговори: - за да се изгради за неа дом во земјата Сенар, и кога ке биде се подготвено; тогаш таа ке биде однесена и поставена на своето место."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct mk6 poems[] = {
	{1, "1 Пак ги подигнав очите свои и гледам: а таму, ете, излегуваат четири коли со коњи од еден дол ме у две планини, а тие планини беа од бакар."},
	{2, "2 Кај првата кола коњите беа црвеникави, кај втората црни;"},
	{3, "3 кај третата кола коњите беа бели, а кај четвртата кола - сиви и силни."},
	{4, "4 Проговорив и му реков на ангелот, што зборуваше со мене: 'А што значи ова, господине мој?'"},
	{5, "5 Ангелот одговори и ми рече: тоа се четирите небесни духа, кои излегуваат да се претстават пред Господа над целата земја."},
	{6, "6 Враните коњи излегуваа кон северната страна, а белите одеа по нив, додека сивите коњи одеа кон јужната страна."},
	{7, "7 Излегоа и силните, па се впуштија да ја обиколат земјата; и он им рече: ‘обиколете ја земјата, и тие ја обиколија."},
	{8, "8 Тогаш тој ме повика и ми рече: ете, оние што отидоа кон северната страна, го успокоија духот Мој против северната страна."},
	{9, "9 И пак би слово Господово до мене:"},
	{10, "10 земи од дојдените робја, од Халдеја, од Товија и од Једаја, и тргни истиот ден, па дојди во домот на Јосија, синот Софониев, каде што тие пристигнаа од Вавилон."},
	{11, "11 Земи од нив сребро и злато, па направи венци, и стави ги на главата на Исуса, синот Јоседеков, големиот архиереј,"},
	{12, "12 и речи им: вака вели Господ Саваот: 'Ете, маж, името Негово е Зачетник, 'Он ке израсне од коренот свој и ке создаде храм Господен."},
	{13, "13 Он ке создаде храм Господен и ке се прослави, ке седне на престолот свој и ке биде владетел, ке биде и свештеник на престолот свој, и ке има согласност за мир ме у едниот и другиот."},
	{14, "14 А венци ке бидат за Хелема и Товија, за Једаја и Хена, синот Софониев, како спомен во храмот Господен."},
	{15, "15 И оддалеку ке дојдат лу е, што ке учествуваат во градењето, на храмот, и вие тогаш ке разберете, дека Господ Саваот ме испрати при вас, и сето тоа ке се изврши, ако искрено го послушате гласот на вашиот Господ Бог."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct mk7 poems[] = {
	{1, "1 Во четвртата година на царот Дарија би слово Господово кон Захарија, на четвртиот ден од деветтиот месец - Хаслев,"},
	{2, "2 кога Ветил ги испрати Сарацера и Регемелеха и придружниците нивни за да се помолат пред лицето на Господа"},
	{3, "3 и да ги прашаат свештениците, што се нао аа во домот на Господа Саваот, и пророците, па да прашаат: ‘да плачеме ли во петтиот месец и да постиме ли, како што го правевме тоа, еве, веке многу години?‘"},
	{4, "4 И би слово на Господа Саваот до мене:"},
	{5, "5 ‘Кажи му на сиот народ од оваа земја и на свештениците вака: кога постевте и плачевте во петтиот и седмиот месец, и тоа цели седумдесет години, за Мене ли постевте, зар за Мене?"},
	{6, "6 И кога јадевте и пиевте, зар не јадевте за себе и зар не пиевте за себе?‘"},
	{7, "7 Зар истите зборови не ги кажуваше Господ преку поранишните пророци, кога Ерусалим беше населен и спокоен, а и градовите околу него, јужната страна и низината, кога беа населени?‘"},
	{8, "8 И би слово Господово до Захарија:"},
	{9, "9 вака зборуваше тогаш Господ Саваот: извршувајте суд праведен и имајте милост и сочувство кон својот брат;"},
	{10, "10 вдовици и сираци, придојден и сиромав не злоставувајте и не мислите зло во срцата ваши еден против друг."},
	{11, "11 Но тие на сакаа да слушаат, и се одвратија од Мене; и ушите ги затнаа за да не слушаат."},
	{12, "12 И срцето го скаменија, за да не го пазат законот и зборовите што ги испракаше Господ Саваот преку Својот Дух до поранешните пророци; па затоа и ги постигна големиот гнев на Господа Саваот."},
	{13, "13 И како што викав Јас, а тие не слушаа, викаа и тие, но Јас не ги слушав, вели Господ Саваот."},
	{14, "14 па ги распрснав по сите народи, кои тие не ги познаваа, и оваа земја запусте по нив, така што никој не одеше ни напред ни назад по неа, и тие саканата земја ја претворија во пустиња."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct mk8 poems[] = {
	{1, "1 И пак дојде слово од Господа Саваота:"},
	{2, "2 вака вели Господ Саваот: 'Ревнував за Ерусалим и за Сион со голема ревност и со голем гнев ревнував за него'."},
	{3, "3 Така вели Господ: 'Kе се обрнам кон Сион и ке живеам во Ерусалим, и Ерусалим ке се вика град на вистината, и гората на Господа Саваота ке се вика - Света Гора'."},
	{4, "4 Така вели Господ Саваот - 'И пак старци и старички ке седат по улиците на Ерусалим, секој со стапчето свое поради напреднатата возраст своја."},
	{5, "5 А и улиците на тој град ке се исполнат со момчиња и девојки, кои ке си играат по улиците негови'."},
	{6, "6 Вака вели Господ Саваот: 'Ако во очите на другите им биде чудно во тие дни, зар ке биде тоа чудно и во очите Мои?' - вели Господ Саваот."},
	{7, "7 Вака вели Господ Саваот: 'Ете, Јас ке го спасам Својот народ од источната страна и од западната;"},
	{8, "8 ке ги доведам, и тие ке живеат во Ерусалим и ке бидат Мој народ, и Јас ке им бидам нивни Бог, во вистина и во правда'."},
	{9, "9 Така вели Господ Саваот: 'Поткрепете ги сега рацете свои вие, што ги слушате овие зборови од устата на пророците, кои беа при основањето на домот за Господа Саваота, за да се изгради храмот."},
	{10, "10 Оти пред оние дни немаше ни плата за човек ниту награда за трудот на животното; немаше спокојство од непријателите ни за оној што доа аше, ниту за оној што си одеше; и дозволував Јас секој човек да му е непријател на друг човек."},
	{11, "11 А сега за остатокот од овој народ Јас не сум веке таков како во поранешните денови' - вели Господ Саваот."},
	{12, "12 Зашто селидбата ке се врши во мир, лозата ке го даде својот плод, замјата ке го даде својот род, а и небесата ке ја даваат својата роса; и сето тоа ке го предадам на остатокот од овој народ."},
	{13, "13 И како што вие, доме Јудин и доме Израилев, бевте проколнати ме у народите, така ке ве избавам, и вие ке бидете благословени; не плашете се, рацете ваши нека се поткрепат!'"},
	{14, "14 Оти така вели Господ Саваот: 'Како што бев определил да ве казнам, кога татковците ваши Ме прогневуваа - вели Господ Саваот - и не зажалив,"},
	{15, "15 така пак определив во овие дни на Ерусалим да му направам добро и на домот Јудин; не бојте се!"},
	{16, "16 Еве ги наредбите што треба вие да ги извршувате: зборувајте вистина еден на друг; праведно и мирољубово судете при портите ваши."},
	{17, "17 Никој од вас да не му мисли зло на ближниот свој, и на посакувајте лажна клетва, зашто сето тоа Јас го мразам - говори Господ Севишниот."},
	{18, "18 И би слово до мене од Господа Саваота:"},
	{19, "19 Вака вели Господ Саваот: 'Постот во четвртиот месец, постот во петтиот, постот во седмиот и постот во десеттиот месец за домот Јудин ке бидат радост и голема веселба, сакајте ги вистината и мирот'."},
	{20, "20 Така вели Господ Саваот: 'Уште ке доа аат народи и жители од многу градови,"},
	{21, "21 и ке дојдат жителите од еден град при жителите во друг град, - па ке речат: да дојдеме да се помолиме пред лицето на Господа и да Го побараме Господа Саваота; тогаш секој ке рече - ке појдам и јас."},
	{22, "22 И ке доа аат многу племиња и народи силни, за да го бараат Господа Саваота во Ерусалим и да се помолат пред лицето на Господа."},
	{23, "23 Така вели Господ Саваот: 'Во тие дни ке се факаат по десет души од разни народи за полата од Јудеец и ке речат - ке појдеме со тебе, оти чувме дека Бог е со вас'."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct mk9 poems[] = {
	{1, "1 Пророчкото слово на Господа е против земјата Хадрах, и во Дамаск ке се задржи, зашто окото Господово ги набљудува сите лу е, како и сите колена Израилеви;"},
	{2, "2 тоа е и врз Емат, кој се граничи со него, и е врз Тир и Сидон, оти тие станале многу лукави."},
	{3, "3 Тир изградил тврдина, натрупал сребро како прашина, и злато како улична кал."},
	{4, "4 И, ете, Господ ке го направи беден и ке му ја скрши силата негова во морето, а и самиот ке биде истребен со оган."},
	{5, "5 Тоа ке го види Аскалон, и ке се уплаши, а и Газа - па и таа ке затрепери многу, и Екрон, оти ке се засрами надежта негова: нема да има цар во Газа, и Аскалон нема да се насели."},
	{6, "6 Ту о племе ке живее во Азот, и Јас ке ја уништам гордоста на Филистејците."},
	{7, "7 Kе ја извлечам крвта од устата нивна, нечистотијата од забите нивни и тие ке паднат пред нашиот Бог и ке бидат како иљаданачалници во Јудеја, а Екрон ке биде како Јевусеј."},
	{8, "8 Kе поставам стража околу Мојот дом спроти војската, спроти оние, кои преминуваат натаму и наваму, и нема повеке да доа а непријател; оти сега Јас ке го гледам со очите Свои."},
	{9, "9 Ликувај од радост, керко Сионова, извикувај, керко ерусалимска; ете, Царот твој доа а при тебе, праведен е и со спасувачка сила, кроток, седнат на осле, рожба на ослицата."},
	{10, "10 Тогаш ке ги истребам колите на Ефрема и коњите на Ерусалим, и ке се скрши убојниот лак; и Он ке објави мир на народите, и царството Негово ке се протега од море до море и од реката до краиштата на земјата."},
	{11, "11 А што се однесува до тебе, Израиле, заради крвта на заветот Јас ги пуштив затворените од ровот, каде што нема вода."},
	{12, "12 Вракајте се во тврдината вие затворените, кои се надевате! А сега што ке воспоставам, ке ти дадам двојно."},
	{13, "13 Зашто како лак ке го затегнам Јуда и лакот ке го наполнам со Ефрема, па ке ги подигнам синовите твои, Сионе, против синовите твои, Еладо и тебе ке те направам како меч јуначки."},
	{14, "14 Kе се појави над нив Господ и како молскавица ке излета стрелата Негова; ке загрми Господ Бог со трубата и ке појде кон јужните бури со гласот на гневот Свој."},
	{15, "15 Господ Саваот ке ги брани, и тие ке истребуваат и ке ги газат дури и камењата за праки; ке пијат крв како вино; и ке се наполнат како жртвени чаши, како аглите на жртвеникот."},
	{16, "16 И ке ги спаси нивниот Господ Бог во оној ден, како стадо од Својот народ; оти тие ке заблескаат како камења на круна во земјата Негова."},
	{17, "17 О, колку голема ке биде добротата негова и каква ке биде убавината негова. Житото ке ги весели момците, и виното девојките."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct mk10 poems[] = {
	{1, "1 Молете Го Господа за дожд во време благопријатно; Господ ке светне со молскавица и ке ви даде обилен дожд - зеленило во поле."},
	{2, "2 Зашто лажните гледачи зборуваат празни зборови, и вражачите гледаат лажливи работи и прикажуваат лажни соништа; тие утешуваат со празни зборови; затоа талкаат како овци, талкаат оти немаат пастир."},
	{3, "3 Против пастирите се распали гневот Мој, и јагнињата ке ги пречекам; оти Господ Саваот ке го посети стадото Свое, домот Јудин, и ке го подготви како силен коњ за бој."},
	{4, "4 Од него ке направи аголен камен, од него - клин, од него лак за бој, од него ке излезат сите управници на народот."},
	{5, "5 И тие ке бидат како јунаци што ги газат непријателите како улична кал, и ке се борат, бидејки Господ е со нив, и ке ги посрамат јавачите на коњи."},
	{6, "6 Kе го зацврстам домот Јудин и ке го спасам домот Јосифов, и ке ги вратам, оти Јас се смилив над нив, и тие ке бидат како да не сум ги оставил: зашто Јас сум нивниот Господ Бог, и ке ги чујам."},
	{7, "7 Како јунак ке биде Ефрем; ке се развесели срцето нивно како вино да пиеле, па ке го видат тоа синовите нивни и ке им се зарадува срцето нивно; во восхит ке им биде тогаш срцето нивно во Господа."},
	{8, "8 Kе дадам знак и ке ги соберам, оти ги откупив; ке бидат многубројни како и порано;"},
	{9, "9 ке ги раселам ме у народите, но во далечни земји тие ке се секаваат на мене и ке живеат со децата свои, и ке се вратат."},
	{10, "10 Kе ги вратам од земјата Египетска и од Асирија ке ги соберам; ке ги доведам во земјата Галад и на Ливан, и не ке има доволно место за нив."},
	{11, "11 Kе преминат по морето и ке ги поразат морските бранови; ке пресушат сита длабини на реката, и ке се смири гордоста на Асура, и скиптариот ке биде одземен од Египет."},
	{12, "12 Kе ги зацврстам во Господа, и тие ке одат во името Негово, вели Господ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct mk11 poems[] = {
	{1, "1 Отвори ги, Ливане, портите свои и оган нека ги проголта кедрите твои."},
	{2, "2 Плачи, кипарисе, зашто падна кедарот, оти и великаните се опустошени; ридајте, дабови васански, бидејки е провалена непроодната гора."},
	{3, "3 Се слуша гласот од плачењето на паситрите, бидејки е опустошено нивното велелепие; се слуша риакњето на лавовите, оти е опустошена убавината на Јордан."},
	{4, "4 Така вели Господ Бог, мојот Бог: паси ги овците, определени за клање,"},
	{5, "5 кои купувачите, без пречка ке ги колат, а продавачите ке им велат: 'нека е благословен Господ; се збогативме!' И паситрите нивни не ке ги жалат."},
	{6, "6 Зашто Јас веке нема да им проштевам на жителите од земјата, вели Господ; ете, ке ги предадам лу ето, секого во рацете на неговиот ближен и во рацете на неговиот цар, и тие ке ја поразуваат земјата, а Јас нема да ги избавувам од рацете нивни."},
	{7, "7 И ке ги пасам овците во земјата Хананска, определени за клање, овци навистина бедни. И ке земам два стапа, едниот ке го наречам - благоволение, а другиот - вериги; со нив ке ги пасам овците."},
	{8, "8 И ке истребам тројца од пастирите во еден месец и ке се одврати душата Моја од нив, оти и нивната душа ке се одврака од Мене."},
	{9, "9 Тогаш ке речам: нема да ве пасам; онаа што умира, нема умре, и која загинува, нека загине; и тие, пак, што ке останат нека се изедат една со друга."},
	{10, "10 И така ке го земам стапот Свој благоволение и ке го прекршам, за да го уништам заветот што го склучив со сите народи."},
	{11, "11 И тој ке биде уништен во оној ден, и тогаш ке разберат бедните овци, кои Ме очекуваат, дека ова е слово од Господа."},
	{12, "12 И ке им речам: ако ви е угодно, дајте Ми ја наградата Моја; ако, пак не - не давајте Ми ја; и тие Ми одредија плата триесет сребреници."},
	{13, "13 А Господ ми рече: стави ги во црковната каса - тоа е висока цена, со која ме оценија. И јас ги зедов тие триесет сребреници и ги фрлив во домот Господен за грнчарот."},
	{14, "14 Го скршив и Својот друг стап - вериги, за да го раскинам братството ме у Јуда и Израилот."},
	{15, "15 И ми рече Господ: земи си уште нешто од опремата пастирска."},
	{16, "16 Оти, ете, Јас ке поставам пастир на оваа земја, кој нема да се грижи за оние што загинуваат, нема да ги бара загубените и болните нема да ги лекува, здравите нема да ги храни, а месото од згоените ке го јаде, копитата, пак, ке им ги откинува."},
	{17, "17 Тешко му на овој мрзлив пастир, што го остава стадото! Меч ке му стои над раката негова и над неговото десно око! Раката наполно ке му се исуши, и десното око негово наполно ке потемнее."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct mk12 poems[] = {
	{1, "1 Пророчко слово од Господа за Израилот. Господ, Кој го распна небото и ја основа земјата и му создаде на човекот дух, кој е во него, вели:"},
	{2, "2 ете, Јас ке го направам Ерусалим како чаша за опивање на сите народи околни, а исто така и за Јуда во времето на ерусалимската опсада."},
	{3, "3 Во оној ден ке го направам Ерусалим како тежок камен за сите племиња; сите што ке го подигаат, ке се искилават, а ке се соберат против него сите народи земни."},
	{4, "4 Во оној ден, вели Господ, Јас ке го поразам секој коњ со лудост, а коњаникот негов - со безумие, додека врз домот Јудин ке ги отворам очите Свои; секој коњ пак, при народите ке го празам со слепило."},
	{5, "5 Тогаш кнезовите Јудини ке речат во срцата свои: моја сила се жителите на Ерусалим во Господа Саваот, нивниот Бог."},
	{6, "6 Во оној ден Јас ке ги направам кнезовите Јудини како запален јаглен ме у дрва и како огнено светило ме у снопови; тие ке ги истребат сите околни народи, и од десната и од левата страна, и Ерусалим ке биде одново населен на своето место - во Ерусалим."},
	{7, "7 И Господ ке ги спаси најнапред шаторите на Јуда, така што величието на домот Давидов и величието на ерусалимските жители да не се издига над Јуда."},
	{8, "8 Во оној ден Господ ке ги брани жителите на Ерусалим, и најслабиот ме у нив во оној ден ке биде како Давид, а домот Давидов ке стане како Божји дом, како ангел Господен пред нив."},
	{9, "9 Во оној ден ке ги истребам сите народи, што го напа аат Ерусалим."},
	{10, "10 А врз домот Давидов и врз жителите ерусалимски ке излијам дух на благодат и милост, и тие ке погледаат на Него, Кого тие го прободоа, и ке плачат за Него, како што се плаче за еднороден син, и ке жалат како што се жали за првороден."},
	{11, "11 Во оној ден ке се крене голем плач во Ерусалим, како плач на Хададримона во долината Мегидон."},
	{12, "12 И ке плаче земјата, секое племе посебно; племето на домот Давидов, и жените нивни одделно;"},
	{13, "13 племето на Левија одделно, и жените нивни одделно; племето Симеоново одделно, и жените нивни одделно;"},
	{14, "14 и сите други племиња, секое племе одделно, и жените нивни одделно."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct mk13 poems[] = {
	{1, "1 Во оној ден ке се отвори извор за домот Давидов и за жителите ерусамиски, за да се измијат од гревовите нивни и од нечистотијата."},
	{2, "2 Во оној ден, вели Господ Саваот, Јас ке ги истребам имињата на идолите од оваа земја, и тие повеке нема да се спомнуваат; ке ги истребам и лажните пророци и нечистиот дух од оваа земја."},
	{3, "3 Тогаш, ако некој претскажува, татко му и мајка му, што го родиле, ке му речат: ти не треба да живееш, зашто кажуваш лага во името на Господа; и ке го убијат татко му и мајка му, кога тој ке претскажува."},
	{4, "4 Во оној ден ке се засрамат таквите претскажувачи, секој од кажувањето свое, кога ке почнат да претскажуваат, и нема да се облекуваат во врекишта, за да лажат."},
	{5, "5 Тогаш секој ке рече: јас не сум пророк, земјоделец сум, бидејки некој ме направил роб од детството мое."},
	{6, "6 Но ке му речат: а од што ти се белезите на рацете твои? Тој ке одговори: од тоа што ме биеја дома оние што ме сакаа."},
	{7, "7 О, мечу, подогни се против Мојот пастир и против Мојот ближен, вели Господ Саваот: порази го пастирот, и овците ке се распрснат! И Јас ке ја свртам раката Своја против малите."},
	{8, "8 И по целата земја, вели Господ, два дела од неа ке бидат истребени, ке изумрат, а третиот ке остане."},
	{9, "9 И тој трет дел ке го минам низ оган, и ке ги стопам како што се топи сребро, и ке ги исчистам, како што се чисти злато; тие ке го повикаат името Мое, и Јас ке ги чујам; тоа е Мојот народ, а тие ке речат: Господ е мој Бог!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct mk14 poems[] = {
	{1, "1 Ете, настапува денот Господен кога ке го разделат ограбеното од тебе пред тебе."},
	{2, "2 Kе ги соберам сите народи во војна против Ерусалим; градот ке биде преземен, и домовите разгребени; жените ке бидат обесчестени, половината од градот ке отиде во ропство; но останатиот народ нема да биде истребен од градот."},
	{3, "3 Тогаш ке излезе Господ и ке се сврти против тие народи, како што војуваше во борбен ден."},
	{4, "4 И ке застанат нозете Негови на Елеонската Гора во оној ден, што се нао а спроти Ерусалим од источната страна: и ке се расцепи Елеонската Гора од исток кон запад со многу голема долина и половината ке појде кон север, а втората половина кон југ."},
	{5, "5 И вие ке побегнете во долината на Моите гори, оти планинската долина ке се протега до Асил; а ке побегнете како што бегавте од земјотресот во деновите на Озија, царот Јудејски; и ке дојде Господ, мојот Бог, и сите светии со Него."},
	{6, "6 Во тој ден нема да има светила, светилата ке бидат премавнати."},
	{7, "7 Тој ден ке биде единствен, познат само на Господа; ниту ден, ниту нок - само приквечер ке се појави светлина."},
	{8, "8 Во тој ден ке потечат живи води од Ерусалим, половина кон источното море, а половина кон западното море; така ке биде и лете и зиме."},
	{9, "9 И Господ ке биде Цар над целата земја; во тој ден Господ ке биде единствен и името Негово - едно единствено."},
	{10, "10 Целата таа земја ке биде како рамнината од Гаваон до Ремон, јужно од Ерусалим, кој се извисил на местото свое и кој ке се насели од портите Венијаминови до местото на првите порти, до Агловите порти, и од кулата на Ананеила до царските визби."},
	{11, "11 И ке се населат во него, и проклетство нема да има повеке, а Ерусалим ке се нао а во безопасност."},
	{12, "12 И ете какво ке биде поразувањето, со кое Господ ке ги порази сите народи, кои војувале против Ерусалим - телото на секого од нив ке се исуши уште додека стои на нозете свои, и очите ке му се стопат во длабнатините, и јазикот ке му се исуши во устата негова."},
	{13, "13 И во тој ден ке завладее голем смут од Господа, така што еден друг ке се факаат за раката своја и секој ке ја подига раката своја против раката на ближниот свој."},
	{14, "14 Но и Јуда самиот ке војува против Ерусалим, и богатството на сите околни народи ке биде собрано: злато, сребро и облеки во голем број."},
	{15, "15 Таков пораз ке има и врз коњите и маските, камилите и ослите, и врз секаков добиток, што ке се нао а во куките нивни."},
	{16, "16 А потоа сите други што доа аат во Ерусалим, од сите народи, ке доа аат од година во година, за да се поклонат на Царот, на Господа Саваот, и да го празнуваат празникот Сеници."},
	{17, "17 И, ако некое од племињата земни не појде во Ерусалим, за да Му се поклони на Царот, на Господа Саваот, дожд нема да падне при нив."},
	{18, "18 И, ако племето египетско не тргне на пат и не дојде тука, и тоа нема да добие дожд, па ке го постигне пораз, со каков ги порази Господ оние народи, што не доа але да го празнуваат празникот Сеници."},
	{19, "19 Ете што ке стане за гревот на Египет и за гревот на сите народи, кои нема да дојдат да го празнуваат празникот Сеници."},
	{20, "20 Во тоа време дури на уздите од коњите ке биде забележано 'светиња на Господа', и котлите во домот Господен ке бидат како жртвените садови пред жртвеникот."},
	{21, "21 И сите котли во Ерусалим и во Јудеја ке бидат светиња на Господа Саваот, и ке доа аат сите што принесуваат жртва, ке ги земат и ке варат во нив, и нема повеке да има ниту еден Хананеец во домот на Господа Саваот во тој ден."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};