#include <map>
#include <string>
class Bible32
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 И би словото Господово до Јона, синот Аматиев:"},
	{2, "2 'Стани и оди во Ниневија, град голем, и проповедај во него, зашто неговите лоши дела стигнаа до Мене.'"},
	{3, "3 А Јона стана за да избега во Тарсис од лицето Господово; слезе во Јопа, каде што најде кораб што плови за Тарсис, па откако ја плати возарината, влезе во него за да избега со него во Тарсис од лицето Господово."},
	{4, "4 Но Господ подигна силен ветар на морето, и настана голема бура, така што коработ за малку ке се разбиеше."},
	{5, "5 Морнарите се уплашија и повикаа секој кон својот бог, па почнаа товарот од коработ да го фрлаат во морето, за да му се олесни; а Јона беше слегол во дното на коработ, легнал и длабоко заспал."},
	{6, "6 Тогаш дојде при него капетанот на коработ и му рече: 'Што, ти спиеш! Стани и повикај кај твојот Бог. Можеби Бог ке се сети на нас, и ние нема да загинеме.'"},
	{7, "7 Па си рекоа еден на друг: 'Да фрлиме жреб и да видиме поради кого не снајде оваа беда.' Фрлија жреб и жребот падна на Јона."},
	{8, "8 Тогаш му рекоа: 'Кажи ни заради што не снајде оваа невоља? Со што се занимаваш, и од каде идеш? Каде е твојата земја и од кој народ си?'"},
	{9, "9 Тој им рече: 'Јас сум Евреин, Го почитувам Господа Бога на небесата, Оној што ја создаде земјата и водата.'"},
	{10, "10 Тогаш лу ето се уплашија многу и му рекоа: 'Зошто го направи ова?' Оти тие узнаа дека тој бега од лицето Господово, - како што тој сам им беше кажел."},
	{11, "11 И му рекоа: 'Што да направиме со тебе, та морето да стивне за нас?' Бидејки морето се брануваше."},
	{12, "12 Тогаш тој им рече: 'Земете ме и фрлете ме в море, и морето за вас ке стивне, оти знам дека поради мене се крена оваа бура.'"},
	{13, "13 Лу ето потоа се трудеа некако да се приближат до суво, но не можеа, бидејки морето се повеке беснееше против нив."},
	{14, "14 Тогаш повикаа кон Господа и рекоа: 'Те молиме Господи, да не загинеме поради душата на овој човек, и да не бидеме одговорни за невина крв, зашто Ти, Господи, си направил како што ти е Тебе угодно.'"},
	{15, "15 Па го зедоа Јона и го фрлија во морето; и морето престана да се бранува."},
	{16, "16 Тогаш лу ето се уплашија многу од Господа, Му принесоа на Господа жртви и се заветуваа."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 И му заповеда Господ на еден голем кит да го проголта Јона; и Јона остана во утробата на тој кит три дена и три ноки."},
	{2, "2 Му се помоли Јона на својот Господ Бог од утробата на китот,"},
	{3, "3 па рече: 'Кон Господа повикав во мојата невоља Он ме чу; извикав од утробата на пеколот - и Ти го чу гласот мој.'"},
	{4, "4 Ти ме фрли во длабините, во срцето на морето, и вода ме опколуваше, и сите води Твои и бранови Твои минеа преку мене."},
	{5, "5 Тогаш реков: Отфрлен сум од очите Твои, но сепак, ке ја видам светињата Твоја."},
	{6, "6 Ме притиснаа водите до душата моја, бездната ме затвори; со трева морска главата моја е обвиена."},
	{7, "7 Слегнав до основите на планините, земјата со резињата свои за навек ме затвори, но Ти, Господи, Боже мој, ке ја изведеш душата моја од пеколот."},
	{8, "8 Кога изнемогна душата моја, се сетив на Господа, и молитвата моја стигна до Тебе, до светиот храм Твој."},
	{9, "9 Оние, кои почитуваат лажни богови, Го оставија својот Милосрден,"},
	{10, "10 но јас со похвален глас ке Ти принесам жртва; она што сум го ветил, ке го исполнам. Во Господа е спасението!'"},
	{11, "11 Тогаш му заповеда Господ на китот, и тој го исфрли Јона на суво."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 И повторно дојде словото Господово до Јона, велејки му:"},
	{2, "2 'Стани и појди во градот Ниневија, големиот град и проповедај му го она што ке ти кажам.'"},
	{3, "3 Стана Јона и отиде во Ниневија по заповед на Господа; а Ниневија беше многу голем град: три дена одење."},
	{4, "4 И Јона почна да оди по градот, колку што можеше да се изоди за еден ден, и проповедаше, велејки: 'Уште четириесет дена и Ниневија ке биде разурната!'"},
	{5, "5 И поверуваа ниневијците во Бога, прогласија пост и се облекоа во вреки, мало и големо."},
	{6, "6 Таа проповед дојде и до царот на Ниневија, и тој стана од престолот свој, ја соблече царската облека, се облече во врекиште и седна во пепел,"},
	{7, "7 па заповеда да се прогласи и да се каже во Ниневија од името на царот и од неговите големци - ни лу ето, ни добитокот, ни воловите, ниту овците да не јадат ништо и да не одат на пасење и да не пијат;"},
	{8, "8 и лу ето и добитокот да бидат покриени со врекишта и силно да извикуваат кон Бога: секој да се откаже од својот лош пат и од насилството на рацете свои."},
	{9, "9 Кој знае - можеби Бог ке се смилостиви и ке го отфрли од нас свотој разгорен гнев, и така да не загинеме."},
	{10, "10 И ги виде Бог нивните дела, оти тие се одвратија од својот лош пат, па се сожали на злото, за кое беше рекол дека ке го нафрли врз нив, и не го нафрли."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Поради тоа Јона многу се огорчи и вознегодува."},
	{2, "2 Па Му се помоли на Господа и рече: 'О, Господи, зар не го велев тоа уште додека бев во земјата своја? Та затоа и побегнав во Тарсис, оти знаев дека Ти си Бог добар и милосрден, долготрпелив и многумилостив, па ке се сожалиш за бедата."},
	{3, "3 А сега, Господи, земи ја душата моја од мене, зашто подобро е да умрам отколку да живеам.'"},
	{4, "4 Господ пак му рече: 'Зошто тоа толку многу те огорчи?'"},
	{5, "5 Тогаш Јона излезе од градот, па седна од источната страна, и таму си направи сеница и се смести во неа под ладовина, за да види што ке стане со градот."},
	{6, "6 Господ Бог нареди сега да израсне растение над главата на Јона, за да има над главата сенка, и да го избави од огорчението негово. Јона многу му се зарадува на тоа растение."},
	{7, "7 И нареди Господ, вториот ден, кога зората се зазори, црви да ја подгризат тиквата, и таа се исуши."},
	{8, "8 А кога изгреа сонцето, испрати Бог врел источен ветар, и сонцето почна да ја вжештува главата на Јона, така што тој изнемоште толку што се помоли да умре, велејки: 'Подобро е да умрам отколу да живеам.'"},
	{9, "9 А Бог му рече тогаш на Јона: 'Па зар е добро тоа што се лутиш заради растението?' А тој одговори: 'Многу сум лут, лут сум дури до смрт!'"},
	{10, "10 Тогаш Господ рече: 'Тебе ти е жал за едно растение, за кое ти не си се трудел, ниту си го одгледувал, и кое за една ноки израсна и се исуши,"},
	{11, "11 а Мене да не Ми е жал за Ниневија, за овој голем град, во кој живеат повеке од сто и дваесет иљади души, кои не можат да ја разликуваат десната рака од левата, а и за многу добиток?'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};