#include <map>
#include <string>
class Bible29
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Слово Господово до Јоила, синот Ватуилов."},
	{2, "2 Чујте го ова, старци, и внимавајте сите жители на оваа земја: се случувало ли ова во вашите денови или во деновите на вашите татковци?"},
	{3, "3 Раскажувајте за него на децата ваши; а децата ваши нека им расакажуваат на нивните деца, и нивните деца - на следниот род;"},
	{4, "4 се што остана од гасениците, го изедоа скакулците; а што остана од скакулците, го изедоа црвите; и што остана од црвите, го изедоа бубамарите."},
	{5, "5 Разбудете се пијаници, плачете и ридајте, вие сите што пиете вино, за сокот гроздов, зашто е одземен од устата ваша."},
	{6, "6 Зашто против земјата моја дојде народ силен и безброен; забите му се како заби на лав, а челустите како челуст на лавица."},
	{7, "7 Тој ми ја опустоши лозата, и смоквата ми ја откорна, ја обели до голо и ја фрли; гранките и останаа бели."},
	{8, "8 Плачи како што плаче млада жена, опашана со врекиште, за мажот од својата младост."},
	{9, "9 Се прекрати лебниот принос и преливот за него во домот Господен; плачат и свештениците, служителите Господови."},
	{10, "10 Опустошено е полето, тагува земјата, оти е уништено житото; се исуши гроздовиот сок, овенала маслината."},
	{11, "11 Црвенете се од срам, земјоделци, плачете лозари, за пченицата и за јачменот, оти нема веке жетва по нивите,"},
	{12, "12 лозата се исуши, смоквата свена, нарот, палмата и јаболкницата - сите дрвја по полето се исушија; поради тоа и веселбата кај синовите човечки исчезна."},
	{13, "13 Препашете се со кострет, свештеници, и плачете; ридајте, служители на Светилиштето. Влезете и нокевајте, служители на мојот Бог, во кострет, зашто во Домот на вашиот Бог нема веке лебен принос и прелив."},
	{14, "14 Определете пост, објавете свечен собир, повикајте ги старците и сите жители од тој крај во домот на Господа, вашиот Бог - викајте кон Господа."},
	{15, "15 О каков ден! Оти денот Господен е близу; и ке дојде како запустување од Сесилниот."},
	{16, "16 Зар пред очите наши не се одзеде храната, и од домот на нашиот Бог - веселбата и радоста?"},
	{17, "17 Изгниени се зрната во свите лушпи, запустени се житниците, урнати се амбарите, оти нема веке жито."},
	{18, "18 Ете, стенка добитокот, нажалени одат стадата волови, зашто нема за нив пасиште; се измачуваат и стадата овци."},
	{19, "19 Кон Тебе, Господи, викам, оти оган ги проголта сочните пасишта во пустињата, и пламен ги подгори дрвјата во полето."},
	{20, "20 Дури и животните во полето викаат кон Тебе, зашто секна водата по потоците, и оган ги изгори пасиштата во пустињата."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Трубете со труби на Сион и викајте на Мојата света гора; нека треперат сите жители земни, оти настапува денот Господен, бидејки е близу,"},
	{2, "2 денот на темнина и мрак денот облачен и маглив: како зората ке се шири по горите многуброен народ и силен каков што немало од векот и каков што не ке има потоа од род во род."},
	{3, "3 Пред него оган ке голта, а зад него пламен ке пали; пред него е земјата како Едемска градина, за зад него земјата ке биде опустошена како пустиња, и за никого од него нема да има спас."},
	{4, "4 Изгледаат како коњи, потскокнуваат како коњаници,"},
	{5, "5 скокаат преку горските врвови како со тропот од коли, како праскот од огнен пламен, кој гори слама - како силен народ построен за борба."},
	{6, "6 Штом ке се појави, ке затреперат народите; лицата на сите ке им побледат."},
	{7, "7 Како борци ке трчаат и како храбри борци ке се искачуваат по карпите, и секој ке си оди по својот пат и нема да се отстранува од патот свој."},
	{8, "8 И нема да се притискаат еден со друг, а ке па аат врз копја, но ке остануваат неповредени."},
	{9, "9 Kе трчаат по градот, ке се искачуваат по sидовите, ке влегуваат во куките, ке влегуваат и низ прозорците како крадачи."},
	{10, "10 Пред нив ке се потресе земјата, ке се расклати небото, сонцето и месечината ке потемнат, а и sвездите ке ја изгубат светлината своја."},
	{11, "11 И Господ ке го пушти гласот Свој пред Својата војска, зашто силата воинствена Негова е многу голема, и силен е оној што ке ја извршува вољата Негова; оти голем е денот Госпден и многу е страшен, и кој ке истрпи?"},
	{12, "12 Но и уште сега вели Господ: обрнете се кон Мене од се срце со пост, плач и ридание."},
	{13, "13 Раскинете го срцата свои, а не облеката и обрнете се кон Господа вашиот Бог: зашто Он е благ и милосрден, долготрпелив и многумилостив и сожалува за злото."},
	{14, "14 кој знае дали нема да се смили и дали ке остави благослов: лебен принос и прелив за Господа, вашиот Бог?"},
	{15, "15 Затрубете со труба на Сион, наредете пост и објавете свечен собир."},
	{16, "16 Соберете го народот, свикајте собир, поканете ги и старците, соберете ги децата и цицалчињата; нека излезе младоженицот од својата одаја и невестата од својата горна одаја."},
	{17, "17 Ме у тремот и жртвеникот нека плачат свештениците, служителите на Господа и нека велат: 'Смилувај се, Господи, над народот Свој, не предавај го наследството Свое на срам, та да не се подигруваат со него народите! Зошто ме у нив да се зборува - каде е нивниот Бог?'"},
	{18, "18 Тогаш Господ ке поревнува за земјата Своја, па ке се смили и на народот Свој."},
	{19, "19 Тогаш ке одговори Господ и ке му рече на народот Свој: 'Еве, Јас ке ви пратам леб, вино и елеј, и ке се наситите со тоа, и нема повеке да ве предавам на поруга пред народите."},
	{20, "20 И непријателот од север ке го мавнам и ке го протерам во безводна и пуста земја - предната сила - во источното море, а задната - во западното море, и ке се крене омразата од него, и ке се почувствува смрдеа, зашто тој беше направил големо зло."},
	{21, "21 Не бој се, земјо; радувај се и весели се, зашто голем е Господ и може да го направи тоа."},
	{22, "22 Не бојте се sверови полски, зашто пасиштата на пустињата ке се наполнат со трева, дрвјата ке го дадат својот плод, смоквата и лозјата ке ја покажат својата сила."},
	{23, "23 А и вие, чеда Сионови, радувајте се и веселете се во Господа, вашиот Бог; оти Он ке ви дава умерен дожд, па ке ви прака дожд - дожд ран и дожд доцен, како и порано."},
	{24, "24 И ке се наполнат гумната со жито и ке се преполнат бочвите со гроздов сок и со елеј."},
	{25, "25 И ке ви надоместат за оние години, кога испојадоа се скакулците, црвите, бумбарите и гасениците - Мојата голема војска што ја пратив против вас."},
	{26, "26 И до наситка ке јадете и ке се наситувате и ке го славите името на Господа, вашиот Бог, Кој пред вас изврши големи чудеса, така што Мојот народ нема да се посрами довека."},
	{27, "27 И ке познаете дека Јас сум ме у Израилот и дека Јас сум Господ, вашиот Бог, и дека нема друг, и Мојот народ нема да се посрами довека."},
	{28, "28 И, ете, потоа ке излеам од Мојот Дух врз секоја плот, и синовите ваши и керките ваши ке пророкуваат; старците ваши ке сонуваат соништа и младите ваши ке гледаат виденија."},
	{29, "29 А и врз слугите и слугинките во оние денови ке излеам од Мојт Дух."},
	{30, "30 И ке покажам знаци на небото и на земјата: крв, оган и столбови од дим."},
	{31, "31 Сонцето ке се преобрати во темнина, а месечината - во крв, пред да настапи денот Господен, великиот и страшниот."},
	{32, "32 Тогаш секој, што ке го призовува името Господово, ке се спаси; бидејки на гората Сион и во Ерусалим ке има спасение, како што вели Господ, а и по другите места, што ке ги повика Господ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Зашто, ете, во оние денови и во тоа исто време, кога ке ги вратам плениците на Јуда и од Ерусалим,"},
	{2, "2 тогаш ке ги соберам сите народи и ке ги доведам во долината Јосафатова, и таму над нив ке изречам суд за Мојот народ и за Моето наследство - Израилот, кого го растурија ме у народите и земјата Моја ја разделија."},
	{3, "3 За народот Мој фрлија жреб и даваа момче за блудница, и продаваа девојче за вино, па пиеја."},
	{4, "4 Па што барате од Мене вие, Тире и Сидоне и сите краеви филистејски? Сакате ли да Ми отплатите или рака да Ми вратите? Но наскоро ке ја свртам отплатата ваша врз вашите глави,"},
	{5, "5 бидејки вие го зедовте среброто Мое и златото Мое и Моите највредни драгоцености и ги внесовте во безбожнички светилишта;"},
	{6, "6 а синовите на Јуда и на Ерусалим ги продавате на синовите елински, за да ги отстраните од нивните предели."},
	{7, "7 Еве, Јас ке ги кренам од она место, каде што ги продадовте, и ке ја свртам вашата отплата врз главите ваши."},
	{8, "8 И ке ги предадам синовите ваши и керките ваши во рацете на синовите Јудини, и тие ке ги предадат на Савејците, народ далечен. Така вели Господ Саваот."},
	{9, "9 Кажете го ова ме у народите, пригответе се за војна, кренете ги јунаците, нека дојдат и нека станат сите војници."},
	{10, "10 Прековајте ги плуговите свои во мечеви, а срповите во копја; и слабиот нека вели: силен сум."},
	{11, "11 Побрзајте, вие народи, сите наоколу и соберете се. Господи, поведи ги јунаците Свои!"},
	{12, "12 Нека се кренат народите и нека слезат во долината Јосафатова; зашто таму ке седнам Јас за да им судам на народите по ред."},
	{13, "13 Мавнете со срповите, зашто зрело е житото; одете, слезете, зашто полна е кацата и бочвите се преполнети, оти злобата им е голема."},
	{14, "14 Групи, групи во долината на судот! Оти близу е денот Господен во долината на судот."},
	{15, "15 Сонцето и месечината ке потемнат, и sвездите ке го изгубат својот сјај."},
	{16, "16 И ке загрми Господ од Сион и ке го испушти гласот Свој од Ерусалим: ке затреперат небото и земјата; но Господ ке му биде заштита на Својот народ и одбрана за синовите Израилеви."},
	{17, "17 Тогаш ке познаете дека Јас сум Господ, вашиот Бог, Кој живее на Сион, на Мојата света гора; и ке стане Ерусалим светиња, и нема повеке ту инци да минуваат низ него."},
	{18, "18 И, ете, во тој ден, во тој ден од горите ке капе вино, а од ридовите ке потече млеко, и сите долини јудејски ке се преполнат со вода, а од домот Господен ке се појави извор, и ке ја напојува долината Ситим."},
	{19, "19 Египет ке стане пустиња и Едом ке стане пустиња, бидејки тие ги измачуваа синовите Јудини и проливаа невина крв во земјата нивна."},
	{20, "20 А Јуда ке живее вечно, и Ерусалим - од род во род."},
	{21, "21 Јас ке ја измијам крвта нивна, која уште не сум ја измил, и Господ ке живее на Сион."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};