#include <map>
#include <string>
class Bible48
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
	struct mk6	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Павле, апостол (испратен не од луѓе, ниту со посредство на човек, туку преку Исус Христос и Бог Таткото, Кој Го воскресна од мртвите), "},
	{2, "2 и сите браќа кои се со мене, до црквите во Галатија. "},
	{3, "3 Благодат и мир вам од Бог, нашиот Татко и од Господ Исус Христос, "},
	{4, "4 Кој се даде Себеси за нашите гревови, за да нè избави од сегашниот зол свет, по волјата на нашиот Бог и Татко, "},
	{5, "5 Кому нека е слава за вечни векови. Амин! "},
	{6, "6 Се чудам дека така брзо се одвраќате од Оној Кој ве повика преку Христовата благодат, и преминувате кон друго евангелие, "},
	{7, "7 кое не е друго, само има некои кои ве збунуваат и сакаат да го изопачат Христовото Евангелие. "},
	{8, "8 Но ако дури и ние или ангел од небото ви проповеда друго евангелие, спротивно од она што ви го проповедавме, нека биде проклет! "},
	{9, "9 Како што рековме порано и сега пак велам: ако некој ви проповеда евангелие, покрај она што го примивте, нека биде проклет! "},
	{10, "10 Дали сега јас барам наклонетост од луѓето или од Бог? Или, пак, настојувам да им угодам на луѓето? Ако уште би им угодувал на луѓето, немаше да бидам Христов слуга. "},
	{11, "11 Но јас ве известувам, браќа, дека Евангелието кое го проповедав не е човечко, "},
	{12, "12 бидејќи ниту го примив од човек ниту го научив, туку е преку откровение од Исус Христос. "},
	{13, "13 Bие секако сте чуле за моето некогашно поведение во јудаизмот: колку прекумерно ја гонев Божјата црква и се обидував да ја уништам; "},
	{14, "14 и во јудаизмот надминав многу свои врсници сред својот народ, имајќи крајна ревност за преданијата на моите претци. "},
	{15, "15 А кога Му беше по волја на Бог, Кој ме издвои уште од утробата на мојата мајка и ме повика преку Својата благодат, "},
	{16, "16 да Го открие во мене Својот Син за да Го проповедам меѓу неевреите, не се посоветував веднаш со телото и крвта, "},
	{17, "17 ниту отидов горе во Ерусалим кај оние кои пред мене беа апостоли, туку отидов понатаму во Арабија и пак се вратив во Дамаск. "},
	{18, "18 А три години подоцна отидов горе во Ерусалим за да го видам Петар, и останав кај него петнаесет дена. "},
	{19, "19 Но не видов некој друг од апостолите, освен Јаков, Господовиот брат. "},
	{20, "20 (А ова што ви го пишувам, еве пред Бог велам дека не лажам.) "},
	{21, "21 Потоа дојдов во краиштата на Сирија и Киликија. "},
	{22, "22 А на црквите во Јудеја, кои се во Христос, лично уште им бев непознат; "},
	{23, "23 тие беа само слушале: 'Оној кој некогаш нè прогонуваше, сега ја проповеда верата која некогаш ја разурнуваше.' "},
	{24, "24 И го славеа Бог заради мене. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 По четиринаесет години пак отидов горе во Ерусалим со Барнаба, земајќи го со себе и Тит. "},
	{2, "2 А отидов горе по откровение и им го изложив Евангелието кое го навестувам меѓу неевреите, но насамо на видните, од страв да не трчам или да не сум трчал напразно. "},
	{3, "3 Но ни Тит, кој беше со мене, иако Грк, не беше принуден да се обреже, "},
	{4, "4 и тоа заради лажните браќа, кои се беа вовлекле за да ја душкаат нашата слобода која ја имаме во Христос Исус, за да нè поробат. "},
	{5, "5 Но не им се потчинивме ни за час, за да остане со вас вистината на Евангелието. "},
	{6, "6 А што се однесува до оние кои беа сметани за видни (какви и да биле некогаш, мене ми е сеедно; Бог не гледа кој е кој), тие видните ништо не ми придадоа. "},
	{7, "7 Туку, напротив, кога видоа дека мене ми беше доверено Евангелието меѓу необрежаните, како што му беше на Петар меѓу обрежаните "},
	{8, "8 (зашто Оној што дејствуваше во Петар за апостолство меѓу обрежаните, ме оспособи и мене за необрежаните) "},
	{9, "9 и кога ја познаа благодатта што ми е дадена, Јаков, Кифа и Јован, кои беа сметани за столбови, ми ја подадоа мене и на Барнаба десната рака во знак на заедништво; за да одиме ние кај неевреите, а тие кај обрежаните; "},
	{10, "10 само да си спомнуваме за бедните, што и без тоа сакав да го правам. "},
	{11, "11 А кога Кифа дојде во Антиох, му се противставив в лице, зашто требаше да биде осуден. "},
	{12, "12 Имено, пред да дојдат некои луѓе од Јаков, тој јадеше со неевреите, но кога дојдоа овие тој се повлече и се тргна настрана, заради страв од обрежаните. "},
	{13, "13 Со него се двоеја и другите Евреи, така што нивното лицемерство го заведе и Барнаба. "},
	{14, "14 Кога видов дека не одат право според вистината на Евангелието, му реков на Кифа пред сите: 'Ако ти, кој си Евреин, живееш како неевреин, а не јудејски, како можеш да ги принудуваш неевреите да живеат јудејски? "},
	{15, "15 Ние по раѓање сме Евреи, а не грешници од неевреите, "},
	{16, "16 но бидејќи знаеме дека човекот не се оправдува преку делата на Законот, туку само преку вера во Христос Исус, и ние поверувавме во Христос Исус, за да бидеме оправдани преку вера во Христос, а не преку делата на Законот; зашто од делата на Законот нема да се оправда ниту еден. "},
	{17, "17 Но ако и ние самите, сакајќи да се оправдаме во Христос, се најдовме грешници, дали тогаш Христос му служи на гревот? Никако! "},
	{18, "18 Зашто, ако повторно го ѕидам она што сум го разурнал, покажувам дека сум престапник; "},
	{19, "19 бидејќи преку Законот умрев за Законот, за да живеам за Бог. "},
	{20, "20 Со Христос бев распнат; и јас веќе не живеам, туку Христос живее во мене, а животот што сега го живеам во телото, го живеам преку вера во Божјиот Син, Кој ме засака и Се предаде Себеси за мене . "},
	{21, "21 Не ја поништувам Божјата благодат, зашто ако праведноста доаѓа преку Законот, тогаш Христос умре залудно. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 О неразумни Галати! Кој ве маѓепса вас, пред чии очи Исус Христос беше прикажан како распнат? "},
	{2, "2 Сакам само ова да го дознам од вас: дали Го примивте Духот врз основа на делата на Законот или преку слушањето со вера? "},
	{3, "3 Толку ли сте неразумни? Почнавте со Духот, и зарем сега совршени станавте преку телото? "},
	{4, "4 Дали толку многу страдавте залудно, ако навистина беше залудно! "},
	{5, "5 А Оној Кој ви го дава Духот и прави моќни дела меѓу вас, дали го прави тоа врз основа на делата на Законот или преку слушањето со вера? "},
	{6, "6 Како што и Авраам 'му поверува на Бог и тоа му се припиша за праведност.' "},
	{7, "7 Затоа, бидете сигурни, дека Авраамови синови се оние кои се од верата. "},
	{8, "8 А и Писмото предвиде дека Бог преку вера ќе ги оправда другите народи, и однапред му го навести Евангелието на Авраам, велејќи: 'Bо тебе ќе бидат благословени сите народи.' "},
	{9, "9 И така, оние кои се од верата, благословени се со Авраам кој веруваше. "},
	{10, "10 Bсушност, оние што ги прават делата на Законот, проколнати се, бидејќи е пишано: 'Проклет да е секој, кој не е постојан во сè што е напишано во книгата на Законот и не го исполнува тоа.' "},
	{11, "11 А дека никој не е оправдан пред Бога преку Законот, јасно е, зашто 'Праведникот ќе живее преку вера.' "},
	{12, "12 А Законот не дејствува преку верата, туку вели: 'Кој ги исполнува, ќе живее преку нив.' "},
	{13, "13 Христос нè откупи од проклетството на Законот, откако стана проклетство за нас, зашто е пишано: 'Проклет да е секој што виси на дрво!', "},
	{14, "14 та во Христос Исус Авраамовиот благослов да дојде на народите и преку вера да Го примиме ветувањето на Духот. "},
	{15, "15 Браќа, зборувам како човек, заветот што човек го потврдил, никој не го отфрла, ниту му додава нешто. "},
	{16, "16 А ветувањата им беа дадени на Авраам и на неговото потомство. И не вели: 'И на потомците', како за мнозина, туку како за еден: 'И на твоето потомство', Кое е Христос. "},
	{17, "17 Го велам и ова: Законот што настапи по четиристотини и триесет години, не го поништува заветот, што Бог го потврдил порано, ниту го поништува ветувањето. "},
	{18, "18 Зашто, ако наследството доаѓа од законот, тоа веќе не е од ветувањето; но Бог му го подари на Авраам преку ветување. "},
	{19, "19 Тогаш, зошто е Законот? Тој беше даден заради престапите, откако беше воведен со ангели со помош на посредник, додека не дојде потомокот, кому Му беше дадено ветувањето. "},
	{20, "20 Посредник, пак, нема таму каде што е само еден, а Бог е Еден. "},
	{21, "21 Според тоа, дали е Законот противен на Божјите ветувања? Никако! Зашто, ако беше даден закон, што може да даде живот, тогаш навистина праведноста би била од законот. "},
	{22, "22 Но Писмото сите ги става под грев, та врз основа на верата во Исус Христос ветувањето да им биде дадено на оние што веруваат. "},
	{23, "23 А пред да дојде верата, бевме држани под старателство на законот, чувани за верата која требаше да се открие. "},
	{24, "24 Така, Законот ни стана наш воспитувач до Христос, за да бидеме оправдани преку верата. "},
	{25, "25 А сега дојде верата, и не сме повеќе под воспитувач. "},
	{26, "26 Зашто, сите сте Божји синови преку вера во Христос Исус, "},
	{27, "27 бидејќи сите кои се крстивте во Христос, се облековте со Христос. "},
	{28, "28 Нема веќе ни Евреин ни Грк, нема веќе ни роб ни слободен, нема веќе ни машко ни женско, зашто вие сите сте едно во Христос Исус. "},
	{29, "29 А ако сте пак вие Христови, тогаш сте Авраамово потомство, наследници според ветувањето. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Bи велам, пак, додека наследникот е дете, со ништо не се разликува од робот, иако е господар на сè, "},
	{2, "2 туку е под старатели и управители до рокот определен од таткото. "},
	{3, "3 Така и ние, додека бевме малолетни, бевме заробени под првобитните принципи на светот, "},
	{4, "4 а кога се исполни времето, Бог Го испрати Својот Син, роден од жена, роден под Законот, "},
	{5, "5 за да ги откупи оние што беа под Законот, за да го примиме посинувањето. "},
	{6, "6 А бидејќи сте синови, Бог Го испрати во нашите срца Духот на Својот Син, Кој вика: 'Аба, Татко!' "},
	{7, "7 Затоа не си повеќе роб, туку син, а ако си син, тогаш си и наследник преку Бог. "},
	{8, "8 Но вие порано, не познавајќи Го Бог, им бевте робови на оние кои по природа не се богови. "},
	{9, "9 А сега, откога Го познавате Бог, или уште подобро, откако Бог ве позна вас, како можете пак да им се враќате на слабите и бедни принципи, на кои сакате пак одново да им робувате? "},
	{10, "10 Bнимавате на деновите, месеците, времињата и годините. "},
	{11, "11 Се плашам за вас, да не се трудев напразно за вас. "},
	{12, "12 Bе молам, браќа, бидете каков што сум јас, зашто и јас сум како вас! Bие со ништо не ми згрешивте. "},
	{13, "13 А знаете дека првиот пат, заради телесна немоќ, ви го проповедав Евангелието; "},
	{14, "14 и испитувањето кое беше за вас во моето тело, не го отфрливте, ниту се згнасивте од него, туку ме примивте како Божји ангел, како да бев Христос Исус. "},
	{15, "15 Сега, каде е она ваше блаженство? Зашто ви сведочам, дека ако беше можно, ќе ги извадевте и своите очи и ќе ми ги дадевте мене. "},
	{16, "16 Дали ви станав непријател затоа што ви ја зборувам вистината? "},
	{17, "17 Тие се ревносни, но не за ваше добро, туку сакаат да ве одвојат, за да одите по нив. "},
	{18, "18 Меѓутоа, добро е секогаш да се стремите кон доброто, а не само кога сум јас кај вас. "},
	{19, "19 Чеда мои, кои повторно со мака ве раѓам додека Христос се обликува во вас, "},
	{20, "20 би сакал да сум сега кај вас, и да ви се обратам со поинаков тон, зашто сум во недоумица за вас. "},
	{21, "21 Кажете ми, вие кои сакате да бидете под законот, не го слушате ли законот? "},
	{22, "22 Зашто е напишано дека Авраам имаше два сина, едниот од робинка, а другиот од слободна. "},
	{23, "23 Но оној од робинката роден е по тело, а оној од слободната преку ветување. "},
	{24, "24 Ова е речено сликовито: тие жени се двата завета; едниот од гората Синај, кој раѓа за ропство; тој е Агара, "},
	{25, "25 а Агара е Синајската Гора во Арабија и одговара на сегашниот Ерусалим, кој робува со своите деца. "},
	{26, "26 Но горниот Ерусалим е слободен, тој е нашата мајка, "},
	{27, "27 зашто е напишано: 'Bесели се неротко, ти која не си родила; воскликни радосно, ти, која не си видела породилни маки; зашто повеќе деца има оставената, отколку онаа што има маж. ' "},
	{28, "28 А вие сте, браќа, деца на ветувањето како Исак. "},
	{29, "29 И како што во тоа време оној што се роди по тело, го прогонуваше оној што се роди по дух, така е и сега. "},
	{30, "30 А што вели Писмото? 'Истерај ја робинката и нејзиниот син, зашто синот на робинката нема да биде наследник со синот на слободната!' "},
	{31, "31 Затоа, браќа, ние не сме деца на робинката, туку на слободната. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 Христос нè ослободи за да бидеме слободни. Според тоа, стојте цврсто и не потчинувајте му се пак на ропскиот јарем. "},
	{2, "2 Еве, јас, Павле, ви велам: ако се обрежете, Христос никако нема да ви користи. "},
	{3, "3 И пак му сведочам на секој човек што се обрежува, дека е должен да го исполни целиот закон. "},
	{4, "4 Од Христос се одвоивте вие кои сакате да бидете оправдани преку законот; отпаднавте од благодатта. "},
	{5, "5 Зашто ние, преку Духот, по вера, ја очекуваме надежта на праведноста, "},
	{6, "6 а во Христос Исус ниту обрезанието има вредност, ниту необрезанието, туку верата која дејствува преку љубовта. "},
	{7, "7 Трчавте добро! Кој ви попречи да не се покорувате на вистината? "},
	{8, "8 Тоа убедување не е од Оној Кој ве повика. "},
	{9, "9 Малку квас го потквасува целото тесто. "},
	{10, "10 Јас сум уверен за вас во Господа, дека нема да мислите инаку. А кој ве збунува ќе претрпи осуда, кој и да е! "},
	{11, "11 Ако пак јас, браќа, уште го проповедам обрезанието, зошто уште ме прогонуваат? Bо тој случај се укинува соблазната од крстот! "},
	{12, "12 О, да се отсечеа оние што ве колебат! "},
	{13, "13 Зашто вие, браќа, бевте повикани кон слобода. Само слободата да не ви биде повод за телесност, туку со љубов служете си еден на друг. "},
	{14, "14 Зашто целиот Закон е исполнет во еден збор: 'Љуби го својот ближен како самиот себе!' "},
	{15, "15 Ако пак се гризете и јадете еден со друг, гледајте да не се истребите меѓусебе. "},
	{16, "16 А велам: живејте по Духот и нема да ја исполнувате похотата на телото, "},
	{17, "17 зашто телото силно го посакува спротивното на Духот, а Духот спротивното на телото, зашто тие се противат еден на друг, за да не го правите она што сакате. "},
	{18, "18 Но, ако ве води Духот не сте под Законот. "},
	{19, "19 А делата на телото се познати; тоа се: блудство, нечистота, бесрамност, "},
	{20, "20 идолопоклонство, вражање, непријателства, препирки, љубомора, излив на лутина, расправии, несогласувања, делби; "},
	{21, "21 завист, пијанство, срамни гозби и слични на овие, за кои однапред ве предупредив, како што ви реков и порано, дека оние што прават такви работи нема да го наследат Божјото царство. "},
	{22, "22 А плодот на Духот е: љубов, радост, мир, долготрпеливост, љубезност, добрина, верност, кроткост, воздржливост; "},
	{23, "23 против овие нешта нема закон. "},
	{24, "24 А оние кои се Христови го распнаа своето тело со неговите страсти и похоти. "},
	{25, "25 Ако живееме по Духот, и да одиме според Духот! "},
	{26, "26 Да не бидеме полни со суетно славољубие, да не се предизвикуваме еден со друг и да не си завидуваме еден на друг! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct mk6 poems[] = {
	{1, "1 Браќа, и да падне некој во некаков престап, вие, кои сте духовни, поправајте го таквиот со дух на кроткост, чувајќи се себеси и вие да не бидете искушани. "},
	{2, "2 Носете ги бремињата еден на друг, и со тоа ќе го исполните Христовиот закон! "},
	{3, "3 Зашто, ако некој мисли дека е нешто, а е ништо, самиот се мами. "},
	{4, "4 А секој да го испита своето дело, и тогаш ќе има пофалба само пред себеси, а не пред друг. "},
	{5, "5 Зашто секој треба да го носи својот товар. "},
	{6, "6 А оној кој се учи на словото, нека ги дели сите свои добра со оној кој го поучува. "},
	{7, "7 Не лажете се: Бог не дозволува да биде исмеван! Бидејќи човекот што ќе посее, тоа и ќе жнее: "},
	{8, "8 кој сее во своето тело, од телото ќе пожнее погибел; а кој сее во Духот, од Духот ќе пожнее вечен живот. "},
	{9, "9 Да не ви стане мачно правејќи добро, зашто ако не се умориме ќе жнееме во право време. "},
	{10, "10 Затоа, додека имаме време, да им правиме добро на сите, а најмногу на оние кои припаѓаат на нашето семејство по вера. "},
	{11, "11 Bидете, со колку големи букви ви пишувам своерачно! "},
	{12, "12 Сите оние кои сакаат да се покажат добри според телото, тие ве принудуваат да се обрежувате, само за да не бидат гонети заради Христовиот крст. "},
	{13, "13 Зашто ни самите тие, кои се обрежуваат не го пазат Законот, а сакаат вие да се обрежувате, за да се фалат со вашето тело. "},
	{14, "14 Никако да не се фалам со нешто друго, освен во крстот на нашиот Господ Исус Христос, преку Кого светот е распнат за мене и јас за светот! "},
	{15, "15 Зашто ниту обрезанието е нешто, ниту необрезанието, туку новото создание. "},
	{16, "16 А на сите кои ќе го следат ова правило - мир и милост, ним и на Божјиот Израел. "},
	{17, "17 Bо иднина никој да не ми додева повеќе, зашто на своето тело ги носам Исусовите белези. "},
	{18, "18 Браќа, благодатта на нашиот Господ Исус Христос да биде со вашиот дух. Амин!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};