#include <map>
#include <string>
class Bible21
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
	struct mk6	{ int val; const char *msg; };
	struct mk7	{ int val; const char *msg; };
	struct mk8	{ int val; const char *msg; };
	struct mk9	{ int val; const char *msg; };
	struct mk10	{ int val; const char *msg; };
	struct mk11	{ int val; const char *msg; };
	struct mk12	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Зборовите на проповедникот, син Давидов, цар ерусалимски."},
	{2, "2 Суета над суетите, вели проповедникот, суета над суетите - се е суета!"},
	{3, "3 Каква е користа за човекот од сите негови трудови, со кои се труди под сонцето?"},
	{4, "4 Род еден си заминува, и род друг доа а, а замјата си постои секогаш."},
	{5, "5 Сонцето изгрева и зао а, и пак брза кон местото свое, од каде што изгрева."},
	{6, "6 Ветрот вее кон југ и се врти кон север, се врти, се врти во својот пат и пак ги почнува своите вртења во круг."},
	{7, "7 Сите реки течат во морето, но морето не се преполнува: тие одново се вракаат кон она место, од каде што потекуваат, за да течат пак."},
	{8, "8 Секоја работа бара труд: човекот не може се да искаже; окото не се наситува од гледање, ниту увото може да се наслуша."},
	{9, "9 Она што било, пак ке биде, и она што се правело, пак ке се прави - нема ништо ново под сонцето."},
	{10, "10 Иако за нешто се рече: 'Види, ете, тоа е ново'; но тоа веке било во текот на вековите, што биле пред нас."},
	{11, "11 Нема спомен за минатото; па и за тоа, што ке биде подоцна."},
	{12, "12 Јас, проповедник, бев цар над Израилот во Ерусалим;"},
	{13, "13 и го управив срцето свое да истражувам и да испитува преку мудроста се, што станува под небото; таа тешка задача им ја даде Бог на синовите човечки, за да се занимаваат со неа."},
	{14, "14 Ги видов сите работи, што се вршат под сонцето, и ете - се е суета и мака за духот."},
	{15, "15 Кривото не може да се исправи, и она, што го нема не може да се брои."},
	{16, "16 Си велев во срцето свое: 'Еве, јас се воздигнав и се здобив со мудрост повеке од сите, што беа пред мене над Ерусалим, и срцето мое виде многу мудрост и знаење.'"},
	{17, "17 И го упарвив срцето свое да ја познае мудроста, да ги познае безумието и глупоста; но разбрав, оти и тоа е мачно за духот;"},
	{18, "18 зашто при големата мудрост големо е и страдањето, и кој умножува знаење, умножува и мака."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Си реков во срцето свое: 'Ајде ке те испитам во веселба: уживај во наслади!' Но ете, и тоа беше суета!"},
	{2, "2 На смевот му реков - лудуваш, и на веселбата - што правиш?"},
	{3, "3 Си помислив во срцето свое да го насладам телото свое со вино и, додека срцето мое се води по мудроста, да се придржувам и за глупоста се додека да видам, што е подобро за синовите човечки, што би требало да прават тие под небото во текот на малкуте денови на својот живот."},
	{4, "4 Презедов големи работи: си изградив куки, си насадив лозја,"},
	{5, "5 си уредив градини и садници и посадив таму секакви овошни дрвја;"},
	{6, "6 си направив водостои за поливање на ливадите, во кои растат дрвјата;"},
	{7, "7 придобив слуги и слугинки, имав и слуги родени во домот мој; имав и крупен и ситен добиток, повеке од сите, што беа пред мене во Ерусалим;"},
	{8, "8 насобрав сребро и залто и скапоцености од цареви и области; си доведов пеачи и пеачки и тоа, што ги насладува синовите човечки."},
	{9, "9 И така станав јас поголем и побогат од сите, што беа пред мене во Ерусалим; а и мудроста моја остана со мене."},
	{10, "10 Што и да посакаа очите мои, не им откажував, не му забравував на срцето свое никаква веселба, бидејки срцето мое се радуваше со сите мои трудови; и тоа ми беше дел од сите мои трудови."},
	{11, "11 И се обsрнав, та погледнав на сите мои дела, што ги беа извршиле моите раце, и на трудот, со кој се бев трудел, извршувајки ги: и ете - се беше суета и мака за духот, и немаше од нив полза под сонцето!"},
	{12, "12 Потоа се свртив да ги погледам мудроста, безумството и глупоста: што може да направи човек по царот, посебно од она, што е веке направено?"},
	{13, "13 И видов, дека предимството на мудроста пред глупоста е токму такво, какво што е предимството на светлината пред темнината:"},
	{14, "14 на мудриот очите му се во главата негова, а глупавиот оди во темнина; но дознав, дека крајот на сите им е еднаков."},
	{15, "15 Тогаш си реков во срцето свое: 'И мене ке ме стигне истото, како и глупавиот; Зошто толку многу сакав да станам мудар?' Па си реков во срцето свое дека и тоа е суета."},
	{16, "16 Зашто нема да го помнат мудриот вечно, како и глупавиот; по време се ке се заборави, и, мудриот умира, како и безумниот."},
	{17, "17 Тогаш го намразив животот, бидејки ми станаа одвратни работите, што се вршат под сонцето; зашто се е суета и измачување на духот."},
	{18, "18 И го намразив сето она, за кое се бев трудел под сонцето, затоа што треба да го оставам на човек, што ке дојде по мене."},
	{19, "19 И кој знае: мудар ли ке биде тој или глупав? А тој ке располага со сиот мој труд, со кој сум се трудел и со кој сум се покажал мударо под сонцето. Но и тоа е суета!"},
	{20, "20 Намислив да му внушам на срцето свое да се откаже од сиот труд, со кој се бев трудел под сонцето,"},
	{21, "21 зашто еден човек се труди мудро, со знаење и со успех, и сето тоа треба да му го предаде на човек, што не се трудел за тоа, - како да е негов дел. Па и тоа е суета и зло големо!"},
	{22, "22 Оти, што му останува на човекот од сиот негов труд и од грижата на срцето негово, што се труди под сонцето?"},
	{23, "23 Бидејки сите денови му се мачни, а трудивите негови - неспокојство; дури и ноке срцето негово не знае за мир. Ете, и тоа е суета!"},
	{24, "24 И не е ли добро за човекот да јаде, да пие и да ја насладува душата своја од својот труд. Но јас видов, оти и тоа е од Божјата рака;"},
	{25, "25 зашто, кој може да јаде, и кој може да се насладува без Бога?"},
	{26, "26 Он му дава мудрост, и разум и радост на човека, кој е добар пред лицето Негово; а на грешникот му дава грижи, - да собира и трупа, за да го предаде потоа на оној, кој е добар пред лицето Божјо! Па, ете, и тоа е суета и мака за духот!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Се има свое време, и секоја работа под небото има свое време;"},
	{2, "2 време кога ке се родиш, и време кога ке умреш; време кога садиш, и време кога го корнеш насаденото;"},
	{3, "3 време кога се убива, и време кога се лекува; време кога се урива, и време кога се гради;"},
	{4, "4 време кога се плаче, и време кога се смее; време кога се тагува, и време кога се игра;"},
	{5, "5 време кога се расфрлуваат камиња, и време кога се собраат камења; време кога се прегрнуваш, и време кога се одбегнуваат прегратки;"},
	{6, "6 време кога се добива, и време кога се губи; време кога се чува, и време кога се растура;"},
	{7, "7 време кога се раскинува, и време кога се сошива; време кога се молчи, и време кога се зборува;"},
	{8, "8 време кога се сака, и време кога се мрази; време за војна и време за мир."},
	{9, "9 Каква полза има оној што работи од она, над што се труди?"},
	{10, "10 Ги видов работите, што Бог им ги даде на синовите човечки, за да се мачат онолу нив."},
	{11, "11 Сето она што Он го направил да биде прекрасно во свое време, и го вложи во срцата нивни, но да не може човекот да ги разбере докрај делата Божји што Он ги врши од почетокот до крајот."},
	{12, "12 Разбрав, дека за нив нема ништо подобро, освен да се веселат и да прават добро во текот на животот свој."},
	{13, "13 Кога сеој човек јаде и пие, и го гледа доброто во секој свој труд, тоа е дар Божји."},
	{14, "14 Разбрав, оти се, што прави Господ, останува засекогаш; кон тоа нема што да се додава, од тоа нема што да се одзема; а Бог прави така, за да се бојат пред лицето Негово."},
	{15, "15 Она што било, тоа е и сега, и она што ке биде, тоа веке било, - зашто Бог го врака она што изминало."},
	{16, "16 И уште видов под сонцето: место закон, а таму беззаконие; место правда, а таму неправда."},
	{17, "17 И си реков во срцето свое: 'Праведниот и нечесниот Бог ке ги суди, бидејки таму има време за секоја работа и суд за секое дело.'"},
	{18, "18 Си реков во срцето свое и за синовите човечки - дека Бог ке ги испита, и Kе им покаже оти тие сами по себе се животни,"},
	{19, "19 зашто се што се случува со синовите човечки, се случува и со животните; крајот им е ист: како умираат едните, така умираат и другите, и едно е дишењето кај сите, и човекот нема предимство пред добитокот, зашто - се е суета!"},
	{20, "20 Се оди на едно место: се произлегува од земјата, и се ке се врати во земјата."},
	{21, "21 Која знае: дали духот на синовите човечки се качува горе, а духот на животните слегува долу, во земјата?"},
	{22, "22 И така, јас видов оти нема ништо подобро за човекот, освен да се насладува со делата свои, бидејки тоа е негов дел; зашто, кој ке го доведе после да го погледа она, што ке биде по него?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Се свртив и ги видов сите неправди, што стануваат под сонцето; и ете, солзите она онеправданите, и утешител немаат силата е во рацете на клеветниците, а закрилник нема."},
	{2, "2 Па си реков: блазе им на умрените, што умреле одамна, отколку на живите, што живеат досега;"},
	{3, "3 а поблажен е и од едните и од другите оној, што уште не постои, кој не ги видел лошите работи, што се вршат под сонцето."},
	{4, "4 А видов исто, дека секој труд и секој успех во работите предизвикува ме у лу ето заемна завист. Но и тоа е суета и мака за духот."},
	{5, "5 Глупавиот седи со скрстени раци и го гризе своето сопствено тело."},
	{6, "6 Подобро една рака во мир, отколку две со труд и мака во духот."},
	{7, "7 Се свртив и видов друга суета под сонцето:"},
	{8, "8 човек осамен, нема друг; нема ни син, ни брат, а пак на сите работи негови крај нема, и очите негови не можат да се наситат со богатсто. 'За кого, пак, - вели тој - се трудам и ја лишувам од добра душата своја?' - Ете, и тоа е суета и лоша работа."},
	{9, "9 Подобро им е на двајца, отколку на еден, бидејки имаат добра награда за трудот свој."},
	{10, "10 Зашто, ако паден едниот, другиот ке го крене другарот свој. Но тешко на еден, ако падне, ке нема друг, кој да го крене."},
	{11, "11 Исто, кога лежат двајца, топло им е; а еден - како ке се згрее?"},
	{12, "12 И, ако некој го надвие едниот, тоа двајца ке го навасаат, и јажето, трипати усукано, нема лесно да се скине."},
	{13, "13 Подобар е младич сиромав и умен, отколку цар - неразумен и стар, кој веке не умее да прима совети;"},
	{14, "14 зашто младичот може да излезе од темница и да стане цар, иако се родил сиромав во царството."},
	{15, "15 Ги видов сите живи, што одат под сонцето, се потпираат на младич што ке го наследи неговото место."},
	{16, "16 Број немаше сиот оној народ, што беше пред него, иако подоцнежните нема да му се радуваат. И тоа е суета и мака во духот."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 Чувај ја ногата своја, кога одиш во Божјиот дом, и биди готов повеке да слушаш, отколку да гледаш како безумните принесуваат жртви; зашто тие не знаат, оти вршат зло."},
	{2, "2 Не брзај со јазикот свој, и срцето твое да не брза да изговара зборови пред Господа; зашто Бог е на небото, а ти на земјата; затоа зборовите твои да не бидат многу."},
	{3, "3 Зашто, како што соништата доа аат при многу грижи, така и гласот на безумниот се познава од многуте зборови."},
	{4, "4 Кога даваш завет на Бога, не двоуми се да го извршиш, зашто Он не ги сака безумните: она што си ветил изврши го."},
	{5, "5 Подобро е да не ветуваш, отколку да ветиш и да не го извршиш."},
	{6, "6 Не и дозволувај на устата своја да го тера во грев телото твое и не говори пред Ангелот Божји: 'Тое е грешка!' зошто ти е да правиш така, и Бог да се разгневи на зборот твој и да го сотре делото на рацете твои?"},
	{7, "7 Зашто, како во многуте соништа, така и во многуте зборови има суета; но затоа бој се од Бога."},
	{8, "8 Ако видиш некаде на сиромав да се врши неправда и да му се одзема судот на правдата, не чуди се на тоа: зашто над високиот гледа повисок, а над нив - уште повисок;"},
	{9, "9 но од се покорисна е земјата; и царот на нивата и служи."},
	{10, "10 Кој го љуби среброто, со сребро нема да се насити, и кој сака богатство, тој нема да има корист од тоа. И тоа е суета!"},
	{11, "11 Се зголемува ли имотот - се зголемуваат и потребите негови; и каква корист за сопственикот негов: зар само да гледа со очите свои?"},
	{12, "12 Сладок е сонот за оној, кој се труди, - па јадел тој малку или многу; но прејадувањето не му дава на богатиот да заспие."},
	{13, "13 Има едно тешко зло, што сум го видел под сонцето: богатство, што се чува за зло на оној, чие е."},
	{14, "14 А тоа богатство може да се изгуби во негодно време, па на синот што го родил да не му остане ништо во рацете негови."},
	{15, "15 Како што излегол гол од мајчината утроба, така и си заминува, каков што дошол; ништо нема да земе од трудот свој, што би можел в рака да понесе."},
	{16, "16 Големо зло е тоа што оди како што дошол. Каква е, тогаш, ползата за него, кога се трудел залудо?"},
	{17, "17 А тој во текот на целиот живот јадел во темно, и многу се грижел, ожалостувал и јадосувал."},
	{18, "18 Еве уште што најдов за добро и пријатно: да јаде и да пие и да се насладува од доброто на сите свои трудови, со кои се труди под сонцето преку сите дни од животот свој, што му ги дал Бог; зашто тоа е негов дел."},
	{19, "19 И, ако на некој човек Бог му дал богатство, и имот и му дал да се ползува од нив, да го зема својот дел и да се насладува од трудовите свои, - тоа е Божји дар."},
	{20, "20 Нема долго време да ги помни тој дните на животот свој; затоа Бог и го наградува со радоста на срцето."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct mk6 poems[] = {
	{1, "1 Има едно зло, што го видов под сонцето, и често е ме у лу ето:"},
	{2, "2 Бог му дава на човекот богатство, имот и слава, и за душата негова нема скудности во ништо, шти и да посака; но Бог не му дава нему да се ползува од тоа, туку се ползува од него друг човек: тоа е суета и тешко зло!"},
	{3, "3 Ако некој изнароди сто синови, проживее многу години и уште му се зголемат дните на животот негов, а душата негова не се насладила на добро, та за него ке нема дури ни погреб, подобро му е, велам, на недоносенче отколку нему,"},
	{4, "4 зашто залудо дошле и отишле во темнина, и името му е покриено со мрак."},
	{5, "5 Тое дури и не го видело и не го познало сонцето: но поспокојно е од оној."},
	{6, "6 А оној, макар и да проживеал и две иљади години, без наслада од добрата, нема ли да појде се на исто место?"},
	{7, "7 Сиот труд на човекот е за устата негова, но душата негова не може да се насити."},
	{8, "8 А каква предност има умниот пред безумниот, каква - сиромавиот, кој умее да се однесува пред лу ето?"},
	{9, "9 Подобро е да гледаш со очи, отколку да посакуваш со душата. И тоа е суета и мака за духот."},
	{10, "10 Она што постои, тоа е веке наречено со име, и се знае, дека е тоа - човекот, и дека тој не може да се препира со оној, што е посилен од него."},
	{11, "11 Има многу такви работи, што ја зголемуваат суетата: тогаш што е за човекот подобро?"},
	{12, "12 Зашто, кој знае што е добро за човекот во животот, во текот на сите дни на неговиот суетен живот, што тој ги поминува како сенка? И кој ке му каже на човекот, што ке стане по него под сонцето?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct mk7 poems[] = {
	{1, "1 Подобро е добар глас, отколку скапоцен елеј, и смртниот ден - од родениот ден."},
	{2, "2 Подобро е да одиш во кука каде што плачат по умрен, отколку да отидеш во кука, каде што се гоштева, зашто таков е крајот на секој чпвек, и животот ке го приложи тоа кон срцето свое."},
	{3, "3 Тагата е подобра од смеата; зашто, кога е лицето нажалено, срцето станува подобро."},
	{4, "4 на умните срцето им е во куката, каде што плачат, а на безумните во кука, каде што се веселат."},
	{5, "5 Подобро е да слушаш прекор од мудар, отколку да слушаш песни на безумен;"},
	{6, "6 зашто смеата на безумните е како прскање на трње под котел. И тоа е суета!"},
	{7, "7 Клеветењето го избезумува мудриот, а подароците го расипуваат срцето."},
	{8, "8 Крајот на една работа и подобар од почетокот нејзин; трпеливиот е подобар од горделивиот."},
	{9, "9 Не станувај со духот свој брз на гнев, зашто гневот почива во пазувите на безумните."},
	{10, "10 Не вели: 'Зошто поранешните дни биле подобри од сегашните?', оти не е мудро да прашуваш за тоа."},
	{11, "11 Добра е мудроста, како и наследството, особено за оние, што го гледаат сонцето,"},
	{12, "12 зашто под нејзината сенка е исто, како под сенката на сребро; но предимството за знаење е тоа, што мудроста му дава живот на оној, што ја има."},
	{13, "13 Погледај ги Божјите дела: кој може да го исправи она, што Бог го направил криво?"},
	{14, "14 Во добро време ползувај се со доброто, а во зли дни размислувај: едното и другото го направил Бог, за да не може човекот да каже ништо против Него."},
	{15, "15 Се нагледав на се во моите суетни дни: праведниот загинува во својата праведност; нечесниот живее долго во нечесноста своја."},
	{16, "16 не бивај строг и немој да се покажуваш за многу умен, за да ен с4е избезумиш."},
	{17, "17 Не се предавај на грев и не станувај жесток; зошто да умреш предвреме?"},
	{18, "18 Добро е, ако се држиш за едното но и друго да не испушташ од раката своја; зашто, кој се бои од Бога, ке се избави од сето тоа."},
	{19, "19 Мудроста го крепи мудриот повеке од десет кнезови што се во градот."},
	{20, "20 Нема праведник на земјата, кој прави добро и никако да не греши;"},
	{21, "21 затоа не обрнувај внимание на секој збор, што се кажува, за да не го чуеш и слугата свој, кога те навредува;"},
	{22, "22 зашто срцето твое знае многу работи, кога и ти самиот си навредувал други."},
	{23, "23 Сето тоа го испитав со мудрост; јас реков: 'Kе бидам мудар', но мудроста е далеку од мене."},
	{24, "24 А она што е така далеку и многу длабоко: кој ке го испита?"},
	{25, "25 Се свртив со срцето свое, за да ги дознаам, изучам и истражам мудроста и разумот, и да го познаам безумието на нечестивиот, и жестокоста и лукавството,"},
	{26, "26 и најдов, дека погорчливо до смртта е жената, зашто таа е мрежа, срцето нејзино - стапица, рацете најзини - окови; добриот пред Бога ке се спаси од неа, а грешникот ке биде уловен од неа."},
	{27, "27 'Ете, тоа најдов јас - рече Проповедникот - испитувајки едно по друго.'"},
	{28, "28 Што уште бараше душата моја, и не го најде? - Маж најдов еден на иљада, но жена ме у сите нив не најдов."},
	{29, "29 Само, ете, тоа го најдов, дека Бог го прави човекот добар, но лу ето се впуштаат во многу мудрувања."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct mk8 poems[] = {
	{1, "1 Кој е како мудриот, и кој го разбира значењето на работите? Мудроста на човек му го просветлува лицето негово, и строгоста на лицето негово се изменува."},
	{2, "2 Јас ти велам: пази го царскиот збор, и тоа - поради клетвата пред Бога."},
	{3, "3 Не брзај да бегаш од лицето негово и не биди тврдоглав во лошите работи; зашто, тој што ке посака, се може да направи."},
	{4, "4 Каде што е зборот на царот, таму е и власта; и кој ке му каже: 'Што правиш?'"},
	{5, "5 Кој пази заповед, тој не доживува никакво зло: срцето на мудриот знае и време и наредба;"},
	{6, "6 зашто за секоја работа има свое време и свој суд; а човека го обвинува неговото недело,"},
	{7, "7 зашто не знае, што ке биде и како ке биде тоа - кој ке му каже?"},
	{8, "8 Ниеден човек нема власт над духот, за да го подржи духот, и нема власт над смртниот ден, нема избавување во таа работа, ни нечесниота нема да го спаси нечесниот."},
	{9, "9 Сето тоа го видов, и го свртувам срцето свое кон секоја работа, што се врши под сонцето. Понекогаш човекот господари над човек на своја штета."},
	{10, "10 Видов тогаш како погребуваат нечесни, и оние што доа аа од своето место беа пофалени во градот, што така постапија. И тоа е суета!"},
	{11, "11 Бидејки не се врши суд над лоши работи, затоа не се плаши срцето на синовите човечки од прави зло."},
	{12, "12 Иако некој грешник врши стопати зло, судот му се одолжува; но јас знам, дека ке им биде добро само на оние, што се бојат од Бога, кои имаат страв пред лицето Негово;"},
	{13, "13 а за нечесниот нема да има добро, и како сенка, само кратко време, ке преуспее оној, кој не се плаши пред Бога."},
	{14, "14 Има и таква суета на земјата: праведните ги постигнува она, што би ги заслужиле делата на нечесните, а со нечесните станува она, што би го заслужиле делата на праведните. А јас си реков: и тоа е суета!"},
	{15, "15 И ја пофалив јас веселбата; зашто нема подобро за човекот под сонцето, освен да јаде, да пие и да се весели: тоа го придружува човекот во трудовите негови преку дните на животот негов, што му го дал Бог под сонцето."},
	{16, "16 Кога го управив срцето свое кон тоа, да постигнам мудрост и да ги разгледам работите, што се вршат на земјата, така што на човекот да не му доа а сон ни дење ни ноке, -"},
	{17, "17 тогаш ги видов сите дела Божји и најдов, оти човекот не може да ги сфати работите, што се вршат под сонцето. Колку и да се труди човекот да ги испитува, пак нема да го постигне тоа."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct mk9 poems[] = {
	{1, "1 И сево ова го ставив во срцето свое, за да испитам, дека праведниците и мудреците и нивните дела се во рацете Божји, и дека човекот не знае ни за љубов, ни за омраза во сето тоа, што е пред него."},
	{2, "2 За секој и за сите е едно: една судбина за праведен и неправеден, за добар и лош, за чист и нечист, како и оној кој принесува жртви и за оној кој не принесува; како и за добар, така и за грешник; како и за оној што се колне, така и за оној што се бои од клетва."},
	{3, "3 Токму тоа е најлошо од се, што се врши под сонцето, дека еден е крајот за сите, па затоа срцето на синовите човечки е полно со зло, и безумие има во срцето нивно додека се живи; а потоа тие умираат."},
	{4, "4 Кој е ме у живите, има уште надеж, бидејки и куче живо е подобро, отколку мртов лав."},
	{5, "5 Живите знаат, дека ке умрат, а мртвите ништо не знаат, и веке за нив нема награда, зашто и споменот за нив е предаден на заборавот,"},
	{6, "6 и љубовта нивна, и омразата нивна и љубомората нивна веке исчезнале, и ке немаат дел довека во ништо, што станува под сонцето."},
	{7, "7 И така, оди, јади го радосно лебот свој и пиј го со радосно срце виното свое, што Бог има наклоност кон твоите дела."},
	{8, "8 Во секое време облеката да ти биде светла, и секогаш да има елеј на главата твоја."},
	{9, "9 Во сите дни на својот суетен живот насладувај се од животот заедно со жената, која ја сакаш, и кој ти ја дал Бог под сонцето за сите твои суетни дни; зашто, тоа е твој дел во животот и во твоите трудови, со кое се трудиш под сонцето."},
	{10, "10 Се, што може да врши раката твоја, според силите свои, врши; зашто во гробот, каде што ке појдеш, нема ни работа, ни размислување, ни знаење, ни мудрост."},
	{11, "11 И пак видов под сонцето дека на брзите не им е до трчање, ниту на храбрите до борба, ниту на мудрите до леб, ниту на разумните - богатсто, ниту на искусните благонаклоност, но времето и прликите им помагаат на сите нив."},
	{12, "12 Зашто човек не си го знае времето. Како што рибите налетуваат во погубна мрежа, и како што птиците се заплеткуваат во примки, така и синовите човечки се уловуваат во тешко време, кога тоа неочекувано ке дојде за нив."},
	{13, "13 Еве уште каква мудрост видов под сонцето, и таа ми се причини голема:"},
	{14, "14 мал град и во него малку лу е; дојде против него голем цар, го опколи и почна против него да прави голем окопи;"},
	{15, "15 но во него се најде човек сиромав, но умен, и тој со својата мудрост го спаси тој град; и при сето тоа никој не се сети за тој сиромав."},
	{16, "16 И јас си реков: мудроста е подобра од силата, и при сето тоа што мудроста на сиромавиот се пренебрегнува, и зборовите негови не се слушаат."},
	{17, "17 Зборовите на мудреци, искажани спокојно, се ислушуваат подобро, отколку викањето на оној што заповеда."},
	{18, "18 Мудроста е подобра од воено оружје; но оној којшто ке згреши, расипува многу добро работи."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct mk10 poems[] = {
	{1, "1 Мртвите муви го расипуваат и го усмрдуваат благопријатното масло на мироварец: истото го прави една мала глупост на уважуван човек за неговата мудрост и чест."},
	{2, "2 Срцето на мудриот е десно, а срцето на глупавиот - лево."},
	{3, "3 По каков и да било пат да оди глупавиот, кај него секогаш недостига смисла, и пред секого тој ке се покажува дека е безумен."},
	{4, "4 Ако гневот на оној што владее избувне врз тебе, не напуштај го местото свое, зашто кроткоста избришува и големи грешки."},
	{5, "5 Има зло што сум го видел под сонцето, како грешка што доа а од владетелот;"},
	{6, "6 неукоста се поставува на голема височина, а богатите седат ниско."},
	{7, "7 Сум видел слуги на коњи, а кнезови да одат пешки како слуги."},
	{8, "8 Кој копа јама, сам ке падне во неа, и кој соборува ограда, змија ке го касне."},
	{9, "9 Кој крева камења, може да се шине, и кој цепи дрва, може да се изложи на опасност од нив."},
	{10, "10 Ако отапи секирата, и ако сечилото нејзино не биде наострено, ке треба повеке сила; мудроста знае тоа подобро да го направи."},
	{11, "11 Ако змија казне пред да се улови, тогаш за оној што ја лови нема полза."},
	{12, "12 Зборовите од уста на мудрец се благодат, а устата на безумниот самиот него го погубува:"},
	{13, "13 првите зборови од устата му се глупост, а крајот на речта на устата негова - лошо безумие."},
	{14, "14 Глупавиот зборува многу, а човекот и не знае што ке биде; та и кој ке му каже, што ке биде по него?"},
	{15, "15 Трудот на глупавиот го изморува, зашто не го знае дури ни патот за во градот."},
	{16, "16 Тешко тебе, земјо, кога царот твој е дете, и кога кнезовите твои јадат рано!"},
	{17, "17 Блазе тебе, земјо, кога царот ти е од род благороден, и кнезовите твои јадат навреме, за поткрепа, а не за преситување!"},
	{18, "18 Од мрзливост ке нависне таванот, и кога ке се скрстат рацете, покривот ке прокапе."},
	{19, "19 Гоштевања се приредуваат заради наслада и виното го весели животот; а се прави среброто."},
	{20, "20 Дури и во мислите свои не го навредувај царот, и во спалната своја не го навредувај богатиот; зашто небесната птица може да го пренесе твојот збор, и се што има криља ке го соопшти твојот збор."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct mk11 poems[] = {
	{1, "1 Пуштај го лебот свој по водите, зашто по многу дни пак ке го најдеш."},
	{2, "2 Давај дел на седум душ, и дури на осум, зашто не знаеш, какво зло ке настане на земјата."},
	{3, "3 Кога ке се наполнат обалците, излеваат дожд на земјата; и ако едно дрво падне кој југ или кон север, тоа си останува таму, каде што и паднало."},
	{4, "4 Кој го набљудува ветрот, нема да сее, и кој гледа во облаците, нема да жнее."},
	{5, "5 Како што не ги знаеш патиштата на ветрот, ниту како настануваат коските во утробата на бремена жена, така не можеш да ги знаеш ни делата на Бога, Кој создава се."},
	{6, "6 Исутрина сеј го семето и навечер нека ти мируваат рацете твои, зашто не знаеш, едното, или другото повеке ке успее, или едното и другото ке бидат еднакво добри."},
	{7, "7 Слатка е светлината, и пријатно е за очите да гледаш сонце."},
	{8, "8 Ако човек проживее и многу години, нека се весели во текот на сите нив и нека си спомнува за темните дни, какви што ке ги има многу: но се што ке биде, ке биде суета!"},
	{9, "9 Весели се во малдоста своја, момче, и срцето твое да вкусува радост во дните на твојата младост; и оди каде што срцето те влече и каде што очите ти гледаат; само знај, дека за сето тоа Бог ке те изведе на суд."},
	{10, "10 Гони ја скрбта од срцето свое и отстранувај го злото од телото свое, зашто детството и младоста се суета!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct mk12 poems[] = {
	{1, "1 И спомнувај си за твојот Творец во дните на младоста своја, додека не дошле тешки денови не настанале години, за кои ке речеш: 'Не ми се мили;'"},
	{2, "2 додека сонцето и светлината на месечината и на sвездите не потемнеле, и не дошле пак црни облаци по дождот;"},
	{3, "3 додека не настапил оној ден, кога кукните стражари ке затреперат, и силни мажи ке се подгрбават, кога воденичките ке престанат да мелат, бидејки останале малку; кога ке се помрачат оние, што гледаат низ прозорец;"},
	{4, "4 кога портата ке почне да се затвора; кога ке молкне шумот на оние што мелат, и кога човек ке почне да станува на птичји глас, и керките - пеачки ке замолкнат;"},
	{5, "5 кога висините за нив ке бидат страшни, и по патот ке има ужаси; кога ке процути бадемот, и скакулецот ке стане тежот, и желбата ке помине; зашто човекот заменува во вечниот дом свој, и тажачките се готови да го опкружуваат по улица;"},
	{6, "6 додека не се скине конецот сребрен, и не се скрши златната чаша, и не се растури ведрото при изворот, и не падне тркалото на бунарот."},
	{7, "7 И ке се врати правот во земјата, како што си бил; а духот ке се врати кај Бога, Кој го дал."},
	{8, "8 Суета над суетите, вели проповедникот, се е суета!"},
	{9, "9 Проповедникот не само што беше мудар, туку и го учеше народот на мудрост. Тој се испитуваше, изучуваше и остави многу мудри паримии."},
	{10, "10 Проповедникот се трудеше да најде убави изреки и точно ги запиша зборовите на вистината."},
	{11, "11 Зборовите на мудреците се како острени, и како забиени клинци; зборовите на оние што ги напишаа, дадени се од единствениот Пастир."},
	{12, "12 А освен сето тоа, синко, пази се и од ова: да пишуваш многу книги - тоа нема крај, а да читаш многу - и тоа е заморно за телото."},
	{13, "13 А суштината на се е: бој се од Бога и пази ги неговите заповеди, зашто сето тоа е за човекот;"},
	{14, "14 оти Бог ке изведе на суд секоја работа и што е тајно, било да е добро или лошо."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};