#include <map>
#include <string>
class Bible37
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Во втората година на царот Дарија, во шестиот месец, на првиот ден во месецот, би слово Господово преку пророкот Агеј до Зоровавела, синот на Салатиила, управител на Јудеја, и до Исуса, синот Јоседеков, првосвештеникот."},
	{2, "2 Вака вели Господ Саваот: 'Овој народ говори: Уште не е дојдено времето, не е време сега да се гради дом Господен.'"},
	{3, "3 И би слово Господово преку пророкот Агеј, велејки:"},
	{4, "4 'А за вас време ли е да живеете во своите украсени домови, кога е Светилиштето запустено?'"},
	{5, "5 Затоа сега вака вели Господ Саваот: 'Свртете го срцето ваше врз вашите патишта."},
	{6, "6 Вие сеете многу а собирате малку; јадете, а не се заситувате; пиете, а не се напивате; се облекувате, но не се стоплувате; оној што печали пари, ги става во дупнато кесе.'"},
	{7, "7 Така вели Господ Саваот: 'Свртете го срцето ваше кон патиштата свои."},
	{8, "8 Качете се на планината, донесете дрва и градете го храмот, и тоа ке Ми биде угодно, па ке се прославувам, вели Господ."},
	{9, "9 Мислите многу, а излегува малку, и што ке внесете дома, тоа Јас го раздувувам. Зошто? - вели Господ Саваот: Затоа што е домот Мој запустен, а вие пак трчате кон домот свој."},
	{10, "10 Па поради тоа небото се затвори и не ви дава роса и земјата не ви дава плодови."},
	{11, "11 Затоа повикав суша врз земјата, врз горите, врз житото, врз гроздовите, врз елејот и врз се што се ра а од земјата, и врз човекот и врз добитокот, и врз секој ваш рачен труд.'"},
	{12, "12 И Зоровавел, Салатииловиот син, и Исус, синот на Јоседека, и сиот друг народ го послуша гласот на Господа, својот Бог, а и зборовите на пророкот Агеј, како гласник на нивниот Господ Бог, и народот се подуплаши од Господа."},
	{13, "13 Тогаш Агеј, гласникот Господов, испратен од Господа, му рече на народот: 'Јас сум со вас' - вели Господ."},
	{14, "14 И Господ го подигна духот на Зоровавела, синот Салатиилов, управителот на Јудеја, духот на Исуса, синот Јоседеков, првосвештеникот, и духот на сиот друг народ - и тие дојдоа и почнаа да го градат домот на Господа Саваот, својот Бог;"},
	{15, "15 а тоа стана во дваесет и четвртиот ден од шестиот месец, во втората година на царот Дариј."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Во седмиот месец, на дваесет и првиот ден од месецот, би слово Господово преку пророкот Агеј:"},
	{2, "2 'Кажи им сега на Зоровавела, синот Салатиилов, управителот на Јудеја, и на Исуса, Јоседековиот син, првосвештеникот, и на другиот народ:"},
	{3, "3 ‘Кој од вас останал што го видел овој храм во неговата поранешна слава, а како вие сега го гледате овој? Не е ли овој како ништо во вашите очи?"},
	{4, "4 Но охрабри се сега, Зоровавеле, - вели Господ - ободри се, Исусе, сине Јоседеков, првосвештенику, охрабрете се сите народи овде - вели Господ - и работете, зашто Јас сум со вас', вели Господ Саваот."},
	{5, "5 'Мојот завет, што го склучив со вас, кога излеговте од Египет, и Мојот Дух ке биде ме у вас: не плашете се!'"},
	{6, "6 Оти вака вели Господ Саваот - уште еднаш - и ете, скоро ке се случи тоа - ке ги затресам небото и земјата, морето и сувото;"},
	{7, "7 Kе ги стресам сите народи - и ке дојде Оној, Кого Го бараат сите народи и ке се исполни овој Дом со слава', вели Господ Саваот."},
	{8, "8 'Среброто е Мое и златото е Мое' - вели Господ Саваот."},
	{9, "9 'Славата на овој последен храм ке биде поголема отколку на поранешниот - вели Господ Саваот; и на ова место ке му дадам мир', вели Господ Саваот."},
	{10, "10 На дваесет и четвртиот ден од деветтиот месец, во втората година на Дарија, би слово Господово преку пророкот Агеј:"},
	{11, "11 'Вака вели Господ Саваот - прашај ги свештениците за Законот и кажи -"},
	{12, "12 'ако некој би носел осветено месо во полата од облеката своја, и со полата би се допрел до леб, или до нешто варено или до вино, или до елеј, или до што годе друго јадење, дали би се осветило тоа?' Одговорија свештениците и рекоа: ‘не.‘"},
	{13, "13 Потоа пак рече Агеј: 'Ако некој нечист од мртовец би се допрел до тоа, дали би станало тоа нечисто?' Одговорија свештениците и рекоа - ‘ке стане нечисто.‘"},
	{14, "14 Тогаш рече Агеј - таков е и овој народ, такво е и ова племе пред Мене, вели Господ, и такви се сите дела на рацете негови! Па што и да принесувате, се ке биде нечисто."},
	{15, "15 А сега свртете го срцето на времето од овој ден наназад, кога уште не беше положен камен на камен во овој храм Господен."},
	{16, "16 Порано, доа але до крстина, што дава до дваесет мери и, ке се добиеле само десет; и до каца од педесет мери, а таа давала само дваесет мери."},
	{17, "17 Ве поразував со гламја и со млечка по житата и со град во сите работи на рацете ваши, но вие не се обрнавте кон Мене, вели Господ."},
	{18, "18 Свртете ги срцата ваши на времето од денес и наназад, од дваесет и четвртиот ден во овој деветти месец, од денот кога беше основан храмот Господен; обрнете ги срцата ваши:"},
	{19, "19 Има ли уште во житниците семе? Досега ни лозата, ни смоквата, ни нарот, ни маслината не даваа плод; а од денес Јас ги благословувам."},
	{20, "20 И би слово Господово до пророкот Агеј по вторпат на дваесет и четвртиот ден од месецот, и беше речено:"},
	{21, "21 'Кажи му на Зоровавела, управителот на Јудеја: ке го затресам небото и земјата;"},
	{22, "22 ке урнам престоли на царства незнабожечки, ке превртам бојни коли и оние што ке седнат во нив, и кутнати ке бидат и коњите и коњаниците нивни ке паднат, еден од мечот на другиот."},
	{23, "23 Во тој ден, вели Господ Саваот, ке те земам, Зоровавеле, сине Салтиилов, слуго Мој, вели Господ, и ке те држам како печат, бидејки те избрав.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};