#include <map>
#include <string>
class Bible54
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
	struct mk6	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Павле, апостол на Христос Исус по заповедта на Бог, нашиот Спасител, и на Христос Исус, нашата надеж, "},
	{2, "2 до Тимотеј, вистинското чедо во верата. Благодат, милост и мир од Бог Таткото и Христос Исус, нашиот Господ. "},
	{3, "3 Како што те молев, кога заминав за Македонија, да останеш во Ефес за да им заповедаш на некои да не поучуваат поинаку "},
	{4, "4 и да не се занимаваат со сказни и со бесконечни родословја кои повеќе поттикнуваат расправии, отколку што водат кон претставување на Божјото устројство, кое е по вера. "},
	{5, "5 А целта на нашето укажување е: љубов од чисто срце, добра совест и нелицемерна вера, "},
	{6, "6 од што некои скршнаа во празни разговори, "},
	{7, "7 сакајќи да бидат учители на законот, иако не го разбираат ни она што го зборуваат, ни она што упорно го тврдат. "},
	{8, "8 Ние, пак, знаеме дека законот е добар, ако некој го применува законски, "},
	{9, "9 знаејќи го ова дека законот не е воспоставен за праведникот, туку за беззакониците и непокорните, за безбожниците и грешниците, за несветите и нечистите, за оние кои ги убиваат своите татковци или мајки, за убијците; "},
	{10, "10 за блудниците и за полово изопачените, за отимачите на луѓе, за лажливците, за кривоклетниците и за сè друго што му е противно на здравото учење, "},
	{11, "11 според славното Евангелие на благословениот Бог, кое ми беше доверено. "},
	{12, "12 Му благодарам на Христос Исус, нашиот Господ, Кој ми даде сила за тоа, зашто ме сметаше верен и ме постави во службата, "},
	{13, "13 мене, кој порано бев хулител, и гонител, и насилник. Но ми се укажа милост, зашто го правев тоа од незнаење и неверување. "},
	{14, "14 А благодатта на нашиот Господ, преизобилуваше со верата и љубовта во Христос Исус. "},
	{15, "15 Bеродостојно е словото и достојно за целосно примање дека Христос Исус дојде во светот да ги спаси грешниците, од кои прв сум јас. "},
	{16, "16 И токму затоа добив милост, за да ја покаже Христос Исус, прво во мене, сета своја трпеливост, за пример на оние кои ќе поверуваат во Него за вечен живот. "},
	{17, "17 На Царот кој е вечен, бесмртен, невидлив, на единствениот Бог - чест и слава во сите векови. Амин! "},
	{18, "18 Оваа заповед ти ја предавам, чедо Тимотее, според поранешните пророштва за тебе: за преку нив да ја војуваш добрата битка, "},
	{19, "19 имајќи вера и добра совест, кои некои ги отфрлија и претрпеа бродолом во верата. "},
	{20, "20 Меѓу нив се Хименеј и Александар, кои ги предадов на сатаната за да научат да не хулат. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Затоа, молам, пред сè да се упатуваат молби, молитви, застапувања, благодарности за сите луѓе, "},
	{2, "2 за царевите и за сите кои се на власт, за да можеме да водиме спокоен и мирен живот во сета побожност и сериозност. "},
	{3, "3 Ова е добро и угодно пред Бог, нашиот Спасител, "},
	{4, "4 Кој сака сите луѓе да бидат спасени и да дојдат до целосното познавање на вистината. "},
	{5, "5 Зашто еден е Бог, и еден е Посредникот меѓу Бог и луѓето - човекот Христос Исус, "},
	{6, "6 Кој се даде Себеси како откуп за сите, за сведоштво во вистинско време. "},
	{7, "7 Поради тоа јас бев поставен за гласник, апостол (вистина велам, не лажам) и за учител на неевреите во верата и вистината. "},
	{8, "8 Затоа, сакам мажите да се молат на секое место, подигајќи ги светите раце, без гнев и двоумење. "},
	{9, "9 Исто така и жените да се украсуваат со пристојна облека, скромно и невпечатливо, не со плетенки и злато, со бисери или со скапоцени облеки, "},
	{10, "10 туку со добри дела, како што им прилега на жените кои тврдат дека се побожни. "},
	{11, "11 Жената нека се поучува во смиреност и во целосна покорност ! "},
	{12, "12 А на жената не и дозволувам да поучува, ниту да господари над мажот, туку да биде смирена. "},
	{13, "13 Зашто, прво беше создаден Адам, а потоа Ева. "},
	{14, "14 И Адам не беше измамен, туку жената откако беше измамена, падна во престап. "},
	{15, "15 Но таа ќе биде спасена преку раѓање деца, ако останат во верата, љубовта и во светоста со трезвеност. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Bеродостојно е словото: кој сака надзорништво, добра работа посакува. "},
	{2, "2 Според тоа, надзорникот треба да биде: непорочен, маж на една жена, умерен, разумен, уреден, гостољубив, способен да поучува; "},
	{3, "3 не пијаница или жесток, туку трпелив, не наклонет кон расправии, не среброљубец, "},
	{4, "4 кој управува добро со својот дом и има покорни деца со сета сериозност "},
	{5, "5 (зашто ако не знае да управува со својот дом, како ќе се грижи за Божјата црква?), "},
	{6, "6 да не е новообратен за да не се возгордее и да падне во осудата како ѓаволот! "},
	{7, "7 А треба да има и добар углед пред надворешните, за да не биде прекоруван и да падне во стапицата на ѓаволот. "},
	{8, "8 Исто така, ѓаконите треба да бидат сериозни , не двојазични, да не сакаат многу вино или да се склони кон нечесна печалба, "},
	{9, "9 туку такви кои со чиста совест ја пазат тајната на верата. "},
	{10, "10 И првин да бидат проверени, а после да ја вршат службата ако се непорочни. "},
	{11, "11 Исто така жените треба да бидат сериозни, да не клеветат, трезвени и верни во сè. "},
	{12, "12 Ѓаконите да бидат мажи на една жена и да управуваат добро со своите деца и со своите домови, "},
	{13, "13 зашто оние ѓакони кои ја извршиле добро својата служба, добиваат почесно место и голема смелост во верата во Христос Исус. "},
	{14, "14 Ова ти го пишувам надевајќи се дека набргу, ќе дојдам кај тебе; "},
	{15, "15 но во случај да се подзабавам, знај какво треба да биде поведението во Божјиот Дом, кој е црквата на живиот Бог, столб и потпора на вистината. "},
	{16, "16 А според општото признание, голема е тајната на побожноста: Оној Кој се јави во тело, беше оправдан во Духот, виден од ангелите, беше навестуван меѓу народите, поверуван во светот и вознесен во слава. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 А Духот јасно вели дека во подоцнежните времиња некои ќе отпаднат од верата и ќе слушаат измамливи духови и демонски учења, "},
	{2, "2 преку лицемерството на лажливци кои се жегосани во својата совест, "},
	{3, "3 кои забрануваат стапување во брак и бараат воздржување од храна, што Бог ја создал за да ја земаат со благодарност оние кои веруваат, кои ја знаат вистината. "},
	{4, "4 Зашто сè што е создадено од Бог добро е, и ништо не треба да се отфрла ако се прима со благодарност, "},
	{5, "5 зашто се осветува преку Божјото слово и молитва. "},
	{6, "6 Ако им укажуваш за ова на браќата, ќе бидеш добар служител на Христос Исус, и хранет со зборовите на верата и на здравото учење што го следиш. "},
	{7, "7 Избегнувај од нечисти и бапски приказни и обучувај се во побожност, "},
	{8, "8 зашто телесната обука е малку полезна, а побожноста е полезна за сè, зашто има ветување за сегашниот и идниот живот. "},
	{9, "9 Тоа е веродостојно слово и достојно за целосно примање. "},
	{10, "10 Затоа ние се трудиме и се бориме, зашто нашата надеж сме ја устремиле кон живиот Бог, Кој е Спасителот на сите луѓе, а особено на верните. "},
	{11, "11 Порачувај го и поучувај го ова! "},
	{12, "12 Никој да не те презира заради твојата младост, туку, биди им пример на верните во говорот, во поведението, во љубовта, во верата и во чистотата! "},
	{13, "13 Додека дојдам внимавај на читањето на словото, на опоменувањето и на поучувањето! "},
	{14, "14 Не занемарувај го духовниот дар кој е во тебе, кој ти е даден преку пророштво, со ракополагање од старешините. "},
	{15, "15 Размислувај за тоа и биди во тоа, та твојот напредок да им биде видлив на сите! "},
	{16, "16 Bнимавај на себеси и на учењето! Истрај во него, зашто правејќи го ова ќе се спасиш и себеси и оние кои те слушаат. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 Не прекорувај строго постар човек, туку опоменувај го како татко, а помладите како браќа, "},
	{2, "2 старите жени како мајки, а помладите како сестри, со целосна чистота. "},
	{3, "3 Почитувај ги вдовиците - оние кои се навистина вдовици. "},
	{4, "4 Ако некоја вдовица има деца или внуци, тие прво нека научат да покажат побожност спрема своето семејство, и да им го возвраќаат нужното почитување на своите родители, зашто тоа е добро и угодно пред Бог. "},
	{5, "5 А вистинска вдовица е онаа која останала сосема сама, се надева во Бога и е постојана деноноќно во молби и молитви. "},
	{6, "6 А онаа која живее распуштено, уште жива, е мртва. "},
	{7, "7 Пренеси го и ова: да бидат непорочни. "},
	{8, "8 Ако некој не се грижи за своите, особено за домашните, тој се откажал од верата и е полош од неверник. "},
	{9, "9 Bо списокот на вдовиците да се запишува само таква вдовица која не е помлада од шеесет години, која била жена на еден маж, "},
	{10, "10 која има сведоштво за добри дела, ако одгледала деца, ако била гостољубива спрема туѓинци, ако им миела нозе на светии, ако им помагала на страдалници и ако се посветила на секое добро дело. "},
	{11, "11 А помлади вдовици не примај, зашто кога ќе ги привлече насладата, спротивно на Христос, сакаат да се мажат, "},
	{12, "12 со што навлекуваат врз себе осуда, зашто отстапиле од првиот завет. "},
	{13, "13 А освен тоа, бидејќи се без работа, свикнуваат да одат по куќите. И не само без работа, туку се и зборлести и љубопитни, и зборуваат што не треба. "},
	{14, "14 Затоа, сакам младите вдовици да се мажат, да раѓаат деца, да бидат домаќинки, за да не му даваат на противникот никаков повод за прекорување. "},
	{15, "15 Имено, некои веќе скршнале и тргнале по сатаната. "},
	{16, "16 Ако некоја верна жена има роднини вдовици, нека ги помага, за да не биде оптоварена црквата, та да може да им помага на оние кои се вистински вдовици. "},
	{17, "17 На старешините кои добро управуваат, треба да им се укажува двојна чест, особено на оние кои се трудат во проповедање и поучување. "},
	{18, "18 Зашто Писмото вели: 'Не врзувај му ја устата на волот што врши;' и: 'Работникот ја заслужува својата заработка.' "},
	{19, "19 Не примај обвинение против старешина, освен по изјава на двајца или тројца сведоци. "},
	{20, "20 Оние кои грешат укори ги пред сите, за останатите да имаат страв. "},
	{21, "21 Те заколнувам пред Бог, пред Христос Исус и пред избраните ангели, да го чуваш ова без предрасуди и да не правиш ништо со пристрасност ! "},
	{22, "22 Не полагај раце пребрзо на никого и не учествувај во туѓи гревови! Чувај се себеси чист! "},
	{23, "23 Не пиј веќе само вода, туку земај по малку вино, заради твојот желудник и честите боледувања. "},
	{24, "24 Гревовите на некои луѓе се видливи однапред и пред нив одат на суд, а на некои одат по нив. "},
	{25, "25 Исто така и добрите дела се видливи, а и оние што не се, не можат да се скријат. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct mk6 poems[] = {
	{1, "1 Сите што се под јарем, робовите, своите господари нека ги сметаат достојни за секаква почест, за да не се хули Божјото име и учењето. "},
	{2, "2 А оние што имаат верни господари, нека не ги презираат, зашто се браќа, туку нека им служат подобро, зашто оние кои се ползуваат од нивните услуги се верни и возљубени браќа! Така поучувај и поттикнувај! "},
	{3, "3 Ако некој поучува инаку и не ги следи здравите зборови на нашиот Господ Исус Христос и на учењето на побожноста, "},
	{4, "4 тој е надмен и не знае ништо, и боледува за распрашувања и препирки околу зборови од кои произлегуваат: завист, кавги, хулења, зли сомневања, "},
	{5, "5 постојани караници меѓу луѓето со изопачен ум и лишени од вистината, кои мислат дека побожноста е средство за добивка. "},
	{6, "6 Bсушност, побожноста е голема добивка, кога е споена со чувството на доволност. "},
	{7, "7 Зашто ништо не донесовме на овој свет, ниту можеме да однесеме нешто. "},
	{8, "8 А кога имаме храна и облека, да бидеме задоволни со тоа! "},
	{9, "9 А оние кои сакаат да се богатат, паѓаат во искушение и во стапица и во многу неразумни желби и похоти што ги туркаат луѓето во пропаст и погибел, "},
	{10, "10 зашто љубовта спрема парите е коренот на сите зла; некои му се предадоа, скршнаа од верата и си нанесоа многу болки. "},
	{11, "11 А ти, Божји човеку, бегај од сето тоа! И стреми се кон праведност, побожност, вера, љубов, трпеливост и кроткост! "},
	{12, "12 Bојувај ја добрата борба на верата, зграби го вечниот живот за кој си повикан и за кого си дал добра исповед пред многу сведоци! "},
	{13, "13 Ти заповедам пред Бога, Кој оживува сè и пред Христос Исус, Кој пред Понтиј Пилат посведочи со добра исповед, "},
	{14, "14 да ја чуваш заповедта чиста и непорочна до јавувањето на нашиот Господ Исус Христос, "},
	{15, "15 кое, во свое време, ќе Го открие благословениот и единствениот Bладетел, Царот на царевите и Господар на господарите; "},
	{16, "16 Кој единствено има бесмртност и живее во непристапна светлина, Кого никој од луѓето не Го видел ниту може да Го види. Нему чест и вечна сила. Амин! "},
	{17, "17 Заповедај им на богатите на овој свет да не бидат горделиви и да не се надеваат на непостојаното богатство, туку во Бог, Кој ни дава изобилно сè, за наслада, "},
	{18, "18 да прават добро, да бидат богати во добри дела, да бидат дарежливи и штедри; "},
	{19, "19 да собираат за себе благо како добра основа за иднината, за да зграбат вистински живот. "},
	{20, "20 О, Тимотее, чувај го тоа што ти е доверено, и одбегнувај нечисти и празни разговори и противречноста на таканареченото 'познавање', "},
	{21, "21 за кое некои се држат и така скршнаа од верата. Благодат со вас. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};