#include <map>
#include <string>
class Bible61
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Симон Петар, слуга и апостол на Исус Христос, до оние кои преку праведноста на нашиот Бог и Спасител, Исус Христос, ја примија истата скапоцена вера како и ние: "},
	{2, "2 да ви се множат благодатта и мирот во познавањето на Бог и Исус, нашиот Господ. "},
	{3, "3 Неговата божествена сила ни подари сè што ни е потребно за животот и побожноста, преку вистинското познавање на Оној Кој нè повика преку Својата сопствена слава и доблест, "},
	{4, "4 со што ни се подарени Неговите скапоцени и величествени ветувања, та преку нив да станете соучесници во божествената природа, откако се оттргнавте од расипаноста, која преку похотата владее во светот; "},
	{5, "5 токму заради ова, вложете ја сета своја сила, и исполнете ја својата вера со доблест, а доблеста со знаење; "},
	{6, "6 а знаењето со самоконтрола; а самоконтролата со трпение; а трпението со побожност; "},
	{7, "7 а побожноста со братољубие; а братољубието со љубов. "},
	{8, "8 Зашто, ако го имате сето тоа и ако тоа се умножува, не сте бескорисни, ниту бесплодни во познавањето на нашиот Господ Исус Христос, "},
	{9, "9 но, оној кој го нема тоа, е слеп или кусоглед, зашто заборавил дека е исчистен од своите минати гревови. "},
	{10, "10 Затоа, браќа, трудете се уште повеќе да го зацврстите вашето призвание и избор. Имено, ако го правите тоа, никогаш нема да се сопнете. "},
	{11, "11 Зашто така во изобилство ќе ви се даде влегувањето во вечното Царство на нашиот Господ и Спасител Исус Христос. "},
	{12, "12 Затоа ќе гледам секогаш да ве потсетувам за овие работи, иако вие ги знаете и сте зацврстени во вистината што ја имате. "},
	{13, "13 Но сметам дека имам право, додека сум во ова телесно живеалиште, да ве поттикнувам со потсетување, "},
	{14, "14 зашто знам дека наскоро ќе го оставам моето земно живеалиште, како што јасно ми стави до знаење нашиот Господ Исус Христос. "},
	{15, "15 А ќе настојувам вие, и по моето заминување, секогаш да си спомнувате за ова. "},
	{16, "16 Bпрочем, кога ви ги објавивме силата и доаѓањето на нашиот Господ Исус Христос, ние не одевме по лукаво измислени сказни, туку бевме очевидци на Неговото величество. "},
	{17, "17 Зашто кога Тој прими од Бог Таткото чест и слава, од величествената слава Му дојде овој глас: 'Овој е Мојот возљубен Син, Кој е по Мојата волја', "},
	{18, "18 а ние го чувме тој глас кој дојде од небото, кога бевме со Него на светата гора. "},
	{19, "19 И така, имаме поцврсто пророчко слово; а вие правите добро што внимавате на него, како на светило што свети во темно место, додека не осамне денот и ѕвездата Деница не болсне во вашите срца. "},
	{20, "20 Но знајте го пред сè ова: ниедно пророштво во Писмото не е од нечие сопствено толкување, "},
	{21, "21 зашто никогаш ниту едно пророштво не потекнува од човечка волја, туку луѓе поттикнати од Светиот Дух зборувале од Бога. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Но се јавија и лажни пророци кај народот, како што ќе има и меѓу вас лажни учители, кои тајно ќе внесуваат погубни ереси и ќе Го порекнуваат Господарот Кој ги откупил, навлекувајќи врз себе брза погибел. "},
	{2, "2 И мнозина ќе тргнат по нивната разузданост, заради кои ќе се зборува лошо за патот на вистината. "},
	{3, "3 И во лакомство ќе ве искористуваат со измислени зборови, но нивната осуда одамна е изречена и нивната гибел не дреме. "},
	{4, "4 Зашто ако Бог не ги поштеди ангелите кои згрешија, туку ги фрли во мрачните бездни и ги предаде да бидат чувани за суд; "},
	{5, "5 и ако не го поштеди стариот свет, туку го зачува Ное, проповедникот на правдата, со уште седум души, кога сурна потоп врз безбожниот свет; "},
	{6, "6 и ако ги осуди на пропаст градовите Содом и Гомора и ги претвори во пепел, и ги постави за пример на идните безбожници; "},
	{7, "7 и ако го избави праведниот Лот, кого го мачеше развратниот живот на беззакониците "},
	{8, "8 (зашто овој праведник, живеејќи меѓу нив, ја измачуваше секојдневно својата праведна душа, гледајќи ги и слушајќи ги нивните беззаконски дела), "},
	{9, "9 тоа значи дека Господ знае како да ги избави побожните од искушенија, и неправедните да ги држи по казна до денот на судот; "},
	{10, "10 а особено оние кои одат по осквернувачките похоти на телото и ја презираат власта. Како дрски и своеволни луѓе, тие не треперат кога ги хулат величијата, "},
	{11, "11 додека ангелите, кои се поголеми по сила и моќ, не изговараат хулна осуда против нив пред Господ. "},
	{12, "12 А овие, како неразумни животни, кои се по природа определени да бидат ловени и истребувани, хулат на она што не го знаат, и самите ќе загинат како што гинат животните, "},
	{13, "13 со што ќе им се плати за нивните недела. Тие го сметаат развратниот живот дење како задоволство; валкани и срамни се тие, кои се честат и насладуваат во своите измами кога се гостат со вас, "},
	{14, "14 а нивните очи се полни со прељуба и не престануваат да грешат; ги заведуваат незацврстените души; срцето им е навикнато на лакомство; тие се проколнати деца. "},
	{15, "15 Оставајќи го вистинскиот пат заблудија, и тргнаа по патот на Балаам, синот на Беор, кој посака неправедна плата, "},
	{16, "16 но прими прекор за својот престап, зашто немо магаре проговори со човечки глас и го спречи безумството на пророкот. "},
	{17, "17 Тие се безводни извори и облаци терани од ветрот; на кои им е наменета црната темнина. "},
	{18, "18 Зашто со тоа што дрдорат благозвучни, суетни зборови, ги мамат преку телесните наслади оние кои одвај се оттргнале од оние кои живеат во заблуда; "},
	{19, "19 им ветуваат слобода, а самите и робуваат на расипаноста, бидејќи од она со кое човекот е надвладеан, на тоа и му робува. "},
	{20, "20 Зашто ако се оттргнаа од световната расипаност оние со вистинското познавање на Господ и Спасителот Исус Христос и се заплеткуваат во неа и се надвладеани, тогаш ова последново им е полошо од првото. "},
	{21, "21 Имено, за нив би било подобро да не го познаваа патот на праведноста, отколку, откако го познаа, да се одвратат од светата заповед која им е предадена. "},
	{22, "22 Ним им се случува она што го вели потврдената поговорка: 'Песот се враќа на својата блујавица' и 'Избањатата свиња се враќа да се валка во калта.' "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Мили мои, ова е веќе второ писмо што ви го пишувам, и го будам, преку напомнување, вашиот чист разум, "},
	{2, "2 за да си ги спомните зборовите што однапред ги кажаа светите пророци, и за заповедта на Господ и Спасителот, која ви ја предадоа вашите апостоли. "},
	{3, "3 Знајте го пред сè ова: во последните дни ќе се јават подбивачи, кои со своето подбивање ќе одат по сопствените похоти и ќе велат: "},
	{4, "4 'Каде е ветувањето за Неговото доаѓање? Зашто откако починаа татковците сè стои така како што е од почетокот на создавањето.' "},
	{5, "5 Кога така сметаат, забораваат дека преку Божјото слово небесата одамна постојат, и дека земјата беше создадена од водата и преку водата, "},
	{6, "6 преку која тогашниот свет беше потопен со вода, и така беше уништен. "},
	{7, "7 А сегашните небеса и земјата, со истото слово се запазени и се чуваат за оган до денот на судот и погибелта на безбожните луѓе. "},
	{8, "8 Но едно не смее да ви биде непознато, мили мои: дека за Господ еден ден е како илјада години, и илјада години се како еден ден. "},
	{9, "9 Господ не го забавува ветувањето, како што некои мислат за тоа бавење, туку е трпелив спрема вас, зашто не сака некој да загине, туку сите да дојдат до покајание. "},
	{10, "10 А Господовиот ден ќе дојде како крадец. Bо тој ден небесата ќе поминат со голема бучава, а состојките ќе бидат уништени и земјата ќе изгори со сите нејзини дела. "},
	{11, "11 Бидејќи сето ова ќе се уништи така, какви треба да бидете во светото поведение и побожноста "},
	{12, "12 вие кои го очекувате и забрзувате доаѓањето на Божјиот ден, кога запалените небеса ќе се распаднат, состојките ќе се стопат со огромна жештина? "},
	{13, "13 А ние, според Неговото ветување, очекуваме нови небеса и нова земја, каде суштествува праведноста. "},
	{14, "14 Затоа, мили мои, бидејќи го очекувате ова, погрижете се Тој да ве најде во мир, неопоганети и непорочни. "},
	{15, "15 А долгата трпеливост на нашиот Господ сметајте ја како спасение, како што и нашиот сакан брат Павле ви напиша, според дадената му мудрост; "},
	{16, "16 како што и во сите негови посланија зборува за ова; во нив има некои тешко разбирливи нешта, кои неуките и незацврстените ги изопачуваат, како, впрочем, и другите Писма, за своја погибел. "},
	{17, "17 И така, вие, мили мои, кога го знаете ова однапред, пазете се да не ве повлече со себе заблудата на беззакониците и да не отпаднете од својата непоколебливост, "},
	{18, "18 туку растете во благодатта и во познавањето на нашиот Господ и Спасител Исус Христос. Слава Му сега и до денот на вечноста! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};