#include <map>
#include <string>
class Bible53
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Павле, Силван и Тимотеј до црквата на Солунците, во Бог нашиот Татко, и Господ Исус Христос: "},
	{2, "2 Благодат вам и мир од Бог нашиот Татко и Господ Исус Христос. "},
	{3, "3 Должни сме секогаш да Му благодариме на Бог за вас, браќа, како што прилега, зашто вашата вера расте многу; и се умножува меѓусебната љубов на секој од вас, "},
	{4, "4 така што ние самите се фалиме со вас меѓу Божјите цркви заради вашата истрајност и вера сред прогонствата и маките, што ги поднесувате. "},
	{5, "5 Тоа е знак на Божјиот праведен суд, за да се сметате достојни за Божјото царство, за кое и страдате. "},
	{6, "6 Зашто праведно е Бог да им возврати со мака на оние кои ве измачуваат, "},
	{7, "7 а вам, на измачуваните, олеснување заедно со нас, кога ќе се јави Господ Исус од небото, со Своите силни ангели, "},
	{8, "8 во пламенен оган, за да им се одмазди целосно на оние кои не Го познаваат Бог и кои не му се покоруваат на Евангелието на нашиот Господ Исус. "},
	{9, "9 Таквите ќе бидат казнети со вечна погибел далеку од лицето на Господ и од славата на Неговата сила, "},
	{10, "10 кога ќе дојде во оној ден, да се прослави во Своите светии и да Му се восхитуваат сите кои поверувале, зашто вие му поверувавте на нашето сведоштво. "},
	{11, "11 Затоа и ние секогаш се молиме за вас, нашиот Бог да ве удостои да веповика и да исполни со моќ секоја добра волја во добрина и делото на вашата вера, "},
	{12, "12 за да се прослави името на нашиот Господ Исус во вас и вие во Него, според благодатта на нашиот Бог и Господ Исус Христос. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 А сега, ве молиме, браќа, во однос на доаѓањето на нашиот Господ Исус Христос и за нашето заедничко собирање кај Него, "},
	{2, "2 не дозволувајте брзо да се поколебате во разумноста, ниту да се исплашите од некој дух или слово, ни од некое послание, како да е од нас испратено, како веќе да настапил Господовиот Ден! "},
	{3, "3 Никој да не ве измами на никаков начин, зашто тоа нема да се случи додека првин не дојде отпадништвото и не се појави човекот на безаконието, синот на погибелта, "},
	{4, "4 кој се противи и се воздига над сè што се нарекува Бог или светиња, така што ќе седне во Божјиот храм и ќе се претставува себеси дека тој е Бог. "},
	{5, "5 Не помните ли дека за ова ви зборував уште кога бев кај вас? "},
	{6, "6 И сега знаете што го задржува за да се открие во своето време. "},
	{7, "7 Зашто, тајната на беззаконието веќе дејствува, додека не се отстрани од средината Оној што сега ја задржува, "},
	{8, "8 и потоа ќе се јави беззаконикот кого Господ ќе го убие со здивот на Својата уста и ќе го уништи со појавата на Своето доаѓање. "},
	{9, "9 Тоа е оној, чие доаѓање е во согласност со сатанското дејствување, со секаква сила, со чудотворни знаци, со лажни чуда "},
	{10, "10 и со секаква неправедна измама за оние кои загинуваат, зашто не ја примија љубовта на вистината за да се спасат. "},
	{11, "11 И затоа Бог им праќа заблуда да дејствува меѓу нив за да и веруваат на лагата, "},
	{12, "12 та да бидат осудени сите, кои не и поверуваа на вистината, а имаа задоволство во неправедноста. "},
	{13, "13 А ние сме должни секогаш да Му благодариме на Бог за вас, браќа, мили на Господ, зашто Бог ве избра за спасение уште од почетокот, преку осветувањето на Духот и вера во вистината. "},
	{14, "14 И затоа ве повика преку нашето Евангелие, за да ја добиете славата на нашиот Господ Исус Христос. "},
	{15, "15 Затоа, браќа, стојте цврсто и држете ги преданијата што ги научивте од нас, било преку слово или преку наше послание. "},
	{16, "16 А Самиот наш Господ Исус Христос и Бог, нашиот Татко, Кој нè засака и ни даде вечна утеха и добра надеж преку благодатта "},
	{17, "17 нека ги утеши вашите срца и нека ве утврди во секое добро дело и слово! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Најпосле, браќа, молете се за нас, та Господовото слово брзо да напредува и да се прославува како и кај вас, "},
	{2, "2 а да бидеме избавени од лоши и зли луѓе, зашто сите немаат вера. "},
	{3, "3 Но верен е Господ Кој ќе ве утврди и ќе ве запази од злиот. "},
	{4, "4 Уверени сме во Господ, за вас, дека го вршите и дека ќе го вршите она што ви го заповедаме. "},
	{5, "5 А Господ да ги насочи вашите срца кон Божјата љубов и кон Христовото трпение! "},
	{6, "6 А вам ви наложуваме, браќа, во името на нашиот Господ Исус Христос, да се двоите од секој брат, кој води неуреден живот, а не по преданието што го примивте од нас. "},
	{7, "7 Навистина, сами знаете како треба да нè имате за пример, зашто ние не се однесуваме неуредно меѓу вас, "},
	{8, "8 ниту јадевме дарум нечиј леб, туку работевме во труд и напор, ноќе и дење, за да не му бидеме на товар некому од вас. "},
	{9, "9 Не затоа што немавме право на тоа, туку за ние самите да бидеме пример што ќе го следите. "},
	{10, "10 Зашто и кога бевме со вас, ви го заповедавме ова: ако некој не сака да работи, нека и не јаде! "},
	{11, "11 Имено, слушаме дека некои меѓу вас живеат неуредно, ништо не работат, туку се занимаваат со празни работи. "},
	{12, "12 На таквите им заповедаме и ги молиме во Господ Исус Христос: да работат со смиреност и да си го јадат својот сопствен леб. "},
	{13, "13 А вие, браќа, да не се уморувате правејќи добро! "},
	{14, "14 Ако пак некој не го послуша нашиот совет преку писмово, обележете го и не мешајте се со него, за да се засрами. "},
	{15, "15 Но не сметајте го за непријател, туку предупредувајте го како брат. "},
	{16, "16 А Самиот Господ на мирот секогаш да ви дава мир во секакви околности. Господ да биде со сите вас! "},
	{17, "17 Јас, Павле, своерачно ве поздравувам; тоа е белег во секое писмо, јас така пишувам. "},
	{18, "18 Благодатта на нашиот Господ Исус Христос да биде со сите вас."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};