#include <map>
#include <string>
class Bible47
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
	struct mk6	{ int val; const char *msg; };
	struct mk7	{ int val; const char *msg; };
	struct mk8	{ int val; const char *msg; };
	struct mk9	{ int val; const char *msg; };
	struct mk10	{ int val; const char *msg; };
	struct mk11	{ int val; const char *msg; };
	struct mk12	{ int val; const char *msg; };
	struct mk13	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Павле, апостол на Исус Христос, преку Божјата волја, и братот Тимотеј, до Божјата црква во Коринт, со сите светии, кои се по цела Ахаја. "},
	{2, "2 Благодат вам и мир од Бог, нашиот Татко, и од Господ Исус Христос! "},
	{3, "3 Благословен да е Бог и Таткото на нашиот Господ Исус Христос, Таткото на милосрдноста и Бог на секоја утеха, "},
	{4, "4 Кој нè утешува во секоја наша невола, за да можеме и ние да ги утешуваме оние што се наоѓаат во каква и да е невола, со утехата со која Бог нè утешува нас самите. "},
	{5, "5 Зашто, како што Христовите страдања изобилуваат во нас, така преизобилува и нашата утеха преку Христос. "},
	{6, "6 Ако сме измачувани, тоа е за ваша утеха и спасение. Ако ние се утешуваме, тоа е за ваша утеха, која е делотворна во трпеливото поднесување на истите страдања, што ги трпиме и ние. "},
	{7, "7 Нашата надеж за вас е цврста, знаејќи дека вие учествувате како во нашите страдања така и во нашата утеха. "},
	{8, "8 Браќа, всушност, сакаме да знаете каква невола нè снајде во Азија, дека бевме оптоварени преку секоја мера и над нашите сили, така што не се надевавме ни да го запазиме својот живот. "},
	{9, "9 Навистина, во себе ја носиме смртната пресуда, за да не се надеваме сами на себеси, туку на Бог, Кој ги воскреснува мртвите. "},
	{10, "10 Тој нè избави од толку блиска смрт и уште ќе нè избавува Оној, во Кого се надеваме. Тој уште ќе нè избавува "},
	{11, "11 со помош на вашите молитви за нас, за мнозина да Му заблагодарат за даруваната благонаклоност што ја добивме преку многумина. "},
	{12, "12 Зашто нашата пофалба е оваа: сведоштвото на нашата совест, дека во светот, а особено спрема вас, се однесувавме во светост и побожна искреност, не во телесна мудрост, туку во Божја благодат. "},
	{13, "13 Зашто, не ви пишуваме ништо друго, освен она што го читате и разбирате, а се надевам дека ќе разберете докрај, "},
	{14, "14 како што веќе нè разбравте делумно, дека ние сме ваша пофалба, а вие наша, во денот на нашиот Господ Исус. "},
	{15, "15 Со таа увереност сакав да дојдам најпрвин кај вас, за да примите двоен благослов; "},
	{16, "16 и преку вас да поминам во Македонија, а од Македонија пак да дојдам кај вас, и вие да ми помогнете во моето патување за Јудеја. "},
	{17, "17 Да не постапив лекомислено кога го посакав тоа? Или пак да не се моите намери телесни, така што истовремено да велам и 'да' и 'не'? "},
	{18, "18 Бог е верен дека нашето слово кон вас не е и 'да' и 'не.' "},
	{19, "19 Зашто Божјиот Син, Христос Исус, Кого Го проповедавме меѓу вас, јас, Силуан и Тимотеј, не беше 'да' и 'не', туку во Него беше 'да', "},
	{20, "20 бидејќи Божјите ветувања, колку многу и да се, во Него се 'да.' Затоа преку Него и ние самите велиме 'Амин', за слава на Бог. "},
	{21, "21 А Бог е Тој кој нè утврдува заедно со вас во Христос и нè помаза, "},
	{22, "22 и нè запечати и ни го даде Духот во нашите срца, како залог. "},
	{23, "23 А јас Го повикувам Бог за сведок на мојата душа, дека за да ве поштедам, не дојдов повеќе во Коринт; "},
	{24, "24 не оти ние господариме со вашата вера, туку сме соработници за ваша радост, зашто во верата вие стоите цврсто. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Но во себеси решив да не доаѓам кај вас пак со жал. "},
	{2, "2 Зашто, ако јас ве жалостам, тогаш кој ќе ме развеселува мене, ако не оној кого јас го ожалостувам? "},
	{3, "3 И точно тоа ви го напишав, кога ќе дојдам да не бидам ожалостен од оние кои би требало да ме зарадуваат; и уверен сум во сите вас дека мојата радост ќе биде радост и на сите вас. "},
	{4, "4 Зашто, ви пишував во голема мака, со тешкотија на срцето и со многу солзи, не за да ве ожалостам, туку за да ја познаете големата љубов што ја имам особено спрема вас. "},
	{5, "5 Ако некој ме ожалостил, не ме ожалостил мене, туку, во извесна смисла, да не претерувам, сите вас. "},
	{6, "6 На таквиот му е доста казната од мнозинството, "},
	{7, "7 така што наспроти тоа, вие треба побргу да му простите и да го утешите, за да не го обземе преголема жалост. "},
	{8, "8 Затоа, ве молам, повторно да покажете љубов спрема него. "},
	{9, "9 Токму затоа и ви напишав, за да ве испитам дали сте послушни во сè. "},
	{10, "10 А кому вие ќе му простите нешто, нему му проштавам и јас. Зашто, она што сум го простил, доколку сум простил, сум го простил заради вас пред Христос; "},
	{11, "11 за да не нè искористи сатаната; бидејќи не ни се непознати неговите намери. "},
	{12, "12 Кога дојдов во Троја заради Христовото Евангелие, и кога врата ми се отвори во Господ, "},
	{13, "13 немав мир во својот дух, зашто не го најдов братот Тит, и затоа, откако се простив од нив, отидов во Македонија. "},
	{14, "14 Но, фала Му на Бога, Кој секогаш нè води во Неговата победа во Христос, и на секое место, преку нас, го шири благиот мирис на Неговото познавање, "},
	{15, "15 зашто, ние сме Христов благ мирис пред Бог меѓу оние кои се спасуваат, и меѓу оние кои загинуваат; "},
	{16, "16 на едните смртен мирис за смрт, а на другите животен мирис за живот. А кој е подобен за сето ова? "},
	{17, "17 Зашто, ние не го изопачуваме Божјото слово, како што мнозина го прават тоа, туку зборуваме искрено како од Бог, зборуваме во Христос пред Бог. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Почнуваме ли пак да се препорачуваме сами себеси? Или, можеби ни се потребни, како на некои, писмени препораки за вас или од вас? "},
	{2, "2 Bие сте нашето писмо напишано во срцата наши, кое го познаваат и го читаат сите луѓе. "},
	{3, "3 Зашто е очигледно дека сте Христово писмо, составено преку нашата служба; напишано не со мастило, туку со Духот на живиот Бог; не на камени плочи, туку на телесни плочи - човечките срца. "},
	{4, "4 А такво уверување спрема Бог имаме преку Христос. "},
	{5, "5 Не дека сме подобни сами од себе да помислиме за нешто, туку, нашата подобност доаѓа од Бог, "},
	{6, "6 Кој и нè направи подобни за служители на еден нов завет ; не на буквата, туку на Духот, зашто буквата убива, а Духот оживува. "},
	{7, "7 Ако пак служењето на смртта, со букви врежано во камења, беше толку славно, така што израеловите синови не можеа да погледнат во Мојсеевото лице, поради сјајот на неговото лице, кој поминуваше, "},
	{8, "8 како тогаш служењето на Духот не ќе биде уште пославно? "},
	{9, "9 Зашто, ако е славно служењето што донесува осуда, многу е пославно служењето што донесува праведност. "},
	{10, "10 Зашто и она што имаше слава, во овој случај немаше, заради славата која надминува. "},
	{11, "11 Зашто, ако беше со слава она што поминува, многу повеќе е славно она што е трајно. "},
	{12, "12 И така, имајќи ваква надеж, зборуваме со голема смелост, "},
	{13, "13 и не сме како Мојсеј, кој ставаше превез на своето лице, та израеловите синови да не го гледаат крајот на она што исчезнува. "},
	{14, "14 Но нивните умови беа закоравени. Зашто, до ден денешен останува истиот превез несимнат при читањето на Стариот Завет, бидејќи се симнува само во Христос. "},
	{15, "15 И така, до денес, кога го читаат Мојсеј, превез ги прекрива на нивните срца. "},
	{16, "16 Но, кога некој се обрати кон Господ, превезот се отстранува. "},
	{17, "17 Зашто Господ е Духот, а каде што е Господовиот Дух, таму има слобода. "},
	{18, "18 А ние сите, со откриено лице, гледајќи ја како во огледало Господовата слава, и се преобразуваме во истиот лик од слава во слава, така како што го прави тоа Господ, Духот. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Затоа, кога го имаме ова служење, откако добивме милост, ние не се обесхрабруваме, "},
	{2, "2 туку се одрековме од тајните, срамни работи; не живееме во лукавство, ниту го изопачуваме Божјото слово, туку преку откривањето на вистината се препорачуваме себеси на секоја човечка совест, пред Бог. "},
	{3, "3 Ако пак е скриено нашето Евангелие, скриено е за оние кои гинат; "},
	{4, "4 на кои богот на овој свет им го заслепил разумот, за да не ја видат светлината на Евангелието на славата на Христос, Кој е Божји лик. "},
	{5, "5 Зашто, ние не се проповедаме себеси, туку Христос Исус како Господ; а себеси како ваши слуги заради Исус. "},
	{6, "6 Зашто, Бог, Кој рече светлина да светне од темнината, е Тој Кој засвети во нашите срца, за да ги осветли со познавањето на Божјата слава пред Христовото лице. "},
	{7, "7 А ова богатство го имаме во земјени садови, та ненадминливото величие на моќта да биде од Бога, а не од нас. "},
	{8, "8 На мака сме од сите страни, но не сме скршени; притеснети сме, но не очајуваме; "},
	{9, "9 нè прогонуваат, но не сме напуштени; кутнати сме, но не сме погубени, "},
	{10, "10 секогаш носејќи ја во телото Исусовата смрт, за Исусовиот живот да се покаже во нашето тело. "},
	{11, "11 Зашто ние живите постојано сме предавани на смрт заради Исус, за Исусовиот живот да се покаже во нашето смртно тело. "},
	{12, "12 И така, смртта дејствува во нас, а животот во вас. "},
	{13, "13 А бидејќи го имаме истиот дух на верата, како што е напишано: 'Јас поверував и затоа зборував,' и ние веруваме и затоа зборуваме, "},
	{14, "14 знаејќи дека Оној Кој Го воскресна Господ Исус, ќе нè воскресне и нас со Исуса и заедно со вас ќе нè претстави пред Себеси. "},
	{15, "15 Зашто сето ова е заради вас, та благодатта, која се распространува преку мнозина, да предизвика изобилно благодарење за слава на Бог. "},
	{16, "16 Затоа, не папсуваме, па и ако се распаѓа нашиот надворешен човек, внатрешниот се обновува од ден на ден. "},
	{17, "17 Зашто, нашата сегашна лесна невола ни донесува прекумерно, и неизмерно, вечно изобилство на слава, "},
	{18, "18 бидејќи ние не гледаме на она што е видливо, туку на она што е невидливо; зашто видливите работи се привремени, а невидливите се вечни. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 Имено, знаеме дека ако се разурне нашиот земен дом што е како шатор, имаме од Бог вечна градба на небесата, која не е изградена од човечка рака. "},
	{2, "2 Па затоа овде офкаме и копнееме да се облечеме во своето небесно живеалиште; "},
	{3, "3 само така облечени, нема да бидеме затекнати голи. "},
	{4, "4 Зашто, додека сме во овој шатор, воздивнуваме обременети, бидејќи не сакаме да бидеме необлечени, туку да бидеме облечени, та животот да го проголта она што е смртно. "},
	{5, "5 А Бог нè приготви токму за ова, со тоа што ни Го даде Духот како залог. "},
	{6, "6 И така, секогаш сме бодри и знаеме дека сè додека живееме во телото, далеку сме од Господ, "},
	{7, "7 бидејќи живееме според вера, а не според гледање. "},
	{8, "8 Бодри сме, велам, и повеќе сакаме да го напуштиме телово и да појдеме дома кај Господ. "},
	{9, "9 Затоа и се стремине да Му угодиме Нему, било да сме дома или далеку, "},
	{10, "10 зашто сите ние треба да се појавиме пред Христовиот суд, и секој да си го добие она што го правел во телото, било добро или лошо. "},
	{11, "11 Следствено, знаејќи го стравот од Господ, ги уверуваме луѓето, додека на Бог сме Му познати, а се надевам дека сме им познати и на вашите совести. "},
	{12, "12 Не ви се препорачуваме повторно, туку ви даваме повод и вие да се фалите со нас, за да имате што да им одговорите на оние што се фалат со надворешноста, а не со срцето. "},
	{13, "13 Bпрочем, ако не бевме здрави ви умот, тоа е заради Бога; ако сме со здрав ум, тоа е заради вас. "},
	{14, "14 Зашто, Христовата љубов нè обзема откако дојдовме до заклучокот дека штом еден умрел за сите, значи сите умреле. "},
	{15, "15 А Тој умре за сите, та живите да не живеат повеќе сами за себе, туку за Оној Кој умре и воскресна за нив. "},
	{16, "16 Затоа отсега ние не познаваме никого по тело; иако Христос Го познавме и по тело; сега веќе не Го познаваме како таков. "},
	{17, "17 И така, ако некој е во Христос, тој е ново создание; старото помина, еве сè стана ново. "},
	{18, "18 А сето ова е од Бог, Кој нè измири со Себе преку Христос и ни ја даде службата на измирувањето, "},
	{19, "19 имено, Бог го миреше светот со Себе во Христос, не земајќи ги предвид неговите престапи и ни го довери нам словото на измирувањето. "},
	{20, "20 Значи, ние сме Христови пратеници, па Бог ве моли преку нас. Bе молиме во името на Христос, помирете се со Бог! "},
	{21, "21 Оној Кој не знаеше за грев, Бог Го направи грев заради нас, за да станеме Божја праведност во Него. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct mk6 poems[] = {
	{1, "1 А како Негови соработници ние ве молиме да не ја примате залудно Божјата благодат, "},
	{2, "2 зашто Тој вели: 'Bо погодно време те послушав и во денот на спасението ти помогнав.' Еве, сега е 'погодното време', еве, сега е 'денот на спасението'! "},
	{3, "3 Bо ништо не даваме никакви поводи за соблазна, за да не и се приговори на нашата служба; "},
	{4, "4 туку во сè се покажуваме како Божји служители: во големо трпение, во неволи, во тешкотии, во маки, "},
	{5, "5 при тепања, во зандани, во немири, во напори, во бдеења, во пости; "},
	{6, "6 во чистота, во знаење, во трпеливост, во љубезност, во Светиот Дух, во вистинска љубов; "},
	{7, "7 во словото на вистината, во Божјата сила, со оружје на праведноста во десната и во левата рака, "},
	{8, "8 во слава и во срам, при лош глас и при добар глас, сметани за измамници, а сепак чесни, "},
	{9, "9 како непознати, а сепак добро познати, како на умирачка - а ете, живееме; како казнувани, но не убивани, "},
	{10, "10 како тажни, но сепак секогаш радосни; како сиромашни, а збогатуваме други, како да немаме ништо, а имаме сè. "},
	{11, "11 Коринќани, нашата уста ви зборува јавно, нашето срце е широко отворено. "},
	{12, "12 Bам не ви е тесно заради нас, туку заради вашите срца; "},
	{13, "13 ви зборувам како на деца, бидете широки и вие, за да ни возвратите на ист начин. "},
	{14, "14 Не впрегнувајте се во нееднаков јарем со неверниците! Bпрочем, што има заедничко праведноста со беззаконието? Или какво заедништво има светлината со темнината? "},
	{15, "15 Bо што се сложува Христос со Белијар, или што има заедничко верник со неверник? "},
	{16, "16 Или какво единство има Божјиот храм со идолите? Зашто, ние сме храмот на живиот Бог, токму како што рекол Бог: 'Ќе живеам во нив и ќе одам сред нив, и ќе им бидам Бог, а тие ќе бидат Мој народ.' "},
	{17, "17 'Затоа, излезете од сред нив и одвојте се' - вели Господ, 'не допирајте се до нечисто', и 'Јас ќе ве примам. "},
	{18, "18 Ќе ви бидам Татко, а вие ќе бидете Мои синови и ќерки', вели Господ Семоќниот. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct mk7 poems[] = {
	{1, "1 И така, мили мои, кога ги имаме овие ветувања, да се исчистиме од секоја духовна и телесна нечистотија, усовршувајќи ја својата светост во страв од Бог. "},
	{2, "2 Примете нè во вашите срца! Никому не згрешивме, никого не расипавме, никого не измамивме. "},
	{3, "3 Не ви го велам ова за да ве осудам, зашто, пред малку реков дека сте во нашите срца за да умреме и за да живееме заедно. "},
	{4, "4 Имам голема доверба во вас и многу се фалам со вас; исполнет сум со утеха; преплавен сум со радост во сите наши неволи. "},
	{5, "5 Зашто, и кога дојдовме во Македонија, нашето тело немаше спокој, туку отсекаде бевме во невола: однадвор борби, однатре стравови. "},
	{6, "6 Но, Оној Кој ги утешува понизните, нè утеши со доаѓањето на Тит; "},
	{7, "7 и не само со неговото доаѓање, туку и со утехата со која тој се утеши заради вас, известувајќи нè за вашиот копнеж, за вашата тага, за вашата ревност за мене, така што се зарадував уште повеќе. "},
	{8, "8 Зашто, дури и да ве нажалив со ова послание, не се каам. Па иако се покајав, оти навистина гледам дека посланието ве натажи, макар и за кратко, - "},
	{9, "9 сега се радувам, не заради тоа што се нажаливте, но затоа што се нажаливте за покајание; бидејќи се нажаливте според Бога, за да не бидете во нешто оштетени од нас. "},
	{10, "10 Зашто, тагата која е по Божја волја донесува покајание за спасение, за кое не се жали; но тагата на светот донесува смрт. "},
	{11, "11 Зашто, видете, колкава искрена сесрдност произлезе токму од ова, од вашата побожна тага: каква одбрана, какво негодување, каков страв, каков копнеж, каква ревност и казнување. Покажавте во сè дека сте чисти во тоа дело. "},
	{12, "12 Bпрочем, ако и ви пишав, не го напишав тоа заради престапникот, ни заради оној што претрпел зло, туку за да се покаже пред Бога вашата грижа за нас. "},
	{13, "13 Затоа и се утешивме. Но покрај оваа наша утеха, многу повеќе се израдувавме заради радоста на Тит, зашто сите вие го освеживте неговиот дух. "},
	{14, "14 Ако му се пофалив со нешто за вас, не се посрамив, туку како што сè ви зборувавме вистинито, така и нашето фалење пред Тит се покажа вистина. "},
	{15, "15 А неговото срце уште повеќе чувствува за вас, кога ќе се сети на вашата послушност, како го примивте со страв и трепет. "},
	{16, "16 Се радувам што можам во сè да имам доверба во вас. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct mk8 poems[] = {
	{1, "1 Bе известувам, браќа, за Божјата благодат дадена на црквите во Македонија; "},
	{2, "2 дека, иако во прекумерни неволи, нивната изобилна радост и длабоката беда покажаа преизобилно богатство на нивната штедрост. "},
	{3, "3 Зашто сведочам, дека според своите можности, а и преку нив, дадоа доброволно "},
	{4, "4 и нè молеа многу да им укажеме можност да учествуваат во издршката на светиите, "},
	{5, "5 и тоа, не како што се надевавме, туку првин самите себе Му се предадоа на Господ, а потоа и нам, според Божјата волја. "},
	{6, "6 Затоа го замоливме Тит, како што порано започна така и да го заврши меѓу вас и ова дело на благодат. "},
	{7, "7 И како што изобилувате во сè, во вера, во говор, во знаење, во секаква усрдност и во љубовта спрема нас, трудете се да изобилувате и во ова дело на благодат. "},
	{8, "8 Не го велам ова како заповед, туку ја испитувам искреноста на вашата љубов преку усрдноста на другите. "},
	{9, "9 Зашто позната ви е благодатта на нашиот Господ Исус Христос, како, заради вас, од богат стана сиромав, за да се збогатите вие преку Неговата сиромаштија. "},
	{10, "10 Со ова ви давам само совет, зашто тоа е полезно за вас, кои од минатата година почнавте не само да го правите тоа, туку и да имате желба да го правите. "},
	{11, "11 А сега довршете го и тоа дело, па како што имавте готовност во настојувањето, така да имате и во довршувањето, според вашите можности. "},
	{12, "12 Зашто, ако има добра волја, таа е прифатлива според она што се има, а не според она што се нема. "},
	{13, "13 Бездруго, не сакам со олеснувањето на другите, да ви донесе неволја вам, туку да има рамноправност - "},
	{14, "14 вашево сегашно изобилие да ја покрие нивната скудност, та и нивното изобилие да и послужи на вашата скудност, за да има рамноправност, "},
	{15, "15 според она што е напишано: 'Кој собра многу, немаше излишно, а кој собра малку, немаше скудност.' "},
	{16, "16 Но, Му благодарам на Бога, Кој истата грижа за вас му ја стави во срцето на Тит! "},
	{17, "17 Зашто тој не само што ја прифати нашата молба, туку, бидејќи беше многу усрден, доброволно отиде кај вас. "},
	{18, "18 Со него го пративме и братот кој стана познат по сите цркви заради неговата работа за Евангелието. "},
	{19, "19 И не само тоа, туку црквите го одредија да патува со нас за ова дело на милосрдност, на кое му служиме за слава на Самиот Господ и да ја покажеме својата подготвеност. "},
	{20, "20 Со тоа сакаме да избегнеме да не ни се префрли заради овој штедар дар со кој располагаме. "},
	{21, "21 Зашто, ние се грижиме за она што е чесно не само пред Господ, туку и пред луѓето. "},
	{22, "22 А со нив го испративме и нашиот брат, чија ревност ја испитавме повеќепати во многу работи, а кој е уште поревносен сега, заради големата доверба во вас. "},
	{23, "23 Што се однесува до Тит, тој е мој другар и соработник меѓу вас. А што се однесува до нашите браќа, тие се пратеници на црквите, Христова слава. "},
	{24, "24 И така, покажете го пред црквите доказот на вашата љубов и на нашите пофалби за вас. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct mk9 poems[] = {
	{1, "1 А во врска со собирањето помош за светиите, излишно е да ви пишувам, "},
	{2, "2 зашто позната ми е вашата готвност, за која се фалам пред Македонците дека Ахаја уште од лани е приготвена и дека вашата ревност поттикнала мнозина од нив. "},
	{3, "3 Сепак ги испратив браќата, за да не се покаже, во овој случај, празно нашето фалење со вас и за да бидете, како што реков, подготвени, "},
	{4, "4 та ако дојдат со мене Македонците и ве најдат неподготвени, да не се усрамиме ние, да не речам вие. "},
	{5, "5 И така, сметав за нужно да ги молам браќата пред нас да дојдат кај вас и да го приготват однапред вашиот отпорано ветен изобилен дар, така што да биде подготвен како дарежливост, а не како нешто изнудено. "},
	{6, "6 А ова ви го велам: кој сее скудно, скудно и ќе жнее; кој сее штедро, штедро и ќе жнее! "},
	{7, "7 Секој нека даде како што решил во срцето, а не безволно и не сосила, зашто Бог го љуби радосниот дарител. "},
	{8, "8 А Бог е способен изобилно да ја излее сета благодат врз вас, па имајќи секогаш доволно сè што е потребно, да имате изобилно за секое добро дело, "},
	{9, "9 како што е напишано: 'Раздаваше нашироко, им даваше на сиромашните,Неговата праведност останува во вечни векови.' "},
	{10, "10 Оној Кој му дава семе на сејачот и леб за храна, ќе го умножи и вашето семе и ќе ја зголеми жетвата на вашата праведност; "},
	{11, "11 и ќе бидете збогатени во сè за секаква штедрост, која преку нас предизвикува благодарност кон Бога. "},
	{12, "12 Зашто извршувањето на оваа служба, не само што им ги надополнува потребите на светиите, туку и преизобилува со многу благодарење на Бога. "},
	{13, "13 Поради доказот на оваа служба тие ќе Го прослават Бог, заради вашата послушност кон Христовото Евангелие кое го исповедате и за штедроста на вашиот придонес за нив и за сите, "},
	{14, "14 а тие со својата молитва за вас, покажуваат дека копнеат по вас заради преизобилната Божја благодат во вас. "},
	{15, "15 Вала Му на Бога за Неговиот неискажлив дар! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct mk10 poems[] = {
	{1, "1 А јас самиот, Павле, ве преколнувам преку Христовата кроткост и благост; јас, кој сум понизен кога сум меѓу вас, но сум смел кон вас кога сум далеку од вас! "},
	{2, "2 Сакам, кога ќе бидам кај вас, да не треба да истапам со онаа смелост со која мислам да истапам против некои, кои мислат дека постапуваме според телото. "},
	{3, "3 Ние, навистина, живееме во телото, но не војуваме според телото, "},
	{4, "4 зашто оружјето на нашето војување не е телесно, туку е со божествена моќ за разурнување на упориштата. "},
	{5, "5 Ние ги рушиме мудрувањата и сè што се крева против познавањето на Бог, ја плениме секоја мисла за послушност на Христос "},
	{6, "6 и готови сме да казниме секаква непослушност, откако ќе се исполни вашата послушност. "},
	{7, "7 Гледате површно на нештата! Ако некој е уверен во себе дека е Христов, уште еднаш во себе нека помисли на ова: како што е тој Христов, така сме и ние! "},
	{8, "8 Зашто, ако се пофалам и малку повеќе со нашата власт што Господ ни ја даде за ваше надградување, а не за ваша пропаст, нема да се засрамам; "},
	{9, "9 но нека не изгледа дека сакам да ве заплашувам со моите посланија, "},
	{10, "10 зашто, 'посланијата му се', некои велат, 'тешки и силни; но кога е лично присутен, тој е немоќен, а зборовите му се за презир.' "},
	{11, "11 Таквиот нека знае дека она што сме на збор преку посланијата кога сме отсутни, тоа сме и на дело кога сме присутни. "},
	{12, "12 Имено, не се осмелуваме да се вбројуваме или да се споредуваме со некои кои се препорачуваат сами себеси; но не постапуваат разумно, кога се мерат сами со себе и се споредуваат сами со себе. "},
	{13, "13 А ние не сакаме прекумерно да се фалиме, туку само во рамките на досегот, што Бог ни го определи како мера, за да достигнеме дури до вас. "},
	{14, "14 Ние не се протегаме прекумерно, како што ќе беше ако не достигневме до вас; зашто ние први стигнавме до вас со Христовото Евангелие; "},
	{15, "15 и не се фалиме прекумерно со туѓи напори, туку се надеваме, кога ќе порасне вашата вера, дека ние, и надвор од нашиот досег, уште повеќе ќе бидеме величени меѓу вас; "},
	{16, "16 и дека ќе го проповедаме Евангелието и подалеку од вас, а да не се фалиме со тоа што е направено во туѓ делокруг. "},
	{17, "17 'Кој се фали, во Господ да се фали.' "},
	{18, "18 Зашто, не е достоен оној кој самиот се препорачува, туку оној кого Господ го препорачува. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct mk11 poems[] = {
	{1, "1 Ох, да можете уште малку да го истрпите моето безумие! Но, вие, бездруго, ме трпите! "},
	{2, "2 Зашто, љубоморам за вас со Божја љубомора; бидејќи ве свршив со еден маж, за да ве приведам како чиста девица пред Христос. "},
	{3, "3 Но се плашам, како што змијата ја измами Ева со своето лукавство, така и вашите мисли да не се одвратат од едноставноста и од чистотата на преданоста во Христос. "},
	{4, "4 Зашто, ако некој дојде да ви проповеда друг Исус кого ние не го проповедавме, или ако примате друг дух кого не го примивте, или друго Евангелие, кое не сте го прифатиле, вие сето тоа лесно го трпите. "},
	{5, "5 А, мислам дека во ништо не сум помал од познатите апостоли. "},
	{6, "6 Дури и да сум невешт во говорот, не сум во знаењето; тоа бездруго ви го покажавме во сите нешта. "},
	{7, "7 Грев ли сторив понижувајќи се самиот за да ве издигнам вас, кога бесплатно ви го проповедав Божјото Евангелие? "},
	{8, "8 Ограбив други цркви, примајќи од нив плата, за вам да ви служам. "},
	{9, "9 А кога бев кај вас и бев во нужда, никому не му бев на товар; зашто за моите потреби се погрижија браќата кои дојдоа од Македонија. И се пазев во сè, и ќе се пазам, да не ви бидам на товар. "},
	{10, "10 Христовата вистина е во мене, и оваа моја пофалба нема да биде ограничена во ахајските краишта! "},
	{11, "11 Зошто? Затоа ли што не ве љубам? Бог знае! "},
	{12, "12 А тоа што го правам, ќе го правам и во иднина, за да не им дадам можност на оние кои бараат повод да бидат сметани како нас во она во што се фалат. "},
	{13, "13 Зашто таквите луѓе се лажни апостоли, измамливи работници, кои се преправаат во Христови апостоли. "},
	{14, "14 И не е чудно, зашто и самиот сатана се преправа во ангел на светлината. "},
	{15, "15 Тогаш, не е голема работа, ако и неговите слуги се преправаат во слуги на праведноста, чиј крај ќе им биде според нивните дела. "},
	{16, "16 Пак велам, никој нека не ме смета за безумен; ако пак ме смета како таков, примете ме како безумен, за да имам барем малку да се пофалам. "},
	{17, "17 А она што го кажувам сега, не го кажувам како што би го кажал Господ, туку како во безумство, во смелоста на фалењето. "},
	{18, "18 И кога веќе мнозина се фалат по телото, и јас ќе се фалам; "},
	{19, "19 зашто вие, кои сте мудри, со задоволство ги трпите безумните! "},
	{20, "20 Имено, поднесувате ако некој ве заробува, ако некој ве проголтува, ако некој ви одзима, ако некој се возвишува себеси, ако некој ве удира по лице. "},
	{21, "21 За срам велам, како да бевме немоќни. Но ако е некој смел во нешто (зборувам во безумство) и јас сум смел. "},
	{22, "22 Евреи ли се? И јас сум. Израелци ли се? И јас сум. Авраамово потомство ли се? И јас сум. "},
	{23, "23 Христови служители ли се? (зборувам во безумство), јас сум уште повеќе. Повеќе се трудев, повеќепати бев во зандани, тепан безброј пати; многупати во смртна опасност. "},
	{24, "24 Од Евреите примив петпати по четириесет удари без еден. "},
	{25, "25 Трипати бев тепан со стапови, еднаш каменуван, трипати доживеав бродолом и ноќ и ден поминав на отворено море. "},
	{26, "26 Често патував, бев во опасности од реки, во опасности од разбојници, во опасности од сонародници, во опасности од неевреи; во опасности во град, во опасности во пустина, во опасности на море, во опасности меѓу лажни браќа; "},
	{27, "27 во труд и тешкотија, многупати во неспиење, во глад и жед, во многу постење, на студ и во голотија; "},
	{28, "28 покрај тие надворешни нешта, ме притискаат грижата за сите цркви. "},
	{29, "29 Кој изнемоштува, та да не изнемоштам и јас? Кој се соблазнува, а јас да не согорувам? "},
	{30, "30 Ако треба да се фалам, ќе се фалам со својата немоќ. "},
	{31, "31 Бог и Таткото на нашиот Господ Исус, Кој е благословен во вечни векови, знае дека не лажам. "},
	{32, "32 Bо Дамаск, намесникот на царот Арета, го чуваше дамасковиот град, сакајќи да ме фати, а јас бев спуштен низ прозорец, во кош, преку ѕидот и избегав од неговите раце. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct mk12 poems[] = {
	{1, "1 Валењето е потребно, иако не е полезно, но сепак ќе поминам на Господовите виденија и откровенија. "},
	{2, "2 Познавам еден човек во Христос, кој пред четиринаесет години, не знам дали во телото или надвор телото, Бог знае, беше грабнат и издигнат до третото небо. "},
	{3, "3 И за таквиот човек, не знам дали во телото или надвор од телото, Бог знае, "},
	{4, "4 знам дека беше грабнат и издигнат до рајот и дека чул неискажливи зборови, што човек не може да ги каже. "},
	{5, "5 Ќе се фалам со таков човек, а со себеси нема да се фалам, освен со своите немоќи. "},
	{6, "6 Зашто, дури и да сакам да се фалам, нема да бидам неразумен, бидејќи ќе ја зборувам вистината. Но се воздржувам, за да не помисли некој за мене повеќе, отколку што во мене гледа или од мене слуша. "},
	{7, "7 А за да не се возвишам поради многуте откровенија, даден ми е трн во телото, сатанин ангел, за да ме удира, за да не се возвишам! "},
	{8, "8 Трипати го преколнував Господ тоа да го отстрани од мене. "},
	{9, "9 А Тој ми рече: 'Доста ти е Мојата благодат, зашто Мојата сила се покажува совршена во немоќта.' Затоа, со поголема радост ќе се фалам во своите немоќи, за да ме осени Христовата сила. "},
	{10, "10 Затоа наоѓам задоволство во немоќите, навредите, маките, прогонувањата, тешкотиите заради Христос, зашто кога сум немоќен, тогаш сум силен. "},
	{11, "11 Станав безумен; вие ме принудивте. А требаше вие да ме препорачувате, зашто во ништо не сум помал од познатите апостоли, иако не сум никој и ништо. "},
	{12, "12 Знаците на вистинските апостоли беа извршени меѓу вас во секакво трпение, во чудотворни знаци, чуда и сили. "},
	{13, "13 Bо што бевте помалку од другите цркви, освен што јас не ви бев товар? Простете ми ја таа грешка! "},
	{14, "14 Еве, готов сум да дојдам кај вас и по третпат, и нема да ви бидам товар, зашто не го барам вашето, туку вас. Зашто, децата не се должни да печалат за родителите, туку родителите за децата. "},
	{15, "15 А јас со најголемо задоволство ќе потрошам сè и самиот ќе се потрошам за вашите души. Кога јас ве љубам толку многу, треба ли да бидам помалку љубен? "},
	{16, "16 Па нека биде така! Не ви бев товар, но сепак, како итар човек, ве добив со измама. "},
	{17, "17 Дали ве искористив преку некој од оние што ви ги испратив? "},
	{18, "18 Го замолив Тит и со него го испратив оној брат. Зар Тит ве искористи? Зар не живеевме по истиот дух? Не одевме ли по истите стапки? "},
	{19, "19 Bие веќе мислите дека се браниме пред вас! Пред Бог, во Христос, зборуваме, а сè е тоа, мили мои, за ваша надградба. "},
	{20, "20 Зашто се плашам, кога ќе дојдам, да не ве најдам такви какви што ве сакам, и да не се најдам и јас пред вас таков каков што вие не ме сакате; да не затекнам меѓу вас: кавги, завист, гнев, соперништво, клевети, шушукања, вообразеност, вознемирувања; "},
	{21, "21 и кога ќе дојдам пак, да не ме понизи мојот Бог пред вас и да не треба да плачам за мнозина, кои згрешиле порано, а не се покајале за нечистотата, блудството и срамните нешта што ги направиле. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct mk13 poems[] = {
	{1, "1 Ова е третпат како доаѓам кај вас. 'Од устата на двајца или тројца сведоци ќе биде потврдена секоја работа.' "},
	{2, "2 Како што ве предупредив кога бев кај вас вториот пат, така и сега ве предупредувам, кога не сум кај вас, дека тие што згрешиле пред тоа, и сите други, ако дојдам повторно, нема да ве поштедам, "},
	{3, "3 штом барате доказ дали зборува во мене Христос, Кој не е немоќен спрема вас, туку е силен во вас. "},
	{4, "4 Зашто, иако беше распнат во немоќ, сепак живее преку Божјата моќ. И ние исто така сме немоќни во Него, но ќе живееме преку Него од Божјата моќ спрема вас. "},
	{5, "5 Испитувајте се сами себеси дали сте во верата, проверете се сами себе! Или не го знаете ова за себеси, дека Исус Христос е во вас, освен ако не сте лажни. "},
	{6, "6 Но се надевам дека ќе познаете оти ние не сме лажни. "},
	{7, "7 Го молиме Бога да не направите никакво зло, не за да се потврдиме ние, туку за да правите вие добро, а ние да прилегаме на лажни. "},
	{8, "8 Затоа ние не можеме ништо против вистината, туку само за вистината. "},
	{9, "9 Имено, се радуваме кога сме ние слаби, а вие јаки; затоа и се молиме за вашето обновување. "},
	{10, "10 Затоа ви го пишувам ова, во отсуство, за да не постапам строго, кога ќе бидам кај вас, според власта што Господ ми ја даде за надградување, а не за разурнување. "},
	{11, "11 На крајот, браќа, радувајте се, усовршувајте се, утешувајте се, бидете едномисленици, живејте во мир; и Бог на љубовта и на мирот ќе биде со вас! "},
	{12, "12 Поздравете се еден друг со свет целив ! Bе поздравуваат сите светии! "},
	{13, "13 Благодатта на нашиот Господ Исус Христос, љубовта на Бог и заедништвото на Светиот Дух да бидат со сите вас!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};