#include <map>
#include <string>
class Bible49
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
	struct mk6	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Павле, преку Божја волја апостол на Исус Христос, до светиите во Ефес и верните во Христос Исус: "},
	{2, "2 благодат вам и мир од Бог, нашиот Татко и од Господ Исус Христос! "},
	{3, "3 Да биде благословен Бог и Таткото на нашиот Господ Исус Христос, Кој нè благослови во Христос, со секаков духовен благослов на небесата; "},
	{4, "4 зашто нè избра во Него уште пред создавањето на светот, за да бидеме свети и непорочни пред Него во љубов: "},
	{5, "5 Тој однапред нè определи за да нè посини преку Исус Христос, според благонаклоноста на Својата волја, "},
	{6, "6 за да биде величана славата на Неговата благодат, со која нè дарува во Bозљубениот; "},
	{7, "7 во Кого имаме откуп преку Неговата крв, прошка на престапите, според богатствата на Неговата благодат, "},
	{8, "8 која изобилно ја излеа на нас. Bо секоја мудрост и разумност "},
	{9, "9 ни ја соопшти тајната на Својата волја, според Својата благонаклоност, што ја одреди во Него, "},
	{10, "10 за да ја спроведе кога ќе се исполнат времињата; за да соедини повторно во Христос сè што е на небесата и што е на земјата. Bо Него, "},
	{11, "11 во Кого и ние бевме избрани за наследници, зашто бевме однапред определени според намерата на Оној Кој прави сè по советот на Својата волја, "},
	{12, "12 за да бидеме за величање на Неговата слава, ние, кои веќе отпорано се надевавме во Христос. "},
	{13, "13 Bо Него сте и вие, откако ја чувте пораката на вистината - Евангелието на вашето спасение - и откако поверувавте, запечатени со Светиот Дух на ветувањето, "},
	{14, "14 кој е залог за нашето наследство, за откупување на оние кои станаа Божја сопственост - за величање на Неговата слава. "},
	{15, "15 Затоа и јас, откако чув за вашата вера во Господ Исус и за вашата љубов кон сите светии, "},
	{16, "16 не престанувам да благодарам за вас, кога ве спомнувам во своите молитви, "},
	{17, "17 та Бог на нашиот Господ Исус Христос, Таткото на славата, да ви даде дух на мудрост и откровение во целосното познавање на Него. "},
	{18, "18 Молам и да ви се просветлат очите на вашето срце, за да знаете каква е надежта на Неговото призвание, какво е богатството на славата на Неговото наследство во светиите, "},
	{19, "19 и колку е ненадминлива Неговата сила кон нас кои веруваме - според дејствувањето на силата на Неговата моќ, "},
	{20, "20 чие дејство го покажа во Христос, кога Го воскресна од мртвите и го постави оддесно на Себеси на небесата, "},
	{21, "21 далеку над секое началство, власт, сила, господство и над секое име кое се спомнува, не само во овој век, туку и во идниот. "},
	{22, "22 И сè Му покори под Неговите нозе, а Него Го постави за глава над сè, за црквата, "},
	{23, "23 која е Негово тело - полнотата на Оној Кој исполнува сè во сè. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 И вие, кои бевте мртви поради вашите престапи и гревови, "},
	{2, "2 во кои живеевте некогаш според образецот на овој свет, според принцот на силите на воздухот - духот кој дејствува сега во синовите на непокорноста, "},
	{3, "3 меѓу кои и ние живеевме некогаш во своите телесни страсти, извршувајќи ги желбите на телото и на умот, и бевме по природа чеда на гневот како и останатите. "},
	{4, "4 Но Бог, Кој е богат со милост, поради Својата голема љубов со која нè засака, "},
	{5, "5 нè оживеа заедно со Христос и нас, кои иако бевме мртви поради нашите гревови (по благодат сте спасени) - "},
	{6, "6 и со Него нè воскресна и нè постави на небесата, во Христос Исус, "},
	{7, "7 та, во идните векови да го покаже ненадминливото богатство на Својата благодат, во љубезност спрема нас во Христос Исус. "},
	{8, "8 Зашто по благодат сте спасени, преку вера, и тоа не е од вас самите - тоа е Божји дар! "},
	{9, "9 Не е од делата, за да не се фали некој, "},
	{10, "10 зашто Негово дело сме, создадени во Христос Исус за добри дела, кои Бог однапред ги подготви, за да живееме во нив. "},
	{11, "11 Затоа спомнете си, дека вие кои некогаш бевте неевреи по тело, нарекувани необрежани од оние кои се нарекуваа обрежани по телото, со човечки раце; "},
	{12, "12 во она време бевте без Христос, исклучени од израелското општество и туѓинци на заветите на ветувањето, без надеж и без Бог во светот. "},
	{13, "13 А сега во Христос Исус, вие кои некогаш бевте далеку, доведени сте близу преку Христовата крв. "},
	{14, "14 Зашто Тој е нашиот мир, Кој од двете направи едно и го разурна преградниот ѕид, што ги делеше, "},
	{15, "15 и во Своето тело го укина непријателството, односно законот со неговите заповеди и одредби, и создавајќи мир, за во Себе да создаде од двата еден нов човек, "},
	{16, "16 и обата во едно тело да ги измири со Бог преку крстот, со што во Себе го уби непријателството. "},
	{17, "17 Тој дојде и ви проповедаше мир на вас кои бевте далеку и мир на оние кои беа близу: "},
	{18, "18 зашто преку Него, и едните и другите, имаме пристап кај Таткото во еден Дух. "},
	{19, "19 Затоа, вие не сте веќе туѓинци и придојдени, туку сте сограѓани на светиите и Божјо семејство, "},
	{20, "20 надѕидани врз основата на апостолите и пророците, а темелниот камен е Самиот Христос Исус, "},
	{21, "21 во Кого целата стројно составена зграда расте во свет храм во Господ, "},
	{22, "22 врз кого и вие во Духот заедно се соѕидувате во Божјо живеалиште. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Затоа јас, Павле, затвореник сум на Христос Исус заради вас неевреите, "},
	{2, "2 ако навистина сте чуле за управителството на Божјата благодат која ми е дадена за вас, "},
	{3, "3 дека по откровение ми беше соопштена тајната, како што порано пишав накратко. "},
	{4, "4 Читајќи оттаму можете да го разберете моето сфаќање на Христовата тајна "},
	{5, "5 што во другите поколенија не им беше објавена на човечките синови, како што сега преку Духот им е откриена на Неговите свети апостоли и пророци: "},
	{6, "6 дека неевреите се сонаследници и органи на телото, и соучесници на ветувањето во Христос Исус, преку Евангелието, "},
	{7, "7 на кое му станав служител согласно дарот на Божјата благодат, која ми беше дадена според делувањето на Неговата моќ. "},
	{8, "8 Мене, најмалиот од сите светии, ми е дадена оваа благодат за да им го навестувам на неевреите Евангелието на Христовото богатство кое не може целосно да се сфати "},
	{9, "9 и на сите да им расветлам во што се состои располагањето со тајната, која од вечноста беше скриена во Бог - Кој создаде сè; "},
	{10, "10 та многустраната Божја мудрост да им се соопшти сега преку црквата на началствата и на властите на небесата. "},
	{11, "11 Ова беше според вечната цел, која ја оствари во Христос Исус, нашиот Господ, "},
	{12, "12 во Кого имаме смелост и пристап со увереност преку верата во Него. "},
	{13, "13 Затоа ве молам да не се обесхрабрувате заради моите неволи, што ме снајдоа заради вас; зашто тие се ваша слава. "},
	{14, "14 Заради тоа ги преклонувам своите колена пред Таткото на нашиот Господ Исус Христос, "},
	{15, "15 од Кого секој род на небесата и на земјата го добива своето име; "},
	{16, "16 да ви даде, според богатството на Својата слава, да зајакнете со сила во внатрешниот човек преку Неговиот Дух, "},
	{17, "17 та преку вашата вера Христос да живее во вашите срца; да бидете вкоренети и втемелени во љубовта за "},
	{18, "18 да можете да сфатите со сите светии колкава е ширината, должината, височината и длабочината, "},
	{19, "19 и да ја познаете Христовата љубов, која го надминува знаењето, за да бидете исполнувани во целата Божја полнота. "},
	{20, "20 А на Оној, Кој може да направи неспоредливо повеќе, отколку што можеме да бараме или замислиме, според силата што дејствува во нас - "},
	{21, "21 Нему нека Му биде слава во црквата и во Христос Исус во сите поколенија засекогаш. Амин! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Затоа, ве молам, јас, затвореник на Господ, да живеете достојно за призванието во кое сте повикани, "},
	{2, "2 со сета понизност, кроткост и со трпеливост, поднесувајќи се едни со други во љубов! "},
	{3, "3 Настојувајте да го запазите единството на Духот во врската на мирот. "},
	{4, "4 Постои едно тело и еден Дух, како што бевте и вие повикани во една надеж на вашето призвание; "},
	{5, "5 еден Господ, една вера, едно крштавање, "},
	{6, "6 еден Бог и Татко на сите, Кој е над сите, преку сите и во сите. "},
	{7, "7 А секому од нас му е дадена благодат според мерата на Христовиот дар. "},
	{8, "8 Затоа се вели: 'Кога се вознесе, поведе робје; а на луѓето им даде дарови.' "},
	{9, "9 (А 'се вознесе' - што значи друго, освен дека исто така слегол во долните предели на земјата? "},
	{10, "10 Тој што слезе, тоа е Оној истиот Кој се вознесе над сите небеса, за да исполни сè.) "},
	{11, "11 И Тој даде едни за апостоли, а други за пророци; едни за евангелисти, а други за пастири и учители, "},
	{12, "12 за да се усовршат светиите за делото на службата, за изградување на Христовото тело, "},
	{13, "13 сè додека сите не дојдеме до единство во верата и познавањето на Божјиот Син, до зрелиот човек, до мерата на растот на Христовата полнота. "},
	{14, "14 Затоа да не бидеме веќе деца, фрлани натаму-наваму од бранови и носени од ветровите на некое учење, со човечка измама и лукавство, со итро измислени заблуди; "},
	{15, "15 туку, говорејќи ја вистината во љубов, ние треба да растеме во сè - кон Оној Кој е главата, Христос. "},
	{16, "16 Од Него, целото тело е поврзано и соединето во едно, на тој начин што секоја врска дава поткрепа според соодветно дејствување на секој одделен дел; тоа прави телото да расте за својата сопствена надградба во љубов. "},
	{17, "17 Затоа ова го велам и сведочам во Господ, да не живеете веќе како што живеат неевреите во суетата на својот ум, "},
	{18, "18 помрачени во својот разум, исклучени од Божјиот живот, заради незнаењето кое е во нив, заради закоравеноста на нивното срце. "},
	{19, "19 Откако станаа бесчувствени, се предадоа себеси на сладострастие, за ненаситно да вршат секаква нечистота. "},
	{20, "20 А вие не Го познавте така Христос, "},
	{21, "21 ако навистина сте Го чуле и ако сте во Него поучени онака како што е вистината во Исус, "},
	{22, "22 та во однос на своето поранешно поведение да го соблечете од себе стариот човек, кој пропаѓа според измамливите похоти, "},
	{23, "23 и да се обновувате во духот на својот ум, "},
	{24, "24 и бидете облечени во новиот човек, кој според Бог е создаден во вистинска праведност и светост. "},
	{25, "25 Затоа отфрлете ја лагата и зборувајте вистина секој со својот ближен, зашто сме органи едни на други! "},
	{26, "26 Гневете се, но не грешете! Сонцето да не зајде во вашиот гнев, "},
	{27, "27 и не давајте му место на ѓаволот! "},
	{28, "28 Кој крадел, да не краде веќе, туку подобро да се труди и да го работи со своите раце она што е добро, за да може да му дава на оној што има потреба! "},
	{29, "29 Никаков лош збор да не излегува од вашата уста, туку само полезен за изградување, каде што е потребно, за да им даде благодат на слушателите. "},
	{30, "30 И не жалостете Го Светиот Дух, со Кој сте запечатени за денот на избавувањето! "},
	{31, "31 Секоја горчина, гнев, јарост, викање и хулење да бидат отстранети од вас, заедно со секаква злоба. "},
	{32, "32 Бидете љубезни еден кон друг, чувствителни, проштавајќи си еден на друг, како што и Бог ви прости вам во Христос. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 И така, угледајте се на Бог, како мили чеда, "},
	{2, "2 и живејте во љубов, како што и Христос ве засака вас и Се предаде Себеси за нас, како принос и жртва на Бог, за благопријатен мирис. "},
	{3, "3 А блудство и секаква нечистотија или лакомост, да не се спомнуваат меѓу вас, како што им прилега на светиите! "},
	{4, "4 Ниту срамни и празни зборови, ниту непристојни шеги, туку подобро благодарности! "},
	{5, "5 Зашто, знајте го ова: ниеден блудник, ниеден нечист, ниеден алчник - кој е идолопоклоник - нема наследство во царството на Христос и Бог! "},
	{6, "6 Никој да не ве мами со празни зборови, зашто заради тие нешта доаѓа Божјиот гнев врз синовите на непокорноста. "},
	{7, "7 И така, не станувајте нивни соучесници! "},
	{8, "8 Зашто некогаш бевте темнина, но сега сте светлина во Господ; живејте како деца на светлината "},
	{9, "9 (зашто плодот на светлината се состои во секаква добрина, праведност и вистина!) "},
	{10, "10 и испитувајте што Му е по волја на Господ! "},
	{11, "11 И не бидете соучесници во бесплодните дела на темнината, туку изобличувајте ги, "},
	{12, "12 зашто срамно е и да се зборува за она што тие го вршат скришно. "},
	{13, "13 А сè станува јавно преку светлината, зашто сè што станува јавно, светлина е. "},
	{14, "14 Затоа се вели: 'Стани ти што спиеш, воскресни од мртвите и Христос ќе те осветли!' "},
	{15, "15 И затоа, внимавајте грижливо како живеете! Не како немудри, туку како мудри, "},
	{16, "16 исползувајќи го времето, зашто дните се зли! "},
	{17, "17 Па така, не бидете неразумни, туку разберете каква е Господовата волја! "},
	{18, "18 И не опивајте се со вино во кое е разузданоста, туку исполнувајте се со Духот, "},
	{19, "19 зборувајќи си со псалми, химни и духовни песни, пеејќи Му на Господ и воспевајќи Го во своето срце! "},
	{20, "20 Благодарете Му секогаш за сè на Бог Таткото, во името на нашиот Господ Исус Христос! "},
	{21, "21 Покорувајте се еден на друг со страхопочит кон Христос! "},
	{22, "22 Жените да им се покоруваат на своите мажи, како на Господ, "},
	{23, "23 зашто мажот е глава на жената, како што е и Христос глава на црквата, а Тој е Спасителот на телото! "},
	{24, "24 И како што црквата Му се покорува на Христос, така да им бидат и жените покорни во сè на своите мажи. "},
	{25, "25 Мажи, љубете ги своите жени, како што и Христос ја засака црквата и се предаде Сам Себеси за неа, "},
	{26, "26 за да ја освети, исчистувајќи ја преку водно капење со словото, "},
	{27, "27 и да ја претстави пред Себе црквата во сета нејзина слава, без дамка, ниту брчка, или нешто слично, за да биде света и непорочна. "},
	{28, "28 Така и мажите се должни да ги љубат своите жени како своите сопствени тела. Кој ја љуби својата жена, се љуби себеси. "},
	{29, "29 Зашто никој никогаш не го намразил своето тело, туку го храни и негува како и Христос црквата, "},
	{30, "30 зашто ние сме органи на Неговото тело. "},
	{31, "31 'Затоа човекот ќе ги остави татка си и мајка си, и ќе се прилепи кон својата жена, и двајцата ќе станат едно тело.' "},
	{32, "32 Оваа тајна е голема, а јас зборувам за Христос и црквата. "},
	{33, "33 И така, секој од вас да ја љуби својата жена како себеси, а жената да го почитува својот маж. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct mk6 poems[] = {
	{1, "1 Деца, бидете им послушни на своите родители во Господ, зашто така е исправно. "},
	{2, "2 'Почитувај ги својот татко и мајка (тоа е првата заповед со ветување) "},
	{3, "3 за да ти биде добро и за да живееш долго на земјата!' "},
	{4, "4 А вие, татковци, не дразнете ги вашите деца, туку воспитувајте ги во Господовиот ред и учење. "},
	{5, "5 Робови, покорувајте им се на вашите господари по тело со страв и трепет, во простота на своето срце, како на Христос! "},
	{6, "6 Не служете им само пред очите, како оние кои им угодуваат на луѓето, туку како Христови слуги, кои од сета душа ја извршуваат Божјата волја! "},
	{7, "7 Служете доброволно како на Господ, а не на луѓе, "},
	{8, "8 знаејќи дека секој, било роб или слободен, ако направи нешто добро, ќе го добие истото од Господ! "},
	{9, "9 А вие, господари, правете им го истото ним, без закани, знаејќи дека нивниот и вашиот Господар е на небесата и дека Тој не е пристрасен! "},
	{10, "10 Најпосле, бидете силни во Господ и во силата на Неговата моќ! "},
	{11, "11 Облечете се во сето Божјо оружје, за да можете да устоите на лукавствата на ѓаволот. "},
	{12, "12 Зашто нашата борба не е против крв и месо, туку против управителите, против властите, против световните мрачни сили на овој свет, против духовните сили на злото на небесата. "},
	{13, "13 Затоа земете го сето Божјо оружје, за да можете да се противставите во лош ден и откако ќе свршите сè, да се одржите! "},
	{14, "14 Затоа, стојте цврсто, препашани со вистината преку половината, облечени во оклопот на праведноста "},
	{15, "15 и со нозе обуени со подготвеност за Евангелието на мирот! "},
	{16, "16 А освен тоа земете го штитот на верата, со кој ќе можете да ги угаснете сите огнени стрели на злиот, "},
	{17, "17 земете го и шлемот на спасението и мечот на Духот - кој е Божјото слово, "},
	{18, "18 со секаква просба и молитва, молете се во Духот во секое време, и заради тоа бдејте со сета истрајност и со молба за сите светии "},
	{19, "19 и за мене, за да ми се даде порака кога ќе ја отворам устата, за да можам смело да ја соопштувам тајната на Евангелието, "},
	{20, "20 за кое сум пратеник во окови, за да зборувам смело како што и треба да зборувам. "},
	{21, "21 А за да знаете сè за мене и за сè што работам, ќе ве извести Тихик, милиот брат и верен служител во Господ, "},
	{22, "22 кого го праќам кај вас токму затоа, за да дознаете како сме ние и за да ги утеши вашите срца. "},
	{23, "23 Мир на браќата и љубов со вера од Бог Таткото и од Господ Исус Христос! "},
	{24, "24 Благодат со сите, кои беспрекорно Го љубат нашиот Господ Исус Христос!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};