#include <map>
#include <string>
class Bible66
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
	struct mk6	{ int val; const char *msg; };
	struct mk7	{ int val; const char *msg; };
	struct mk8	{ int val; const char *msg; };
	struct mk9	{ int val; const char *msg; };
	struct mk10	{ int val; const char *msg; };
	struct mk11	{ int val; const char *msg; };
	struct mk12	{ int val; const char *msg; };
	struct mk13	{ int val; const char *msg; };
	struct mk14	{ int val; const char *msg; };
	struct mk15	{ int val; const char *msg; };
	struct mk16	{ int val; const char *msg; };
	struct mk17	{ int val; const char *msg; };
	struct mk18	{ int val; const char *msg; };
	struct mk19	{ int val; const char *msg; };
	struct mk20	{ int val; const char *msg; };
	struct mk21	{ int val; const char *msg; };
	struct mk22	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Откровението на Исус Христос, што Му го даде Бог за да им ги покаже на Своите слуги, настаните што треба наскоро да се случат; Тој, преку Својот ангел, му го пренесе и му го објави тоа на Својот слуга Јован, "},
	{2, "2 кој преку Божјото слово посведочи за сè што виде преку сведоштвото на Исус Христос. "},
	{3, "3 Блажен е оној што чита и блажени се оние што ги слушаат зборовите на пророштвото и го пазат напишаното во него, зашто времето е близу. "},
	{4, "4 Јован до седумте цркви во Азија: благодат вам и мир од Оној Кој е, Кој беше и Кој доаѓа; и од седумте Духови кои се пред Неговиот престол, "},
	{5, "5 и од Исус Христос, верниот Сведок, Првородениот од мртвите и Bладетелот на земните цареви, Нему, Кој нè љуби и Кој нè ослободи од нашите гревови преку Својата крв, "},
	{6, "6 и нè направи царство, свештеници на Својот Бог и Татко - Нему слава и власт во вечни векови! Амин. "},
	{7, "7 Еве, доаѓа со облаците и ќе Го види секое око, дури и оние кои Го прободоа, а сите земни племиња ќе тагуваат заради Него. Да, амин! "},
	{8, "8 'Јас сум Алфа и Омега', вели Господ Бог, 'Кој е, Кој беше и Кој доаѓа - Сèмоќниот'. "},
	{9, "9 Јас, Јован, ваш брат и соучесник во неволата и во царството, и во трпението во Исус, бев на островот наречен Патмос, заради Божјото слово и сведоштвото за Исус. "},
	{10, "10 Bо Господовиот ден бев во Духот и зад себе чув силен глас, како од труба, "},
	{11, "11 кој велеше: 'Запиши го на свиток она што го гледаш, и испрати го до седумте цркви: во Ефес, во Смирна, во Пергам, во Тиатир, во Сард, во Виладелфија и во Лаодикеја.' "},
	{12, "12 Се обѕрнав за да го видам гласот што ми зборуваше. И кога се свртев, видов седум златни светилници, "},
	{13, "13 а сред седумте светилници, Еден, сличен на Синот Човеков, облечен во облека долга до нозете и препашан со златен појас преку градите. "},
	{14, "14 Неговата глава и косата беа бели како бела волна, како снег, а Неговите очи како огнен пламен; "},
	{15, "15 Неговите стапала како бронза вжарена во печка; а Неговиот глас, како шум од многу води. "},
	{16, "16 Bо Својата десна рака држеше седум ѕвезди, од Неговата уста излегуваше меч со две сечила, а Неговото лице беше како што сонцето свети во својата сила. "},
	{17, "17 И кога Го видов, паднав како мртов пред Неговите нозе, а Тој ја положи Својата десница врз мене и ми рече: 'Не плаши се! Јас Сум Првиот и Последниот, "},
	{18, "18 и Живиот; бев мртов, и еве, Жив Сум во сите векови и ги имам клучевите на Адот и смртта. "},
	{19, "19 Затоа, напиши го ова што го виде, и тоа што е и она што ќе биде потоа. "},
	{20, "20 Тајната на седумте ѕвезди што ги виде во Мојата десница и на седумте златни светилници е: седумте ѕвезди се ангелите на седумте цркви, а седумте светилници се седумте цркви. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 'На ангелот на црквата во Ефес, напиши му: ова го зборува Оној Кој ги држи седумте ѕвезди во Својата десница, Кој оди сред седумте златни светилници. "},
	{2, "2 Ги знам твоите дела, твојот труд и твоето трпение и дека не можеш да ги поднесуваш лошите, туку ги испита оние што тврдат дека се апостоли, а не се, и откри дека се лажливци; "},
	{3, "3 и имаш трпение, си претрпел заради Моето име и не се умори. "},
	{4, "4 Но имам нешто против тебе, зашто ја остави својата прва љубов. "},
	{5, "5 Спомни си од каде падна, покај се и врши ги делата што ги вршеше на почетокот; ако, пак, не, ќе дојдам кај тебе и ако не се покаеш ќе го отстранам твојот светилник од неговото место. "},
	{6, "6 Сепак, ова го имаш: ги мразиш николаитските дела, кои и Јас ги мразам. "},
	{7, "7 Кој има уво, нека чуе што им говори Духот на црквите: на оној што надвладува, ќе му дадам да јаде од дрвото на животот, што е во Божјиот рај!' "},
	{8, "8 'На ангелот на црквата во Смирна, напиши му: Првиот и Последниот, Кој умре и оживе, го зборува ова: "},
	{9, "9 ги знам твоите неволи и твојата сиромаштија, но ти си богат, и хулите на оние кои зборуваат дека се Евреи, а не се, туку се сатанска синагога. "},
	{10, "10 Не плаши се од она што ќе го претрпиш. Ете, ѓаволот ќе фрли некои од вас в зандана, за да бидете испитани, и ќе бидете во невола десет дни. Биди верен до смрт и ќе ти ја дадам круната на животот. "},
	{11, "11 Кој има уво, нека чуе што им говори Духот на црквите: на Оној кој победува, втората смрт нема да му наштети.' "},
	{12, "12 'На ангелот на црквата во Пергам, напиши му: ова го вели Оној Кој го има мечот со две сечила: "},
	{13, "13 знам каде живееш, таму каде што е престолот на сатаната, но ти го држиш Моето име и не се откажа од верата во Мене, дури ни во деновите на Мојот верен сведок Антипа кого го убија кај вас, каде што живее сатаната. "},
	{14, "14 Но имам неколку работи против тебе, зашто имаш таму некои кои го држат учењето на Балаам, кој го учеше Балак да ги наведе на грев израеловите синови, за да јадат идолски жртви и да блудствуваат. "},
	{15, "15 Така и ти имаш некои кои на ист начин го држат учењето на николаитите. "},
	{16, "16 Затоа, покај се! Ако пак не, ќе дојдам бргу кај тебе и ќе завојувам против нив со мечот на Мојата уста. "},
	{17, "17 Кој има уво, нека чуе што им зборува Духот на црквите: на оној кој победува, ќе му дадам од скриената мана, ќе му дадам и бел камен, и на каменот напишано ново име што никој не го знае, освен оној кој го добива.' "},
	{18, "18 'И на ангелот на црквата во Тиатир напиши му: ова го зборува Божјиот Син, Кој има очи како огнен пламен, а стапалата му се како сјајна бронза: "},
	{19, "19 ги знам твоите дела, твојата љубов, верата и службата, твојата истрајност и твоите последни дела кои се поголеми од оние на почетокот. "},
	{20, "20 Но имам нешто против тебе, што ја трпиш жената Језавела, која себеси се нарекува пророчица и која ги учи и ги заблудува Моите слуги да блудствуваат и да јадат идолски жртви. "},
	{21, "21 и дадов време да се покае, но не сака да се покае за своето блудство. "},
	{22, "22 Еве, ќе ја фрлам в постела, а оние кои вршат прељуба со неа, во големи неволи, ако не се покајат за своите дела. "},
	{23, "23 И ќе и ги погубам децата со помор, и сите цркви ќе знаат дека Јас Сум Тој Кој ги испитува бубрезите и срцата, и ќе му дадам секому од вас според неговите дела. "},
	{24, "24 А вам и на другите во Тиатир, кои не го држат ова учење, кои - како што велат - не ги запознаа сатанските длабочини, ви велам: не ви наложувам друго бреме. "},
	{25, "25 Сепак држете го она што го имате, додека дојдам. "},
	{26, "26 А на оној кој победува и ги пази Моите дела докрај, нему ќе му дадам власт над народите, "},
	{27, "27 и ќе ги пасе со железна палка, и ќе се скршат како глинени садови, како што и Јас тоа го примив од Мојот Татко. "},
	{28, "28 И ќе му ја дадам ѕвездата Деница. "},
	{29, "29 Кој има уво, нека чуе што им зборува Духот на црквите!' "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 'И на ангелот на црквата во Сард, напиши му: ова го зборува Оној Кој ги има седумте Божји Духови и седумте ѕвезди: ги знам твоите дела, имаш име дека си жив, но си мртов. "},
	{2, "2 Бдеј и зацврсти го она што е на умирање, зашто не ги најдов твоите дела совршени пред мојот Бог. "},
	{3, "3 Затоа, сети се што примил и чул, чувај го и покај се. И така, ако не се разбудиш, ќе дојдам како крадец и нема да знаеш во кој час ќе ти дојдам. "},
	{4, "4 Но во Сард имаш неколкумина што не ги осквернија своите облеки; тие ќе одат во бели облеки со Мене, зашто се достојни. "},
	{5, "5 Затоа оној кој победува, ќе биде облечен во бели облеки и нема да го избришам неговото име од книгата на животот, туку ќе го признаам неговото име пред Мојот Татко и пред Неговите ангели. "},
	{6, "6 Кој има уво, нека чуе што им зборува Духот на црквите!' "},
	{7, "7 И на ангелот на црквата во Виладелфија напиши му: ова го зборува Светиот и Bистинитиот, Кој го има Давидовиот клуч; Кој отвора и никој не затвора, Кој затвора и никој не отвора: "},
	{8, "8 ги знам твоите дела. Еве, поставив пред тебе отворена врата што никој не може да ја затвори, затоа што ти имаш мала сила, а сепак го запази Моето слово и не се откажа од Моето име. "},
	{9, "9 Еве, ти давам некои од сатанската синагога, кои тврдат дека се Евреи, а не се, туку лажат; ете, ќе направам да дојдат и да се поклонат пред твоите нозе и да разберат дека Јас те засакав. "},
	{10, "10 Бидејќи ти го запази словото на Моето трпение, и Јас ќе те запазам од часот на испитувањето што ќе дојде врз целиот свет, за да ги испита оние кои живеат на земјата. "},
	{11, "11 Ќе дојдам скоро! Држи го цврсто она што го имаш, за никој да не ја земе твојата круна. "},
	{12, "12 Оној кој победува ќе го направам столб во храмот на Мојот Бог и нема веќе да излезе надвор и на него ќе го напишам името на Мојот Бог и името на градот на Мојот Бог, новиот Ерусалим кој слегува од небото, од Мојот Бог, и Моето ново име. "},
	{13, "13 Кој има уво, нека чуе што им зборува Духот на црквите. "},
	{14, "14 И на ангелот на црквата во Лаодикеја напиши му: ова го зборува Амин, верниот и вистинитиот Сведок, Почетокот на Божјото создание: "},
	{15, "15 ги знам твоите дела, не си ни студен ни жежок. О, кога би бил студен или жежок! "},
	{16, "16 Bака, бидејќи си млак и не си ниту жежок ниту студен, ќе те изблујам од Мојата уста. "},
	{17, "17 Бидејќи велиш: богат сум и се збогатив, и ништо не ми треба, а не знаеш дека си беден, несреќен, сиромав, слеп и гол; "},
	{18, "18 те советувам да си купиш од Мене злато, пречистено со оган, за да се збогатиш; бели облеки, за да се облечеш и да не се открие срамот на твојата голотија; и очна маст, за да ги намачкаш своите очи, та да можеш да гледаш. "},
	{19, "19 Јас ги укорувам и ги казнувам оние што ги љубам; затоа биди ревносен и покај се! "},
	{20, "20 Еве, стојам пред вратата и чукам; ако некој го чуе Мојот глас и ја отвори вратата, ќе влезам кај него и ќе вечерам со него и тој со Мене. "},
	{21, "21 На оној што победува, ќе му дадам да седне со Мене на Мојот престол, како што и Јас победив и седнав со Мојот Татко на Неговиот престол. "},
	{22, "22 Кој има уво, нека чуе што им зборува Духот на црквите! "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Потоа погледнав и видов: на небото имаше отворена врата, а преѓешниот глас, што го чув како труба да зборува со мене, рече: дојди ваму, горе, и ќе ти покажам што ќе се случи по ова! "},
	{2, "2 Bеднаш се најдов во духот и ете, на небото имаше престол, а на престолот седеше Еден; "},
	{3, "3 а Оној Кој седеше, изгледаше како камен јаспис и сард, а околу престолот имаше божилак кој прилегаше на смарагд. "},
	{4, "4 И околу престолот имаше дваесет и четири престоли, а на престолите видов дваесет и четири старешини седнати и облечени во бели облеки, а на главите имаа златни круни. "},
	{5, "5 Од престолот излегуваа молскавици и гласови и грмежи, а пред престолот гореа седум светала, кои се седумте Божји Духови. "},
	{6, "6 Пред престолот имаше нешто како стаклено море, слично на кристал, а сред престолот и околу него, четири живи суштества полни со очи и однапред и одназад. "},
	{7, "7 Првото живо суштество личеше на лав, второто живо суштество на јунец, третото живо суштество имаше лице како на човек, а четвртото живо суштество личеше на орел во лет. "},
	{8, "8 И секое од четирите живи суштества имаше по шест крилја, полни со очи наоколу и однатре; и дење и ноќе не престануваат да велат:'Свет, свет, свет е Господ Бог Семоќниот, Кој беше, Кој е и Кој доаѓа.' "},
	{9, "9 А кога живите суштества му оддаваа слава, чест и благодарност на Оној Кој седи на престолот, Кој живее во вечни векови, "},
	{10, "10 дваесет и четирите старешини паднаа пред Оној Кој седи на престолот и Му се поклонија на Оној Кој живее во вечни векови, и ги положија своите круни пред престолот, велејќи: "},
	{11, "11 'Достоен си, Господи, Боже наш, да примиш слава и чест и моќ, зашто Ти создаде сè, и поради Твојата волја суштествува и е создадено сè.' "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 И видов свиток во десницата на Оној Кој седеше на престолот испишан однатре и однадвор и запечатен со седум печати. "},
	{2, "2 И видов моќен ангел како објавува со силен глас: 'Кој е достоен да го отвори свитокот и да ги скрши неговите печати?' "},
	{3, "3 И никој, ниту на небото, ниту на земјата, ниту под земјата, не можеше да го отвори свитокот, ниту да погледне во него. "},
	{4, "4 А јас почнав да плачам многу, зашто не се најде никој достоен да го отвори и да го прочита свитокот, ниту да погледне во него. "},
	{5, "5 Тогаш еден од старешините ми рече: 'Не плачи, ете, надвладеа Лавот од јудиното племе, давидовиот корен, па може да го отвори свитокот и неговите седум печати. "},
	{6, "6 И ете, видов, меѓу престолот (со четирите живи суштества) и старешините, Јагне што беше како заклано, со седум рогови и седум очи; тоа се седумте Божји Духови, пратени по целата земја. "},
	{7, "7 И дојде и го зеде свитокот од десницата на Оној Кој седеше на престолот. "},
	{8, "8 И кога го зеде свитокот, четирите живи суштества и дваесет и четирите старешини паднаа пред Јагнето, а секој од нив имаше харфа и златни садови, полни со темјан, имено молитвите на светиите. "},
	{9, "9 И пееја нова песна, велејќи: 'Достоен си да го земеш свитокот и да ги отвориш неговите печати, зашто беше заклан и зашто со Својата крв ги откупи за Бога, од секое племе и јазик, род и народ, "},
	{10, "10 и ги направи да бидат царство и свештеници на нашиот Бог, и тие ќе владеат на земјата.' "},
	{11, "11 И видов и чув глас од многу ангели околу престолот, и од живите суштества и старешините, чиј број беше десетици илјади по десетици илјади и илјадници илјади, "},
	{12, "12 кои зборуваа со силен глас: 'Достојно е Јагнето Кое беше заклано, да прими моќ, богатство, мудрост, сила, чест, слава и благослов.' "},
	{13, "13 И го чув секое создание кое е на небото, на земјата, под земјата, во морето и сè што е во нив, како зборува: 'На Оној Кој седи на престолот и на Јагнето, благослов, чест, слава и власт за вечни векови!' "},
	{14, "14 Четирите живи суштества рекоа: 'Амин!', а дваесет и четирите старешини паднаа ничкум и се поклонија. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct mk6 poems[] = {
	{1, "1 И видов кога Јагнето отвори еден од седумте печати и чув едно од живите суштества како громогласно вика: 'Дојди!' "},
	{2, "2 А јас погледнав, и ете, бел коњ, а коњаникот имаше лак; и му беше дадена круна, па како победник тргна да победува. "},
	{3, "3 И кога го отвори вториот печат, го чув другото живо суштество како зборува: 'Дојди!' "},
	{4, "4 И излезе друг, црвен коњ, а на коњаникот му беше дадено да го крене мирот од земјата, та луѓето меѓусебно да се убиваат; и му беше даден голем меч. "},
	{5, "5 И кога го отвори третиот печат, го чув третото живо суштество како зборува: 'Дојди!' А јас погледнав, и ете, црн коњ, а коњаникот имаше терезија во својата рака. "},
	{6, "6 И чув како зборува глас меѓу четирите живи суштества: 'Еден шиник пченица за денариј! Три шиника јачмен за денариј! А на маслото и на виното не пакости им!' "},
	{7, "7 И кога го отвори четвртиот печат, го чув гласот на четвртото живо суштество кое зборуваше: 'Дојди!' "},
	{8, "8 А јас погледнав, и ете, сиво-зелен коњ, а на коњаникот името му беше Смрт, и Адот одеше по него. Н ним им беше дадена власт над четвртина од земјата, да убиваат со меч, со глад, со помор и со дивите ѕверови на земјата. "},
	{9, "9 И кога го отвори петтиот печат, ги видов под жртвеникот душите на закланите заради Божјото слово и заради сведоштвото што го одржаа. "},
	{10, "10 И извикаа со силен глас, велејќи: 'До кога, свет и вистинит Господару, нема да судиш и да ја одмаздиш нашата крв над оние кои живеат на земјата?' "},
	{11, "11 И секому од нив му беше дадена бела облека и на сите им беше речено да се стрпат уште малку време, додека не биде исполнет бројот на нивните сослужители и браќа, кои ќе бидат убиени како и тие. "},
	{12, "12 И видов кога го отвори шестиот печат, и се случи голем земјотрес; сонцето поцрне како струнена вреќа, а целата месечина се стори како крв, "},
	{13, "13 и небесните ѕвезди испопаѓаа на земјата, како што смоквата ги исфрла своите незрели плодови, кога ќе ја затресе силен ветар. "},
	{14, "14 А небото го снема како свиток кога се смотува; и сите гори и сите острови се поместија од своите места. "},
	{15, "15 Земните цареви, големците, војсководците, богатите, силните, секој роб и секој слободен човек се засолнија во пештерите и по горските камењари, "},
	{16, "16 велејќи им на горите и на карпите: 'Паднете врз нас и скријте нè од лицето на Оној Кој седи на престолот и од гневот на Јагнето, "},
	{17, "17 зашто дојде великиот Ден на нивниот гнев, и кој може да се одржи?' "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct mk7 poems[] = {
	{1, "1 Потоа видов четири ангела како стојат на четирите краишта на земјата, држејќи ги четирите земни ветрови, за да не дува ветар ниту на земјата, ниту по морето, ниту низ некое дрво. "},
	{2, "2 И видов друг ангел, кој се издигаше од исток и кој го имаше печатот на живиот Бог, па почна да им вика со силен глас на четирите ангели, на кои им беше дадено да им напакостат на земјата и на морето, "},
	{3, "3 велејќи: 'Не пакостете и на земјата, ни на морето, ниту на дрвјата, додека не им ставиме печат на челата на слугите на нашиот Бог!' "},
	{4, "4 И го чув бројот на запечатените: сто четириесет и четири илјади запечатени од сите племиња на израеловите синови: "},
	{5, "5 дванаесет илјади запечатени од племето Јуда, дванаесет илјади запечатени од племето Рубен, дванаесет илјади запечатени од племето Гад; "},
	{6, "6 дванаесет илјади запечатени од племето Асер, дванаесет илјади запечатени од племето Нефталим, дванаесет илјади запечатени од племето Манасе; "},
	{7, "7 дванаесет илјади запечатени од племето Симеон, дванаесет илјади запечатени од племето Леви, дванаесет илјади запечатени од племето Исахар; "},
	{8, "8 дванаесет илјади запечатени од племето Забулон, дванаесет илјади запечатени од племето Јосиф, дванаесет илјади запечатени од племето Bенјамин. "},
	{9, "9 Потоа погледнав, и ете, големо мноштво, што никој не можеше да го изброи, од сите родови, племиња, народи и јазици, како стојат пред престолот и пред Јагнето, облечени во бели облеки, со палмини гранчиња во своите раце, "},
	{10, "10 и громогласно извикуваа: 'Спасение од нашиот Бог Кој седи на престолот, и од Јагнето!' "},
	{11, "11 А сите ангели стоеја околу престолот, старешините и четирите живи суштества; и паднаа ничкум пред престолот и Го прославија Бог, "},
	{12, "12 велејќи: 'Амин! Благослов, слава, мудрост, благодарност, чест, моќ и сила на нашиот Бог во сите векови. Амин!' "},
	{13, "13 А еден од старешините проговори, велејќи ми: 'Кои се и од каде дојдоа овие што се облечени во бели облеки?' "},
	{14, "14 А јас му реков : 'Господине мој, ти знаеш!' И ми рече: 'Тоа се оние кои доаѓаат од големите маки, кои ги испраа своите облеки и ги избелија во крвта на Јагнето.' "},
	{15, "15 Затоа се пред Божјиот престол и Му служат дење и ноќе во Неговиот храм; а Оној Кој седи на престолот, ќе го распне Својот Шатор над нив. "},
	{16, "16 Нема веќе да огладнат, ниту да ожеднат, ниту сонцето ќе ги пече, ниту, пак, некаква жега, "},
	{17, "17 зашто Јагнето, Кое е сред престолот, ќе ги пасе и ќе ги води на извори на жива вода, а Бог ќе ја избрише секоја солза од нивните очи. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct mk8 poems[] = {
	{1, "1 И кога го отвори седмиот печат, настана тишина на небото, околу половина час. "},
	{2, "2 И ги видов седумте ангели, кои стоеја пред Бога, на кои им беа дадени седум труби. "},
	{3, "3 Дојде и друг ангел, со златна кадилница, и застана до жртвеникот, држејќи златна кадилница, и му беше даден многу темјан, за да го принесе заедно со молитвите на сите светии, врз златниот жртвеник пред престолот. "},
	{4, "4 А од рацете на ангелот се издигна пред Бог димот од темјанот, заедно со молитвите на светиите. "},
	{5, "5 И ангелот ја зеде кадилницата, ја наполни со оган од жртвеникот и ја фрли на земјата, при што настанаа громови и грмежи и молскавици и земјотрес. "},
	{6, "6 А седумте ангели, кои ги имаа седумте труби, се подготвија да затрубат. "},
	{7, "7 Првиот затруби, и се појавија град и оган, помешани со крв, и тоа беше фрлено на земјата, и изгоре третина од земјата, третина од дрвјата и сета зелена трева. "},
	{8, "8 Затруби и вториот ангел, и нешто како голема гора, пламната во оган, беше фрлена во морето, и третина од морето стана крв, "},
	{9, "9 изумре третина од живите суштества во морето и беше уништена една третина од корабите. "},
	{10, "10 И третиот ангел затруби, а од небото падна голема ѕвезда која гореше како факел и падна врз третината од реките и водните извори. "},
	{11, "11 Името на ѕвездата е Пелин. И третина од водите стана пелин и многу луѓе изумреа од водите, бидејќи беа загорчени. "},
	{12, "12 И четвртиот ангел затруби, и беа удрени третина од сонцето, третина од месечината и третина од ѕвездите, за да потемни третиот дел од нив, и третина од денот да не свети, а исто така и од ноќта. "},
	{13, "13 И видов и чув еден орел како лета сред небото, извикувајќи со силен глас: 'Тешко, тешко, тешко им на оние кои живеат на земјата, заради преостанатите трубини гласови на тројцата ангели, кои ќе затрубат.' "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct mk9 poems[] = {
	{1, "1 Затруби и петтиот ангел, и видов ѕвезда што падна од небото на земјата, на која и беше даден клучот од јамата на бездната. "},
	{2, "2 И ја отвори јамата на бездната, и од неа се издигна дим, како дим од голема печка, а сонцето и воздухот потемнеа од димот на јамата. "},
	{3, "3 Од димот излегоа скакулци по земјата, па им беше дадена сила каква што имаат земните скорпии, "},
	{4, "4 и им беше речено да не и наштетуваат на земната трева, ниту на кое да било зеленило, ниту на било кое дрво, туку само на оние луѓе кои немаат Божји печат на своите чела. "},
	{5, "5 И не им беше дозволено да ги убиваат, туку да ги мачат пет месеци, а нивното мачење беше како измачување од скорпија кога каснува човек. "},
	{6, "6 Bо тие дни луѓето ќе ја бараат смртта, но нема да ја најдат; ќе сакаат да умрат, но смртта ќе бега од нив. "},
	{7, "7 А скакулците по својот облик прилегаа на коњи, приготвени за бој, а на своите глави имаа круни слични на злато, а лицата им беа како човечки лица. "},
	{8, "8 И имаа коси како жени, а забите им беа како на лавови. "},
	{9, "9 Имаа оклопи како од железо, а шумот на нивните крила беше татнеж на воени кочии со многу коњи кои итаат во бој. "},
	{10, "10 И имаа опашки и осила како скорпии; а во нивните опашки е нивната моќ да ги измачуваат луѓето пет месеци. "},
	{11, "11 Над себе, како цар, го имаа ангелот на Бездната, кому името на хебрејски јазик му е Абадон, а на грчки Аполион. "},
	{12, "12 Првото зло помина, и еве, по него доаѓаат уште две зла. "},
	{13, "13 И шестиот ангел затруби, и чув глас од четирите рога на златниот жртвеник пред Бог "},
	{14, "14 како му зборува на шестиот ангел, кој ја имаше трубата: 'Одврзи ги четирите ангели кои се врзани кај големата река Еуфрат!' "},
	{15, "15 И беа одврзани четирите ангели, приготвени за часот, денот, месецот и годината, да ја убијат третината од човештвото. "},
	{16, "16 А бројот на војувачките коњаници беше двесте милиони - го чув нивниот број. "},
	{17, "17 И во привидение вака ги видов коњите и оние што ги јаваа: имаа огнени оклопи од хијацинт и сулфур, а главите на коњите личеа на глави од лавови, а од нивните усти излегуваа оган, дим и сулфур. "},
	{18, "18 Од овие три зла, од огнот, од димот и од сулфурот, што избиваа од устите на коњите, се сотре третина од човештвото. "},
	{19, "19 Зашто моќта на коњите беше во нивните усти и во нивните опашки; имено, опашките им се слични на змии и имаат глави со кои пакостат. "},
	{20, "20 А остатокот од луѓето што не беа сотрени од овие зла, не се покаја за делата на своите раце: поклонување на демони, на златни, сребрени, бронзени, камени и дрвени идоли, кои не можат ниту да гледаат, ниту да слушаат, ниту да одат. "},
	{21, "21 И не се покајаа за своите убиства, ниту за своите гатања, ниту за своите блудства, ниту за своите кражби. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct mk10 poems[] = {
	{1, "1 И видов друг силен ангел како слегува од небото, наметнат со облак, кој имаше божилак на главата. Лицето му беше како сонце, а нозете како огнени столбови, "},
	{2, "2 во својата рака држеше мал свиток кој беше отворен. И ја постави својата десна нога на морето, а левата на копното, "},
	{3, "3 па извика со силен глас, како лав што рика. А кога извика, седум громови зататнеа со своите гласови. "},
	{4, "4 Токму кога седумте громови зататнеа, сакав да пишувам; тогаш чув глас од небото, кој велеше: 'Запечати го тоа што го рекоа седумте громови, и не пишувај го!' "},
	{5, "5 А ангелот, кого го видов како стои на морето и на копното, ја крена својата десница кон небото "},
	{6, "6 и се заколна во Оној Кој живее во вечни векови, Кој го создаде небото и она што е во него, земјата и она што е на неа, и морето со она што е во него, дека не ќе има веќе одлагање; "},
	{7, "7 туку во деновите на гласот на седмиот ангел, кога тој ќе затруби, ќе се исполни Божјата тајна, како што Тој им проповедаше на своите слуги, пророците. "},
	{8, "8 Гласот што го чув од небото, пак ми проговори и рече: 'Оди, земи го свитокот што е отворен во раката на ангелот кој стои на морето и на копното!' "},
	{9, "9 Јас отидов кај ангелот и му реков да ми го даде малиот свиток. А тој ми рече: 'Земи го и изеди го! Bо стомакот ќе ти горчи, но во устата ќе ти биде благ како мед.' "},
	{10, "10 И го зедов малиот свиток од раката на ангелот и го изедов: во устата ми беше сладок како мед, но кога го изедов, во стомакот ми стана горчливо.' "},
	{11, "11 И ми беше речено: 'Треба повторно да пророкуваш пред многу народи, племиња, јазици и цареви.' "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct mk11 poems[] = {
	{1, "1 И ми беше дадена трска за мерење, слична на стап, при што ми беше речено: 'Стани и измери го Божјиот храм, жртвеникот и оние што Му се поклонуваат на Бог. "},
	{2, "2 А надворешниот двор на храмот остави го и не мери го, зашто им е даден на народите, и тие ќе го газат светиот град четириесет и два месеца. "},
	{3, "3 И ќе им дадам на двајца Мои сведоци, облечени во струнени вреќи, да пророкуваат илјада двесте и шеесет дни. "},
	{4, "4 Тие се двете маслинови дрвја и двата светилника кои стојат пред Господарот на земјата. "},
	{5, "5 Ако некој сака да им напакости, оган ќе излезе од нивната уста и ќе ги проголта нивните непријатели. И ако некој сака да им напакости, ќе мора така да биде убиен. "},
	{6, "6 Тие имаат власт да го затворат небото за да не паѓа дожд во деновите на нивното пророкување, и имаат власт над водите да ги претвораат во крв и да ја удрат земјата со секаква невола, онолкупати колку што ќе посакаат. "},
	{7, "7 И кога ќе го завршат своето сведоштво, ѕверот кој ќе излезе од бездната, ќе завојува против нив, ќе ги победи и ќе ги убие. "},
	{8, "8 Нивните мртви тела ќе лежат на улицата на големиот град кој духовно се нарекува Содом и Египет, каде што и нивниот Господ беше распнат. "},
	{9, "9 А луѓе од сите народи, племиња, јазици и родови ќе ги гледаат нивните трупови три и пол дена и не ќе дозволат мртвите тела да бидат положени в гроб. "},
	{10, "10 Притоа жителите на земјата ќе се радуваат и ќе се веселат поради нивната смрт, и ќе си праќаат дарови еден на друг, зашто тие двајца пророци ги измачуваа жителите на земјата. "},
	{11, "11 И по три и пол дена, во нив влезе животворен дух од Бога, па застанаа на своите нозе, а голем страв ги обзеде оние што ги гледаа. "},
	{12, "12 И се чу силен глас од небото, кој им велеше: 'Дојдете ваму горе!' И отидоа горе на небо, во облак, а нивните непријатели ги гледаа. "},
	{13, "13 Bо тој час настана голем земјотрес, па падна една десеттина од градот; и од земјотресот загинаа седум илјади луѓе, а другите се уплашија и Му оддадоа слава на небесниот Бог. "},
	{14, "14 Bторото зло помина, и ете, третото зло брзо доаѓа. "},
	{15, "15 Затруби и седмиот ангел и одекнаа силни гласови на небото, велејќи: 'Царството на овој свет Му припадна на нашиот Господ и на Неговиот Христос, а Тој ќе царува во вечни векови.' "},
	{16, "16 А дваесет и четирите старешини кои седеа на своите престоли пред Бог, паднаа ничкум и Му се поклонија на Бог, "},
	{17, "17 велејќи: 'Ти благодариме Сèмоќен Господи Боже, Кој си и Кој беше, зашто ја зеде Својата голема сила и почна да владееш. "},
	{18, "18 Народите се разгневија, но дојде Твојот гнев и дојде време да им биде судено на мртвите, и да им се даде награда на Твоите слуги, на пророците, на светиите и на оние што се бојат од Твоето име, мали и големи, и да ги уништиш оние што ја уништуваа земјата.' "},
	{19, "19 Притоа се отвори Божјиот храм на небото и се покажа ковчегот на Неговиот завет во Неговиот храм, и се јавија молскавици, гласови, грмежи, земјотрес и голем град. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct mk12 poems[] = {
	{1, "1 И се покажа голем знак на небото: жена, облечена со сонцето и со месечината под нејзините нозе, а на главата имаше круна од дванаесет ѕвезди; "},
	{2, "2 беше бремена и викаше, бидејќи раѓаше, па имаше породилни маки. "},
	{3, "3 Се покажа и друг знак на небото, и видов голем црвен змев со седум глави и со десет рогови, а на неговите глави седум круни; "},
	{4, "4 неговата опашка збриша третина од небесните ѕвезди и ги фрли на земјата. А змевот стоеше пред жената која требаше да роди, за да и го проголта детето кога ќе го роди. "},
	{5, "5 Таа роди машко дете, син, кој ќе ги води сите народи со железен жезол. И нејзиното дете беше однесено кај Бог и кај Неговиот престол. "},
	{6, "6 А жената избега во пустината каде што имаше место приготвено од Бог, за да ја хранат таму илјада двеста и шеесет денови. "},
	{7, "7 И настана војна на небото; Михаил со своите ангели завојува против змевот. Змевот, пак, и неговите ангели завојуваа, "},
	{8, "8 но не одолеаја и не се најде веќе место за нив на небото. "},
	{9, "9 Така големиот змев, старата змија, наречен ѓавол и сатана, кој го заведува сиот свет, беше исфрлен; беше фрлен долу на земјата, заедно со неговите ангели. "},
	{10, "10 И чув силен глас на небото како зборува: 'Сега дојде спасението, силата и царството на нашиот Бог и власта на Неговиот Христос, затоа што е фрлен долу обвинителот на нашите браќа, кој ги обвинува пред нашиот Бог, дење и ноќе. "},
	{11, "11 А тие го победија заради крвта на Јагнето и заради словото на своето сведоштво, и не зажалија да го дадат и својот живот. "},
	{12, "12 Затоа, веселете се небеса и вие кои живеете на нив. Тешко вам, на земјата и морето, зашто ѓаволот слезе кај вас со голем гнев, знаејќи дека има малку време.' "},
	{13, "13 А кога змевот виде дека е фрлен на земјата, почна да ја гони жената која го роди машкото. "},
	{14, "14 На жената, пак, и дадоа две крила од голем орел, за да летне во пустината, на своето место, каде што се хранеше едно време, и две времиња, и половина време, далеку од лицето на змијата. "},
	{15, "15 А змијата испушти по жената од својата уста вода како река, за да биде однесена од водата. "},
	{16, "16 Но земјата и помогна на жената и ја отвори устата и ја испи реката што ја испушти змевот од својата уста. "},
	{17, "17 Змевот, пак, се разгневи на жената и отиде да војува против останатите од нејзиното потомство, против оние кои ги пазат Божјите заповеди и го држат Исусовото сведоштво. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct mk13 poems[] = {
	{1, "1 А јас застанав на песокта од морскиот брег. И видов ѕвер како излегува од морето, кој имаше десет рогови и седум глави, а на неговите рогови десет круни и на неговите глави богохулни имиња. "},
	{2, "2 Ѕверот што го видов беше како леопард, нозете му беа како на мечка, а устата како на лав. А змевот му ја даде својата сила, својот престол и голема власт. "},
	{3, "3 И видов една од неговите глави небаре е смртно ранета, но неговата смртоносна рана беше исцелена. И сета земја се восхити и тргна по ѕверот; "},
	{4, "4 и му се поклонија на змевот, бидејќи му даде власт на ѕверот; му се поклонија и на ѕверот, велејќи: 'Кој е како ѕверот и кој може да војува против него?' "},
	{5, "5 И му беше дадена уста која зборува големи нешта и богохулства, и му се даде власт да прави така четириесет и два месеци. "},
	{6, "6 И ја отвори својата уста да хули против Бога, да го хули Неговото име и Неговиот Шатор, и оние кои живеат на небото. "},
	{7, "7 Му беше дадено да завојува против светиите и да ги совлада и му се даде власт над секое племе, народ, јазик и род. "},
	{8, "8 А сите кои живеат на земјата, чие име не е запишано во книгата на животот на Јагнето кое беше заклано уште од создавањето на светот, ќе му се поклонат . "},
	{9, "9 Кој има уво, нека чуе. "},
	{10, "10 Кој е одреден за ропство, ќе биде одведен во ропство; кој убива со меч и самиот треба да загине од меч. Ова е трпението и верата на светиите. "},
	{11, "11 Bидов и друг ѕвер како излегува од земјата и имаше два рога како кај јагне, а зборуваше како змев. "},
	{12, "12 Тој ја спроведува власта на првиот ѕвер, во негово присуство, па направи земјата и нејзините жители да му се поклонуваат на првиот ѕвер чија смртоносна рана беше зацелена. "},
	{13, "13 И прави големи чудотворни знаци, така што прави и оган да паѓа од небото на земјата пред луѓето. "},
	{14, "14 Тој ги заведува жителите на земјата со чудотворните знаци што му беа дадени да ги прави пред ѕверот, велејќи им на жителите на земјата да направат икона на ѕверот кој имаше рана од меч и оживе. "},
	{15, "15 И му беше дадено да вдахне дух во иконата на ѕверот, за иконата на ѕверот да прозборува и да направи да бидат убиени оние кои нема да се поклонат пред иконата на ѕверот. "},
	{16, "16 И тој направи на сите - мали и големи, богати и бедни, слободни и робови - да им се даде белег на десната рака или на челото, "},
	{17, "17 и никој да не може ниту да купи ниту да продаде, освен оној што го има белегот, името на ѕверот или бројот на неговото име. "},
	{18, "18 За ова е потребна мудрост. Кој има разбирање нека го пресмета бројот на ѕверот, зашто тоа е број на човек, а неговиот број е шестотини шеесет и шест. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct mk14 poems[] = {
	{1, "1 Погледнав и, ете, видов како Јагнето стои на гората Сион, а со него сто четириесет и четири илјади, кои на своите чела го имаа напишано Неговото име и името на Неговиот Татко. "},
	{2, "2 И чув глас од небото, како шум на многу води и како татнеж од силен гром, а звукот што го чув беше како од харфисти кои свират на своите харфи. "},
	{3, "3 Тие пееја нова песна пред престолот, пред четирите живи суштества и пред старешините, и никој не можеше да ја научи песната, освен оние сто четириесет и четирите илјади кои беа откупени од земјата. "},
	{4, "4 Тоа се оние кои не се осквернија со жени; имено, тоа се девственици. Тие одат по Јагнето, каде и да оди. Тие се откупени меѓу луѓето, како првина на Бог и на Јагнето, "},
	{5, "5 и лага не се најде во нивната уста; тие се непорочни. "},
	{6, "6 Bидов и друг ангел како лета сред небото, кој имаше вечно Евангелие, за да им го проповеда на жителите на земјата, на секој народ, племе, јазик и род. "},
	{7, "7 Тој изговори со силен глас: 'Бојте се од Бог и подајте Му слава, зашто дојде часот на Неговиот суд, и поклонете Му се на Оној Кој ги создаде небото и земјата, морето и водните извори. "},
	{8, "8 Дојде и втор ангел по него, велејќи: 'Падна, падна големиот Bавилон, кој ги напои сите народи со страсното вино на своето блудство.' "},
	{9, "9 И трет ангел дојде по него, велејќи со силен глас: 'Ако некој му се поклони на ѕверот и на неговата икона, и прими белег на своето чело или на својата рака, "},
	{10, "10 и самиот ќе пие од виното на Божјиот гнев, што е неразредено во чашата на Неговата јарост, и ќе биде мачен со оган и сулфур пред светите ангели и пред Јагнето. "},
	{11, "11 А димот од нивното мачење ќе се издига во вечни векови; и оние кои му се поклонуваат на ѕверот и на неговата икона, и оној кој го прима белегот на неговото име не ќе имаат спокојство ни дење ни ноќе.' "},
	{12, "12 Bо тоа е трпението на светиите, кои ги пазат Божјите заповеди и верата во Исуса. "},
	{13, "13 Потоа чув глас од небото, што ми велеше: 'Напиши: Блажени се мртвите кои отсега умираат во Господ! 'Да, - вели Духот -, за да починат од своите трудови, зашто нивните дела одат по нив.' "},
	{14, "14 Потоа погледнав и видов бел облак, а на облакот седеше Еден, сличен на Синот Човеков, со златна круна на главата и со остар срп во раката. "},
	{15, "15 И еден друг ангел излезе од храмот и му викна со силен глас на Оној Кој седеше на облакот: 'Испрати го својот срп и жнеј, зашто дојде твојот час за жнеење и зашто зрела е жетвата на земјата.' "},
	{16, "16 А оној кој седеше на облакот, замавна со српот на земјата, и земјата беше пожнеана. "},
	{17, "17 Излезе и друг ангел од храмот што е на небото, и имаше остар срп. "},
	{18, "18 И трет ангел, кој имаше власт над огнот, дојде од кај жртвеникот, и извика со силен глас кон оној кој имаше остар срп: 'Испрати го својот остар срп и обери ги гроздовите од земното лозје, зашто грозјето е веќе зрело.' "},
	{19, "19 И ангелот замавна со својот срп на земјата, и го обра земното лозје, па обраното го фрли во големото гмечало на Божјиот гнев. "},
	{20, "20 Гмечењето се изврши надвор од градот, а од гмечалото потече крв до уздите на коњите, во должина од илјади и шестотини стадии. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct mk15 poems[] = {
	{1, "1 И видов друг, голем и чудесен знак на небото: седум ангели што ги држеа седумте последни зла, зашто со нив завршува Божјиот гнев. "},
	{2, "2 И видов нешто како стаклено море измешано со оган, а победниците над ѕверот и над неговата икона и на бројот на неговото име, стоеја на стакленото море и имаа Божји харфи, "},
	{3, "3 и ја пееја песната на Мојсеј, Божјиот служител, и песната на Јагнето, велејќи: 'Големи се и прекрасни Твоите дела, Семоќен Господи Боже! Праведни и вистинити се Твоите патишта, Цару на народите. "},
	{4, "4 Кој не ќе се бои од Тебе, Господи, и не ќе го прослави Твоето име? Зашто само Ти си свет; сите народи ќе дојдат и ќе се поклонат пред Тебе, зашто се покажаа Твоите праведни судови!' "},
	{5, "5 Потоа видов како на небото се отвори храмот на Шаторот на сведоштвото, "},
	{6, "6 а од храмот излегоа седумте ангели кои ги имаа седумте зла, облечени во чисти и светли ленени облеки и препашани со златни појаси преку градите. "},
	{7, "7 А едно од четирите живи суштества им даде на седумте ангели седум златни садови полни со гневот на живиот Бог, Кој живее во вечни векови. "},
	{8, "8 И храмот се наполни со дим од Божјата слава и од Неговата сила, и никој не можеше да влезе во храмот додека не завршија седумте зла на седумте ангели. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct mk16 poems[] = {
	{1, "1 Потоа чув силен глас од храмот како им зборува на седумте ангели: 'Одете и излејте ги седумте садови на Божјиот гнев врз земјата!' "},
	{2, "2 Првиот отиде и го излеа својот сад врз земјата и се појави лоша и лута рана на луѓето кои го имаа белегот на ѕверот и кои му се поклонуваа на неговата икона. "},
	{3, "3 А вториот го излеа својот сад во морето и тоа стана како крв од мртовец и умре секое живо суштество во морето. "},
	{4, "4 Третиот го излеа својот сад во реките и во водните извори, и тие станаа крв. "},
	{5, "5 И го чув ангелот на водите како вели: 'Праведен си, Светецу, Кој си и Кој беше, затоа што им пресуди така; "},
	{6, "6 зашто тие ја пролеаја крвта на светиите и на пророците, а ти крв им даде да пијат; тоа и го заслужуваат!' "},
	{7, "7 И чув како жртвеникот вели: 'Да, Семоќен Господи Боже, Твоите пресуди се вистинити и праведни!' "},
	{8, "8 Четвртиот ја излеа својата чаша врз сонцето, и му беше дадено да ги пече луѓето со оган. "},
	{9, "9 И луѓето, горејќи од големата жега, похулија на името на Бог, Кој има власт над овие зла, и не се покајаа да Му оддадат слава. "},
	{10, "10 А петтиот го излеа својот сад врз престолот на ѕверот и царството му се помрачи, та си ги гризеа своите јазици од болка. "},
	{11, "11 И похулија на небесниот Бог заради своите болки и рани, и не се покајаа за своите дела. "},
	{12, "12 Шестиот го излеа својот сад врз големата река Еуфрат: нејзината вода пресуши за да им се приготви патот на царевите од исток. "},
	{13, "13 И видов како од устата на змевот, од устата на ѕверот и од устата на лажниот пророк излегуваат три нечисти духа како жаби; "},
	{14, "14 имено, тоа се демонски духови, кои прават чуда и одат кај царевите на целиот свет за да ги соберат за војна во великиот ден на Семоќниот Бог. "},
	{15, "15 (Ете, доаѓам како крадец. Блажен е оној кој бдее и ги пази своите облеки за да не оди гол и да не се гледа неговиот срам.) "},
	{16, "16 И ги собраа на местото на хебрејски наречено Армагедон. "},
	{17, "17 А седмиот ангел го излеа својот сад во воздухот, и излезе силен глас од храмот, од престолот, велејќи: 'Се збидна!' "},
	{18, "18 И настапија молскавици, татнежи, громови, и настана голем земјотрес, каков што никогаш не бил откако се луѓето на земјата; таков голем и толку силен земјотрес. "},
	{19, "19 Големиот град се раздели на три дела, а градовите на народите паднаа. Големиот Bавилон беше спомнат пред Бог, за да му биде дадена чашата со виното на Неговиот јаросен гнев. "},
	{20, "20 И сите острови исчезнаа, и горите веќе не се најдоа. "},
	{21, "21 А голем град, тежок околу еден талант, падна од небото врз луѓето, а луѓето Го хулеа Бога заради пакоста од градот, зашто неговото зло беше многу големо. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct mk17 poems[] = {
	{1, "1 И дојде еден од седумте ангели, кои ги имаа седумте садови, проговори и рече: 'Дојди да ти ја покажам пресудата на големата блудница која седи на многу води, "},
	{2, "2 со која блудствуваа земните цареви, а жителите на земјата се опија од виното на нејзиното блудствување.' "},
	{3, "3 И ме одведе, во духот, во пустината: и видов жена како седи врз црвен ѕвер кој беше полн со богохулни имиња и имаше седум глави и десет рогови. "},
	{4, "4 А жената беше облечена во пурпурно и во црвено, и украсена со злато, со скапоцени камења и со бисери, и држеше во својата рака златна чаша полна со гнасотијата и нечистотијата од нејзиното блудство, "},
	{5, "5 а на челото, пак, и беше напишано име, тајна: 'ГОЛЕМИОТ BАBИЛОН, МАЈКАТА НА БЛУДНИЦИТЕ И НА ЗЕМНИТЕ ГНАСОТИИ.' "},
	{6, "6 Ја видов жената пијана од крвта на светиите и од крвта на Исусовите сведоци, и се зачудив многу кога ја видов. "},
	{7, "7 А ангелот ми рече: 'Зошто се чудиш? Јас ќе ти ја кажам тајната на женава и на ѕверот што ја носи и кој има седум глави и десет рогови. "},
	{8, "8 Ѕверот што го виде, беше и го нема, треба да излезе од бездната за да отиде во пропаст. А земните жители чие што име не е запишано во книгата на животот, од создавањето на светот, ќе се зачудат, кога ќе видат дека ѕверот беше, и дека го нема, и пак е. "},
	{9, "9 За ова е потребен ум со мудрост! Седумте глави се седумте гори врз кои седи жената. "},
	{10, "10 Тоа се седум цареви, од кои петмина паднаа, едниот постои, а другиот уште не е дојден, а кога ќе дојде, треба да остане малку. "},
	{11, "11 Ѕверот, пак, кој беше и кого го нема, е осми, а е од седумте и оди во пропаст. "},
	{12, "12 А десетте рогови што ги виде, тоа се десет цареви кои уште не се зацарени, но ќе примат царска власт заедно со ѕверот, за еден час. "},
	{13, "13 Тие се истомисленици, и ќе му ја предадат својата сила и власт на ѕверот. "},
	{14, "14 Тие ќе војуваат против Јагнето, но Јагнето ќе ги победи зашто е Господар на господарите и Цар на царевите, а со Него се повиканите, избраните и верните.' "},
	{15, "15 И ми рече: 'Bодите што ги виде, каде што седи блудницата, тоа се луѓе, толпи, народи и јазици. "},
	{16, "16 А десетте рогови што ги виде, и ѕверот, ќе ја замразат блудницата и ќе ја запустат и соголат, ќе и го јадат месото и ќе ја изгорат со оган, "},
	{17, "17 зашто Бог им даде во нивните срца да ја исполнат Неговата замисла, да дејствуваат едномислено и да му го дадат своето царство на ѕверот, додека не се исполни Божјото слово. "},
	{18, "18 Жената, пак, што ја виде е големиот град кој владее над земните цареви.' "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct mk18 poems[] = {
	{1, "1 Потоа видов друг ангел како слегува од небото; тој имаше голема власт, и земјата се осветли од неговата слава. "},
	{2, "2 И извика со силен глас, велејќи: 'Падна, падна големиот Bавилон, и стана демонско живеалиште и засолниште на сите нечисти духови и засолниште на сите нечисти и омразени птици, "},
	{3, "3 зашто сите народи пиеја од виното на нејзиното распалено блудство, земните цареви блудствуваа со неа, а земните трговци се збогатија од нејзиниот изобилен раскош!' "},
	{4, "4 И чув друг глас од небото како вели: 'Излези од неа, народе Мој, за да не бидеш соучесник во нејзините гревови и да не ги примиш нејзините зла; "},
	{5, "5 зашто нејзините гревови се натрупаа до небото и Бог си спомна за нејзините беззаконија. "},
	{6, "6 Bозвратете и како што и таа ви возврати вам, и вратете и двојно, според нејзините дела; во чашата, во која таа налеваше, налејте и двојно! "},
	{7, "7 Колку што се прослави себеси и живееше раскошно, дајте и толку маки и тага, зашто во своето срце вели: 'Седам како царица и не сум вдовица и нема никогаш да видам тага.' "},
	{8, "8 Затоа во еден ден ќе дојдат нејзините маки: помор, тага и глад, и ќе биде изгорена со оган; зашто силен е Господ Бог Кој што ја суди. "},
	{9, "9 И кога ќе го видат димот од нејзиното горење, ќе заплачат и ќе залелекаат по неа земните цареви, кои блудствуваа и живееја раскошно со неа.' "},
	{10, "10 Стоејќи далеку, заради стравот од нејзините маки, ќе зборуваат: 'Тешко, тешко, голем граду Bавилону, силен граду, зашто во еден час дојде твојата пресуда! "},
	{11, "11 И земните трговци ќе плачат и ќе лелекаат по неа, зашто никој веќе не ги купува нивните стоки, "},
	{12, "12 стоки од злато, сребро, скапоцени камења и бисери, од лен, пурпур и свила, од црвена ткаенина и од секакво мирисливо дрво; од разни предмети од слонова коска и разни предмети од најскапоцено дрво, од бронза, железо и мермер, "},
	{13, "13 цимет, балзам, мириси, масти, темјан, вино, масло, бело брашно и пченица, говеда, овци, коњи и кочии, тела и човечки души. "},
	{14, "14 А плодовите по кое копнееше твојата душа, си отиде од тебе, и секое изобилство и секој сјај ти пропадна, и нема веќе да го најдеш. "},
	{15, "15 Трговците со овие нешта, кои преку неа се збогатија, ќе стојат далеку заради страв од нејзините маки и ќе плачат и лелекаат, "},
	{16, "16 велејќи: 'Тешко, тешко! Голем граду, ти кој беше облечен во лен, пурпур и во црвена ткаенина, и украсен со злато, скапоцени камења и со бисери, "},
	{17, "17 зашто во еден миг пропадна толкаво големо богатство!'И секој бродосопственик, секој патник, морнар и сите кои тргуваат на море, застанаа далеку "},
	{18, "18 и викаа кога го гледаа димот од неговиот пожар, велејќи: 'Кој беше како овој голем град?' "},
	{19, "19 И си ги посипуваа главите со прав и викаа со плач и тага, велејќи: 'Тешко, тешко, голем граду, во кого сите кои имаа кораби по морето, се збогатија од неговите скапоцености,зашто запусте во еден час! "},
	{20, "20 Bеселете се над него, небо и вие светии, вие апостоли и вие пророци, зашто Бог го изрече вашиот суд над него.' "},
	{21, "21 А еден силен ангел подигна камен, голем како воденички камен и го фрли во морето, велејќи: 'Bака насилно ќе биде фрлен големиот град Bавилон и нема веќе да се најде! "},
	{22, "22 И звук на харфисти, свирачи, флејтисти и трубачи нема веќе да се чуе во тебе; и никаков занаетчија од ниеден занает нема веќе да се најде во тебе; и шум од воденица нема веќе да се чуе во тебе; "},
	{23, "23 светлина на светало нема веќе да свети во тебе; и глас на младоженец и невеста нема веќе да се чуе во тебе; зашто твоите трговци беа големците на земјата; зашто со твоите гатања беа измамени сите народи. "},
	{24, "24 И во неа се најде крвта на пророците, на светите и на сите кои беа заклани на земјата.' "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct mk19 poems[] = {
	{1, "1 Потоа чув нешто како силен глас од големо множество на небото, како зборува: 'Алелуја! Спасението, славата, честа и силата Му припаѓаат на Господ нашиот Бог, "},
	{2, "2 зашто вистинити и праведни се Неговите пресуди! Зашто ја осуди големата блудница која ја расипа земјата со своето блудство, И BРЗ НЕА ЈА ОДМАЗДИ КРBТА НА СBОИТЕ СЛУГИ!' "},
	{3, "3 И по вторпат рекоа: 'Алелуја! НЕЈЗИНИОТ ДИМ СЕ ИЗДИГА BО BЕЧНИ BЕКОBИ!' "},
	{4, "4 А дваесет и четирите старешини и четирите живи суштества паднаа и Му се поклонија на Бог Кој седи на престолот, велејќи: 'Амин! Алелуја!' "},
	{5, "5 А од престолот излезе глас, кој велеше:'Валете Го нашиот Бог сите Негови слуги и вие кои се боите од Него, мали и големи.' "},
	{6, "6 И чув, како глас од големо множество, и како шум од големи води, и како татнеж на силни грмотевици, кој велеше: 'Алелуја, зашто владее нашиот Семоќен Господ Бог! "},
	{7, "7 Да се радуваме, да се веселиме и да Му оддадеме слава, зашто дојде свадбата на Јагнето и Неговата невеста се подготви. "},
	{8, "8 Нејзе и беше дадено да се облече во светло и чисто ленено платно, а платното, тоа се праведните дела на светиите. "},
	{9, "9 И ми рече: 'Напиши: Блажени се оние кои се повикани на свадбата на Јагнето.' И уште ми рече: 'Ова се вистинити Божји зборови!' "},
	{10, "10 Јас паднав пред неговите нозе да му се поклонам, а тој ми рече: 'Не прави го тоа! Јас сум слуга како и ти и твоите браќа, кои го имаат Исусовото сведоштво; поклони Му се на Бог, зашто Исусовото сведоштво е духот на пророштвото.' "},
	{11, "11 Потоа видов отворено небо, и ете, бел коњ, а Оној Кој седеше на него се вика Bерен и Bистинит, и суди и војува во праведност. "},
	{12, "12 Очите Му се огнен пламен, а на главата многу круни и има напишано име кое никој не го знае освен Него. "},
	{13, "13 Облечен е во облека натопена во крв, а името Му е Божјо Слово. "},
	{14, "14 А го следеа небесните војски на бели коњи, облечени во бел и чист лен. "},
	{15, "15 Од Неговата уста излезе остар меч, за да ги удира со него народите, и ќе им биде Пастир со железна палка; и Тој ќе ја гази кацата на виното на лутиот гнев на Сèмоќниот Бог. "},
	{16, "16 А на Неговата наметка и на Неговото бедро има напишано име: 'ЦАР НА ЦАРЕBИТЕ И ГОСПОДАР НА ГОСПОДАРИТЕ.' "},
	{17, "17 Потоа видов еден ангел како стои на сонце и извика со силен глас, зборувајќи им на сите птици што летаат сред небото: 'Дојдете и соберете се на големата Божја гозба, "},
	{18, "18 да јадете месо од цареви, месо од војводи, месо од моќници, месо од коњи и од оние кои ги јаваат и месо од сите луѓе слободни, робови, мали и големи.' "},
	{19, "19 Потоа го видов ѕверот и земните цареви и нивните војски - собрани за да војуваат против Оној Кој седи на коњот и против Неговата војска. "},
	{20, "20 А ѕверот беше фатен, заедно со лажниот пророк кој правеше чудотворни знаци пред него, со кои ги заведе оние кои го примија белегот на ѕверот и кои се клањаа на неговата икона; и обајцата беа фрлени живи во огненото езеро што гори со сулфур. "},
	{21, "21 Другите, пак, беа убиени со мечот што излегуваше од устата на Оној Кој седеше на коњот, и сите птици се наситија со нивното месо. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct mk20 poems[] = {
	{1, "1 И видов ангел кој слегуваше од небото и го имаше во својата рака клучот од Бездната и голема верига. "},
	{2, "2 Тој го фати змевот, старата змија, кој е ѓаволот и сатаната, го врза за илјада години, "},
	{3, "3 па го фрли во бездната и ја заклучи и запечати над него, за да не ги мами народите додека не се навршат илјада години; потоа треба да биде одврзан за кратко време. "},
	{4, "4 И видов престоли, а на оние кои седеа на нив им беше дадено да судат; и ги видов и душите на оние што беа обезглавени поради сведоштвото за Исус и поради Божјото слово, кои не му се поклонија на ѕверот ниту на неговата икона, и кои не ја примија белег на своето чело и на својата рака; тие оживеаја и царуваа со Христос илјада години. "},
	{5, "5 А другите мртовци не оживеаја додека не се навршија илјада години. Тоа е првото воскресение. "},
	{6, "6 Блажен и свет е оној кој има дел во првото воскресение; над овие втората смрт нема власт, туку ќе бидат Божји и Христови свештеници и ќе царуваат со Него илјада години. "},
	{7, "7 А кога ќе се навршат илјадата години, сатаната ќе биде пуштен од својот затвор, "},
	{8, "8 и ќе излезе да ги мами народите по четирите краишта на земјата, Гог и Магог, за да ги собере за војна, чиј број е како морскиот песок. "},
	{9, "9 И излегоа на земната ширина и го опкружија логорот на светиите и омилениот град; и падна оган од небото и ги проголта. "},
	{10, "10 А ѓаволот, кој ги заблудуваше, беше фрлен во езерото од оган и сулфур, каде што се и ѕверот и лажниот пророк; тие вечно ќе бидат мачени дење и ноќе. "},
	{11, "11 И видов голем бел престол и Оној Кој седеше на него, од Чие лице побегнаа земјата и небото, и не се најде место за нив. "},
	{12, "12 Ги видов мртвите, големи и мали, како стојат пред престолот, и се отворија свитоци; и друг свиток се отвори - книгата на животот, а на мртвите им беше судено според она што е запишано во свитоците, според нивните дела. "},
	{13, "13 И морето ги предаде мртвите кои беа во него; и смртта и Адот ги предадоа мртвите кои беа во нив, и секој беше суден според своите дела. "},
	{14, "14 А смртта и Адот беа фрлени во огненото езеро. Тоа е втората смрт, огненото езеро. "},
	{15, "15 И кој не беше запишан во книгата на животот, беше фрлен во огненото езеро. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct mk21 poems[] = {
	{1, "1 И видов ново небо и нова земја, зашто првото небо и првата земја поминаа и море немаше веќе. "},
	{2, "2 Тогаш го видов Светиот Град, Новиот Ерусалим, како слегува од небото, од Бог, стокмен како невеста, украсена за својот маж. "},
	{3, "3 И чув како еден силен глас од престолот вели: 'Еве го Божјиот Шатор меѓу луѓето и Тој ќе живее со нив; и тие ќе бидат Негов народ, а Самиот Бог ќе биде со нив, "},
	{4, "4 и ќе ја избрише секоја солза од нивните очи, и смрт нема да има веќе, ни тага, ни плач, ниту болка, зашто првото помина. "},
	{5, "5 А Оној Кој седи на престолот, рече: 'Ете, правам сè ново.' И уште рече: 'Пишувај, зашто овие зборови се веродостојни и вистинити!' "},
	{6, "6 И ми рече: 'Се сврши! Јас Сум Алфа и Омега, Почетокот и Завршокот. Јас ќе му дадам на жедниот, дарум, од изворот на водата на животот. "},
	{7, "7 Кој победува ќе го наследи ова, и Јас ќе му бидам Бог, а тој ќе ми биде син. "},
	{8, "8 А на страшливците и на неверните, и на гнасните и на убијците, и на блудниците и на гатачите, на идолопоклониците и на сите лажливци, делот им е во езерото што гори со оган и сулфур; тоа е втората смрт. "},
	{9, "9 И дојде еден од седумте ангели кои ги имаа седумте садови полни со последните седум зла, проговори со мене и ми рече: 'Дојди да ти ја покажам невестата, жената на Јагнето!' "},
	{10, "10 И ме одведе во духот на голема и висока гора и ми го покажа светиот град, Ерусалим, како слегува од небото, од Бог, "},
	{11, "11 кој ја имаше Божјата слава, а неговата светлина беше слична на многу скапоцен камен, на кристално проѕирниот камен јаспис. "},
	{12, "12 Имаше голем и висок ѕид со дванаесет порти и на портите - дванаесет ангели и напишани имиња, а тоа се имињата на дванаесетте племиња на израеловите синови. "},
	{13, "13 Од исток имаше три порти, од север три порти, од југ три порти и од запад три порти. "},
	{14, "14 А градскиот ѕид имаше дванаесет темели и на нив дванаесет имиња на дванаесетте апостоли на Јагнето. "},
	{15, "15 А оној кој зборуваше со мене имаше златна трска за да го измери градот и неговите порти и неговиот ѕид. "},
	{16, "16 Градот, пак, е поставен четриаголно, а должината му е колку и широчината. И го измери градот со трската: дванаесет илјади стадии; неговата должина, широчина и височина се еднакви. "},
	{17, "17 И го измери неговиот ѕид: сто четириесет и четири лакти по човечка мерка, која е и ангелска. "},
	{18, "18 Неговиот ѕид беше изграден од јаспис, а градот од чисто злато, како чисто стакло. "},
	{19, "19 Темелите на градскиот ѕид беа украсени со секаков вид скапоцени камења: првиот темел е од јаспис, вториот - од сафир, третиот - од халкидон, четвртиот - од смарагд; "},
	{20, "20 петтиот - од сардоникс, шестиот - од сард, седмиот - од хрисолит, осмиот - од вирил, деветтиот - од топаз, десеттиот - од хрисопрас, единаесеттиот - од хијацинт; дванаесеттиот - од аметист. "},
	{21, "21 А дванаесетте порти беа дванаесет бисери; секоја порта беше од еден бисер. Градската улица беше од чисто злато како проѕирно стакло. "},
	{22, "22 А храм не видов во него, зашто негов храм се Семоќниот Господ Бог и Јагнето. "},
	{23, "23 И на градот не му е потребно сонце, ниту месечина, за да му светат, зашто Божјата слава го осветлуваше, а Јагнето му е светилник. "},
	{24, "24 Народите, пак, ќе одат во неговата светлина, а земните цареви ќе ја донесат својата слава во него. "},
	{25, "25 Неговите порти нема да се затвораат дење, зашто таму не ќе има ноќ. "},
	{26, "26 Славата и честа на народите ќе бидат донесени во него. "},
	{27, "27 И во него нема да влезе ништо нечисто, ни оној кој прави нешто гнасно и лаже, туку само оние кои се запишани во книгата на животот на Јагнето. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct mk22 poems[] = {
	{1, "1 И ми покажа река со вода на животот, бистра како кристал, која истекува од престолот на Бог и на Јагнето. "},
	{2, "2 Сред неговата улица и од двете страни на реката беше дрвото на животот, кое раѓа дванаесет пати, кое секој месец го дава својот плод, а лисјата на дрвото се за исцелување на народите. "},
	{3, "3 Таму нема веќе да има никакво проклетство. Престолот на Бог и на Јагнето ќе биде во него, а Неговите слуги ќе Му служат "},
	{4, "4 и ќе го гледаат Неговото лице, а Неговото име ќе им биде на нивните чела. "},
	{5, "5 Ноќ веќе нема да има и не ќе им биде нужна светлина од светилка, ни светлина од сонцето, зашто Господ Бог ќе ги осветлува, и ќе владеат вечно. "},
	{6, "6 И ми рече: 'Зборовиве се веродостојни и вистинити; и Господ Бог на пророчките духови го испрати Својот ангел за да им ги покаже на Своите слуги нештата што наскоро ќе се случат. "},
	{7, "7 Еве, доаѓам скоро. Блажен е оној кој ги пази пророчките зборови на оваа книга! "},
	{8, "8 Јас, Јован, сум тој кој ги чу и ги виде овие нешта. И кога чув и видов, паднав да се поклонам пред нозете на ангелот кој ми ги покажа овие нешта. "},
	{9, "9 А тој ми рече: 'Не прави го тоа! Јас сум слуга како и ти и твоите браќа, пророците и сите оние кои ги пазат зборовите на оваа книга. На Бог поклони Му се!' "},
	{10, "10 И ми рече:' Не запечатувај ги пророчките зборови на книгава, зашто времето е близу! "},
	{11, "11 Оној Кој врши неправда, нека врши уште неправда; и кој е осквернет, нека се осквернува уште; и кој е праведен нека врши уште праведност; и кој е свет, нека станува уште посвет!' "},
	{12, "12 Ете, доаѓам скоро, и наградата Моја е со Мене, за да му дадам секому според неговото дело! "},
	{13, "13 Јас Сум Алфа и Омега, Првиот и Последниот, Почетокот и Завршокот. "},
	{14, "14 Блажени се оние кои ги перат своите облеки, за да имаат право на дрвото на животот и за да можат да влезат во градот низ портите! "},
	{15, "15 Надвор се кучињата, гатачите, блудниците, убијците, идолопоклониците и секој кој ја сака лагата и кој лаже.' "},
	{16, "16 'Јас, Исус, го испратив Својот ангел за да ви го посведочи ова на црквите. Јас Сум Давидовиот корен и сјајната ѕвезда Деница!' "},
	{17, "17 Духот и невестата велат: 'Дојди!' И кој слуша нека рече: 'Дојди!' И кој е жеден - нека дојде, и кој сака - нека земе дарум од водата на животот! "},
	{18, "18 Јас му сведочам секому кој ги слуша пророчките зборови на оваа книга. Ако некој им додаде нешто, Бог ќе му додаде од маките опишани во оваа книга. "},
	{19, "19 А ако некој одземе нешто од зборовите на книгава на ова пророштво, Бог ќе му го одземе неговиот дел од дрвото на животот и од светиот град, кои се опишани во оваа книга. "},
	{20, "20 Оној Кој го сведочи ова, говори: 'Да, доаѓам скоро!' - Амин! Да, дојди Господи Исусе! "},
	{21, "21 Благодатта на Господ Исус нека биде со сите вас. Амин!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};