#include <map>
#include <string>
class Bible33
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
	struct mk6	{ int val; const char *msg; };
	struct mk7	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Словото Господово, упатено до Михеја од Мораст, во деновите на Јоатама, Ахаза и Езекија, цареви јудејски, со кое му беше откриено за Самарија и за Ерусалим."},
	{2, "2 Чујте, сите народи, внимавај, земјо, и се што те исполнува! Сведок нека е против вас Господ Бог, Господ од Својот свет храм!"},
	{3, "3 Зашто Господ, ете, излегува од Своето место, ке слезе и ке стапи на земните височини,"},
	{4, "4 и планините ке се расклатат под Него, долините ке се растопат како восок од оган, како водата што се пролива низ стрмнини."},
	{5, "5 И сето тоа ке стане поради нечесноста на Јакова, поради гревот на Израилевиот дом. Од кого е злодејанието на Јакова? Нели е тоа од Самарија? Од кого се идолските светилишта во Јудеја? Нели се тоа од Ерусалим?"},
	{6, "6 Затоа од Самарија ке направам купишта урнатини во полето, место за садење лози; ке ги сринам камењата нејзини во долина и ке и ги разголам основите."},
	{7, "7 И сите нејзини резани ликови ке се строшат и сите нивни дарови од блуд - со оган ке бидат изгорени: сите идоли ке ги разурнам; со дарови од блуд ги правела, и пак ке бидат дарови од блуд превртени."},
	{8, "8 Поради тоа ке заплачам и ке заридам, ке појдам бос и оголен, ке вијам како шакал, ке плачам како змија;"},
	{9, "9 зашто тежок е нејзиниот пораз; тоа дојде до Јудеја, а стигна дури и до портите на Мојот народ - се до Ерусалим."},
	{10, "10 Не разгласувајте го ова во Гет, не плачете таму гласно, а во селото Офра посипете се со пепел."},
	{11, "11 Иселете се, жители сафирски, срамно разголени; нема да се спаси ни жителката санска, плачот во селото Езил нема да ви дозволи да се задржите ни таму."},
	{12, "12 Тагува за своето добро жителката маротска, зашто злото од Господа слезе до портите ерусалимски."},
	{13, "13 Впрегни брзи коњи во колата, жителко лахиска, ти си почеток на гревот од керката Сионска, оти во тебе се појавија престапите на Израилот."},
	{14, "14 Затоа ти ке пракаш дарови во Моресет Гет; но населбите ахзивски ке бидат измама за царевите израилски."},
	{15, "15 Kе доведам и наследник при тебе, жителко мориска; и тој ке дојде дури до Одолам, славата на Израилот."},
	{16, "16 Фрли ја косата своја, истрижи се - од жал за своите сакани синови; разголи ја келавоста своја за нив како орел што ја разголува својата, зашто тие ке бидат одведени од тебе во ропство."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Тешко им на оние што кројат беззаконија и на леглата свои измислуваат зли дела, и ги извршуваат штом ке се зазори, зашто не ги издигнаа кон Господа рацете свои."},
	{2, "2 Kе пожелат ниви - ги заземаат насила, куки - ги отимаат; и човекот го обираат, и куката негова, мажот и наследството негово."},
	{3, "3 Затоа вака вели Господ: 'Еве Јас замислувам зло против тој род да пратам, кое не можете да го отфрлите од вратот свој, па затоа и нема да одите исправени; оти тоа време ке биде лошо."},
	{4, "4 Во она време ке се зборува за вас, ке плачат многу и ке мислат: наполно сме разорени; делот од мојот народ е даден на друг; како да ми се врати? Нивните наши се веке раздадени на другородци.'"},
	{5, "5 Затоа не ке имам никого што ке фрли жреб во собранието пред Господа."},
	{6, "6 Не пророкувајте пророци; не пророкувајте им за да не ве постигне зло."},
	{7, "7 О, ти, што се нарекуваш Јаковов дом! Зар се смали Духот Господов! Зборовите Мои зар не се благотворни за оној, кој постаува справедливо?"},
	{8, "8 Но народот, кој порано беше Мој, сега стана непријател, и вие им ја грабите не само горната туку и долната облека на мирните лу е, што се вракаат од војна."},
	{9, "9 Жените на Мојот народ ги истерувате од нивните пријатни домови; а од децата нивни ја одземате славата Моја."},
	{10, "10 Станете и одете си, оти тој крај не е земја за почивка; поради нечистотија таа ке биде разорена - и тоа со голема погибел."},
	{11, "11 Ако некој ветропир измислува лага и вели: 'ке ти проповедам за вино и за сикер', тој би бил добар за пророк на овој народ."},
	{12, "12 Навистина ке те соберам сиот, Јакове, навистина ке ги соберам остатоците Израилеви; ке ги соберам во едно како овците во Восор, како стадо овци во кошара; ке зазборуваат шумно поради многубројноста."},
	{13, "13 Пред нив ке тргне уривач на sидови; тие ке ги разбијат преградите, ке влезат низ портите и ке излезат низ нив, и царот нивни ке тргне пред нив, и Господ - ке биде на чело."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Затоа реков - чујте, поглавари Јаковови и кнезови на домот Израилев: зар вие не знаете што е право?"},
	{2, "2 А вие го мразите доброто и го сакате злото, ја дерете од нив кожата, и месото од коските нивни;"},
	{3, "3 јадете од телото на Мојот народ и ја дерете кожата нивна, а коските нивни ги стругнувате и ги кршите како за во сад, и месото нивно го дробите како за во котел."},
	{4, "4 И тие ке викаат кон Господа, но Он нема да ги чуе и ке го сокрие лицето Свое од нив во времето, додека тие вршат злодејанија."},
	{5, "5 Така вели Господ против пророците, кои го воведуваат во заблуда Мојот народ, кои гризат со заби - а проповедаат мир; а ако никој не им стави во уста ништо, против него објавуваат војна."},
	{6, "6 Затоа, место видени, вие ке гледате нок, место пророштво - темнина; и сонцето ке зајде над тие пророци и денот ке им потемнее над нив."},
	{7, "7 Kе се засрамат јасновидците, ке бидат посрамени гледачите, и сите ке ја затворат устата своја, зашто нема да добијат одговор од Бога."},
	{8, "8 Но јас сум исполнет со силата на Духот Господен, со правда и цврстина, за да му ги кажам на Јакова престапите и на Израилот - гревот негов."},
	{9, "9 Чујте ме сега, поглавари на домот Јаковов, и кнезови на домот Израилев, вие, кои се гнасите од правдата и што искривувате се што е право."},
	{10, "10 Вие, кои го градите Сион со крв и Ерусалим со неправда."},
	{11, "11 Поглаварите негови судат за подароци, свештениците учат за награди, а пророците пророкуваат за пари, и сепак се надеваат на Господа, велејки: 'Нели е Господ ме у нас; затоа зло нема да не постигне.'"},
	{12, "12 Затоа поради вас Сион ке биде разорен како нива, а Ерусалим ке стане купиште од урнатини, и планината на тој Дом ке зарасне во шума."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 И, ете, затоа во последните дни планината на Господовиот Дом, ке биде поставена на чело над сите планини, и ке се издигне над ридовите, и ке поитаат кон неа народите."},
	{2, "2 И ке тргнат многу народи, и ке речат: 'Дојдете да се искачиме на гората Господова и да влеземе во домот на Јакова - и Он ке не научи на Своите свети патишта, и ке одиме по патеките Негови; зашто од Сион ке излезе Законот, и од Ерусалим - словото Господово."},
	{3, "3 Он ке им суди на многу народи и ке изобличи многу племиња во далечни краишта; па ке ги прековаат мечевите свои во плугови и копјата свои - во српови; и народ против народ нема да крене веке меч, и нема веке да се учат да војуваат;"},
	{4, "4 секој ке седи под лозата своја и под смоквата своја, и никој нема да се плаши, зашто устата на Господа Саваот го изрекла тоа."},
	{5, "5 Зашто сите народи одат, секој во името на својот бог, а ние ке одиме во името на Господа, нашиот Бог, секогаш и довека.'"},
	{6, "6 Во оној ден, вели Господ, ке соберам се што е хромо, и ке соединам што е разгонето, и оние, врз кои сум допуштил беда."},
	{7, "7 И ке направам од остатокот на хромите и прснатите по светот силен народ, и Господ ке царува над нив на гората Сион од сега па довека."},
	{8, "8 А ти, куло на стадото, риду на Сионовата керка, при тебе ке дојде и ке се врати поранешното владение, царството - при керките ерусалимски."},
	{9, "9 А зошто ти сега така гласно плачеш? Зар немаш цар или ти недостига советник, па те обзеле маки како кај родилка?"},
	{10, "10 Страдај и мачи се од болки, керко Сионова, како родилка, зашто сега ке излезеш од градот, ке живееш во полето и ке стигнеш во Вавилон. Таму ке бидеш избавена, таму ке те откупи Господ од рацете на непријателите твои."},
	{11, "11 А сега се собрани многу народи против тебе и велат: 'Нека биде осквернета и очите наши да се нагледаат на Сион!'"},
	{12, "12 Но тие не ги знаат замислите на Господа и не ги разбираат намерите Негови - дека Он ги собрал како снопје на гумно."},
	{13, "13 Стани и удирај, керко Сионова, оти Јас ке го направам рогот твој железен и копитата твои бакарни; ке прегазиш многу народи, и нивните трудови и богатства ке ги посветиш на Господа - Владетелот над целата земја."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 Утврди се сега тврдино. И пак сме опседнати, со прат ке го бијат по образите судијата на Израилот."},
	{2, "2 И ти, Витлееме Ефратов, иако си најмал ме у иљадниците Јудејци, од тебе ке ни излезе Оној, Кој треба да владее во Израилот и чие потекло е од почетокот, од вечноста."},
	{3, "3 Затоа Он ке ги остави до времето додека роди онаа, кој треба да роди; тогаш при синовите Изаилеви ке се вратат и нивните други брака."},
	{4, "4 Kе застане Он и ке ги пасе со силата на Господа, со величието на името Господово, својот Бог - и тие ке живеат во мир, зашто тогаш Он ке биде велик до краиштата на земјата."},
	{5, "5 И Он ке биде мирот. Кога ке дојде Асур во нашата земја и ке стапи во нашето владение, тогаш ние против него ке поставиме седум пастири и осум народни кнезови."},
	{6, "6 Тогаш тие ке ја испасат земјата Асур со меч, а земјата на Немрода покрај портите, и Он ке не избави од Асура, кога ке дојде во нашата земја и ке влезе во пределите наши."},
	{7, "7 А остатокот од Јакова ме у многуте народи ке биде како роса од Господа, како ситен дожд по трева. Он нема да зависи од човек и нема да се потпира на синовите Адамови."},
	{8, "8 И остатокот на Јакова ке биде ме у народите, ме у многу племиња, како лав ме у горски sверови, како лавче ме у овчо стадо; и кога ке се појави, ке гази и ке растргнува и никој не ке може да се спаси од него."},
	{9, "9 Тогаш ке се крене раката Твоја над непријателите Твои и тие ке бидат истребени."},
	{10, "10 И во оној ден, вели Господ, ке ги истребам коњите твои пред тебе и ке ги уништам колите твои;"},
	{11, "11 и ке ги сотрам градовите во твојата земја и ке ги растурам сите тврдини твои;"},
	{12, "12 ке ги истргнам магиите од рацете твои, и при тебе не ке има веке вражачи;"},
	{13, "13 ке ги уништам идолите и резаните ликови ме у тебе - и нема веке да се клањаш на творби од рацете твои;"},
	{14, "14 и ке го искоренам од твојата средина идолските светилишта и ке ги разорам градовите твои."},
	{15, "15 Во гнев и со негодување ке се одмаздам над народите што ке бидат непослушни."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct mk6 poems[] = {
	{1, "1 Слушајте што вели Господ: 'Стани и суди се со горите и со ридовите да го чујат гласот твој!"},
	{2, "2 Чујте го, гори, судот Господов, и вие, цврсти основи на земјата, зашто Господ му суди на Својот народ, се бори со Израилот."},
	{3, "3 Народе Мој, што ти направив и со што ти дотегнав? Одговори Ми."},
	{4, "4 Јас те изведов од Египетската земја, те ослободив од домот на ропството и ги водев пред тебе Мојсеја, Арона и Маријам."},
	{5, "5 Народе Мој, сети се што кроеше Валак, царот моавски, и што му одговори Валаам, синот Веров и што стана од Ситим до Галгал - за да ги познаеш праведните дела на Господа."},
	{6, "6 'Со што да застанам пред Господа, да се поклонам пред небесниот Бог? Да застанам ли пред Него со сепаленици, со едногодишни телци?"},
	{7, "7 Но може ли да Му се угоди на Господа со иљадници овни или неизмерни потоци елеј? Дали да Му го дадам мојот првороден син за престапите свои и плодот на утробата своја - за гревовите на душата своја?'"},
	{8, "8 О, човеку, речено ти е што е добро, и што бара од тебе Господ; да работиш правично, да сакаш милосрдни дела и смирено да врвиш пред твојот Бог."},
	{9, "9 Гласот Господов вика кон градот и мудроста се претпочита пред Твоето име; слушајте го жезалот и Оној, Кој те поставил."},
	{10, "10 Па зар не се нао аат во домот на безножникот богатство несправедливо и мерка смалена, одвратна?"},
	{11, "11 Можам ли да бидам чист со мерките на беззакониците и со мерките во мојата торба?"},
	{12, "12 богаташите негови се полни со неправда, и жителите негови говорат неправда, а и јазикот нивни измама е во устата нивна."},
	{13, "13 Затоа ке почнам да те поразувам со запустување поради гревовите твои."},
	{14, "14 Kе јадеш - и нема да се наситуваш; празнина ке има внатре во тебе; ке пазиш, но нема да забележуваш, а она што ке зачуваш, тоа Јас ке го предадам на меч."},
	{15, "15 Kе сееш, но нема да женееш; ке гмечиш маслинки, но нема да се намажеш со елеј; ке цедиш гроздов сок, но нема да пиеш вино."},
	{16, "16 При вас се запазиле обичаите на Замврија и сите дела на домот Ахавов, и вие постапувате според нивните совети. Затоа ке те предадам на запустување и жителите твои на потсмев, а вие ке претрпите поруга од Мојот народ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct mk7 poems[] = {
	{1, "1 Тешко мене, зашто со мене е сега како по собирање на летните плодови, како по гроздобер; ни зрнце за каснување, ниту зрел плод, што би посакала душата моја."},
	{2, "2 Нема веке милосрдни по земјата, нема праведни ме у лу ето; сите кројат сплетки, за да проливаат крв; секој му става на брата си стапица."},
	{3, "3 Рацете им се приготвени за да прават зло: началникот сака подароци, судијата суди за поткуп, а големците пројавуваат лоши похоти на душата своја и ја изопачуваат правдата."},
	{4, "4 Најдобриот од нив им е како трн, а справедливиот им е полош отколку ограда од трње. Денот на Твоите предвесници, денот на Твојата посета наближува; и сега ке ги опфати смут."},
	{5, "5 Не верувајте му на другарот, не потпирајте се на пријателот; пред онаа, што лежи во твојата постела, не отворај ја широко устата своја."},
	{6, "6 Зашто синот го напа а татка си, керката се противи на мајка си, снаата станува против свекрвата; непријатели на човекот му се неговите домашни."},
	{7, "7 Јас, пак, гледам кон Господа, е за моето спасение ке се надевам на Бога; мојот Бог ке ме чуе."},
	{8, "8 Не радувај се за мене, неријателко моја! Иако сум паднат, јас ке станам; макар што сум сега во мрак; Господа е мојата светлина."},
	{9, "9 Kе го поднесувам гневот Господен, - зашто сум згрешил пред Него - додека не го реши делото мое и не ме осуди; тогаш Он ке ме изведе на светлина, и јас ке ја видам правдата Негова."},
	{10, "10 И ке го види тоа мојата непријателка и срам ке ја покрие онаа што ми велеше: 'каде е Господ, твојот Бог?' И ке го видат тоа очите мои - и таа ке биде згазена како кал на улица."},
	{11, "11 Во она време, кога ке се изsидаат sидовите твои, во тоа време границите ке се прошират надалеку."},
	{12, "12 Во оној ден ке пристигнат при тебе од Асирија до Египет, од Тир до Реката, и од море до море и од планина до планина."},
	{13, "13 А таа земја ке биде пустиња поради гревовите на жителите нејзини, и поради плодовите на делата нивни."},
	{14, "14 Паси го со жезалот народот Твој, овците на наследството Свое, оние, што живеат обединети во гората среде Кармил, остави ги да пасат тие во Васан и Галад како во стародревните дни!"},
	{15, "15 Kе му покажам чудесни дела како во времето кога ти излезе од Египетската земја."},
	{16, "16 Kе го видат тоа народите и ке се засрамат при сета таа сила; ке стават рака на устата своја, и ушите нивни ке се заглушат."},
	{17, "17 Kе лижат прав како змии и како црвјата што излегуваат од земја, ке излегуваат од своите гнезда; ке се уплашат од Господа, од нашиот Бог, и ке се уплашат од Тебе."},
	{18, "18 Кој Бог е како Тебе, за да ги простува беззаконијата, да мине преку престапите на остатокот од Своето наследство? Он вечно не се гневи, зашто има обичај да се смилува."},
	{19, "19 Он пак ке се смили над нас и ке ги избрише нашите беззаконија. Он ке ги фрли сите наши гревови во морските длабочини."},
	{20, "20 Ти ке покажеш верност кон домот на Јакова, милост кон Авраама, како што со клетва си им ветил на татковците наши од првите дни."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};