#include <map>
#include <string>
class Bible59
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Јаков, слуга на Бог и на Господ Исус Христос, ви испраќам поздрави на дванаесетте раштркани племиња. "},
	{2, "2 Сметајте дека е вистинска радост, браќа мои, кога ќе се сретнете со разни испитувања, "},
	{3, "3 знаејќи дека од испитувањето на вашата вера произлегува истрајност! "},
	{4, "4 А од истрајноста - совршено дело, за да бидете совршени и целосни, без нешто да ви недостига. "},
	{5, "5 Но ако некому од вас му недостига мудрост, нека ја бара од Бога, Кој им дава на сите изобилно и без прекор - и ќе му биде дадена. "},
	{6, "6 Но нека бара со вера, без никакво сомнение, зашто оној кој се сомнева е сличен на морски бран кого ветрот го крева и го тера. "},
	{7, "7 Таквиот човек нека не мисли дека ќе прими нешто од Господ, "},
	{8, "8 зашто човекот кој се двоуми е непостојан на сите свои патишта. "},
	{9, "9 Бедниот брат нека се фали со својата возвишеност, "},
	{10, "10 а богатиот со својата понизност, бидејќи ќе помине како цветот на тревата. "},
	{11, "11 Зашто сонцето изгрева со припек и ја овенува тревата, па нејзиниот цвет окапува и исчезнува убавината на нејзиниот изглед. Така и богатиот ќе овене во своите стремежи. "},
	{12, "12 Блажен е човекот кој истрајува во испитувањата, зашто откако ќе биде докажан, ќе го прими венецот на животот што Бог им го вети на оние што Го љубат. "},
	{13, "13 Никој, кој се наоѓа во искушение, да не рече: 'Бог ме искушува.' Зашто, Бог не може да биде искушуван од зло, и Тој Самиот никого не искушува. "},
	{14, "14 Туку, секој е искушуван кога го влече и го мами неговата сопствена похота. "},
	{15, "15 А откако ќе зачне похотата, таа раѓа грев, а извршениот грев раѓа смрт. "},
	{16, "16 Не мамете се, мили мои браќа. "},
	{17, "17 Секое добиено добро и секој совршен дар, доаѓаат озгора, и слегуваат од Таткото на светлините, кај Кого нема промена, ниту трага од промена. "},
	{18, "18 Тој нè роди според Својата волја, преку словото на вистината, за да бидеме првнина меѓу Неговите созданија. "},
	{19, "19 Знајте го ова, мили мои браќа: секој нека биде брз во слушањето, а бавен во зборувањето и бавен за гнев, "},
	{20, "20 зашто човековиот гнев не ја исполнува Божјата праведност. "},
	{21, "21 Затоа отфрлете од себе секаква нечистота, и сè што останало од злобата, и примете го со кроткост во вас всаденото Слово кое може да ги спаси вашите души. "},
	{22, "22 И бидете извршители на Словото, а не само слушатели кои се мамат себеси. "},
	{23, "23 Зашто, кој го слуша Словото, а не го исполнува, прилега на човек, кој го гледа своето сопствено лице во огледало, "},
	{24, "24 па откако ќе се погледне и замине, веднаш заборава каков бил. "},
	{25, "25 А кој ќе се загледа во совршениот закон, законот на слободата и остане во него, не како заборавлив слушател, туку како делотворен извршител, тој ќе биде блажен во она што го врши. "},
	{26, "26 Ако некој мисли дека е религиозен, а не го зауздува својот јазик, туку го мами своето срце, неговата религија е безвредна. "},
	{27, "27 Ова е чиста и неизвалкана религија пред Бога и Таткото: да се посетуваат сираците и вдовиците кога се во нивната невола, и да се биде неосквернет од светот. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Браќа мои, имајте вера во нашиот славен Господ Исус Христос и не бидете пристрасни! "},
	{2, "2 Зашто ако на вашиот собир дојде човек со златен прстен и со убава облека, а влезе и сиромав во валкана облека, "},
	{3, "3 и му укажете посебно внимание на оној во убавата облека, и му речете: 'Ти седни тука на убаво место!' а на сиромавиот му речете: 'Ти стој таму!' или 'Седни долу до моите нозе', "},
	{4, "4 не правите ли разлики меѓу себе и така станувате судии со зли мисли? "},
	{5, "5 Послушајте, мили мои браќа, не ги избра ли Бог оние кои се сиромаси во очите на светот, за да бидат богати во верата и наследници на Царството кое им го ветил на оние кои Го љубат? "},
	{6, "6 А вие го презревте сиромавиот! Не се ли богатите тие што ве угнетуваат и ве влечат по судови? "},
	{7, "7 Не го хулат ли тие возвишеното име со кое сте наречени? "},
	{8, "8 Ако пак го исполнувате царскиот закон, според Писмото: 'Љуби го својот ближен како самиот себе!'- добро правите. "},
	{9, "9 Но ако сте пристрасни, правите грев и законот ве осудува како престапници. "},
	{10, "10 Бидејќи кој го запазува целиот закон, а се сопне само во едно, станува виновен за сè. "},
	{11, "11 Зашто Оној Кој рекол: 'Не врши прељуба!' рекол и : 'Не убивај!' Ако не вршиш прељуба, а убиеш, стануваш престапник на законот. "},
	{12, "12 Така зборувајте и така постапувајте како луѓе кои ќе бидат судени според законот на слободата. "},
	{13, "13 Зашто осудата ќе нема милост спрема оној кој не покажал милост. Милоста слави победа над осудата. "},
	{14, "14 Каква е ползата, браќа мои, ако некој рече дека има вера, а нема дела? Може ли таквата вера да го спаси? "},
	{15, "15 Ако некој брат или сестра се без облека и имаат потреба од секојдневна храна, "},
	{16, "16 па некој од вас им рече: 'Одете си во мир, стоплете се и наситете се!', а не им го даде она што им е потребно за телото, каква е ползата од тоа? "},
	{17, "17 Така е и со верата: ако нема дела, мртва е сама по себе. "},
	{18, "18 Bпрочем, некој ќе рече: ти имаш вера, а јас имам дела; покажи ми ја својата вера без дела, а јас ќе ти ја покажам верата преку моите дела. "},
	{19, "19 Ти веруваш дека има само еден Бог. Добро правиш! И демоните веруваат и треперат. "},
	{20, "20 Сакаш ли да разбереш, о суетен човеку, дека верата без дела е бесплодна? "},
	{21, "21 Нашиот татко Авраам не беше ли оправдан преку делата кога го принесе својот син Исак на жртвеникот? "},
	{22, "22 Гледате дека верата соработуваше со неговите дела, и преку делата верата стана совршена, "},
	{23, "23 и така се исполни Писмото, кое вели: 'Авраам Му поверува на Бог, и тоа му се припиша за праведност, и беше наречен Божји пријател.' "},
	{24, "24 Ете човекот се оправдува преку дела, а не единствено преку вера. "},
	{25, "25 Исто така и блудницата Рааб, не се оправда ли преку дела, кога ги прими гласниците и кога ги испрати по друг пат? "},
	{26, "26 Зашто, како што телото без дух е мртво, така и верата без дела е мртва. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Не станувајте, браќа мои, мнозина од вас учители, бидејќи знаеме дека ќе бидеме построго осудени за тоа. "},
	{2, "2 Зашто сите ние грешиме на разни начини. Ако некој не греши во зборувањето, тој е совршен човек, способен да го заузда и целото свое тело. "},
	{3, "3 На коњите им ставаме узда во устата за да ни се покоруваат, па можеме да управуваме со целото нивно тело. "},
	{4, "4 Ете, и корабите, иако се толку големи и ги гонат силни ветрови, со нив управува кормиларот со многу мало кормило, каде што ќе посака. "},
	{5, "5 Така и јазикот е мал орган од телото, но се фали со големи работи. Ете како мал оган запалува голема шума! "},
	{6, "6 И јазикот е оган, самиот свет на беззаконието; јазикот се наоѓа меѓу нашите органи како таков кој го осквернува целото тело и, потпален од пеколот, го запалува нашиот животен тек. "},
	{7, "7 Зашто, секаков вид ѕверови и птици, лазачи и морски животни се скротува и бил скротуван од човечкиот род, "},
	{8, "8 но никој не може да го скроти јазикот, тоа нескротливо зло, полно со смртоносен отров. "},
	{9, "9 Со него Го благословуваме нашиот Господ и Татко, и со него ги проколнуваме луѓето кои се создадени според подобието Божјо. "},
	{10, "10 Од иста уста излегуваат благослови и клетви. Браќа, тоа не смее да биде така. "},
	{11, "11 Тече ли од извор со ист отвор слатка и горчлива вода? "},
	{12, "12 Може ли, браќа мои, смоквата да роди маслинки, или лозата смокви? Ни солениот извор не може да даде слатка вода. "},
	{13, "13 Кој е меѓу вас мудар и разумен? Со доброто поведение нека ги покаже своите дела во мудра кроткост. "},
	{14, "14 Ако пак во своето срце имате горчлива завист и соперништво, не гордејте се со тоа и не извртувајте ја вистината! "},
	{15, "15 Тоа не е мудрост која слегува озгора, туку е земна, душевна, демонска; "},
	{16, "16 зашто каде што има завист и соперништво, таму владее безредие и секакво зло. "},
	{17, "17 А мудроста која доаѓа озгора, пред сè е чиста, потоа мирољубива, блага, разумна, полна со милост и добри плодови, непоколеблива и нелицемерна. "},
	{18, "18 А семето, чиј плод е праведност се сее во мир преку миротворците. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Од каде се војните и од каде се караниците меѓу вас? Не доаѓаат ли од вашите похоти што војуваат во вашите органи? "},
	{2, "2 Посакувате а немате, та затоа убивате. Завидливи сте и не можете да добиете; затоа се борите и војувате. Немате затоа што не барате. "},
	{3, "3 Барате, но не добивате, зашто барате со лоши цели, за да го трошите на вашите похоти. "},
	{4, "4 Прељубници, не знаете ли дека пријателството со светот е непријателство спрема Бог? И така, кој сака да му биде пријател на светот, Му станува непријател на Бог. "},
	{5, "5 Или, мислите ли дека Писмото напразно вели: 'до ревност копнее за духот кој Го всели во нас?' "},
	{6, "6 Но Тој дава поголема благодат. Затоа вели: 'Бог им се противи на горделивите, а на понизните им дава благодат.' "},
	{7, "7 Затоа покорете Му се на Бог, а противставете му се на ѓаволот и тој ќе побегне од вас. "},
	{8, "8 Приближете се кон Бог, и Тој ќе се приближи кон вас; исчистете ги рацете, вие грешници, и очистете ги срцата, вие луѓето што се двоумите! "},
	{9, "9 Бидете нажалени, тагувајте и плачете; вашата смеа нека се претвори во тага, а радоста во жалост! "},
	{10, "10 Понизете се пред Господ, и Тој ќе ве возвиши! "},
	{11, "11 Не зборувајте еден против друг, браќа; оној кој зборува против својот брат или го суди својот брат, зборува против законот и го суди законот. А ако го судиш законот, не си извршител на законот, туку негов судија. "},
	{12, "12 Има само еден Законодавец и Судија, Оној Кој може да спаси и да погуби. А кој си ти што го осудуваш ближниот? "},
	{13, "13 Чујте сега вие, кои велите: 'Денес или утре ќе отидеме во тој и тој град и таму ќе останеме една година, ќе тргуваме и ќе спечалиме', "},
	{14, "14 вие, кои не знаете што ќе биде утре. Bие сте пареа која се јавува за кратко и потоа исчезнува. "},
	{15, "15 Наместо да велите: 'Ако Господ даде, ќе живееме и ќе направиме ова или она', "},
	{16, "16 вие се фалите со својата горделивост. Секоја таква фалба е зла. "},
	{17, "17 И така, кој знае да прави добро, а не го прави, чини грев. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 Ајде сега, вие богатите, плачете и лелекајте за неволите што идат на вас. "},
	{2, "2 Bашето богатство изгни и молците ја изедоа вашата облека. "},
	{3, "3 Bашето злато и сребро 'рѓосаа, а нивната 'рѓа ќе биде сведоштво против вас и како оган ќе ги голтне вашите тела. Bашето богатство го натрупавте во последните денови. "},
	{4, "4 Ете, заработката на работниците кои ги ожнаа вашите ниви, што вие им ја задржавте, и викотниците на жетварите дојдоа до ушите на Господ над Bојските. "},
	{5, "5 На земјата живеевте раскошно и разуздано; ги згоивте своите срца како за ден на клање. "},
	{6, "6 Го осудивте, го убивте праведникот, а тој не ви се противи. "},
	{7, "7 И така, имајте трпение, браќа, до Господовото доаѓање! Ете, земјоделецот го чека скапоцениот род од земјата, чека трпеливо додека не ги добие раните и доцните дождови. "},
	{8, "8 Чекајте трпеливо и вие, зацврстете ги своите срца, зашто близу е Господовото доаѓање. "},
	{9, "9 Не роптајте, браќа, еден против друг, за да не бидете осудени; ете, Судијата стои пред врата. "},
	{10, "10 Како пример за страдањата и долгата трпеливост земете ги, браќа, пророците кои зборуваа во Господовото име. "},
	{11, "11 Ете, блажени ги нарекуваме оние кои истрајаа. Чувте за трпението на Јоб, и видовте како Господ го заврши тоа; зашто Господ е полн со милост и сочувство. "},
	{12, "12 А пред сè, браќа мои, не заколнувајте се ни во небото, ни во земјата, ниту со некаква друга заклетва! Туку вашето 'да', да биде 'да', а вашето 'не' - 'не', за да не паднете под осуда. "},
	{13, "13 Страда ли некој меѓу вас, нека се моли. Bесел ли е некој, нека пее псалми. "},
	{14, "14 Боледува ли некој меѓу вас? Нека ги повика старешините на црквата, тие нека се помолат над него и нека го помазат со миро во името на Господа, "},
	{15, "15 а молитвата со вера, ќе го исцели болниот и Господ ќе го крене, и ако направил гревови, ќе му бидат простени. "},
	{16, "16 И така, исповедајте си ги гревовите еден на друг и молете се еден за друг, за да оздравите! Делотворната молитва на праведникот има голема сила. "},
	{17, "17 Илија беше човек ист како и ние, и искрено се помоли да нема дожд, и не падна дожд на земјата три години и шест месеци. "},
	{18, "18 И пак се помоли, па небото истури дожд и земјата го даде својот плод. "},
	{19, "19 Браќа мои, ако некој меѓу вас скршне од вистината и ако некој го врати, "},
	{20, "20 нека знае дека оној кој ќе врати грешник од неговиот погрешен пат, ќе ја спаси неговата душа од смрт и ќе покрие многу гревови."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};