#include <map>
#include <string>
class Bible62
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Она што беше од почетокот, што го чувме, што го видовме со своите очи, што го гледавме и што го опипаа нашите раце, за Словото на Животот - "},
	{2, "2 тој живот се јави, а ние Го видовме и сведочиме и ви го објавуваме вечниот живот, Кој беше со Таткото и ни се јави нам; "},
	{3, "3 она што го видовме и чувме, тоа ви го навестуваме и вам, та и вие да имате општење со нас. А нашето општење е со Таткото и со Неговиот Син Исус Христос. "},
	{4, "4 Ние ви го пишуваме ова, за да биде нашата радост целосна. "},
	{5, "5 Ова е пораката што ја чувме од Него и што ви ја објавуваме вам: Бог е светлина и во Него нема никаква темнина. "},
	{6, "6 Ако речеме дека имаме општење со Него, а одиме во темнина, лажеме и не ја вршиме вистината. "},
	{7, "7 Ако пак одиме во светлина, како што е Тој Самиот во светлина, имаме општење еден со друг, и крвта на Неговиот Син Исус Христос нè исчистува од секој грев. "},
	{8, "8 Ако речеме дека немаме грев, се мамиме самите себеси, и вистината не е во нас. "},
	{9, "9 Ако ги исповедаме своите гревови, Тој е верен и праведен да ни ги прости гревовите и да нè исчисти од секаква неправедност. "},
	{10, "10 Ако речеме дека не сме згрешиле, Него Го правиме лажливец, и Неговото слово не е во нас. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Чеда мои, ова ви го пишувам за да не грешите, а ако некој згреши, имаме Застапник пред Таткото - Исус Христос, Праведникот. "},
	{2, "2 Тој е жртва за помирување на нашите гревови, и не само на нашите, туку и на гревовите на целиот свет. "},
	{3, "3 И по тоа знаеме дека Го познаваме, ако ги вршиме Неговите заповеди. "},
	{4, "4 Оној кој вели: 'Го знам', а не ги врши Неговите заповеди, лажливец е и вистината не е во него. "},
	{5, "5 А кој го врши Неговото слово, во него Божјата љубов навистина стигнала до совршенство. Според ова знаеме дека сме во Него: "},
	{6, "6 оној кој вели дека останува во Него, треба да живее, како што живееше Тој. "},
	{7, "7 Мили мои, не ви пишувам нова заповед, туку стара заповед што ја примивте од почетокот. Старата заповед е словото што го чувте. "},
	{8, "8 Но сепак, ви пишувам нова заповед која е вистинита и во Него и во вас, зашто темнината поминува, а вистинската светлина веќе свети. "},
	{9, "9 Оној што вели дека е во светлината, а го мрази својот брат, тој сè уште е во темнината. "},
	{10, "10 Оној кој го љуби својот брат останува во светлината и кај него нема соблазна. "},
	{11, "11 А оној кој го мрази својот брат е во темнината и во темнината живее и не знае каде оди, зашто темнината му ги заслепила очите. "},
	{12, "12 Bи пишувам вам, чеда, бидејќи гревовите ви се простени заради Неговото име. "},
	{13, "13 Bи пишувам вам, татковци, бидејќи Го познавте Оној Кој беше од почетокот. Bи пишувам вам, момчиња, бидејќи го победивте злиот. Bи напишав вам, деца, бидејќи Го познавте Таткото. "},
	{14, "14 Bи напишав вам, татковци, бидејќи Го познавте Оној Кој беше од почетокот. Bи напишав вам, момчиња, бидејќи сте силни и Божјото слово е во вас и бидејќи го победивте злиот. "},
	{15, "15 Не љубете го светот, ниту световните работи. Ако некој го љуби светот, љубовта на Таткото не е во него, "},
	{16, "16 зашто сè што е во светот: похотата на телото, похотата на очите и суетната гордост на животот, не е од Таткото, туку од светот. "},
	{17, "17 Светот заминува, и неговата похота, а оној кој ја извршува Божјата волја останува во вечни векови. "},
	{18, "18 Чеда, настапи последен час, и како што имате слушнато дека антихристот ќе дојде, еве уште сега се јавија многу антихристи; по тоа знаеме дека е последниот час. "},
	{19, "19 Тие излегоа од нас, но не беа од нас, зашто ако беа од нас, ќе останеа со нас, туку излегоа затоа што требаше да се покаже дека ниту еден од нив не е од нас. "},
	{20, "20 А вие имате помазание од Светиот и знаете сè. "},
	{21, "21 Не ви пишав како да не ја знаете вистината, туку затоа што ја знаете и зашто ниедна лага не е од вистината. "},
	{22, "22 Кој е лажливец, ако не оној кој одрекува дека Исус е Христос? Антихрист е оној кој ги одрекува Таткото и Синот! "},
	{23, "23 А секој што Го одрекува Синот, Го нема ни Таткото; кој Го признава Синот, Го има и Таткото. "},
	{24, "24 Тоа што го чувте од почетокот нека остане во вас. Ако остане во вас тоа што го чувте од почетокот, и вие ќе останете во Синот и во Таткото. "},
	{25, "25 А ова е ветувањето што Тој Самиот ни го вети: вечниот живот. "},
	{26, "26 Ова ви го пишав заради оние кои се обидуваат да ве измамат. "},
	{27, "27 А што се однесува до вас, во вас останува помазанието што го примивте од Него и немате потреба некој да ве поучува, туку како што Неговото помазание ве поучува за сè, и е вистинито и не е лага, и како што Тој ве научи, така останете во Него. "},
	{28, "28 А сега, чеда, останете во Него, за да имаме доверба кога ќе се јави Тој и за да не се посрамотиме пред Него при Неговото доаѓање. "},
	{29, "29 Ако знаете дека Тој е праведен, знајте дека секој кој врши праведност, е роден од Него. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Гледајте каква љубов ни дарувал Таткото: да се нарекуваме Божји деца. А тоа и сме! Светот затоа и не нè познава нас, бидејќи не Го позна Него. "},
	{2, "2 Мили мои, сега сме Божји деца, и уште не се откри што ќе бидеме. Но знаеме дека кога Тој ќе се појави ќе Му бидеме слични, зашто ќе Го гледаме онаков каков што е. "},
	{3, "3 И секој што ја има оваа надеж во Него, се исчистува самиот, така како што е и Тој чист. "},
	{4, "4 Секој што врши грев, врши и беззаконие, а гревот е беззаконие. "},
	{5, "5 И знаете дека Тој се јави за да ги отстрани гревовите, а во Него нема грев. "},
	{6, "6 Ниту еден кој останува во Него, не греши. Ниту еден кој греши, не Го видел Него, ниту Го познал. "},
	{7, "7 Чеда, никој да не ве мами. Кој чини праведност, праведен е така како што е и Тој праведен. "},
	{8, "8 Кој чини грев, од ѓаволот е, зашто ѓаволот греши од почетокот. Затоа се јави Божјиот Син, за да ги разурне делата на ѓаволот. "},
	{9, "9 Ниту еден кој е роден од Бог не чини грев, зашто Неговото семе е во него, и не може да греши, бидејќи е роден од Бог. "},
	{10, "10 По ова се препознаваат Божјите чеда и ѓаволските чеда: секој што не чини праведност не е од Бог, ниту пак оној што не го љуби својот брат. "},
	{11, "11 Зашто ова е веста што ја чувте од почетокот: да се љубиме еден со друг! "},
	{12, "12 Не како Каин којшто беше од злиот и го уби брата си. И зошто го уби? Затоа што неговите дела беа зли, а на брат му праведни. "},
	{13, "13 Не чудете се, браќа, ако светот ве мрази. "},
	{14, "14 Ние знаеме дека преминавме од смрт во живот, бидејќи ги љубиме браќата. Оној кој не љуби, тој останува во смртта. "},
	{15, "15 Секој што го мрази својот брат, е убиец, а знаете дека во ниеден убиец нема вечен живот. "},
	{16, "16 Љубовта ја познаваме по тоа што Тој го положи својот живот за нас; и ние сме должни да ги положиме своите животи за браќата. "},
	{17, "17 А кој има световни блага и го види братот свој во нужда, па го затвори своето срце пред него, како може Божјата љубов да остане во него? "},
	{18, "18 Чеда, да не љубиме со збор или со јазик, туку со дело и вистина. "},
	{19, "19 По тоа ќе познаеме дека сме од вистината, и ќе ги увериме своите срца пред Него, "},
	{20, "20 зашто кога нашето срце нè осудува, Бог е поголем од нашето срце и знае сè. "},
	{21, "21 Мили мои, ако срцето не нè осудува, имаме доверба пред Бог, "},
	{22, "22 и што и да побараме од Него, добиваме затоа што ги пазиме Неговите заповеди и го правиме тоа што Му е Нему по волја. "},
	{23, "23 А Неговата заповед е оваа: да веруваме во името на Неговиот Син, Исус Христос, и да се љубиме еден со друг, како што Тој ни заповеда. "},
	{24, "24 Оној кој ги пази Неговите заповеди, останува во Него, а и Тој во него. А по ова знаеме дека Тој е во нас: по Духот што ни Го дал. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Мили мои, не верувајте му на секој дух, туку проверувајте ги духовите за да видите дали се од Бога, зашто многу лажни пророци излегоа во светот. "},
	{2, "2 По ова препознајте го Божјиот Дух: секој дух кој исповедува дека Исус Христос дојде во тело, е од Бог; "},
	{3, "3 а секој дух кој не Го признава Исуса, не е од Бог; тоа е духот на антихристот, за кого сте чуле дека ќе дојде, и сега е веќе во светот. "},
	{4, "4 Чеда, вие сте од Бога и нив ги победивте, зашто Оној Кој е во вас, поголем е од оној кој е во светот. "},
	{5, "5 Тие се од светот и затоа зборуваат световно и светот ги слуша. "},
	{6, "6 Ние сме од Бог. Оној кој Го познава Бога, нè слуша нас, а оној кој не е од Бог, не нè слуша нас. По тоа го познаваме духот на вистината и духот на заблудата. "},
	{7, "7 Мили мои, да се љубиме еден со друг, зашто љубовта е од Бог и секој кој љуби од Бога е роден и Го познава Бог. "},
	{8, "8 А кој не љуби, не Го познава Бог, зашто Бог е љубов. "},
	{9, "9 Божјата љубов спрема нас се покажа со тоа што Бог Го испрати во светот Својот Единороден Син за да живееме преку Него. "},
	{10, "10 Љубовта е во ова, не дека ние Го засакавме Бог, туку Тој нè засака нас и Го испрати Својот Син како жртва за помирување за нашите гревови. "},
	{11, "11 Мили мои, ако Бог нè засака така, и ние треба да се љубиме еден со друг. "},
	{12, "12 Никој никогаш не Го видел Бога; ако се љубиме еден со друг, Бог е во нас и Неговата љубов станува совршена во нас. "},
	{13, "13 Дека сме ние во Него и Тој во нас, познаваме по тоа што ни даде од Својот Дух. "},
	{14, "14 А ние видовме и сведочиме дека Таткото Го испрати Синот да биде Спасител на светот. "},
	{15, "15 Секој кој признава дека Исус е Божјиот Син, Бог е во него и тој е во Бог. "},
	{16, "16 И ние ја запознавме и поверувавме во љубовта која Бог ја има спрема нас. Бог е љубов, и оној кој останува во љубовта, останува во Бога и Бог останува во него. "},
	{17, "17 Така љубовта во нас станува совршена, за да имаме увереност на Судниот ден, зашто каков што е Тој, такви сме и ние во светов. "},
	{18, "18 Bо љубовта нема страв, туку совршената љубов го изгонува стравот, зашто стравот подразбира казна, а кој се плаши, не е совршен во љубовта. "},
	{19, "19 Ние љубиме, зашто првин Тој нè засака нас. "},
	{20, "20 Ако некој рече: 'Го љубам Бога', а го мрази својот брат, лажливец е, зашто кој не го љуби својот брат кого го видел, не може да Го љуби Бог, Кого не Го видел. "},
	{21, "21 Од Него ја имаме оваа заповед: кој Го љуби Бог, да го љуби и својот брат. "},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 Секој кој верува дека Исус е Христос, роден е од Бог; секој кој го љуби таткото, го љуби и неговото чедо. "},
	{2, "2 По ова познаваме дека ги љубиме Божјите деца: кога Го љубиме Бог и ги извршуваме Неговите заповеди. "},
	{3, "3 Ова е Божјата љубов: да ги извршуваме Неговите заповеди, а Неговите заповеди не се тешки, "},
	{4, "4 зашто сè што е родено од Бог, го надвладува светот; и ова е победата која го победи светот - нашата вера. "},
	{5, "5 Кој е тој што го победува светот, ако не оној кој верува дека Исус е Божјиот Син? "},
	{6, "6 Тој е Оној Кој дојде преку вода и крв - Исус Христос; и не само преку водата, туку преку водата и преку крвта; "},
	{7, "7 а Духот е Оној Кој сведочи, зашто Духот е вистината. "},
	{8, "8 Зашто тројца се кои сведочат: Духот и водата и крвта, и овие три се во согласност. "},
	{9, "9 Ако примаме сведоштво од луѓе, Божјото сведоштво е поголемо. А Божјото сведоштво е што Тој сведочеше за Својот Син. "},
	{10, "10 Кој верува во Божјиот Син, го има сведоштвото во себе; кој не Му верува на Бог, Го прави лажливец, зашто не му верува на сведоштвото што Бог го даде за Својот Син. "},
	{11, "11 А еве го сведоштвото: Бог ни даде вечен живот, и тој живот е во Неговиот Син. "},
	{12, "12 Кој Го има Синот, го има тој живот; кој Го нема Божјиот Син, го нема тој живот. "},
	{13, "13 Ова ви го напишав вам кои верувате во името на Божјиот Син, за да знаете дека имате вечен живот. "},
	{14, "14 И ова е увереноста која ја имаме во Него: дека нè слуша ако бараме нешто според Неговата волја. "},
	{15, "15 И кога знаеме дека нè слуша што и да бараме, знаеме дека ќе го добиеме она што сме го побарале од Него. "},
	{16, "16 Ако некој го види својот брат да чини грев што не е за смрт, нека моли, и Бог ќе му даде живот на оној кој не чини грев за смрт. Има грев за смрт и за тој грев не велам да моли. "},
	{17, "17 Секоја неправедност е грев, а постои грев што не е за смрт. "},
	{18, "18 Знаеме дека секој кој е роден од Бога не греши, туку родениот од Бога се чува себеси и злиот не се допира до него. "},
	{19, "19 Знаеме дека ние сме од Бога, а целиот свет е под власта на злиот. "},
	{20, "20 Исто така знаеме дека Божјиот Син дојде и ни даде разбирање, за да Го познаеме Bистинскиот, а ние сме во Bистинскиот, во Неговиот Син Исус Христос. Тој е вистинскиот Бог и вечен живот. "},
	{21, "21 Чеда, чувајте се од идолите."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};