#include <map>
#include <string>
class Bible35
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Пророчко видение што го имаше пророкот Авакум."},
	{2, "2 До кога, Господи, ке повикувам, а Ти не ме слушаш; викам кон Тебе поради насилството, а Ти не ме избавуваш?"},
	{3, "3 Зошто ми дозволуваш да гледам злодејанија, и да гледам неволи? Грабежот и насилството се пред мене; се појавува непријателство, настанува раздор."},
	{4, "4 Поради тоа законот ја изгуби силата, нема веке праведен суд: нечестивиот го победува праведниот, и затоа судот се искривува."},
	{5, "5 Погледајте ме у народите, видете - и многу ке се зачудите и восхитите: зашто во ваше време Јас ке извршам такво дело, за кое вие не би поверувале, ако би ви раскажувале."},
	{6, "6 Оти Јас ке ги кренам Халдејците, народ жесток и необуздан, кој оди по ширините земни за да завладее населби, кои нему не му припа аат."},
	{7, "7 Тој е страшен и ужасен; тој самиот е и суд и власт."},
	{8, "8 Коњите негови се побрзи и од леопарди и поустремни од вечерни волци; коњицата негова се движи по разни страни; јавачи му доа аат од далечена, налетуваат како орли, што се спуштаа врз пленот."},
	{9, "9 Во групи тој оди по грабеж; го устремува лицето и тој заробува пленици како песок."},
	{10, "10 И со цареви се подигрува, а кнезовите му служат за подбив; над секоја тврдина тој се смее: засипува опсаден окоп и ја преземе."},
	{11, "11 Во таков случај духот му станува горд, оди и бујствува; силата негова му е бог."},
	{12, "12 Но, зар не си Ти од векот Господ Бог мој, Светецот мој? Ние нема да умреме! Ти, Господи, само за суд си го допуштил тоа. Карпо моја. За казна си го определил ова."},
	{13, "13 На чистите очи Твои не е својствено да гледаат злодејание и да гледаш угнетување Ти не можеш. Зошто гледаш злодејци и си безгласен, кога нечестивецот проголтува човек што е поправеден од него."},
	{14, "14 и ги оставаш лу ето како риба в море и како лазачи, кои немаат господар?"},
	{15, "15 Сите тие со јадици ги лови, ги лови во мрежата своја, ги извлекува и ги собира на суво, па затоа се радува и весели."},
	{16, "16 Затоа на мрежата своја и принесува жртва и на торбата и кади со темјан, оти од нив делот му е мрсен и храната му е вкусна."},
	{17, "17 Па заради тоа ке сака ли да ја испразни мрежата своја и постојано да ги убива народите безмилосно?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Застанав на стража, и стојеки на кулата, набљудував за да разберам, што ке ми каже Он, и што да одговорам на укорот од Него."},
	{2, "2 Ми одговори Господ и ми рече: Запиши го видението и одбележи го на плочи јасно, та оној, што ке чита, да може да го прочита;"},
	{3, "3 зашто видението се однесува до определеното време; тоа зборува за свршетокот и нема да излаже; па, и ако се забави, чекај го, оти ке наиде и нема да забави. Оној што иде, ке дојде."},
	{4, "4 И ете, гордата душа нема да се успокои, а праведникот преку варата ке живее."},
	{5, "5 Гордиот човек, како незовриено вино, нема да се успокојува; тој ја раширува душата своја како пеколот, и ненаситен е како смртта; ги собира при себе сите народи и ги ограбува сите племиња."},
	{6, "6 Нема ли сите тие да го земат за приказ и да испеат иронична песна: 'Тешко му на оној што без мерка се збогатува, и тоа не со свое, за долго ли? И натрупува залози.'"},
	{7, "7 Нема ли да станат наеднаш оние, што ке те измачуваат, и нема ли против тебе да се кренат грабители и ти ке им станеш за грабеж?"},
	{8, "8 Бидејки си ограбил многу народи, и тебе ке те ограбат сите други народи, зашто си пролеал човечка крв, зашто си ја разорил земјата, градот и сите што живеат во него."},
	{9, "9 Тешко му на оној, што се лакоми кон неправедни печалби за домот свој, за да го изгради домот свој на високо и така да се запази од раката на злото."},
	{10, "10 Си смислил тај срам за домот свој, откако истребил многу народи, и си згрешил против душата своја."},
	{11, "11 Камењата од sидовите ке повикаат и стегите дрвени ке им одговорат:"},
	{12, "12 'Тешко му на оној кој sида град врз крв, и што гради тврдини врз неправда!'"},
	{13, "13 Ете, не е ли тоа од Господа Саваот што народите се трудат за оган и племињата се измачуваат напразно?"},
	{14, "14 Зашто земјата ке се исполни со славата Господова онака како што водите го исполнуваат морето."},
	{15, "15 Тешко му на оној што го пои ближниот свој со пијалок, измешан со злобата своја, за да ја види голотијата негова!"},
	{16, "16 Ти си презаситен со срам место со слава; пиј, пак, и ти и покажи ја голотијата своја и кон тебе ке се сврти десницата Господова и срамот на славата твоја."},
	{17, "17 Зашто твоето злодејание на Ливан ке падне врз тебе, оти си истребувал уплашени животни, бидејки си пролевал човечка крв, си ги опустошувал земјата, градот и се што живее во него."},
	{18, "18 Каква корист има од резан лик, направен од уметник, од тој излеан лажен учител, макар што вајар, правејки неми идоли, ке се надева на делото свое."},
	{19, "19 Тешко му на оној, кој на дрво вели - ‘стани‘ - и на нем камен - ‘разбуди се‘. Kе научи ли тој некого на нешто? Ете, тој е опкован со злато и сребро, но здив во него нема."},
	{20, "20 Господ е во Својот свет храм: нека молчи целата земја пред лицето Негово!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Молитвата на пророкот Авакум - за пеење."},
	{2, "2 Господи, чув вест од Тебе и се уплашив. Господи, запази го делото Свое ме у години, објави го во текот на годините, а во гневот Свој сети се на милост."},
	{3, "3 Бог дојде од Теман и Светецот од гората Фаран. Величието Негово ги покри небесата, и славата Негова ја исполни земјата."},
	{4, "4 Болскотот Му е како сончева светлина, а од рацете Негови зрачи, и тука е скривалиштето на Неговата сила."},
	{5, "5 Пред лицето Негово врви поразија, а по стапките Негови ветар што гори."},
	{6, "6 Он стана и земјата се затресе; погледа - и во трепет ги доведе народите; одамнешни планини се распаднаа, првобитните ридови се урнаа; но патиштата Негови се вечни."},
	{7, "7 Натажени ги видов шаторите етиопски; се стресоа сениците на земјата Мадијамска."},
	{8, "8 Зар против реките, Господи, пламнал гневот Твој? Зар против реките е Твоето негодување, или, пак, против морето е јароста Твоја - па си седнал на коњите Свои, на победничките бојни коли?"},
	{9, "9 Ти го извади лакот Свој според клетвениот завет, даден на колената, ја раздели земјата со реки."},
	{10, "10 Кога те видов, планините затреперија, водите навалија; бездната го пушти гласот свој и угоре ги крена рацете свои."},
	{11, "11 Сонцето и месечината застанаа на своето место пред болскотот на вперените стрели Твои, пред светкањето на сјајните копја Твои."},
	{12, "12 Во гнев одиш по земјата и во негодување ги газиш народите."},
	{13, "13 Ти излегуваш за спасение на народот Твој, за спасение на помазаникот Свој. Ти ја поразуваш главата на нечестивиот дом, оголувајки го од петите до врвот."},
	{14, "14 Со копјата нивни Ти ја пронизуваш главата на нивните водачи, кога како виор се спуштаат да ме разбијат, радосни, оти мислеа дека скришум ке го проголтаа сиромавиот."},
	{15, "15 Со коњите Свои отвори пат преку морето, преку длабините на големите води."},
	{16, "16 Јас чув и внатрешноста моја затрепери, при гласот Твој затреперија и усните мои, болка почувствував во коските мои, и местото под мене трепери; а јас требаше да бидам спокоен во денот на бедата, кога ке дојде гребителот против мојот народ."},
	{17, "17 Макар и да не процути смоквата, а и да нема плод по лозите, макар маслината и да откаже, и нивата да не даде плод, макар и овците да не останат во трлото, па и рогат добиток во оборите да нема,"},
	{18, "18 јас и тогаш ке се радувам во Господа и ке се веселам во Бога на моето спасение."},
	{19, "19 Господ Бог е мојата сила: Он ке ги направи нозете мои како на елен и ке ме поведе по височините мои."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};