#include <map>
#include <string>
class Bible23
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
	struct mk6	{ int val; const char *msg; };
	struct mk7	{ int val; const char *msg; };
	struct mk8	{ int val; const char *msg; };
	struct mk9	{ int val; const char *msg; };
	struct mk10	{ int val; const char *msg; };
	struct mk11	{ int val; const char *msg; };
	struct mk12	{ int val; const char *msg; };
	struct mk13	{ int val; const char *msg; };
	struct mk14	{ int val; const char *msg; };
	struct mk15	{ int val; const char *msg; };
	struct mk16	{ int val; const char *msg; };
	struct mk17	{ int val; const char *msg; };
	struct mk18	{ int val; const char *msg; };
	struct mk19	{ int val; const char *msg; };
	struct mk20	{ int val; const char *msg; };
	struct mk21	{ int val; const char *msg; };
	struct mk22	{ int val; const char *msg; };
	struct mk23	{ int val; const char *msg; };
	struct mk24	{ int val; const char *msg; };
	struct mk25	{ int val; const char *msg; };
	struct mk26	{ int val; const char *msg; };
	struct mk27	{ int val; const char *msg; };
	struct mk28	{ int val; const char *msg; };
	struct mk29	{ int val; const char *msg; };
	struct mk30	{ int val; const char *msg; };
	struct mk31	{ int val; const char *msg; };
	struct mk32	{ int val; const char *msg; };
	struct mk33	{ int val; const char *msg; };
	struct mk34	{ int val; const char *msg; };
	struct mk35	{ int val; const char *msg; };
	struct mk36	{ int val; const char *msg; };
	struct mk37	{ int val; const char *msg; };
	struct mk38	{ int val; const char *msg; };
	struct mk39	{ int val; const char *msg; };
	struct mk40	{ int val; const char *msg; };
	struct mk41	{ int val; const char *msg; };
	struct mk42	{ int val; const char *msg; };
	struct mk43	{ int val; const char *msg; };
	struct mk44	{ int val; const char *msg; };
	struct mk45	{ int val; const char *msg; };
	struct mk46	{ int val; const char *msg; };
	struct mk47	{ int val; const char *msg; };
	struct mk48	{ int val; const char *msg; };
	struct mk49	{ int val; const char *msg; };
	struct mk50	{ int val; const char *msg; };
	struct mk51	{ int val; const char *msg; };
	struct mk52	{ int val; const char *msg; };
	struct mk53	{ int val; const char *msg; };
	struct mk54	{ int val; const char *msg; };
	struct mk55	{ int val; const char *msg; };
	struct mk56	{ int val; const char *msg; };
	struct mk57	{ int val; const char *msg; };
	struct mk58	{ int val; const char *msg; };
	struct mk59	{ int val; const char *msg; };
	struct mk60	{ int val; const char *msg; };
	struct mk61	{ int val; const char *msg; };
	struct mk62	{ int val; const char *msg; };
	struct mk63	{ int val; const char *msg; };
	struct mk64	{ int val; const char *msg; };
	struct mk65	{ int val; const char *msg; };
	struct mk66	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Видение на Исаија, синот Амосов, кое го виде за Јудеја и Ерусалим, во деновите на јудејските цареви Озија, Јоатам, Ахаз и Езекија."},
	{2, "2 Чујте, небеса, и слушај, земјо, зашто Господ вели: 'Јас воспитав и подигнав синови, а тие се побунија против Мене."},
	{3, "3 Волот го познава стопанот свој, и оселот - јаслите на господарот свој, а Израилот не Ме познава, Мојот народ не разбира.'"},
	{4, "4 Ах, народе грешен, народ претрупан со беззаконија, племе за злодејци и синови погубни! Го оставивте Господа, Го презревте Светецот Израилев, - се вративте назад."},
	{5, "5 Каде уште да ве бијат вас, кои се уште се противставувате? Целата глава ви е во рани, и целото срце ви е изнемоштено."},
	{6, "6 Од главата до петите нема во тој народ здраво место, сињаци, гнојни рани, нечистени, непреврзани и неомекнати со елеј."},
	{7, "7 Замјата ви е опуштошена, градовите ви се изгорени со оган; нивите ваши пред ваши очи ту инци ги јадат; и пустош е, како што запустуваат ту инци."},
	{8, "8 Остана керката Сионова како колиба во лозје, како сеница во градина, како опсаден град."},
	{9, "9 Да не беше ни оставил Господ Саваот мал остаток, ке бевме исто така како Содом, ке заприлегавме на Гомор."},
	{10, "10 Чујте го словото Господово, кнезови содомски, вслушајте се во законот на нашиот Бог, народе гоморски!"},
	{11, "11 'Зашто ми се многуте ваши жртви - вели Господ. Презаситен сум од сепаленици на овни и од маснотија на згоен добиток; крв од телињата, од јагниња и јариња не сакам."},
	{12, "12 Кога доа ате да се јавите пред лицето Мое, кој ви бара да ги газите дворовите Мои?"},
	{13, "13 Не принесувајте веке суетни жртви; кадењето е одвратно за Мене; новомесечија, саботи и празнични собранија не можам да трпам: беззаконие - и празнувања...?"},
	{14, "14 Душата Моја ги мрази вашите новомесечија и вашите празници: тие се товар за мене, тешки Ми е да ги носам."},
	{15, "15 И кога протегате раце, Јас ги кријам од вас очите Свои, а кога ги умножувам молбите свои, Јас не слушам: рацете ваши се полни со крв."},
	{16, "16 Измијте се, исчиетете се; иставете ги од очите Мои лошите дела свои; престанете да правите зло;"},
	{17, "17 научете се да правите добро, барајте правда, спасувајте угнетен, заштитувајте сирак, застапувајте се за вдовица.'"},
	{18, "18 Тогаш дојдете и ке се пресуди, вели Господ. Гревовите ваши да се и како бакам, - како снег ке ги побелам; да бидат црвени и како пурпур, - како волна ке станат бели."},
	{19, "19 Ако Го барате и послушата, ке ги јадете добрата земни;"},
	{20, "20 ако, пак, не сакате и се противставувате, меч ке ве истреби, тоа го рече устата Господова."},
	{21, "21 Како правичниот верен град Сион стана блудница? Во него царуваше правда, а сега престојуваат убијци."},
	{22, "22 Среброто ти стана како згура, виното ти е со вода помешано;"},
	{23, "23 твоите кнезови се престапници на законот и соучесници на крадци; сите тие сакаат подароци и лакомат за награда; не заштитуваат сирак, и поплака на вдовица не стигнува до нив."},
	{24, "24 Затоа вели Господ, Господ Саваот, Силниот Израилев: 'О, ке ја истурам јароста на противниците Свои и ке им се одмаздам на непријателите Свои!"},
	{25, "25 и ке ја свртам против тебе раката Своја и како во пепелница ке ја исчистам од тебе смешата и ке ги одделам од тебе се што е оловно;"},
	{26, "26 и пак ке поставам судии, како порано, и советници како отпрвин; тогаш ке говорат за тебе: град на правда, верна престолнина!"},
	{27, "27 Сион ке се спаси преку праведен суд, и обратените негови - преку правдата;"},
	{28, "28 за сите отстапници и грешници - погибел, а оние, што го оставиле Господа, ке бидат истребени."},
	{29, "29 Тие ке бидат посрамени заради младите шуми, толку многу сакани од вас, ке црвенеат од срам заради градините што сте си ги избрале;"},
	{30, "30 зашто вие ке бидете како дабот, чиј листа паднал и како градина, во која нема вода."},
	{31, "31 И силниот ке биде отпадок, а делото негово искра; ке горат заедно, - и никој нема да ги угасне.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Слово, откриено во видението на Амосовиот син Исаија, за Јудеја и Ерусалим."},
	{2, "2 И ете, во последните дни гората на домот Господов ке биде поставена на врвот од планините и ке се возвиси над ридовите, ке појдат кон неа сите народи."},
	{3, "3 Kе тргнат многу народи и ке речат: 'Дојдете, да се искачиме на гората Господова, во домот на Бога Јаковов; Он ке не научи на Своите патишта, и ке одиме по патеките Негови; зашто од Сион ке излезе законот, и од Ерусалим - словото Господово.'"},
	{4, "4 И ке им суди Он на народите и ке изобличи многу племиња; ке ги прековаат мечевите свои во плугови, а копјата свои - во српови: народ против народ нема да крене меч и нема поеке да се учат на војна."},
	{5, "5 О, доме Јаковов! Дојдете, ке одиме во Господовата светлина."},
	{6, "6 Но Ти го отфрли Својот народ, домот Јаковов, зашто тие примија многу од источните зла и маесници си имаат како Филистејците, и општат со синови на ту инци."},
	{7, "7 Се исполни земјата негова со злато и сребро, богатствата крај немаат; се исполни земјата негова со коњи, колите негови број немаат."},
	{8, "8 Се исполни земјата негова со идоли: тие се поклонуваат на изработка од своите раце, на она што нивните прсти го направиле."},
	{9, "9 Си поклонува ли човек, и се понижува ли маж - не простувај им."},
	{10, "10 Влези во карпата и сокриј се во земјата од страв пред Господа и од славата на Неговото величие."},
	{11, "11 Ничкум ке паднат гордите погледи човечки, и она, што е високо кај лу ето, ке се понизи; а само Господ ке стои високо во тој ден."},
	{12, "12 Зашто иде денот на Господа Саваот против се што е гордо и надуено и против се што е превознесено, - и тоа ке биде понизено, -"},
	{13, "13 против сите кедри ливански, високи и величествени, и против сите дабови васански,"},
	{14, "14 против сите високи гори и против сите ритчиња што се издигаат,"},
	{15, "15 против секоја висока кула и против секоја цврста sидина,"},
	{16, "16 против сите тарсиски кораби и против сите нивни украси."},
	{17, "17 И ке падне човечкото величие, она што е високо кај лу ето ке се понизи; само Господ ке стои високо во тој ден,"},
	{18, "18 а идолите сосема ке исчезнат."},
	{19, "19 И ке влезат лу ето во карпести пештери и во земни јами од страв пред Господа и од славата на неговото величие, кога ке се крене Он да ја разруши земјата."},
	{20, "20 Во тој ден човекот ке ги фрли своите сребрени и своите златни идоли, што ги направил за да им се клања,"},
	{21, "21 за да влезе во камени процепи и во планински долови од страв пред Господа и од славата на Неговото величие, кога ке се крене Он да ја разруши земјата."},
	{22, "22 Престанете да се надевате на човек, чие дишење е во ноздрите негови, зашто - што знае тој?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 Ете, Господ, Господ Саваот ке го одземе од Ерусалим и од Јуда жезалот и помошта, секоја поткрепа во леб и вода,"},
	{2, "2 храбар водач и војник, судија и пророк, јасновидец и старец,"},
	{3, "3 петдесетник и големец, советник, мудар уметник и вешт гатач."},
	{4, "4 Kе им дадам момчиња за началници, и деца ке владеат над нив."},
	{5, "5 а во народот еден ке угнетува друг, и секој својот ближен; момче бесрамно ке се прави голем пред старец и простак - пред големец."},
	{6, "6 Тогаш човек ке се фати за братот свој, во челадта на татка си свој и ке рече: 'Ти имаш облека, биди ми водач, и овие урнатини нека бидат под твоја рака.'"},
	{7, "7 А тој со клетва ке рече: 'Не можам да ги излекува раните на народот; и во мојата кука нема ни леб, ни облека: не правете ме водач на народот.'"},
	{8, "8 Така пропаднал Ерусалим, и падна Јуда, зашто јазикот нивни и делата нивни се против Господа, навредливи пред очите на Неговата слава."},
	{9, "9 Изразот на лицето нивно сведочи против нив, а за гревот свој тие кажуваат отворено, како содомците, не кријат: тешко на душата нивна! Сами на себеси навлекуваат зло."},
	{10, "10 Кажете му на праведникот: 'Блазе му, зашто тој ке ги јаде плодовите на делата свои;"},
	{11, "11 а на беззаконикот - тешко нему, оти ке има отплата за делата на рацете свои."},
	{12, "12 Притеснители на Мојот народ се децата, и жени вадеат над него. Народе Мој, твоите воедачи те доведуваат до заблуда и го растуриле патот, по кој одиш.'"},
	{13, "13 Се крена Господ на суд - и стои, за да им суди на народите."},
	{14, "14 Господ влегува во суд со старешините на Својот народ и со неговите кнезови: вие го опустошивте лозјето; ограбеното од сиромасите е во вашите куки."},
	{15, "15 'Зошто го притеснувате народот Мој и ги угнетувате сиромасите?' вели Господ, Господ Саваот."},
	{16, "16 Потоа рече Господ: 'Поради тоа што керките сионски се гордеат и одат со исправени вратови, што освојуваат со погледите, и ситно одат и со веришки на нозете тропкаат.'"},
	{17, "17 Господ ке го оголи темето на керките сионски, и ке го открие срамот нивни;"},
	{18, "18 во оној ден Господ ке ги одземе убавите веришки на нозете, секакви sвездички и месечинки,"},
	{19, "19 обетки, ерданчиња и ладила, "},
	{20, "20 превези, гривни и појаси, стакленца со мириси и уметнички украси,"},
	{21, "21 прстење и алки за нос,"},
	{22, "22 горна облека и долна, шамичиња и уметнички украси,"},
	{23, "23 светли тенки наметки, забратки и покривала."},
	{24, "24 И наместо пријатен мирис ке има смрад и место појас - јаже, место кадрени коси - келави глави, неместо широка наметка - тесно врекиште, место убавина - жигосување."},
	{25, "25 Мажите твои ке паднат од меч, а јунаците твои во битка,"},
	{26, "26 и портите на престолнината ке воздивнуваат и ке плачат, а таа ке седи напуштена на земјата."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 Во оној ден седум жени ке се фатат за еден маж и ке речат: 'Свој леб ке јадеме и своја облека ке носиме, доста е само да се нарекуваме со твоето име, - симни го од нас срамот наш.'"},
	{2, "2 Во оној ден фиданката Господова ке се јави во убавина и чест, а плодот на земјата - во величие и слава, за спасените синови Израилеви."},
	{3, "3 Тогаш другите на Сион и измачените во Ерусалим - сите, запишани како да живеат во Ерусалим, ке се нарекуваат свети,"},
	{4, "4 кога Господ ке ја измие нечистотијата на керките сионски и ке ја исчисти крвта на Ерусалим од средината негова со дух, кој суди и со дух, кој пали."},
	{5, "5 И ке направи Господ над секое место на Сион гора и над собранијата и дење облак и дим, а ноке - блесок од пламнат оган; зашто слава ке покрива се."},
	{6, "6 И ке има шатор за сенка дење од припек и засолниште и заклон од лошо време."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 Kе му ја запеам на мојот Возљубен Неговата песна за лозјето негово. Мојот Возљубен имаше лозје на врвот од плодороден рид;"},
	{2, "2 Тој го огради и го исчисти од камења, насади во него одбор од лозови прачки, изгради кула во средината негова, направи големи крбли; очекуваше да роди добро грозје, а тоа роди диво грозје."},
	{3, "3 Па сега, жители ерусалимски и мажи Јудејци, пресудете ме у Мене и Моето лозје."},
	{4, "4 Што уште требаше да направам за Моето лозје и не го направив? Зошто, очекував принос од добро грозје, тоа даде диво грозје?"},
	{5, "5 Сега ке ви кажам што ке направам со лозјето Свое: ке ја иставам оградата, и тоа ке биде опустошено; ке му ги разрушам sидиштата, и ке биде газено:"},
	{6, "6 ке го оставам да запусти: нема ни да го режат, ни да го копаат, - ке обрасне во трње и боцки, ке им заповедам на облаците да не истураат дожд врз него."},
	{7, "7 Лозјето на Господа Саваот е домот Израилев, а лу ето на Јуда - Негова љубена градина. И чека Он правосудие, но ете - крвопролевање; чека правда, а ете - пискот."},
	{8, "8 Тешко ви вам, што притурате кука кон кука, што присоединувате нива кон нива, така што за другите да не останува место, како да сте само вие населени на земјата!"},
	{9, "9 Во ушите мои - Господ Саваот рече: - тие многубројни домови ке бидат пусти, тие големи и убави куки ке бидат без жители;"},
	{10, "10 десет дулуми лозје ке дадат едно буре, а еден шиник посеано семе, одвај ке донесе една ефа."},
	{11, "11 Тешко им е на оние, кои од рано утро бараат сикер и до доцна вечер се згорештуваат со вино;"},
	{12, "12 на нивните гоштавки има и гитара, и гусле, и тимпани, и свирка и вино; а кон делата на Господа тие и не погледнуваат, ниту помислуваат за делата на Неговите раце."},
	{13, "13 Затоа мојот народ ненадејно ке отиде во ропство; неговите големци ке гладуваат, богаташите негови ке се мачат од жед."},
	{14, "14 Затоа пеколот се раширил и без мерка ја отворил устата своја: таму ке слезе нивната слава и нивното богатство, вревата нивна и се што ги весели"},
	{15, "15 И ке се раскае човекот, ке се смири мажот, и очите на гордите ничкум ке поникнат;"},
	{16, "16 а Господ Саваот се возвеличи во суд, светиот Бог ке ја соопшти светоста Своја во правда."},
	{17, "17 И овците ке си пасат по воља, и ту и ке се хранат со оставените плодни пасишта на богатите."},
	{18, "18 Тешко им на оние, што влечат по себе беззаконие со јажиња на суетноста и грев - како со колски ремења;"},
	{19, "19 кои велат: 'Нека побрза Он и нека го забрза делото Свео, за да видиме, нема се приближи и нека се исполни решението на Светецот Израилев, за да дознаеме!'"},
	{20, "20 Тешко им на оние, кои злото го нарекуваат добро и доброто - зло, темнината ја сметаат за светлина, и светлината - за темнина, горчливото - за слатко, а слаткото - за горчливо!"},
	{21, "21 Тешко има на оние, кои се мурди во своите очи и разумни пред самите себеси!"},
	{22, "22 Тешко им на оние, кои се храбри вино да пијат и се во сила да приготвуваат жесток пијалок,"},
	{23, "23 кои за подароци го оправдуваат виновниот и ги лишуваат праведните од законитиото!"},
	{24, "24 Затоа, како што огнот ја јаде сламата, и пламенот го истребува сеното, така ке загине коренот нивни, цветот нивни ке се разнесе како прав; зашто тие го отфрлија законот на Господа Саваот и го презреа словото на Светецот Израилев."},
	{25, "25 Затоа гневот на Господа ке се разгори против Неговиот народ, ке ја протегне раката Своја против него и ке го порази, така што горите ке затреперат и труповите нивни ке бидат како убре по улиците. А при сето тоа гневот Негов нема да се одврати и раката Негова уште ке биде протегната."},
	{26, "26 И ке крене знаме за далечни народи и ке им даде знак на оние што живеат на крајот од земјата, и ете, тие лсно и брзо ке дојдат;"},
	{27, "27 кај нив нема да има ни умрен, ни премален; ниеден нема да задреме и нема да заспие; нема да се отпаше појасот од половината негова и нема да се одврзе ремен од чевлите негови;"},
	{28, "28 стрелите негови се изострени, сите лакови - им се затегнати; копитата на коњите нивни се како кремења, а колцата нивни - како виор;"},
	{29, "29 рикањето нивно е како рикањето на лавица; тој рика како лавче и ке зарика, ке го зграпчи пленот и ке го однесе и никој нема да му го одземе."},
	{30, "30 Во оној ден ке зарика против него како божем рикање на разбеснето море; ке погледне Он на земајта, и ете, темнина и жалост, а светлината потемнела во облаците."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct mk6 poems[] = {
	{1, "1 Во годината кога умре цар Озија, јас го видов Господа, седнат на престолот висок и издигнат, а полите на одеждата Негова го исполнија целиот храм."},
	{2, "2 Околу Него стоеја серафими; секој од нив имаше по шест криља: со две секој го криеше лицето свое, со две други ги криеше нозете свои, а со две леташе."},
	{3, "3 И викаа еден кон друг и велеа: 'Свет, свет, свет е Господ Саваот! Целата земја е полна со Неговата слава!'"},
	{4, "4 И се разниша, горништето на вратите од гласот на оние што викаа, а домот се исполни со дим."},
	{5, "5 И реков: 'Тешко ми мене, зашто сум човек со нечиста уста и живеам среде народ исто така со нечиста уста, - а очите мои Го видоа Царот Господа Саваот!'"},
	{6, "6 Тогаш долета до мене еден од серафимите со разгорен јаглен во раката што го беше зел со клешти од жртвеникот,"},
	{7, "7 се допре до устата моја и ми рече: 'Ете, тоа се допре до устата твоја - и твоето беззаконие се оттргна од тебе, гревот твој се очити.'"},
	{8, "8 И го чув гласот на Господа, Кој рече: 'Кого да испратам у кој ке отиде заради нас?' А јас реков: 'Еве ме мене, испрати ме мене!'"},
	{9, "9 Тогаш Он рече: 'Оди и кажи му на тој народ: ‘со ушите ке чуете и нема да разберете, и со очи ке гледате - и нема да видите.‘"},
	{10, "10 Зашто срцето на тој народ е закоравено, и со ушите тешко слушаат и ги затвориле очите свои за да не гледаат со очи, со уши да чујат и со срце да разберат, та да се обрнат да ги излекувам.'"},
	{11, "11 И реков: 'До кога, Господи?' Он рече: 'Додека запустат градовите и останат без жители, и куките без лу е, земјата сосема не се запусти,"},
	{12, "12 додека Господ не ги оддалечи лу ето и голема пустош во таа земја да има."},
	{13, "13 И ако остане уште десеттиот дел на неа и се врати, таа пак ке биде разорена; но како од брест и даб, кога се и отсечени, останува коренот нивни, така светото семе ке биде нејзин корен.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct mk7 poems[] = {
	{1, "1 Во дните на Ахаза - синот на Јоатама, син Озиев, цар јудејски, - Ресина, царот сириски, и Факеј, синот ремалиев, цар израилски, отидоа проти Ерусалим да го завладеат, но не можеа да го преземат."},
	{2, "2 Тогаш му беше соопштено на домот Давидов и речено: 'Сиријци се сместија во земјата Ефремова. И му затрепери срцето на Ахаза и срцето на народот негов, како што од ветар се нишаат дрвјата.'"},
	{3, "3 И му рече Господ на Исаија: 'Излези и ти и син ти Сеарјасув да го пречекаш Ахаза на крајот од горното езеро по патот кај нивата на валавичарот,"},
	{4, "4 и кажи му: внимавај и биди спокоен; не бој се, и да не се плаши срцето твое пред двата краја на тие гламји што чадат, од изгорениот гнев на Ресина, на Сиријците и на синот Ремалиев.'"},
	{5, "5 Сирија, Ефрем и синот Ремалив кројат против себеси зло, велејки:"},
	{6, "6 ‘да одиме против Јудеја и да ја исплашиме, да ја завладееме и да го поставиме за цар Тавеиловиот син.‘"},
	{7, "7 Но Господ Бог вели вака: 'Тоа нема да стане и нема да се изврши,"},
	{8, "8 зашто главата на Сирија е Дамаск, а главата на Дамаск - Ресин; по шеесет и пет години Ефрем ке престане да биде народ;"},
	{9, "9 глава на Ерфема е Самарија, а глава на Самарија - синот Ремалиев. Ако не верувате, нема да се додржите.'"},
	{10, "10 И продолжува Господ да му говори на Ахаза и му рече:"},
	{11, "11 'Барај за себе знак од Господа, твојот Бог: барај или во длабочините или во височините.'"},
	{12, "12 И рече Ахаз: 'Нема да барам и нема да го искушувам Господа.'"},
	{13, "13 Тогаш Исаија рече: 'Слушајте, пак, доме Давидов! Зар ви е малку тоа што им дотежнувате на лу ето, па сакате да Му дотежнувате и на мојот Бог?'"},
	{14, "14 Затоа Самиот Господ ке ви даде доказ: ете, Девица ке зачне и ке роди Син, и ке Му дадат името Емануел."},
	{15, "15 Тој ке се храни со млеко и мед, додека да се научи да го отфрла лошото и да го избира доброто."},
	{16, "16 Зашто, пред доенчето да се научи да го отфрла лошото и да го избира доброто, оваа земја, од која ти се плашиш, ке биде оставена од двајцата цареви."},
	{17, "17 Но Господ ке испрати врз тебе и врз народот твој и врз домот на татка ти, какви што не доа але, откако Ефрем се оддели од Јуда - ке го испрати асирскиот цар."},
	{18, "18 И ете, во тој ден Господ ке свирне не мувите, кои се кај устието на египетската река, и на пчелата, која е во асирската земја, -"},
	{19, "19 и ке долетаат и ке заседнат сите тие по запустените долини и по камените пештери и по сите трништа и по сите дрвја."},
	{20, "20 Во тој ден Господ ке го избричи со брич земен од оваа страна на реката - преку асирскиот цар, главата и влакната на нозете, ке ја симне дури и брадата."},
	{21, "21 И во тој ден, кој храни крава и две овци,"},
	{22, "22 поради изобилството на млеко, што тие ке го дадат, ке јаде масло; со масло и мед ке се хранат сите, што останале на земја."},
	{23, "23 во тој ден на секое место, каде што растеле иљада лози за иљада сребреници, ке има глог и трниште."},
	{24, "24 Таму ке се оди со лакови и стрели, бидејки целата земја ке е во глогови и трњаци."},
	{25, "25 И на ниедна од горите, што биле расчистувени со трнокоп, нема да одиш, поради страв од глог и од трња; таму ке истеруваат говеда и ситен добиток ке гази"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct mk8 poems[] = {
	{1, "1 И ми рече Господ: 'Земи си голем свиок и напиши на него со човечко писмо: брз на плен и итар на грабеж."},
	{2, "2 И си зедов верни сведоци: свештеникот Урија и Захарија, синот Варахиев,"},
	{3, "3 и пристапив кон пророчицата, и таа зачна и роди син. И ми рече Господ: дај му име: брз на плен и итар на грабеж; шах - баз;"},
	{4, "4 зашто, пред да се научи детето да изговара: тате, мамо, - богатството на Дамаск и пленот самариски ке бидат претставени пред асирскиот цар.'"},
	{5, "5 И продолжуваше да ми зборува Господ и рече:"},
	{6, "6 'Зошто овај народ ги занемарува водите на Силоам, оти течат тивко, и се восхитува на Ресина, и од синот Ремалиев,"},
	{7, "7 Господ ке го испрати врз него бурните и големи води на реката - асирскиот цар со сета негова слава;"},
	{8, "8 и ке навлезе во Јудеја, ке ја наводни и високо ке се крене - ке стигне до вратот; и раширените крила нејзини ке бидат по целата ширина на Твојата земја, Емануиле!'"},
	{9, "9 Здружувајте се, народи, но ке бидете уништени, и внимавајте вие сите што сте далечни земји! вооружувајте се, но ке бидете победени; вооружувајте се, но ке бидете уништени!"},
	{10, "10 Кројте заговори, но тие ке се рушат, говорете збор, но тој нема да си исполни, зашто со нас е Бог!"},
	{11, "11 Зашто вака ми велеше Господ, држејки ја врз мене цврстата рака и опменувајки ме да не одам по патот на тој народ, велејки:"},
	{12, "12 'Не нарекувајте го заговор сето она што тој народ го нарекува заговор; и не плашете се од она, од кое тој се плаши, не стравувајте."},
	{13, "13 Господа Саваота - Него свето почитувајте Го, и Он да биде ваш страв и ваш трепет!"},
	{14, "14 Он ке биде осветување и камен за сопнување и карпа за соблазна на двата дома Израилеви, стапица и мрежа за жителите ерусалимски."},
	{15, "15 И мнозина од нив ке се сопнат и ке паднат, ке се разбијат, ке се заплеткаат во стапицата и ке бидат уловени.'"},
	{16, "16 'Врзи го свидетелството и запечати го откровението пред своите ученици.'"},
	{17, "17 И така, јас се надевам на Господа, Кој го сокрил лицето Свое од домот Јаковов, на Него се надевам."},
	{18, "18 Ете, јас и децата што ми ги даде Господ, сме како белези и докази во Израилот од Господа Саваот, Кој живее на гората Сион."},
	{19, "19 И кога ке ви речат: 'Обрнете се кон оние, што извикуваат мртовци, и кон ма есници, кон бајачи и оние што говорат од стомак, тогаш одговарајте: не треба ли народот да се обрнува кон својот Бог? Се прашуваат ли мртви за живи?"},
	{20, "20 Допрашајте се до законот и откровението! Ако неко речат дека не е така, тогаш за нив нема светлина."},
	{21, "21 Kе скитаат тие по земјата, жестоко угнетувани и гладни; и во време на гладта ке се лутат, ке го навредуваат својот цар и својот Бог."},
	{22, "22 И ке се загледаат угоре, и ке погледаат кон земјата; и ете - скрб и мрак, густа темнина; и ке бидат фрлени во темнината. Но нема секогаш да има мрак таму, каде што сега тој е згустен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct mk9 poems[] = {
	{1, "1 Поранешното време ја понизи земјата Завулонова и земјата Нефталимова; но подоцнежното - ке го возвеличи крајмоскиот пат, од онаа страна на Јордан, незнабожечка Галилеја."},
	{2, "2 Народот, кој оди во темнина, ке види голема светлина; врз оние што живеат во земјата на смртната сенка ке болсне светлина."},
	{3, "3 Ти ке го умножиш народот, ке ја зголемиш радоста негова. Тој ке се весели пред Тебе, како што се веселат за време на жетва, како што се радуваат при делење на плен."},
	{4, "4 Зашто јаремот, кој му тежеше, и жезлото, што го поразуваше, и стапот на неговиот угнетувач - Ти ке ги скршиш, како во денот на Мадијама."},
	{5, "5 Оти секоја војничка обувка во време на војна и облека, извалкана од крв, ке бидат предадени на изгорување, за храна на огнот."},
	{6, "6 Зашто Младенец ни се роди - Син ни се даде; власта е на рамењата Негови, и ке Го наречат: Советник, Чудесни, Бог силен, Отец вечен, Кнез на мирот."},
	{7, "7 Неговата власт и мирот бескраен ке растат врз престолот на Давида и во царството негово, за да го утврди Он и да го зацврсти преку суд и прада отсеа па довека. Тоа ке го направи ревноста на Господа Саваота."},
	{8, "8 Господ му испрака слово на Јакова, тоа слегува врз Израилот,"},
	{9, "9 за да знае сиот народ, Ефрем и жителите на Самарија, кои со гордост и надуено срце велат:"},
	{10, "10 'Тулите паднаа, - ке градиме со делкани камења; смоквите се исечени, - ке ги замениме со кедри."},
	{11, "11 Kе се крене Господ против него и непријателите на Ресина, ке ги вооружи непријателите негови;"},
	{12, "12 Сиријците од кај исток, Филистејците од кај запад; ке го голтнат Израилот со полна уста. При сето тоа гневот Негов нема да се одврати и раката Негова ке биде протегната."},
	{13, "13 Но народот не се обрнува кон Оној, Кој го бие и не прибегнува кон Господа Саваот."},
	{14, "14 Господ ке му ја пресече на Израилот главата и опашката, палмата и трската во еден ден:"},
	{15, "15 старецот и големецот - тоа е главата; а пророкот - лажниот учител е опашот."},
	{16, "16 Водачите на овој народ ке го доведат во заблуда, а водените од нив ке загинат."},
	{17, "17 Затоа Господ нема да се радува на момчињата негови, и нема да се смили над сираците негови и вдовиците негови; зашто сите тие се лицемери и злодејци, и устата на сите зборува нечесно. При сето тоа гневот Негов нема да се одврати и раката Негова уште е протегната."},
	{18, "18 Зашто беззаконието како оган се разгорело, голтнува глог и трн и гори во горските гасталаци, се креваат столбови од дим."},
	{19, "19 Гневот на Господа Саваот ке ја изгори земјата, народот ке стане како храна за огнот, човек нема да го пожали братот свој."},
	{20, "20 Kе сечат надесно - и ке си останат гладни; ке јадат налево - и нема да се наситат; секој ке го јаде месото од својата мишка:"},
	{21, "21 Манасија - Ефрема, и Ефрем - Манасија, обајцата заедно - Јуда. При сето тоа нема да се одврати гневот Негов, и раката Негова уште е протегната."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct mk10 poems[] = {
	{1, "1 Тешко им на оние што создаваат неправедни закони и пишуваат остри решенија,"},
	{2, "2 за да ги отстранат сиромасите од правосудието и да ги ограбат правата на слабите ме у Мојот народ, за да ги направат вдовиците свој плен и да ги грабаат сираците."},
	{3, "3 А што ке правите вие во денот на посетата, кога смртта ке дојде оддалеку? Кон кого ке прибегнете за помош? Каде ке го оставите богатството свое?"},
	{4, "4 Без Мене тие ке се превиваат ме у окованите и ке паднат ме у убиените. При сето тоа нема да се одврати гневот Негов, раката Негова уште е протегната."},
	{5, "5 О, Асуре, жезло на Мојот гнев и бич на Моето негодување!"},
	{6, "6 Kе го испратам против нечесен народ и против народот на Мојот гнев, ке му дадам повелба грабеж да грави и плен да плени и да ги гази како улична кал."},
	{7, "7 Но тој нема така да расуди, срцето негово нема да помисли вака: нему на срце ке му биде - да разурне и да истреби многу народи."},
	{8, "8 Зашто тој ке рече: 'Нели се сите цареви мои кнезови?"},
	{9, "9 Халне не ли е она што и Кархемис? Емат не ли е она што и Арпад? Самарија не ли е она што е Дамаск?"},
	{10, "10 Бидејки раката моја завладеа со идолските царства, во кои беа идолите повеке отколку во Ерусалим и Самарија, -"},
	{11, "11 тоа нема ли да го направам истото со Ерусалим и со неговите кипови, како што направив со Самарија и со нејзините идоли?"},
	{12, "12 А кога Господ ке го изврши сето Свое дело на гората Сион и во Ерусалим, тогаш ке го казнам плодот на горделивото срце на царот асирски и дрскоста на високо кренатите му очи.'"},
	{13, "13 Зашто рече: 'Со силата на Своите раце и со премудроста на Својот разум го направив тоа, зашто сум умен: ги разместам границите на народите, и нивните богатства ги ограбив,"},
	{14, "14 раката Моја го ограби богатството на народите како гнезда: како што ги земаат оставените во нив јајца, така ја заграбив јас целата земја, и никој со крило не мрдна, ни уса не отвори, ниту писна.'"},
	{15, "15 Се крева ли на големо секирата пред оној што сече со неа? Се гордее ли трионот пред оној што го движи? Како стап да се прева против оној што го дига! Како божем прачка се крева против оној, кој не е дрво!"},
	{16, "16 Затоа Господ, Господ Саваот ке испрати немок на неговите здрави и ме у првенците на твојата чест и бесчестие и врз твојата слава оган на зло ке се разгори."},
	{17, "17 Светлината на Израилот ке биде оган, а неговиот Светец - пламен, кој ке ги изгори и ке ги изеде трњето негови и боцките негови во еден ден;"},
	{18, "18 ке ја истреби славната шума негова и градината негова, од душа до тело, и тој ке биде како немокен, кој умира."},
	{19, "19 И другите дрвја од шумата негова ке бидат толку малубројни, што дури и дете ке може да им направи опис."},
	{20, "20 И ете, во тој ден Израилевиот остаток и спасените од домот на Јакова нема веке да се потпираат на оној, кој ги порази, но простосрдечно ке положат надеж во Господа, Светецот Израилев."},
	{21, "21 Остатокот ке се врати, остатокот на Јакова, ке се врати кон Бога Силен."},
	{22, "22 Зашто, иако твојот народ, Израиле, е колку морскиот песок, само остатокот негов ке се обрати; решението за истребување е преисполнето со правда;"},
	{23, "23 зашто решеното истребување ке го изврши Господ, Господ Саваот, по целата земја."},
	{24, "24 Поради тоа вака вели Господ, Господ Саваот: 'Народе Мој, што живееш на Сион, не бој се од Асура. Тој ке те порази со жезло и ке го крене стапот против тебе, како Египет."},
	{25, "25 Уште малку, сосема малку, - и Мојот гнев ке мине, јароста Моја ке се сврти да ги истреби.'"},
	{26, "26 И ке крене Господ Саваот бич врз него, како кога го порази Мадијам кај карпата Орив, или како кога го протегна жезлото врз морето, ке го крене како врз Египет."},
	{27, "27 Во тој ден ке биде симнат од твоите рамења товарот негов, и јаремот негов - од твојот врат; јаремот ке се скрши од дебелина."},
	{28, "28 тој оди против Ајат, го минува Мигрон, натрупува харни во Михмас."},
	{29, "29 Ти минуваат клусири; Во Гева нокеваат; Рама се тресе; Гива Саулова се разбега."},
	{30, "30 Викај со глас керко Галимова; нека те чуе Лаис, беден Анатоте!"},
	{31, "31 Мадмена се разбега, жителите на Гевам брзаат да побегнат."},
	{32, "32 Уште еден ден ке престојува тој во Нов; со раката своја ја заплашува гората Сион, ерусалимскиот рид."},
	{33, "33 Ете, Господ, Господ Саваот со страшна сила ке ги откине гранките на дрвјата и кои со својот раст се зголемуваат, ке бидат пресечени, високите - на земја соборени."},
	{34, "34 И горскиот гасталак Он ке го исече со меч, - и Ливан ке падне од Семокниот."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct mk11 poems[] = {
	{1, "1 И ке потера фиданка од Јесеевата пењушка, и стебло ке израсне од нејзиниот корен;"},
	{2, "2 ке почива врз Него Дух Господов, дух на премудрост и разум, дух на совет и крепост, дух на знаење и благочестивост;"},
	{3, "3 ке се исполни со страв Господов, ке суди, не според тоа како што очите Негови гледаат; и ке ги решава делата, не според тоа како што ушите Негови слушаат."},
	{4, "4 Он ке им суди на сиромасите по правда, и делата на страдалците во земјата ке ги решава според вистината; со зборот од устата Своја ке ја порази земјата, со дишењето на устата Своја ке го убие нечесниот."},
	{5, "5 Појас на половината Негова ке биде правдата, а појас на бедрата Негови - вистината."},
	{6, "6 Тогаш волк ке живее со јагне, леопардот ке лежи заедно со јаре; теле, лавче и вол ке бидат заедно, и мало дете ке ги води."},
	{7, "7 Крава ке пасе со мечка, нивните млади ке лежат заедно; лавот ке јаде слама како волот."},
	{8, "8 Новороденче ке игра над змиина дупка, дете ке протега рака кон змиино гнездо."},
	{9, "9 Нема да прават зло и штета по целата Моја света гора, зашто земјата ке биде полна со познавање на Господа, како што водите го полнат морето."},
	{10, "10 Во оној ден кон Јесеевиот корен, кој ке стане како знаме на народите, ке се обрнат незнабошците, мирот негов ке му биде слава."},
	{11, "11 Тогаш Господ пак ке ја крене раката Своја, за да Си го врати остатокот од народот Свој, - она што остана во Асирија, и во Египет, и во Патрос, и во Хус, и во Елам, и во Сенар, и во Емат, и островите морски."},
	{12, "12 И ке крене знаме кон незнабошците и ке ги собере прогонетити Израилци; расеаните Јудејци ке ги повика од четирите земни краишта."},
	{13, "13 Kе се прекрати зависта Ефремова; кои непријателствуваат против Јуда, ке бидат истребени, Ефрем нема да му завидува на Јуда, а Јуда нема да го притеснува Ефрема."},
	{14, "14 И ке полетаат врз плеките на Филистејците кон запад, ке ги ограбат сите деца на Исток; ке стават рака врз Едом и Моав, и децата Амонови ке им бидат поданици."},
	{15, "15 Kе го исуши Господ заливот на Египетското Море, ке ја протегне раката Своја врз реката преку силниот Свој ветар и ке ја разбие на седум ракави, така што со обувки да можат да ги минуваат."},
	{16, "16 Тогаш за остатокот од Неговиот народ, кој ке остане во Асура, ке има широк пат, како што беше тоа за Израилот кога излегуваше од Египетската земја."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct mk12 poems[] = {
	{1, "1 Во оној ден ке речеш: 'Kе Те славам, Господи! Ти ми беше гневен, но го одврати гневот Свој и ме утеши."},
	{2, "2 Ете, Бог е моето спасение; на Него се надевам; и не се плашам; зашто Господ е мојата сила, Господ е мојата песна; Он ми е спасение."},
	{3, "3 Тогаш со радост ке црпите вода од изворите на спасението,"},
	{4, "4 во тој ден ке речете: 'Славете Го Господа, повикувајте Го името Негово; разгласувајте ги ме у народите делата Негови; напомнувајте дека името Негово е големо;"},
	{5, "5 пејте Му на Господа, зашто Он направил нешто големо - нека го знаат тоа по целата земја."},
	{6, "6 Весели се и радувај се, жителко Сионова, зашто, голем е ме у тебе Светецот Израилев.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct mk13 poems[] = {
	{1, "1 Пророштво за Вавилон, што го изрече Исаија, синот Амосов."},
	{2, "2 Кренете знаме на гола планина, издигнете глас, мавнете им со рака да навлезат низ кнезовските порти."},
	{3, "3 Јас им дадов повелба на Моите избраници и ги повикав да го исполнат гневот Мој моите јунаци, кои се радуваат на величието Мое."},
	{4, "4 Голем шум има по планините, како божем од многуброен народ, бунтовен шум на царства и народи, собрани заедно, Господ Саваот ја прегледува готовата војска за војна."},
	{5, "5 Идат од далечна страна, од крајот на небото, Господ и орудијата на Неговиот гнев, за да ја сотрат целата земја."},
	{6, "6 Липајте, зашто денот Господов е близу, - иде како разурнувачка сила од Семокниот."},
	{7, "7 Затоа рацете на сите отпаднаа, срцето на секој човек се стопи."},
	{8, "8 Тие се ужасија, грчеви и болки ги опфатија; се мачат како родилка, зашеметени гледаат едни во други, лицата им пламнаа."},
	{9, "9 Ете, денот Господов доа а лут, со гнев и пламната јарост, за да ја претвори земјата во пустиња и да ги истреби од неа грешниците нејзини."},
	{10, "10 Sвездите небески и светилата нема да даваат од себеси светлина; сонцето се замрачува при изгревањето свое; и месечината не свети со светлината своја."},
	{11, "11 Јас ке го казнам светот за злото, и нечесните - за нивните беззаконија; ке го премавнам високоумството на гордите и ке ја понизам надуеноста на угнетувачите;"},
	{12, "12 ке направам така, што лу ето да бидат поскапи од чисто злато, а мажите - поскапи од офирско злато."},
	{13, "13 Затоа ке го затресам небото, земјата ке се помести од местото свое поради јароста на Господа Саваот, во денот на пламнатиот гнев Негов."},
	{14, "14 Тогаш секој како подгонета срца и како напуштени овци ке се обрне кон народот свој, секој ке избега во земјата своја."},
	{15, "15 На кого ке му се падне, ке биде пронизан; и кого ке го фатат, ке загине од меч."},
	{16, "16 Новороденчињата нивни ке бидат смачкани пред очите нивни; куките нивни ке бидат разграбени, и жените нивни обесчестени."},
	{17, "17 Ете, Јас ке ги кренам против нив Мидјаните, кои не го ценат среброто и не лакомат за злато."},
	{18, "18 Нивни лакови ке ги поразат младите и нема да сожалат ни плод во утроба; очите нивни нема да се смилуваат на децата."},
	{19, "19 И Вавилон, украсот на царствата, гордоста на Халдејците, ке биде соборен од Бога, како Содом и Гомор,"},
	{20, "20 нема да се насели никогаш, во него нема да има жители од род во род; нема Арабиец да го распне шаторот свој, овчари таму со стадата свои нема да пладнуваат."},
	{21, "21 Но во него ке живеат sверови; бувови ке се населат во нивните домови, и бесови ке потскокнуваат и ке играат."},
	{22, "22 Шакали ке вијат во дворците нивни и хиени во домовите за веселба. А ке дојде неговото време, близу е, деновите негови нема да задоцнат.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct mk14 poems[] = {
	{1, "1 'Блиску е времето негово, нема да задоцнат дните негови; зашто Господ ке го помилува Јакова и пак ке го засака Израилот; ке ги насели во земјата нивна, ке се присоединат кон нив ту инци и ке се прилепат кон домот Јаковов."},
	{2, "2 Kе ги земат народите и ке ги одведат на местото нивно; домот Израилев ке ги присвои на земјата Господова како робови и робинки, ке ги земе во плен своите пленители и ке владее над своите угнетувачи."},
	{3, "3 Во оној ден, кога Господ те оттргна од скрбта твоја, од стравот и од тешкото ропство, под кое беше заробен,"},
	{4, "4 ти ке запееш победничка песна против вавилонскиот цар и ке речеш: како исчезна мачителот и прекина тиранијата!"},
	{5, "5 Господ го скрши жезлото на нечесните, скиптарот на владетелите,"},
	{6, "6 кој јаросно ги поразуваше народите со бескрајни удари, гневно владееше над племињата свои со незадржливо прогонување."},
	{7, "7 Целата земја здивна, почива, воскликнува од радост;"},
	{8, "8 и кипарисите се радуваат за тебе и кедрите ливански, велејки: откако заспа ти, никој не доа а да не сече."},
	{9, "9 Пеколот адски се раздвижи заради Тебе, за да Те пречека при Твоето влегување; со Тебе се разбудија сите водачи на земјата; изместувајки ги сите цареви незнабожечки од престолите нивни."},
	{10, "10 Сите тие ке ти говорат: и ти стана безсилен како нас! И ти стана сличен на нас."},
	{11, "11 Гордоста ти е симната во пеколот, со сиот твој шум; под тебе има гнилеж за постилка, а црви се твојата покривка."},
	{12, "12 Како падна ти од небото, Денице, сине на зората! Се разби од земјата ти, кој ги угнетуваше народите."},
	{13, "13 А во срцето свое си велеше: 'Kе се искачам на небото, ке го издигнам престолот свој погоре од Божјите sвезди и ке седнам на гората во соборот на боговите, на крајот од северот;"},
	{14, "14 ке се искачем до висините на облаците, ке бидам сличен на Севишниот."},
	{15, "15 Но ти си соборен во пеколот, во дното на адот."},
	{16, "16 Оние што ке те видат, ке се загледадат во тебе, ке си речат за тебе: тое ли е човекот, што земјата ја разнишуваше и царства потресуваше,"},
	{17, "17 вселенеата во пустиња ја претвори и ги разрушуваше градовите нејзини, робовите не ги пушташе по домовите нивни?"},
	{18, "18 Сите царства на народите, сите почиваат со чест, секој во својата гробница;"},
	{19, "19 а ти си фрлен надвор од гробот како отпадок, како облека на убиени, на погубени со меч, што ги спуштаат во камени гробници, - како изгазен труп,"},
	{20, "20 нема да се соединиш со нив во гробот; зашто ти ја разори земјата своја, го уби народот свој: племето на злодејците засекогаш нема да се спомне."},
	{21, "21 Гответе клање за синовите негови поради беззаконието на таткото нивни, за да не востанат и да не завладеат со земјата и да не ја наполнат вселената со непријатели."},
	{22, "22 'И ке станам против нив, вели Господ Саваот, и ке ги истребам името на Вавилон и целиот остаток - и син, и внук, вели Господ."},
	{23, "23 И ке ги направам ежово владение и кал, ке го изметам со истребувачка метла, вели Господ Саваот."},
	{24, "24 Со клетва вели Господ Саваот: 'Како што намислив, така и ке биде; како што решив, така и ке стане,"},
	{25, "25 за да го погубам Асура во Мојата земја и да го изгонам од Моите гори; ке падне од нив јаремот негов, и товарот ке се симне од рамењата нивни.'"},
	{26, "26 Такво е решението, определено за целата земја, и еве ја раката, протегната врз сите народи;"},
	{27, "27 зашто Господ Саваот решил, и кој може да го измени тоа? Раката Негова е протегната, - и кој ке ја врати?"},
	{28, "28 Во годината, кога умре царот Ахаз, имаше вакво пророчко слово:"},
	{29, "29 ‘Немој да се радуваш, земјо Филистејска, дека е скршен жезалот, кој те поразуваше, зашто од змискиот корен ке излезе отровница и плодот нејзин ке биде змеј што лета."},
	{30, "30 Тогаш најбедните ке бидат нахранети, немокните ке си почиваат во безопасност; а твојот корен со глад ке го уморам, и тоа ке го убие твојот остаток."},
	{31, "31 Ридајте, порти, викај граде, на глас! Kе се раздробиш ти, цела земјо Филистејска; зашто од север иде дим, нема изморен во нивните војски."},
	{32, "32 А што ке соопштат известувачите народни? - Тоа дека Господ го утврдил Сион, и дека во него ке најдат засолниште сиромасите од народот Негов."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct mk15 poems[] = {
	{1, "1 Пророштвото за Моав. Така! Ноке ке биде разорен Ар - Моав и уништен; така! Ноке ке биде разорен Кир - Моав и уништен!"},
	{2, "2 Тој се искачува во храмот девонски за да плаче на височина; Моав липа над Невон и Медев; сите тие се со истрижени глави, сите со избричени бради."},
	{3, "3 По улиците негови се препашуваат со врекишта; по покривите негови и плоштадите сите плачат, во солзи тонат."},
	{4, "4 Пишти Есевон и Елеала; гласот нивни се слуша дури до Јаца; по нив и војниците на Моав плачат, душата му се бранува во него."},
	{5, "5 Плаче моето срце за Моав; бегаат од него кон Сигор, до третата Егла; се искачуваат со плачење на Лухит; по хоронаимскиот пат креваат страшен вик;"},
	{6, "6 зашто водите на Нимрим пресекнаа, ливадите се исушија, тревата изгоре, зеленило не остана;"},
	{7, "7 затоа тие го пренесуваат од онаа страна на Арабиската река остатоците од имотот и она, што го собрале."},
	{8, "8 Оти писокот се разнесува по сите предели на Моав, плачот негов стигнува дури до Еглаим, плачот негов стигнува до Беер - Елим;"},
	{9, "9 бидејки водите на Димон се наполнија со крв, и Јас ке испратам врз Димон уште нешто ново, - лавови врз избеганите од Моав и против другите во земјата."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct mk16 poems[] = {
	{1, "1 Испракајте јагниња за владетелот на земјата, испракајте од Села во пустињата кон планинатана керката Сионова;"},
	{2, "2 зашто керките на Моав при Арнонските бродови ке бидат слични на птица скитница, исфрлена од гнездото."},
	{3, "3 'Свикајте совет, донеси решение; засенчи не со сенката своја среде пладне како ноке, прикриј ги истераните, не ги предавај скитниците."},
	{4, "4 Нека поживеат кај тебе моите истерани Моавци; биди им закрила од грабачи: зашто угнетувачот - нема да го пуштам; грабежот ке престане, потисниците ке исчезнат од земјата."},
	{5, "5 И престолот ке се утврди со милост, и на него ке седне со верност, во Давидовиот шатор, судија, кој бара правда и се стреми кон правосудие.'"},
	{6, "6 'Сме слушале за Господа на Моав, прекумерна гордост, за неговата надуеност и високомерност и за неговото беснеење: неискрен е зборот негов.'"},
	{7, "7 Затоа Моав ке заплаче за Моав, - сите ке плачат: ридиштата за тврдините за Крихарешет: тие се наполно разурнати."},
	{8, "8 Есевонските полиња се исушија, како и севаимското лозје; големците на народите ги истребија најдобрите лозја, кои достигнаа до Језер, се простираа по пустињата; ластарите се ширеа, преминуваат од онаа страна на морето."},
	{9, "9 Поради тоа јас ке плачам за лозјата севаимски со плачот на Јазера, ке ги облевам со солзите свои, Есевоне, и Елеало; зашто по твојот гроздобер и по твојата жетва нема повеке шумна радост."},
	{10, "10 Исчезна од плодоносната земја радоста и веселбата, по лозјата не пеат ниту се радуваат; лозарот не гмечи грозје во садови: Јас ги прекратив веселбите."},
	{11, "11 Затоа мојата внатрешност стенка по Моав како гусле, а срцето мое за Кирхарешет."},
	{12, "12 Но и да се јави Моав и до умор да оди по идолските светилишта, и да дојде при светилиштето свое, да се моли, пак ништо нема да му помогне."},
	{13, "13 Тоа е словото, кое Господ одамна го беше искажал за Моава."},
	{14, "14 А сега вака вели Господ: 'По три години, сметајки наемнички години, величието на Моав ке биде понизено со сето големо множество негово, а остатокот ке биде многу мал и незначаен.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct mk17 poems[] = {
	{1, "1 Пророштворо за Дамаск - ете, Дамаск се исклучува од бројот на градовите и ке биде куп од урнатини."},
	{2, "2 Градовите Ароирски ке бидат напуштени, - ке останат за стадата, што ке си почиваат таму и нема да има кој да ги плаши."},
	{3, "3 Неме да има повеке Ефремова тврдина, ни дамаско царство и остатокот од Сирија; со нив ке стане исто, што стана со славата на синовите Израилеви, вели Господ Саваот."},
	{4, "4 Во оној ден ке се намали славата на Јакова, и полното тело негово ке ослабне."},
	{5, "5 Исто онака ке биде по собраното живо од жетварот, кога раката негова ке ги ожнее класовите и кога ке ги соберат класовите во Рефаимската долина."},
	{6, "6 И ке останат во него, како што станува при тресење маслинки, две - три зрна да остана на самиот врв или четири - пет на плодните гранки, вели Господ, Бог Израилев."},
	{7, "7 Во оној ден ке го сврти човек погледот свој кон својот Создател, очите негови ке бидат управени кон Светецот Израилев;"},
	{8, "8 и нема да сврти очи кон жртвениците, дело на рацете свои; нема да го погледне она што го направиле прстите негови, идолите на Астарта и Ваал."},
	{9, "9 Во оној ден утврдените негови градови ке бидат како урнатини во гори и по планински врвови, оставени пред синовите Израилеви и се ке биде пусто."},
	{10, "10 Зашто ти Го заборави Бога на твоето спасение, не се секаваше на карпата на твоето засолниште; затоа ти си уредил градини за веселби и си насадил прачки во ту и лозја."},
	{11, "11 Во денот, кога садеше, ти се грижеше насаденото да расте, и посеаното од тебе да цути; но во денот кога ке собираш, ке нема куп жетва, туку голема жалост."},
	{12, "12 О, шум од многу народи! Шумат тие како што шуми морето. Викање на племиња! Викаат тие како што рикаат бујните води."},
	{13, "13 Викаат народите како што рикаат бујните води; но Он ги заплаши, - и тие избегаа далеку; беа разгонети како плева по планините од ветар и како прав од виор."},
	{14, "14 Вечерта - и ете ти ужас, но пред утрото веке го нема. Таков е делот на нашите грабачи, жребот за нашите разрушители."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct mk18 poems[] = {
	{1, "1 Тешко и е на земјата, која се осенчува со криља од онаа страна на етиопските реки,"},
	{2, "2 која испрака гласници по море и рогозени чунови по водите! Одете, брзи гласници, при народ јак и бодар, при народ страшен од почетокот до денес, при народ здрав и кој се победува, чија земја реки ја пресечуваат."},
	{3, "3 Сите вие, што ја населувате вселената и живеете на земјата, гледајте кога ке се крене знаме на планините, кога ке затруби трубата!"},
	{4, "4 Зашто, така ми рече Господ: Јас гледам спокојно од Своето живеалиште, како светла жега - по дожд, како облак роса - при жетвен припек."},
	{5, "5 Зашто пред гроздобер, кога грозјето ке прецути, и гроздот ке почне да узрева, Он ке ги исече со сорче прачките и ке ги одземе, и ке ги искастри фиданките."},
	{6, "6 Kе стават се на грабливите планински птици и на полските sверови: и птици ке летаат таму, а полските sверови таму ке зимуваат."},
	{7, "7 Во она време ке биде принесен дар на Господа Саваот од народ јак и бодар, од народ страшен од почетокот до денес, од народ здрав што гази друг народ, чија земја реки ја пресечуваат, - кај местото, каде што е името на Господа Саваот врз гората Сион."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct mk19 poems[] = {
	{1, "1 Пророштвото за Египет. Ете, Господ ке седне на лесен облак и ке дојде во Египет. И пред лицето Негово ке затреперат идолите египетски, а срцето на Египет ке се стопи во него."},
	{2, "2 Kе вооружам Египтјани против Египтјани, - и ке се бијат брат против брат и пријател против пријател, град со град, царство со царство."},
	{3, "3 Духот на Египет ке изнемошти во него, ке ги разруши намерите негови, - и ке прибегнат тие кон идоли и ма есници, кон оние што повикуваат мртовци и кон бајачи."},
	{4, "4 Kе ги предадам Египтјаните во рацете на жесток владетел, свиреп цар ке владее над нив, - вели Господ, Господ Саваот."},
	{5, "5 И водите во морето ке исчезнат, реката ке секне и ке пресуши;"},
	{6, "6 реките ке намалат, каналите египетски ке станам малуводни и ке се исушат; рогозината и трската ке овенат."},
	{7, "7 Нивите крај реката, по бреговите на реката, и се што е посеано крај реката - ке се исуши, ке биде развеано и ке исчезне."},
	{8, "8 И ке заплачат рибари, ке викаат сите што фрлаат јадици во реката, што поставуваат мрежа во водата, сите ке бидат очаени;"},
	{9, "9 ке се вознемират оние, што обработуваат лен и што ткаат бели платна;"},
	{10, "10 мрежите ке бидат скинати, и сите што држат рибници за жива риба - ке паднат со духот."},
	{11, "11 Да! Се избезумија кнезовите танесови; советот на мудрите фараонови советници стана безумен. Како ке му кажете на Фараонот: 'Јас сум син на мудреците, син на древните цареви?'"},
	{12, "12 Каде се тие? Каде се твоите мудреци? Нека ти кажат тие сега; нека дознаат што определил Господ Саваот за Египет?"},
	{13, "13 Се избезумија кнезовите танесови; се измамија кнезовите мемфиски, го свртија Египет од патот на водачите на неговите племиња."},
	{14, "14 Господ спроведе во него зашеметен дух, - го доведоа Египет во заблуда во сите негови дела, како пијан кога поврака."},
	{15, "15 И нема да има во Египет такво дело, кое би можеле да го извршат главата и опашката, палмата и трската."},
	{16, "16 Во овој ден Египтјаните ке бидат како жени; ке затреперат и ке се уплашат од движење на раката на Господа Саваот, што Он ке ја крене против нив."},
	{17, "17 Земјата Јудина ке стане ужас за Египет, кој се секава не неа, тој ке затрепери од решението на Господа Саваот, што го определил Он за него."},
	{18, "18 Во оној ден пет града во Египетската земја ке говорат на ханански јазик, и ке се колнат во Господа Саваот; едниот ке се нарече град на сонцето."},
	{19, "19 Во оној ден ке има жртвеник на Господа среде Египетската земја и споменик на Господа - во нејзините предели."},
	{20, "20 Тој ке биде знак и сведоштво за Господа Саваот во Египетската земја, зашто тие ке викаат кон Господа од потисниците, и Он ке им донесе спасител и застапник, и ке ги спаси."},
	{21, "21 И Господ сам ке се јави во Египет; во тој ден Египтјаните ке Го познаат Господа и ке принесат жртви и дарови, ке Му дадат верувања на Господа и ке ги исполнат."},
	{22, "22 И ке го порази Господ Египет - ке го порази и ке го исцели: тие ке се обрнат кон Господа - и Он ке ги чуе и ке ги исцели."},
	{23, "23 Во тој ден ке има широк пат од Египет до Асирија; и Асур ке доа а во Египет и Египтјани во Асирија; и Египтјани заедно со Асиријците ке Му служат на Господа."},
	{24, "24 Во оној ден Израилот ке биде трет со Египет и со Асирија; благослов ке има на земјата,"},
	{25, "25 која Господ Саваот ке ја благослови, велејки: 'Благословен да е Мојот народ - Египтјаните делото на рацете Мои - Асиријците, и наследството Мое - Израилот."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct mk20 poems[] = {
	{1, "1 Во годината, кога Тартан дојде во Азот, бидејки беше пратен од асирскиот цар Саргон и војуваше против Азот и го презеде, -"},
	{2, "2 во исто тоа време Господ Му кажа на Исаија, Амасовиот син, вака: 'Оди и симни го врекиштето од бедрата свои и собуј ги обувките од нозете свои.' Така и направи: одеше гол и бос."},
	{3, "3 Тогаш рече Господ: 'Како што слугата Мој Исаија оди гол и бос три години, како знак и означување кон Египет и Етиопија, -"},
	{4, "4 така асирскиот цар ке поведе заробеници од Етиопија, млади и стари, голи и боси и со разголени бедра, за срам на Египет."},
	{5, "5 Тогаш ке се вxашат и засрамат поради Етиопја, нивната надеж, и поради Египет, со кој се фалеа."},
	{6, "6 И во тој ден жителите ке речат за онаа земја: 'Ете какви биле оние, на кои се надевавме и при кој прибегнавме за помош, за да се спасиме од асирскиот цар! И како сакавме да се спасиме?'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct mk21 poems[] = {
	{1, "1 Пророштво за крајморската пустиња. - Како што бурите се носат во јужната страна, така доа а тоа од пустињата, од страшната земја."},
	{2, "2 Страшна глетка ми беше покажата: грабач граби, опустошител опустошува; оди Еламе, опседни Мидијо: на сите воздишки ке им ставам крај."},
	{3, "3 Од тоа бедрата ми треперат; маки ме обзедоа, како маки на родилка. Возбуден сум од тоа што слушам; вознемирен сум од ова што го гледам."},
	{4, "4 Срцето ми трепери: морници ме обземаат; радосната моја нок стана ужас за мене."},
	{5, "5 Готват трпеза, постилаат покривки, јадат, пијат. 'Станувајте, кнезови, намачкајте ги штитовите!'"},
	{6, "6 Зашто вака ми рече Господ: 'Оди, одреди пазач; нека го јавува тој, она што го гледа."},
	{7, "7 И виде тој, дека доа аат по двајца јавачи на коњи, јавачи на осли, јавачи на камили; и претпазливо тој слушаше, со големо внимание, -"},
	{8, "8 и почна да вика тој како лав: господаре мој: стоев на стража цел цен и на местото свое останував по цели ноки:"},
	{9, "9 и ете, доа аат лу е, јавачи на коњи по двајца. Потоа извика и рече: падна, падна Вавилон, и сите идоли на боговите негови лежат скршени на земјата."},
	{10, "10 О, овршено жито на гумното мое! Она што го чув од Господа Саваот, Бога Израилев, тоа и ви го соопштив."},
	{11, "11 Пророштвото за Едом. - Ми викаат од Сеир: 'Стражару, кое време е во нокта? Пазачу, кое време е ноква?'"},
	{12, "12 Чуварот рече: 'Наближува утрото, но и нокта. Ако упорно прашувате - прашувајте; свртете се и дојдете."},
	{13, "13 Пророштво за Арабија. - Во гората арабиска нокевајте, каравани дедански."},
	{14, "14 Жители на Темајската земја, носете вода да ги пречекате жедните; со леб пречекајте ги бегалците;"},
	{15, "15 зашто тие бегаат од мечот, од гол меч, од затегнат лак и од жестокоста на војната.'"},
	{16, "16 Оти вака ми рече Господ: 'Уште една година, еднаква на наемничката година, - и сета слава на Кидар ке исчезне,"},
	{17, "17 кај храбрите синови на Кидар ке останат не многу лакови,' така вели Господ, Бог Израилев."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct mk22 poems[] = {
	{1, "1 Пророштвото за долината на видението. - Што ти е, та цел си се искачил на покрив?"},
	{2, "2 Шуми граде, кој се брануваш, граде, што ликуваш! Твоите убиени не се убиени од меч, ниту умреле во борба;"},
	{3, "3 сите твои водачи бегаа заедно, но беа врзани од стрелците; сите што се најдени кај тебе врзани се заедно, колку и да бегаа далеку."},
	{4, "4 Затоа велам: оставете ме, горко ке плачам; не трудете се да ме утешувате, поради погибелта на керката од мојот народ."},
	{5, "5 Зашто е ден на вознемиреност, угнетување и збрка во долината на видението од Господа, Бог Саваот. Се соборуваат sидови, викањето стигнува до планината."},
	{6, "6 И Елам зеде јанxик: луке со коли, и јавачи."},
	{7, "7 И ете, најдобрите твои долини се полни со коли бојни, јавачите се наредија спроти портите,"},
	{8, "8 па го симнуваат покривалото од Јудеја; и ти во тој ден ке погледнаш кон избраните домови во градот."},
	{9, "9 Гледајте, дека има многу пукнатини во sидиштата на Давидовиот град, па собравте вода во долниот рибник;"},
	{10, "10 и се разрушија куките ерусалимски, за да се зацврстат sидините градски;"},
	{11, "11 направивте ме у двата sида собиралиште за вода од старото езеро. А на Оној, Кој го направи тоа, не погледнавте, и не Го гледавте Оној, Кој одамна го одреди тоа."},
	{12, "12 Господ, Господ Саваот ве викаше на тој ден да плачете и да тагувате, да се истрижете и да се опашете во врекиште."},
	{13, "13 Но, ете, веселба и радост! Убиваат волови и колат овни; јадат месо, пијат вино и велат: 'Да јадеме и да пиеме, зашто утре ке умреме!'"},
	{14, "14 И ми откри во ушите Господ Саваот: 'Нема да ви биде простена таа нечесност, додека не умрете,' рече Господ, Господ Саваот."},
	{15, "15 Вака рече Господ, Господ Саваот: 'Тргни, оди кај оној царедворец, при Севна, началникот на дворецот, и кажи му:"},
	{16, "16 што имаш и кого имаш тука, па си правиш тука гробница? Тој си прави за себе гробница на височината, си прави живеалиште во карпата."},
	{17, "17 Ете, Господ ке те фрли далеку, како што фрла силен човек и ке те свитка како клопче,"},
	{18, "18 откако ке те свитка во свиок, ке те фрли во широка земја; таму ке умреш ти, таму твоите прекрастни коли ке бидат за подбивање во домот на твојот господар.'"},
	{19, "19 Kе те турнат од твоето место и ке те симнат од твоето достоинство."},
	{20, "20 И во тој ден ке го повикам мојот слуга Елијаким, Хелкиевиот син,"},
	{21, "21 ке го облечам со твојата облека и со твојот појас ке го препашам, та и власта твоја ке ја предадам во рацете негови; и тој ке биде отец на жителите ерусалимски и за домот Јудин."},
	{22, "22 И клучот на Давидовиот дом ке го ставам на рамењата негови; тој ке отвори, и никој нема да затвори; тој ке затвори и никој нема да отвори."},
	{23, "23 И ке го зацврстувам како клин на цврсто место, тој ке биде како славно седиште за домот на татка си."},
	{24, "24 И на него ке виси целата слава на татковиот му дом, на децата и внуците, на целата покукнина до последната свирка."},
	{25, "25 Во тој ден, вели Господ Саваот, ке се заниша зацврстениот на цврсто место клин, ке биде изваден и ке падне, ке се испокрши се, што виси на него, зашто Господ вели."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view23() {
struct mk23 poems[] = {
	{1, "1 Пророштвото за Тир. - Плачете тарсиски кораби, зашто тој е разрушен: нема куки и нема кој да влегува во куките. Тоа им беше соопштено од земјата Китијска."},
	{2, "2 Молкнете жители на островот, што го полнеа сидонските трговци, пловејки по море."},
	{3, "3 По големи води се пренесуваат во него житата на Сихор, жетвата на големата река; тој беше пазариште на народите."},
	{4, "4 Засрами се, Сидоне: зашто, еве што вели морето, морската тврдина: како да не сум се мачела со родилни маки и да не сум ра ала, како да не сум одгледувала момци, ниту израснувала моми."},
	{5, "5 Кога ке стигне веста до Египјаните, тие ке затреперат што ке чујат за Тир."},
	{6, "6 Преселувајте се во Тарсис, плачете, жители на островот!"},
	{7, "7 Тоа ли е вашиот град кој ликува, чиј почеток е од древните дни? Нозете негови го носат, да се скита далеку во ту ина."},
	{8, "8 Кој го одреди тоа за Тир, што раздаваше венци, чии купувачи беа кнезови, а трговците негови - најпрочуени во земјата?"},
	{9, "9 Господ Саваот го одреди тоа, за да посрами секоја горда слава, за да ги понизи сите најпрочуени во земјата."},
	{10, "10 Оди по земјата своја, тарсиска керко, како реката: нема повеке пречки."},
	{11, "11 Он ја протегна раката врз морето, затресе царства; Господ додаде повелба за Ханан - да ги разруши тврдините негови,"},
	{12, "12 и рече: 'Нема повеке да ликуваш, посрамена девице, керко Сидонска, оди во Китин, но и таму нема да имаш мир."},
	{13, "13 Ете ја земјата на Халдејците. Тој народ постојано го немаше; Асур му стави почеток од пустински жители. Тие ги издигаа кулите свои, ги соборуваат дворците негови, го претвораат во урнатини."},
	{14, "14 Плачете, кораби тарсиски, зашто вашата тврдина е разрушена."},
	{15, "15 И во тој ден ке го заборават Тир за седумдесет години, колку се деновите на еден цар. А по седумдесет години ке се пее за Тир, како што се пее за блудница:"},
	{16, "16 'Земи гитара, тргни по градот, блуднице заборавена! Свири убави, пеј многу песни за да се секаваат на тебе.'"},
	{17, "17 И ете, по седумдесет години Господ ке го посети Тир; и тој пак ке земе да ја добива печалбата своја и ке блудствува со сите земни царства по целата вселена."},
	{18, "18 Но трговијата негова и печалбата му ке бидат посветувани на Господа; нема да бидат затворени и натрупани во клетви, зашто печалбата од трговијата негова ке преминува на оние што живеат пред лицето на Господа, за да јадат до наситување и да имаат трајни облеки."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view24() {
struct mk24 poems[] = {
	{1, "1 Ете, Господ ја опустошува земјата и ја прави неплодна; го изменува нејзиниот вид и ги распрснува оние што живеат на неа."},
	{2, "2 Со свештеникот ке стане исто што и со народот, - со слугата, - исто што и со господарот негов; со слугинката, исто што - и со господарката нејзина; со купувачот, исто што и со продавачот; она што ке стане со оној, кој ке земе на заем, исто што, и со оној кој дава на заем; со оној, кој дава со интерес - исто и со оној кој зема под интерес."},
	{3, "3 Земјата е опустошена до крај и сосема разграбена, зашто Господ го изрече тоа слово."},
	{4, "4 Тагува, нажалена е земјата; опаднала, тажна е вселената; опаднале оние, што се издигале над народот на земјата."},
	{5, "5 И земјата е осквернета под жителите свои, зашто тие ги прекршија законите, го изменија уставот, го нарушија вечниот завет."},
	{6, "6 Затоа проклетство ја јаде земјата, а жителите нејзини трпат казна; затоа се изгорени престојувалиштата земни, малку лу е останаа."},
	{7, "7 Плаче гроздовиот сок; боледува лозата; воздивнуваат сите што се веселеа од срце."},
	{8, "8 Престана веселбата со тимпани; молкна вреваат на оние што се веселеа; стивнаа звуците на гуслите;"},
	{9, "9 не пијат повеке вино со песни; горчлив е сикерот за оние што го пијат,"},
	{10, "10 Разорен е запустениот град; сите куки се затворени, не може да се влезе."},
	{11, "11 Плачат за вино по улиците; потемне секаква радост; изгонета е секаква веселба од земјата."},
	{12, "12 Во градот остана само пустош, портите се искршени."},
	{13, "13 А среде земјата, ме у народите, ке биде истото, што станува кога маслинки тресат или пабирки од гроздобер."},
	{14, "14 Тие ке го кренат гласот свој, ке ликуваат во величието на Господа, силно ке воскликнуваат од морето."},
	{15, "15 И така, славете го Господа на исток, по островите морски - славете Го името името на Господа, Бога Израилев."},
	{16, "16 Од крајот на земјата слушаме песна: 'Слава на Праведниот!' И реков јас: 'Тешко мене, тешко мене! Злодејци зло вршат, на зол начин дејствуваат злодејците."},
	{17, "17 Ужас, јама и стапица за тебе, жителе земни!'"},
	{18, "18 Тогаш, оној што избега од викот на ужасот, ке падне во јама; и кој ке излезе од јамата, ке падне во стапица; зашто прозорците од небесната височина ке се отворат, и основите земни ке се разнишаат."},
	{19, "19 Замјата се разрушува, земјата се распа а, земјата е силно разнишана;"},
	{20, "20 земјата се ниша како пијан и се лула како лулка, и беззаконието и теже врз неа; таа ке падне - и повеке нема да стане."},
	{21, "21 И во тој ден Господ ке ја посети војската на висините, ке ги посети и земните цареви на земјата."},
	{22, "22 И ке бидат собрани наедно како затвореници во затвор, и ке бидат заклучени во темница и по многу денови ке бидат казнети."},
	{23, "23 Тогаш месечината ке поцрвени, и сонцето ке се засрами, кога Господ Саваот ке се зацари на гората Сион и во Ерусалим, и пред неговиот старешини ке стане слава."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view25() {
struct mk25 poems[] = {
	{1, "1 Господи, Ти си Бог мој; ке Ти возвеличам, ке го восфалам името Твое, зашто си извршил премудри дела; определени во старо време и вистинити. Амин."},
	{2, "2 Ти го претвори градот во грамада од камења, цврстата тврдина - во урнатини; нема повеке во градот дворци на другоплеменици; никогаш нема да биде востановен."},
	{3, "3 Затоа ке Те прославуваат силните народи; градовите на страшните племиња ке се плашат од Тебе;"},
	{4, "4 оти Ти беше прибежиште на сиромавиот, прибежиште на немокниот во тешко време за него, заштита од бура, сенка од припек; зашто гневното дишење на насилниците прилегаше на бура против карпа."},
	{5, "5 Ти го скроти бујствувањето на непријателите, како припек - во безводно место; веселбата на угнетувачите е задушена, како припек - сенка од облак."},
	{6, "6 И Господ Саваот ке стави врз таа планина за сите народи трпеза со добри јадења, трпеза со чисти вина, со богати јадења од коски и најчисти вина;"},
	{7, "7 врз таа планина ке ја уништи покривката, што ги покрива сите народи, покривка, која лежи врз сите племиња."},
	{8, "8 Смртта ке биде проголтана за секогаш, ке ги избрише Господ Бог солзите од сите лица, и ке го симне срамот од Својот народ во целата земја, зашто така вели Господ."},
	{9, "9 И ке речат во тој ден: 'Еве, Он е нашиот Бог! На Него се надевавме, и Он не спаси! Он е Господ; Него Го чекавме; да се возрадуваме и развеселиме за спасението од Него!"},
	{10, "10 Оти раката на Господа ке почива врз таа планина, и Моав ке биде прегазен на местото свое, како што се гази слама на буниште.'"},
	{11, "11 И макар што ги размавна среде него рацете Свои, како што ги размавнува оној што плива, но Бог ке ја понизи гордоста негова заедно со лукавството на рацете негови."},
	{12, "12 И ке ја собори, ке ја разруши тврдината со твоите високи sидишта, ке ја кутне на земја, во прав."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view26() {
struct mk26 poems[] = {
	{1, "1 Во тој ден ке биде испеана во земјата Јудина оваа песна: 'Градот ни е јак, место sидини и опкопи Бог ни даде спасение."},
	{2, "2 Отворете ги портите; нека влезе праведниот народ, кој ја пази вистината."},
	{3, "3 Цврстиот по дух Ти го пазиш во совршен мир, зашто на Тебе се надева."},
	{4, "4 Недевајте се на Господа за секогаш, зашто Господ Бог е вечна тврдина;"},
	{5, "5 Он ги собори оние, што живееја на високо; - градот, што стоеше виско го собори, го кутна на земја, го фрли во прав."},
	{6, "6 Нога го гази, нозете на сиромавиот, стапките на бедните."},
	{7, "7 Патот на праведниот е прав; Ти ја израмнуваш неговата патека."},
	{8, "8 На патот на Твоите судови, Господи, ние на Тебе се надеваме; душата наша се стремеше кон Твоето име и кон споменот за Тебе."},
	{9, "9 Со душата своја се стремевме кон Тебе ноке, и со духот свој ке Те бараме во внатрешноста своја од рани зори; зашто, кога Твоите пресуди се извршуваат на земјата, тогаш жителите на светот се учат на правда."},
	{10, "10 Ако нечесен биде помилуван, тој нема да се научи на правда, - ке злодејствува во земјата на праведните и нема да погледне на величието Господово."},
	{11, "11 Господи! Раката Твоја беше високо крената, но тие не ја видоа; ке видат и ке се посрамат оние, што го мразат Твојот народ; оган ке ги голтне Твоите непријатели."},
	{12, "12 Господи! Ти ни даруваш мир, зашто и сите наши дела Ти ги уредуваш за нас."},
	{13, "13 Господи, Боже наш! Други господари, освен Тебе, владееле над нас; но само преку Тебе ние го славиме Твоето име."},
	{14, "14 Мртвите нема да оживеат; нивните сенки нема да станат, зашто Ти ги посети и истреби, го уништи секој спомен за нив."},
	{15, "15 Ти го намножи народот, Господи, го намножи народот. - Се прослави Себе Си, ги рашири сите земни граници."},
	{16, "16 Господи, бидејки во беда, тие Те бараа; изливаа тивки молитви, кога ги стигнуваше Твојата казна."},
	{17, "17 Како непразна жена, кога ке се ра а, се мачи, вика од болки, така бевме ние пред Тебе, Господи."},
	{18, "18 Бевме непразни, се мачевме, - и како да ра авме ветар; спасение не и достививме на земјата, и други жители во вселената не се појавија."},
	{19, "19 Твоите мртовци ке оживеат, мртвите тела ке воскреснат! Разбудете се и ликувајте вие, соборените во прав; зашто Твојата роса е роса на растенијата, и земјата ке ги исфрли мртовците."},
	{20, "20 Ајде народе Мој, влези во покоите свои и затвори ги зад себе вратите свои, сокри се за миг, додека да мине гневот;"},
	{21, "21 зашто, ете, Господ излегува од Своето живеалиште да ги казни жителите земни за нивното беззаконие, и земјата ке ја открие голтнатата од неа крв и повеке нема да ги крие своите убиени.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view27() {
struct mk27 poems[] = {
	{1, "1 Во тој ден Господ ке го порази со Својот тежок, со Својот голем и јак меч левијатанот - змејот што лета, а левијатанот - лукавиот змеј и ке го убие морското чудовиште."},
	{2, "2 'Во тој ден запејте за Него - за саканото лозје.'"},
	{3, "3 Јас, Господ, сум негов чувар, во секој миг го напојувам; ноке и дење го вардам, за да не влезе некој во него."},
	{4, "4 Гнев нема во Мене. Но ако некој Ми покаже во него трње и боцки, ке кренам против него војна, ке го изгорам сосема, -"},
	{5, "5 освен, ако пребегне кон заштитата Моја и склучи мир со Мене. Тогаш нека склучи мир со Мене."},
	{6, "6 Во идните дни Јаков ке се вкорени; Израил ке пушти гранки и ке расцути; и вселената ке се исполни со плодови."},
	{7, "7 Така ли го поразуваше Он, како што ги поразуваше оние, кои него го поразуваа? Така ли ги убиваше, како што се убивани оние, кои него го убиваа?"},
	{8, "8 Со мерка го казнуваше Ти, кога го отфрлаше; исфрли го со силниот Свој здив, како во ден на источен ветар."},
	{9, "9 И преку тоа ке се избрише беззаконието на Јакова; а плод од тоа ке биде: ке се симне гравот од него, кога сите камења од жртвениците ке ги претвори во грутка вар, нема повеке да стрчат млади шуми и идоли на сонцето."},
	{10, "10 Затоа утврдениот град ке запустее, живеалиштата ке бидат напуштени и зафрлени како пустиња. Таму ке пасе теленце, таму ке лежи и ке ги подјадува гранчињата негови."},
	{11, "11 Кога гранките ке му се исушат, ке ги искршат; ке дојдат жени и ке ги изгорат. Бидејки тој народ е неразумен, Творецот негов нема да го сожали, Создателот нема да го помилува."},
	{12, "12 Но во тој ден Господ ке растресе се од големата река до потокот Египетски, а вие, синовите Израилеви, ке бидете собрани еден до друг;"},
	{13, "13 во тој ден ке затруби голема труба, и ке дојдат оние што се загубиле во Асирската земја и прокудените во Египетската земја и ке Му се поклонат на Господа на светата гора во Ерусалим."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view28() {
struct mk28 poems[] = {
	{1, "1 Тешко му на венецот, со кој се гордеат пијаниците Ефремови! Тешко му на свенатото цвеке - негов гиздав украс - цвеке среде на убрената долина на замаените од вино!"},
	{2, "2 Ете, јакиот и силниот во Господа како пороен дожд со град, како погубна луња, како разлеана поплава од бурни води, со рака ке ги обори сите на земја."},
	{3, "3 Со нозе се гази венецот, со кој се гордеат Ефремовци."},
	{4, "4 И со свенатото цвеке - неговиот гиздав украс - цвеке среде на убрената долина, станува истото, како што станува со смоквата, рано узреана: штом некој ке ја види, веднаш ја зема в рака и ја каснува."},
	{5, "5 Во тој ден Господ Саваот ке биде убав венец и славна круна за остатокот од Својот народ."},
	{6, "6 Дух на правосудие за оној што седи во судот и машкот за оние, кои го отфрлуваат непријателот до портите."},
	{7, "7 Но и тие се нишаат од виното и го збркуваат патот свој од сикер: свештеник и пророк се препнуваат од силни пијалоци; победени се од вино, избезумени од сикер, во гледањето се збркуваат во судењето се сопнуваат."},
	{8, "8 Зашто сите трпези се полни со одвратни повракања, нема чисто место."},
	{9, "9 А велат: 'Кого сака тој да учи на знаење, и кога да вразумува со проповед? Дали деца, кои се одбиени од градно млеко, одделени од мајчините гради?"},
	{10, "10 Зашто се е заповед врз заповед, заповед врз заповед, правило врз правило, правило врз правило, тука малку и таму малку.'"},
	{11, "11 Оти со неразбирлив говор и на ту јазик ке му зборуваат на тој народ."},
	{12, "12 Им говореа: 'Еве одмор, дајте му одмор на изморениот, и ете му одмор.' Но тие не сакаа да слушаат."},
	{13, "13 И стана во нив според словото Господово: заповед врз заповед, заповед врз заповед, правило врз правило, правило врз правило, тука малку, таму малку, - така што тие ке отидат, ке паднат ничкум и ке се разбијат, ке паднат во стапица и ке бидат уловени."},
	{14, "14 И така, слушајте го словото Господово, хулители, управници на овој народ, кој е во Ерусалим."},
	{15, "15 Бидејки говорите: 'Сме склучиле сојуз со смртта и со пеколот сме направиле договор: кога ке минува камшикот, кој поразува се, тој нема да дојде до нас, оти лагата ја направивме наше засолниште и со измама ке се прикриеме', -"},
	{16, "16 затоа вака вели Господ Бог: 'Ете, Јас полагам во основата на Сион камен, - камен испитан, аголен, скапоцен, темелен: кој верува во него, нема да се посрами."},
	{17, "17 Kе поставам суд за мерило и теразија за правдата; градот ке го истреби засолништето на лагата, и води ке го потопат местото на заклонот."},
	{18, "18 И сојузот ваш со смртта ке биде уништен, договорот ваш со пеколот нема да остане. Кога ке мине камшикот, кој поразува се, вие ке бидете згазени."},
	{19, "19 Штом ке мине тој, ке ве фати; а тој ке оди секое утро, дење и ноке и само слухот за него ке предизвикува ужас.'"},
	{20, "20 Многу кратка ке биде постелката, за да се протега; многу тесна и покривката, за да се завитка со неа."},
	{21, "21 Зашто Господ ке се крене, како на гората Ферасим; ке се разгневи, како во Гаваонската долина, за да го изврши делото Свое, необично дело, и да ја заврши работата Своја, Своја чудна работа."},
	{22, "22 И така, не потсмевајте се, за да не станат оковите ваши поцврсти; зашто јас чув од Господа, Бога Саваот, дека е одредено истребување за целата земја."},
	{23, "23 Приклонете го увото и полушајте го гласот мој; бидете внимателни, ислушајте ја речта моја."},
	{24, "24 Земјоделецот секогаш ли ора, за да посее, секогаш ли ора бразди и ја израмнува земјата своја?"},
	{25, "25 Не, откако ке и го израмни лицето, тој сее граор, распрскува ким или фрла пченица, на редови и јачмен во определеното место, а најпосле ‘рж по сртовите."},
	{26, "26 И на таков ред го учи неговиот Бог; Он го упатува."},
	{27, "27 Зашто не вршат граор со чукање, ниту тркалата што вршат го газат кимот; туку со стап го чукаат граорот, и со стап го чукаат и кимот."},
	{28, "28 Житото го вршат, но не го дробат; пуштаат преку него вршечки колца со коњи, но не го смачкуваат."},
	{29, "29 И тоа станува од Господа Саваот: чудни се неговите судови, голема е Неговата премудрост!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view29() {
struct mk29 poems[] = {
	{1, "1 Тешко му на Арил, на градот Арил, каде што живееше Давид! Притурете година врз година; нека колат жртви."},
	{2, "2 Но Јас ке го притеснам Арил; и ке има плач и тагување; тој ке остане при Мене како Арил."},
	{3, "3 Kе се сместам на логорување околу тебе и ке те стаснам со набљудувачка стража, ке подигнам против тебе тврдини."},
	{4, "4 И ке бидеш понизен, ке говориш како од под земја, и зборот твој ке биде глув како говор од под прав, и гласот твој ке биде како глас на оној што говори од стомак, и зборот твој ке се шепоти од под правот."},
	{5, "5 Многу твои непријатели ке бидат како ситен прав, а множеството угнетувачи - како развеана плева; и тоа ке стане ненадејно, во еден миг."},
	{6, "6 Господ Саваот ке те посети со гром и потрес, со силен глас, со бура и виор, со пламен од оган што голта се."},
	{7, "7 И како сон, како нокно видение во сон ке биде мноштво од сите народи, што војуваат против Арил, од сите, излезени против него и тврдините негови, и од оние, што го притесниле."},
	{8, "8 И како што гладен сонува, дека божем јаде, но се разбудува, и душата му е празна; и како што жеден сонува дека божем пие, но се разбудува, и ете се мачи, и душата му е жедна: истото ке стане и со множеството од сите народи, што војуваат против гората Сион."},
	{9, "9 Чудете се и восхитувајте се: тие ги ослепија другите, и сами ослепеа; тие се пијани, но не од вино, - се занесуваат, но не од сикер;"},
	{10, "10 зашто Господ испрати врз вас дух на успивање и ги затвори вашите очи, о пророци, и ги сокри вашите глави, о јасновидци!"},
	{11, "11 И секое пророштво за вас е она исто, што се зборовите во запечатената книга, што му ја даваат на оној, кој знае да чита книга, и велат: 'Прочитај ја', а тој одговара: 'не можам, зашто е запечатена.'"},
	{12, "12 И му ја даваат книгата на оној, кој не знае да чита, и велат: 'Прочитај ја'; и тој одговара: 'Не знам да читам.'"},
	{13, "13 И рече Господ: 'Бидејки овој народ се приближува кон Мене со устата своја, и со јазикот свој Ме почитува, а срцето негово му останува далеку од Мене, и почитувањето нивно пред Мене е само научено човечко правило;"},
	{14, "14 затоа, ете, Јас ке постапам пак необично со овој народ, чудно и чудесно, така што мудроста на мудреците негови ке загине, и разум во разумните нема да има."},
	{15, "15 Тешко на оние што мислат да се сокријат во длабочината, за да го скријат кроежот од Господа, кои ги вршат делата свои во мрак и велат: 'кој ке не види, и кој ке не дознае'?"},
	{16, "16 Каква неразумност? Можеме ли да го сметаме грнчарот за глина? Kе каже ли делото за оној што го направил: тој ме направи? И ке каже ли направеното за мајсторот свој: тој не разбира?"},
	{17, "17 Уште малку, сосема малку, и Ливан нема ли да се претвори во градина, а градината нема ли да се претвори во гора?"},
	{18, "18 И во тој ден глувите ке ги чујат зборовите од книгата, и очите на слепите ке прогледаат од темнината и мракот."},
	{19, "19 И оние што страдаат, се повеке и повеке ке се радуваат во Господа, а сиромасите и бедните лу е ке воскликнуваат во Светецот Израилев;"},
	{20, "20 зашто нема повеке да има силник, хулител ке исчезне; а ке бидат истребени и сите што смислуваат зло,"},
	{21, "21 кои го збркуваат човекот со зборови и му распнуваат мрежи на оној, кој бара суд кај портите и го отфрлаат правиот."},
	{22, "22 Затоа така вели Господ за Јакововиот дом, Оној, Кој го откупи Авраама: тогаш Јаков нема да биде во срам и лицето негово веке нема да побледува."},
	{23, "23 Зашто кога ке ги види околу себе децата свои, дело на Моите раце, тој свето ке го почита името Мое и свето ке го почитува Светецот Јаковов, со трепет ке стои пред Бога Израилев."},
	{24, "24 Тогаш оние што се со духот заблудени ке ја познаат мудроста, и непокорните ке се вразумат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view30() {
struct mk30 poems[] = {
	{1, "1 Тешко им на непокорните синови, вели Господ, кои се советуваат, но без Мене, и склучуваат сојузи, но не според Мојот сух, за да додаваат грев врз грев:"},
	{2, "2 а да не ја прашаат устата Моја, одат во Египет, за да се поткрепуваат со силата на Фараонот и да се сокријат под сенката на Египет."},
	{3, "3 Но силата Фараонова ке биде срам за вас, а засолништето под сенката на Египет - бесчестие;"},
	{4, "4 зашто кнезовите негови веке се во Соан, а гласниците негови стигнале до Ханес."},
	{5, "5 Сите тие ке бидат посрамени заради народот, кој е бескорисен за нив; од него нема да има ни помош, ни корист, туку - срам и позор."},
	{6, "6 Натоварени животни одат кон југ, по земјата на гнетот и притеснувањето, од каде што излегуваа лавови и лавици, змии и змејови што летаат; тие ги носат на грбот на осли своите богатства и врз грбовите на камили - своите ризници кон народ, кој нема да ми донесе полза."},
	{7, "7 Зашто помошта од Египет ке биде залудна и без корист; затоа Јас им реков: нивната сила е да седат спокојно."},
	{8, "8 Сега оди, нацртај им го тоа на штичка, и запиши го во книга, за да остане за во иднина, засекогаш и довека."},
	{9, "9 Зашто тоа е народ непокорен, деца лажливи, деца, кои не сакаат да го слушаат законот Господов,"},
	{10, "10 кои им говорат на јасновидците: 'престанете да предвидувате', и на пророците: 'не ни пророкувајте правда, говорете ни ласкаво, претскажувајте го она што ни е пријатно;"},
	{11, "11 слезете, тргнете се од патеката; отстранете го од очите наши Светецот Израилев.'"},
	{12, "12 Затоа вака вели Светецот Израилев: бидејки вие го отфрливте тоа слово, а се надевате на измама и неправда, и се облегнувате на тоа,"},
	{13, "13 затоа ова беззаконие ке биде за вас како пукнатина надвисната за да падне, чие уривање ке стане ненадејно, во еден миг."},
	{14, "14 И Он ке ја скрши, како што кршат глинен сад, разбивајки го немилосрдно, така што во кршот да не се најде ни парченци, со кое да се земе оган од огниште, или да се зафати вода од вир;"},
	{15, "15 зашто вака вели Господ Бог, Светецот Израилев: 'Ако останевте на местото и мирувавте, ке се спасевте; во тишината и надежта е ваша сила, но вие не сакавте"},
	{16, "16 и велевте: ‘не, ние ке избегаме на коњи‘, - затоа и ке бегате; ‘ние со брзи коњи ке избегаме‘ - затоа и оние што ве гонат, ке бидат брзи."},
	{17, "17 Од стравот на еден иљада ке бегате, од стравот на петмина ке бегате така, што вашиот остаток ке биде како граничен знак на врвот од планината и како знаме на рид.'"},
	{18, "18 И затоа Господ не брза да ве помилува, и затоа уште се воздржува, за да се смили над вас; зашто Господ е Бог на правдата - блажени се сите што се надеваат на Него!"},
	{19, "19 Народот ке живее во Сион, во Ерусалим; ти нема многу да плачеш, Бог ке те помилува, по гласот на твојот плач, и штом ке го чуе, - ке ти одговори."},
	{20, "20 И ке ви даде Господ леб кога сте во мака и вода по потреба; твојот Учител нема повеке да се крие, а очите твои ке Го гледаат твојот Учител;"},
	{21, "21 аки свртите надесно, ако свртите налево, ушите ваши ке го слушаат словото, кое говори зад вас - ете го патот, врвете по него!"},
	{22, "22 Тогаш ке ги сметаш за одвратност излиените од твое сребро идоли и опковани од твое злато кипови; ти ке ги фрлиш како нечистотија; ке им речеш - иставете се оттука."},
	{23, "23 И Он ке даде дожд врз твоето семе, со кое ке ги засееш нивите, а лебот, што го ра а земјата, и тој ке биде изобилен и вкусен; стадата твои во тој ден ке пасат по широки пасишта."},
	{24, "24 Воловите и ослите, што ги обработуваат нивните, ке јадат посолена крма, исчистена со лопата и веалка."},
	{25, "25 По секоја висока гора и по секој издигнат рид ке потечат бразди, потоци вода, во денот на големиот пораз, кога ке паднат кулите."},
	{26, "26 И светилната на месечината ке биде како светлина на сонцето, а светлината на сонцето ке биде седумпати посветла, отколку светлина на седум дена, во тој ден, кога Господ ке ја преврзе раната на Својот народ и ке ги излекува неговите рани."},
	{27, "27 Ете, името на Господа иде од далеку; гневот Негов гори, пламенот Негов е силен; устата Негова е полна со негодување, а јазикот Негов е како оган, што голта;"},
	{28, "28 дишењето Негово е како разлеан поток, кој се крева дури до вратот, за да ги просее народите до истоштување; и во челустите на народите ке има узда, што ке ја упатува кон заблуда."},
	{29, "29 А кај вас ке има песни, како преку нокта на свештен празник, и веселба во срцето, како кај оној што оди со свирка на гората Господова, кон тврдината Израилева."},
	{30, "30 И ке загрми Господ со Својот величествен глас и ке им го покаже замавот на Својата мишка со силен гнев и со пламен огнен, кој се проголтува, во бура, во силен дожд и во град."},
	{31, "31 Зашто од гласот на Господа ке стрепен Асур, поразуван со жезло."},
	{32, "32 И секое движење спрема определениот му жезол, кој Господ ке го управи против него, ке биде со тимпани и гитари, и Он ке оди на опустошувачка војна против него."},
	{33, "33 Зашто Тофет веке одамна е подготвен; тој е подготвен и за царот - длабок и широк; во кладата негова има многу оган и дрва; здивот на Господа, како поток од сулфур, ке го запали."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view31() {
struct mk31 poems[] = {
	{1, "1 Тешко им на оние што одат во Египет за помош: кои се надеваат на коњи и се потпираат на коли бојни, зашто биле многу, и на коњаници, зашто биле многу силни, а на Светецот Израилев не погледнуваат и кон Господа не прибегнуваат!"},
	{2, "2 Но премудар е Он; и ке испрати беда, и нема да ги измени зборовите Свои; ке се крене против домот на нечесните и против помошта на оние, што вршат беззаконие."},
	{3, "3 Египтјаните се лу е а не Бог; и коњите нивни им се тело, а не дух. Kе ја протегне раката Своја Господ, и ке се сопне заштитникот, ке падне заштитуваниот и сите заено ке загинат."},
	{4, "4 Зашто вака им рече Господ: 'Како лав, како лавче, кое рика над пленот свој, макар и многу овчари да му викаат, од викањето нивно нема ни да трепне и пред нивното множество нема да отстапи, - така Господ Саваот ке слезе да војува за гората Сион и за нејзиниот рид."},
	{5, "5 Како птиците - пиленцата, така Господ Саваот ке го покрие Ерусалим, ке го заштити и ке го избави, ке го сожали и ке го спаси.'"},
	{6, "6 Обрнете се кон Оној, од Кого толку сте отстапиле, синови Израилеви!"},
	{7, "7 Во тој ден секој човек ке ги отфрли своите сребрени и златни идоли, што рацете ваши ги направија вам за грев."},
	{8, "8 И Асур ке падне не од човечки меч, нема човечки меч да го премавне, - тој ке избега од мечот; младите негови ке плакаат данок."},
	{9, "9 И од страв тој ке избега покрај тврдината своја; кнезовите негови ке се плашат од знак, вели Господ, чиј оган е на Сион, а огништето - во Ерусалим."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view32() {
struct mk32 poems[] = {
	{1, "1 Ете, царот ке царува по правда, а кнезовите ке управуваат по закон;"},
	{2, "2 секој од нив ке биде како заштита од ветар и засолниште за лошо време, како водни извори во степи, како сенка од висока карпа во жедна земја."},
	{3, "3 И очите на оние што гледаат нема да бида закривани; ушите на оние што слушаат, ке внимаваат."},
	{4, "4 И срцето на лесномислените ке умее да расудува; оние што говорат на нос, ке говорат јасно."},
	{5, "5 Простакот нема повеке да го нарекуваат чесен, а за подмолниот нема да велат дека е честит."},
	{6, "6 Зашто простакот говори глупости и срцето негово мисли на беззаконие, за да дејствува лицемерно и да искажува хула проти Господа, да ја лишува од леб душата на гладниот и да го одзема пиењето од жедниот."},
	{7, "7 Кај подмолниот и средствата се погибелни: тој прави стапици, за да го погуби сиромавиот со лажливи зборови, макар што сиромавиот и да е прав."},
	{8, "8 А чесниот мисли на чесното и цврсто стои во се што е чесно."},
	{9, "9 Жени безгрижни, застанете, чујте го гласот мој; керки немирни, приклонете го увото кон зборовите Мои."},
	{10, "10 Уште една година и неколку дена, и ке се ужаснете вие, безгрижни! Гроздобер нема да има и време за жетва нема да настане."},
	{11, "11 Стреснете се вие, безгрижни! Ужаснете се вие, невнимателни! Соблечете се, оголете се и крстот препашете го."},
	{12, "12 Kе се бијат во гради за прекрасните полиња, за родната лоза."},
	{13, "13 Во земјата на народот Мој ке растат трња и боцки; така ке биде и во сите домови во градот што ликува;"},
	{14, "14 зашто дворците ке бидат оставени, шумниот град ке биде напуштен; Офел и кулата ке станат место пештери - прибежеште на диви осли и на стада што пасат."},
	{15, "15 Додека не се излие врз нас Духот одозгора, и пустињата не стане градина, и градината не почнат да ја сметаат за шума."},
	{16, "16 Тогаш ке се воведе суд во таа пустиња, и правда ке преуспева во плодоносното поле."},
	{17, "17 Дело на правда ке биде мирот, и плод на правосудството - спокојство и безопасност засекогаш."},
	{18, "18 Тогаш народот Мој ке живее во мирни живеалишта и во безопасни села и во пребивалишта на блажените."},
	{19, "19 И град ке па а врз гората; градот ке слезе во долината."},
	{20, "20 Блажени сте вие, што сеете при сите води и што испракате таму и вол и осел."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view33() {
struct mk33 poems[] = {
	{1, "1 Тешко тебе, опустошителе, кој не си бил опустошуван; грабачу, што не си ограбуван! Кога ке го завршиш опустошувањето, ке бидеш опустошен и ти; кога ке прекратиш со грабежите, и тебе ке те ограбат."},
	{2, "2 Господи, помилуј не, на Тебе се надеваме! Биди наша мишка од рани зори и наше спасение во невоља!"},
	{3, "3 Од страшниот глас Твој ке избегаат народите; кога ке се кренеш, ке се распрстан племињата,"},
	{4, "4 ке го истребат пленот ваш, како што гасеница истребува; ке се нафрлат врз неа, како што скакулци се нафрлуваат."},
	{5, "5 Возвишен е Господ, Кој живее во висините; Он ке го исполни Сион со суд и правда."},
	{6, "6 Kе настанат твоите безопасни времиња, изобилно спасение, мудрост и знаење; стравот од Господа ке биде твоето богатство."},
	{7, "7 Ете, нивните јунаци викаат по улиците; пратениците за мир горко плачат."},
	{8, "8 Патиштата запустеа; патници веке нема; Он го наруши договорот, го разурна градот, - за ништо не ги смета лу ето."},
	{9, "9 Земјата тагува, се суши; Ливан е посрамен, овенат; Сарон заприлега на пустиња, а Васан и Кармил се оголени од лисјата свои."},
	{10, "10 Сега ке станам, вели Господ, сега ке се издигнам, сега ке се возвисам."},
	{11, "11 Сено сте зачнале, слама ке родите; дишењето ви е оган, кој ке ве голтне."},
	{12, "12 И народите ке бидат како вар, што врие, како пресечено трње ке бидат изгорени во оган."},
	{13, "13 Слушајте, вие, далечни, што ке направам; и вие, блиски, познајте ја Мојата мок."},
	{14, "14 Се уплашија грешниците на Сион; морници го обзедоа нечесните: 'Кој од нас може да живее при оган што голта? Кој од нас може да живее при вечен пламен?'"},
	{15, "15 Оној, што оди во правда и говори вистина; кој презира печалба преку угнетување, ги воздржува рацете свои од подароци, ги затина ушите за да не слуша за крвнина, и ги затвара очите да не го гледа злото, -"},
	{16, "16 тој ке живее на висините: засолниште му се непристапните карпи; ке му се даде леб; водата негова нема да пресуши."},
	{17, "17 Очите твои ке го видат Царот во Неговата убавина, ке видат далечна земја;"},
	{18, "18 само срцето твое ке си спомни за ужасите: 'Каде е оној, што пребројуваше? Каде е оној, што го одмеруваше данокот? Каде е оној, што ги надгледуваше кулите?'"},
	{19, "19 Нема повеке да видиш народ свиреп, народ со неразбирлив збор, со јазик ту , несфатлив."},
	{20, "20 Погледни го Сион, градот на вашите празнични собранија; очите твои ке го видат Ерусалим, мирно живеалиште и непоколеблива скинија; столбовите нејзини никогаш нема да се помрднат, и ниедно од јажињата нема да се скине."},
	{21, "21 Таму кај нас великот Господ ке биде место реки, место широко канали; таму нема да влезе ниедна ла а со весла, ниту ке премине голем кораб."},
	{22, "22 Зашто Господ е наш судија, Господ е наш законодавец, Господ е наш цар: Он ке не спаси."},
	{23, "23 Ослабнаа јажињата твои, не можат да ги додржат јарболите и да ги затегнат платната. Тогаш ке има голем дележ на пленот, така и сакатите ке тргнат по грабеж."},
	{24, "24 И ниеден од жителите нема да каже: 'болен сум'; па на народот што живее таму ке му бидат простени гревовите."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view34() {
struct mk34 poems[] = {
	{1, "1 Пристапете, народи; слушајте и внимавајте, племиња! Нека слуша земјата и се што ја исполнува, вселената и се што се ра а во неа!"},
	{2, "2 Зашто гневот на Господа е врз сите народи, а јароста Негова врз целата нивна војска. Он ке ги уништи, ке ги предаде на погибел."},
	{3, "3 И нивните убиени ке бидат расфрлани, и од труповите нивни ке се крене смрдеа; по планините ке потече нивна крв."},
	{4, "4 И ке излезе сета небесна војска, и небото ке се свитка како книжен свиок; сета војска нивна ке падне, како што па а лист од лоза, како свенат лист - од смоква."},
	{5, "5 Зашто мечот Мој се опи на небото: ете, за суд слегува тај над Едом и над народот, за да биде казнет народот што го проколнав."},
	{6, "6 Мечот Господов ке се насити со крв, ке се здебели од маснотија, од јагнешка и козја крв, од маснотиите на овнешките бубрези: зашто Господ има жртва во Восор, и голем колеж во земјата Едомска."},
	{7, "7 И биволи ке паднат со нив и телиња заедно со волови, земјата ке се опие од крвта нивна, а правот нивни ке се здебели од маснотија."},
	{8, "8 Зашто настапи денот за одмазда Господова, годината на отплата за Сион."},
	{9, "9 И реките негови ке се претворат во катран, а правот негов - во сулфур; и земјата негова ке биде запален катран;"},
	{10, "10 нема да гасне ни дење, ни ноке; и димот нејзин вечно ке излегува, од род во род ке остане запустена; засекогаш нема да мине никој по неа;"},
	{11, "11 И ке ја завладеат пеликани и ежови, буфови и гаварни ке се населат во неа; и ке протегнат по неа јаже за разорување и мера за унишутвање."},
	{12, "12 Никој нема да остане таму од нејзините старешини, кои ке ги повикаат да бидат цареви; сите кнезови нејзини ке бидат уништени."},
	{13, "13 Дворците нејзини ке обраснат со трње, а тврдините нејзини - со коприва и пиреј; таа ке им биде живеалиште на шакалите, сврталиште на ноеви."},
	{14, "14 Sверови пустински ке се срекаваат со диви мечки, козли ке се повикуваат еден на друг; таму вештерки ке се одмараат и ке но аат спокојство."},
	{15, "15 Таму ке свие гнездо змија што лета, ке несе јајца, ке веде малечки и ке ги собира под сенката своја; таму и јастреби ке се собираат еден со друг."},
	{16, "16 Најдете во книгата Господова и прочитајте; ниедно од тие нема да одмине, едно со друго нема да се замени. Оти самата Негова уста заповеда, самиот дух Негов ке ги собере."},
	{17, "17 Зашто Он Самиот им фрли жреб, Неговата рака ке им ја раздели со мерка; засекогаш тие ке ја владеат, од род во род ке живеат во неа."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view35() {
struct mk35 poems[] = {
	{1, "1 Kе се развесели пустињата и сувата земја, и ненаселената земја ке се зарадува и ке расцути како крин;"},
	{2, "2 прекрасно ке цути и ке се радува, ке ликува и ке се весели; славата на Ливан ке му се даде, великолепието на Кармил и Сарон; тие ке ја видат славата на Господа, величината на нашиот Бог."},
	{3, "3 Закрепнете ослабени раце и зајакнете колена што треперите;"},
	{4, "4 кажете им на плашливите со дух: бидете цврсти, не плашете се: ете, вашиот Бог иде со одмазда, со отплата Божја: Он ке дојде и ке ве спаси."},
	{5, "5 Тогаш ке им се отворат очите на слепите, ушите на глувите ке се отнат;"},
	{6, "6 тогаш куциот ке скока како елен, и јазикот на немиот ке пее; зашто води ке бликнат во пустињата, и потоци во степите."},
	{7, "7 И водниот привид ке се претвори во езеро, а жедната земја - во водни извори; во живеалиштето на шакалите, каде што тие се одмараат - ке стане место за трска и рогозина."},
	{8, "8 И таму ке има друм, и патот по него ке се нарече свет пат; нечистиот нема да оди по него; тој ке биде само за нив; оние што одат по тој пат, дури и неискусните - нема да се загубат."},
	{9, "9 Лав нема да има таму, и лута sверка нема да се качува по него; тој нема да се најде таму, и ке одат само откупените."},
	{10, "10 Kе се вратат избавените од Господа, ке дојдат на Сион со радосни извици; и вечна радост ке биде над нивната глава; тие ке најдат радост и веселба, а жалоста и воздишката ке се оддалечат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view36() {
struct mk36 poems[] = {
	{1, "1 Во четиринаесеттата година на царот Езекија, асирскиот цар Сенахерим, стана против сите утврдени градови на Јудеја и ги презеде."},
	{2, "2 Тогаш асирскиот цар го прати Рапсака со голема војска од Лахис во Еурсалим при царот Езекија; и тој се запре кај водоводот на горниот водостој по патот за нивата на валавичарот."},
	{3, "3 И излезе при него Елијаким, Хелкиевиот син, началник на дворецот, и писарот Свена, и летописецот Јоах, Асафовиот син."},
	{4, "4 И им рече Рапсак: 'Кажете му на Езекија: вака вели големиот цар, царот асирски: каква е таа надеж, на која се надеваш?"},
	{5, "5 Јас мислам, дека се тоа само празни зборови, а за војна се потребни совет и сила: и така, на кого се надеваш ти, па си се одметнал од мене?"},
	{6, "6 Ете, ти многу се потпираш на Египет, на таа скршена трска, која, ако некој се потрпе на неа, ке му влезе во раката и ке ја прободе. Таков е Фараонот, царот египетски, за сите, кои се надеваат на него."},
	{7, "7 Ако ли ми кажеш: се надеваме на Господа, нашиот Бог, - тогаш на оној ли, чии светилишта и жртвеници ги замени Езекија и му кажа на Јуда и на Ерусалим: 'само пред овој жртвеник клањајте се?'"},
	{8, "8 И така, влези во сојуз со мојот господар, царот асирски; - ке ти дадам две иљади коњи; можеш ли да испратиш јавачи за нив?"},
	{9, "9 Па како сакаш да го натераш да отстапи водачот, еден од најмладите слуги на мојот господар, надевејки се на Египет, заради коли бојни и коњи?"},
	{10, "10 Та зар јас без вољата на Господа тргнав против оваа земја, за да ја разорам? Господ ми рече: оди против таа земја и разори ја."},
	{11, "11 Тогаш Елијаким, Севна и Јоах му рекова на Рапсака: 'Говори им на слугите твои на арамејски, зашто ние разбираме, е не ни говори по јудејски, за да чуе народот, кој е на sидините."},
	{12, "12 И Рапсак рече: 'Зар само при твојот господар и при тебе ме испрати господарот мој да ги кажам овие зборови? Не, исто така и при лу ето, што седат по sидините, за да го јадат со вас изметот свој и да ја пијат мочта своја.'"},
	{13, "13 Тогаш стана Рапсак и извика со висок глас по јудејски и рече: 'Чујте ги зборовите на големиот цар, асирскиот цар!"},
	{14, "14 Вака вели царот: нека не ве мами Езекија, зашто тој не може да ве спаси;"},
	{15, "15 И нека не ви дава надеж Езекија во Господа, велејки: 'Господ ке не спаси; овој град нема да биде предаден во рацете на царот асиски.'"},
	{16, "16 Не го слушајте Езекија, зашто вака говори царот асирски: примирете се со мене и излезете пред мене, и секој нека го јаде плодот од лозјето свое и од смоквата своја и секој нека пие вода од својот кладенец,"},
	{17, "17 додека не дојдам и ве земам во исто таква земја, каква што е и вашата земја, во земја на леб и вино, во земја на плодови и лозја."},
	{18, "18 И така, да не ве мами Езекија, велејки: 'Господ ке не спаси'. Боговите на народите ја спасија ли, секој својата земја од раката на асирскиот цар?"},
	{19, "19 Каде се боговите на Емат и Арпад? Каде се боговите на Сепарваим? Ја спасија ли тие Самарија од мојата рака?"},
	{20, "20 Кој од сите богови на тие земји ја спаси земјата своја од мојата рака? Та зар Господ ке го спаси Ерусалим од мојата рака?'"},
	{21, "21 Но тие молчеа и не му одговорија ни збор, зашто од царот беше дадена повелба: не му одговарајте."},
	{22, "22 Тогаш отиде Елијаким, синот Хелкиев, началник на дворецот, и Севна писарот, и Јоах, син Асафов, летописец при Езекија, со раскината облека, и му ги предадоа зборовите на Рапсака."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view37() {
struct mk37 poems[] = {
	{1, "1 Штом го чу тоа царот Езекија, ја раскина својата облека и се покри со врекиште, па отиде во домот Господов;"},
	{2, "2 ги повика началникот на дворецот Елијакима, и писарот Свена, и старешините на свештениците, покриени со врекишта при пророкот Исаија, син Амосов."},
	{3, "3 И тие му рекоа: 'Вака вели Езекија: овој ден е ден на жалоста, казна и срам, зашто новороденчињата дојдеа до отворот на мајчината утроба, но сила нема за ра ање."},
	{4, "4 Можеби, Господ, твојот Бог, ке ги чуе зборовите на Рапсака, кого асирскиот цар, негов господар, го прати да Го навредува живиот Бог и да се подбива со зборовите, кои ги чу Господ, твојот Бог; за тоа принеси молитва за другите, што се уште живи.'"},
	{5, "5 И отидоа слугите на царот Езекија при Исаија."},
	{6, "6 И им рече Исаија: 'Вака кажете му на вашиот господар: вака вели Господ: не плаши со од зборовите што ги чу, со кои Ме навредуваат слугите на асирскиот цар."},
	{7, "7 Ете, Јас ке испратам во него дух, и тој ке чуе вест и ке се врати во земјата своја, и Јас ке го поразам со меч во неговата земја.'"},
	{8, "8 Тогаш Рапсак се врати и најде дека асирскиот цар војува против Ливна; зашто беше чул, оти господарот негов се повлекол од Лахис."},
	{9, "9 И тој чу за Тирхака, царот етиопски; нему му беа рекли: ете, тој излезе да војува со тебе. Кога го чу тоа, тој испрати гласници, при Езекија, велејки:"},
	{10, "10 'Вака кажете му на Езекија, царот Јудејски: нека не те мами твојот Бог, на Кого се надеваш, велејки: Ерусалим нема да биде предаден во рацете на царот асирски."},
	{11, "11 Ете, ти си чул што направија асирските цареви со сите земји, ставајки врз нив клетва; та ти ли ке се избавиш?"},
	{12, "12 Боговите на народите, кои татковците мои ги разорија, ги спасија ли, го спасија ли Гозан и Харан, Рецеф и синовите не Еден, што се во Теласар?"},
	{13, "13 Каде е царот ематски, и царот арпадски, и царот на градот Сефарваим, Ена и Ива?'"},
	{14, "14 И го зеде Езекија писмото од рацете на пратениците и го прочита, па отиде Езекија во домот Господов и го отвори пред лицето Господово;"},
	{15, "15 се помоли Езекија пред лицето на Господ и рече:"},
	{16, "16 'Господе Саваоте, Боже Израилев, Кој седиш на херувими! Ти единствен си Бог на сите земни царства: Ти си ги создал небото и земјата."},
	{17, "17 Приклони го, Господи, увото Свое и чуј; отвори ги, Господи, очите Свои и погледај, чуј ги зборовите на Сенахерима, кој испрати да хулат на Тебе, живиот Бог."},
	{18, "18 Навистина, Господи, асирските цареви ги опустошија сите краишта и земјите нивни."},
	{19, "19 Тие ги изнафрлаа во оган боговите ниви; но тоа не беа богови, туку изработки од човечки раце, дрво и камен, затоа и ги уништија.."},
	{20, "20 И сега, Господи, Боже наш, спаси не од раката негова: тогаш ке дознаат сите земни царства, дека Ти, Господи, си единствен Бог.'"},
	{21, "21 И испрати Исаија, синот Амосов, до Езекија да кажат: вака вели Господ, Бог Израилев: 'За она што ти Ми се молеше против Сенахерима, царот асирски, -"},
	{22, "22 еве го словото што Господ го изрече за него: ке те презре, ке ти се потсмее девицата, керката Сионова, ке ја заниша главата по тебе керката ерусалимска."},
	{23, "23 Кога ти прекоруваше и навредуваше? Против кого го подигна гласот и ги крена толку високо очите свои? Против Светецот Израилев."},
	{24, "24 Преку слугите свои ти го прекоруваше Господа, велејки: 'Со множеството мои коли се искачив на врвот од планините, врз ребрата на Ливан, ги исеков високите негови кедри, убавите негови кипариси, и стигнав до самиот врв негов, и до горичката негова;"},
	{25, "25 и ископав и пиев вода; и со стапките на нозете свои ке ги исушам сите реки египетски."},
	{26, "26 Зар не си чул, дека Јас одамна го направив тоа, во стари дни го преднацртав, а сега го исполнив со тоа, дека ти го опустошуваш силните градови, претворајки ги во купишта урнатини?"},
	{27, "27 Жителите нивни изнемоштеа; треперат и остануваат во срам; станале како трева по полето и нежно тревно растение, како тревки по покривите и препламнато жито пред да биде искласано."},
	{28, "28 Kе седнеш ли, ке излезеш ли, или ке влезеш - Јас знам се, ја знам и дрскоста твоја против Мене."},
	{29, "29 За твојата дрскост против Мене и за тоа, дека твојата надуеност дојде до ушите Мои, ке ја ставам алката Своја во ноздрите твои и уздата Своја - во устата твоја; ке те вратам назад по истиот пат, по кој си дошол."},
	{30, "30 И, ете, ти, Езекија, доказ: јадете го оваа година израснатото од паднатото зрно, а во другата година - самоизраснатото; на третата, пак, година сејте и жнејте, садете лозја и јадете ги плодовите нивни."},
	{31, "31 Зашто преживеаните во домот Јудин, тие што ке останат, пак ке пуштат корен долку и ке дадат плод горе,"},
	{32, "32 оти од Ерусалим ке произлезе остатокот, и од градот Сион - спасението. Тоа ке го изврши ревноста на Господа Саваот."},
	{33, "33 Поради тоа вака вели Господ за асирскиот цар: 'нема да влезе тој во овој град, ниту ке фрли таму стрела, и нема да се доближи до него со штит, ниту ке ископа опкоп околу него;"},
	{34, "34 по кој пат дошол, по истиот и ке се врати, но во тој град нема да влезе, вели Господ."},
	{35, "35 Јас ке го бранам овој град, за да го спасам поради Себе и заради Мојот слуга Давида.'"},
	{36, "36 Тогаш излезе ангел Господов и погуби во асирскиот логор сто и осумдесет и пет иљади души. Утредента станаа, и, ете, насекаде имаше само мртви тела."},
	{37, "37 И остстапи Сенахирим, царот асирски, та си отиде, се врати и живееше во Ниневија."},
	{38, "38 И кога се клањаше во домот на својот бог Нимрох, синовите негови Адрамелех и Сарасар го убија со меч, а самите избегаат во Араратската земја. И место него стана цас синот негов Асардан."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view38() {
struct mk38 poems[] = {
	{1, "1 Во тие дни Езекија се разболе смртно. И дојде кај него пророкот Исаија, синот Амосов, и му рече: 'Вака вели Господ: направи завет за домот свој, зашто ке умреш, нема да оздравиш.'"},
	{2, "2 Тогаш Езекија се сврте со лицето кон sидот и се помоли на Господа велејки:"},
	{3, "3 'О, Господи! Сети се, дека јас одев пред Твоето лице верно и со предано срце кон Тебе и вршев она што беше угодно пред Твоите очи.' И силно заплака Езекија."},
	{4, "4 И дојде словото Господово кон Исаија и му беше речено:"},
	{5, "5 'Оди, кажи му на Езекија: вака вели Господ, Бог на татка ти Давида: ја чув твојата молитва, ги видов твоите солзи, и ете, додавам кон твоите дни уште петнаесет години,"},
	{6, "6 ке те спасам тебе и овој град од раката на царот асирски. Да, ке го зачувам тој град."},
	{7, "7 И, еве ти знак од Господа, дека Господ ке го исполни словото, што го изрече."},
	{8, "8 Еве, ке ја вратам десет стапки назад сончевата сенка, која мина по стапките Ахазови.' И се врати сонцето десет стапки по стапките, по кои тоа слегуваше."},
	{9, "9 Молитвата на јудејскиот цар Езекија, кога беше болен и оздраве од болеста:"},
	{10, "10 'Си реков во себеси: кога ги преполовив дните свои, треба да влезам во портите на пеколот; јас сум лишен од остатокот на годините свои."},
	{11, "11 Јас реков: нема да Го видам Господа, Господа во земјата на живите; нема да видам повеке човек ме у оние што живеат во светот;"},
	{12, "12 моето живеалиште се симна од местото и се оддалечени од мене како овчарски шатор; како ткаач треба да го пресечам животот свој; Он ке ме отсече од основа; дење и ноке чекав, дека Ти ке пратиш смрт."},
	{13, "13 Чекав до утрото; како лав Он ги кршеше сите мои коски; ден и нок чекав дека ке ми испрати смрт."},
	{14, "14 Како жерав, како ластовичка испуштав гласови, како гулаб тагував; очите мои гледаа кон небото: Господи, притеснет сум, спаси ме."},
	{15, "15 Што да кажам? Тој ми рече, и Тој направи. Мирно ке ги поминам сите години на животот свој, помнејки ја тагата на душата своја."},
	{16, "16 Господи, така живеат, и во сето тоа за Тебе ке живее мојот дух; Ти ке ме излекуваш, ке ми даруваш живот."},
	{17, "17 Ете, за добро ми беше силната тага, Ти ја спаси душата моја од погибелниот ров, ги фрли зад грбот Свој сите мои гревови."},
	{18, "18 Зошто не пеколот Тебе Те слави, не смртта Тебе те восфалува, не слезените во гроб се надеваат на Твојата вистина."},
	{19, "19 Живите, само живите ке Те прослават, како јас сега; таткото ке им ја соопшти на децата Твојата вистина."},
	{20, "20 Господ ке ме спаси; и ние во сите дни на нашиот живот со звуците на моите жици ке пееме песни во домот Господов.'"},
	{21, "21 Тогаш рече Исаија: 'Нека донесат суви смокви, нека ги изгмечат и нека ги става врз чирот; и царот ке оздрави.'"},
	{22, "22 А Езекија рече: 'Кој е знакот, дека ке отидам во домот Господов?'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view39() {
struct mk39 poems[] = {
	{1, "1 Во тоа време вавилонскиот цар Мародах Валадан, син Валаданов, испрати до Езекија писмо и дарови, зашто беше чул, оти тој бил болен и оздравел."},
	{2, "2 Им се зарадува Езекија на гласниците и им ја покажа својата ризница, среброто и златото, пријатните мириси и скапоцените масла, целата своја оружница и се што се нао аше во неговата ризница, - не остана ништо, што не им го покажа Езекија во домот свој и по целото свое владение."},
	{3, "3 Тогаш дојде пророкот Исаија при царот Езекија и му рече: 'Што рекоа овие лу е? Од каде дојдоа при тебе?' Езекија одговори: 'Од далечна земја дојдоа тие при мене, од Вавилон.'"},
	{4, "4 И праша Исаија: 'Што видоа тие во твојот дом?' Езекија одговори: 'Видоа се, што има во мојот дом; ништо не остана во мојата ризница, што да не им покажав.'"},
	{5, "5 И му рече Исаија на Езекија: 'Ислушај го словото на Господа Саваот:"},
	{6, "6 ете, ке дојдат дни, и се што има во домот твој и што собрале татковците твои до денес, се ке биде однесено во Вавилон; ништо нема да остане, вели Господ."},
	{7, "7 Kе земат и од твоите синови, што ке произлезат од тебе, што ке ги родиш, и тие ке бидат евнуси во дворецот на вавилонскиот цар.'"},
	{8, "8 А Езекија му рече на Исаија: 'Добро е словото Господово, што ти го изрече; а во себе помисли: барем ке има мир и сигурност во текот на моите дни.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view40() {
struct mk40 poems[] = {
	{1, "1 Утешувајте го, утешувајте го Мојот народ, вели вашиот Бог;"},
	{2, "2 говорете му на Ерусалим, што му е по срце, и известувајте го, дека времето на неговата борба се исполни, дека за неправдата му е дадено задоволување, зашто од раката Господова доби двојно за сите свои гревови."},
	{3, "3 Гласот на оној што вика во пустињата говори: 'Пригответе Му пат на Господа, прави направете ги во пустињата патеките за нашиот Бог;"},
	{4, "4 секој дол да се исполни, секоја планина и рид да се снизат; кривините да се исправат, и нерамните патишта да бидат израмнети;"},
	{5, "5 и ке се јави славата Господова, и секоја плот ке го види спасението од Бога; зашто устата Господова го изрече тоа.'"},
	{6, "6 Гласот говореше: 'Разгласувај!' и рече: 'Што да разгласувам?' - Секоја плот е трева, сета убавина нејзина е како полско цвеке."},
	{7, "7 Тревата се исушува, цвекето овенува, што ке дувне врз него здивот на Господа: така е и народот како трева."},
	{8, "8 Тревата се суши, цвекето свенува, а словото на нашиот Бог останува вечно.'"},
	{9, "9 Искачи се на високата гора Сион, ти кој јавуваш добри вести за Сион, извиши го силно гласот свој, благоизвестителе Ерусалиме, подигни го, не плаши се. Кажи им на градовите Јудини: еве Го вашиот Бог!"},
	{10, "10 Ете, Господ Бог иде со сила и мишката Негова е со власт. Ете, наградата Му е со Него, а отплатата Му е пред лицето Негово."},
	{11, "11 Како пастир ке го пасе Он стадото Свое: јагнињата ке ги земе Он во рацете и ке ги носи на градите Свои, и грижливо ке ги води дојдените."},
	{12, "12 Кој ги исцрпел водите со раката своја и со педа го измерил небото, и со мерка го измерил правот земен, кој ги измерил на теразија планините и ридовите?"},
	{13, "13 Кој го разбрал Духот на Господа, и Му бил Нему советник и Го учел?"},
	{14, "14 Со кого се советувал Он, и кој Го вразумувал и Го поучувал во патот на правдата, и Го учел на знаење и Му го покажувал патот на мудроста?"},
	{15, "15 Ете, народите се како капка од ведро, и се сметаат како прашинка на терезија. Ете, островите Он ги подигна како прашинки."},
	{16, "16 Ни Ливан не стигнува за жртвен оган, ни животните по него - за сепаленица."},
	{17, "17 Сите народи пред Него се како ништо, - за Него се помалку од ништо, и помалку се од суетата."},
	{18, "18 И така, со кого ке Го споредите Бога, и каква подобност ке Му најдете?"},
	{19, "19 Уметникот го излева идолот, а златарот го покрива со злато и му додава сребрени веришки."},
	{20, "20 А кој е сиромав и нема што да му принесе, тој избира дрво, кое не гние, па бара искусен уметник за да направи идол, што ке стои цврсто."},
	{21, "21 Зар не знаете? Зар не сте слушале? Зар не ви е зборувано во почетокот? Зар не сте го разбрале тоа по основите на земјата?"},
	{22, "22 Он е Оној, Кој седи над другот на земјата, а оние, што живеат на неа, се како скакулци пред Него; Он ги распослал небесата како танко платно и ги распнал како шатор за живеење."},
	{23, "23 Он ги претвора кнезовите во ништо, судиите земни ги прави да бидат ништожни."},
	{24, "24 Одвај посадени, одвај посеани, одвај се закоренил во земјата стракот нивни, штом Он ке дувне врз нив, тие се исушуваат; виорот ги однесува како плева."},
	{25, "25 'Со кого ке Ме изедначите и со кого ке Ме споредите? - вели Светецот."},
	{26, "26 Кренете ги очите свои кон висините небесни и погледнете, кој ги создал? Кој го пресметал бројот на војската нивна? Он сите нив ги нарекува по име: поради големата мок и големата сила во Него ништо не недостига."},
	{27, "27 А како говориш ти, Јакове, и велиш, Израиле: 'Патот ми е сокриен од Господа, делото мое е заборавено пред мојот Бог?'"},
	{28, "28 Зар не знаеш? Зар не си слушал дека вечниот Бог, Кој ги создал краиштата на земјата, не се изморува и не изнемоштува; Неговиот разум е неиспитлив."},
	{29, "29 Он му дава силан на уморениот и му дарува јачина на изнемоштениот."},
	{30, "30 Се уморуваат и момчињата и ослабуваат, и млади лу е па аат,"},
	{31, "31 а оние кои се надеваат на Господа, ке ја обноват силата своја: ке кренат криља како орли, ке трчаат и нема да им биде тешко, ке одат и нема да се уморат."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view41() {
struct mk41 poems[] = {
	{1, "1 Молкнете пред Мене, острови, и нека народите ги обноват силите свои; нека се приближат и нека речат: да излеземе заедно на суд."},
	{2, "2 'Кој Го издига од исток Праведникот, кој Го повикува да оди пред Него? Кој Му ги предаде народите и Му ги покори царевите? Он ги претвори во прав со Неговиот меч, со Неговиот лак - во плева, развеана од ветар."},
	{3, "3 Он ги гонеше, одеше спокојно по патот, по кој никогаш не беше одел со нозете свои."},
	{4, "4 Кој го направи и изврши тоа? Оној, Кој во почетокот ги повика родовите; Јас, Господ, Јас сум првиот, и ме у последните - Јас сум истиот."},
	{5, "5 Островите видоа и се ужасија, краиштата земни затреперија. Тие се зближија и се собраа;"},
	{6, "6 секој му помага на другарот свој и му вели на братот свој: 'Држи се!'"},
	{7, "7 Ковачот го бодри леарот; кој ги сплескува со чекан листовите, му одобрува на оној, што кова на ковална, велејки за спојката: 'добра е'; и ја зацврстува со клинци, за да биде цврста."},
	{8, "8 'А ти, ти Израиле, слуго Мој, Јакове, кого Јас те избрав, семе на Авраама, пријателе Мој,"},
	{9, "9 ти, кого го зедов од краиштата на земјата и го повикав од краиштата нејзини, и ти реков: Ти си Мој слуга, Јас те избрав и нема да те отфрлам."},
	{10, "10 Не плаши се, зашто Јас сум со тебе; не се вознемирувај, зашто Јас сум Бог твој; Јас ке те закрепам и ке ти помогнам, ке те поддржам со десницата на Мојата правда.'"},
	{11, "11 Ете, постидени и засрамени ке останат сите, што се наежени против тебе, - ке бидат како ништо и ке загинат оние што се препираат со тебе."},
	{12, "12 Kе ги бараш - и нема да ги најдеш, нив, кои непријателствуваат против тебе; кои се борат со тебе; ке бидат како ништо, наполно ништо;"},
	{13, "13 зашто Јас сум Господ, Бог твој; те држам за твојата десна рака, ти велам: 'не плаши се, Јас ти помагам.'"},
	{14, "14 'Не се плаши, црву Јакове, малуброен Израиле, - Јас ти помагам, вели Господ, Јас твој Искупител, Светецот Израилев.'"},
	{15, "15 Ете, Јас ке ти направам остар дикел, нов, назабен; ти ке ги кршиш и ке ги ситниш планините, и ридовите ке ги направиш како прав."},
	{16, "16 Ти ке вееш, ветрот ке ги разнесе, и виорот ке ги развее; а ти ке се зарадуваш во Господа, ке се фалиш со Светецот Израилев."},
	{17, "17 Сиромаси и неимотни бараат вода, и нема, јазикот им се исушува од жед: Јас, Господ ке ги чујам, Јас, Бог Израилев, нема да ги оставам."},
	{18, "18 Kе отворам реки на врвот од горите и извори среде долини; пустињата ке ја направам езеро и сувата земја - водни извори;"},
	{19, "19 ке насадам во пустиња кедар, ситим, мирта и маслинки, ке насадам во степите кипарис, јавор и бука наедно,"},
	{20, "20 за да видат и познаат, и да ги разгледаат и разберат, дека раката Господова го направи тоа, дека Светецот Израилев го создаде тоа."},
	{21, "21 Претставете го делото свое, вели Господ; дајте ги доказите свои, вели Царот Јаковов."},
	{22, "22 Нека дојдат и нека ни кажат што ке биде; нека објават нешто, пред да стане, и ние ке проникнеме со умот свој и ке дознаеме, што ке биде потоа, или нека ни претскажат за иднината."},
	{23, "23 Кажете што ке биде во иднина, и ние ке познаеме дека сте богови, или направете нешто добро или лошо, за да се зачудиме и заедно со вас да видиме."},
	{24, "24 Но вие сте ништо, и делото ваше е ништожно; одвратен е оној што ве избра.'"},
	{25, "25 Јас го подигнав од север, и тој ке дојде; од изгрев сонце ке го повикува името Мое и ке ги гази кнезовите како кал, и ке ги гази, како грнчар глината."},
	{26, "26 Кој објави за тоа од почетокот, за да знаеме, и многу порано, за да можеме да кажеме: 'навистина?' Но никој не кажал, никој не објавил, никој не ги чул вашите зборови."},
	{27, "27 Јас прв реков на Сион: 'ете го, и му дадов на Ерусалим благовесник.'"},
	{28, "28 И така, Јас гледав, и немаше никого, ме у нив не се најде советник, за да можам да ги прашам, и тие да одговорат."},
	{29, "29 Ете, сите тие се ништо, ништожни се и делата нивни: ветар и ништожност се нивните идоли."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view42() {
struct mk42 poems[] = {
	{1, "1 Еве го Мојот Слуга, Кого Го држам за рака, Мојот Избраник, кон Кого благоволи душата Моја. Kе го положам Духот Свој врз Него, и Он ке им биде суд на народите;"},
	{2, "2 нема да викне, ниту да го подигне гласот Свој, нема да дозволи да го чујат на улиците;"},
	{3, "3 скршената трска нема да ја здроби, и ленот што тлее нема да го угасне; ке суди според вистината;"},
	{4, "4 нема да ослабне, ниту ке изнемошти, додека на земјата не утврди суд, народите ке се надеваат на Неговиот закон."},
	{5, "5 Така вели Господ Бог, Кој ги создал небесата и нивното пространство, Кој ја раширил земјата со нејзините производи, Кој му дава здив на народот што е на неа, и дух на оние што одат по неа."},
	{6, "6 Јас, Господ, Те повикав во правда, цврсто ке Те држам за рака и ке Те пазам, ке те поставам за завет на народот, светлина за незнабошците,"},
	{7, "7 за да им ги отвориш очите на слепите, да ги изведеш врзаните од затвор и оние што седат во темнина - од темнина."},
	{8, "8 Јас сум Господ, тоа е Моето име, и нема да ја дадам славата Своја на друг, ниту честа Своја на идоли."},
	{9, "9 Ете, претскажаното порано се зби, и ново ке известам; пред да стане тоа, Јас ке ве известам."},
	{10, "10 Пејте Му на Господа нова песна, похвална за Него од земните краишта, вие што пловите по море, и се, што го полни, островите и оние што живеат на нив."},
	{11, "11 Нека издигне глас пустињата и нејзините градови, населбите, каде што живее Кидар; нека ликуваат оние што живеат во карпи, нека воскликнуваат од врвовите горски."},
	{12, "12 Нека Му воздадат слава на Господа, похвалата Негоав нека ја возвестат на островите."},
	{13, "13 Господ ке излезе како исполин, ревноста ке ја возбуди како војник; ке извика и ке подигне војнички вик; ке се покаже силен против непријателите Свои."},
	{14, "14 Долго молчев Јас, трпев и се воздржував; сега ке викам како родилка, ке разурнувам и ке голтам се."},
	{15, "15 Kе опустошувам планини и ридови, и сета нивна трева ке ја исушам; реките ке ги направам острови, езерата ке ги исушам."},
	{16, "16 Kе ги поведам слепите по пат, што тие не го знаат, ке ги водам по нејзини патеки, темнината ке ја направа светлина пред нив, а кривите патеки - прави: ете, што ке направам Јас за нив, и нема да ги оставам."},
	{17, "17 Тогаш ке се свртат назад и со голем срам ке се покријат оние, што се надеваат на идоли, кои им велат на идолите: вие сте наши богови."},
	{18, "18 Слушајте, глуви, и гледајте, слепи, за да видите."},
	{19, "19 Кој е толку слеп како што е Мојот слуга, и глув, како што е Мојот пратеник? Кој е толку слеп како што е возљубениот, кој е така слеп, како што е слугата Господов?"},
	{20, "20 Ти си видел многу, но не си забележувал; ушите ти биле отворени, но не си слушал."},
	{21, "21 На Господа му било угодно заради правдата Своја да го возвеличи и прослави законот."},
	{22, "22 Но тоа е народ поробен и разграбен; сите тие се врзани во подземја и сокриени во темници; станале плен, и нема спасител, ограбени се, и никој не вели: врати го!"},
	{23, "23 Кој од вас го приклонил увото кон тоа, кој викнал и го слушал за иднината?"},
	{24, "24 Ког го предаде Јакова на разурнување и Израилот - на грабачи? Не е ли тоа Господ, против Кого згрешивме? Тие не сакаат да одат по патиштата Негови, ниту го слушаат законот Негов."},
	{25, "25 А Он ја излеа врз нив јароста на Својот гнев и жестокоста на војната: ти ги опкружи со пламен од сите страни, но тие не забележуваа; гореше во нив, но тие не го разбраа тоа со срце."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view43() {
struct mk43 poems[] = {
	{1, "1 А сега вака вели Господ, Кој те создаде Јакове, и Кој те образувал, Изариле: не плаши се, зашто Јас те откупив, те нареков според името твое; ти си Мој."},
	{2, "2 Преку води ли ке минуваш, Јас сум со тебе; преку реки ли - тие нема да те потопат; ако тргнеш преку оган, нема да се изгориш, и пламенот нема да те обгори."},
	{3, "3 Зашто Јас сум Господ, Бог твој, Светецот Израилев, твојот Спасител; откуп за тебе го дадов Египет; Етиопија и Савеја ги дадов за тебе."},
	{4, "4 Бидејки си скап во очите Мои, многу си ценет; Јас те возљубив, затоа ке дадам други лу е за тебе, и народи за твојата душа."},
	{5, "5 Не плаши се, зашто Јас сум со тебе; од исток ке го доведам твоето племе и од запад ке го соберам."},
	{6, "6 На север ке му кажам: дај; и на југ: не задржувај; доведи ги синовите Мои оддалеку и керките Мои - од краиштата на земни,"},
	{7, "7 секого, кој се нарекува со Моето име, кого сум го создал за Мое прославување, ги содадов и направив."},
	{8, "8 Изведи го слепиот народ, иако има очи, и глувиот, иако има уши."},
	{9, "9 Нека се соберат сите народи заедно, нека се соеднинат племињата. Кој од нив го претскажал тоа? Нека соопштат што било во почетокот; нека доведат сведоци од себеси и да се оправдаат, за да може да се чуе и да се каже: 'вистина е.'"},
	{10, "10 А Мои сведоци, вели Господ, сте вие и Мојот слуга, што го избрав, за да знаете и да Ми верувате, да разберете дека сум тоа Јас: пред Мене немаше Бог, и по Мене нема да има."},
	{11, "11 Јас, Јас сум Господ, и нема Спасител освен Мене."},
	{12, "12 Јас предреков и спасив, однапред претскажав а друг немате, вие сте Мои сведоци, оти Јас сум Бог - вели Господ;"},
	{13, "13 од почетокот на дните Јас сум ист, никој нема да се спаси од раката Моја; Јас ке направам, и кој ке го измени тоа?"},
	{14, "14 Така вели Господ, вашиот Изкупител, Светецот Израилев; заради вас испратив во Вавилон и ги исфрлив сите резиња на затворите и Халдејците, кои се гордееја со кораби."},
	{15, "15 Јас сум Господ, вашиот Светец, Создателот на Израилот, вашиот Цар."},
	{16, "16 Така вели Господ, кој отвори во морето пат, по разбранувани води - патека."},
	{17, "17 Кој изведе бојни коли и коњи, војска и сила; сите легнаа наедно, не станаа; угаснаа, како фитил истлееја."},
	{18, "18 Но вие не се секавате за поранешното и за некогашното не помислувате."},
	{19, "19 Ете, Јас правам нешто ново; еве сега ке се јави; зари и тоа не сакате да го знаете? Kе направам пат низ степи, реки - преку пустиња."},
	{20, "20 Полските sверови ке Ме прослават, шакали и ноеви, зашто ке им дадам вода во пустињата, реки - во суви степи, за да го појам Мојот избравн народ."},
	{21, "21 Овој народ го создадот за Себеси; тој ке ја разгласува славата Моја."},
	{22, "22 А ти, Јакове, не си Ме викал: ти, Израиле, не си се трудел за Мене."},
	{23, "23 Не си Ми ги принесувал своите јагниња за сепаленица, ниту си Ме почитувал со жртвите свои. Не сум те принудувал да Ми служиш со лебни приноси и не сум ти дотежнувал, барајки од тебе да Ми кадиш."},
	{24, "24 Не си ми купувал со сребро кадило, ниту си Ме наситувал со мрсно месо од жртвите свои; но со твоите гревови си Ме оптоварувал; со твоите беззаконија си Ми дотежнувал."},
	{25, "25 А Јас, Јас Сам ги бришам твоите престапи заради Самиот Себе и гревовите твои нема да ги спомнам."},
	{26, "26 Спомни Ме; ке се судиме; говори, за да се оправдаш."},
	{27, "27 Твојот праотец згреши, а твоите застапници отстапија од Мене."},
	{28, "28 Затоа настојниците на светилиштето ги лишив од свештенство, Јакова го предадов на проклетство и Израилот на подбив."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view44() {
struct mk44 poems[] = {
	{1, "1 А сега слушај, Јакове, слуго Мој, и ти, Израиле, кого Јас го избрав."},
	{2, "2 Вака вели Господ, Кој те создаде и те обликува, Кој ти помага од мајчината утроба: не плаши се, слуго Мој Јакове, и возљубен Мој, кого Јас го избрав;"},
	{3, "3 зашто ке излеам вода врз она што жедува, и потоци врз исушеното; ке го излеам духот Свој врз твоето племе и благословот Свој - врз твоите потомци."},
	{4, "4 Kе растат како трева крај извори, како врби крај водни потоци."},
	{5, "5 Еден ке рече: 'Јас сум Господов', друг ке се нарече со името на Јакова; а трет ке напише со раката своја: 'Јас сум Господов', ке се нарече со името Израилево."},
	{6, "6 Вака вели Господ, Царот на Израилот и неговиот Избавител, Господ Саваот: 'Јас сум првиот, Јас сум и последниот; освен Мене нема Бог;"},
	{7, "7 зашто кој е како Мене? Нека раскаже тој, да разгласи и по ред да Ми престстави се од она време, кога го усторов древниот народ, нека го разгласат она што настапува и она што ке биде..."},
	{8, "8 Не бојте се и не плашете се: нели оддамана ти соопштив и престкажав? И вие сте Мои сведоци. Има ли Бог освен Мене? Не, друга никаква карпа не знам."},
	{9, "9 Оние, што прават идоли, сите се ништожни, нивните најсакани не донесуваат никаква корист тие сами се сведоци во тоа. Тие не гледаат, ниту разбираат, и затоа ке бидат посрамени."},
	{10, "10 Кој направил бог и излеал идол, што не донесува никаква корист?"},
	{11, "11 Сите учесници во тоа ке бидат посрамени, зашто и самите мајстори сепак се лу е; сите тие нека се соберат и нека застанат; тие ке се уплашат и сите ке бидат посрамени."},
	{12, "12 Ковачот прави сечило од железо, со чекан го мазни и се труди над него со силната рака своја до толку, што прегладнува и премалува, не пие вода и изнемоштува."},
	{13, "13 Дрводелецот, откако ке одбере дрво, влече по него линија, со остар алат го оцртува, потоа изработува лик на убав човек, за да го постави дома."},
	{14, "14 Сече кедри, зема бор и даб, кои ги одбира ме у шумските дрвја, сади јасен, кого дождот го прави да расте."},
	{15, "15 И тоа му служи на човекот за оган, а дел од него употребува да се топли, да запали оган и да пече леб. А од него прави и бог и му се поклонува, прави идол и па а ничкум пред него."},
	{16, "16 Дел од дрвото изгорува во оган, со друг дел вари месо за јадење, си пече печено и јаде до наситување, а исто така се грее и вели: 'добро е, се згреав; почувствував топлина.'"},
	{17, "17 А од остатоците прави бог, свој идол, му се поклонува, па а ничкум пред него и му се моли и вели: 'спаси ме, зашто ти си мој бог.'"},
	{18, "18 Не знаат, ниту разбираат: 'Он им ги затворил очите, за да не гледаат, и срцата нивни - за да не разбираат."},
	{19, "19 И не го зема тоа при срце, ниту има до толку знаење и разум да каже: 'половината негова ја изгорев на оган и на јагленот негов испеков леб, сварив месо и јадев; а од остатокот зар ке направам одвратност, зар ке се клањам на парче дрво?'"},
	{20, "20 Рзбери дека срцето на идол е од пепел; измаменото срце твое те довело во заблуда, и не може да ја ослободи душата своја и да рече: 'нели е измама тоа што е во десната рака моја?'"},
	{21, "21 Помни го тоа, Јакове и Израиле, зашто ти си Мој слуга; Јас те создадов; Мој слуга си ти, Израиле, не Ме заборавај."},
	{22, "22 Kе ги избришам како магла твоите беззаконија, и твоите гравови - како облак; сврти се кон Мене, зашто Јас те откупив."},
	{23, "23 Веселете се, небеса, зашто Господ го направи тоа. Ликувајте, длабочини земни; шумете од радост, гори и шуми и сите дрвја во нив; зашто Господ го откупи Јакова и ке се прослави во Израилот."},
	{24, "24 Вака вели Господ, Кој те откупува и Кој те обликува во мајчината утроба: Јас сум Господ, Кој се создадов, Сам ги спрострев небесата и со силата Своја ја послав земјата."},
	{25, "25 Јас ги правам ништожни доказите на лажните пророци и на видело го изнесувам безумието на ме есниците, Јас Кој ги вракам мудреците и знаењето нивно го обрнувам во лудост."},
	{26, "26 Го потврдувам зборот на Својот слуга и го извршувам изреченото од Моите пратеници, му велам на Ерусалим: 'Ти ке бидеш населен' и на градовите Јудини: 'Вие ке бидете изградени; и урнатините негови Јас ке ги возобновам.'"},
	{27, "27 Јас и велам на бездната: 'Исуши се!' И реките твои Јас ке ги исушам."},
	{28, "28 Кој вели за Кира: 'Тој е Мој пастир, и тој ке ја исполни секоја воља Моја и ке му рече на Ерусалим: 'Ти ке бидеш одново изграден!' и на храмот 'ти ке бидеш основан!'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view45() {
struct mk45 poems[] = {
	{1, "1 Вака му вели Господ на Својот помазаник Кира: 'Те држам за десната рака, за да ти покорам народи, и ке ги симнам појасите од бедрата на царевите, за да ти се отворат вратите, и портите да не бидат затворени."},
	{2, "2 Пред тебе ке одам, планини ке рамнам, бакарни врати ке разбивам и железни резиња ке кршам;"},
	{3, "3 тебе ке ти ги предадам чуваните во темно богатства и сокриените добра, за да познаеш, дека Јас сум Господ. Кој те нарекувам по име, - Бог Израилев."},
	{4, "4 Заради Јакова, Мојот слуга и Израилот, Мојот избраник, Јас го нареков по име, те почитував, иако не Ме познаваше."},
	{5, "5 Јас сум Господ и нема друг; нема Бог освен Мене; Јас те препашав, иако не ме познаваше,"},
	{6, "6 за да дознаат од изгрев сонце и од запад, дека нема друг освен Мене: Јас сум Господ, и нема друг."},
	{7, "7 Јас ја создавам светлината и ја правам темнината, правам мир и причинувам невољи. Јас, Господ го вршам сето тоа."},
	{8, "8 Росете, небеса, одозгора, и облаците нека изливаат правда; нека се растфвори земјата и нека донесува спасение, заедно да произлегува и правдата. Јас, Господ, го правам тоа."},
	{9, "9 Тешко му на оној, кој се расправа со Создателот свој! Црепче од земни садови со други такви парчиња! Kе му каже ли глината на грнчарот: 'што правиш' и твоето дело ке каже ли за тебе: 'тој нема раце?'"},
	{10, "10 Тешко му на оној, кој му вели на татка си: 'зошто си ме создал на светов', а на мајка си: 'зошто си ме родила?'"},
	{11, "11 Вака вели Господ, Светецот Изралев и неговиот Творец: 'Kе ме прашате ли за иднината на синовите Мои и ке сакате ли да ми се мешате во делото на рацете Мои?"},
	{12, "12 Јас ја создадов земјата и го создадов на неа човекот; Јас - Моите раце ги простреја небесата; и на сета нивна војска Јас им дадов закон."},
	{13, "13 Јас го подгинав во правда и ке ги израмнам сите патишта негови. Тој ке го изгради Мојот град и ке ги отпушти заробените Мои не за откуп, ниту за дарови, вели Господ Саваот."},
	{14, "14 Вака вели Господ: печалбите на Египтјаните и трговијата на Етиопијците, и Савејците, лу е силни, кои тебе ке преминат и твои ке бидат, во вериги ке дојдат, ке паднат пред тебе ничкум и ке те молат, велејки: само ти имаш Бог, и нема друг Бог.'"},
	{15, "15 Вистина, Ти си Бог сокриен, Бог Израилев, Спасител."},
	{16, "16 Сите тие ке бидат посрамени и засрамени; заедно со нив ке отидат со срам и сите оние што прават идоли."},
	{17, "17 А Израилот ке биде спасен со вечно спасение од Господа; вие нема да бидете посрамени и осрамотени во веки веков."},
	{18, "18 Зашто вака вели Господ, Кој го создаде небото, Он, Бог, Кој и даде облик на земјата и Кој ја создаде; Он ја зацврсти, не ненадејно ја создаде; Он ја создаде за живеење. Он вели: Јас сум Господ, и нема друг."},
	{19, "19 Не говорев тајно Јас, не во темно место на земјата; не му реков на Јакововото племе: 'напразно Ме барате.' Јас сум Господ, Којшто изрекува правда, Којшто ја открива вистината."},
	{20, "20 Соберете се и дојдете, приближете се сите, преживеани од народите. Неразбрени се оние, што го носат својот дрвен идол и се молат на бог, кој не спасува."},
	{21, "21 Објавете и кажете, откако ке се посоветувате ме у себе: кој го кажа тоа од стари времиња? Кој однапред го кажал тоа? Нели Јас, Господ, Нема друг Бог освен Мене, - Бог праведен и Кој спасува, нема освен Мене."},
	{22, "22 Кон Мене обрнете се, и ке бидете спасени, сите краишта земни, зашто Јас сум Бог и нема друг како Мене."},
	{23, "23 Се колнам во Себе Самиот: од уста Моја излегува правда, збор неизменлив, дека пред Мене ке се преклони секое колено, во Мене ке се колне секој јазик."},
	{24, "24 Само во Господа, ке велат за Мене, има правда и сила; при Него ке дојдат и ке се засрамат сите, што непријателствувале против Него."},
	{25, "25 Преку Господа ке биде оправдано и прославено целото племе Израилево."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view46() {
struct mk46 poems[] = {
	{1, "1 Падна Вил, се собори Нево; идолите им се врз добитокот и товарните животни; вашиот товар стана бреме за уморените животни."},
	{2, "2 Се навалија, паднаа одеднаш; не можеа да ги зачуваат оние, што ги носеа, и сами паднаа во ропство."},
	{3, "3 Послушај Ме, доме Јаковов и сиот остаток од домот Израилев, кого го носам од утробата, кого го држав од ра ањето;"},
	{4, "4 и до вашата старост Јас ке бидам Истиот, до вашите бели коси ке ве носам; Јас ве создадов и ке ве носам, ке ве поддржам и ке ве пазам."},
	{5, "5 Со кого ке Ме изедначите, и ке Ме споредите? Кого ке го земете за пример да прилега на Мене?"},
	{6, "6 Истураат злато од торбичката и премеруваат сребро на терезии, па најмуваат златар, за да направи од него бог, му се клањаат и ничкум па аат пред него;"},
	{7, "7 го креваат на рамо, го носат и го ставаат на местото негово; тој стои, од местото свое не се помрдунува; му викаат, - тој не одговара, од невоља не спасува."},
	{8, "8 Спомнете си го тоа и покажете се мажи; земете го тоа при срце, отстапници;"},
	{9, "9 спомнете си за она што било порано, од крајот на векот; земете го тоа при срце, зашто Јас сум Бог и нема друг Бог и нема подобен на Мене."},
	{10, "10 Јас го навестувам во почетокот она што ке биде на крајот, од старо време она што уште не станало, па велам: 'Мојата одлука ке се изврши, и се што Ми е угодно - ке го направам.'"},
	{11, "11 Јас го повикав орелот од исток, од далечна страна, исполнителот на Мојата воља. Јас реков - и ке го извршам тоа; замислив - и ке го направам."},
	{12, "12 Послушајте Ме, жестокосрдни, вие, кои сте далеку од правдата:"},
	{13, "13 Ја приближив Мојата правда - таа не е далеку, спасението од Мене нема да се забави; и ке му дадам на Сион спасение, на Израилот - Својата слава."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view47() {
struct mk47 poems[] = {
	{1, "1 Слези и седни во прав, о, девице, керко вавилонска; седни на земја: престол нема, керко халдејска, и во иднина нема да те нарекуваат нежна и милолика."},
	{2, "2 Земи рачници и мели брашно; симини го превезот, засукај ракави, разголи ги нозете, гази преку река:"},
	{3, "3 твојата голитија ке се открие, и ке се види твојата срамотија. Kе се одмаздам и никој нема од тоа да ме одврати."},
	{4, "4 Нашиот Избавител - името Му е Господ Саваот - е Светецот Израилев."},
	{5, "5 Седи молкум и прибери се во темнината, керко халдејска, зашто во иднина нема да те нарекуваат господарка на царствата."},
	{6, "6 Јас се разгневив на Својот народ, и го предадов наследството Свое, што го оскревни ти, во твои раце; а ти не им покажа милост, на старците им го стави најтешкото твое иго."},
	{7, "7 И си велеше: 'Вечно ке бидам господарка', и на ум не го ставаше ова, не помислуваше што ке стане потоа."},
	{8, "8 Но сега ислушај го ова, ти, развратнице, која живееш безгрижно, која седиш и велиш во срцето: 'Јас сум, и нема друга како мене: нема да останам вдовица, ниту ке осиромашам.'"},
	{9, "9 Но ненадејно, во еден ден, ке те снајде и едното и другото - загубата на децата и вдовството; во полна мера ке те снајдат тие, при сето множество на твоите магесништа и големата сила на твоите ма ии."},
	{10, "10 Зашто ти се надеваше на своето злодејание и велеше: 'Никој не ме гледа.' твојата мудрост и твоето знаење - тие те отстранија од патот, а ти си велеше во срцето свое: 'Јас сум, и нема друга како мене.'"},
	{11, "11 Kе дојде на тебе зло: нема да знаеш, од каде доа а тоа; ке те снајде беда, кој не ке можеш да ја отфрлиш; и ненадејно ке те стигне погибел, за која и не мислиш."},
	{12, "12 Стој си, пак, со твоите ма ии и со многуте баења, со кои си се занимавала до млади години: можеби - ке си помогнеш, можеби - ке се одржиш."},
	{13, "13 Ти си умрона од многу замисли; нека излезат оние, што го набљудуваат небото, sвездобројачите и претскажувачите по новомесечијата, нека те спасат од она, што треба да ти се случи."},
	{14, "14 Ете, тие се како слама: оган ке ги изгори; не ја спасија душата своја од пламенот; не остана јаглен да се погрее некој, ниту оган, за да се поседи крај него."},
	{15, "15 Такви ке бидат оние, за кои си се грижела, со кои си тргувала од млади години. Секој тргнал по својот пат; никој не те спасува."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view48() {
struct mk48 poems[] = {
	{1, "1 Слушај го ова, доме Јаковов, вие, кои се нарекувате со името на Израилот и кои сте произлегле од Јуда, кои се колнете во името Господово, го спомнувате Бога Израилев, иако не по вистина и не по правда."},
	{2, "2 Зашто тие се нарекуваат по светиот град и се потпираат на Бога Израилев; Господ Саваот е името Негово."},
	{3, "3 Поранешното Јас однапред го кажував, и она што од устата Моја излегуваше и Јас го навестував и брзо го вршев, - и се се извршуваше."},
	{4, "4 Јас знаев, дека ти си упорен и дека во твојот врат има железни жили, и челото ти е бакарно;"},
	{5, "5 затоа и ти јавував од рано, пред да се случи тоа, и ти навестував, за да не речеш: 'Мојот идол го направи тоа, мојот идол и мојот излеан лик заповеда тоа да стане.'"},
	{6, "6 Ти си слушал - погледај го сето тоа! И зар нема да го признаете тоа? А сега те известувам за нешто ново и сокриено, што ти не си го знаел."},
	{7, "7 Тоа се изврши сега, а не одамна и не пред еден ден, и ти не си слушал за него, за да кажеш: 'Ете, јас го знаев тоа.'"},
	{8, "8 Ти не си слушал, ниту си знаел за тоа, и увото твое порано не беше отворено; зашто Јас знаев, дека ти ке постапиш вероломно; од самата мајчина утроба си наречен отстапник."},
	{9, "9 Заради името Свое го одлагав Својот гнев и заради славата Своја се воздржував да не те истребам."},
	{10, "10 Ете, те растопив, но не како сребро, те испитав во печката на страдањата."},
	{11, "11 Заради Себе, заради Самиот Себе го вршам тоа, - зашто, каква навреда би била за името Мое! Славата Своја нема да ја дадам на друг."},
	{12, "12 Чуј Ме, Јакове и Израиле, повикан од Мене: Јас сум истиот, Јас сум првиот и Јас последниот."},
	{13, "13 Мојата рака ја основа земјата, Мојата десница го распростре небото; ке ги повикам, - и тие ке застанат заедно."},
	{14, "14 Соберете се сите и слушајте: кој од нив го претскажал ова? Господ го возљуби, и тој ке ја исполни вољата Негова над Вавилон и ке ја јави мишката Своја над Халдејците."},
	{15, "15 Јас, Јас реков, и го повикав; Јас го доведов, патот негов ке биде успешен."},
	{16, "16 Пристапете кон Мене, слушајте го ова: Јас и во почетокот говорев не тајно; од она време, откако се извршува тоа, Јас бев таму; и сега Ме испрати Господ Бог и Неговиот дух."},
	{17, "17 Вака вели Господ, твојот Искупител, Светецот Израилев: Јас сум Господ, Бог твој, Кој те учи на добро, Кој те води по оној пат, по кој треба да одиш."},
	{18, "18 О, да беше ги слушал Моите заповеди! Тогаш твојот мир ке беше како река, и тојата правда - како морски бранови."},
	{19, "19 И твоето потомство би било како песок, а породот од утробата твоја, - како зрнцата негови: името твое не би се истребило нити избришало пред Мене."},
	{20, "20 Излегувајте од Вавилон, бегајте од Халдејците, со радосен глас разгласувајте и проповедајте го тоа, ширете ја таа вест до крајот на земјата; кажувајте: 'Господ го откупи Својот слуга Јакова.'"},
	{21, "21 Не ожеднуваат тие во пустињите, преку кои ги води: Он им извади вода од камен; пресекува карпа, - и се леат води."},
	{22, "22 А за лошите нема мир, вели Господ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view49() {
struct mk49 poems[] = {
	{1, "1 Слушајте Ме, острови, и внимавајте, народи далечни: Господ Ме повика уште од утробата, од мајчината Ми утроба го нарече името Мое;"},
	{2, "2 ја направи устата Моја како остар меч: под сенката на раката Своја Ме криеше и Ме направи изострена стрела; во Својата торба за стрели Ме чуваше;"},
	{3, "3 Он Ми рече: 'Ти си Мој слуга, Израиле, - во тебе ке се прославам.'"},
	{4, "4 Јас, пак, реков: 'Напразно сум се трудел, за ништо и попусто сум ја истрошувал силата Своја. Но правото Мое е во Господа, и наградата Моја е во Мојот Бог."},
	{5, "5 А сега вели Господ, Кој уште од утробата ме направи слуга Свој, да го вратам кон Него Јакова, за да се собере при Него Израилот; а кога ке се собереме, ке се прославам во Господа и Мојот Бог ке биде сила Моја."},
	{6, "6 И Он рече: 'Малку е, тоа што Ти ке ми бидеш слуга, за да се подигне племето Јаковово и да се поврати остатокот Израилев, туку Јас ке те направам светило за народите, за да се рашири спасението од Господа до краиштата на земјата."},
	{7, "7 Така вели Господ, Искупителот на Израилот, Светецот негов, на презираниот од сите, на прекоруваниот од народот, на слугата на силните: царевите ке Те видат и ке станат кнезови ке се поклонат заради Господа, Кој е верен, заради Светецот Израилев, Кој Те избрал."},
	{8, "8 Вака вели Господ: 'Во благопријатно време Те чув и во денот на спасението Ти помогнав; и Јас ке те пазам и ке Те направам завет на народот, за да ја востановиш земјата, да им ги вратиш на наследниците опустошените наследства."},
	{9, "9 Да им кажеш на затворените: излезете, и на оние, што се во темнина: покажете се. Крај патиштата ке пасат тие, по сите ридови ке бидат нивните пасишта;"},
	{10, "10 Нема да трпат глад и жед, нема да ги удри припек и сонце; зашто Оној, Кој ги милува, ке ги води и ке ги доведе при извори водни."},
	{11, "11 И сите Мои гори ке ги направам друмови, Моите патишта ке бидат издигнати."},
	{12, "12 Ете, едни ке дојдат оддалеку; и ете - едни од север и од морето, а други - од земјата Синим."},
	{13, "13 Радувајте се, небеса, и весели се, земјо; воскликнувајте од радост гори, зашто Господ го утеши Својот народ и ги помилува Своите страдалници."},
	{14, "14 А Сион велеше: 'Ме остави Господ, мојот Бог ме заборави!'"},
	{15, "15 Може ли жена да го заборави породот свој, а да не се смилува на чедото од утробата своја? А и кога би го заборавила, Јас тебе нема да те заборавам."},
	{16, "16 Ете, на Своите дланки сум те забележал; твоите sидишта секогаш се пред Мене."},
	{17, "17 Твоите синови ке побрзаат кон тебе, а твоите разурнувачи и опустошители ке си отидат од тебе."},
	{18, "18 Крени ги очите и погледај наоколу, - тие сите се собираат, доа аат кон тебе. Жив сум Јас! вели Господ, - со сите нив ке се облечеш како со накит и ке се промениш со нив како невеста."},
	{19, "19 Зашто твоите урнатини, твоите пустињи и твојата разорена земја сега ке бидат многу тесни за жителите, за оние, што те голтаа, ке си отидат од тебе."},
	{20, "20 Децата, што ги имаш, бидејки си ги изгубила поранешните, ке ти говорат гласно: 'Тесно е местото за мене; отстапи ми, за да можам да живеам.'"},
	{21, "21 И ти ке речеш во срцето свое: кој ми ги роди? Јас бев бездетна и бесплодна, одведена во плен и оддалечена; но, кој ги одгледа - ете, јас си останувам сама; а тие каде беа?"},
	{22, "22 Вака вели Господ Бог: 'Ете, ке ја кренам раката Своја кон народите, ке го издигнам знамето Свое пред племињата, - и ке ги донесат синовите твои на раце и керките твои - на раменици."},
	{23, "23 И царевите ке бидат твои хранители, и нивните царици ке бидат твои доилки; со лицето до земјата ке ти се клањаат и ке го лижат правот од нозете твои, и ке дознаеш, дека сум Јас Господ, дека оние, што се надеваат на Мене, нема да се посрамат."},
	{24, "24 Може ли да се одземе плен од силен, и можат ли да се одземат заробени од победникот?'"},
	{25, "25 Да, така вели Господ: и секој заробен од исполин ке биде одземен и грабежот од тиранинот ке биде вратен; зашто Јас се борам со твоите противници и ке ги спасам твоите синови;"},
	{26, "26 ке ги нахранам твоите угнетувачи со нивното сопствено месо, ке бидат напоени со својат крв како со ново вино; и секое тело ке дознае, дека Јас сум Господ, твој Спасител и твој Искупител, Силниот Бог Јаковов."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view50() {
struct mk50 poems[] = {
	{1, "1 Вака вели Господ: 'Каде е разводното писмо за вашата мајка, со која ја отпуштив? Или на кого од моите зајмодавачи ве продадов? Ете, вие сте продадени заради гревовите свои, и заради вашите престапи мајката ваша е отпуштена."},
	{2, "2 Зошто кога дојдов, немаше никого? И кога повикав, никој не се одsва? Зар раката Моја се скратила, та не може да избавува или во Мене нема сила да спасувам? Ете, со заплашувањето Свое море пресушувам, претворам реки во пустиња; рибите во нив гнијат поради недостиг на вода и умираат од жед."},
	{3, "3 Јас ги обекува небесата во мрак и кострет им правам за покривка."},
	{4, "4 Господ Бог ми даде вешт јазик, за да можам со зборови да го покрепувам изнемоштениот: секое утро Он го разбудува името Мое, за да слушам како оние што се учат."},
	{5, "5 Господ Бог ми го отвори увото, и јас не се спротивставив, не остапив назад."},
	{6, "6 Грбот Свој го подметнав на оние што Ме биеја, и образите свои - на оние што Ме удираа; лицето Свое не го скрив од подбив и плукање."},
	{7, "7 И Господ Бог ми помага: затоа не се срамувам, зато го држам лицето Свое како кремен, и знам дека нема да останам посрамен."},
	{8, "8 Близу е Оној, Кој Ме оправдува: кој сака да се натпреварува со Мене? Да застанеме заедно. Кој сака да се суди со Мене? Нека пристапи кон Мене."},
	{9, "9 Ете, Господ Бог Ми помага: Кој ке ме осуди? Ете, сите тие како облека ке изветвеат; молец ке ги изгризе."},
	{10, "10 Кој од вас се плаши од Господа, го слуша гласот на Неговиот Син? Кој оди во мрак, без светлина, да се надева на името Господово и да се потпира врз својот Бог."},
	{11, "11 Ете, сите вие што палите оган, кои сте вооружени со запалени стрели - одите во пламенот на вашиот оган и на стрелите, што сте ги вжештиле! Тоа ке ви биде од Мојата рака: во маки ке умрете.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view51() {
struct mk51 poems[] = {
	{1, "1 Послушајте Ме вие, што копнеете за правда, вие кои Го барате Господа! Погледајте ја карпата, од која сте исечени, и по длабочината на трапот, од кој сте извлечени."},
	{2, "2 Погледајте го Авраама, вашиот татко, и на Сара, која ве родила; зашто Јас го повикав него единствениот, го благословив и го умножив."},
	{3, "3 Така, Господ ке го утеши Сион, ке ги утеши сите негови урнатини и ке ги направи пуситњите негови како рај и степите негови - како градина Господова; радост и веселба ке има во него, славословие и пеење на песни."},
	{4, "4 Послушајте Ме, народе Мој и племе Мое, приконете го увото кон Мене! Зашто од Мене ке излезе закон и Мојот суд ке го поставам за светлина на народите."},
	{5, "5 Мојата правда брзо ке стигне; Моето спасение изгрева и Мојата мишка ке ги суди народите; островите ке се надеваа на Мене и ке се надеваат на мишката Моја."},
	{6, "6 Кренете ги очите кон небото и погледајте на земјата долу: зашто небото ке изчезне како дим, и земјата ке изветви како облека, а жителите нејзини исто така ке изумрат; а Јас ке спасувам вечно, правдата Моја нема да престане."},
	{7, "7 Послушајте Ме, вие, кои ја познавате правдата, народе, Кој во срцето свое го имаш Мојот закон! Не плашете се од прекорување на лу ето, ниту стравувајте од злословието нивно."},
	{8, "8 Зашто молец ке ги изеде како облека и црв ке ги изеде како волна; а Мојата правда ке преуспее засекогаш, и Моето спасение - од род во род."},
	{9, "9 Крени се, крени, облечи се во сила, мишко Господова! Дигни се, како во древните дни, во дамнешните родови! Зар не го уништи ти Рава, зар не го порази змејот?"},
	{10, "10 Не го исуши ли морето, водите и големата бездна, не ги претвори ли морските длабочини во пат, за да поминат искупените?"},
	{11, "11 Kе се вратат избавените од Господа, и ке дојдат на Сион со пеење, и вечна радост ке има над главата нивна; тие ке најдат радост и веселба; скрбта и воздишките ке изчезнат."},
	{12, "12 Јас, Јас Самиот сум ваш Утешител. Кој си ти, та се плашиш од човек, кој умира, и од човечки син, кој е исто она што е и тревата?"},
	{13, "13 Го забораваш Господа, својот Творец, кој го прострел небото и ја основал земајта; и непрестајно, секој ден се плашиш од јароста на угнетувачот, како да е готов тој да истреби? Но каде е сега јароста на угнетувачот?"},
	{14, "14 Скоро ке биде ослободен заробениот, и нема да умре во јамата, ниту ке има потреба од леб."},
	{15, "15 Јас сум Господ твој, Кој го бранува морето, та брановите негови викаат: Господ Саваот е името Негово."},
	{16, "16 И Јас ке ги вложам Моите слова во устата твоја, и со сенката на раката Своја ке те покријам, за да го устројам небото и да ја утврдам земјата и да му кажам на Сион: 'Ти си Мој народ.'"},
	{17, "17 Разбуди се, разбуди се, стани, Ерусалиме, ти, кој од раката на Господа ја испи чашата на јароста Негова, до дното си ја испил и исушил чашата што опива."},
	{18, "18 Ме у сите синови, од него родени, нема кој да го води, и ме у сите синови, од него одгледани, нема кој за рака да го придржи."},
	{19, "19 Тебе те снајдоа две невољи, кој ке те пожали? - Опустошување и истребување, глад и меч: кој ке те утеши."},
	{20, "20 Синовите твои изнемоштеа, лежат по аглите на сите улици, како срна во стапица, исполнети со гнев Господов, со заплашување од твојот Бог."},
	{21, "21 И така, ислушај го ова ти, кој си страдалник и пијан, но не од вино."},
	{22, "22 Вака вели Господ твој, Господ и Бог твој, Кој одмаздува за Својот народ: 'Ете, јас земам од раката твоја чаша што опива, од чашата на Мојата јарост ти веке нема да пиеш."},
	{23, "23 Kе ја дадам во раката на твоите мачители, кои ти велеа: ‘Падни ничкум, за да минам по тебе‘; и ти го правеше грбот свој како земја и како улица за минувачите.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view52() {
struct mk52 poems[] = {
	{1, "1 Дигни се, дигни, облечи се во силата своја, Сионе! Облечи се во облеката на величието свое, Ерусалиме, свети граде! Зашто отсега нема повеке да влегува во тебе необрезан и нечист."},
	{2, "2 Истреси го од себе правот; стани, заробени Ерусалиме! Симни ги веригите од вратот свој, заробена керко Сионова!"},
	{3, "3 Зашто вака вели Господ: 'За ништо бевте продадени, и без сребро ке бидете откупени.'"},
	{4, "4 И уште вака вели Господ Бог: 'Народот Мој одеше порано во Египет, за да поживее таму, а Асур го притеснуваше без причина."},
	{5, "5 А сега што имам тука - вели Господ: 'Народот Мој е земен даром, владетелите нивни беснеат, вели Господ, и постојано, секој ден, името Мое се навредува."},
	{6, "6 Затоа Мојот народ ке го познае името Мое; затоа ке разбере во оној ден, дека Јас сум истиот, Кој вели: 'еве Ме!'"},
	{7, "7 Колку се прекрасни врз горите нозете на благовесникот, кој навестува мир, благовестува радост, проповеда спасение, кој му говори нс Сион: 'Твојот Бог се зацари!'"},
	{8, "8 Ете го гласот на твоите стражи! Тие кренаа глас, и сите заедно ликуваат, зашто со очите свои гледаат, дека Господ се врака во Сион."},
	{9, "9 Веселете се, пејте заедно, урнатини ерусалимски, зашто Господ го утеши народот Свој - го откупи Ерусалим."},
	{10, "10 Ја засука Господ Својата света мишка пред очите на сите народи, - и сите краишта земни ке го видат спасението од нашиот Бог."},
	{11, "11 Одете си, одете си, излезете оттаму; не допирајте се до нечисто; излезете од средината негова, очистете се, вие што носите садови Господови!"},
	{12, "12 Зашто нема да излезете набргу и нема да избегате; оти пред вас ке тргне Господ, и Бог Израилев ке биде зад вас."},
	{13, "13 Ете, Мојот слуга ке успее, ке се воздигне, ке се возвиси и возвеличи."},
	{14, "14 Како што мнозина беа зачудени, гледајки во Него - толку ликот Негов беше обезличен повеке, отколку на секој човек, и видот Негов - повеке, отколку на синовите човечки, - !"},
	{15, "15 така ке зачуди многу народи, цареви ке ја затвораат пред Него устата своја, зашто ке го видат она, за кое не им било говорено, и ке го дознаат она што не го слушнале."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view53() {
struct mk53 poems[] = {
	{1, "1 Господи, Кој поверува на тоа, што го чул од нас и кому му се откри силата Господова?"},
	{2, "2 Зашто изникна Он пред него како младо дрвце и како стебленце од сува земја; нема во Него ни изглед, ниту величие; ние Го видовме, и во Него немаше изглед, што ке не привлекува кон Него."},
	{3, "3 Он беше презрен и понизен ме у лу ето, маж на болки и свикнат на страдања, и ние го одвракавме од Него лицето свое; Он беше презиран, и ние за ништо не Го сметавме."},
	{4, "4 Но Он ги зеде врз Себе нашите болки и ги понесе нашите слабости; а ние мислевме, дека Он беше поразуван, казнуван и понизуван од Бога."},
	{5, "5 А Он беше изнаранет за нашите гревови и мачен заради нашите беззаконија; казната за нашиот мир падна врз Него, а преку Неговите ради ние се излекувавме."},
	{6, "6 Сите ние бевме заблудени како овци, се отстрани секој од патот свој, - и Господ ги возложи врз Него гревовите на сите нас."},
	{7, "7 Он беше измачуван, но стадаше доброволно и устата Своја не ја отвораше; како овца Он беше одведен на колење, и како што е јагнето пред стрижачите свои безгласно, така и Он не ја отвори устата Своја."},
	{8, "8 Он беше лишен од праведен суд. Но родот Негов Кој ке го објасни? Зашто беше одземен од земјата на живите; заради беззаконијата на Мојот народ беше осуден на смрт."},
	{9, "9 Му определија гроб со злодејци, но Он беше погребан кај богатиот, зашто не беше направил грев и во устата негова немаше лага."},
	{10, "10 Но на Господа му беше угодно да Го понизи, и Го предаде на мачење; а кога душата Негова Му принесе милоствна жртва, Он ке види долговечно потомство, и вољата Господова ке напредува преку Неговата рака."},
	{11, "11 Kе се зарадува поради трудот на душата Своја ке види светлина. Праведниот Слуга Мој ке ги оправда мнозина и гревовите нивни врз Себе ке ги понесе."},
	{12, "12 Затоа Јас ке Му дадам големо наследство, со силните плен ке дели, зашто душата Своја на смрт ја предаде, и ме у злодејците беше вброен и ги понесе врз Себе гревовите на мнозина и за престапниците стана посредник."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view54() {
struct mk54 poems[] = {
	{1, "1 Развесели се, ти неплодна, што не ра аш; воскликни и извикај ти, кој не си почувствувала родилни маки; зашто напуштената има многу повеке деца од онаа, кој има маж, вели Господ."},
	{2, "2 Рашири го местото на шаторот свој; покривите твои на живелиштето твое прошири ги продолжи ги јажињата свои и зацврсти ги колците свои;"},
	{3, "3 зашто ти ке се рашириш десно и лево, и потомството твое ке завладее народи и ке ги насели опустошените градови."},
	{4, "4 Не плаши се, зашто нема да бидеш посрамена; не се возбудувај, оти нема да биде исмеана: ке го заборавиш посрамувањето на младоста своја и нема повеке да си помниш за бесчесноста на вдовството твое."},
	{5, "5 Зашто твојот Творец е твојот сопруг; Господ Саваот е името Негово, твој искупител е Светецот Израилев: Он ке се нарече Бог на целата земја."},
	{6, "6 Зашто Господ те вика како жена, напуштена и жална со духот, како жена од младини, кој била отфрлена, вели твојот Бог."},
	{7, "7 За малку време те оставив, но со голема милост ке те приберам."},
	{8, "8 Во пламенот на гневот го сокрив од тебе лицето Свое за кратко време, но со вечна милост ке те помилувам, вели твојот Искупител Господ."},
	{9, "9 Оти тоа за Мене е како потоп на Ное: како што се заколнав, дека потоп нема повеке да дојде на земјата, така се заколнав дека нема да ти се лутам, ниту да те прекорувам."},
	{10, "10 Планини ке се поместат, и ридови ке се разнишаат, но Мојата милост нема да отстапи од тебе и заветот на Мојот мир нема да се разниша, вели Господ, Кој те милува."},
	{11, "11 О, неволна, потфрлена од виорот, неутешна! Ете, Јас ке ги положам твоите камења врз рубин и ке ги направам твоите основи од сапфири;"},
	{12, "12 и ке ги направам твоите прозорци од рубини и твоите порти - од бисер, а целата ограда твоја - од скапоцени камења."},
	{13, "13 И сите твои синови ке бидат научени од Господа, и голем мир ке има ме у синовите твои."},
	{14, "14 Ти ке се утврдиш со правда, ке бидеш далеку од насилствата, бидејки ке нема од што да се плашиш, далеку ке биде од тебе и ужасот, зашто тој нема да се приближи до тебе."},
	{15, "15 Ете, ке се вооружат против тебе, но тоа не е од Мене; кој и да се вооружи против тебе, ке падне."},
	{16, "16 Ете, Јас создадов ковач, кој го раздувува јагленот во огнот и ке произведува сечила за својата работа, - и Јас сум создател и губител, Кој истребува."},
	{17, "17 Ниедно оружје, направено против тебе, нема да има успех; и секој јазик, кој би се подигнал против тебе на суд, - ти ке го обвиниш. Тоа е наследство на слугите Господови, нивно оправдание од Мене, вели Господ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view55() {
struct mk55 poems[] = {
	{1, "1 Вие, што жедувате, дојдете сите при водите; дури и вие, кои немате сребро, дојдете, купувајте и јадете; дојдете, купувајте вино и млеко без сребро и без плакање."},
	{2, "2 Зошто да давете сребро за она, што не е леб, и заработката своја - за она, што не наситува? Послушајте Ме внимателно и јадете, што е добро, и душата ваша нека се наслади со мрс."},
	{3, "3 Приклонете го увото и дојдете при Мене; послушајте, и душата ваша ке биде жива, - ке ви дадам вечен завет, неизменливи милости, ветени на Давида."},
	{4, "4 Ете, Него го дадов сведок за народите, водач и заповедник на народите."},
	{5, "5 Ете, ти ке повикаш народ, што не си го познавал, и народите, кои не те познавале, ке побрзат кон тебе, заради Господа, твојот Бог, заради светецот Израилев, зашто Он те прослави."},
	{6, "6 Барајте го Господа, кога можете да Го најдете; викајте Го додека е близу."},
	{7, "7 Нечесниот нека го остави патот свој, и беззаконикот - помислите свои и нека се обрне кон Господа, нашиот Бог, - и Он ке го помилува, зашто е многу милостив."},
	{8, "8 Моите мисли не се ваши мисли, миту вашите патишта се Мои патишта, вели Господ."},
	{9, "9 Но, како што е небото повисоко од земјата, така се и Моите патишта повисоки од вашите патишта, и мислите Мои повисоко од вашите мисли."},
	{10, "10 Како што дождот и снегот па аат од небото и таму не се вракаат, туку ја напојуваат земјата и ја прават способна да ра а и да се зеленее, за да му дава семе на оној, што сее и леб на оној, кој јаде,"},
	{11, "11 така и Моето слово, што излегува од устата Моја, не се врака кон Мене празно, туку го исполнува она, што му е угодно, и го прави она за што сум го испратил Јас."},
	{12, "12 И така, вие ке излезете во веселба и ке бидете испратени со мир; горите и ридовите ке пеат песна пред вас, и сите дрвја во полето ке ракоплескаат."},
	{13, "13 Место трн ке израсне кипарис; место коприва ке израсне мирта; и тоа ке биде за слава на Госпдоа, за вечен знак, неразрушив."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view56() {
struct mk56 poems[] = {
	{1, "1 Вака вели Господ: пазете го правосудството и вршете правда; зашто е близу спасението од Мене и откровението на Мојата правда."},
	{2, "2 Блажен е човекот, кој го прави тоа и синот човечки, кој здраво се придржува за тоа, кој пази на саботата за да не ја оскверни и ја чува раката своја - за да не врши никакво зло."},
	{3, "3 Синот на другоплеменикот, кој се присоединил кон Господа, да не вели: 'Господ сосема ме оддели од Својот народ', и евнухот да не рече: 'Ете, јас сум суво дрво.'"},
	{4, "4 Зашто вака вели Господ за евнусите: 'Оние што ги пазат Моите саботи и го избираат она, што Ми е Мене угодно, оние што цврсто се придржуваат за заветот Мој, -"},
	{5, "5 ним ке им дадам во домот Свој и во sидините Свои место и име подобро, отколку на синовите и керките: ке им дадам вечно име, кое нема да биде истребено.'"},
	{6, "6 И синовите на другоплемениците, што се присоединиле кон Господа, за да Му служат и да го сакаат името на Господа, да бидат слуги Негови, - сите кои ја пазат саботата да не ја осквернат и цврсто се придржуваат за заветото Мој,"},
	{7, "7 Јас ке ги одведам на Мојата света гора и ке ги зарадувам во Мојот дом за молитва: сепалениците нивни и жртвите нивни ке бидат благопријатни врз Мојот жртвеник, зашто Мојот дом ке се нарече молитвен дом за сите народи."},
	{8, "8 Господ Бог, Кој ги собира распраснатите Израилци, вели: кон собраните кај Израилот ке собирам и други."},
	{9, "9 Дојдете да јадете вие, сите sверови полски, сите sверови шумски!"},
	{10, "10 Стражите нивни сите се слепи и неразумни: сите тие се неми пци, кои не можат да лаат, но лежејки бладаат и кои сакаат да спијат."},
	{11, "11 Тоа се пци со ненеситна душа, кои не знаат ситост; и тоа се пастири неразумни: сите, од првиот до последниот, го гледаат својот пат, својата заработка:"},
	{12, "12 'Дојдете - велат - ке донесеме вино, ке се напиеме сикер; и утре ке биде истото она што и денес, дури и повеке отколку денес.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view57() {
struct mk57 poems[] = {
	{1, "1 Праведниот умира и никој не се загрижува; и благочестиви мажи се грабат за земјата, и никој не помислува дека праведникот од зло се оттргнува."},
	{2, "2 Тој оди во мир; оние што одат по правиот пат, ке почиваат на леглата свои."},
	{3, "3 Но приближете се вие тука, синови на ма епсница, семе на прељубодеец и блудница!"},
	{4, "4 Со кого се подбивате? Против кого отворате уста и го покажувете јазикот? Не сте ли деца на престап, семе на лагата,"},
	{5, "5 кои сте запалени од похотта кон идоли под секое гранчесто дрво, кои колете деца покрај потоци, ме у пукнатини на карпи?"},
	{6, "6 Во мазните камења на потоците е твојот дел; тие, тие се твој жреб, ним им правиш ти прелив и им принесуваш жртва: можам ли Јас да бидам од тоа задоволен?"},
	{7, "7 На висока и голема планина го поставуваш леглото свое, и таму е качуваш да принесуваш жртва."},
	{8, "8 Зад вратата и зад довратниците ги ставаш твоите спомени; зашто, кога ке се одвратиш од Мене, ти се разголуваш и се качуваш; го прошируваш леглото свое и се договараш со оние од нив, со кои сакаш да лежиш и го погледнуваш местото."},
	{9, "9 Ти си одела и кај царот со миризливо масло и си ги умножувала твоите мириси, и далеку си ги испракала своите гласници и си се понижувала до пеколот."},
	{10, "10 Од долгиот пат ти си се заморувала, но не рече: 'Надежта е изгубена!' Се уште си нао аш живот во раката своја, и затоа не почувствува слабост."},
	{11, "11 А од кого се уплаши и застраши, па стана неверна и престана да Ме помниш и да пазиш во срцето свое? Не е ли затоа што Јас молчев, што молчев долго, та ти престана да се плашиш од Мене?"},
	{12, "12 Kе ја објавам твојата правда и твоите дела, и тие нема да бидат во твоја полза."},
	{13, "13 Кога ке повикаш, ке те спаси ли она што си го собрала? - Сето тоа ветрот ке го однесе, ке го развее; а кој се надева на Мене, ке ја наследи земјата и ке ја владее Мојата света гора."},
	{14, "14 Kе се рече: 'Срамнете, рамнете, израмнете го патот, кревајте ги пречките од патот на Мојот народ.'"},
	{15, "15 Зашто вака вели Високиот и Возвишениот, вечно Живиот Светец и Неговото име: 'Јас живеам на небесната височина и во светилиштето, но сум со оние што имаат скрушено срце и смирен дух, за да го оживувам духот на смирените и да ги ожувувам срцата на скрушените."},
	{16, "16 Зашто нема вечно да се заканувам, ниту докрај да се гневам; инаку ке паден пред Мене секој дух и секој здив што сум го создал."},
	{17, "17 Заради беззаконието на неговата лакомост Јас се разгневив и го поразив, се сокрив и негодував; но тој откако се одврати, отиде по патот на срцето свое."},
	{18, "18 Ги видов патиштата негови, но ке го излекувам, ке го водам и ке го утешувам, него и оние што го жалат."},
	{19, "19 Јас ке го исполнам словото: мир, мир на далечен и на ближен, вели Господ, и ке го излекувам."},
	{20, "20 А нечесните се како разбрането море, кое не може да се смри, и чии води исфрлаат тиња и кал."},
	{21, "21 Мир нема за нечестивите, вели Господ Бог."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view58() {
struct mk58 poems[] = {
	{1, "1 Викај со сиот глас, не се воздржувај; крени го гласот како труба, укажи му на народот Мој на беззаконието негово, и на домот Јаковов - гревовите негови."},
	{2, "2 Тие секој ден Ме бараат и сакаат да ги знаат Моите патишта, кои како народ, божем постапува праведно и не ги остава законите на својот Бог; сакаат да се приближат до Бога:"},
	{3, "3 'Зашто ние постиме, велат, а Ти не гладаш; ги измачуваме душите свои, а Ти не сакаш да знаеш' - Ете, кога постите, вие ја исполнувате својата воља и од другите барате тешки трудови."},
	{4, "4 Ете, вие постите за караници и расправии и за да биете со рака сиромасите; вие не постите во тоа време така, што гласот ваш да биде чуен во висините."},
	{5, "5 Таков ли е постот, што Јас го определив: човек да ја изнемоштува душата своја во денот кога ја наведнува главата како трска и под себе постила врекиште и пепел? Тоа ли ке го наречеш пост и ден угоден на Господа?"},
	{6, "6 Ете го постот, што го избрав: раскини ги оковите на неправдата, одврзи ги врските на јаремот, и угнетените пушти ги на слобода и скрши го секој јарем;"},
	{7, "7 раздели го лебот свој со гладните, и скитниците сиромаси одведи ги во домот свој; ако видиш гол, - облечи го, и од еднокрвниот не се криј."},
	{8, "8 Тогаш твојата светлина ке се јави како зора, и твоето здравје наскоро ке процути, твојата правда ке тргне пред тебе и славата Господова ке те придружува."},
	{9, "9 Тогаш ти ке повикаш - и Господ ке те чуе, ке извикаш - и Он ке рече: 'Еве Ме.' Кога ке го отстраниш од себе јаремот, кога ке престанеш да креваш прст и да говориш лошо,"},
	{10, "10 кога ке му ја дадеш на гладниот душата своја и ке ја нахраниш душата на страдалникот, - тогаш твојата светлина ке изгрее во темнината, и мракот твој ке биде како пладне;"},
	{11, "11 и Господ секогаш ке ти биде водач, а и во време на суша ке ја наситува душата твоја и ке ги крепи коските твои; ти ке бидеш како градина напоена со вода и како извор, чии води никогаш не пресушуваат."},
	{12, "12 Тогаш твоите потомци ке градат врз стари урнатини: ти ке ги востановиш основите на многу поколенија, и ке те викаат обновител на урнатини, градител на патишта за населби."},
	{13, "13 Ако заради саботата ја воздржиш ногата своја да ги исполнува желбите на твоето срце во светиот Мој ден, и ако ја нарекуваш саботата радост, свет ден Господов, ако ја празнуваш и ако ја почитуваш со тоа да не се занимаваш со обичните работи, да им угодуваш на своите грешни желби и да празнословуваш, -"},
	{14, "14 тогаш ке имаш радост во Господа, а Јас ке те искачам на височини земни и ке ти дадам да вкусиш од наследството на Јакова, твојот татко: устата на Господа го изрече тоа."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view59() {
struct mk59 poems[] = {
	{1, "1 Ете, раката на Господа не се скусила, та да не може да спасува, и увото Негово не отврднало, та да не може да слуша."},
	{2, "2 Но беззаконијата ваши ве разделија од вашиот Бог, и гревовите ваши прават да го сокрива лицето Свое од вас, за да не слуша."},
	{3, "3 Зашто рацете ваше се осквернети со крв, а прстите ваши - со беззаконие; устата ваша говори лага, јазикот ваш искажува неправда."},
	{4, "4 Никој не го крева гласот за правда, и никој не се застапува за вистина: се надеваат на суетното и говорат лага, зачнуваат зло и ра аат беззаконие;"},
	{5, "5 матат змијски јајца и ткаат пајажина; кој ке ги изеде јајцата нивни - умира, ако, пак, ги скрши - отровна змија ке използи - од нив."},
	{6, "6 Пајажините нивни не ги бива за облека, нема да се покријат со изработката своја; делата нивни се дела неправедни, а насилството е во рацете нивни."},
	{7, "7 Нозете нивни трчаат кон зло, брзаат да пролеваат невина крв; мислите нивни - се мисли нечесни; по патеките нивни - опустошување и погибел."},
	{8, "8 Тие не го знаат патот на мирот и на патеките нивни нема правда; патиштата им се искривени, и никој, кој оди по нив, не знае за мир."},
	{9, "9 Затоа е и далеку од нас судот, правдата не стигнува до нас: чекаме видело, а тоа темнина, - светлина, а одиме во мрак."},
	{10, "10 Го пипкаме sидот како слепи, одиме со пипкање како без очи; на пладне се сопнуваме како во мрак, ме у живите сме како мртви."},
	{11, "11 Сите рикаме како мечки и стенкаме како гулаби, чекаме суд, а него го нема, - спасение, но тоа е далеку од нас."},
	{12, "12 Зашто престапите наши пред Тебе се многубројни, гревовите наши сведочат против нас; со нас се престапите наши, беззаконијата наши ги знаеме."},
	{13, "13 Ние изневеривме и излагавме пред Господа и отстапивме од нашиот Бог; говоревме клевета и насилство, зачнувавме и ра авме од срцата наши лажливи зборови."},
	{14, "14 И судот отстапи назад, а правдата застана далеку; зашто вистината се сопна на плоштадот, чесноста не можеше да влезе."},
	{15, "15 И исчезна вистината, а кој се оддалечува од злото, се изложува на оскрбување. И Господ го виде тоа; и на очите не Му беше мило што нема суд."},
	{16, "16 И виде дека немаше човек, се чудеше дека немаше застапник; тогаш Неговата мишка Му помогна и правдата Негова Го подржа."},
	{17, "17 И ја облече врз Себе правдата како оклоп, а на главата Своја го стави шлемот на спаснието; и се облече во риза на одмазда како во облека, се покри со ревност како со наметка."},
	{18, "18 Според делата, според делата ке им даде Он; на противниците Свои - со јарост, на непријателите Свои со одмазда, на островите ке им го даде заслуженото."},
	{19, "19 И ке се уплашат на запад од името на Господа, на исток - од славата Негова. Ако непријателот надојде како река, - духот на Господа ке го истера."},
	{20, "20 И ке дојде Искупителот за Сион и за синовите Јаковови, кои се одвратиле од нечесноста, вели Господ."},
	{21, "21 И еве го заветот Мој со нив, вели Господ: Духот Мој, Кој е врз тебе, и зборовите Мои, што ги вложив во устата твоја, нема да отстапат од устата твоја, од устата на потомствотоо твое и од устата на потомците на твоето потомство, вели Господ отсега и довека."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view60() {
struct mk60 poems[] = {
	{1, "1 Дигни се, светлеј се Ерусалиме, зашто дојде твојата светлина, и славата Господова изгреа над тебе."},
	{2, "2 Зашто, ете, темнина ке ја покрие земјата, и мрак - народите; а над тебе ке засветли Господ, и славата Негова ке се јави над тебе."},
	{3, "3 И народите ке дојдат кон твоето видело, царевите - кон светлината што изгрева над тебе."},
	{4, "4 Крени ги очите и погледај наоколу: сите тие се собираат, идат при тебе; твоите синови ке дојдат од далеку, и твоите керки на раце ке се носат."},
	{5, "5 Тогаш ке видиш и ке се зарадуваш, и срцето твое ке затрепери и ке се рашири, зашто богатството на морето ке се сврти кон тебе, имотот на народите ке дојде при тебе."},
	{6, "6 Множество камили ке те покријат, едногрби камили од Мадаим и Ефа; сите тие ке дојдат од Сава, ке донесат злато и темјан и ке ја објавуваат славата Господова."},
	{7, "7 Сите кидарски стада ке бидат собрани при тебе; овните навајотски ке ти послужат: ке излезат на жртвеникот Мој како благоугодна жртва, а Јас ке го прославам домот на Мојата слава."},
	{8, "8 Кои се тие што летаа како облаци, и како гулаби - кон гулабарниците свои?"},
	{9, "9 Така, Мене Ме чекаат островите и пред нив - тарсиските кораби, за да ги пренесат синовите твои оддалеку и со нив - сребро нивно и злато нивно, во името на Господа, твојот Бог, и на Светецот Израилев, зашто Он те прослави."},
	{10, "10 Тогаш синовите на другоземци ке ги градат sидовите твои, и нивните цареви - ке ти служат; зашто во гневот Свој те поразував, но во благоволението Свое ке бидам милостив кон тебе."},
	{11, "11 Твоите порти секогаш ке бидат отворени, нема да се затвораат ни дење, ни ноке, за да се принесува при тебе имотот на народите и да се доведуваат нивните цареви."},
	{12, "12 Зашто народот и царствата, кои нема да сакаат да ти служат, ке загинат, и а таквите народи сосема ке бидат истребени."},
	{13, "13 Славата на Ливан ке дојде при тебе со кипарис, бор и кедар заедно, за да го украси местото на Моето светилише, - а Јас ке го прославам подножјето на нозете Свои."},
	{14, "14 И ке дојдат при тебе со покорност синовите на оние, што те измачуваа, ке ти се клањаат пред нозете твои сите што те презираа; ке те наречат град на Господа, Сион на Светецот Израилев."},
	{15, "15 Затоа што беше изоставен и намразен, така што никој не минуваше преку тебе, - Јас ке те направам вечна слава, и радост од род во род."},
	{16, "16 Ти ке се наситуваш од млекото на народите, и ке смукаш од царски гради, и ке познаеш дека Јас, Господ, сум твој Спасител и твој Искупител, Силниот Јаковов."},
	{17, "17 Место бакар ке ти испракам злато, место железо - сребро, и место дрво - бакар, а место камења - железо; и ке го поставам мирот за твој управител и правдата - за твои надзорници."},
	{18, "18 Нема повеке да се слуша за насилство во земјата твоја, ниту опустошување и разурнување - во пределите твои; и sидовите свои ке ги нарекуваш спасение и портите свои - слава."},
	{19, "19 Нема повеке сонцето да ти биде видело на денот, ниту сјајот на месечината ке ти свети; Господ ке ти биде вечна светлина, и твојот Бог - твоја слава."},
	{20, "20 Нема да зао а веке твоето сонце, ниту твојата месечина ке се потемнува, зашто Господ ке ти беде вечна светлина; ке се свршат дните на твоето тагување."},
	{21, "21 И сиот народ твој ке биде праведен, засекогаш ке ја наследи земјата, - фиданка од она што сум го посадил, дела на рацете Мои, за Мое прославување."},
	{22, "22 Од мал народ ке се намножат иљади, од најслабиот - силен народ. Јас, Господ, ке побрзам да го завршам тоа навреме."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view61() {
struct mk61 poems[] = {
	{1, "1 Духот на Господа Бога е врз Мене, зашто Господ Ме помаза за да им благовествувам на бедните, Ме испрати да лекувам сокрушени по срце, да им приповедам на заробените и на затворениците - отворање на темницата,"},
	{2, "2 да ја проповедам благопријатната Господова година и денот за одмазда на нашиот Бог; да ги утешам сите оние што тагуваат,"},
	{3, "3 да им соопштам на оние што тагуваат на Сион, дека ним место пепел ке се даде украсување, место плачење - елеј на радост, место опаднат дух - славна одежда; и ке ги наречат силни со правда, градина на Господа за Негова слава;"},
	{4, "4 и ке ги изградат вековните пустињи, ке востановат стари урнатини и ке подноват разурнати градови, запустени од дамнишни родови."},
	{5, "5 Тогаш ке дојдат ту инци, и ке ги пасат стадата ваши; синовите на ту инците ке бидат ваши земјоделци и ваши лозари."},
	{6, "6 А вие ке се нарекувате свештеници на Господа, - служители на нашиот Бог ке ве нарекуваат; ке се користите со имотот на народите и ке се прославувате со нивната слава."},
	{7, "7 Заради тоа што бевте посрамени двојно ке ви биде дадено; поради навредувањето тие ке се радуваат на својот дел, зашто во земјата ке добијат двојно; вечна веселба ке има кај нив."},
	{8, "8 Оти Јас, Господ, ја сакам правдата, го мразам грабежот со насилството, и ке им дадам награда според вистината и ке направам со нив вечен завет;"},
	{9, "9 и семето нивно ке биде познато ме у народите, и потомството нивно - ме у племињата; сите, што ке ги видат, ке познаат, дека се тие семе благословено од Господа."},
	{10, "10 Многу ке се радувам во Господа, душата моја ке се развесели во мојот Бог: зашто Он ме облече во спасителна облека, ми облече облека на правда, како на младоженец ми стави венец и како невеста со накит ме украси."},
	{11, "11 Зашто - како што земјата ги произведува растенијата свои, и како што во градината расте се што ке се посее - така Господ Бог ке направи да никне правда и слава пред сите народи."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view62() {
struct mk62 poems[] = {
	{1, "1 Нема да замолчам заради Сион, ниту ке се успокојам заради Ерусалим, додека правдата негова не изгрее како светлина, и спасението негово - како запалена светилка."},
	{2, "2 И народите ке ја видат твојата правда, и сите цареви - твојата слава; и ке ги наречат со ново име, кои устата Господова ке го изрече."},
	{3, "3 И ке бидеш венец на слава во раката Господова и царска круна - врз дланката на твојот Бог."},
	{4, "4 Нема веке да те нарекуваат 'изоставен', ниту земјата твоја повеке ке ја именуваат 'пустиња', туку ке те нарекуваат 'Мое благоволение кон него', а земјата твоја - 'омажена', зашто Господ благоволил кон тебе, и земјата твоја цела ке биде населена."},
	{5, "5 Како што момче се жени со мома, така и синовите твои ке се соединат со тебе; и како што младоженецот се радува на невестата, така ке ти се радува тебе твојот Бог."},
	{6, "6 На sидовите твои Ерусалиме, поставив стража, која нема да мокне ни дење, ни ноке. О, вие што го спомнувате Господа, не замолкнувајте!"},
	{7, "7 не замолчувајте пред Него, додека Он не го обнови Ерусалим и додека не ја издигне славата негова на земјата."},
	{8, "8 Господ се заколна во десницата Своја и во силната мишка Своја: нема повеке да го дава твоето жито за храна на непријателите твои; и синови на ту инци нема да го пијат виното твое, за кое си се трудел;"},
	{9, "9 но собирачете негови ке го јадат и ке го слават Господа, и берачите на грозјето ке го пијат виното негово во дворовите на Моето светилиште."},
	{10, "10 Минувајте, минувајте низ портите, приготвувајте пат за народот! Рамнете, рамнете го патот, собирајте ги камењата, кренете знаме за народите!"},
	{11, "11 Ете, Господ објавува до крајот на земјата: кажете и на керката Сионова: твојот Спасител иде; наградата Негова е со Него, а отплатата Негова - пред Него."},
	{12, "12 И ке ги наречат свет народ, откупен од Господа, а тебе ке те наречат 'баран', град неизоставен."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view63() {
struct mk63 poems[] = {
	{1, "1 Кој е Оној, Кој иде од Едом, во црвена одежда од Восор, Кој е толку величествен во облеката Своја, Кој пристапува во полната сила Своја? - 'Јас сум, Кој изрекувам правда и сум силен да спасувам.'"},
	{2, "2 Зошто Твојата облека е црвена, и твоите одежди - како на оној, што газел во каца?"},
	{3, "3 'Јас газев во каца сам, и никој од народите не беше со Мене; Јас ги газев во гневот Свој и ги газев во јароста Своја; крвта нивна ми ја прскаше облеката Моја; ја извалкав целата облека Моја;"},
	{4, "4 зашто денот за одмазда е во срцето Мое, и годината на искупените од Мене настапи."},
	{5, "5 Јас гледав - и немаше помошник; се чудев, зошто немаше кој да ме поткрепи; но Мојата мишка Ми помогна, и Мојот гнев - тој Ме поткрепи:"},
	{6, "6 и во гневот Свој ги згазив народите, ги уништив во јароста Своја и ја излеав на земјата крвта нивна.'"},
	{7, "7 Kе се секавам на милоста и славата Господова, за се што Господ ни дарува, за големата Негова благост кон домот Израилев што Он ја укажа по милосрдноста Своја и по многуте добрини Свои."},
	{8, "8 Он рече: 'Навистина, тие се Мој народ, деца што нема да излажат,' - и Он ке биде нивни Спасител."},
	{9, "9 Во секоја нивна жалост Он не ги оставаше и Ангелот на Неговото лице ги спасуваше; со Својата љубов и добросрдечност Он ги искупи, ги зеде и ги носеше през сите древни дни."},
	{10, "10 Но, тие се возбунтуваа и Го огорчија Неговиот Свет Дух; затоа Он им стана непријател, така што Сам војуваше против нив."},
	{11, "11 Тогаш народот Негов си спомна за древните дни, деновите на Мојсеја: каде е Оној што ги изведе од морето со пастирот на Своите овци? Каде е Оној што Го вложи во неговото срце Својот Свет Дух?"},
	{12, "12 Кој го водеше Мојсеја за десната рака со Својата величествена мишка и ги раздели пред нив водите, за да си создаде вечно име?"},
	{13, "13 Кој ги водеше преку бездни, како коњ по степи и тие не се сопинаа?"},
	{14, "14 Како што стадо слегува во долина, - така Духот на Господа ги води кон покој. Така и Ти го водеше Својот народ, за да си создадеш славно име."},
	{15, "15 Sирни од небесата и погледни од Твоето живеалиште на светињата Твоја и на славата Твоја: каде се ревноста и силата Твоја? Големата Твоја милосрдност и милоста Твоја кон мене запрени се."},
	{16, "16 Само Ти си Отец наш; зашто Авраам не не познава, ниту Израил не признава за свои; Ти, Господи, си наш Отец, отсекогаш Твоето име е: 'Искупител наш.'"},
	{17, "17 Зошто Господи, си допуштил да се отстраниме од Твоите патишта, да се ожесточи срцето наше, за да не се плашиме од Тебе? Сврти се заради Твоите слуги, заради племињата на Твоето наследство."},
	{18, "18 Кратко време владееше над него народот на Твојата светиња: непријателите наши го изгазија твоето светилиште."},
	{19, "19 Ние станамве такви, како над кои никогаш да не си владеел, и над кои името Твое да не се спомнувало."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view64() {
struct mk64 poems[] = {
	{1, "1 О, да беше ги раскинал Ти небесата и да беше слегол! Горите би се стопиле од лицето Твое,"},
	{2, "2 како оган што растопува восок, како од оган што вода зовира, така ке го познаат името Твое напријателите и од Твоето лице ке затреперат народите."},
	{3, "3 Кога вршеше страшни дела, од нас неочекувани, и слегуваше, - гори се топеа од Твоето лице."},
	{4, "4 Зашто од секогаш не бевме слушале, не бевме внимавале со увото, и никое око не беше видело друг бог, освен Тебе, којшто направил толку многу за оние, кои не Него се надеваат."},
	{5, "5 Ти милостиво го пресретнуваше секого, кој се радуваше и кој вршеше правда, кој Те спомнуваше на Твоите патишта. Но, ете, Ти се разгневи, зашто ние одамна грешевме; па како тогаш ке бидеме спасени?"},
	{6, "6 Сите ние станавме како нечист човек, и секоја наша правда - како извалкана облека; сите попа авме како лист; а беззаконијата наши како ветар не однесуваат."},
	{7, "7 Нема никој кој би го повикувал Твоето име, кој би установил да се држат здраво за Тебе: затоа Ти го сокри лицето Свое од нас и не остави да гинеме од беззаконијата свои."},
	{8, "8 Но сега, Господи, Ти си наш Отец; ние сме глина, а Ти - наш грнчар, сите сме дело на Твоите раце."},
	{9, "9 Немој да се гневиш безмерно, Господи, и немој вечно да го помниш беззаконието. Но, погледај: сите сме Твој народ."},
	{10, "10 Градовите на Твојата светиња станаа пустелија; пустиња стана Сион; Ерусалим е опустошен."},
	{11, "11 Домот на нашата светиња и на нашата слава, каде што татковците наши Те прославуваа, од оган изгоре, а сите наши добра така пропаднаа."},
	{12, "12 По сево ова, ке се воздржуваш ли уште, Господи, ке молчиш ли и ке не назнуваш ли без мерка?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view65() {
struct mk65 poems[] = {
	{1, "1 Јас им се открив на оние, кои не прашуваа за Мене, кои не Ме бараа: 'еве Ме, еве Ме!' - му велев на народ, кој не го повикуваше името Мое."},
	{2, "2 Секогаш ги протегав рацете Свои кон непокорниот народ, кој одеше по лош пат, - по своите помисли, -"},
	{3, "3 кон народ, кој постојано Ме наскрбува в лице, принесува жртви во шумичките и пали темјан на црепчиња,"},
	{4, "4 седи во гробови и нокева во пештери; јаде свински месо, а во садовите негови има гнасно вариво;"},
	{5, "5 кои велат: 'Застани, не се доближувај до мене, зашто сум свет за Тебе.' Тие се дум на ноздрите Мои. - оган што гори секој ден."},
	{6, "6 Ете, што е напишано пред лицето Мое: нема да премолчам, туку ке отплатам, ке отплатам во пазувата нивна,"},
	{7, "7 за нивните беззаконија, вели Господ, и заедно со беззаконијата на татковците нивни, кои кадеа темјан по планините, и по ридовите Ме навредуваа, - ке им одмерам во пазувите нивни и за нивните поранешни дела."},
	{8, "8 Вака вели Господ: 'Кога ве гроздот има сок, не го повредувај, зашто во него има благослов; исто ке направам и за Моите слуги, та сите да не ги погубам."},
	{9, "9 И ке произведам од Јакова потомство, а од Јуда - наследник на Моите гори; и тоа ке го населдат Моите избрани, таму ке живеат слугите Мои."},
	{10, "10 И Сарон ке биде пасиште за овци, а долината Ахор - пладниште за говедата на Мојот народ, кој Ме побара."},
	{11, "11 А вас, кои го оставивте Господа, ја заборавивте Мојата света гора, готвите трпеза за Гад и отворате полна чаша за Мени, -"},
	{12, "12 вас ве опредеилв за меч, сите ке се наведнете за колење, зашто викав - и не одговаравте, говорев - не слушавте, но вршевте зло пред очите Мои и го избиравте она, што не беше по вољата Моја.'"},
	{13, "13 Затоа вака вели Господ Бог: 'Ете, слугите Мои ке јадат, а вие ке гладувате; слугите Мои ке пијат, а вие ке се измачувате од жед;"},
	{14, "14 слугите Мои ке се веселат, а вие ке бидете во срам; слугите Мои ке пеат од срдечна радост, а вие ке пиштите од срдечна жалост и ке плачете од отпаднстоста на вашиот дух."},
	{15, "15 И ке им го оставите името свое на Моите избрани за проклетство; а тебе ке те убие Господ Бог, и слугите Свои ке ги нарече со друго име,"},
	{16, "16 оној, што се благословува на земјата, нека се благословува со вистинскиот Бог; и кој се колне на земјата, нека се колне со вистинскиот Бог, - зашто поранешните жалости ке бидат заборавени и сокириени од Моите очи."},
	{17, "17 Оти, ете, Јас создавам ново небо и нова земја, а поранешните нема повеке да се спомнуваат, ниту на ум ке доа аат."},
	{18, "18 А вие ке се веселите и ке се радувате довека за она што јас го создавам: зашто, ете, Јас ке го создавам Ерусалим за веселба, а народот негов - за радост."},
	{19, "19 Kе се радувам за Ерусалим и ке се веселам за Мојот народ; и нема повеке да се чуе глас во него од плачење и глас од пискот."},
	{20, "20 Таму веке нема да има малолетен ни старец, што нема да ги исполни деновите свои; стогодишникот умира како момче, но умира ли стогодишен грешник, ке биде проколнуван."},
	{21, "21 Kе градат куки и ке живеат во нив, ке садат лозја и ке ги јадат плодовите нивни."},
	{22, "22 Нема да градат, за да живее друг, нема да садат, за да јаде друг; зашто дните на народот Мој ке бидат како дните на дрво, и моите избрани долго ке се користат со делото на рацете свои."},
	{23, "23 Нема да се трудат напразно и да ра аат деца за скрб; зашто ке бидат семе, благословено од Господа, и потомците нивни со нив."},
	{24, "24 И пред тие да повикаат, Јас ке одговорам; тие уште ке говорат, а Јас веке ке ги чујам."},
	{25, "25 Волк и јагне ке пасат заедно, а лавот ке јаде слама како вол, а на змијата правот ке и биде храна: тие нема да причинуваат зло и штета по целата Моја света гора, вели Господ."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view66() {
struct mk66 poems[] = {
	{1, "1 Вака вели Господ: небото е Мој престол, а земјата - подножје на нозете Мои; каде тогаш ке изградите дом за Мене, каде е местото на Мојот спокој?"},
	{2, "2 Зашто, сето тоа го создаде Мојата рака, и сето тоа е Мое, вели Господ. А еве на кого ке погледнам: на смирениот и паднатиот со дух и на оној што трепери пред Моето слово."},
	{3, "3 А кој коле вол, е исто, како оној што убива човек; кој принесува јагне за жртва, е исто, како оној што задушува куче; кој принесува дар, е исто, како оној што принесува свинска крв; кој кади темјан, е исто, како оној што се моли на идол. Тие го избрале тоа на своите патишта, и душата нивна нао а задоволство во одвратностите нивни, -"},
	{4, "4 така и Јас ке ја употребам нивната измама и ке го испратам врз нив она, што е за нив ужасно; зашто викав - и нема кој да одговори, говорев - и тие не слушаа, а вршеа зло пред очите Мои и го избираа она што Ми беше неугодно."},
	{5, "5 Чујте го словото на Господа вие, што треперите пред словото Негово: вашите брака, кои ве мразат и кои ве гонат заради Моето име, велат: 'Нека се јави Господ во Својата слава, па да ја видиме радоста ваша.' Но тие ке бидат посрамени."},
	{6, "6 Ете, шум од градот, глас од храмот, глас од Господа, Кој дава отплата на непријателите Свои:"},
	{7, "7 Уште не беше почувствувала родилни маки, и роди; пред да настапат болките нејзини, роди син."},
	{8, "8 Кој слушна такви нешто? Кој видел слично на тоа? Никне ли од земјата во еден ден? Се ра а ли народ наеднаш, како Сион: штотуку почна да се мачи од родилни болки, - ги роди синовите свои?"},
	{9, "9 Зар Јас кога ке ја отворам утробата на мајката - таа нема да роди? вели Господ. Или Јас Кој давам да се роди, ке ја заклучам ли утробата - вели твојот Бог."},
	{10, "10 Развеселете се со Ерусалими радувајте се за него сите, што го сакате! Радувајте се со него радосно сите што тагувате по него,"},
	{11, "11 за да се храните и наситувате од градите на утехите негови, да се опивате и насладувате од изобилната слава негова.'"},
	{12, "12 Зашто вака вели Господ: 'Ете, ке навртам кон него мир како река, и богатсво на народите - како поток, кој се разлива, за ваша наслада; на раце ке ве носат и на колена ке ве милуваат."},
	{13, "13 Како што некого го утешува мајка така ке ве утешам и Јас; ке бидете утешени во Ерусалим."},
	{14, "14 И ке го видите тоа, и ке се зарадува срцето ваше, и коските ваши ке цутат како свежо растение, и раката на Господа ке се јави врз слугите Негови, а на непријателите свои Он ке се разгневи."},
	{15, "15 Зашто, ете, ке дојде Господа во оган, и колите Негови - како виор, за да го излее гневот свој со јароста и заплашувањето Свое - со пламнат оган."},
	{16, "16 Зашто Господ ке суди со оган и со мечот Свој над секоја плот, и многумина ке бидат убиени од Господа."},
	{17, "17 Оние, што се оветуваат и очистуваат во шумичките еден по друг, кои јадат свинско месо и гадотии и глувци, - сите ке загината вели Господ."},
	{18, "18 Зашто Јас ги знам делата нивни и мислите нивни; ете, ке дојдам да ги соберам сите народи и јазици, и тие ке дојдат и ке ја видат славата Моја."},
	{19, "19 И ке ставам на нив белег, и од преживеаните ме у нив ке испратам кон народите: во Тарсис, во Фуд и Луд, во Мосох, во Товел и во Елада, и во далечните острови, кои не чуле за името Мое и не ја виделе славата Моја; и тие ке му ја објават на народот славата Моја,"},
	{20, "20 и ке ги претстават сите ваши брака од сите народи како дар на Господа на коњи и коли, на носилки, на маски и на брзи камили, - на Мојата света гора, во Ерусалим, вели Господ, - исто како што синовите Израилеви принесуваат дар во домот Господов во чист сад."},
	{21, "21 И од нив ке земам свештеници и левити, вели Господ."},
	{22, "22 Зашто, како што новото небо и новата земја, кои Јас ке ги создадам, ке бидат секогаш пред лицето Мое, вели Господ, така ке постои и потомството ваше и името ваше."},
	{23, "23 Тогаш од месец на месец, и од сабота во сабота ке доа а секоја плот пред лицето Мое на поклонение, вели Господ."},
	{24, "24 И ке излегуваат и ке ги видат труповите на лу ето што отстапиле од Мене; зашто црвот нивни нема да умре, ниту огнот нивни ке угасне и ке бидат одвратност за секоја плот."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};