#include <map>
#include <string>
class Bible14
{
	struct mk1	{ int val; const char *msg; };
	struct mk2	{ int val; const char *msg; };
	struct mk3	{ int val; const char *msg; };
	struct mk4	{ int val; const char *msg; };
	struct mk5	{ int val; const char *msg; };
	struct mk6	{ int val; const char *msg; };
	struct mk7	{ int val; const char *msg; };
	struct mk8	{ int val; const char *msg; };
	struct mk9	{ int val; const char *msg; };
	struct mk10	{ int val; const char *msg; };
	struct mk11	{ int val; const char *msg; };
	struct mk12	{ int val; const char *msg; };
	struct mk13	{ int val; const char *msg; };
	struct mk14	{ int val; const char *msg; };
	struct mk15	{ int val; const char *msg; };
	struct mk16	{ int val; const char *msg; };
	struct mk17	{ int val; const char *msg; };
	struct mk18	{ int val; const char *msg; };
	struct mk19	{ int val; const char *msg; };
	struct mk20	{ int val; const char *msg; };
	struct mk21	{ int val; const char *msg; };
	struct mk22	{ int val; const char *msg; };
	struct mk23	{ int val; const char *msg; };
	struct mk24	{ int val; const char *msg; };
	struct mk25	{ int val; const char *msg; };
	struct mk26	{ int val; const char *msg; };
	struct mk27	{ int val; const char *msg; };
	struct mk28	{ int val; const char *msg; };
	struct mk29	{ int val; const char *msg; };
	struct mk30	{ int val; const char *msg; };
	struct mk31	{ int val; const char *msg; };
	struct mk32	{ int val; const char *msg; };
	struct mk33	{ int val; const char *msg; };
	struct mk34	{ int val; const char *msg; };
	struct mk35	{ int val; const char *msg; };
	struct mk36	{ int val; const char *msg; };
public:
static void view1() {
struct mk1 poems[] = {
	{1, "1 Соломон, синот Давидов, се зацврсти во царството свое, и Господ, неговиот Бог, беше со него и го возвеличи високо."},
	{2, "2 И му заповеда Соломон на сиот Израил да се соберат: иљадниците, стотниците, судиите и сите началници во сиот Изриал - старешините на домовите татковски."},
	{3, "3 Па отидоа Соломон и целото собрание со него на ридот во Гаваон, бидеки таму беше Божјата скинија на сведоштово, која Мојсеј, слугата Господов, ја беше подигнал во пустињата."},
	{4, "4 Давид го беше пренел Божјиот ковчег од Киријат-Јарим на она место, што му го беше приготвил, откако направи за него скинија во Ерусалим."},
	{5, "5 А бакарниот жртвеник, што го беше направил Веселеил, синот на Урија, Одов син, си остануваше таму пред синијата Господова; него го побараа Соломона и собранието."},
	{6, "6 И таму пред лицето на Господа, врз бакарниот жртвеник, што беше пред скинијата на сведоштвото, Соломон принесе иљада сепаленици."},
	{7, "7 Во таа нок му се јави Господ на Соломона и му рече: 'Барај, што сакаш да ти дадам.'"},
	{8, "8 Соломон Му одговори на Бога: 'Ти му направи на таткото мој Давида голема милост и ме постави за цар место него."},
	{9, "9 Нека се исполни сега, Господи, словото Твое кон татка ми Давида, бидејки ме направи цар над народ многуброен, како земниот прав,"},
	{10, "10 дај ми сега мудрост и разум, за да излегувам и влегувам пред тој народ; зашто, кој може да управува со Твојот голем народ?'"},
	{11, "11 И му рече Бог на Соломона: 'Затоа што го имаш тоа во срцето свое и не побара богатство, имот и слава, ниту душите на твоите непријатели, туку побара мудрост и разум, за да управуваш со Мојот народ, над кој те поставив за цар, -"},
	{12, "12 мудрост и разум ти се дава, а богатство, имот и слава ке ти дадам такви, какви што кај царевите пред тебе немало, нити ке има по тебе.'"},
	{13, "13 Тогаш Соломон се врати од ридот во Гаваон, од скинијата на сведоштвото, во Ерусалим, и царуваше над Израилот."},
	{14, "14 И собра Соломон коњица; имаше иљада и четиристотини коли и дванаесет иљади коњаници, кои ги насели по колските градови и при царот во Ерусалим."},
	{15, "15 И го направи царот во Ерусалим среброто и златото рамноцено со камењата, а кедрите според нивното множество ги направи рамноцени со смоквите во низините."},
	{16, "16 Коњи му доведуваа на Соломона од Египет; царски трговци ги купуваа со пари;"},
	{17, "17 една кола се купуваше и дотеруваше од Египет за шестотини сикли сребро, а еден коњ - за сто и педесет. Така тие им ги доставуваа преку своите раце на сите цареви хетејски и цареви сиријски."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct mk2 poems[] = {
	{1, "1 Соломон потоа науми да изгради дом на името Господово и царски дом за себеси."},
	{2, "2 И собра Соломон седумдесет иљади носачи и осумдесет иљади каменоделци во горите и надгледници над нив - три иљади и шестотини."},
	{3, "3 Па испрати Соломон да му кажат на тирскиот цар Хирама: 'Како што правеше со татка ми Давида и му испракаше кедар, за да си изгради дом за живеење, така направи и со мене."},
	{4, "4 Еве, јас градам дом на името Господово, мојот Бог, да го посветам Нему, за да се кади пред Него миризливо кадиво, да се поставуваат постојано лебови на предложението и да се принесува таму сепалненици наутро и навечер, и во саботите, новомесечијата и празниците на Господа, нашиот Бог, што му е заповедано засекогаш на Израилот."},
	{5, "5 Домот, што го градам, е голем, зашто голем е нашиот Бог, погоре е од сите богови."},
	{6, "6 Та кој може Нему да Му изгради дом, кога небото и небесата на небесата не можат да ја соберат Неговата слава? И кој сум јас, па да можам да Му изградам дом, освен за кадење пред лицето Негово?"},
	{7, "7 Па така, испрати ми сега човек, што знае да прави изработки од злато, од сребро, од бакар и од железо и од пурпурна, црвена и сина пре а, и кој знае да реже за да работи заедно со уметниците, какви што има во Јудеја и во Ерусалим, а коишто ги приготви татко ми Давид."},
	{8, "8 И испрати ми кедрови дрва и кипарис и невгово дрво од Ливан, зашто знам, дека твоите слуги умеат да сечат ливански дрвја. Е ете, моите слуги ке одат со твоите слуги,"},
	{9, "9 за да ми подготват многу дрва, зашто домот, што го градам, е голем и величествен."},
	{10, "10 А на дрводелците, твоите слуги, што ке ги сечат дрвјата, ке им дадам за храна: дваесет иљади мери пченица и дваесет иљади мери јачмен, дваесет иљади мери вино и дваесет иљади мери елеј.'"},
	{11, "11 И Хирам, царот тирски, одговори со писмо, кое му го испрати на Соломона: 'Затоа што го засака Својот народ, Господ те постави за цар над него.'"},
	{12, "12 И уште рече Хирам: 'Благословен Господ, Бог Израилев, Кој го создал небото и земјата и му дал на Давида син мудар, учен и разумен, кој се готви да Му гради дом на Господа и дом царски за себеси."},
	{13, "13 Па така, ти испракам човек, надарен со знаења, слугата мој Хирама,"},
	{14, "14 син на жена од Давидовите керки, а татко му е Тирец; тој знае да прави изработки од злато и од сребро, од бакар и од железо, од камен и од дрво, од пурпурна и сина пре а, од висон и од багреница и да реже секаква резба и да прави се, што ке му биде порачано, заедно со твоите уметници и со уметници на мојот господар Давида, твојот татко."},
	{15, "15 А пчницата и јачмнаот, елејот и виното, што ги ветуваш, испрати ги, господаре мој, на своите слуги."},
	{16, "16 Ние, пак, ке насечеме дрва од Ливан колку што треба, и ке ги донесеме на скели по морето во Јафа, и ти ке ги пренесеш во Ерусалим.'"},
	{17, "17 И ги собра Соломон сите придојдени, што беа тогаш во Израилската земја, според пописот што го беше направил татко му Давид, - и излегоа сто и педесет и три иљади и шестотини."},
	{18, "18 Од нив Соломон определи седумдесет иљади за носачи, осумдесет иљади за каменоделци во горите и три иљади и шестотини за надгледници, за да настојуваат народот за работи."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct mk3 poems[] = {
	{1, "1 И почна Соломон да го гради домот Господов во Ерусалим, на гората Аморија, која му ја определи Господ на татка му Давида, на ова место, што го беше подготвил Давид, врз гумното на Јевусеецот Орна."},
	{2, "2 А почна да го гради на вториот ден од вториот месец во четвртата година од своето царување."},
	{3, "3 Основата, положена од Соломона при градењето на домот Божји, беше следна: должина шеесет лакти, по старата мерка, а широчина - дваесет лакти;"},
	{4, "4 а тремот пред домот беше долг колку ширината на домот - дваесет лакти, висок, пак, - сто и дваесет."},
	{5, "5 А главниот дом го обложи со кипарисово дрво, го опкова со чисто злато и изработи на него палми и веришки."},
	{6, "6 Го украси домот со скапоцени камења за да биде убав; а златото беше парваимско злато."},
	{7, "7 Го опкова со злато домот, гредите, праговите, sидовите негови, прозорците и вратите негови, а по sидовите изваја херувими;"},
	{8, "8 и направи Свајата Сватих: должината нејзина според широчината на домот - дваесет лакти, и широчината нејзина - дваесет лакти; и ја покри со шестотини таланти чисто злато."},
	{9, "9 Тежината на клиновите беше: секој клин педесет сикли злато. И горните одаи ги опкова со злато."},
	{10, "10 А во Свјатајта Свјатих направи два херувима од дрво што не гние, резбарска работа, и ги опкова со злато."},
	{11, "11 Крилата на херувимите им беа во должина дваесет лакти: едното крило, пет лакти, се допираше до sидот на домот, а другото крило, исто така пет лакти, се срекаваше со крилото на другиот херувим;"},
	{12, "12 исто така и едното крило на другиот херувим, пет лакти, се допираше до sидот на домот, а другото крило, пет лакти, се срекаваше со крилото на другиот херувим."},
	{13, "13 Криљата на херувимите беа раширени на дваесет лакти; и тие стоеја на нозете свои со лицето кон храмот."},
	{14, "14 Направи завеса од сина, пурпурна и темно црвена ткаенина и од висон, а на неа изобрази херувими."},
	{15, "15 Пред храмот направи два столба, високи по триесет и пет лакти, и капители одозгора - секој од по пет лакти."},
	{16, "16 Направи и веришки, како во светилиштето, и ги положи врз столбовите; направи и сто нарови, кои ги постави на веришките."},
	{17, "17 Ги постави столбовите пред храмот: едниот десно, другиот лево, и десниот го нарече Јихин (Исправување), а левиот Воаз(тврдина)."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct mk4 poems[] = {
	{1, "1 А направи и бакарен жртвеник: дваесет лакти долг, дваесет лакти широк и десет лакти висок."},
	{2, "2 И направи излеано море - од едниот крај негов до другиот десет лакти - целиот круг, висок пет лакти, а наоколу при врвот - триесет лакти;"},
	{3, "3 наоколу под него од сите страни имаше излеано образи воловски; на десет лакти наоколу морето го опколуваа два реда волови, излеани заедно со него."},
	{4, "4 Тоа стоеше врз дванаесет вола: три гледаа кон север, три гледаа кон запад, три гледаа кон југ и три гледаа кон исток, а морето врз нив одозгора: заднините пак им беа свртени навнатре под морето."},
	{5, "5 Девелината му беше колку една дланка, а краиштата негови, направени како краишта на чаша; прилегаа на расцутен крин. Тоа собираше три иљади бата."},
	{6, "6 Направи и десет мијалници и постави пет десно и пет лево, за да мијат во нив - го миеја во нив приготвеното за сепалениците; а морето - за свештениците, за да се мијат во него."},
	{7, "7 Направи и десет златни светилници, какви што требаше да бидат, и ги постави во храмот - пет десно и пет лево."},
	{8, "8 Направи и десет трпези и ги постави во храмот - пет десно и пет лево; направи и сто златни чаши."},
	{9, "9 Направи уште и свештенички двор, и голем двор, и врати кон дворот, и стожерите им ги опкова со бакар."},
	{10, "10 Морето го постави на десната страна, кон југоисток."},
	{11, "11 И направи Хирам котли, лопатки, чаши, кадилници и сите жртвени садови. И ја сврши Хирам работата, што ја вршеше за царот Соломон во Божјиот дом:"},
	{12, "12 два столба и два појаса околу врвовите врз столбовите и две мрежи, за да ги покриваат двата појаса околу капителите, што беа врз столбовите,"},
	{13, "13 и четиристотини нарови на двете мрежи - два реда нарови за секоја мрежа, за да ги покриваат двата појаса околу врвовите врз столбовите."},
	{14, "14 Направи и подножја, направи и мијалници над подножјата;"},
	{15, "15 едно море и дванаесет волови под него,"},
	{16, "16 и котли и лопатки, и виљушки; целиот тој прибот Хирам му го направи на царот Соломона за домот Господов од измазнет бакар."},
	{17, "17 Царот ги излеа во глинена земја од околината на Јордан, ме у Сокхот и Саридата."},
	{18, "18 Соломон ги направи сите тие предмети во големо множество, така што не се знаеше мерката на бакарот."},
	{19, "19 Тогаш ги направи Соломон и сите други предмети за Божјиот дом: и златен жртвеник, и трпези за лебовите на предложението,"},
	{20, "20 и светилници, и кандилата нивни, за да ги палат според уредбите пред Свјатаја Свјатих, - од чисто злато;"},
	{21, "21 и цвекенца, и кандилца, и машички од злато, од најчисто злато,"},
	{22, "22 и ножеви, и росилници, и чаши, и пепелници од најчисто злато; и храмовите порти - внатрешните порти за Свјатаја Свјатих, и храмовите порти за светилиштето - од злато."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct mk5 poems[] = {
	{1, "1 И се заврши сета работа, што ја изврши Соломон за домот Господов. И го внесе Соломон посветеното од татка му Давида сребро и злато, и сите садови ги предаде во ризниците на Божјиот дом."},
	{2, "2 Тогаш Соломон ги свика во Ерусалим сите началници израилски и сите племенски кнезови и сите старешини на домовите на израилевите синови, за да го пренесат Ковчегот на заветот Господов од Давидовиот град, односно од Сион."},
	{3, "3 И се собраа при царот сите Израилци на празникот, во седмиот месец."},
	{4, "4 И дојдоа сите старешини Израилеви. Левитите го кренаа Ковчегот;"},
	{5, "5 го понесоа ковчегот и скинијата на сведоштвото и сите свети садови, што беа во скинијата, - го понесоа свсештеници и левити."},
	{6, "6 А царот Соломон и сето Израилево општество, што се беше собрало при него со страв пред Ковчегот, принесуваа жртви - овци и волови, толку многу, што не беше можно да се избројат и пресметаат."},
	{7, "7 И свештениците го внесоа Ковчегот на заветот Господов на местото негово, во Свјатаја Свјатих, под криљата на херувимите."},
	{8, "8 Херувимите со раширени криља над местото на ковчегот и го покриваа Ковчегот и лостовите негови одозгора."},
	{9, "9 Лостовите се издигаа така, што дршките им се гледаа пред Свјатаја Свјатих, но не и надвор; тие се таму и ден денес."},
	{10, "10 Во Ковчегот немаше ништо, освен двете камени плочи, што Мојсеј ги беше положил на Хорив, кога Господ склучи завет со Израилевите синови, по излегувањето нивно од Египет."},
	{11, "11 Кога свештениците излегоа од светилиштето, - зашто сите свештеници, што беа таму, се осветија, беа разлика на нивните редови,"},
	{12, "12 тогаш сите певци - левити: Асаф, Еман, Идитун и синовите нивни и браката нивни, облечени во тешко платно, со кимвали, псалтири и гусли стоеја на источната страна од жрвеникот, и со нив заедно сто и дваесет свештеници, трубеа со труби."},
	{13, "13 И додека трубеа и пееја како еден, испуштајки еден глас за хвала и славословие на Господа и кога го подигнаа звукот од труби, кимвали и други свирки, и сите го фалеа Господа, дека е благ, дека милоста Негова е вечна, - тогаш домот Господов се исполни со облак,"},
	{14, "14 и поради облакот свештениците не можеа да стојат при служба, зашто славата Господова го исполни Божјиот дом."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct mk6 poems[] = {
	{1, "1 Тогаш Соломон рече: 'Господ беше рекол, дека ке благоволи да престојува во магла,"},
	{2, "2 но јас, на Твоето свето име Му изградив дом на Твоето живеалиште, место за Твоето вечно присуство.'"},
	{3, "3 И го сврте царот лицето свое, та го благослови сето собрание на Израилците - сето собрание на Израилците стоеше,"},
	{4, "4 па рече: 'Нека е благословен Господ, Бог Израилев, Кој го изврши сега со светата рака Своја она, како што го беше рекол со устата Своја на татка ми Давида велејки:"},
	{5, "5 ‘од оној ден, кога го изведов Мојот народ од Египетскатsа земја, Јас не избрав град во ниедно колено Израилево, за да изградам дом, каде што да присуствува името Мое, ниту избрав маж што ке биде водач на Мојот народ Израилот."},
	{6, "6 туку го избрав Ерусалим, та името Мое таму да присуствува, го избрав Давида, тој да биде над Мојот народ - Израилот.‘"},
	{7, "7 Татко ми Давид имаше на срце да изгради дом на името на Господа, Бога Израилев,"},
	{8, "8 но Господ му кажа на татко ми Давид: ти имаш на срце да изградиш храм на името Мое; добро е, што ти е тоа на срце."},
	{9, "9 Ме утоа, ти нема да изградиш храм, туку твојот син, што ке призлезе од бедрата твои, - тој ке изгради храм на името Мое."},
	{10, "10 И Господ го исполни словото и, она што го беше изрекол; јас стапив на местото на мојот татко Давида, седнав на престолот Израилев, како што рече Господ, и изградив дом на името Господово, Бога Израилев."},
	{11, "11 Го положив таму ковчегот, во кој е заветот на Господа, што го беше склучил со синовите Израилеви.'"},
	{12, "12 Па застана Соломон пред жртвеникот Господов, пред сето собрание на Израилците, ги крена рацете, -"},
	{13, "13 зашто Соломон беше направил бакарно подножје, долго пет лакти, широко пет лакти и високо три лакти, и го беше поставил среде дворот; застана на него, падна на колена пред сето собрание на Израилците, ги крена рацете кон небото, -"},
	{14, "14 и рече: 'Господи, Боже Израилев! Нема Бог, сличен на Тебе, ниту на небото, ниту на земјата. Ти го пазиш заветот и милоста кон слугите Свои, кои одат пред Тебе со сето свое срце;"},
	{15, "15 Ти го исполни на Својот слуга Давида, мојот татко, она, што беше говорел; она, што беше го изрекол со устата Своја, денес го исполни со раката Своја."},
	{16, "16 И сега, Господи, Божи Израилев, исполни му го на Својот слуга Давида, мојот татко, она, што му го рече, велејки: нема да снема маж, што ке седи пред лицето Мое на престолот Израилев, само ако твоите синови внимаваат на патиштата свои, одејки по Мојот закон така, како што одеше ти пред Мене."},
	{17, "17 А сега, Господи, Боже Израилев, нека се потврди словото Твое, што си го изрекол на Својот слуга Давида!"},
	{18, "18 Навистина, Бог ли ке живее со лу ето на земјата? Ако небото небесата Твои не Те собираат, дотолку помалку ке Те собере овој храм, што сум го изградил."},
	{19, "19 Но погледни милостиво кон молитвата на Твојот слуга и кон молбата негова, Господи, Боже мој! Чуј го повикот и молитвата, со која Твојот слуга се моли пред Тебе."},
	{20, "20 Нека бидат очите Твои отворени кон овој храм дење и ноке, кон местото, во кое си ветил дека го ставаш името Свое, за да ја слушаш молитвата, со која слугата Твој ке се моли на ова место."},
	{21, "21 Чуј ги молбите на Твојот слуга и на Твојот народ Израилот, со кои ке се молат на ова место; чуј од местото на Твоето живеалиште, од небесата, чуј и смилувај се!"},
	{22, "22 Кога некој ке згреши против ближниот свој, и ке побараат од него клетва, за да се заколне, и таа клетва биде извршена пред Твојот жртвеник во овој храм,"},
	{23, "23 тогаш чуј од небото и изврши суд над Своите слуги, подај му на виновникот, и товарејки му ја постапката негова врз главата негова; а оправдај го правиот, воздавајки му според правдата негова."},
	{24, "24 Кога Твојот народ Израилот ке биде поразен од непријателот, затоа што згрешил пред Тебе и кога тој ке се сврти кон Тебе, и ке го исповеда името Твое со молба и молитва пред Тебе во овој храм,"},
	{25, "25 чуј тогаш од небото и прости му го гревот на Твојот народ Израилот и врати го во земјата, што си му ја дал нему и на татковците негови."},
	{26, "26 Кога ке се заклучи небото и ке снема дожд, затоа што згрешил пред Тебе, и ке се помолат на ова место, ке го исповедаат името Твое и ке се свртат од своите гревови, затоа што си ги понизил,"},
	{27, "27 чуј тогаш од небото и прости им го гревот на Своите слуги и на Својот народ Израилот, покажувајки им го добриот пат, по кој треба да одат; и испрати дожд врз Твојата земја, што си му ја дал на народот Свој во наследство."},
	{28, "28 Ако биде глад во земјата или помор, огнен ветар или гламја, скакулци или гасеници, или ако го притиснат непријателите негови во земјата, што ја владее, некое зло ако се случи или некаква болест,"},
	{29, "29 секоја молитва, секоја молба од кој и да било човек, или од сиот народ Твој Израилот, кога секој ке ја почувствува невољата своја и тагата своја и ке ги подадае рацете кон Твојот храм,"},
	{30, "30 чуј од небото, од местото на Твоето живеалиште, и прости и подај му на секого според сите патишта негови, како што го познаваш срцето негово, - зашто само Ти ги познаваш срцата на синовите човечки, -"},
	{31, "31 за да се плашат од Тебе и да одат по Твоите патишта во сите дни, додека живеат на земјата, што си им ја дал на татковците нивни."},
	{32, "32 Дури и ту инецот, што не е од Твојот народ Израилот, кога ке дојде од далечна земја поради Твоето големо име, Твојата мокна рака и Твојата силна мишка, - дојде и се помоли во овој храм,"},
	{33, "33 чуј од небото, од местото на Твоето живеалиште, и направи се, за кое ту инецот ке Те призове, та сите земни народи да го познаат Твоето име и да се плашат од Тебе, како и Твојот народ Израилот, и да знаат, дека овој дом, што јас го изградив, е наречен на Твое име."},
	{34, "34 Кога Твоите лу е ке излезат во војна против непријалтелите свои по патот, по кој ке ги испратиш Ти, и Ти се помолат, обрнувајки се кон храмот, што го изградив на Твоето име,"},
	{35, "35 тогаш послушај ја од небото молитвата нивна и молбата нивна и направи им го она што е таму потребно."},
	{36, "36 Кога ке згрешат пред Тебе, - зашто нема човек што не грешава, - и Ти ке им се разгневиш и ке ги предадеш на непријателите, и они, што ги заробиле, ги одведат во далечна или блиска земја,"},
	{37, "37 кога во земјата, во која ке бидат заробени, ке дојдат на себеси, ке се свртат и ке Ти се помолат во земјата на своето ропство, велејки: ‘згрешивме, направивме беззаконија и неправди,‘"},
	{38, "38 и се обрнат кон Тебе со сето свое срце и со сета своја душа, во земјата на своето ропство, каде што ке бидат одведени во плен, и се помолат, обрнувајки се кон земјата своја, што си им ја дал на татковците нивни, и кон градот, што си го избрал, и кон храмот, што го изградив на Твоето име, -"},
	{39, "39 тогаш чуј од небото, од местото на Твоето живеалиште, чуј ја молитвата нивна и молбата нивна, и направи го она што им е потребно, и прости му на Твојот народ, за она што згрешил пред Тебе."},
	{40, "40 Боже мој, очите Твои нека бидат отворени и ушите Твои внимателно кон молитвата на ова место!"},
	{41, "41 И сега, Господи Боже, застани во Твоето покоиште, Ти и ковчегот на Твојата сила. Твоите свештеници, Господи Боже, нека се облечат во спасение, и Твоите преподобни да се радуваат во добрините."},
	{42, "42 Господи Боже, не свртувај го лицето од помазаникот Свој, присети се на милостите ветени кон Својот слуга Давида!'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct mk7 poems[] = {
	{1, "1 Кога Соломон ја заврши молитвата, слезе оган од небото и ги голтна сепалениците и жртвите, и слава Господова го исполни домот."},
	{2, "2 И свештениците не можеа да влезат во домот Господов, зашто славата Господова го исполни домот Господов."},
	{3, "3 И сите синови Израилеви, кога видоа, како слезе оган и слава Господова врз домот, паднаа ничкум на земја, на плочникот, се поклонија и Го фалеа Господа, зашто е благ, зашто милоста негова е вечна."},
	{4, "4 А царот и сиот народ почнаа да принесуваат жртви пред лицето на Господа."},
	{5, "5 И принесе царот Соломон на жртва дваесет и две иљади вола и сто и дваесет иљади овци: така го осветија Божјиот дом царот и сиот народ."},
	{6, "6 Свештениците стоеја на службата своја, а левитите со Давидовите песни во рацете, стоеја со свирки за песни на Господа, што ги беше направил царот Давди, зашто милоста Негова е вечна; и трубеа свештениците спроти нив, а сиот Израиел стоеше."},
	{7, "7 Соломон го освети и внатрешниот дел на тремот, што е пред домот Господов: таму ги принесе сепалениците и лојот од мирните жртви, зашто бакарниот жртвеник, направен од Соломона, не можеше да ги собере сепалениците, лебните приноси и лојот."},
	{8, "8 И направи Соломон во тоа време седумдневен празник и празнуваше со него сиот Израил, - многу голем собор, што се беше стекол од влезот во Емат до Египетскиот поток;"},
	{9, "9 а на осмиот ден направија попразненсто, зашто осветувањето на жртвеникот го правеа седум дена и празнкот - седум дена."},
	{10, "10 И на дваесет и третиот ден од седмиот месец царот го распушти народот по шаторите нивни, сите радосни и весели во срцето поради доброто, што Господ му го направи на Давида и Соломона и на својот народ Израилот."},
	{11, "11 И го заврши Соломон домот Господов и домот царски, заврши успешно се, што беше наумил во срцето свое да го изврши во Господовиот дом и во својот дом."},
	{12, "12 И Господ му се јави на Соломона ноке и му кажа: 'Ја чув твојата молитва и Си го одбрав тоа место за дом на жртвопринесувања."},
	{13, "13 Ако го заклучам небото и да нема дожд, ако им заповедам на скакулците да ја испасат земјата, или да испратам помор врз Мојот народ."},
	{14, "14 и Мојот народ, кој се именува со Моето име, се смири, почне да се моли, да го бара лицето Мое и се одврати од своите лоши патишта, Јас ке чујам од небото и ке му ги простам гревовите негови и ке ја излекувам земјата негова."},
	{15, "15 И сега очите Мои ке бидат отворени и учите Мои внимателни кон молитвата во ова место."},
	{16, "16 И сега јас го избрав и го осветив овој дом, та името Мое да биде таму засекогаш; и очите Мои, и срцето Мое ке бидат таму во сите дни."},
	{17, "17 И, ако одиш пред лицето Мое, како што одеше татко ти Давид, и ако вршиш се, што сум ти заповедал, и ако ги пазиш уредбите Мои и законите Мои,"},
	{18, "18 Јас ке го зацрвстам престолот на царството твое, како што му бев ветил на татка ти Давид, велејки: ‘нема да снема маж, што ке владее над Изралот.‘"},
	{19, "19 Но, ако отстапите и ако ги напуштите наредбите Мои и заповедите Мои, што сум ви ги дал, и тргнете да служите на други богови и да им се поклонувате,"},
	{20, "20 Јас ке го истребам Израилот од лицето на Мојата земја, што сум му ја дал, и овој храм, што сум го осветил на Мое име, ке го отфрлам од лицето Свое и ке го направам за приказ и за потсмев кај сите народи."},
	{21, "21 А за овој храм, толку славен, секој, што ке мине покрај него, ке се вxаши и ке рече: ‘Зошто ли постапил Господ така со оваа земја и со овој храм?‘"},
	{22, "22 И ке речат: ‘Затоа, што тие Го оставија Господа, Бога на татковците свои, Кој ги изведе од Египетската земја, и се приврзаа за други богови, и, се поклонуваа и им служеа, - затоа Он им го испрати сево ова зло.‘"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct mk8 poems[] = {
	{1, "1 Откако, изминаа дваесет години, во кое време Соломон го градеше домот Господов и својот дом,"},
	{2, "2 Соломон ги изгради и градовите, што му ги беше дал Хирам, и ги всели во нив синовите Израилеви."},
	{3, "3 Потоа отиде Соломон против Емат-Сува и го презеде."},
	{4, "4 Го изгради Тедмор во пустињата и сите градови за житници, какви што направи во Емат."},
	{5, "5 Го изгради Горни Веторон и Долни Веторон, градови утврдени со sидишта, порти и резиња,"},
	{6, "6 и Валат и сите градови за складови, во кои Соломон имаше житници, сите градови за коли и градови за коњица, и се што сакаше да изгради Соломон во Ерусалим и во Ливан и по целата земја на своето владение."},
	{7, "7 Сите лу е, останата од Хетејците, Аморејците, Ферезејците, Евејците и Јевусејците, што не беа од синовите Израилеви, -"},
	{8, "8 децата нивни, останати по нив на земјата, кои синовите Израилеви не ги беа истребиле - Соломон ги потчини и принуди да плакаат данок дури и до денес."},
	{9, "9 А синовите Израилеви Соломон што не ги направи слуги за свои работи, тие беа војници и поглавари над војводите негови и заповедници на колите и коњицата негова."},
	{10, "10 Главните настојници, што управуваа со народот при царот Соломон, беа двесте и педесет."},
	{11, "11 Соломон ја пренесе керката Фараонова од Давидовиот град во домот, што го изгради за неа, зашто, велеше тој, жена не смее да живее при мене во домот на Израилевиот цар Давида, бидејки домот е осветен: во него е влезен ковчегот Господов."},
	{12, "12 Тогаш Соломон почна да Му принесува сепаленици на Господа на жртвеникот Господов, што беше го изградил пред тремот,"},
	{13, "13 за принесување сепаленици, според наредбите секој ден, како што беше заповедал Мојсеј, во саботите и во новомесечијата и во празниците трипати во годината: во празникот на Бесквасници, во празникот на Седмици и во празникот Сеници."},
	{14, "14 И ги установи, според распоредот на татка си Давида, смените и свештениците според службата нивна, на левитите според стражите нивни, за да славословат и да служат при свештениците според уставот за секој ден, и на вратарите според смените нивни, при секоја врата, бидејки таква беше заповедта на Давида, Божиот човек."},
	{15, "15 И не отстапуваа од царевите заповеди за свештениците и за левитите во ништо, ниту пак за ризницата."},
	{16, "16 Така беше уредено целото дело на Соломона од денот, кога се основа домот Господов, до целосното завршување негово."},
	{17, "17 Тогаш отиде Соломон во Гасион-Гавер и во Елат, што е на морскиот брег, во земјата Идумејска."},
	{18, "18 И Хирам му испрати по свои слуги кораби и слуги, што го знаеја морето, и тие отидоа со слугите Соломонови во Офир, од каде што изнесоа четиристотини и педесет таланти злато, и му го донесоа на царот Соломон."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct mk9 poems[] = {
	{1, "1 Савската царица, кога чу за славата Соломонова, дојде во Ерусалим да го искушува Соломона со гатанки; дојде со многу големо богатство и камили, натоварени со благопријатни мириси, многу злато и скапоцени камења. Дојде при Соломона и говореше со него се, што и беше на срце."},
	{2, "2 Соломон и ги објасни сите нејзини зборови, и не се најде ништо непознато за Соломона, кое да не и го објасни."},
	{3, "3 Савската царица, откако ја виде мудроста на Соломона и домот, што тој го беше изградил,"},
	{4, "4 и јадењата на трпезата негова, и живелиштата на слугите негови, состојбата на прислужниците негови и облеката нивна, пехарниците и облеката нивна, и одот, со кој тој влегуваше во домот Господов, - беше надвор од себе."},
	{5, "5 Тогаш таа му рече на царот: 'Вистина е она што го бев слушала за твоите дела и за твојата мудрост;"},
	{6, "6 но јас не верував на нивните зборови се, додека не дојдов и не видов со очите свои. И еве, ни половината не ми е кажано за твојата голема мудрост: ти ја надминуваш приказната, што сум ја чула."},
	{7, "7 Блажени се твоите лу е, блажени се тие твои слуги, кои секогаш стојат пред тебе и ја слушаат мудроста твоја!"},
	{8, "8 Нека е благословен Господ, твојот Бог, Кој благоволи да те постави на Својот престол за цар пред Господа, твојот Бог. Поради љубовта на твојот Бог кон Израилот, за да го зацврсти засекогаш, Он те постави за цар над него, - да делиш суд и правда.'"},
	{9, "9 Потоа таа му подари на царот сто и дваесет таланти злато и големо множество благопријатни мириси и скапоцени камења: немаше нигде такви мириси, какви што Савската царица му подари на Соломона."},
	{10, "10 Но и слугите Хирамови и слугите Соломонови, кои го донесоа златото од Офир, донесоа и црвено дрво и скапоцени камења."},
	{11, "11 Царот од тоа црвено дрво направи скали за домот Господов и за царскиот дом, и гусли и псалтири за певците. Такво нешто не беше видено пред тоа во земјата Јудејска."},
	{12, "12 А царот Соломон и даде на Савската царица, се што посака и пожела, освен такви работи, какви што таа му беше донела. Пота таа се врати во својата земја со слугите свои."},
	{13, "13 Мерката на златото, што му доа аше на Соломона во текот на една година, беше шестотини и шеесет таланти."},
	{14, "14 Освен тоа, донесуваа уште и поданици и трговци, и сите цареви арапски и обласни началници му донесуваа злато и сребро на Соломона."},
	{15, "15 И направи царот Соломон двесте големи штита од ковано злато - по шестотини сикли злато за секој штит, -"},
	{16, "16 и триста помали штита од ковано злато - по триста сикли злато за секој штит; и царот ги постави во домот од ливанско дрво."},
	{17, "17 Царот направи и голем престол од слонова коска, и го обложи со чисто злато,"},
	{18, "18 и шест степеника до престолот и златно подножје, изградено заедно со престолот, и потпирки од двете страни на седиштето, и два лава, што стојат до потпирките."},
	{19, "19 И уште дванаесет лава што стоја таму од двете страни на шесте степеника. Таков престол немаше во ниедно царство."},
	{20, "20 Сите садови од кои пиеше царот Соломон беа од злато, и сите садови во домот од ливанско дрво беа од чисто злато; од сребро немаше ништо, зашто среброто во Соломоновото време не се ценеше многу."},
	{21, "21 Бидејки царски кораби одеа во Тарсис со слугите Хирамови и секои три години корабите се вракаа од Тарсис, па донесуваа злато и сребро, слонова коска, мајмуни и пауни."},
	{22, "22 Така царот Соломон ги надмина сите земни цареви по богатството и по мудроста."},
	{23, "23 Сиет земни цареви сакаа да го видат Соломона, за да ја послушаат мудроста негова, која Бог ја беше внем во срцето негово."},
	{24, "24 И секој од нив донесуваше со себеси дар: сребрени садови и златни садови, облека, оружја, благопријатни мириси, коњи и маски - секоја година."},
	{25, "25 Соломон имаше четири иљади стаи за коњи и коли и дванаесет иљади коњаници; ги беше населил по колските градови и при царот - во Ерусалим."},
	{26, "26 Владееше над сите цареви - од реката Еуфрат до Филистејската земја и до Египетските предели."},
	{27, "27 Царот направи и златото и среброто во Ерусалим да бидат рамноценети со обичните камења, а кедрите, поради нивното множество, ги направи рамноценети со смиквите во низините."},
	{28, "28 Коњи му дотеруваа на Соломона од Египет и од сите земји."},
	{29, "29 Другите дела Соломонови, први и последни, опишани се во записите на пророкот Натана и пророштвото на Силомаецот Ахија и во виденијата на јасновидецот Јоила за Јеровоама, Наватовиот син."},
	{30, "30 Соломон царуваше во Ерусалим над сиот Израил четириесет години."},
	{31, "31 Почина Соломон при татковците свои, и го погребаа во градот на татка му Давида. А место него стана цар синот негов Ровоам."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct mk10 poems[] = {
	{1, "1 Ровоам отиде во Сихем, зашто во Сихем се беа собрале сите Израилци, за да го изберат за цар."},
	{2, "2 Кога чу за тоа Јеровоам, синот Наватов, - кој се нао аше во Египет, каде што беше избегал од царот Соломон, - тој се врати од Египет."},
	{3, "3 Испратија да го повикаат. Дојде Јеровоам и сиот Израил, и му говореа на Ровоама вака:"},
	{4, "4 'Твојот татко ни маложи тешко иго; ти пак олесни ни го тешкото ропство од татка ти и тешкото иго, што ни го наложи тој, и ние ке ти служиме.'"},
	{5, "5 Ровоам им одговори: 'По три дена дојдете пак при мене.' И народот се разотиде."},
	{6, "6 Се посоветува царот Ровоам со старешините, што стоеја пред татка му Соломона, додека беше жив, и им рече: 'Што ке ме посоветувате да му одговорам на овој народ?'"},
	{7, "7 Тие му одговорија: 'Ако бидеш добар спрема овој народ и му угодиш, ако му говориш благи зборови, тој ке ти служи во сите дни.'"},
	{8, "8 Но тој го отфрли советот, што му го дадоа старешините, па почна да се советува со младите, што беа израснале заедно со него и служеа при него;"},
	{9, "9 па им рече: 'Што ке ми советувате да им одговорам на оние лу е, што ми рекоа вака: ‘Олесни ни го игото, што ни го наложи татко ти?‘"},
	{10, "10 Младите, што беа израстане со него, му одговорија и рекоа: 'Вака кажи им на тие лу е, што ти рекле: ‘твојот татко ни наложи тешко иго, ти, пак олесни ни го,‘ - вака кажи им: ‘малиот прст ми е подебел од бедрата на татка ми."},
	{11, "11 Татко ми ви наложи тешко иго, јас, пак, ке го зголемам вашето иго; татко ми ве казнуваше до камшици, јас, пак, ке ве бијам со скорпии.‘'"},
	{12, "12 Дојде Јеровоам и сите лу е при Роваоама на третиот ден, како што им беше заповедал царот, велејки: 'Дојдете при мене пак по три дена.'"},
	{13, "13 Тогаш царот им одговори грубо, бидејки царот Ровоам го отфрли советот на старешините, и им говорешие според советот на младите вака:"},
	{14, "14 'Татко ми ви наложи тешко иго, јас пак ке го зголемам; татко ми ве казнуваше со камшици, јас, пак, ке ве бијам со скорпии.'"},
	{15, "15 И царот не го послуша народот, зашто така беше определено од Бога, за да го исполни Господ зборот Свој, што го беше изрекол преку Силоамецот Ахија на Наватовиот син Јеровоама."},
	{16, "16 Кога сиот Израил виде, дека царот не го слуша, народот му одговори на царот, велејки: 'Како дел имаме во Давида? За нас нема дел во синот Јесеев; по шаторите свои, Израиле! Сега знај го својот дом, Давиде!' И се разотидоа сите Израилци по шаторите свои."},
	{17, "17 А Ровоам остана цар само на синовите Израилеви, што живееја во Јудините градови."},
	{18, "18 Царот Ровоам го испрати Адонирама, кој беше над даноците, но синовите Израилеви го затрупаа со камења, и тој умре. А царот Ровоам побрза да седни в кола, за да избега во Ерусалим."},
	{19, "19 Така се одметнаа Израилците од домот Давидов и до денес."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct mk11 poems[] = {
	{1, "1 Ровоам пристигна во Ерусалим и свика од Јудиниот и Венијаминовиот дом сто и осумдесет иљади одбрани војници, за да војуваат против Израилот и да му го вратат царството на Ровоама."},
	{2, "2 И би слово Господово до Самеја, човекот Божји, со кое беше речено:"},
	{3, "3 'Кажи му на Соломоновиот син Ровоам, цар Јудејски, и на сиот Израил во Јудиното и Венијаминовото племе:"},
	{4, "4 вака вели Господ: ‘не одете и не почнувајте војна со браката свои; вратете се секој во домот свој, зашто Јас го направив тоа.‘ Тие ги послушаа зборовите Господови и се вратија од походот против Јеровоама."},
	{5, "5 Ровоам живееше во Ерусалим и ги загради градовите во Јудеја со sидови."},
	{6, "6 Го утврди Витлеем, Етам, Текуја,"},
	{7, "7 Ветсур, Сокхот, Одолам,"},
	{8, "8 Гет, Марисан, Зиф,"},
	{9, "9 Адурем, Лахис, Азиер,"},
	{10, "10 Салај, Елон и Хеврон, што беа на Јудиното и на Венијаминовото племе."},
	{11, "11 Ги зацврсти тие тврдини и постави во нив началници и житници ,и одделенија за елеј и вино."},
	{12, "12 И на секој град му даде штитови и копја и ги зацврсти прилично добро. Под него останаа Јуда и Венијамин."},
	{13, "13 Свештениците и левитите, колу што ги имаше по целата земја Израилска, се собраа при него од сите краишта,"},
	{14, "14 зашто левитите ги оставија селата свои и владенијата свои и дојдоа во Јудеја и во Ерусалим, бидејки Јеровоам и синовите негови ги отстранија од свештенството Господово"},
	{15, "15 и си поставија жреци во идолските светилишта на ридовите, за идолите и за телињата што тој ги направи."},
	{16, "16 А по нив и од сите племиња Израилеви, кои го управија срцето свое да Го бараат Господа, Бога Израилев, одеа во Ерусалим, за да Му принесат жртви на Господа, Бога на татковците свои."},
	{17, "17 Тие го зацврстија царството Јудино и го поддржуваа Соломоновиот син Ровоам три години, зашто одеа по патот на Давида и Соломона во тие три години."},
	{18, "18 Ровоам си ја зеде за жена Маелата, керката на Јеримута, син Давидов, и на Авигеја, керка на Елијава, син Јесеев;"},
	{19, "19 И таа му ги роди синовите: Јеуса, Саморија и Зама."},
	{20, "20 По неа тој ја зеде Маха, керка Авесаломова, и таа му ги роди Авија, Јевтија, Зиза и Салимота."},
	{21, "21 Ровоам ја сакаше Маха, Авесаломовата керка, повеке од сите свои жени и наложници, зашто тој имаше осумнаесет жени и шеесет наложници, и роди дваесет и осум синови и шеесет керки."},
	{22, "22 Ровоам го постави Авија, синот на Маха, за началник и кнез над браката свои, зашто сакаше да го направи цар."},
	{23, "23 Па мудро работејки, тој ги распрати сите синови свои по сите земји на Јуда и Венијамина, по сите утврдени градови, им даде многу храна и за нив доведе многу жени."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct mk12 poems[] = {
	{1, "1 Кога царството на Ровоам се зацврсти, и тој стана силен, го остави законот Господов, а заедно со него и сиот Израил."},
	{2, "2 На петтата година од Ровоамовото царување Сусаким, египетскиот цар, се крена против Ерусалим, - зашто беа отстапиле од Господа, -"},
	{3, "3 со иљада и двесте коли и шеесет иљади коњаници; а дојдениот од Египет со него народ: Ливијци, Троглодити и Етиопјани, - број немаше;"},
	{4, "4 и ги презеде утврдените градови во Јудеја и стигна до Ерусалим."},
	{5, "5 Тогаш пророкот Самеј дојде при Ровоама и при јудејските кнезови, што се беа собрале во Ерусалим, за да се спасат од Сусакима, и им рече: 'Вака вели Господ: ‘Вие Ме оставивте, затоа и Јас ве оставам во рацете на Сусакима.‘'"},
	{6, "6 Кнезовите Израилеви и царот се смирија и рекоа: 'Праведен е Господ!'"},
	{7, "7 Кога виде Господ, дека тие се смирија, дојде словото Господово до Самеја и беше речено: 'Нема да ги погубам, а скоро ке им дадам избавление; Мојот гнев нема да се излее врз Ерусалим преку раката Сусакимова;"},
	{8, "8 бидејки тие ке му станат слуги, за да знаат што е тоа да Ми служат Мене и да им служат на земните царства.'"},
	{9, "9 Египетскиот цар Сусаким дојде во Ерусалим и ги одзеде ризниците на домот Господов и ризниците на царскиот дом; одзеде се, ги одзеде и златните штитови, што ги беше направил Соломон."},
	{10, "10 Но царот Ровоам направи место нив бакарни штитови и ги предаде во рацете на старешините над чуварите, што го чуваа влезот во царскиот дом."},
	{11, "11 Кога одеше царот во Господовиот дом, доа аа чуварите и ги носеа, а потоа пак ги вракаа во живеалиштето на чуварите."},
	{12, "12 И кога се смири, гневот Господов се одврати од него и не го погуби до крај; па и во Јудеја имаше нешто добро."},
	{13, "13 Се зацврсти царот Ровоам во Ерусалим и царуваше. Кога се зацари, тој беше на четириесет и една година, а царуваше седумнаесет години во Ерусалим, во градот, кого Господ го избра ме у сите колена Израилеви, за да остане таму засекогаш името Негово. Мајка му се викаше Нама, Амонитка."},
	{14, "14 И вршеше зло, зашто не го беше расположил срцето свое за да Го побара Господа."},
	{15, "15 Делата на Ровоама, први и последни, се опишани во записите на пророкот Самеја и јасновидецот Ада во родословијата. Ровоам имаше војни со Јеровоама во сите денови."},
	{16, "16 Ровоам почина при татковците свои и беше погребан во Давидовиот град. И место него стана цар синот негов Авија."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view13() {
struct mk13 poems[] = {
	{1, "1 Во осумнаесеттата година од царувањето на Јеровоама стана цар Авија над Јуда;"},
	{2, "2 тој царуваше три години во Ерусалим; мајка му се викаше Михаја, керка Урилова, од Гаваон. И Авија водеше војна со Јеровоама."},
	{3, "3 Авија изведе во војна војска од храбри лу е, четиристотини иљади одбрани души, а Јеровоам излезе против него во бој со осумстотини иљади души, исто така одбрани јунаци."},
	{4, "4 И застана Авиј на врвот од планината Семераим, една од Ефремовата гора, и рече: 'Чујте ме, Јеровоаме и сите Израилци!"},
	{5, "5 Не знаете ли, дека Господ, Бог Израилев, му го даде на Давида царството над Израилот засекогаш, нему и на синовите негови, според заветот вечен.'"},
	{6, "6 Но беше востанал Јеровоам, синот Наватов, слуга на Давидовиот син Соломона, и се побуни против господарот свој."},
	{7, "7 И се собраа околу него лу е долни, развратници и станаа против Ровоама, синот Соломонов; а Ровоам беше млад и со слабо срце, и не издржа против нив."},
	{8, "8 А сега вие мислите да устоите против царството Господово, кое е во рацете на Давидовите синови, зашто вас ве има многу и затоа што имате златни телиња, што ви ги направи Јеровоам за богови."},
	{9, "9 Нели вие ги изгонивте свештениците Господови, синовите Аронови, и левитите, и си поставивте свештеници, какви што има при народите во другите земји? Секој, што доа а за свое посветување со теле и седум овни, тој станува кај вас свештеник на лажни богови."},
	{10, "10 А кај нас - Господ е наш Бог; ние не сме Го оставиле; не Господа Му служат како свештеници синовите Аронови, и левитите се на својата работа."},
	{11, "11 Тие Му жртвуваат на Господа сепаленици, секое утро и секоја вечер, и миризливо кадиво, ги слагаат лебовите еден врз друг на чиста трпеза и ги палат кандилцата на златниот светилник за да горат секоја вечер, зашто ние ја пазиме наредбата на Господа, нашиот Бог, а вие сте Го оставиле."},
	{12, "12 И, ете, нам на чело ни е Бог и Неговите свештеници и громогласните труби, за да грмат против вас. Синови Израилеви, не војувајте против Господа, Бога на вашите татковци, зашто нема да успеете!"},
	{13, "13 Во тоа време Јеровоам направи заседа зад нивниот тил, така што самиот тој беше пред Јудејците, а заседата - зад нив."},
	{14, "14 И кога се обsрнаа Јудејците, - а тоа борба и отспреди и одзади; и повикаа кон Господа, а свештениците затрубија со труби."},
	{15, "15 И почнаа да викаат Јудејците. И кога Јудејците повторно извикаа, Бог го порзи Јеровоама и сите Израилци пред Авија и Јуда."},
	{16, "16 И синовите Израилеви почнаа да бегаа пред Јудејците; и Бог го предаде во рацете нивни."},
	{17, "17 Авија и народот негов страшно ги поразија; и паднаа од Израилот петстотини иљади одбрани јунаци."},
	{18, "18 Тогаш синовите Израилеви се смирија, а синовите Јудини станаа силни, зашто се надеваа на Господа, Бога на татковците нивни."},
	{19, "19 Авија, пак, го гонеше Јеровоама и му ги одзеде градовите: Ветил и нему потчинетите села, Јесин со селата негови и Ефрон со потчинетите му села."},
	{20, "20 И Јеровоам веке не се совзеде во дните на Авија. Господ го порази и тој умре."},
	{21, "21 Авија, пак, се засили; си зеде четиринаесет жени и роди дваесет и два сина и шеснаесет керки."},
	{22, "22 Другите дела на Авија, делата негови и зборовите негови се опишани во записите на пророкот Ада."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view14() {
struct mk14 poems[] = {
	{1, "1 И почина Авија при татковците свои и го погребаа во Давидовиот град. Место него цар стана синот негов Аса. Во неговите дни земјата беше спокојна десет години."},
	{2, "2 Аса го вршеше она, што беше добро и угодно пред очите на својот Господ Бог;"},
	{3, "3 тој ги премавна жртвениците на ту ите богови и идолските светилишта, ги скрши статуите и ги исече младите дубрави;"},
	{4, "4 им заповеда на Јудејците да Го бараат Господа, Бога на татковците нивни, да го исполнуваат законот Негов и заповедите;"},
	{5, "5 ги премавна од сите градови Јудините идолски светилишта и статуите на сонцето. И царството негово беше спокојно."},
	{6, "6 И бидејки беше спокојна земјата, тој изгради тврдина во Јудеја; тој не војуваше во тие години, зашто Господ му беше дал спокојство."},
	{7, "7 И им рече Аса на Јудејците: 'Да ги изградиме овие градови и да ги заградиме со sидиште и кули, со порти и клучеви; земјата е уште наша, зашто ние Го побаравме Господа, нашиот Бог; ние Го побаравме, и Он ни даде спокојство од сите страни.' И почнаа да градат, и успеваа."},
	{8, "8 Воената сила на Аса беше: од Јудиното колено триста иљади вооружени со штитови и копја, од Венијаминовото колено двесте и осумдесет иљади јунаци, вооружени со штитови и стрелци со лак."},
	{9, "9 И се крена против нив Зарај, Етиопјанин, со иљада иљади војска и триста коли, и стигна до Мариса."},
	{10, "10 Му излезе Аса во пресрет, и се распоредија за борба во Софатската долина при Мариса."},
	{11, "11 Повика Аса кон Господа, својот Бог, и рече: 'Господи, нели е во Твоја сила да им помагаш на силни и слаби? Тогаш помогни ни нам, Господи, Боже, наш, зашто ние на Тебе се надеваме и во Твое име излеговме против ова множество. Господи, Ти си наш Бог; да не биде човекот посилен од Тебе.'"},
	{12, "12 И Господ ги порази Етиопјаните пред Аса и пред Јуда, и Етиопјаните избегаа."},
	{13, "13 Аса, пак, и народот со него ги гонеше до Гедор; Етиопјаните паднаа толку, што ниеден не остана жив, зашто беа поразени пред Господа и пред Неговата војска. И собраа прилично голем плен."},
	{14, "14 Ги разрушија сите градови околу Гедор, зашто ужас од Господа налета врз нив; и ги ограбија сите градови и изнесоа од нив многу голем плен."},
	{15, "15 Ги разрушија и пастирските колиби, ограбија многу стада од ситен добиток и камили, и се вратија во Ерусалим."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view15() {
struct mk15 poems[] = {
	{1, "1 Тогаш Духот Божји слезе врз Азарија, син Ададов."},
	{2, "2 Тој излезе да го пресретне Аса и сите Јудејци и Венијаминовци, и им рече: 'Послушајте ме, Аса и сите Јудејци и Венијаминци: Господ е со вас, кога сте вие со Него; и ако Го барате, ке Го најдете; ако, пак, Го оставите, и Он ке ве остави."},
	{3, "3 Многу дни Израилот ке биде без вистински Бог, без свештеник да поучува, и без закон;"},
	{4, "4 но кога во притеснетоста своја ке се обрне кон Господа, Бога Израилев, и ке Го побара, и ке Го најде."},
	{5, "5 Во тие времиња нема да има мир ни за оние што излегуваат, ни за оние што влегуваат; зашто ке има голема збрка ме у сите жители земни;"},
	{6, "6 народ ке се бие со народ, и град со град, затоа што ке ги смути Бог со секакви невољи."},
	{7, "7 Но вие држете се цврсто, и рацете ваши да не ослабуваат, зашто ке има награда за делата ваши.'"},
	{8, "8 Кога ги чу Аса тие зборови и пророштвата на Асарија, син на пророкот Адада, тој се охрабри и ги премавна незнабожечките гнасотии од целата земја Јудејска и Венијаминова, и од градовите на Евремовата гора, што ги беше презел, го обнови и жртвеникот Господов, што беше пред Господовиот трем."},
	{9, "9 Тогаш ги собра сите Јудејци и Венијаминовци и преселени од Ефрема, Манасија и Симеона, кои живееја со нив; зашто многу Израилци преминаа кон него, откако видоа, дека Господ, неговиот Бог, е со него."},
	{10, "10 И се собраа во Ерусалим во третиот месец на петнаесеттата година од царувањето на Аса."},
	{11, "11 Во тој ден принесоа жртва на Господа од пленот, што го донесоа: од крупниот добиток седумстотини и од ситниот - седумдесет иљади."},
	{12, "12 Склучија завет да Го бараат Господа, Бога на татковците свои, од се срце и од сета душа;"},
	{13, "13 а секој, што не Го побара Господа, Бога Израилев, да умре - бил тој мал или голем, маж или жена."},
	{14, "14 И се заколнаа во Господа громогласно со восклици и при звукот на трубите и роговите."},
	{15, "15 И сите Јудејци се радува на таа заклетва, зашто се колнеа од се срце и со сета воља. Го бараа Господа, и Го најдоа. Тогаш Господ им даде спокојствие од сите страни."},
	{16, "16 А мајка си Маха царот ја лиши од царското достоинсто, затоа шти беше и служела на Астарта. Аса го сруши идолот нејзин, го исече на парчиња и го изгори во Кедронскиот дол."},
	{17, "17 Иако идолските светилишта не беа премавнати во Израилот, но срцето на Аса беше наполно предадено на Господа во сите дни негови."},
	{18, "18 Тој го внесе посветеното од таткото свој во Божјиот дом; среброто, златото и садовите."},
	{19, "19 И немаше војна до триесет и петтата година од царувањето на Аса."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view16() {
struct mk16 poems[] = {
	{1, "1 Во триесет и шестата година од царувањето на Аса, израилскиот цар Васа се крена против Јудеја и почна да ја гради Рама, за да не му дозволи никому ниту да излегува од јудејскиот цар Аса, ниту да доа а кај него."},
	{2, "2 Тогаш Аса изнесе сребро и злато од ризниците на домот Господов и на царскиот дом и ги испрати до сирискиот цар Вен-Адад, кој живееше во Дамаск, велејки:"},
	{3, "3 'Да биде сојуз ме у мене и тебе, како што беше ме у татко ми и таткото твој; ти испракам сребро и злато: оди и раскини го сојузот свој со израилскиот цар Васа, за да се повлече од мене.'"},
	{4, "4 Вен-Адад го послуша Аса и испрати свои војводи, што ги имаше кај себеси, против израилските градови, и тие го опустошија Ајнон, Дан и Авелмаим и сите житници во Нефарлимовите градови."},
	{5, "5 Кога чу за тоа Васа, престана да ја гради Рама и ја прекина работата своја."},
	{6, "6 А царот Аса ги собра сите Јудејци, и тие ги изнесоа од Рама камењата и дрвата, што ги употребуваше Васа за градење, и ги изгради со нив Гаваја и Мисфа."},
	{7, "7 Во тоа време дојде јасновидецот Ананиј при јудејскиот цар Аса и му рече: 'Бидејки ти се потпре на сирискиот цар, а не си се надевал на Господа, твојот Бог, затоа се спаси од рацете твои војската на сирискиот цар."},
	{8, "8 Етипците и Ливијците не беа ли со поголема сила и со многу повеке коли и коњаници? Но штом ти се надеваше на Госпдоа, и Он ги предаде во раката твоја,"},
	{9, "9 зашто очите Господови ја гледаат целата земја, за да им помагаат на оние, чие срце наполно Му е предадено Нему. Ти сега постапи неразумно; затоа отсега ке имаш војни.'"},
	{10, "10 Тогаш Аса се налути на јасновидецот и го затвори во темница, бидејки беше раздразнет од тоа против него. Во тоа време Аас го притискаа и некои од народот."},
	{11, "11 Ете, делата на Аса, први и последни, се опишани во книгата на царевите јудејски и израилски."},
	{12, "12 На триесет и деветтата година од царувањето свое Аса се разболе во нозете, и болеста негова се прошири до горните делови на телото; но во болеста своја не Го побара Господа, туку лекари."},
	{13, "13 И почина Аса при татковците свои и умре во четириесет и првата година од царувањето свои."},
	{14, "14 И го погребаа во гробницата, кој што сам си ја беше изградил во Давидовиот град; го положија на одарот, затрупан со благопријатни мириси и со разни вештачки масти, какви што изгореа големо множество за него."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view17() {
struct mk17 poems[] = {
	{1, "1 Наместо него стана цар синот негов Јосафат, којшто се зацврсти против Израилците."},
	{2, "2 Тој распореди војски по сите утврдени градови на Јудеја и постави стражи по земјата Јудејска и по градовите Ефремови, што ги беше завладеал татко му Аса."},
	{3, "3 И Господ беше со Јосафата, зашто одеше по правите патишта на таткото свој Давид и не ги побара Вааловците,"},
	{4, "4 туку Го побара Бога на таткото свој и постапуваше по Неговите заповеди, а не по делата на Израилците."},
	{5, "5 И Господ го зацврсти царството во рацете негови; сите Јудејци му носеа подароци на Јосафата; тој се здоби со големо богатство и слава."},
	{6, "6 Срцето негово му се возвиси во Господовите патишта; притоа тој ги премавна оброчиштата и младите шуми во Јудеја."},
	{7, "7 А на третата година од царувањето ги испрати кнезовите свои Бенхаил, Овадија, Захарија, Натанаила, и Михеја да го поучуваат народот по Јудините градови,"},
	{8, "8 и со нив левитите: Семаја, Нетанија, Зевадија, Азаила, Семирамота, Јонатана, Адонија, Товија и Тов-Адонија, а со нив уште и свештениците Елишам и Јорам."},
	{9, "9 Тие ги подучуваа Јудејците, носејки ја со себе книгата на законот Господов; ги обиколуваа сите јудејски градови и го учеа народот."},
	{10, "10 И ги обзеде страв Господов сите земни царста околу Јудеја, и не војуваа со Јосафата."},
	{11, "11 А од Филистејците му носеа на Јосафата дарови и сребро за данок; исто така и Арапите му донесуваа ситен добиток: седум иљади и седумстотини овни и седум иљади и седумстотини јарци."},
	{12, "12 Се издигаше Јосафат се повеке, и изгради во Јудеја домови градови и тврдини."},
	{13, "13 Тој имаше големо богатство во јудејските градови, а во Ерусалим - храбри борци."},
	{14, "14 Еве го нивниот список според домовите на татковците нивни: од Јуда иљаданачалници: Адна водач, којшто имаше триста иљади храбри војници;"},
	{15, "15 по него Јоанан началник, кој имаше двесте и осумдесет иљади;"},
	{16, "16 по него Амасија, Зихриев син, кој се беше посветил на Господа; тој имаше двесте иљади силни војници."},
	{17, "17 Од Венијамина: храбриот војник Елијад, кој имаше двесте иљади вооружени со лак и штит;"},
	{18, "18 по него Јозавад, кој имаше сто и осумдесет иљади вооружени војници."},
	{19, "19 Ете, тие му служеа на царот, освен од оние, што ги беше распоредил царот во утврдените градови по цела Јудеја."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view18() {
struct mk18 poems[] = {
	{1, "1 Јосафат имаше големо богатство и слава, па се сроди со Ахава."},
	{2, "2 По неколку години отиде при Ахава во Самарија; и закла Ахав многу добиток, ситен и крупен, за него и за лу ето со него и го убедуваше да се кренат притив Рамот Галадски."},
	{3, "3 И му рече Ахав, царот израилски, на Јосафата, царот јудејски: 'Kе дојдеш ли со мене во Рамот Галадски?' Тој му одговори: 'Како што ке одиш ти, така и јас, како твојот народ, така и мојот народ; ке дојдам со тебе во војна!'"},
	{4, "4 Уште му рече Јосафат на царот израилски: 'Прашај уште денес што ке рече Господ.'"},
	{5, "5 Израилскиот цар собра четиристотини души пророци и им рече: 'Да одиме ли во војна против Рамот Галадски, или ке мируваме?' Тие одговорија: 'Оди, и Господ ке го предаде во раката на царот.'"},
	{6, "6 Јосафат праша: 'Нема ли тука уште некој пророк Господов, да го прашаме и него?'"},
	{7, "7 Му одговори царот израилски на Јосафата: 'Има уште еден човек, преку кого можеме да Го прашаме Господа, но јас него не го сакам, зашто тој не пророкоува добро за мене, туку секогаш пророкува лошто; тој е Михеј, син Јемлиев.' Јосафат му рече: 'Не зборувај така, цару!'"},
	{8, "8 Царот израилски повика еден дворјанин и рече: 'Оди поскоро да го повикаш Михеја, синот Јемлиев!'"},
	{9, "9 А царот израилски Ахав и Јосафат, царот јудејски, седеа секој на престолот свој, облечени во царска облека, седеа на плоштадот пред Самариските порти, и сите пророкуваа пред нив."},
	{10, "10 Седекија, синот Хананов, си беше направил железни рогови и рече: 'Вака вели Господ: ‘со нив ке ги избодеш Сиријците, додека не ги истребиш.‘'"},
	{11, "11 И сите пророци го пророкуваа истото, велејки: 'Оди против Рамот Галадски, ке имаш успех, и Господ ке го предаде во раката на царот.'"},
	{12, "12 Испратениот, што отиде да го повика Михеја, му рече: 'Ене, пророците едногласно му претскажуваат добро на царот; и твојот збор нека биде таков, како на секого од нив: изречи и ти добро.'"},
	{13, "13 Михеј одговори и рече: 'Жив Господ! Она што ке ми каже Господ, тоа ке го изречам.'"},
	{14, "14 Кога дојде при царот, а царот му рече: 'Михеј, да одиме ли во војна против Рамот Галадски, или да се воздржиме?' Тој одговори: 'Одете, ке имате успех; тие ке бидат предадени во рацете ваши.'"},
	{15, "15 Царот му рече: 'Колку пати ке те заколнувам да не ми говориш ништо, освен вистината во името Господово?'"},
	{16, "16 Тогаш Михеј рече: 'Ги видов сите синови на Израилот, распрснати по горите како овци без пастир, - и Господ рече: ‘тие немаат водач, секој нека се врати со мир во домот свој!‘'"},
	{17, "17 Царот израилски му рече на Јосафата: 'Не ли ти реков, дека тој не ми пророкува добро, туку само лошо?'"},
	{18, "18 Михеј пак рече: 'Тогаш чујте го зборот Господов: Го видов Господа, седнат на Својот престол, а сета војска небеска стоеше десно и лево од Него."},
	{19, "19 И рече Господ: ‘Кој ке го измами Ахава, израилскиот цар, да оди и да загине во Рамот Галадски?‘ И еден велеше вака, друг велеше инаку."},
	{20, "20 Истапи еден дух, застана пред лицето на Господа и рече: ‘Јас ке го измамам.‘ А Господ праша: ‘со што?‘"},
	{21, "21 Тој одговори: ‘Kе излезам и ке станам дух на лагата во устата на сите пророци негови.‘ И рече Он: ‘Ти ке го подмамиш и ке успееш; оди и направи така.‘'"},
	{22, "22 И сега, ете, Господ допушти да влезе духот на лагата во устата на тие твои пророци, но Господ рече не е добро за тебе.'"},
	{23, "23 Тогаш пристапи Седекија, син на Ханана, па го плесна Михема и рече: 'По кој пат премина од мене Духот Господов, за да говори во тебе?'"},
	{24, "24 А Михеј рече: 'Ете, ке го видиш тоа во оној ден, кога ке бегаш од соба во соба, за да се сокриеш.'"},
	{25, "25 Тогаш израилскиот цар рече: 'Земете го Михеја и одведете го при градоначланикот Емира и при кнезот Јоаса, царевиот син,"},
	{26, "26 и речете, вака вели царот: ‘затворете го овој во темница и хранете го скудно со леб и вода, додека да се вратам со мир.‘'"},
	{27, "27 А Михеј рече: 'Ако се вратиш со мир, тогаш не говорел Господ со мене.' И пак рече: 'Чујте го ова сите лу е!'"},
	{28, "28 И тргнаа царот израилски и Јосафат, царот јудејски, кон Рамот Галадски."},
	{29, "29 И царот израилски му рече на Јосафата: 'Јас ке се преоблечам и ке влезам во борба, а ти облечи ги царските одежди. И се преоблече царот израилски, и влегоа во битка."},
	{30, "30 Тогаш царот сириски од својата кола им заповеда на војводите: 'Не удирајте ни на мал ни на голем, туку само на царот израилски!'"},
	{31, "31 А кога началниците на колите го видоа Јосафата, си помислија: тоа е царот израилски, - и го опколија, за да се удрат со него. Но Јосафат извика, и Господ му помогна, и Бог ги одврати од него."},
	{32, "32 Штом началниците на колите видоа, дека не беше царот израилски, се вратија од него."},
	{33, "33 Во тоа време еден човек го затегна случајно лакот свој и го рани израилскиот цар низ составот на оклопот негов. И тој му кажа на човекот: 'Врати се назад и изведи ме од војската, зашто сум ранет.'"},
	{34, "34 Но борбата во тој ден се засили; и израилскиот цар седеше на колата спроти Сиријците до вечерта и умре по зајдисонце."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view19() {
struct mk19 poems[] = {
	{1, "1 Кога Јосафат, царот јудејски, се вракаше со мир во домот свој во Ерусалим,"},
	{2, "2 излезе да го пресретни јановидецот Јуј, син Ананиев, и му рече на царот Јосафата: 'Требаше ли да му помагаш на безбожникот и да ги сакаш оние, што Го мразат Господа? Затоа гневот Господов падна врз тебе."},
	{3, "3 Но добро се најде во тебе, зашто ти ги истреби идолите во земјата Јудејска и го расположи срцето свое за да Го побараш Бога.'"},
	{4, "4 Јосафат живееше во Ерусалим. И пак почна да го обиколува народот свој од Вирсавија до Ефремовата гора, и ги поврати кон Господа, Бога на татковците нивни."},
	{5, "5 И постави судии во земјата по сите утврдени градови на Јудеја, во секој град,"},
	{6, "6 па им рече на судиите: 'Внимавајте што правите; вие вршите не суд човечки, туку суд Господов; во судската работа Бог е со вас."},
	{7, "7 Затоа стравот Господов нека биде врз вас: работете внимателно, зашто кај Господа, нашиот Бог, нема неправда, ни лицемерие, ниту примање дарови.'"},
	{8, "8 Јосафат и во Ерусалим постави некои левити и свештеници и старешини на домовите татковци во Израилот - за суд Господов и за тужби. И се вратија во Ерусалим."},
	{9, "9 Тогаш им заповеда, велејки: 'Така работете со страв Господов, со верност и со чисто срце:"},
	{10, "10 при секоја расправија, каква што ке дојде кај вас од браката ваши, што живеат по градовите свои, било за крвнина, или за закон, заповед, уредба и обреди, објаснувајте им да не грешат пред Господа, та да не дојде гневот Негов врз вас и врз браката ваши: така работете, и нема да згрешите.'"},
	{11, "11 И ете, првосвештеникот Амарија е над вас за секоја Господова работа, а Завадија, синот Измаилов, кнез на Јудиниот дом, - за секоја царска работа, а и книжниците и левитите се пред вас. Бидете црвсти и работете, и Господ ке биде со добриот.'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view20() {
struct mk20 poems[] = {
	{1, "1 Потоа Моавците и Амонитите, а со нив и некои од земјата Моавска, појдоа во војна против Јосафата."},
	{2, "2 Дојдоа и му јавија на Јосафата, велејки: 'Против тебе доа а големо множесто народ од преку море, од Сирија, и веке се во Асасан-Тамар, односно во Енгеди."},
	{3, "3 Јосафат се уплаши и го сврти лицето свое и Го побара Господа и објави пост во цела Јудеја."},
	{4, "4 Се собраа Јудејци да молат за помош од Господа; дојдоа да Го молат Господа од сите Јудини градови."},
	{5, "5 И застана Јосафат во собранието на Јудејците и на Ерусалимците во Домот Господов, пред новиот трем,"},
	{6, "6 и рече: 'Господи, Боже на татковците наши! Не си ли Ти Бог на небото? Ти владееш над сите царства на народите; и во Твојата рака е силата и цврстината, и никој не може да устои спроти Тебе!"},
	{7, "7 Не ли Ти, Боже наш, ги истера жителите на оваа земја, пред лицето на Твојот народ Израилот и му ја даде засекогаш на семето од Авраама, Твојот возљубен?"},
	{8, "8 Тие се населија во неа и Ти изградија во неа светилиште во Твое име, велејки:"},
	{9, "9 ‘ако дојде врз нас невоља: меч-погубен, или помор, или глад, ке застанеме пред овој дом и пред Твоето лице, зашто името Твое е во тој дом; и во маките свои ке повикаме кон Тебе, и ти ке не чуеш и ке не избавиш.‘"},
	{10, "10 И сега, еве, Амонитите и Моавците и жителите на гората Сеир, преку чии земји не дозволи да преминат Израилците, кога доа аа од Египетската земја, па затоа тие ги одминаа и не ги сотреа."},
	{11, "11 А, еве, тие ни вракаат сега со тоа, што дошле да не истераат од Твоето наследствено владение, што си ни го дал."},
	{12, "12 Боже наш! Суди им Ти. Зашто ние немаме сила против тоа големо множество, што не нападнало и не знаеме, што да правиме; но очите ни се кон Тебе.'"},
	{13, "13 Сите Јудејци стоеја пред лицето Господово, и нивните мали деца, жените нивни и синовите нивни."},
	{14, "14 Тогаш Духот Господов слезе среде собранието врз Јозиила, синот на Захарија, син Ванев, син Јеилов, син Матаниев, Левит од Асафовите синови."},
	{15, "15 и рече: 'Чујте сите Јудејци и жители ерусалимски, и ти, цару Јосафате! Вака ви вели Господ ваш: ‘Не плашете се и не стравувајте од тоа големо множество, зашто војната не е ваша, туку Божја."},
	{16, "16 Излезете утре против нив: ете, тие ке се искачуваат по ридот Асис, вие ке ги најдете на крајот на долината, спрема пустињата Јеруил.‘"},
	{17, "17 Овој пат нема вие да се борите: застанете, стојте и гледајте го спасението од Господа, што ви се испрака. Јудо и Ерусалиме, не плашете се и не стравувајте! Излезете утре против нив, и Господ ке биде со вас.'"},
	{18, "18 Јосафат се поклони со лицето до земја, и сите Јудејци и жители ерусалимски паднаа пред Господа, за да Му се поклонат."},
	{19, "19 А левитите од синовите Катови и од синовите Корееви почнаа да Го слават Господа, Бога Израилев, со многу висок глас."},
	{20, "20 Утредента станаа рано и тргнаа кон Текојската пустиња, и кога тргнаа, застана Јосафат и рече: 'Чујте ме, Јудејци и жители ерусалимски! Верувајте Му на Господа, вашиот Бог, и бидете цврсти; верувајте им на пророците Негови и ке имате успех.'"},
	{21, "21 Потоа се посоветува со народот и постави певци пред Господа, тие со своето благолепие, одејки пред војската, да ја слават светоста и да велат: 'Фалете Го Господа, зашто милоста Негова е засекогаш!'"},
	{22, "22 И кога почнаа да воскликнуваат и да славословат, Господ предизвика несогласност ме у Амонитите, Моавците и жителите на гората Сеир, што ја беа нападнале Јудеја, и тие беа разбиени:"},
	{23, "23 зашто Амонитите и Моавците се кренаа против жителите на гората Сеир, и ги биеја и ги истребуваа, а кога завршија со жителите на Сеир, почнаа да се истребуваат едни со други."},
	{24, "24 И кога Јудејците дојдоа на ридот при пустињата и го видоа она множесто, а таму - трупови, испружени по земјата, и никој не се беше спасил."},
	{25, "25 Дојде Јосафат и народот негов да собираат плен, најдоа кај нив прилично многу и богатство, и облека и скапоцени работи, и собраа толку, што не можеа да носат. Три дни собираа плен - толку многу голем беше тој!"},
	{26, "26 А на четвртиот ден се собраа во долината на благословението, бидејки таму Го благословија Господа. Затоа тоа место се вика Долина на благословението и до денес."},
	{27, "27 Тогаш сите Јудејци и ерусалимците, на чело со Јосафата, тргнаа да се вратат во Ерусалим радосно, зашто Господ им даде победа над непријателите нивни."},
	{28, "28 И дојдоа во Ерусалим со псалтири, гусли и труби пред домот Господов."},
	{29, "29 И страв Божји нападна врз сите царства земни, кога слушнаа, дека Сам Господ војувал против непријателите на Израилот."},
	{30, "30 И царството Јосафатово се успокои; Господ му даде мир од сите страни."},
	{31, "31 Така царуваше Јосафат над Јудеја. Кога стана цар, беше на триесет и пет години, и царуваше во Ерусалим дваесет и пет години. Мајка му се викаше Азува, керка Салиева."},
	{32, "32 Тој одеше по патот на татка си Аса и не се отстрани од него, вршејки го она што е угодно пред очите на Господа."},
	{33, "33 Само идолските светилишта уште не беа разрушени, народот се уште не го беше свртел срцето свое кон Бога на татковците свои."},
	{34, "34 Другите дела Јосафатови, први и последни, опишани се во записите на Јуја, синот Ананиев, кои се внесени во книгата на израилските цареви."},
	{35, "35 Но потоа Јосафат, царот јудејски, се здружи со Охозија, цар израилски, кој постапуваше беззаконо;"},
	{36, "36 се поврза со него, за да градат кораби, што ке ги испракаат во Тарсис; а изградија и кораби во Гасион-Гавер."},
	{37, "37 Тогаш Елиезер, синот Додиев од Мариса, пророкува за Јосафата и рече: 'Бидејки си се здружил со Охозија, Господ ке го разруши твоето дело'. И корабите се разбија и не можеа да одат во Тарсис."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view21() {
struct mk21 poems[] = {
	{1, "1 И почина Јосафат при татковците свои и беше погребан со татковците свои во Давидовиот град. Место него цар стана синот негов Јорам."},
	{2, "2 Неговите брака, синови Јосафатови беа: Азарија, Јехиил, Захарија, Михаил и Сафатија; сите тие беа синови на Израилевиот цар Јосафат."},
	{3, "3 Нивниот татко им даде големи подароци во сребро, злато и скапоцености, заедно со утврдените градови во Јудеја, а царството му го предаде на Јорама, бидејки тој беше првороден."},
	{4, "4 Јорам стапи на татковиот престол, се утврди и ги уби со меч сите свои брака, а исто така и некои Израилеви кнезови;"},
	{5, "5 Јорам беше на триесет и две години, кога стана цар, и царуваше во Ерусалим осум години;"},
	{6, "6 тој одеше по патот на израилските цареви, како што постапуваше домот Ахавов, зашто Ахавовата керка му беше жена, - и го вршеше, она што беше неугодно пред очите Господови."},
	{7, "7 Но Господ, пак, не сакаше да го погуби домот Давидов поради заветот, што го беше склучил со Давида, и поради тоа што беше ветил да му даде светилник нему и на синовите негови за сите времиња."},
	{8, "8 Во неговите дни Едом се одметна од власта Јудина и си постави цар."},
	{9, "9 Затоа Јорам тргна со своите војводи, и со сите коли свои; и станувајки ноке, го порази Едома, кого го беа опколиле, и началниците на колите и народот избега во живеалиштата свои."},
	{10, "10 Но сепак Едом се одвои од власта на Јуда и до денес. Во исто време се одметна и Ливна од власта негова, зашто го беше оставил Господа Бога на татковците свои."},
	{11, "11 Исто така и идолски светилишта направи по горите јудејски, ги воведе во блудство ерусалимските жители и ја соблазни Јудеја."},
	{12, "12 И му дојде писмо од пророкот Илија, во кое се велеше: 'Вака говори Господ, Бог на татка ти Давида: ‘затоа што не тргна по патиштата на татка си Јосафата и по патиштата на Аса, царот јудејски,"},
	{13, "13 туку појде по патот на израилските цареви и ги воведе во блудство Јудеја и ерусалимските жители, како што го воведуваше во блудство домот Ахавов, па уште и браката свои, домот на татка си, кои беа подобри од тебе, ти ги умртви."},
	{14, "14 Затоа, еве, Господ ке го порази со голем пораз твојот народ и синовите твои, и жените твои, и целиот имот твој,"},
	{15, "15 а, пак, тебе, со лута болест, со болеста на цревата, така што од болеста ке па аат делови од утробата од ден на ден.‘'"},
	{16, "16 И го подигна Господ против Јорама духот на Филистејците и Арапите, соседи на Етиопјаните;"},
	{17, "17 и тие се кренаа против Јудеја, навлегоа во неа и го ограбија сиот имот, што беше во домот на царот, а исто така и синовите негови, и жените негови, та не му остана друг син, освен Охозија, најмалиот од синовите негови."},
	{18, "18 По сето тоа Господ ги порази цревата негови со болест неизлечива."},
	{19, "19 Така одеше одден наден, а кон крајот на втората година му паднаа цревата од болеста негова и тој умре во страшни маки; и народот не запали за него благопријатни мириси како што правеше за татковците негови;"},
	{20, "20 тој беше на триесет и две години, кога стана цар, царуваше во Ерусалим осум години, и отиде неоплакан; го погребаа во Двидовиот град, но не во царските гробници."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view22() {
struct mk22 poems[] = {
	{1, "1 Жителите ерусалимски место него за цар го поставија Охозија, најмалиот негов син, бидејки сите постари беа убиени од разбојници, што се беа приближиле до логорот со Арапите, - и така стана цар Охозија, синот на јудејскиот цар Јорама."},
	{2, "2 Охозија беше на дваесет и две години, кога стана цар, и царуваше во Еруслим една година; мајка му се викаше Готолија, керка на Амврија."},
	{3, "3 И тој исто така одеше по патиштата на Ахавовиот дом, зашто мајка му беше негова советничка во незаконските дела."},
	{4, "4 Тој го вршеше, она што беше неугодно пред очите на Господа, како домот Ахавов, зашто по смртта на татка му тој дом му беше советник, за негавата пропаст."},
	{5, "5 И, следејки го нивниот совет, Охозија отиде со израилскиот цар Јорама, син Ахавов, во војна против Азила, сирискиот цар, во Рамот Гладски. И Сиријците го ранија Јорама;"},
	{6, "6 тој се врати во Израил да се лекува од раните, што му ги нанесоа во Рама, кога војуваше со Азаила, сирискиот цар. И Охозија, синот Јорамов, цар јудејски, дојде да го посети Јорама, синот Ахавов, во Израел, бидејки тој беше болен."},
	{7, "7 Тоа беше од Бога за пропаст на Охозија, затоа што тој дојде при Јорама; зашто, откако дојде, излезе со Јорама против Јуја, синот Намесиев, кого Господ го беше помазал за истребување на домот Ахавов."},
	{8, "8 Кога Јуј извршуваше суд над домот Ахавов, ги најде кнезовите јудејски и синовите на Охозиевите брака, кои му служеа на Охозија, и ги уби."},
	{9, "9 Тогаш заповеда да го бараат Охозија; го фатија, кога се криеше во Самарија; го доведоа при Јуја, го убија и го погребаа, зашто велеа: тој е син на Јосафата, кој Го бараша Господа со сето срце свое! И не остана во домот Охозиев никој, кој би можел да царува."},
	{10, "10 А Готолија, Охозиевата мајка, откако виде, дека син и умрел, стана и го погуби сиот царски род на Јудиниот дом."},
	{11, "11 Но царсктата керка Јосавета го зеде Охозиевиот син Јоаса, го грабна ме у царските синови, кога ги убиваа, и го скри со хранителката во спалната соба. На тој начин Јосавета, керката на царот Јорама, жена на свештеникот Јодаја, сестра на Охозија, го сокри Јоаса од Готолија, и таа не го убил."},
	{12, "12 И го криеја кај нив во домот Божји шест години; а над земјата царуваше Готолија."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view23() {
struct mk23 poems[] = {
	{1, "1 Но во седмата година Јодај се охрабри и ги зеде во сојуз со себеси стоначалниците, синот Јероамов, Исмаила, синот Јоанов, Азарија, синот Овидов, Масеја, синот Адаиев, и Елисафата, син Захариев."},
	{2, "2 Тие ја обиколија земјата Јудина, ги собраа левитите од сите страни на Јудеја и Израилевите старешини на татковските домови и дојдоа во Ерусалим."},
	{3, "3 И целото собрание склучи сојуз со царот во домот Божји. И Јодај им рече: 'Еве, царскиот син треба да биде цар, како што рече Господ за синовите Давидови."},
	{4, "4 Еве, што ке направите: едната третина од вас, свештениците и левитите, што доа аа во сабота, нека бидат вратари при праговите,"},
	{5, "5 втората третина - при царскиот дом, третата третина - при портите на Јесод, а сиот народ нека биде во тремовите на домот Господов."},
	{6, "6 И никој да не влегува до домот Господов, освен свештениците и оние од левитите, што служат. Тие можат да влезат, зашто се осветени; а сиот народ нека стои на стража Господова."},
	{7, "7 И левитите нека го опколат царот од сите страни, и кој ке влезе во домот Господов, да биде убиен. И бидете при царот, кога влегува и кога излегува.'"},
	{8, "8 Левитите и сите Јудејци направија така како што заповеда свештеникот Јодај; и секој си ги зеде своите лу е, што доа аа во сабота, заедно со оние, што си заминуваа во сабота, зашто свештеникот Јодај не ги распушти смените."},
	{9, "9 Свештеникот Јодај им ги раздаде на стотниците копјата и малите и големите цар Давидови штитови, што беа во Божјиот дом;"},
	{10, "10 и го постави сиот народ, секој со оружје свое во рацете, од десната страна на храмот кај жртвеникот и при домот околу царот."},
	{11, "11 Тогаш го изведоа царскиот син, му ставија венец и го прогласија за цар; го помаза Јодај и синовите негови и извика: 'Да живее царот!'"},
	{12, "12 Кога го чу Готолија гласот на раздвижениот народ, кој го фалеше царот, излезе кај народот во домот Господен"},
	{13, "13 и виде: ете царот стои на своето возвишено место при влезот, а кај царот - кнезови и труби, и сиот народ на таа земја се весели, трубат со трубите и со свирки пеачи, вешти во славословието. Тогаш Готолија ја раскина својата облека и почна да вика: 'Заговор! заговор!'"},
	{14, "14 Тогаш свештеникот Јодај ги повика стоначалниците кои началствуваа над војската, и им рече: 'Изведете ја надвор од храмот, и кој ке тргне по неа да биде убиен со меч. Зашто свештеникот рече: не ја убивајте во домот Господов.'"},
	{15, "15 И и направија пат; а кога таа дојде при влезот на коњската врата на царскиот дом, ја убија таму."},
	{16, "16 Јодај склучи завет со целиот народ и со царот, за да бидат народ Господов."},
	{17, "17 И целиот народ отиде во Вааловото капиште та го разруши, и жртвениците негови и идолите негови ги разрушија, а Матана, Вааловиот свештеник, го убија пред жртвениците."},
	{18, "18 И им ги довери Јодај делата на Господовиот дом на свештениците и левитите и ги обнови дневните свештенички и левитски свени, како што ги беше распоредил Давид до домот Господов, да Му вознесуваат сепаленица на Господа, како што е напишано во законот Мојсеев, со радост и пеење, по Давидовата наредба."},
	{19, "19 И постави вратари при вратата на домот Господов, за да не влегува никој нечист од што и да било."},
	{20, "20 И ги зеде стоначалниците и велможите, началниците народни и целиот народ на земјата и сите го придружуваа царот од домот Господов; тие минаа низ горната врата во царскиот дом и го ставија царот да седне на царскиот престол."},
	{21, "21 И се веселеше целиот народ на таа земја и градот се смири. А Готолија ја убија со меч."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view24() {
struct mk24 poems[] = {
	{1, "1 Јоас беше на седум години, кога стана цар и царуваше во Ерусалим четириесет години; мајка му се викаше Савија, од Вирсавија."},
	{2, "2 Јоас вршеше она што беше угодно пред очите на Господа преку сите денови на свештеникот Јодај."},
	{3, "3 Јодај му зеде две жени, и тој имаше од нив синови и керки."},
	{4, "4 Потоа Јоас намисли да го обнови домот Господов,"},
	{5, "5 И ги собра свештениците и левитите и им рече: 'Одете по градовите на Јудеја и секоја година собирајте од сите Израилци сребро за одржување на домот на нашиот Бог, и побрзајте во таа работа.' Но левитите не побрзаа."},
	{6, "6 И царот го повика Јодаја, нивниот главатар, и му рече: 'Зошто не бараш од левитите да го донесуваат од Јудеја и Ерусалим данокот, уставновен за скинијата на собранието од Мојсеја, слуга Господов, и од Израилското собраните?'"},
	{7, "7 Бидејки нечестивата Готолија и синовите нејзини го беа разурнале домот Божји, и се, посветено на домот Господов, го беа употребиле за Вааловци."},
	{8, "8 Царот заповеда, та направија ковчег и го поставија при влезот на домот Господов, однадвор,"},
	{9, "9 па разгласија по Јудеја и Ерусалим да Му Го принесуваат на Господа данокот, наложен од Мојсеја, слугата Божји, на Израилците во пустињата."},
	{10, "10 Се зарадуваа сите начланици и сиот народ, па принесуваа и пуштаа во ковчежето, додека не се наполни."},
	{11, "11 И кога левитите, пак, го донесуваа ковчежето при царските чиновици, и тие гледаа, дека има многу сребро, доа аше царскиот писар и повереникот на првосвештеникот, го празнеа и пак го однесуваа и го ставаа на истото место негово. Така правеа секој ден, и собраа многу сребро."},
	{12, "12 Царот и Јодај го предаваа на распоредниците по домот Господов, и тие најмуваа каменоресци и дрводелци за подновување на домот Господов, исто така и ковачи и казанxии, за да го поправат домот Господов."},
	{13, "13 Распоредниците работеа, и со нивните раце се изврши поправката, и го дотераа домот Божји во поранешна состојба и го поправија."},
	{14, "14 И кога завршија се, му го однесоа на царот и на Јодаја останатото сребро. И направија од него садови за домот Господов, садови за служба и сепаленици, чаши и други садови, златни и сребрени. И принесуваа сепаленици во домот Господов постојано преку сите денови на Јодаја."},
	{15, "15 Јодај остаре и, откако се насити од животот, умре: тој беше на сто и триесет години кога умре."},
	{16, "16 Го погребаа во Давидовиот град при царевите, бидејки тој правеше добро во Израилот - и за Бога и за домот Негов."},
	{17, "17 Но по смртта на Јодаја дојдоа Јудејските кнезови и му се поклонија на царот; оттогаш царот почна да ги слуша."},
	{18, "18 И го оставија домот Господов, Бога на татковците свои, и почнаа да им служат на посветените дрвја и на идолите; за таа вина нивна стана гневот Господов и врз Јуда и Ерусалим."},
	{19, "19 Тој им испрати пророци за да ги повратат кон Господа и им сведочеа, но тие не ги послушаа."},
	{20, "20 И Духот Божји го исполни Захарија, синот на свештеникот Јодај, и тој застана на возвишението пред народот и им рече: 'Вака вели Господ: зошто ги прекршувате Господовите заповеди? Успех нема да имате: како што вие го оставивте Господа, така и Он ке ве остави.'"},
	{21, "21 Тогаш се побунија против него и го убија со камења, по заповед на царот Јоас, во дворот на Господовиот дом."},
	{22, "22 Царот Јоас не се сети на доброто, што му го беше направил Јодај, таткото на Захарија, а го уби синот негов. И тој, умирајки велеше: 'Нека види Господ и нека побара;'"},
	{23, "23 Откако измина годината, излезе против него сириска војска и влегоа во Јудеја и Ерусалим и ги истребија од народот сите кнезови народни и сиот плен, земен од нив и му го испратија на царот во Дамаск."},
	{24, "24 Иако сириската војска беше дошла во мал број, но Господ им предаде во рацете нивни мошне многубројна сила, затоа што Го беа оставиле Господа, Бога на татковците нивни. Тие му судеа и на Јоаса."},
	{25, "25 Кога си отидоа од него, откако го оставија во тешка болест, слугите негови направија заговор против него, заради крвта на синот на свештеникот Јодај, го убија во леглото негово, и тој умре. Го погребаа во Давидовиот град, но не го погребаа во царските гробници."},
	{26, "26 А заговорници против него беа: Завад, син на Амонитката Симеата, и Јехозавад, син на Моавката Шимрита."},
	{27, "27 За синовите негови, за многуте пророштва против него и за обновувањето на Божјиот дом е напишано во книгата на царевите. Наместо него стана цар синот негов Амасија."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view25() {
struct mk25 poems[] = {
	{1, "1 Амасија стана цар на дваесет и пет години и царуваше во Ерусалим дваесет и девет години; мајка му се викаша Јехоадан, од Ерусалим."},
	{2, "2 Тој вршеше она што беше угодно пред очите на Господа, но не со полно срце."},
	{3, "3 Кога се зацврсти на царството, тој ги уби слугите свои, што го беа убиле царот, таткото негов."},
	{4, "4 Но децата нивни не ги погуби, бидејки е напишано во законот, во книгата Мојсеева, каде што Господ заповедал, велејки: да не биваат убивани татковците заради децата, и децата да не бидат убивани заради татковците, туку секој треба да умре заради својот престап."},
	{5, "5 Амасија ги собра Јудејците, ги нареди според племињата нивни под власта на иљадници и стотници - сите Јудејци и Венијаминовци; ги преброи од дваесет години и нагоре, и ги најде триста иљади души одбрани, кои што одат во војна и држат копје и штит."},
	{6, "6 Тој најми од Израилците уште сто иљади храбри војници за сто таланти сребро."},
	{7, "7 Но дојде при него човек Божји и рече: 'Царе, нека не оди со тебе израилска војска, зашто Господ не е со Израилците, не е со никого од Ефремовите синови,"},
	{8, "8 туку оди сам, врши работа, бори се храбро во војната. Инаку, ке те фрли Бог пред непријателот, зашто во Бога има сила да поткрепи и собори.'"},
	{9, "9 Амасија му одговори на Божјиот човек: 'А што да се прави со стоте таланти, што и ги дадов на израилската војска?' Божјиот човек рече: 'Господ може да ти даде повеке од тоа.'"},
	{10, "10 Амасија ги оддели, - војската, која беше дошла при него од земјата Ефремова, - да си одат во своето место. И тие се разгневија силно против Јудеја и се вратија во своето место многу налутени."},
	{11, "11 Амасија пак се осмели и го поведе народот свој, та отиде во Солената Долина и изби десет иљади синови Сеирови;"},
	{12, "12 и десет иљади заробија живи синовите Јудини и ги одведоа на врвот од карпата, и ги турнаа оттаму и тие сите сосема се разбија."},
	{13, "13 А војската, што ја врати Амасија, за да не оди со него во војна, се растури по јудејските градови од Самарија до Ветерон, во кои уби три иљади души и собра многу плен."},
	{14, "14 Кога си дојде Амасија по поразот на Идумејците, ги пренесе боговите на Сеировите синови, ги постави кај себеси за богови и пред нив се клањаше и им кадеше."},
	{15, "15 Поради тоа се разгори гневот Господов против Амасија, и Он му испрати пророк, кој што му рече: 'Зошто прибегнуваш кон боговите на тој народ, кои што не го избавија својот народ од раката твоја?'"},
	{16, "16 Додека тој говореше, царот одговори: 'Зар те поставив за царски советник? Престани, за да не те убијат.' И пророкот престана, велејки: 'Знам, дека Господ решил да те погуби, бидејки ти го направи тоа и не го слушаше мојот совет.'"},
	{17, "17 Се посоветува Амасија, царот јудејски, и испрати да му кажат на израилскиот цар Јоас, син на Јоахаза, Јуевов син: 'Излези да се видиме лице во лице.'"},
	{18, "18 Тогаш израилскиот цар Јоас изпрати до јудејскиот цар Амасија да му кажат: 'Трнот ливански испратил да му кажат на кедарот ливански: дај ја керката си на синот мој за жена. Но минале диви sверови ливански и го изгазиле тој трн."},
	{19, "19 Ти велиш: ете, ги избив Идумејците, - и срцето твое се возгордеа до пустославие. Седи погобро во домот свој. Зошто да се зафакаш со опасна работа? Kе паднеш ти, и Јудеја со тебе.'"},
	{20, "20 Но Амасија не послуша, бидјеки тоа беше од Бога, - за да ги предаде во раката на Јоаса, заради тоа што прибегна кон идумејските богови."},
	{21, "21 Излезе Јоас, царот израилски, и се видоа лице со лице, тој и Амасија, цар јудејски, во Ветсамис Јудејски."},
	{22, "22 И беа разбиени Јудејците од Израилците, и се разбегаа секој во шаторот свој."},
	{23, "23 И го улови Јоас, цар израилски, Амасија, царот јудејски, син на Јоаса, го доведе во Ерусалим и го собори ерусалимскиот sид во должина од четиристотини лакти - од Ефремовите порти до аголните порти;"},
	{24, "24 го зеде сето злато и сребро и сите садови, што беа во домот Божји во Овед-Едом, и ризницата на царскиот дом, и заложниците, и се врати во Самарија."},
	{25, "25 Амасија, син Јоасов, цар јудејски, живееше по смртта на израилскиот цар Јоас, Јоахавов син, петнаесет години."},
	{26, "26 Другите Амасиеви дела, прво и последно, се опишани во книгата на царевите јудејски и израилски."},
	{27, "27 Потоа, откако Амасија отстапи од Господа, направија заговор против него во Ерусалим, и тој избега во Лахис. Испратија по него во Лахис, и го убија таму."},
	{28, "28 И го донесоа на коњи, та го погребаа кај татковците негови во Јудиниот град."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view26() {
struct mk26 poems[] = {
	{1, "1 Сиот народ го зеде Озија, кој имаше шеснаесет години, та го постави за цар на местото на таткото негов Амасија."},
	{2, "2 Тој го изгради Елат и и го врати на Јудеја, откако царот, таткото негов почина кај татковците свои."},
	{3, "3 Озија имаше шеснаесет години, кога стана цар, и царуваше во Ерусалим педесет и две години; мајка му се викаше Јехолија од Ерусалим."},
	{4, "4 Тој вршеше она што беше угодно пред очите на Господа, токму онака, како што вршеше и татко му Амасија;"},
	{5, "5 прибегнуваше кон Бога во дните на Захарија, којшто учеше на страв Божји; и во оние денови, додека прибегнуваше кон Господа, Бог му помагаше."},
	{6, "6 Тој излезе и се судри со Филистејците и ги разруши sидовите на Гет, и sидовите на Јавнија, и sидовите на Азот; ги изгради градовите во Азотската област и кај Филистејците."},
	{7, "7 И Бог му помагаше против Филистејците и против Арапите, што живееја во Гур-Ваал, и против Меунците."},
	{8, "8 И Амонитите му плакаа данок на Озија; и се прочу името негово дури во египетските предели, зашто беше многу силен."},
	{9, "9 Озија изгради кули во Ерусалим над аголните порти, над портите кон долината и на аголот, и ги зацврсти."},
	{10, "10 Изгради кули и во пустињата, ископа и многу кладенци, бидејки тој имаше многу добиток, како во низините, така и во рамнината, и земјоделци и градинари по планините и на Кармил, бидејки го сакаше земјоделството."},
	{11, "11 Озија имаше војска, која излегуваше во војна по одделенија, според она како што беа изброени во списокот, составен од раката на писарот Јеила, и надsирателот Маасеја, под водството на Хананија, голем царски великодостојник."},
	{12, "12 Сите оценачалници, храбри војници, беа на број две иљади и шестотини,"},
	{13, "13 и под команда на раката нивна имаше воена сила триста и седум иљади и петстотини души, кои влегуваа во битка со воинствена храброст, да му помагаат на царот против непријателот."},
	{14, "14 И подготви Озија за нив, за целата војска, штитови и копја, шелмови и оклопи, лакови и камења за пракки."},
	{15, "15 Направи во Ерусалим вешто измислени машини, да стојат на кулите и аглите, за да се фрлаат со нив стрели и големи камења. И се прочу името негово далеку, зашто се беше зацврстил чудно и беше станал многу силен."},
	{16, "16 Но кога стана силен, се возгордеа срцето негово за негово загинување, и тој стана престапник пред Господа, својот Бог, зашто влезе во храмот Господа за да запали темјан на кадилниот жртвеник."},
	{17, "17 По него отиде свештеникот Азарија и со него осумдесет Господови свештеници, одлични лу е;"},
	{18, "18 тие му се противставија на царот Озија и му рекоа: 'Не е твоја работа, Озија, да му кадиш на Господа; тое е работа на свештениците, синови Аронови, посветени за кадење; излези од светилиштето, зашто постапи незаконито, и тоа нема да ти биде за чест пред Господа Бога.'"},
	{19, "19 Се налути Озија, - а во раката негова имаше кадилница за кадење, и кога се налути на свештениците, се појави лепра на челото негово, пред лицето на свештениците во домот Господов, при кадилниот жртвеник."},
	{20, "20 Го погледна првосвештеникот Азарија и сите свештеници; и ете, имаше лепра на челото свое. Го принудија да излезе оттаму, па и самиот тој брзаше да се оддалечи, зашто го порази Господ."},
	{21, "21 И остана лепрозен царот Озија до денот на смртта своја, и живееше во посебна кука и беше отстранет од домот Господов. А Јоатам, неговиот син, началствуваше над царскиот дом и управуваше со народот во земјата."},
	{22, "22 Другите дела Озиеви, први и последни, ги опишал пророкот Исаија, син Амосов."},
	{23, "23 И почина Озија при татковицте свои, и го пограбаа кај татковците негови во полето при царските гробници, зашто велеа, тој е лепрозен. А наместо него стана цар синот негов Јоатам."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view27() {
struct mk27 poems[] = {
	{1, "1 Јоатам беше на дваесет и пет години, кога стана цар, и царуваше во Ерусалим шеснаесет години; мајка му се викаше Јеруса, Садакова керка."},
	{2, "2 Тој вршеше она што Му беше угодно пред очите на Господа, токму онака како што правеше Озија, таткото негов, само што не влегуваше во Господовиот храм, а народот се уште грешеше."},
	{3, "3 Тој ја изгради и горната врата на домот Господов и изгради многу нешто на sидот Офел;"},
	{4, "4 изгради и градови во Јудејската планина, а во горите изгради дворци и кули."},
	{5, "5 Тој војуваше со царот на Амонитите и ги победи, и Амонитите му дадоа во таа година сто талатни сребро и десет иљади мери пченица и десет иљади мери јачмен. Тоа му го даваа Амонитите и во втората и третата година."},
	{6, "6 Затоа Јоатам беше толку силен, бидејки ги управуваше патиштата свои пред Господа, својот Бог."},
	{7, "7 Другите дела на Јоатама и сите негови војни и однесување се опишани во книгата на царевите израилски и јудејски."},
	{8, "8 Тој беше на дваесет и пет години кога стана цар, а царуваше шеснаесет години во Ерусалим."},
	{9, "9 И почина Јоатам при татковците свои, и го погребаа во Давидовиот град. И наместо него стана цар синот негов Ахаз."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view28() {
struct mk28 poems[] = {
	{1, "1 Ахаз беше на дваесет години кога стана цар, и царуваше во Ерусалим шеснаесет години; и тој не го вршеше угодното во очите Господови, како што правеше таткото негов Давид;"},
	{2, "2 тој одеше по патот на израилските цареви, и дури направи излеани кипови на Вааловци;"},
	{3, "3 и тој кадеше во долината на Еномовите синови, и го протеруваше низ огин синовите свои, подражавајки ги гнасотиите на оние народи, коишто Господ ги прогони пред лицето на Израилевите синови;"},
	{4, "4 принесуваше жртви и кадеше по оброчиштата и по ридовите и под секое разгрането дрво."},
	{5, "5 Затоа Господ, неговиот Бог, го предаде во рацете на сирискиот цар, и Сиријците го разбија и му зедоа многу заробеници, кои ги одведоа во Дамаск. Беше предаден и во рацете на израилскиот цар, и тој му нанесе голем пораз."},
	{6, "6 Факеј, син Рамалиев уби во еден ден сто и дваесет иљади Јудејци, лу е воинствени, затоа што го беа оставиле Господа, Бога на татковците свои."},
	{7, "7 А Зихриј, силен јунак од Ефремовците, го уби Масеја, царевиот син, и Азрикама, началник на дворот, и Елкана, втор по царот."},
	{8, "8 И зедоа синовите Израилеви од браката свои, Јудејците, двесте иљади жени, синови и керки; ограбија и многу плен од нив, и го однесоа ограбеното во Самарија."},
	{9, "9 Таму имаше пророк Господов, по име Одед. Тој излезе пред војската, која, одеше во Самарија, и им рече: 'Ете, Господ, Бог на татковците ваше, во гневот Свој против Јудејците, ги предаде во ваше рака, и вие ги избивте со таква јарост, која стигна до небесата."},
	{10, "10 И сега мислите да ги направите синовите на Јуда и Ерусалим ваши робови и робинки. А зар немате и вие вина пред Господа, вашиот Бог?"},
	{11, "11 Затоа послушајте ме, и вратете ги плениците, што сте ги заробиле од браката свои, зашто пламенот на гневот Господов е на вас.'"},
	{12, "12 И некои од началниците на синовите Ефремови: Азарија, син Јехохананов, Берехија, син Мешилемотов, Езекија, син Салумов, и Амаса, син Хадлеев, застанаа спроти оние што доа аа од војна."},
	{13, "13 и им рекоа: 'Не ги доведувајте плениците тука, зашто би згрешиле пред Господа. Зар мислите да придодадете уште кон гревовите наши и кон престапите наши? Нашата вина е голема, и пламенот на гневот Господов е врз Израилот.'"},
	{14, "14 И вооружените ги оставија плениците и пленот при воените началници и пред целото собрание."},
	{15, "15 И станаа споменатите по име мажи, ги зедоа плениците, и сите што беа голи ги облекоа од ограбеното, - ги облекоа и ги обуа, и ги нахранија, и ги напоија, и ги помазаат со масло, и ги качија на осли сите слаби, и ги испратија во Ерихон, град на палмите, при браката нивни, и се вратија во Самарија."},
	{16, "16 Во тоа време царот Ахаз испрати до асирските цареви да му помогнат,"},
	{17, "17 зашто Идумејците уште напа аа и мнозина асирски цареви да му помогнат,"},
	{18, "18 а Филистејците се растурија по градовите во низината и во јужна Јудеја и го презедоа Ватсамис и Ајалон, Гадерот и Сохот со потчинетите му градови. Тимна со потчинетите и градови и Гимзо со потчинетите му градови, и се населија таму."},
	{19, "19 Така ја понижи Господ Јудеја поради Ахаза, царот јудејски, зашто тој ја разврати Јудеја и тешко грешеше пред Господа."},
	{20, "20 И дојде кај него асирскиот цар Теглатфеласар, но му беше од штета, наместо да му помогне,"},
	{21, "21 зашто Ахаз ги зеде ризниците од домот Господов, од царскиот дом и од кнезовите, и се му даде на асирскиот цар, но и тоа не му помогна туку го ожалости."},
	{22, "22 И во таа притеснета положба тој продолжуваше да прави беззаконија пред Господа, тој - царот Ахаз;"},
	{23, "23 им принесуваше жртви на дамаските богови, мислејки, дека тие го поразија, па велеше: 'Боговите на сириските цареви им помагаат; ке им принесам жртва, тие и на мене ке ми помогнат.' Но тие беа за па ањето негово и на целиот Израил."},
	{24, "24 Ги собра Ахаз садовите на домот Божји и ги разби, ја затвои вратата на домот Господов и си изгради жртвеници по сите агли на Ерусалим,"},
	{25, "25 по сите градови Јудини направи оброчишта, за да кади на ту и богови, и Го дразнеше Господа, Бога на татковците свои."},
	{26, "26 Другите дела и сите негови постапки, првите и последните, се опишани во книгата на царевите јудејски и израилски."},
	{27, "27 И почина Ахаз при татковците свои, и го погребаа во градот, во Ерусалим, но не го внесоа во гробниците на израилските цареви. Наместо него стана цар синот негов Езекија."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view29() {
struct mk29 poems[] = {
	{1, "1 Езекија стана цар на дваесет и пет години, и царуваше во Ерусалим дваесет и девет години; мајка му се викаше Авија, Захариева керка."},
	{2, "2 Тој правеше она што беше угодно пред очите Господови, токму онака како и таткото негов Давид."},
	{3, "3 Уште во првата година на царувањето свое, во првиот месец, тој ги отвори вратите на домот Господов и ги обнови;"},
	{4, "4 и им заповеда на свештениците и левитите да дојдат, ги собра на источниот плоштад"},
	{5, "5 и им рече: 'Послушајте ме, левити! Сега осветете се, осветете го и домот на Господа, Бога на татковците ваши; исфрлете ја нечистотијата од светилиштето."},
	{6, "6 Зашто татковците наши постапуваа неугодно пред очите на Господа, нашиот Бог, Го оставија, го одвратија лицето свое од Господовото живеалиште, Му свртија грб,"},
	{7, "7 ја затворија вратата на притворот, ги угаснаа светилниците, не палеа кадило и не принесуваа сепаленици во светилиштето на израилевиот Бог."},
	{8, "8 И гневот Господов беше врз Јудеја и врз Ерусалим, и Он ги предаде на презир, на опустошување и на потсмев, како што гледате со очите свои."},
	{9, "9 Ете, татковците наши паднаа под меч, а синовите наши, и керките наши, и жените наши за тоа се во плен во ту а земја досега."},
	{10, "10 И сега имам на срце да склучам завет со Господа, Бог Израилев, та да го отстрани од нас пламенот на гневот Свој."},
	{11, "11 Деца мои! Не бидете немарни, зашто Господ ве избра за да претстоите пред лицето Негово, да Му служите и да Му бидете служители и да кадите.'"},
	{12, "12 Тогаш станаа левитите: Махат, син Амасаев, и Јоел, син Азариев, - од синовите Каатови; и од синовите Мерариеви: Кис, син Авдиев, и Азарија, син Јехалелов; и од племето Гирсоново: Јоах, син на Зима, и Еден, син Јоахов;"},
	{13, "13 и од синовите Елисафанови: Симри и Јеиел; и од синовите Асафови: Захарија и Матанија;"},
	{14, "14 и од синовите Еманови; Јехиел и Симеј; и од синовите Идитунови: Семаја и Узиел."},
	{15, "15 Тие ги собраа браката свои, се осветија и отидоа по заповед на царот да го очистат домот Господов, според словото Господово."},
	{16, "16 Свештениците влегуваа внатре во домот Господов, за да го очистат, и сето нечисто, она што најдоа во храмот Господов, го изнесоа во дворот на домот Господов, а левитите го зедоа тоа да го изнесат надвор кон потокот Кедрон."},
	{17, "17 И почнаа да осветуваат на првиот ден од првиот месец, и на осмиот ден на истиот месец влегоа во притворот Господов; го осветуваа домот Господов осум дена, и на шеснаесеттиот ден од првиот месец завршија."},
	{18, "18 Тогаш дојдоа во домот при царот Езекија и рекоа: 'Го исчистивме домот Господов и жртвеникот за сепаленици, и сите негови садови, и трпезата за лебовите на предложението, и сите нејзини садови;"},
	{19, "19 сите садови што беше ги зафрлил царот Ахаз во текот на царувањето свое, во своето беззаконие, ги приготвивме и осветивме; ете, тие се пред Господовиот жртвеник.'"},
	{20, "20 Утредента рано царот Езекија стана, ги собра градските началници и отиде во домот Господов."},
	{21, "21 И дотера седум телиња, седум овни, седум јагниња и седум козли - да ги принесат како жртва за грев, за царството, за светилиштето и за Јудеја; и им заповеда на свештениците, синови Аронови, да принесат сепаленици врз Господовиот жртвеник."},
	{22, "22 И ги заклаа телците, а свештениците зедоа крв и го поросија жртвеникот; ги заклаа овните и го поросија со крв жртвеникот; ги заклаа јагнињата и го поросија со крв жртвеникот."},
	{23, "23 Ги дотераа и козлите за грев пред царот и собранието, и тие ги положија врз нив рацете свои."},
	{24, "24 Свештениците ги заклаа и го исчистија со нивната крв жртвеникот, за да се истријат гревовите на целиот Израил, зашто царот беше заповедал да се принесе сепалиница и жртва за грев за целиот Израил."},
	{25, "25 И постави левити во домот Господов со кимвали, псалтири и гусли, според наредбите на Давида и Гада, јасновидец царски, и на пророкот Натан, бидејки таа заповед беше дадена од Господа преку пророците Негови."},
	{26, "26 И застанаа левитите со Давидовите свирки и свештениците со труби."},
	{27, "27 Тогаш Езекија заповеда да принесат сепаленица врз жртвенкот. И кога почна сепаленицата, почна пеење на Господа со звуци на трубите и свирките на Давида, цар Израилев."},
	{28, "28 И целото собрание се молеше, пеачите пееја и трубите трубеа, додека не заврши сепаленицата."},
	{29, "29 А кога заврши сепаленицата, царот и сите, што беа при него, се наведнаа и се поклонија."},
	{30, "30 Царот Езекија и кнезовите им рекоа на левитите да Го слават Господа со зборовите на Давида и јасновидецот Асаф; тие славеа со радост и се наведнуваа и се поклонуваа."},
	{31, "31 Продолжи Езекија и рече: 'Сега вие Му се посветивте на Господа: пристапувајте и принесувајте жртви и благодарствени принесуавања во домот Господов. И целото собрание почна да принесува жртви и благодарствени приноси, и на кого срцето му беше расположено - и сепаленици."},
	{32, "32 А бројот на сепалениците, што собранието ги донесе, изнесуваше: седумдесет волови, сто овни, двесте јагниња - сето тоа за сепаленица на Господа."},
	{33, "33 Други свештени жртви имаше: шестотини глави крупен добиток и три иљади ситен добиток."},
	{34, "34 Но свештениците беа малку и не можеа да ги одерат кожите од сите сепаленици, па им помагаа браката нивни левитите, додека се сврши работата и додека се осветија другите свештеници, зашто левитите беа поусрдни во освештението свои, отколку свештениците."},
	{35, "35 А притоа имаше многу сепаленици со масни меса од мирните жртви и со преливи врз сепаленицата. Така беше востановено служењето во домот Господов."},
	{36, "36 И се радуваше Езекуја и целиот народ, поради тоа што Бог така го расположи народот, бидејки тоа стана неочекувано."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view30() {
struct mk30 poems[] = {
	{1, "1 Испрати Езекија по целата земја Израилски и Јудеја, пишуваше и писма до Ефрема и племињата на Манасија, да дојдат во домот Господов во Ерусалим, за да направат Пасха на Господа, Бога Израилев."},
	{2, "2 А во советот царот и кнезовите и целото собрание во Ерусалим решија да направат Пасха на вториот месец."},
	{3, "3 бидејки не можеа да ја направат кога и беше времето, зашто уште немаше доволен број осветени свештеници, па и народот не се беше собрал во Ерусалим."},
	{4, "4 Тоа му се допадна на царот и на целото собрание."},
	{5, "5 И решија да разгласат по цел Израил, од Вирсавија до Дан, да отидат во Ерусалим да Му направат Пасха на Господа, Бога Израилев, зашто одамна не ја беа правеле, како што е наредено."},
	{6, "6 И тргнаа брозоодци со писма од царот и од кнезовите негови по целата земја Израилска и Јудеја, и по заповед на царот велеа: 'Деца Израилеви! Обрнете се кон Господа, Бога Авраамов, Исаков и Израилев, и Он ке се сврти кон оние, што се унесрекени ме у вас од раката на асирските цареви."},
	{7, "7 И не бидете како татковците ваши и браката ваши, кои постапуваа беззаконо пред Госода, Бога на татковците ваши, и Он ги предаде за истребување, како што гледате."},
	{8, "8 Сега не бидете тврдоглави како татковците ваши, покорете Му се на Господа и доа ајте во светилиштето Негово, кое Он го освети засекогаш; служете Му на Господа, нашиот Бог, и Он ке го отстрани од вас пламенот на гневот Свој."},
	{9, "9 Кога ке се обрнете кон Господа, браката ваши и децата ваши ке најдат милост кај оние, што ги заробиле, и ке се вратат во оваа земја; зашто Господ, Бог наш, е благ и милосрден и нема да го сврти лицето од вас, ако се обрнете кон Него.'"},
	{10, "10 Брзоодците одеа од град во град по земјата Ефремова и Манасиева, дури до Завулоновата, но им се смееја и се подбиваа со нив."},
	{11, "11 Но пак некои од коленото Асирово, Манасиево и Завулоново се смирија и дојдоа во Ерусалим."},
	{12, "12 А над Јудеја беше раката Божја, та им даде едно срце, за да ја исполнат заповедта на царот и кнезовите, според словото Господово."},
	{13, "13 И се собра во Ерусалим многу народ, за да го празвуваат празникот на Бесквасниците пред вториот месец: собранието беше мошне многубројно."},
	{14, "14 Па станаа и ги растурија жртвениците, што беа во Ерусалим, и се, врз кое кадеа на идолите, испокршија и го фрлија во потокот Кедрон,"},
	{15, "15 го заклаа пасхалното јагне на четиринаесеттиот ден од вториот месец. Свештениците и левитите, посрамени, се осветија и принесоа сепаленица во домот Господов,"},
	{16, "16 и застанаа по своите места, според уредбата своја, по законот на Мојсеја, Божји човек. Свештениците оросуваа со крв, земајки ја од рацете на левитите."},
	{17, "17 А бидејки во собранието имаше мнозина кои не беа се осветиле, тогаш, наместо тие нечистите, го колеа пасхалното јагне левитите, за да го посветат на Господа."},
	{18, "18 Мнозина од народот, повекето од коленото Ефремово и Манасиево, Исахарово и Завулоново, не се очистија; но и тие јадеа пасха, не според законот."},
	{19, "19 Но Езекија се помоли за нив и рече: 'Благиот Господ да прости секого, кој што го расположил срцето свое да Го бара Господа Бога, Бог на татковците свои, макар и без свештено очистување.'"},
	{20, "20 И Господ ги послуша Езекија и му прости на народот."},
	{21, "21 Така синовите Израилеви, кои што беа во Ерусалим, го извршија празникот на Бесквасниците през седум дена со голема веселба; секој ден левитите и свештениците Го славеа Господа со свирки, нагласени за славословување на Господа."},
	{22, "22 И говореше Езекија според срцето на сите левити, кои знаеја добро да Му служат на Господа. И ја јадеа празничната жртва седум дена, принесувајки мирни жртви и славејки Го Господа, Бога на татковците свои."},
	{23, "23 И целото собрание реши да празнува други седум дена, и ги поминаа тие седум дена во веселба,"},
	{24, "24 зашто Езекија, цар Јудејски, дотера за собраните иљада телиња и десет иљади ситен добиток, а велможите дотераа за собраните иљада телиња и десет иљади ситен добиток; тогаш веке се осветија мошне многу свештеници."},
	{25, "25 И се веселеа сите собрани од Јудеја, свештеници и левити, и целото собрание, надојдено од Израил, и дојденците што беа дошле од Израилската земја и кои што живееја во Јудеја."},
	{26, "26 И стана голема веселба во Ерусалим, зашто од дните на Соломона, син Давидов, цар Израилев, не се случи такво нешто во Ерусалим."},
	{27, "27 Тогаш станаа свештениците и левитите и го благословија народот; и нивниот глас беше чуен од Господа, и молитвата нивна се вознесе до небесата, во светото Негово живеалиште."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view31() {
struct mk31 poems[] = {
	{1, "1 Откако заврши сето тоа, сите Израилци што се најдоа таму, отидоа по јудејските градови, та ги испокршија идолите, ги исекоа посветените дрвја, ги разрушија оброчиштата и жртвениците докрај по целата Јудеја и во земјата Венијаминова, Ефремова и Манасиева. Потоа се вратија сите синови Израилви, секој во владението свое, во градовите свои."},
	{2, "2 И нареди Езекија свештенички и левитски смени, според распределбата нивна, секој при својата работа, свештеничка и левитска, при сепаленица и при мирни жртви, за служба, за фалење и славословие, при вратата на домот Господов."},
	{3, "3 И определи царот дел од имотот свој за сепаленици; за утрни и вечерни сепаленици, за сепаленици во саботите според новомесечијата и празниците, како што е запишано во законот Господов."},
	{4, "4 Му заповеда уште на народот во Ерусалим, да им дава одредена издршка на свештениците и левитите, за да бидат ревносни во законот Господов."},
	{5, "5 Кога се разгласи таа заповед, синовите Израилеви издонесоа многу големи количества: жито, вино, дрвено масло, мед и секакви полски производи; донесоа уште десеток од се во изобилство."},
	{6, "6 Израилците и Јудејците што живееја по јудејските градови, исто така донесоа десеток од крупниот и ситниот добиток и десеток од жртвите, посветени на нивниот Господ Бог; и натрупаа купишта и купишта."},
	{7, "7 Почнаа во третиот месец да натрупуваат купишта, и завршија во седмиот месец."},
	{8, "8 И дојдоа Езекија и велможите и видоа купишта, Го благословија Господа и народот Негов Израила."},
	{9, "9 Тогаш ги праша Езекија свештениците и левитите за тие купишта."},
	{10, "10 Му одговори Азарија, првосвештеник од домот Садоков, и рече: 'Откако почнаа да носат приноси во домот Господов, јадевме до наситување и пак остана многу, зашто Господ го благослови народот Свој. Ова големо множество е остаток."},
	{11, "11 Тогаш Езекија заповеда да подготват соби при домот Господов. И тие подготвија."},
	{12, "12 И ги пренесоа таму приносите, десетоците и жртвите со голема точност. Настојник кај нив беше левитот Хоманиј, а братот негов Симеј го држеше второто место."},
	{13, "13 А Јеил, Озија, Наед, Асаил, Јеримот, Јозавад, Елиил, Самахија, Мат и Ванаја беа надзорници под управа на Хонанија и наеговиот брат Самеја - по наредбата на царот Езекија и Азарија, началникот при Божјиот дом."},
	{14, "14 Кореј, синот на Јемнин, левит, вратар на источната страна, беше при доброволните приноси на Бога, за да го разделува принесеното на Господа и најважните осветени предмети."},
	{15, "15 Под негова управа беа: Одом, Венијамин, Исус, Семеја, Амарија и Сехонија во свештеничките градови, за да раздаваат делови на браката свои точно, како на големите, така и на малите."},
	{16, "16 надвор од списокот нивни, на сите од машки пол од три години и нагоре, на сите, што одат во домот Господов за секојдневните работи, - за службата нивна, според должностите нивни и според редовите нивни;"},
	{17, "17 на запишаните свештеници во списокот, според поколенијата нивни, на левитите од дваесет години и нагоре, според должностите нивни според редовите нивни,"},
	{18, "18 на запишаните во списокот со сите нивни малолетни, со жените нивни, синовите нивни и керките нивни, - на сето општество, бидејки тие со целосна верност и се посветија на свештената служба."},
	{19, "19 А за синовите Аронови, свештеници во селата околу градовите нивни, во секој град беа поставни мажи определени да ги раздаваат деловите на сите од машки пол при свештениците и на сите, запишани во списокот при левитите."},
	{20, "20 Еве што направи Езекија по цела Јудеја; тој го правеше, она што е добро и право и вистинито пред Господа, својот Бог."},
	{21, "21 И во се она, што го преземаше за да му служи на Божјиот дом и да го запази законот и заповедите, мислејки на својот Бог, тој се трудеше од се срце, и имаше успех."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view32() {
struct mk32 poems[] = {
	{1, "1 По таквите дела и таквата верност дојде Сенахирим, царот асирски, навлезе во Јудеја, ги опседна утврдените градови и намераваше да ги освои."},
	{2, "2 Кога виде Езекија, дека Сенахирим дошол со цел да војува против Ерусалим,"},
	{3, "3 реши со кнезовите и со своите силни лу е да ги затвори сите извори на вода надвор од градот; и тие му помогнаа."},
	{4, "4 Се собра многу народ и ги затрупаа сите извори и потокот, кој течеше низ земјата, велејки: кога ке дојде асирскиот цар, да не најдат многу вода и да не се утврдува."},
	{5, "5 И се утврди Езекија, ги поправи сите срушени sидови и ги издигна до кулата, а надвор изгради друг sид, го утврди Мило во Давидовиот град и поготви многу оружје и штитови."},
	{6, "6 Постави воени началници над народот и ги собра при себе на плоштадот кај градските порти, па им говореше од срце, велејки:"},
	{7, "7 'Бидете тврди и храбри, не бојте се и не плашете се од асирскиот цар и од сето множество, кое е со него, зашто со нас има повеке, отколку со него;"},
	{8, "8 со него е телесна мишка а со нас е Господ, Бог наш, за да ни помага и да се бори во битките наши.' И народот се охрабри од зборовите на Езекија, царот Јудејски."},
	{9, "9 Потоа асирскиот цар Сенахирим испрати свои слуги во Ерусалим, - кога тој лично беше во Лахис, и сета негова сила со него, - до јудејскиот цар Езекија и до сите Јудејци во Ерусалим, да кажат:"},
	{10, "10 'Вака вели Сенахирим, царот асирски: ‘на што се надевате и седите во Ерусалим опседнати?‘"},
	{11, "11 Зар Езекија не ве мами, за да ве предаде на смрт од глад и жед, кога ви вели: ‘Господ, Бог наш, ке не спаси од раката на асирскиот цар‘?"},
	{12, "12 Зар тој Езеија ги премавна светилиштата Негови и жртвениците Негови и им рече на Јудејците и на Ерусалим: пред еден жртвеник поклонувајте се и врз него кадете!"},
	{13, "13 Зар не знаете, што направив јас и татковците мои со сите земни народи? Можеа ли боговите на земните народи да ја спасат земјата своја од раката моја?"},
	{14, "14 Кој од сите богови на народите, што моите татковци ги истребија, можеше да го спаси својот народ од раката моја? Kе може ли и вашиот Бог да ве спаси вас од раката моја?"},
	{15, "15 А сега, нека не ве мами Езекија и да не ве заведува така; не верувајте му; ако ни еден бог ниту на еден народ и царство не беше во состојба да го спаси народот свој од раката моја и од раката на татковците мои, тогаш и вашиот Бог нема да ве спаси вас од раката моја.'"},
	{16, "16 И уште многу говореа слугите негови против Господа Бога и против Езекија, Неговиот слуга."},
	{17, "17 Тој напиша писмо, во кои Го хулеше Господа, Бога Израилев, и говореше против Него ваквки зборови: 'Како што боговите на земните народи не ги спасија своите народи од раката моја, така и Езекиевиот Бог нема да го спаси Својот народ од раката моја.'"},
	{18, "18 И викаа со силен глас на јудејски јазик кон народот во Ерусалим, кој беше по sидовите, за да го заплашат и исплашат, та да го преземат градот."},
	{19, "19 И говореа за Бога на Ерусалим, како за боговите на земните народи, - дело на човечки раце."},
	{20, "20 Тогаш царот Езекија и пророкот Исаија, синот Амосов, се помолија и кренаа глас кон небото."},
	{21, "21 И Господ испрати Ангел, кој ги погуби сите јунаци, главниот начланик и началаниците на војската на асирскиот цар, и тој се врати посрамен во земјата своја. И кога дојде во домот на својот бог, таму го убија со меч излезените од бедрата негови."},
	{22, "22 Така го спаси Господ Езекија и ерусалимските жители од раката на асирскиот цар Сенахирим и од рацете на сите, и ги пазеше насекаде."},
	{23, "23 Тогаш мнозина почнаа да му донесеуваат дарови на Господа во Ерусалим и скапи работи на јудејскиот цар Езекија. И тој се издигна потоа во очите на сите народи."},
	{24, "24 Во тие дни се разболе Езекија на смрт. И Му се помоли на Господа, и Он послуша и му даде знак."},
	{25, "25 Но Езекија не Му благодари за направените му добрини, зашто срцето негово се возгордеа. Затоа гневот Божји падна врз него, врз Јудеја и Ерусалим."},
	{26, "26 Но штом Езекија се смири и гордоста во срцето негово, - тој и ерусалимските жители, - гневот Господов не падна врз нив во Езекиевите денови."},
	{27, "27 Езекија имаше многу големо богатство и слава; си направи ризници за сребро и злато и за скапоцени камења, како и за благопријатни мириси, штитови и секакви скапи садови;"},
	{28, "28 и одделни простории за земни производи: жито, вино и елеј, и трла за секаков добиток и огради за стада."},
	{29, "29 Си изгради и градови. А стада од ситен и крупен добиток имаше многу, зашто Бог му беше дал многу голем имот."},
	{30, "30 Тој, пак, Езекија, го затвори горниот проток на Гионските води и го насочи удолу, западно од Давидовиот град. И во секоја своја работа Езекија беше успешен."},
	{31, "31 Само при пратениците на вавилонските цареви, што беа испратени до него да прашаат за едно чудо, што се случило на земјата, Господ го остави, за да го испита и да открие се, што му беше во срцето."},
	{32, "32 Другите дела на Езекија и неговите милости се опишани во видението на пророкот Исаија, син Амосов, и во книгата за царевите јудејски и израилски."},
	{33, "33 Почина Езекија при татковците свои, и го погребаа погоре од гробиштата на Давидовите синови, а по неговата смрт сите Јудејци и жители ерусалимски му укажаа почест. И место него цар стана синот негов Манасија."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view33() {
struct mk33 poems[] = {
	{1, "1 Манасија беше на дванаесет години кога стана цар, и царуваше во Ерусалим педесет и пет години."},
	{2, "2 Тој го вршеше она што не беше угодно пред очите Господови, подражувајки ги гадотиите на народите, кои Господ ги беше прогонил од лицето на синовите Израилеви."},
	{3, "3 Изгради пак идолски светилишта, што ги беше урнал таткото негов Езекија, им издигна жртвеници на Вааловци, подигна млади шуми и се клањаше на целото небеско воинство и му служеше;"},
	{4, "4 изгради жртвеници и во Господовиот дом, за кој Господ беше рекол: ‘во Ерусалим ке пребива името Мое вечно.‘"},
	{5, "5 изгради и жртвеници на целото небеско воинство во двата трема на Господовиот дом."},
	{6, "6 Тој ги преведуваше преку оган синовите свои во долината на Еномовиот син, гаташе, вражаше и ма епсуваше; и повика извикувачи на мртви и волшебници: тој вршеше многу лоши работи пред очите на Господа, за да Го разгневи."},
	{7, "7 Направи уште и извајан идол и го постави во Господовиот дом, за кој што Бог му беше рекол на Давида и на синот негов Соломона: ‘во тој дом и во Ерусалим, што го избрав ме у сите колена Израилеви, ке го положам името Свое засекогаш;"},
	{8, "8 и нема да оставам во иднина да излезе ногата Израилева од таа земја, што ја утврдив за татковците нивни, само ако тие се потрудат да го вршат се она, што сум им го заповедал во целиот закон и наредбите и заповедите, дадени преку раката Мојсеева."},
	{9, "9 Но Манасија ја доведе Јудеја и ерусалимските жители до таму, што постапуваа полошо и од оние народи, што Господ ги истреби од пред лицето на Израилевите синови."},
	{10, "10 Господ му говореше на Манасија и на лу ето негови, но тие не послушаа."},
	{11, "11 Затоа Господ ги испрати против нив военоначалниците на асирскиот цар, кои го оковаа Манасија во окови, го врзаа со вериги и го одведоа во Вавилон."},
	{12, "12 И во таа тешка невоља тој почна да Го моли Господа, својот Бог, и длабоко се смири пред Бога на татковците свои."},
	{13, "13 Му се помоли Нему, и Бог се приклони кон него, ја чу молбата негова и го врати во Ерусалим во царството негово. И разбра Манасија дека Господ е Бог."},
	{14, "14 Потоа тој изгради надворешен sид на Давидовиот град, западно од Геон, по долот и до влезот на Рибните порти, и околу Офел и го издигна високо. Потоа постави војводи по сите утврдени градови во Јудеја,"},
	{15, "15 ги премавна ту ите богови, идолот од Господовиот дом и сите идолски светилишта, што ги беше изградил во гората на Господовиот дом и во Ерусалим, ги исфрли надвор од градот."},
	{16, "16 Го обнови жртвеникот Господов и принесе на него жртви, мирни и благодарствени, и им порача на Јудејците да Му служат на Господа, Бога Израилев."},
	{17, "17 Но народот уште принесуваше жртви по идолските светилишта, но и на Господа, Својот Бог."},
	{18, "18 Другите дела Манасиеви, молитвата негова кон својот Бог и зборовите на јасновидците, кои му говореа од името на Господа, Бога Израилев, се нао аат во книгата за царевите Израилеви."},
	{19, "19 И молитвата негова, и тоа, што Господ се приклони кон него, и сите негови гревови и беззаконија, и местата, по кои беше издигнал жртвеници и поставил ликови на Астарта и идоли, пред да се смири, - опишани се во записите пророчки."},
	{20, "20 И почина Манасија при татковците свои, и го погребаа во домот негов. А место него стана цар синот негов Амон."},
	{21, "21 Амон беше на дваесет и две години, кога стана цар, и царуваше во Ерусалим две години."},
	{22, "22 И тој го вршеше она што не беше угодно пред очите Господови така, како што го вршеше тоа татко му Манасија: на сите идоли, што ги беше направил татко му Манасија, Амони им принесуваше жртва и им служеше."},
	{23, "23 И не се смири прд Господа, како што се понизи таткото негов Манасија; напротив, Амон ги умножи гревовите свои."},
	{24, "24 Слугите негови се побунија против него и го убија во домот негов."},
	{25, "25 Но народот во земјата ги изби сите оние, што беа во бунтот против царот Амона, и место него народот на таа земја го избра за цар синот негов Јосија."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view34() {
struct mk34 poems[] = {
	{1, "1 Јосија имаше осум години, кога стана цар, и царуваше во Ерусалим триесет и една година."},
	{2, "2 Тој го вршеше она што беше угодно пред очите Господови, одеше по патиштата на таткото свој Давида и не скршуваше ни лево ни десно."},
	{3, "3 На осмата година од царувањето свое, бидејки уште беше момче, почна да прибегнува кон Бога на таткото свој Давида, а на дваесеттата година почна да ја чисти Јудеја и Ерусалим од идолските светилишта, од посветените дрвја и од извајаните и излеаните идоли."},
	{4, "4 Зашто пред лицето негово ги разрушија жртвениците на Вааловци и идолите, што се издигаа над нив; ги исече посветените дрвја, а извајаните и излеаните идоли ги скрши и разби во прав, растурајки ги по гробовите на оние, што им беа принесувале жртви;"},
	{5, "5 коските на жреците ги изгори врз нивните жртвеници, ја исчисти Јудеја и Ерусалим."},
	{6, "6 Во градовите на Манасија, Ефрема и Симеона, дури до коленото Нефталимово, и во нивните опустошени околини,"},
	{7, "7 тој ги собори жртвениците и посветените дрвја, ги разби во прав ликовите и ги скрши сите идоли по целата Израилска земја, и се врати во Ерусалим."},
	{8, "8 На осумнаесеттата година од царувањето свое, откако беше исчистена земјата и Божјиот дом, тој го испрати Сафана, синот Азалиев, Масија, градоначалникот, и Јоаха, син Јоахазов, летописец, за да го обноват домот на Господа, нивниот Бог."},
	{9, "9 Тие отидоа кај свештеникот Хелкија и го предадоа принесеното во Божјиот дом, што го беа собрале левитите, стражари при прагот, од рацете на Манасија, Ефрема, од сите други Израилци, од синовите на Јуда и на Венијамина и од жителите ерусалимски."},
	{10, "10 Го дадоа тоа во рацете на распоредниците, одредени при домот Господов, да го раздаваат на работниците, што ке работат во Господовиот дом на поправката и обновувањето на домот."},
	{11, "11 И тие им раздаваа на дрводелците и sидарите, за да купуваат делкани камења и дрвја за врски и за покривање, на зградите, кои јудејските цареви ги беа разрушиле."},
	{12, "12 Тие лу е чесно ја вршеа својата работа, а за надзорници над нив беа поставени Јат и Овадија, левити од Мерариевите синови, и Захарија и Месулам од Катовите синови, и сите левити, што умееја да свират не музички направи."},
	{13, "13 Тие беа одредени над носачите и ги надгледуваа сите работници при секоја работа: а другите левити беа и писари, и распоредници, и вратари."},
	{14, "14 Кога го вадеа среброто, што беше принесено во Господовиот дом, свештеникот Хелкија ја најде книгата на законот Господов, даден преку Мојсеевата рака."},
	{15, "15 Проговори Хелкија, па му рече на писарот Сафана: 'Ја најдов книгата на Законот во домот Господов.' Хелкија му ја даде книгата на Сафана."},
	{16, "16 А Сафан ја однесе книгата при царот и притоа му ја донесе на царот оваа вест: 'Твоите слуги вршат се што им е таму наредено.'"},
	{17, "17 Го истурија среброто, што се нао аше во домот Господов, и го предадоа во рацете на одредените и во рацете на распоредниците."},
	{18, "18 Писарот Сафан му јави уште на царот и рече: 'Оваа книга ми ја даде свештеникот Хелкија.' И Сафан ја прочита пред царот."},
	{19, "19 Кога ги чу царот зборовите на Законот, ја раскина својата облека."},
	{20, "20 И му заповеда царот на Хелкија и на Ахикама, син Сафанов, на Авдона, син Мехеев, и на писарот Сафана и на царскиот слуга Асаија, велејки:"},
	{21, "21 'Одете и прашајте Го Господа за мене, за другите во Израилот и за Јуда за зборовите на таа најдена книга, зашто голем и гневот Господов, кој пламна врз нас, затоа што татковицте наши не ги запазија Господовите зборови, за да постапуваат во се што е напишано во таа книга.'"},
	{22, "22 Тогаш Хелкија и оние, што беа од царот, отидоа кај пророчицата Олдама, жена на Салума, син на Текуја, син на Асра ризничарот, - а таа живееше во вториот дел на Ерусалим, - и говореа со неа за тоа."},
	{23, "23 Таа им рече: 'Вака вели Господ, Бог Израилев: кажете му на оној човек, што ве испратил кај мене."},
	{24, "24 ‘Вака вели Господ: ете, ке испратам зло врз ова место и врз жителите негови - сите проклетства, напишани во книгата, што ја читав пред лицето на јудејскиот цар,"},
	{25, "25 поради тоа што Ме оставија и кадеа на други богови, за да Ме разгневат со сите дела на рацете свои. Затоа гневот Мој ке се разгори над ова место и нема да згасне.‘"},
	{26, "26 А на царот јудејски, кој ве испрати да Го прашате Бога, кажете му: ‘вака вели Господ, Бог Израилев, за зборовите, што си ги чул:"},
	{27, "27 бидејки срцето ти омекна, и ти се смири пред Господа, откако чу, што вели Он за ова место и за жителите негови, што се смири пред Мене и ја раскина облеката своја и плачеше пред Мене, за тоа и Јас те чув, вели Господ."},
	{28, "28 Ете, Јас ке те приберам кај татковците твои, и ке бидеш положен со мир во гробницата своја, и очите твои нема да го видат сето она зло, што ке го испратам врз ова место и против жителите негови.' И му го однесоа одговорот на царот."},
	{29, "29 Тогаш царот испрати, та ги собра сите старешини од Јудеја и Ерусалим,"},
	{30, "30 па отиде царот во домот Господов, и со него сите Јудејци и жителите ерусалимски, и свештениците, и левитите, и сиот народ, од голем до мал; и им ги прочита тој гласно сите зборови од книгата на заветот, најдена во домот Господов."},
	{31, "31 Потоа царот се исправи на местото свое и склучи завет пред лицето на Господа - да Го следат Господа и да ги запазат од се срце и со сета душа заповедите Негови, откровенијата негови и законите Негови, та да ги извршат зборовите на заветот, напишани во таа книга."},
	{32, "32 И царот им заповеда на сите, што беа во Ерусалим и во земјата Венијаминова, да го потврдат тоа; и почнаа жителите ерусалимски да постапуваат според заветот на Бога, Бога на татковците свои."},
	{33, "33 И ги премавна Јосија сите гадотии од сите земји на Израилевите синови, и им заповеда на сите во земјата Израилева да Му служат на Господа, својот Бог. И во сите денови на животот негов тие не отстапуваа од Господа Бога на татковците нивни."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view35() {
struct mk35 poems[] = {
	{1, "1 Јосија отпразнува Пасха на Господа во Ерусалим, и го заклаа пасхалното јагне на четиринаесеттиот ден од првиот месец."},
	{2, "2 И ги насели свештениците по местата нивни и ги поттикнуваше да му служат на домот Господов;"},
	{3, "3 и им рече на левитите, посветени на Господа и наставници на сите Израилци: поставете го светиот ковчег во храмот, што го изгради Соломон, синот Давидов, цар Израилев; нема потреба да го носите на раменици; служете Му сега на Господа, нашиот Бог и на народот Негов Израилот;"},
	{4, "4 застанете според родовите на татковците свои и според родовите свои, како што е заповедано од Давида, царот Израилев, и како што е заповедано од синот негов Соломона,"},
	{5, "5 стојте во светилиштето, според она како што се распоредени родовите на вешите брака, синовите народни, според она како што се разделени левитските родови и редови;"},
	{6, "6 заколете го пасхалното јагне, осветете се и подгответе го за браката свои, постапувајки согласно со Господовото слово преку Мојсеја."},
	{7, "7 И им подари Јосија на синовите народни, на сите, што беа таму, од ситниот добиток јагниња и јариња, се за пасхалната жртва, на број триесет иљади, и три иљади вола. Тоа беше од царскиот имот."},
	{8, "8 И кнезовите негови сесрдно даваа принос за народот, на свештениците и на левитите: Хелкија, Захарија и Јехиил, старешини во Божјиот дом, им дадоа на свештениците за жртва пасхална две иљади и шестотини јагниња и јариња и триста вола;"},
	{9, "9 Хоннија, Семаија и Натанаил, негови брака, Асавија, Јеиел и Јозавад, левитски старешини, им подарија на левитите за пасхална жртва пет иљади овци и петстотини волови."},
	{10, "10 Така се подготви службата, и по царева заповед свештениците застанаа на своите места и левитите според смените свои;"},
	{11, "11 го заклаа пасхалното јагне, и свештениците росеа со крвта, што ја земаа од рацете на левитите, а левититеи ги дереа кожите;"},
	{12, "12 и го распределија определеното за сепаленици, за да го дадат по редовите на татковските родови на синвоите народни, за принос на Господа, како што е напишано во Мојсеевата книга. Истото тоа го направија и со воловите."},
	{13, "13 И го испекоа на оган пасхалното јагне, според законот; а свештените жртви ги сварија во котли, грниња и тави, па го раздадоа брзо по сиот народ;"},
	{14, "14 потоа приготвија за себе и за свештениците, зашто свештениците, синови Аронови, беа зафатени со принесувањето сепаленици и дебели меса до нокта; затоа левитите готвеа и за себе и за свештениците, синовите Аронови."},
	{15, "15 А певците, синови Асафови, остануваа по местата свои, според наредбите на Давида и Асафа, Емана и Идитуна, царевиот јасновидец, а вратарите при секоја врата: немаше зошто да ја напуштаа службата своја, бидејки браката нивни левитите готвеа за нив."},
	{16, "16 Така беше распоредена целата служба во тој ден, за да направат Пасха и да принесат сепаленици на Господовиот жртвеник, по заповед на царот Јосија."},
	{17, "17 Така ја празнуваа Израилевите синови, што беа таму Пасхата во тоа време и празникот Бесквасници во текот на седум дена."},
	{18, "18 Таква Пасха не беше прославувана во Израилот од деновите на пророкот Самуила; од Израилеви цареви ниеден не беше приготвил таква Пасха, каква што направи Јосија, свештениците, левитите и сите Јудејци, и Израилци, кои беа таму, и жителите ерусалимски."},
	{19, "19 Таа Пасха беше отпразнувана во осумнаесеттата година од царувањето на Јосија."},
	{20, "20 По сето тоа, што го направи Јосија во Божјиот дом, тој ги изгори во оган и лакомците, и ма епсниците, и идолските светилишта, и идолите, и дубравите, што ги имаше во Ерусалим и во Јудеја, за да ги утврди зборовите на Законот, напишани во книгата, која свештеникот Хелкија ја најде во домот Господ; и немаше сличен на него пред него, што се обрнал кон Господа од се срце, со сета душа и со сета сила, согласно со целиот закон Мојсеев, не се издигна и по него подобен на него. Но Господ, пак, не се одврати од големата јарост на гневот Свој, - јарост, со каква што Господ се беше разгневил на Јудеја за сите наскрбувања, со кои Го разгневи Манасија. И беше рекол Господ: 'Kе го отфрлам и Јуда од лицето Свое, како што го отфрлив домот Израилев, ке го отфрлам домот Израилев, ке го отфрлам и градот Ерусалим, што го одбрав, и храмот, за кој реков: таму ке престојува името Мое. И излезе Нехао, египетскиот цар, во војна против асирскиот цар на реката Ефрат кај Хархамис. Јосија му излезе во пресрет."},
	{21, "21 Нехао испрати кај него пратеници да кажат: 'Што има ме у мене и тебе, царе јудејски? Против тебе сега не сум тргал, туку за таму, каде што имам војна. Бог ми заповеда да брзам; немој да Му се противиш на Бога, Кој е со мене, за да не те погуби.'"},
	{22, "22 Но Јосија не отстапи пред него, туку се приготви да се бие со него; и не ги послуша зборовите на Нехао, што беа од Бога, туку излезе во бој во долината Магедо."},
	{23, "23 И стрелците го устрелија царот Јосија, и царот им рече на слугите свои: 'Одведете ме, зашто сум тешко ранет.'"},
	{24, "24 Слугите негови го симнаа од колата, го качија во друга негова кола и го одведоа во Ерусалим. И тој умре; и беше погребан во гробницата на татковците свои. Целата Јудеја и Ерусалим го оплакаа Јосија."},
	{25, "25 Јосија беше оплакан и од Еремија во плачевна песна; него го споменуваа сите певци и пеачки во плачевните песни свои, познати и до денес, кои ги предадоа во обичај во Израилот; ете, тие се напишани во книгата на плачевните песни."},
	{26, "26 Другите дела на Јосија и добрините негови, согласни со заповеданото во законот Господов,"},
	{27, "27 и неговите дела, први и последни, се опишани во книгата за царевите израилски и јудејски."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view36() {
struct mk36 poems[] = {
	{1, "1 Народот на таа земја го зеде Јоахаза, синот Јосиев, го помаза и го постави за цар на местото од таткото негов во Ерусалим."},
	{2, "2 Јоахаз имаше дваесет и три години кога стана цар, и царуваше во Ерусалим три месеца. Мајка му се викаше Амитал, керка Еремиева, од Ловна. Тоја направи лукаво дело пред Господа по сето она, што го вршеа татковците негови. И го окова фараонот Нехао во Девлат, во Ематската замја, за да не царува во Ерусалим."},
	{3, "3 Египетскиот цар го собори од престолот во Ерусалим, го одведе во Египет и и наложи на замјата глоба од сто таланти сребро и еден талант злато"},
	{4, "4 Египетскиот цар го постави братот негов Елијаким за цар на Јудеја и над Ерусалим, и му го смени името во Јоаким, а братот негов Јоахаз Нехао го зеде и го одведе во Египет, каде што и умре. Тој му давеше на Фараонот и сребро и злато. Тогаш земјата почна да дава сребро по заповед на Фараонот, и секој, според власта своја, бараше сребро и злато од народот на земјата како данок на фараонот Нехао."},
	{5, "5 Јоаким имаше дваесет и пет години, кога стана цар, и царуваше во Ерусалим единаесет години. Мајка му се викаше Зехора, керка Нириева, од Рама. Тој го вршеше она што не беше угодно пред очите на Господа, својот Бог, во се она, што го вршеа татковците негови. Во неговите дни Навуходоносор, царот вавилонски, нападна на земјата; тој му служеше три години, и се одметна од него. И ги испрати Господ против нив Халдејците, и разбојници сирски, и разбојници моавитски, и синовите Амонови и самариски, и тие отстапија според оној збор - според зборот на Господа преку устата на слугите Негови - пророците. Но гневот на Господа падна врз Јуда, за да го отфрли од лицето Свое, поради многуте гревови, што ги беше направил Манасија, и поради невината крв, штоа ја пролеа Јоаким, та го исполни Ерусалим со невина крв. Господ не посака да го искорени."},
	{6, "6 Против него излезе Навуходоносор, царот вавилонски, и го окова во окови, за да го одведе во Вавилон."},
	{7, "7 Дел од садовите на Господовиот дом пренесе Навуходоносор во Вавилон и ги постави во своето идолско светилиште во Вавилон."},
	{8, "8 Другите дела на Јоакима и гадотиите, што ги изврши и какви што се најдоа кај него, се опишани во книгата за царевите израилски и јудејски. И почина Јоаким при татковците свои и беше погребан во Ганозан при татковците свои. Место него стана цар синот негов Јехонија."},
	{9, "9 Јехонија имаше осумнаесет години кога стана цар, и царуваше во Ерусалим три месеца и десет дена. Тој го вршеше, она што беше лошо пред очите Господови."},
	{10, "10 Откако измина годината, царот Навуходоносор испрати и заповеда да го доведат во Вавилон заедно со скапоцените садови на Господовиот дом, го постави за цар на Јудеја и Ерусалим братот негов Седекија."},
	{11, "11 Седекија имаше дваесет и една година кога стана цар, и царуваше во Ерусалим единаесет години;"},
	{12, "12 и тој го вршеше она, што не беше угодно пред очите на Господа, својот Бог. Тој не се смири ни пред пророкот Јеремија, кој пророкуваше од Господовата уста."},
	{13, "13 и се одметна од царот Навуходоносор, кој беше зел клетва од него во името Божјо, - и се покажа тврдоглав и го ожесточи срцето свое до таму, што не се обрна кон Господа, Бога Израилев."},
	{14, "14 Па и сите началници над свештениците и над народот грешеа многу, подражавајки ги сите гадотии на незнабошците, и ги осквернуваа домот на Господа, што Он го беше осветил во Ерусалим."},
	{15, "15 Господ, Бог на нивните татковци, им испракаше Свои гласници уште во рано утро, зашто Му беше жал за Својот народ и Своето живеалиште."},
	{16, "16 Но тие се подбиваа со испратените од Бога и не се грижеа за зборовите Негови, ги понижуваа пророците Негови, дедека гневот на Господа не падна врз народот Негов, та немаше за него спасение."},
	{17, "17 И Он го испрати врз нив халдејскиот цар, и тој ги уби со меч младинците нивни во домот на нивната светиња; не го поштеди ни Седекија - ни девица, ни старец, ни немокен. Се предаде Бог во раката негова."},
	{18, "18 И сите садови на Божјиот дом, големи и мали, и ризниците на домот Господов, и ризниците на царот и кнезовите негови, - се однесе во Вавилон."},
	{19, "19 Па го изгореа Божјиот дом, ги разурнаа sидовите на Ерусалим и сите негови дворци со оган ги изгореа; и сите негови скапоцености ги расипаа."},
	{20, "20 А избавените од меч Навуходоносор ги пресели во Вавилон, и тие му беа робови нему, до зацарувањето на персискиот цар."},
	{21, "21 додека, за да се исполни зборот Господов, кажан преку устата на Јеремија, земјата не ги отпразнува своите саботи. Преку сите денови на запустувањето свое таа саботничеше, додека се наполнија седумдесет години."},
	{22, "22 А во првата година на персискиот цар Кир, за да се исплни зборот Господов, кажан преку устата на Јеремија, Гсопод го подбуди духот на Кир, персискиот цар, и тој заповеда да прогласат по целото негово царство, усно и писмено, и да кажат:"},
	{23, "23 'Вака рече Кир, цар перскиски: ‘Господ, Бог небесни, ми ги даде сите земни царства и ми заповеда да Му изградам дом во Ерусалим, во Јудеја. Кој е ме у вас од сиот Негов народ, Господ, неговиот Бог нека биде со него, и тој нека оди таму.‘'"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};