#include <map>
#include <string>
class Bible21
{
	struct be1	{ int val; const char *msg; };
	struct be2	{ int val; const char *msg; };
	struct be3	{ int val; const char *msg; };
	struct be4	{ int val; const char *msg; };
	struct be5	{ int val; const char *msg; };
	struct be6	{ int val; const char *msg; };
	struct be7	{ int val; const char *msg; };
	struct be8	{ int val; const char *msg; };
	struct be9	{ int val; const char *msg; };
	struct be10	{ int val; const char *msg; };
	struct be11	{ int val; const char *msg; };
	struct be12	{ int val; const char *msg; };
public:
static void view1() {
struct be1 poems[] = {
	{1, "1 Слова Эклезіяста, сына Давідавага, цара ў Ерусаліме."},
	{2, "2 Пустая марнасьць сказаў Эклезіяст, пустая марнасьць, - усё марнасьць!"},
	{3, "3 Якая карысьць чалавеку ад усёй працы ягонай, якую ён робіць пад сонцам?"},
	{4, "4 Пакаленьне прыходзіць, і пакаленьне праходзіць, а зямля векавечна стаіць."},
	{5, "5 Сонца ўзыходзіць, і сонца заходзіць і сьпяшаецца ў месца сваё, дзе ўстае."},
	{6, "6 Вее вецер на поўдзень і на поўнач вяртаецца, віруе, віхурыцца веючы, і на шлях віраваньня вяртаецца вецер."},
	{7, "7 Рэкі ўсе ў мора плывуць, а мора не перапаўняецца; да месца таго, адкуль рэкі плывуць, вяртаюцца зноў, каб далей пацячы."},
	{8, "8 Усё існае - поўніцца працай; ня можа ўсяго чалавек пакласьці на словы: не насыціцца бачаньнем вока; не напоўніцца слуханьнем вуха."},
	{9, "9 Што было, тое і будзе; што рабілася, тое й рабіцьмецца, і нічога новага пад сонцам няма."},
	{10, "10 Бывае такое, пра што людзі кажуць: Дзівіся, вось гэта новае; але яно ўжо было спрадвеку, да нас."},
	{11, "11 Няма памяці пра былое; ды і пра тое, што будзе, не застанецца згадкі між тымі, што прыйдуць пасьля."},
	{12, "12 Я, Эклезіяст, быў царом над Ізраілем у Ерусаліме."},
	{13, "13 І паклаў я на сэрца помысел мой, каб шукаць і дасьледаваць мудрасьцю ўсё, што пад небам робіцца: гэты прыкры занятак даў Бог сынам чалавечым, каб кіраваліся ім."},
	{14, "14 Я ўсе дзеі пабачыў, якія пад сонцам чыняцца, і вось, усё - марнасьць і пагоня за ветрам!"},
	{15, "15 Крывое ня выпрастаецца, і чаго няма, таго нельга зьлічыць."},
	{16, "16 Гаварыў я з сэрцам маім і сказаў: вось, узьвялічыўся я і здабыў мудрасьці болей за ўсіх, што былі да мяне над Ерусалімам, і сэрца маё шмат нагледзела мудрасьці ўсякай і ведаў."},
	{17, "17 І паклаў я на сэрца помысел мой, каб мудрасьць уведаць, спасьцігнуць шаленства і неразумнасьць; спазнаў, што і гэта - пагоня за ветрам."},
	{18, "18 Бо пры многасьці мудрасьці множыцца й скруха; і хто памнажае спазнаньне, той памнажае і боль."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct be2 poems[] = {
	{1, "1 І сказаў я ў сэрцы маім: Ану ж бо праверу цябе я радасьцю, і нацешуся дабром; але ж гэта - марнота!"},
	{2, "2 Пра сьмех я сказаў: Недарэчнасьць!, а пра радасьць: Што яна дасьць?"},
	{3, "3 Намысьліў я ў сэрцы маім падбадзёрваць віном маё цела і, тым часам як сэрца маё кіравацьмецца мудрасьцю, ня цурацца і дурасьці, пакуль не пабачу, што добра сынам чалавечым, што маюць яны рабіць пад небам за кароткія дні свайго веку."},
	{4, "4 Учыніў я вялікія дзеі: дамы я сабе збудаваў, насадзіў сабе вінаграднікі;"},
	{5, "5 завёў сабе сады і гаі, насадзіў у іх розных пладовых дрэў;"},
	{6, "6 нарабіў сабе сажалак, каб паліваць зь іх гаі, у якіх дрэвы растуць;"},
	{7, "7 наняў сабе слуг і служанак, і дамачадцы былі ў мяне; а таксама буйной і дробнай худобы было ў мяне болей, чым ва ўсіх, што жылі да мяне ў Ерусаліме;"},
	{8, "8 сабраў сабе срэбра і золата й скарбаў каштоўных ад цароў і правінцый; завёў у сябе сьпевакоў і сьпявачак і асалоду сыноў чалавечых - мноства жонак і наложніц."},
	{9, "9 І ўзьвялічыўся я і ўзбагацеў над усімі, што жылі да мяне ў Ерусаліме; і мудрасьць мая засталася пры мне."},
	{10, "10 І нічога, чаго вочы мае ні прагнулі, я ім не адмовіў; ад ніводнае радасьці сэрца майго ня ўхіліў, бо сэрца маё суцяшалася кожнаю працай маёю; і гэта было маёй доляй ва ўсіх маіх працах."},
	{11, "11 І калі я зірнуў на ўсе дзеі мае, якія ўчыняў я сваімі рукамі, на працу, якую рабіў я: і вось, усё - марнасьць і пагоня за ветрам, і ніякай карысьці пад сонцам."},
	{12, "12 Пастанавіў я сабе пабачыць і мудрасьць, шаленства і дурасьць. Бо што зробіць пасьля цара чалавек звыш таго, што зроблена ўжо?"},
	{13, "13 І ўбачыў я, што мудрасьць пераважае над дурасьцю так, як сьвятло над цемраю."},
	{14, "14 У мудрага вочы яго - у галаве яго, а бязглузды ходзіць у цемры. І даведаўся я таксама, што аднолькавая спаткае ўсіх доля."},
	{15, "15 І сказаў я ў сэрцы маім: ? мяне спасьцігне такая самая доля, як і дурнога: навошта ж я надта мудры зрабіўся? І сказаў я ў сэрцы маім, што і гэта - марнасьць."},
	{16, "16 Бо мудрага помніць ня будуць вечна, як і дурнога; у днях наступных забудзецца ўсё, і памірае мудры гэтаксама, як і бязглузды."},
	{17, "17 І зьненавідзеў жыцьцё я: бо апрыкралі мне ўсе ўчынкі, якія пад сонцам зьдзяйсьняюцца; бо ўсё - пустая марнасьць і пагоня за ветрам!"},
	{18, "18 І зьненавідзеў усю маю працу, якую рабіў я пад сонцам; бо мушу пакінуць яе чалавеку, які прыйдзе пасьля мяне."},
	{19, "19 І хто ведае: мудры ён будзе альбо дурны? А валодаць ён будзе ўсёй працай маёю, якую рабіў я і ў якой паказаў сябе мудрым пад сонцам. І гэта - марнасьць!"},
	{20, "20 І спаняверыўся я і ўмаўляў маё сэрца адцурацца ад працы ўсяе, якую рабіў я пад сонцам:"},
	{21, "21 Бо бывае такі чалавек, які ў працы і мудры, і ўдзельны, і плённы, а павінен пакінуць усё чалавеку, які над тым не працаваў. І гэта - марнасьць і вялікае ліха!"},
	{22, "22 Бо што будзе мець чалавек ад працы сваёй і клопату сэрца свайго, якімі мазоліцца ён пад сонцам?"},
	{23, "23 Бо ўсе яго дні - пакуты, і праца ягоная - смутак; нават і ўночы сэрца яго спакою ня мае. І гэта - марнасьць!"},
	{24, "24 Няма чалавеку ўлады над тою даброцьцю, каб есьці і піць і каб душа мела радасьць ад працы ягонай. Я ўбачыў: і гэта - з рук Божых."},
	{25, "25 Бо хто можа есьці і хто безь яго можа цешыцца з асалодаў?"},
	{26, "26 Бо чалавеку, які перад абліччам Ягоным ёсьць добры, Ён мудрасьць дае, і веды, і радасьць; а грэшнаму клопат дае - зьбіраць, назапашваць, каб богаспадобнаму потым аддаць. І гэта - марнасьць і пагоня за ветрам!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view3() {
struct be3 poems[] = {
	{1, "1 Усё мае сваю пару, і гадзіна кожнае дзеі - пад небам."},
	{2, "2 Ёсьць пара нарадзіцца, і пара памерці, пара насаджаць, і пара вырываць пасаджанае."},
	{3, "3 Пара забойства, і пара гаеньня; пара разбураць, і пара будаваць;"},
	{4, "4 пара плачу, і пара весялосьці; пара бедаваць, і пара танцаваць;"},
	{5, "5 пара раскідаць камяні, і пара зьбіраць камяні; пара абдымаць, і пара ўхіляцца абдоўмаў;"},
	{6, "6 пара шукаць, і пара губляць; пара ашчаджаць, і пара выкідаць;"},
	{7, "7 пара разьдзіраць, і пара зашываць; пара маўчаць, і пара прамаўляць;"},
	{8, "8 пара кахаць, і пара ненавідзець; пара вайне, і пара міру."},
	{9, "9 Якая карысьць таму, хто працуе, з таго, над чым ён працуе?"},
	{10, "10 Бачыў я гэты клопат, які Бог даў сынам чалавечым, каб мелі сабе турботу."},
	{11, "11 Усё Ён цудоўным зрабіў сваёю парою і вечнасьць паклаў ім у сэрца, хоць ня кемяць яны ў тых справах, што Бог учыніў, ад пачатку і да канца."},
	{12, "12 Уведаў я, што няма ім нічога лепшага, як весяліцца і ў жыцьці сваім добрае толькі ўчыняць."},
	{13, "13 І калі які чалавек есьць і п'е і бачыць дабро ва ўчынках сваіх, дык гэта - дар Божы."},
	{14, "14 Уведаў я, што ўсё, што робіць Бог, застаецца навекі; Ён робіць так, каб багавейна ступалі перад абліччам Яго."},
	{15, "15 Што было, тое ёсьць і цяпер, і што будзе, тое было ўжо; і пакліча Бог мінулае."},
	{16, "16 Яшчэ я пад сонцам пабачыў: месца суду - а там беззаконьне; месца праўды - а там няпраўда"},
	{17, "17 І сказаў я ў сэрцы маім: Судзіць будзе Бог праведнага і грэшнага; бо на кожную справу прызначана пара і суд на кожную дзею тваю."},
	{18, "18 Сказаў я ў сэрцы маім сынам чалавечым, каб Бог іх выпрабаваў і каб убачылі яны, што самі ў сабе яны - жывёлы:"},
	{19, "18 бо доля ў сыноў чалавечых і доля ў жывёлін - доля адна; як паміраюць тыя, так паміраюць і гэтыя, і адно дыханьне ва ўсіх, і няма ў чалавека над жывёлінаю перавагі, бо ўсё - марнасьць!"},
	{20, "20 Усё ідзе ў адно месца; усё выйшла з тла, і ўсё вяртаецца ў тло."},
	{21, "21 Хто ведае: ці дух сыноў чалавечых падымаецца ўгору, а ці дух жывёл апускаецца долу, у зямлю?"},
	{22, "22 І вось убачыў я, што няма нічога лепшага чалавеку, як радавацца з учынкаў сваіх: бо гэта - доля яго; хто ж бо яго прывядзе паглядзець на тое, што пасьля яго будзе?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view4() {
struct be4 poems[] = {
	{1, "1 І прыгледзеўся зноў я, і ўгледзеў уціскі ўсялякія, што пад сонцам здараюцца: і вось сьлёзы прыгнечаных, а суцешніка ў іх няма; і ў руцэ ў прыгнятальнікаў іхніх - сіла, а суцешніка ў іх няма."},
	{2, "2 І прызнаў я шчасьлівымі мёртвых, якія памерлі даўно, больш, чым жывых, што дагэтуль жывуць;"},
	{3, "3 а шчасьлівейшы той за абодвух, хто яшчэ не радзіўся, хто ня бачыў яшчэ ліхадзействаў, якія пад сонцам вядуцца."},
	{4, "4 І зноў я пабачыў, што ўсякая праца і посьпех усякі ў справах узаемную зайздрасьць паміж людзьмі спрычыняюць. І гэта - марнасьць і пагоня за ветрам!"},
	{5, "5 Неразумны сядзіць, склаўшы рукі свае, і жарэ сваё цела."},
	{6, "6 Лепей жменя спакою за поўныя прыгаршчы клопату і пагоню за ветрам."},
	{7, "7 І зірнуў я, і зноў убачыў марнасьць пад сонцам:"},
	{8, "8 самотнік, і ня мае нікога ён іншага: ні сына, ні брата няма ў яго; і ня мае канца ён турботам сваім, і не насыціцца вока яго багацьцем. На каго ж я працую, і даброцяў душу сваю пазбаўляю? І гэта - марнасьць і прапалая справа!"},
	{9, "9 Дваім лепей, чым аднаму, бо ёсьць ім добрая дзяка за іхнюю працу."},
	{10, "10 Бо, як адзін упадзе, падыме другі свайго сябра! Але гора таму, хто адзін упадзе, а другога няма, хто падняў бы яго."},
	{11, "11 Гэтак сама, як двое ляжаць, дык ім цёпла; а дзе аднаму прыгрэцца?"},
	{12, "12 І калі б хто напаў на другога, дык выстаяць двое супраць таго. І нітка, ссуканая з трох, ня скора парвецца."},
	{13, "13 Лепей бедны, ды разумны хлапчына, чым стары, ды неразумны цар, які рады ня слухае."},
	{14, "14 Бо той зь вязьніцы выйдзе на царства, хто нарадзіўся ў царстве сваім бедным."},
	{15, "15 Бачыў я ўсіх жывых, што ходзяць пад сонцам, з гэтым другім юнком, які зойме месца таго."},
	{16, "16 Ня было ліку ўсяму люду, які быў перад ім, хоць і наступныя радасьці ў ім ня мецьмуць. І гэта - марнасьць і пагоня за ветрам!"},
	{17, "17 Сачы за нагою тваёю, калі ідзеш у дом Божы, і будзь гатовы больш слухаць, чым ахвяры прыносіць; ня думаюць бо яны, што благое ўчыняюць."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view5() {
struct be5 poems[] = {
	{1, "1 Ня будзь на язык надта борзды, і сэрца тваё хай ня будзе сьпяшацца сказаць перад Богам слова, таму што Бог на небе, а ты на зямлі! Таму слова тваё хай ашчаднае будзе."},
	{2, "2 Бо як сны бачацца ад вялікае працы, так голас дурнога пазнаецца па пустаслоўі."},
	{3, "3 Калі даеш абяцаньне Богу, не замаруджвай выконваць яго, бо ня мае Ён упадабаньня да неразумных: што абяцаўся - зрабі."},
	{4, "4 Лепей табе не абяцацца, чым абяцаць і не зрабіць."},
	{5, "5 Не дазваляй тваім вуснам уводзіць у грэх тваё цела і не кажы перад анёлам Божым: гэта - памылка! Навошта табе, каб загневаўся Бог на слова тваё і зруйнаваў дзеі рук тваіх?"},
	{6, "6 Бо ў мроіве сноў, як і ў мроіве слоў - марнасьці шмат; а ты бойся Бога."},
	{7, "7 Калі ты ўбачыш у якім-небудзь краі ўціскі беднаму і парушэньне суду і праўды, дык ня зьдзіўляйся з гэтага, бо за высокім назірае вышэйшы, а над імі яшчэ вышэйшы;"},
	{8, "8 а найвышэйшасьць краіны ёсьць цар, які дбае за ўсю краіну."},
	{9, "9 Хто любіць срэбра, той не насыціцца срэбрам, і хто любіць багацьце, ня мае карысьці зь яго. І гэта - марнасьць!"},
	{10, "10 Калі множыцца маёмасьць, множацца і тыя, што яго спажываюць; і якая карысьць яго ўласьнікам: хіба толькі сваімі вачмі сузіраць?"},
	{11, "11 Салодкі сон у таго, хто працуе, ці мала ён есьць, а ці многа; а сытасьць багатаму спаць не дае."},
	{12, "12 Ёсьць нядоля балючая, якую я пад сонцам бачыў: багацьце, якое ўласьнік пільнуе на шкоду сабе."},
	{13, "13 І гіне багацьце яго ад няшчасных выпадкаў: нарадзіў ён сына, а нічога няма ў руках у яго."},
	{14, "14 Як выйшаў ён голы з улоньня маці сваёй, такі і адыдзе, якім прыйшоў, і нічога ня возьме ад працы сваёй, што мог бы панесьці ў руцэ сваёй."},
	{15, "15 І гэта нядоля балючая: які ён прыйшоў, такі адыходзіць. Якая ж карысьць яму, што працаваў ён на вецер?"},
	{16, "16 А да таго ўсе дні свае еў ён у цемры, у вялікай дакуцы, скрусе й маркоце."},
	{17, "17 Вось яно, што я добрага і прыемнага бачыў: есьці і піць і добрае бачыць ва ўсёй сваёй працы, якую ён робіць пад сонцам ва ўсе дні свайго веку, якія даў яму Бог; бо гэта - ягоная доля."},
	{18, "18 І калі якому чалавеку Бог даў багацьце і маёмасьць, і даў яму ўладу іх спажываць і браць сваю частку ад працы сваёй, дык гэта - дар Божы."},
	{19, "19 Ня многа бо дзён жыцьця свайго мецьме на памяці; таму яго Бог адарае радасьцю сэрца ягонага."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view6() {
struct be6 poems[] = {
	{1, "1 Ёсьць зло, якое я ўбачыў пад сонцам, і багата яго між людзьмі:"},
	{2, "2 Бог дае чалавеку багацьце, і маёмасьць, і славу, і душы ягонай ніякай нястачы няма ані ў чым, чаго зажадае; ды ня даў яму Бог карыстацца з таго, а чужы чалавек спажывае: гэта - марнасьць і ліхая нядоля!"},
	{3, "3 Калі б сотню дзяцей напладзіў чалавек і пражыў шмат гадоў і памножыліся дні яго веку, а душа яго ўцехі ня мела б з дабротаў і каб ня было яму і пахаваньня, я сказаў бы: неданосак шчасьлівейшы за яго,"},
	{4, "4 бо дарма ён прыйшоў і ў цемру сышоў, і імя яго ўкрылася змрокам:"},
	{5, "5 ані сонца ня бачыў і не спазнаў: яму спакайней, чым таму."},
	{6, "6 А той, хоць пражыў бы дзьве тысячы год і не насыціўся б дабром, ці ж не ў адно і тое месца ідзе?"},
	{7, "7 Уся праца людская - для рота, а душа чалавека - не насычаецца."},
	{8, "8 Якая ж перавага ў мудрага над неразумным, якая - у гаротніка, што ўмее хадзіць, над тымі, што жывуць?"},
	{9, "9 Лепей бачыць вачыма, чым душою блукаць. А гэта - таксама марнасьць і пагоня за ветрам!"},
	{10, "10 Што існуе, таму дадзена ўжо найменьне, і вядома, што гэта - чалавек і што ня можа ён прававацца з тымі, якія мацнейшыя за яго."},
	{11, "11 Шмат ёсьць такога, што памнажае марнасьць: што ж чалавеку лепей?"},
	{12, "12 Бо хто ведае, што чалавеку добра ў жыцьці, у безьлічы дзён марнага веку яго, якія праходзяць, бы цень? І хто чалавеку скажа, што будзе пад сонцам пасьля яго?"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view7() {
struct be7 poems[] = {
	{1, "1 Імя добрае лепш за масьць дарагую, а дзень сьмерці - за дзень нараджэньня."},
	{2, "2 Лепей хадзіць у дом жалобы па мёртвым, чым у харомы банкету; бо такі ёсьць канец усякаму чалавеку, і жывы бярэ гэта да сэрца свайго."},
	{3, "3 Смутак лепшы за сьмех; а сэрца бязглуздых - у доме вясёлым."},
	{4, "5 Лепей слухаць дакоры ад мудрага, чым слухаць пахвалы ад неразумных;"},
	{5, "6 бо сьмех неразумных ёсьць тое, што й трэск сухога ядлоўцу пад горшчыкам. І гэта - марнасьць!"},
	{6, "7 Уціскаючы іншых, разумны дурнее, і хабар сэрца псуе."},
	{7, "8 Канец працы лепшы за пачатак яе; цярплівы лепшы за пыхлівага."},
	{8, "9 Не сьпяшайся да гневу духам тваім, бо гняздуецца гнеў у сэрцы бязглуздых."},
	{9, "10 Не кажы: чаму гэта колісь было лепей, чым сёньня? - не зь вялікага розуму ты папытаўся пра гэта."},
	{10, "11 Добрая мудрасьць - як і добрая спадчына, асабліва ж бо тым, што сонца бачаць:"},
	{11, "12 бо пад шатамі мудрасьці, як пад шатамі срэбра; а перавага пазнаньня ў тым, што мудрасьць жыцьцё зьберагае таму, хто яе мае."},
	{12, "13 Прыгледзься да дзеяў Божых: хто можа выправіць тое, што Ён зрабіў крывым."},
	{13, "14 У добрыя дні карыстайся з дабротаў, а ў ліхія дні разважай: і тое і іншае стварыў Бог, каб ня мог чалавек нічога сказаць пасьля сябе."},
	{14, "15 Нагледзеўся я ў дні марноты сваёй усялякага ўдосыць: справядлівы гіне ў сваёй справядлівасьці; бязбожны доўга жыве ў бязбожнасьці сваёй."},
	{15, "16 Ня будзь лішне строгі, і не выстаўляйся залішне мудрым; навошта табе нішчыць сябе?"},
	{16, "17 Не ўпадай у грахі і ня будзь шалёны; навошта табе паміраць заўчасна?"},
	{17, "18 Добра, калі трымацьмешся толькі аднога і не адымеш рукі ад другога; бо хто богабаязны, той пазьбегне ўсяго благога."},
	{18, "19 Мудрасьць робіць мудрага мацнейшым за дзесяць уладароў, якія ў горадзе."},
	{19, "20 Няма чалавека справядлівага на зямлі, які рабіў бы дабро і не грашыў;"},
	{20, "21 таму не на ўсякае сказанае слова зважай, каб не пачуць табе, як твой раб цябе ганіць."},
	{21, "22 Бо многа выпадкаў ведае сэрца тваё, калі сам ты ганіў іншых."},
	{22, "23 Я ўсё гэта мудрасьцю выпрабаваў; я сказаў: буду я мудры; але мудрасьць далёка ад мяне."},
	{23, "24 Далёка тое, што ёсьць, і глыбока-глыбока: хто дастане яго?"},
	{24, "25 І паклаў я на сэрца помысел мой, каб дазнацца, дасьледаваць, і знайсьці мудрасьць і розум, і каб ведаць бязбожнасьць дурноты, невуцтва і шаленства."},
	{25, "26 І знайшоў я, што горш за сьмерць жанчына, таму што яна - сетка, і сэрца ў яе - пастка, рукі ў яе - кайданы; любасны Богу ўратуецца ад яе, а грэшніка схопіць яна."},
	{26, "27 Вось гэта знайшоў я, сказаў Эклезіяст, выпрабоўваючы адно за адным."},
	{27, "28 Чаго яшчэ шукала душа мая, і я не знайшоў? Мужчыну аднаго з тысячы я знайшоў, а жанчыны сярод іх усіх не знайшоў."},
	{28, "29 Толькі гэта знайшоў я, што Бог стварыў чалавека праведнага, а людзі кінуліся ў вымудры ўсякія."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view8() {
struct be8 poems[] = {
	{1, "1 Хто ёсьць - як мудрэц, і хто разумее значэньне слова? Мудрасьць прасьвятляе чалавеку аблічча яго, і суровасьць твару яго зьмяняецца."},
	{2, "2 Я кажу: трымайся царскага слова, і гэта дзеля прысягі перад Богам."},
	{3, "3 Не сьпяшайся ўхіляцца аблічча яго і не зацінайся ў слове благім; бо ён усё можа зрабіць, што захоча."},
	{4, "4 Дзе слова цара, там улада, і хто яму скажа: што ты робіш?."},
	{5, "5 Хто выконвае запаведзь, той не зазнае нічога ліхога. Сэрца мудрага ведае час і ўправу;"},
	{6, "6 бо на ўсякую рэч ёсьць свая пара і ўправа; а чалавеку вялікае ліха з таго,"},
	{7, "7 бо ня ведае ён, што будзе; і як яно будзе - хто скажа яму?"},
	{8, "8 Чалавек ня мае ўлады над духам, каб дух утрымаць, і няма ў яго ўлады над сьмертнай часінай, і няма збавеньня ў гэтым змаганьні, і не ўратуе бязбожнасьць бязбожніка."},
	{9, "9 Усё гэта бачыў я і да сэрца майго браў усякую справу, якая пад сонцам чыніцца. Бывае час, калі чалавек валадарыць над чалавекам на шкоду яму."},
	{10, "10 Бачыў тады я, што хавалі бязбожных, і прыходзілі ў магілу, і адыходзілі далёка ад сьвятога месца, і забывалі ў горадзе іх, што жылі праведна. І гэта - марнасьць!"},
	{11, "11 Няскора ўчыняецца суд над благімі справамі; таму не баіцца сэрца сыноў чалавечых чыніць ліхату."},
	{12, "12 Хоць сто разоў робіць грэшнік ліхое і зацінаецца ў тым, але ведаю я, што добра будзе богабаязным, якія перад абліччам Ягоным стаяць багавейна;"},
	{13, "13 а бязбожнаму добра ня будзе, і як цень, нядоўга стаяцьме той, хто перад Богам не багавейны."},
	{14, "14 Ёсьць на зямлі і такая марнота: праведнага спасьцігае тое, чаго заслугоўваюць дзеі бязбожных, а зь бязбожнымі чыніцца тое, чаго заслугоўваюць дзеі праведнікаў. І сказаў я: і гэта - марнасьць!"},
	{15, "15 І ўславіў я радасьць; бо няма лепшага чалавеку пад сонцам, як есьці, піць і радавацца; гэта ідзе зь ім у працы ў дні жыцьця яго, якія даў яму Бог пад сонцам."},
	{16, "16 Калі паклаў я на сэрца помысел мой, каб мудрасьць спазнаць і пабачыць справы, што робяцца на зямлі і сярод якіх чалавек ані ўдзень, ані ўночы спачыну ня мае:"},
	{17, "17 тады я і ўбачыў усе дзеі Божыя і зразумеў, што ня можа чалавек спазнаць дзеі пад сонцам. Колькі б ні працаваў чалавек, каб дашукацца, а не зразумее таго; і калі б сказаў які-небудзь мудрэц, што ён ведае, - а ня здолее ён даўмецца да таго."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view9() {
struct be9 poems[] = {
	{1, "1 Усё гэта ў сэрца я ўзяў, каб дазнацца, што праведнікі і грэшнікі і іх учынкі - у Божай руцэ і што чалавек ні любові ні злосьці ня знае ва ўсім, што перад ім."},
	{2, "2 Усяму і ўсім - адно: адна доля праведніку і бязбожнаму, добраму і ліхому, чыстаму і нячыстаму, таму, хто прыносіць ахвяры, і таму, хто ахвяр ня прыносіць; як дабрачыннаму, так і грэшнаму; як таму, хто прысягаецца, так і таму, хто цураецца клятвы."},
	{3, "3 Вось гэта ёсьць ліха ва ўсім, што пад сонцам робіцца, што адна доля ўсім, і сэрца сыноў чалавечых напоўнена злом, і неразумнасьць у сэрцы ў іх, у жыцьці іхнім; а потым яны адыходзяць да мёртвых."},
	{4, "4 Хто сярод жывых, той мае яшчэ надзею, бо і сабаку жывому лепей, чым мёртваму льву."},
	{5, "5 Жывыя ведаюць, што памруць, а мёртвыя нічога ня ведаюць, і ўжо ім аддзякі няма, бо і памяць пра іх адышла ў забыцьцё,"},
	{6, "6 і любоў іхняя, і нянавісьць іхняя, і зайздрасьць іхняя ўжо зьніклі, і няма болей учты ім вавекі ні ў чым, што пад сонцам робіцца."},
	{7, "7 Дык вось, ідзі, з радасьцю еж твой хлеб, у радасьці сэрца пі віно тваё, калі будзе на справы твае добрая Божая воля."},
	{8, "8 Хай сьветлай будзе ва ўсякую пору адзежа твая і хай не абсохне алей на тваёй галаве."},
	{9, "9 Радуйся жыцьцю з жонкай тваёю, якую кахаеш, ва ўсе часіны жыцьця твайго марнага, якое даў табе Бог пад сонцам на ўсе дні твайго марнага веку; бо гэта - доля твая ў жыцьці і ў працы тваёй, якую ты робіш пад сонцам."},
	{10, "10 Усё, што можа зрабіць твая рука, па сіле рабі; бо ў магіле, у якую ты ляжаш, няма ні працы, ні разважаньня, ні ведаў, ні мудрасьці."},
	{11, "11 І зноў я пабачыў пад сонцам, што ня ўвішным пасьпяховы бег дастаецца, не адважным - перамога, ня мудрым - хлеб, і не ў разумных - багацьце, і ня ўмельцам - прыхільнасьць, а ад пары й нагоды залежаць яны."},
	{12, "12 Бо чалавек сваёй пары ня знае. Як рыбы ловяцца ў згубную сетку, як птушкі ў сілах заблытваюцца, так сыны чалавечыя за ліхі час хапаюцца, калі ён раптоўна находзіць на іх."},
	{13, "13 Яшчэ вось якую мудрасьць пад сонцам я ўгледзеў, і яна мне здалася важнаю:"},
	{14, "14 горад невялікі, і людзей у ім небагата; падступіўся да яго вялікі цар, і атачыў яго шчыльна, і падрыхтаваў супроць яго аблогу;"},
	{15, "15 але знайшоўся ў ім мудры бядняк, і ён выратаваў мудрасьцю горад; але ж потым ніхто не згадаў таго бедака."},
	{16, "16 І сказаў я: мудрасьць лепшая за сілу, але мудрасьць бедняка заняхайваецца, і словаў ягоных ня слухаюць."},
	{17, "17 Словы мудрых, спакойныя, выслухоўваюцца лепей, чым крык валадара сярод дурняў."},
	{18, "18 Мудрасьць лепшая за вайсковую зброю; але адзін грэшнік загубіць многа дабра."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view10() {
struct be10 poems[] = {
	{1, "1 Мёртвыя мухі псуюць і смуродзяць пахучую масьць міраварніцы, тое самае робіць малая дурнота шаноўнага чалавека зь яго мудрасьцю й гонарам."},
	{2, "2 Сэрца мудрага - праваруч, а сэрца бязглуздага - леваруч."},
	{3, "3 І па дарозе, калі дурань ідзе, не стае яму глузду, і кожнаму пакажа, што ён дурны."},
	{4, "4 Калі ўспыхне начальніцкі гнеў на цябе, не пакідай свайго месца; бо рахманасьць даводзіць да дараваньня вялікіх правінаў."},
	{5, "5 Ёсьць зло, якое бачыў я пад сонцам, падобнае да памылкі, якая ад валадара паўстала:"},
	{6, "6 на вялікіх вышынях, бывае, сядзіць дурнота, а багатыя нізка садзяцца;"},
	{7, "7 бачыў я конных рабоў, а князёў, што пеша, нібы рабы, хадзілі."},
	{8, "8 Хто яму капае, той у яе і ўпадзе, і хто разбурае агароджу, таго ўкусіць зьмяя."},
	{9, "9 Хто зносіць каменьне, той можа сябе надсадзіць, і хто коле дровы, той мае пагрозу ад іх."},
	{10, "10 Калі прытупляецца сякера і хтось ляза не навострыць, шмат намогі дадаць давядзецца; перавага плённае дзеі - мудрасьць."},
	{11, "11 Калі гадзіна ўкусіць без заклінаньня, дык ня лепшы за яе і злоязыкі."},
	{12, "12 Слова з вуснаў мудрага - мілата, а вусны дурнога яго ж і нішчаць:"},
	{13, "13 пачатак слоў зь яго вуснаў - глупства, а канец яго казані з вуснаў - шаленства."},
	{14, "14 Дурны шмат чаго нагаворыць, хоць ня ведае чалавек, што будзе, і хто скажа яму, што пасьля яго станецца?"},
	{15, "15 Праца дурнога стамляе яго, бо ён і ня ведае нават дарогі да горада."},
	{16, "16 Гора табе, зямля, калі цар твой - дзіця і калі ўладыкі твае ядуць рана!"},
	{17, "17 Шчасьце табе, зямля, калі цар твой з высокага роду і ўладыкі твае ядуць у назначаны час, каб мацавацца, а не разьядацца!"},
	{18, "18 Ад гультайства і столь прасядае; і як апусьцяцца рукі, дык дом пацячэ."},
	{19, "19 Гасьціны спраўляюць для асалоды, і віно зьвесяляе жыцьцё; а за ўсё адказвае срэбра."},
	{20, "20 Нават і ў думках тваіх не ліхаслові цара, і ў спальні тваёй не ліхаслові багатага; бо і птушка нябесная можа словы твае перанесьці, а крылатая - казань тваю пераказаць."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view11() {
struct be11 poems[] = {
	{1, "1 Хлеб свой пускай па вадзе, час міне, і зноў знойдзеш яго."},
	{2, "2 Давай частку на сем і нават на восем, бо ня ведаеш, якая нагода чакае зямлю."},
	{3, "3 Як напоўняцца хмары, яны выльюць дождж на зямлю; і як паваліцца дрэва на поўдзень, на поўнач, так і ляжацьме, як яно ўпала."},
	{4, "4 Хто зважае на вецер, той сеяць ня будзе; і хто паглядае на хмары, ня будзе той жаць."},
	{5, "5 Як ня ведаеш ты дарогі вятроў і таго, як ствараюцца косьці ва ўлоньні ў цяжарнай, так ня можаш ты ведаць і дзеяў Бога, Які робіць усё."},
	{6, "6 Раніцай сей насеньне тваё і ўвечары не давай адпачынку руцэ; бо ня ведаеш ты, ці тое, ці іншае дасьць большы плён альбо тое і іншае будзе аднолькава добра."},
	{7, "7 І сьвятло салодкае, і добра вачам бачыць сонца."},
	{8, "8 Калі чалавек пражывае многа гадоў, хай весяліцца ўвесь час праз гады, і хай памятае пра цёмныя дні, якіх будзе шмат: усё, што будзе, - марнасьць!"},
	{9, "9 Весяліся, хлопча, у юнацтве тваім, і хай сэрца тваё вясёлае будзе ва ўсе дні маладосьці тваёй, і хадзі пуцявінамі сэрца твайго і сьветлым бачаньнем вачэй тваіх; толькі ведай, што за ўсё гэта Бог пакліча на суд."},
	{10, "10 І смутак гані ад сэрца твайго, і адпрэчвай благое ад цела твайго, бо маладосьць і маленства - марнасьць!"},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view12() {
struct be12 poems[] = {
	{1, "1 І памятай Творцу твайго ў дні юнацтва твайго, пакуль ня прыйшлі цяжкія дні і гады не насталі, пра якія ты будзеш казаць: няма мне ад іх асалоды!,"},
	{2, "2 пакуль не патухлі сонца, і сьвятло, і месяц, і зоркі і не насунуліся новыя хмары пасьля дажджу."},
	{3, "3 У той дзень, калі задрыжаць тыя, што дом ацаляюць, і сагнуцца мужы сілы; і перастануць малоць тыя, што мелюць, бо няшмат ужо іх засталося; і зацьмяцца тыя, якія глядзяць у акно;"},
	{4, "4 і замыкацца будуць дзьверы на двор; калі аціхне гул жорнаў, і будзе ўставаць чалавек на пеўнеў крык, і замоўкнуць дочкі пяяньня;"},
	{5, "5 і вышыні іх будуць палохаць, і на дарозе жахі; і міндаль зацьвіце, і ў траве зьнярухомее конік, і рассыплецца каперс, - бо адыходзіць чалавек у вечны свой дом, і гатовыя абступіць яго плакальшчыцы на дарозе;"},
	{6, "6 пакуль не парваўся срэбраны ланцужок, і не разьбілася залатая чаша, і не разьбіўся збанок ля крыніцы, і не абвалілася кола над студняй."},
	{7, "7 І вернецца тло ў зямлю, чым і было яно; і вернецца дух да Бога, Які даў яго."},
	{8, "8 Наймарнейшая марнасьць, сказаў Эклезіяст, усё - марнасьць!"},
	{9, "9 Акрамя таго, што Эклезіяст быў мудры, ён вучыў яшчэ народ ведам. Ён усё выпрабоўваў, дасьледаваў і склаў многа выслоўяў."},
	{10, "10 Стараўся Эклезіяст вышукваць зграбныя выслоўі і словы праўды напісаў слушна."},
	{11, "11 Словы мудрых - што іголкі, як убітыя цьвікі, і складальнікі іх - ад адзінага пастыра."},
	{12, "12 А што звыш усяго гэтага, сыне мой, таго асьцерагайся: складаць многа кніг - канца ім ня будзе, і многа чытаць - стамляецца цела."},
	{13, "13 Выслухаем сутнасьць усяго: бойся Бога і запаведзяў Ягоных трымайся, бо чалавеку ў гэтым - усё."},
	{14, "14 Бо ўсякі ўчынак Бог прывядзе на суд і ўсё таемнае, ці яно добрае, а ці благое."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};