#include <map>
#include <string>
class Bible37
{
	struct be1	{ int val; const char *msg; };
	struct be2	{ int val; const char *msg; };
public:
static void view1() {
struct be1 poems[] = {
	{1, "1 На другім годзе цара Дарыя, на шостым месяцы, у першы дзень месяца было слова Гасподняе праз Агея прарока Зарававэлю, сыну Салафіілеваму, упраўцу Юдэі, і Ісусу, сыну Ясэдэкаваму, вялікаму іярэю."},
	{2, "2 Так сказаў Гасподзь Саваоф: народ гэты кажа: ня прыйшоў яшчэ час - будаваць дом Гасподні."},
	{3, "3 І было слова Гасподняе праз Агея прарока:"},
	{4, "4 а вам самім час - жыць у дамах вашых упрыгожаных, тым часам як дом гэты ў запусьценьні?"},
	{5, "5 Таму сёньня так кажа Гасподзь Саваоф: павярнеце сэрца ваша на дарогі вашыя."},
	{6, "6 Вы сееце многа, а зьбіраеце мала: ясьце, але ўнядосыць; п'яце, але не напіваецеся; апранаецеся, але не саграваецеся; заробнік платы зарабляе ў дзіравы кашалёк."},
	{7, "7 Так кажа Гасподзь Саваоф: павярнеце сэрца ваша на дарогі вашыя."},
	{8, "8 Узыдзеце на гару і насеце дрэвы і будуйце храм: і Я буду дабраволіць яму і праслаўлюся, кажа Гасподзь."},
	{9, "9 Чакаеце шмат, а выходзіць мала, і што прынесяце дамоў, тое Я разьвею. За што кажа Гасподзь Саваоф: за Мой дом, які ў запусьценьні, тым часам як вы бяжыце - кожны да свайго дома."},
	{10, "10 Якраз таму неба і зачынілася і не дае вам расы, і зямля не дае сваіх утвораў."},
	{11, "11 І я наклікаў суш на зямлю, на горы, на хлеб, на вінаградны сок, на алей і на ўсё, што родзіць зямля, і на чалавека і на быдла і на ўсякую ручную працу."},
	{12, "12 І паслухаліся Зарававэль, сын Салафіілеў, і Ісус, сын Ясэдэкаў, і ўвесь астатні люд голасу Госпада Бога свайго і слоў Агея прарока, як пасланага Госпадам Богам іхнім, і люд убаяўся Госпада."},
	{13, "13 Тады Агей, весьнік Гасподні, пасланы ад Госпада, сказаў люду: Я з вамі! кажа Гасподзь."},
	{14, "14 І абудзіў Гасподзь дух Зарававэля, сына Салавіілевага, упраўцы Юдэі, і дух Ісуса, сына Ясэдэкавага, вялікага іярэя, і дух усёй рэшты людзей - і яны прыйшлі і пачалі рабіць працу ў доме Госпада Саваофа, Бога свайго,"},
	{15, "15 на дваццаць чацьвёрты дзень шостага месяца, на другім годзе цара Дарыя."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
static void view2() {
struct be2 poems[] = {
	{1, "1 На сёмым месяцы, у дваццаць першы дзень месяца, было слова Гасподняе праз Агея прарока:"},
	{2, "2 скажы цяпер Зарававэлю, сыну Салафіілеваму, упраўцу Юдэі, і Ісусу, сыну Ясэдэкаваму, вялікаму іярэю, і рэшце народу:"},
	{3, "3 хто застаўся паміж вамі, які бачыў гэты дом у ранейшай ягонай славе, і якім вы бачыце яго цяпер? Ці ня ёсьць ён у вашых вачах як бы нічым?"},
	{4, "4 Але падбадзёрся сёньня, Зарававэль, кажа Гасподзь, падбадзёрся, Ісусе, сыне Ясэдэкаў, вялікі іярэй! падбадзёрся, увесь народзе зямлі, кажа Гасподзь, і рабеце працу, бо Я з вамі, кажа Гасподзь Саваоф."},
	{5, "5 Запавет Мой, які Я заключыў з вамі пасьля выхаду вашага зь Егіпта, і дух Мой жыве сярод вас: ня бойцеся!"},
	{6, "6 Бо так кажа Гасподзь Саваоф: яшчэ раз, - і гэта будзе неўзабаве, - Я патрасу неба і зямлю, мора і сушу,"},
	{7, "7 і патрасу ўсе народы - і прыйдзе Жаданы ўсім народам, і напоўню дом гэты славаю, кажа Гасподзь Саваоф."},
	{8, "8 Маё срэбра і Маё золата, кажа Гасподзь Саваоф."},
	{9, "9 Слава гэтага апошняга храма будзе большая, чым ранейшага, кажа Гасподзь Саваоф; і на месцы гэтым Я дам мір, кажа Гасподзь Саваоф."},
	{10, "10 На дваццаць чацьвёрты дзень дзявятага месяца, на другім годзе Дарыя, было слова Гасподняе праз Агея прарока:"},
	{11, "11 так кажа Гасподзь Саваоф: спытайся ў сьвятароў пра закон і скажы:"},
	{12, "12 калі хто нёс сьвяшчэннае мяса ў крысе вопраткі сваёй і крысом сваім дакрануўся да хлеба, альбо да чаго-небудзь гатаванага, альбо да алею, альбо якой-небудзь ежы, - ці зробіцца гэта сьвяшчэнным? І адказвалі сьвятары і сказалі: не."},
	{13, "13 Потым сказаў Агей: а калі дакранецца да ўсяго гэтага хто-небудзь апаганены ад дакрананьня да мерцьвяка, ці зробіцца гэта нячыстым? І адказвалі сьвятары і сказалі: будзе нячыстае."},
	{14, "14 Тады адказваў Агей і сказаў: такі гэты народ, такое племя перад Мною, кажа Гасподзь, і такія ўсе дзеі рук іхніх! І што яны прыносяць там, усё нячыстае."},
	{15, "15 Цяпер павярнеце сэрца ваша на час ад гэтага дня і назад, калі яшчэ ня быў пакладзены камень на камень у храме Гасподнім."},
	{16, "16 Прыходзілі, бывала, да капіцы, якая можа прыносіць дваццаць мераў, і аказвалася толькі дзесяць; прыходзілі да чавільні, каб начэрпаць пяцьдзясят мераў з чавільні, а аказвалася толькі дваццаць."},
	{17, "17 Караў Я вас іржою і блякласьцю хлеба і градам усю працу рук вашых глуміў; але вы не зьвярталіся да Мяне, кажа Гасподзь."},
	{18, "18 Адвярнеце ж сэрца ваша на час ад гэтага дня і назад, ад дваццаць чацьвёртага дня дзявятага месяца, ад таго дня, калі закладзены быў храм Гасподні; адвярнеце сэрца ваша:"},
	{19, "19 ці ёсьць яшчэ ў засеках насеньне? Дагэтуль ні вінаградная лаза, ні смакоўніца, ні гранатавае дрэва, ні масьліна не давалі плоду; а з гэтага дня я дабраслаўляю іх."},
	{20, "20 І было слова Гасподняе да Агея другі раз у дваццаць чацьвёрты дзень месяца, і сказана:"},
	{21, "21 скажы Зарававэлю, упраўцу Юдэі: патрасу Я неба і зямлю;"},
	{22, "22 і скіну троны царстваў і вынішчу сілу царстваў язычніцкіх, перакулю калясьніцы і тых, што сядзяць на іх, і скінутыя будуць коні і верхаўцы іхнія, кожны мечам другога."},
	{23, "23 У той дзень, кажа Гасподзь Саваоф, Я вазьму цябе, Зарававэль, сыне Салафіілаў, раб Мой, кажа Гасподзь, і буду трымаць цябе як пячатку, бо Я выбраў цябе, кажа Гасподзь Саваоф."},
};
size_t npoems = sizeof poems / sizeof poems[0];size_t i;for (i=0; i < npoems; ++i) {printf("%s\n", poems[i].msg);}
}
};